{"id":"828a1af8-00f1-484a-8641-312461819d4f","name":"Modern Languages (German with Spanish)","code":"RXG1","qualification":"pgde_with_qts","startDate":"2022-09-01T09:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_19","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"fbb00c08-2dbc-4f26-adb3-3b23afba18c1","code":"17","name":"German"},{"id":"e34fd2a3-a32e-44e9-aea1-666badf3ac03","code":"22","name":"Spanish"}],"locations":[{"id":"52d63954-6cf1-435e-8a5d-b6b0e68414a8","name":"Main Site","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"64b405f8-bd51-4fc6-b6a4-c4203adb0fce","name":"The University of Sheffield","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"e9a0017c-30b5-4fdb-94bd-13671aa035cc","name":"Main Site","isPublished":"true","status":"running","vacancies":"full_time"}],"trainingProvider":{"id":"7d0c173d-d084-47d1-8aea-909930227991","code":"S18","name":"The University of Sheffield"},"profPost":"PG","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"If less than 50% of your degree is in your specialist subject you will be required to undertake an SKE course as a condition of entry.\n\nAs this is an 11-19 course we are preparing students to teach up to A-level and will normally take into account the balance of your degree content and profile of GCSE and A-level (or equivalent) subjects and results to assess your suitability for the programme.\n\nIf you have non-standard qualifications you are welcome to contact us to discuss your eligibility.","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We do not accept equivalency tests from third party organisations. If you are required to take an equivalency test, we will provide full details about our own test(s) at interview.  There is no charge for our tests.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Teaching is an extremely rewarding and challenging career. Our course is designed to provide you with the knowledge, understanding and skills that you need to be an outstanding teacher.\r\n\r\nWhile we may be one of the oldest higher education institutions in the UK, we’re also a modern and innovative institution, with a well-deserved reputation for the quality of our education. The Faculty of Education and Children’s Services has been awarded 'Outstanding' status by Ofsted, credited with delivering \"high levels of academic and pastoral care\" - Ofsted Report 2016.\r\n\r\nWe offer two routes: the Core (University-led) Route, and the School Direct Route.\r\n\r\nThe Core (University-led) Route is a one-year, full-time course that leads to a Postgraduate Certificate in Education (PGCE Secondary). Successful completion also results in the completion of three M level modules which may be used towards a Master's degree.\r\n\r\nFor the School Direct Route, we work with a number of leading partnership schools to educate teachers. The professional aims of our School Direct courses are to produce high-quality teachers who are committed to learning, and are open-minded, creative and reflective in their practice. The course comprises two main elements:\r\n\r\n* 60 professional learning days\r\n* 120 (minimum) school-based learning days\r\n\r\nThe intention of School Direct is for leading schools to recruit and educate candidates in subject and age phases most in need of employment and choose how the Initial Teacher Education (ITE) programme should be delivered in partnership with the University.\r\n\r\nThe Subject Enrichment Week for Modern Languages trainees has allowed individuals to pursue specific directed work in their chosen countries. Many trainees choose to visit schools abroad to look at how languages are taught. It offers a welcome opportunity to brush up on second language proficiency and collect resources for use in the classroom.\r\n\r\nProfessional and academic learning takes place within University and partnership settings in lectures, seminars, practical workshops and tutorials, and is assessed through assignments and directed activities.\r\n\r\nSchool-based learning will move you from observation through group work to whole class teaching, and is assessed holistically against the Teachers’ Standards.\r\n\r\nYou will be expected to undertake 10 independent preparation and consolidation study hours (minimum) per week for the University course, in addition to full teaching days when on placement.","interviewProcess":"During the PGCE interview process, the course tutors will be looking for a wide range of qualities that would make you a good teacher. These qualities include a passion for teaching, confidence, resilience, adaptability and good communication skills to name just a few. In preparation for your interview, you may wish to develop your understanding of current educational issues as well as those relating specifically to your subject area. On the day we will be looking for your enthusiasm for teaching young people and your ability to reflect on your experiences of education. \r\n\r\nThe interview process will be used to determine your suitability for teaching and includes \r\n•\tan introduction to the course, \r\n•\tidentity checks,\r\n•\ta short presentation of a teaching task relating to your subject, \r\n•\ta subject knowledge activity,\r\n•\tan individual interview.\r\n\r\nYou may also be asked to complete a group activity if applicable to your subject.  \r\n\r\nAll candidates will be sent further information about what will be expected prior to the interview date. \r\n","howSchoolPlacementsWork":"We have approximately 500 schools that we partner with. The schools you will be teaching in are selected on the basis of their ability to offer:\r\n\r\n* good support to trainee teachers; and\r\n* an Ofsted report that shows 'Good' teaching is in place.\r\n\r\nThe age range you will be teaching will be 11 to 18 years old.\r\n\r\nYou will have a minimum of two mainstream placements, as well as additional enrichment placements.\r\n\r\nYour travel from home to your school will take no more (and usually less) than 1 hour 15 minutes.","personalQualities":"","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:51:07.017Z","updatedAt":"2021-09-15T09:37:01.242Z"}