{"id":"e3321641-c245-4c07-98eb-164517c061fc","name":"Physics with Mathematics","code":"F3GX","qualification":"pgde_with_qts","startDate":"2022-09-01T09:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_19","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"bf97cd0a-224c-43d3-a021-84143df13e8d","code":"F3","name":"Physics"},{"id":"72345aa7-096c-488f-8649-085b8178cadb","code":"G1","name":"Mathematics"}],"locations":[{"id":"c9ee5046-3f49-4804-991b-e99bbe8b2247","name":"Main Site","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"6369a82f-107c-49b9-af0d-6e16fa1d1d41","name":"Main Site","isPublished":"false","status":"new","vacancies":"full_time"},{"id":"b84b0abe-d54f-45a3-a82e-1b28f02e869d","name":"Faculty of Health and Education (Manchester)","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"b1e78309-45ff-4257-b300-c803621510d7","name":"Main Site","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"cfb3051a-28e9-43cd-bae3-a262f6d49d9a","name":"LJMU School of Education","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"2430e919-84cf-48e3-ab06-8e9bc7982376","name":"Highfield Campus","isPublished":"false","status":"new","vacancies":"full_time"},{"id":"dc4b9d68-b157-4d09-ae46-fcc4f5db9f20","name":"Main Site","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"c6a12566-3e58-44c0-bbbb-c4c169770ec5","name":"University of Brighton Falmer campus","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"f024c53d-e458-4ca3-b3e6-33f5793aa8ac","name":"Institute of Education, University of Reading","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"8717f2f6-871e-4e8b-b461-2b4c37cde5a0","name":"Main Site","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"64b405f8-bd51-4fc6-b6a4-c4203adb0fce","name":"The University of Sheffield","isPublished":"true","status":"running","vacancies":"full_time"}],"trainingProvider":{"id":"7d0c173d-d084-47d1-8aea-909930227991","code":"S18","name":"The University of Sheffield"},"profPost":"PG","degreeGrade":"2","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"If less than 50% of your degree is in your specialist subject you will be required to undertake an SKE course as a condition of entry.\n\nAs this is an 11-19 course we are preparing students to teach up to A-level and will normally take into account the balance of your degree content and profile of GCSE and A-level (or equivalent) subjects and results to assess your suitability for the programme.\n\nIf you have non-standard qualifications you are welcome to contact us to discuss your eligibility.","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We do not accept equivalency tests from third party organisations. If you are required to take an equivalency test, we will provide full details about our own test(s) at interview.  There is no charge for our tests.","courseLength":"OneYear","feesUK":9250,"feesInternational":19800,"aboutCourse":"Located in the heart of London, PGCE courses at King’s are rated Outstanding by Ofsted with excellent tutors on hand to support you through your training. In the last research assessment exercise, the department was rated second in the UK (REF, 2014). You will have the opportunity to work with experienced tutors who are actively engaged in research in their subject and in pedagogy more widely. \r\n\r\n74% graduates of 2021 who sought teaching posts were employed within 6 months of qualifying. \r\n\r\nIn our 2021 student survey, 100% of Science trainees rated the quality of their training as excellent, very good or good.\r\n\r\nThe special features of the PGCE science programmes at King’s are:\r\n\r\n - Separate groups for each of the four science specialisms: Biology, Chemistry, Physics and Physics with Mathematics. These focus on how to teach your specialist subject to the age range 11-18.\r\n - Sessions designed to help you teach science topics which are outside your science subject specialism. These are designed to help you contribute to science programmes at Key Stage 3 and 4.\r\n - 'Science Pedagogy' sessions where you work in mixed groups of science students on topics like scientific enquiry, formative assessment, use of discussion in science lessons and cognitive acceleration through science education. These classes are often taught by people who are at the forefront of research about innovative teaching strategies. The Science Education research group at King's is the largest in the UK and has a strong national and international reputation. This allows us to feed new ideas into the PGCE programme and creates a dynamic and forward-looking course. \r\n - The course is set in the context of a friendly department with a strong commitment to our students.\r\n","interviewProcess":"The selection process will  involve an interview, a group task and a short piece of writing.\r\n\r\nIn interview and group task we will be looking for:\r\n\r\n - evidence that you have a commitment to working with young people;\r\n - ability to explain clearly and to think on your feet;\r\n - evidence of good interpersonal skills;\r\n - knowledge of school level science in each of biology, chemistry and physics;\r\n - familiarity with the realities of teaching science in secondary schools;\r\n - awareness of current educational issues;\r\n - commitment to equal opportunities;\r\n - ability to work well in a group dynamic.\r\n\r\nIn your writing we will be looking for:\r\n\r\n - ability to express yourself clearly;\r\n - accurate grammar and spelling\r\n","howSchoolPlacementsWork":"You will have two different school placements during the course. We work with a large number of schools around London and Greater London and we select school placements carefully, taking into account the teachers who act as mentors and the subjects they offer. \r\n\r\nWe try to ensure that all trainees have a reasonable journey to school and to ensure that you have a balanced teaching experience including the full secondary age (11-18) and ability range.","personalQualities":"We are looking for people with:\r\n\r\n - commitment to teaching;\r\n - good communication skills (oral and written);\r\n - good interpersonal skills;\r\n - good knowledge of science in the specialist science chosen and potential to teach this up to A level;\r\n-  a good knowledge of science in most of the areas of the National Curriculum for Science and potential to develop competence to contribute to a science programme up to age 16 (Key Stage 4);\r\n - an ability to explain science clearly;\r\n - potential to manage young people effectively;\r\n - awareness of current educational issues;\r\n - commitment to equal opportunities.\r\n","otherRequirements":"The Department for Education requires the Disclosure and Barring Service (formerly the Criminal Records Bureau) to vet the background of persons working in their schools. Candidates offered a place on a PGCE course will be asked to complete an enhanced check with the DBS to ensure they do not have a criminal background which might prevent them from working as a teacher. This must be completed before you register on the programme.\r\n\r\n","status":1,"createdAt":"2021-07-06T10:53:33.365Z","updatedAt":"2021-10-01T15:19:21.406Z"}