{"id":"7a1206c4-03fe-4fbe-b963-c9c204f0c022","name":"Primary","code":"2W6F","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"16d92235-8c40-4d8b-b678-fe42f8afaabe","name":"Keighley - Merlin Top Primary Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"af86e943-1d27-42eb-88ae-0c18516b69a4","name":"Stockton - Frederick Nattrass Primary Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"4386361a-e48d-4f7a-8bf2-bad994bdb71d","name":"Halifax - Abbey Park Primary Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"51384fe4-7bb3-425d-9dc5-24669281ba90","name":"Halifax - Mount Pellon Primary Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"f1faaac8-f2df-46a2-b145-a09d5d56cfe1","name":"Redcar and Cleveland - Badger Hill Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"d1b03b4c-faa4-41ec-96bf-f3034897140a","name":"Stockton - The Oak Tree Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"332a5a79-be3b-44c8-8208-05c948337a6a","name":"Redcar and Cleveland - Whitecliffe Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"67c1b98c-2596-43d5-8d34-39a026cafa30","name":"Newcastle upon Tyne - Hilton Primary Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"94630cc6-85aa-4778-a6c5-90fe0468c3d2","name":"Stockton - Norton Primary Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"a64a0ef5-e414-4277-b483-5c12cff8338b","name":"Bolton - The Ferns Primary Academy","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"b0ac70c9-a96a-42e7-9784-362e4cf70588","code":"1UR","name":"Northern Education Trust"},"accreditedBody":{"id":"4808c596-11e0-4586-8cb4-116a1d9838b3","code":"E65","name":"Educate Group Initial Teacher Training"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":9250,"feeDetails":"The QTS programme with PGCE costs £9,250, for which a student tuition fee loan can be accessed.\r\n","aboutCourse":"Primary (3-11) trainees can choose to train in either the 3-7 or 5-11 age range.  Trainees spend a full-time year teaching and training in schools, but also attend provider-led workshop sessions to enhance understanding of the curriculum, general classroom practice and teaching pedagogy.\r\nTraining days cover content such as Behaviour Management, an Environment for Learning, Planning and Adaptive Teaching, Diversity, Inclusion and SEND, Assessment, Improving Classroom Practice, ICT and e-safety, Phonics, Early Reading and Lifelong Literacy (SPAG).  A comprehensive programme of phase-specific subject knowledge development is also provided, both generically and personally tailored to trainees' individual needs.\r\nAll trainees submit three assignments throughout the year as an integral part of the teaching and assessment programme:\r\n1) A School Based Independent Study (Child Study)\r\n2) Teaching and Learning through a Scheme of Work\r\n3) Effective Assessment Strategies\r\nTrainees are supported to improve their knowledge, understanding and application of the Educate Initial Teacher Education (ITE) Curriculum, leading to the development of classroom practice skills and their professional teaching role.  Final assessment is made on a trainee's ability to meet the Teachers' Standards.\r\nSuccessful completion of the three assignments at Level 7 leads to the award of 60 Master's credits and a PGCE, in addition to QTS, validated by Leeds Beckett University.\r\nThe structure of the course means that front-loaded training time is gradually overtaken by the hours spent teaching:\r\nTerm 1: 7 hours teaching, 2 days training each week\r\nTerm 2: 11 hours teaching, 1.5 days training each week\r\nTerm 3: 17 hours teaching, 1 day training each week\r\nThis means that trainees are fully prepared for life as an NQT.\r\n","interviewProcess":"Applicants are interviewed by representatives of the Northern Education Trust in association with Educate Teacher Training.\r\nAfter application, suitable candidates are invited to a selection event hosted by a school in the Northern Education Trust.  The selection event consists, as a minimum, of the assessment of personal qualities and attributes, the assessment of the ability to communicate effectively, an assessment of the literacy and numeracy skills required to teach, an evaluation of current educational knowledge and understanding, a presentation and an interview.","howSchoolPlacementsWork":"Trainees spend the majority of the year in their base training school but have a six-week placement in a contrasting school, usually within the trust. The programme is also supplemented by shorter placement visits to a special school, a 0-3 setting, a Secondary setting and a school with good EAL provision.","personalQualities":"We are looking for confident and capable applicants who demonstrate true commitment to a teaching career and a robust, determined, positive attitude. We are looking for trainees who can fit very well into their school team, who can respond positively to feedback and who can make a valuable contribution to school life. We are not looking for a 'finished product' but for trainees who demonstrate real potential to succeed. Candidates should be able to communicate effectively with a whole range of people and be engaging, warm and sociable. They should be organised, prepared and professional.","otherRequirements":"Enhanced Criminal Record Check","status":1,"createdAt":"2021-07-06T10:49:01.537Z","updatedAt":"2021-08-25T13:01:27.333Z","canSponsorStudentVisa":"no","cycle":"2024"}
