{"id":"61bc9617-42ee-49c4-9f3e-7df920c7d6b2","name":"Primary with SEND","code":"K977","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"other","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"yes","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"ef9a7c47-e2f4-4891-8cd5-7851e6f285ce","name":"Castle Hill School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"61484b90-d0fa-41a1-9695-e505591696fc","code":"4C4","name":"Castle Hill School"},"accreditedBody":{"id":"9be9f611-2d36-431a-9109-7fcbbfc88fc8","code":"C99","name":"University of Cumbria"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feesInternational":9250,"financialSupport":"\r\n","aboutCourse":"Our School Direct programme provides you with the opportunity to be immersed into life in a Primary or Special School. This is a full time course where you will become part of the staff team, observing, supporting and team teaching alongside highly skilled practitioners. You will experience first-hand the wider professional responsibilities of a teacher as you become involved the wider school including, CPD events and a range of whole school events. Students will spend 3 days per week in their host schools when not on placement.\r\nAlongside this you will receive 2 days per week of high quality training around pedagogy and practice delivered by experienced teachers and University tutors.\r\nOpportunities for trainees to work or study collaboratively is a focus of our training programme. We also provide opportunities to attend relevant CPD events as well as team building activities across the year.\r\nSEND Students will spend each term in a different school (2x Specialist and 1x mainstream) undertaking an assessed placement in each setting. Students will have a mentor in each school. Further support is also available through the University Partnership Lead and the Programme Partnership Lead.\r\nOur Primary PGCE with QTS programme is run in partnership with the University of Cumbria. During this course you will undertake two 30-credit masters level modules to gain a PGCE. These modules are practically focused and titled ‘Raising the Achievement of Children’ and ‘High Quality Learning and Teaching’. They involve a total of 3 written assessments, one of which is a formative piece to support your academic development. The modules are taught by University of Cumbria lecturers who ensure that theory and practice are closely entwined to inform your teaching and provide a toolkit to take forward in your career.\r\nThis collaborative approach to teacher training ensures that students have access to both excellent school-based practice and well-regarded academic input which has been planned to create a coherent and valuable learning experience. This training is delivered by the University of Cumbria within our alliance based in Kirklees\r\n\r\n","interviewProcess":"Castle Hill School works in conjunction with the University of Cumbria to select suitable candidates to take through to our interview process. This will include initial safeguarding checks and whether candidates meet minimum entry requirements.\r\nIf selected for interview you will be invited to attend for an interview at one of the Specialist schools. The interview will consist of an academic task, a 20 minute mini teach and a formal interview.\r\n","howSchoolPlacementsWork":"There are 3 formal assessed placements as part of the programme.\r\n-4 weeks placement in the autumn term( Beginning)\r\n-5 week placement in the spring term(Developing)\r\n-9 week placement in the summer term(Extending)\r\nYou will be required to teach in 2 different age phases and in 3 different school settings.\r\nSchools are allocated following a discussion around where a student lives, ability to travel and specific needs which might impact on the placement. Students are not expected to find their own placements.\r\nStudents are supported through their placements by a school based mentor. A personal tutor is also allocated to each student to support them throughout the programme. There are a number of observations carried out followed by reflective feedback and evaluation. All students work with their mentor to set targets against the teaching standards throughout their placement\r\n","personalQualities":"We are looking for candidates who have a passion for teaching, someone who enjoys a challenge and who puts children and their needs first. Experience of working with children or young people in either a paid or voluntary capacity is desirable however not essential. If accepted onto our course we may be able to offer the opportunity to gain additional experience in one of our alliance schools. ","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:48:24.470Z","updatedAt":"2021-10-04T11:24:00.283Z","canSponsorStudentVisa":"yes","cycle":"2024","applicationsOpenDateOther":"2021-10-14T00:00:00.000Z"}
