{"id":"971ace64-5f1b-4b9a-9244-46348b289072","name":"Physics","code":"3BDG","qualification":"pgce_with_qts","startDate":"2024-07-31T23:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"bf97cd0a-224c-43d3-a021-84143df13e8d","code":"F3","name":"Physics"}],"locations":[{"id":"ec1e9e74-2da8-4bff-b225-aa4e87db7630","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"c0a0becb-89dd-4f19-b72b-3bac4db1e876","code":"2KR","name":"Futures Teaching"},"accreditedBody":{"id":"ef09ce50-ccfc-4346-a0ce-43e840153dab","code":"W20","name":"The University of Warwick"},"profPost":"BO","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"Your degree subject should be in Physics or a similar subject. Otherwise you will need to prove your subject knowledge in some other way.","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"The University of Warwick accepts 3rd party tests from the following approved companies: \n\n-Equivalency Testing. Offer a discounted rate £160 (normal price £175).\n\n-A Star Equivalency. Offer a special rate for The University of Warwick applicants for equivalency exams (all subjects) to be booked for £139 (normal price £165) Please contact cte.admissions@warwick.ac.uk for discount code.","courseLength":"OneYear","feesUK":9250,"feeDetails":"When you start your non-salaried teacher training, you won’t have to pay the cost of tuition fees up front. You can apply for a Tuition Fee Loan to cover the full cost of your course, which is paid directly to your training provider from Student Finance England. Tuition Fee Loans aren't means tested, so regardless of your household income you should be able to claim the full amount for your course fees. \r\n\r\nTo qualify for a scholarship you’ll need a degree of 2:1 or above in  a related subject. For a bursary you’ll need a 2:2 or above in a relevant subject. \r\n\r\nYou can’t claim both a bursary and a scholarship - you can only claim one.\r\n\r\nFind out how to apply for a scholarship: [getintoteaching.education.gov.uk/funding-and-salary/overview/scholarships](https://getintoteaching.education.gov.uk/)  You don’t need to apply for a bursary - if you’re eligible, you’ll automatically start receiving it once you begin your course. Find out how you’ll be paid: [getintoteaching.education.gov.uk/funding-and-salary/overview/hoe-you-will-get-paid](https://getintoteaching.education.gov.uk/)\r\n\r\nYou may also be eligible for a loan while you study – note that you’ll have to apply for undergraduate student finance: [GOV.UK](https://gov.uk)\r\n\r\nFind out about financial support if you’re from outside the UK: [getintoteaching.education.gov.uk/explore-my-options/overseas-graduates](https://getintoteaching.education.gov.uk/)\r\n\r\n\r\n","aboutCourse":"The School Direct (training) PGCE, although an academic qualification, is rooted in gaining practical experience.  School Direct Physics teacher training with Futures Teaching will equip you with the skills to support and inspire students.  Studying physics strengthens quantitative reasoning and problem solving skills that are valuable in areas beyond physics.\r\n\r\nOur goal is to ensure that all of our ITT trainees graduate prepared and inspired to create an exceptional learning experience for every child in school. We encourage a caring and supporting ethos through strong partnerships with our alliance schools. We  see our trainees as individuals and will support, challenge and nurture you to become a confident and reflective practitioner in the classroom. No two types of support are the same and this unique approach will allow you to maximise your training year ready to begin your teaching career confident and ready to teach. During your placements you will be able to teach contemporary methods and practices across a range of ages and abilities. Through a structured programme of observation, joint planning and delivery of lessons you will gradually build up to whole class teaching. \r\n\r\nMost significant of choosing School Direct (training) is that you get to have a say in which school within the alliance you are placed. We work with you from the start to find the school that suits you and matches your location. \r\n\r\nAfter Christmas there will also be a complementary placement at one of the other alliance schools. This is an opportunity to develop your practice further. These complementary placements will also offer a contrast in key stage and school context.\r\n\r\nThis is an intensive and demanding course, which offers superb preparation for anyone who is committed to educating young people.  On finishing your training you will be awarded Qualified Teacher Status and 90 credits towards a Master's in Education.\r\n\r\nThere is also a strong possibility that trainees will be offered a position at their school at the end of the training year, or within Futures Teaching. \r\n\r\n[futuresteachingalliance.co.uk] (https://www.futuresteachingalliance.co.uk/)\r\n\r\n","interviewProcess":"The interview process is a chance for you to meet us, as well as us you. We hold interviews in a variety of alliance schools, giving you a chance to see the pupils, meet the Futures Teaching team and also specific school staff who will potentially be supporting you through your training and beyond.  The interview may be online.\r\n\r\nYou will be required to attend one interview. Interviews can include:\r\n* Exploration of curriculum knowledge\r\n* Discussions about relevant experiences\r\n* A presentation or small teaching exercise\r\n* Written or verbal discussion on literacy/numeracy knowledge\r\n\r\nPrior to the interview you will be given a topic for a teaching task on which to base a micro lesson. This topic will be delivered to a small group of students. This is an opportunity for you to demonstrate your wider skills, attitude, aptitude and resilience that can be developed over the training year, rather than assessing specific teaching ability at this stage. You are not a trained teacher and will not be judged as such. Potential to teach is the focus of this exercise.\r\n\r\nTowards the end of the interview we will discuss next steps with you; what choices of school you may have, how you can potentially accept our offer and how you can, if you wish, keep in touch with your chosen school, so that when you start the following September you are confident knowing the staff and pupils.","howSchoolPlacementsWork":"Futures Teaching consists of an alliance of primary and secondary schools. We have long established and loyal partnerships with a wide variety of secondary and primary schools, across a wide geographic area, including Coventry, Hinckley, Leamington Spa, Warwick, Rugby and South Warwickshire.\r\n\r\nThe alliance will endeavour to allocate school placements located most conveniently to the residence of the trainee. To qualify for QTS we will provide trainees with sufficient time in school to demonstrate they have achieved all the Teacher Standards. You will train in the 11 to 16 age range, however in many of our alliance schools there will be the opportunity to experience Post 16 too.\r\n\r\n80% of a trainee's timetable will be in the placement school, with some time  at university. You will work closely with your Subject Mentor, with weekly one to one meetings to monitor your progress throughout your placements. You will slowly take over a varied timetable, experiencing different year groups and abilities. A range of class teachers will be on hand to support you with your Subject Mentor being your consistent and constant guide.\r\n \r\nGenerally there will be a complementary placement during the Spring Term, lasting approximately  6 weeks. This will be an opportunity to learn within a new school context and gain exposure to a new range of teaching and learning strategies to develop your practice further. Second placement schools will also offer a contrast in key stage and school context. You will be given the opportunity to visit this school prior to the placement to meet key colleagues.\r\n\r\nWe offer twilight bespoke training sessions to allow you to reach your potential. ","personalQualities":"Personal qualities we are looking for include:\r\n\r\n* Energetic\r\n* Good communication\r\n* Ability to inspire and enthuse\r\n* Strong organisation\r\n* Imagination and creativity\r\n* Confidence and resilience.","otherRequirements":"Applicants must meet the Department for Education’s Initial Teacher Training criteria, which means being medically fit, successfully completing an enhanced disclosure via the Disclosure and Barring Service (DBS) and satisfying any other safeguarding checks required by this course.\r\n\r\nWhile not essential, you may wish to gain some school experience before attending interview.\r\n\r\nIf you are a graduate and wish to train as a teacher but your degree did not provide enough subject specific content for you to gain automatic entry, you may be required to complete a Subject Knowledge Enhancement (SKE) course.","status":1,"createdAt":"2021-07-06T10:51:57.639Z","updatedAt":"2021-09-15T10:15:23.502Z","canSponsorStudentVisa":"yes","cycle":"2024"}
