{"id":"fdd98b62-8ddd-4f8a-afdb-f292b1681d15","name":"History","code":"AW83","qualification":"pgce_with_qts","startDate":"2024-07-31T23:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"5a3609a0-5bbb-4377-b919-5d89932ab622","code":"V1","name":"History"}],"locations":[{"id":"ec1e9e74-2da8-4bff-b225-aa4e87db7630","name":"Main Site","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"c0a0becb-89dd-4f19-b72b-3bac4db1e876","code":"2KR","name":"Futures Teaching"},"accreditedBody":{"id":"6019b3ce-f2f6-4b0e-b2a9-5813d74c4d54","code":"W80","name":"University of Worcester"},"profPost":"PG","english":"3","maths":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feeDetails":"When you start your non-salaried teacher training, you won’t have to pay the cost of tuition fees up front. You can apply for a Tuition Fee Loan to cover the full cost of your course, which is paid directly to your training provider from Student Finance England. Tuition Fee Loans aren't means tested, so regardless of your household income you should be able to claim the full amount for your course fees. With a scholarship or bursary, you’ll also get early career payments of £2,000 in your second, third and fourth years of teaching (£3,000 in some areas of England).\r\n\r\nTo qualify for a scholarship you’ll need a degree of 2:1 or above in Mathematics or a related subject. For a bursary you’ll need a 2:2 or above in any subject. \r\n\r\nYou can’t claim both a bursary and a scholarship - you can only claim one.\r\n\r\nFind out how to apply for a scholarship: [getintoteaching.education.gov.uk/funding-and-salary/overview/scholarships](https://getintoteaching.education.gov.uk/)  You don’t need to apply for a bursary - if you’re eligible, you’ll automatically start receiving it once you begin your course. Find out how you’ll be paid: [getintoteaching.education.gov.uk/funding-and-salary/overview/hoe-you-will-get-paid](https://getintoteaching.education.gov.uk/)\r\n\r\nYou may also be eligible for a loan while you study – note that you’ll have to apply for undergraduate student finance: [GOV.UK](https://gov.uk)\r\n\r\nFind out about financial support if you’re from outside the UK: [getintoteaching.education.gov.uk/explore-my-options/overseas-graduates](https://getintoteaching.education.gov.uk/)\r\n\r\n\r\n","aboutCourse":"The School Direct (training) PGCE, although an academic qualification, is rooted in gaining practical experience.  School Direct History teacher training with PKTSA will equip you with the skills to  support and inspire students around history, making it enjoyable whilst equipping them with the skills they will need for the future.\r\n\r\nWe will support, challenge and nurture you to become a confident and reflective practitioner in the classroom, able to teach contemporary methods and practices across a range of ages and abilities on a daily basis. All this alongside gaining a theoretical understanding of teaching and learning. \r\n\r\nThe huge benefit in choosing School Direct (training) is that you get to have a say in which school , within the alliance, you are placed in. We work with you from the start to find the school which suits you and which matches your location. There will also be a complementary placement at one of our alliance schools.\r\n\r\nThis is an intensive and demanding course, which offers superb preparation for anyone who is committed to educating young people.  On finishing your training you will be awarded Qualified Teacher Status and 60 credits towards a Master's in Education.\r\n\r\nThere is also a strong possibility that trainees will be offered a position at their school at the end of the training year, or within the President Kennedy School Teaching Alliance. \r\n\r\n[presidentkennedytsa.co.uk](https://www.presidentkennedytsa.co.uk)\r\n\r\n","interviewProcess":"The interview process is a chance for you to meet us, as well as us you. We hold interviews in a variety of alliance schools, giving you a chance to see the pupils, meet the PKTSA team and also specific school staff who will potentially be supporting you through your training and beyond. The interview may be on line.\r\n\r\nYou will be required to attend one interview. Interviews can include:\r\n* Exploration of curriculum knowledge\r\n* Discussions about relevant experiences\r\n* A presentation or small teaching exercise\r\n* Written or verbal discussion on literacy/numeracy knowledge\r\n\r\nPrior to the interview you will be given a topic for a teaching task on which to base a micro lesson. This topic will be delivered to a small group of students. This is an opportunity for you to show your wider skills, attitude, aptitude and resilience that can be developed over the training year, rather than assessing specific teaching ability at this stage. We know you are not a trained teacher and will not be judging you as such, just looking for your potential.\r\n\r\nNear the end of the interview we will discuss next steps with you; what choices of school you may have, how you can potentially accept our offer and how you can, if you wish, keep in touch with your chosen school, so when you start the following September you are confident knowing the staff and pupils.","howSchoolPlacementsWork":"President Kennedy consists of an alliance of over 20 primary and secondary schools, across a wide geographic area; Coventry, Hinckley, Leamington Spa and Warwick. The Alliance will endeavour to allocate school placements located most conveniently to the residence of the trainee.\r\n\r\n80% of the trainee's timetable will be in the placement school, with some time  at university.  Generally there will be a complementary placement during the Spring Term, lasting approximately  6 weeks. You will be given the opportunity to visit this school prior to the placement to meet key colleagues.\r\n\r\nYou will slowly take over a varied timetable, different year groups and abilities. A range of class teachers will be on hand to support you with your subject mentor being your consistent and constant guide. \r\n\r\nWe offer twilight bespoke training sessions to allow you to reach your potential. ","personalQualities":"Personal qualities we are looking for include:\r\n\r\n* Energetic\r\n* Good communicator\r\n* Able to inspire and enthuse\r\n* Good organiser\r\n* Imaginative and creative\r\n* Confident and resilient.","otherRequirements":"Applicants must meet the Department for Education’s Initial Teacher Training criteria, which means being medically fit, successfully completing an enhanced disclosure via the Disclosure and Barring Service (DBS) and satisfying any other safeguarding checks required by this course.\r\n\r\nWhile not essential, you may wish to gain some school experience before attending interview.\r\n\r\nIf you are a graduate and wish to train as a teacher but your degree did not provide enough subject specific content for you to gain automatic entry, you may be required to complete a Subject Knowledge Enhancement (SKE) course.","status":2,"createdAt":"2021-07-06T10:51:58.867Z","canSponsorStudentVisa":"yes","cycle":"2024"}
