{"id":"b990dadb-1bbe-4029-90bd-34d1b3bf9022","name":"Psychology","code":"C596","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"1878e739-30bb-4de9-841e-42dacfb1fa0c","code":"C8","name":"Psychology"}],"locations":[{"id":"ed00f653-b072-47b2-86c8-a721b49bf48f","name":"Leyes Lane","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"ac5991b9-3e98-4147-ae7c-624ea2969711","code":"241","name":"Kenilworth Partnership"},"accreditedBody":{"id":"62d5803b-89ca-4e21-bb6f-5c74944c56ad","code":"B25","name":"Birmingham City University"},"profPost":"PG","degreeGrade":"1","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feesInternational":22110,"feeDetails":"International students can obtain further information regarding fees via:\r\n\r\nhttps://www.bcu.ac.uk/international/contact-us","financialSupport":"We provide a laptop and school based resources to support you with your studies.","aboutCourse":"School Direct is a school-led initial teacher training (ITT) program; it provides fantastic experience if you want to train and learn “on the job”. \r\nYou’ll be part of a teaching team from the very start, receiving robust support from experienced teachers and mentors. \r\n\r\nAt the Kenilworth Partnership we offer a very bespoke training experience, allowing mentors the opportunity to develop your skills at a rate perfectly suited to your ability and confidence. \r\n\r\nThe school experience begins with lesson observations before progressing to team teaching and working with smaller focus groups. Your teaching timetable increases gradually throughout the year in discussion with Subject and Professional Mentors and is fully supported throughout by qualified practitioners. \r\n\r\nAs part of your training, you will have the opportunity to track both a Teaching Assistant and a pupil which enables you to experience school life from varying perspectives. You will experience a five-day placement in a primary school setting and two days in a special school environment. We will also arrange a second placement in one of our partner schools so that you can further develop your insight into contrasting teaching environments.\r\n\r\nIn addition to your school-based training, you will complete study blocks at Birmingham City University where you will access an outstanding academic program of study which will support you in understanding the theory behind your teaching practice.\r\n\r\nThe benefits of this course program includes:\r\n•\tAward of Qualified Teacher Status (QTS) and a Postgraduate \r\n        Certificate in Education (PGCE) from Birmingham City University\r\n•\tStrong mentor support\r\n•\tExcellent employment rates\r\n•\tAccess to a comprehensive in-school training program\r\n•\tRewarding career\r\n","interviewProcess":"Applications received are considered by the appointed host school. Should you be invited to interview you should anticipate being asked to prepare a short subject-related lesson. \r\n\r\nThe schools Professional Mentor and the Head of Department will join you for your lesson and will be happy to give you feedback in the interview which will follow.\r\n\r\nOur students are a credit to our school and participate well in this situation. You will be made very welcome!","howSchoolPlacementsWork":"The program includes a requirement for you to complete five days experience in a primary school setting. This enables you to experience KS2 pupils and understand their needs in readiness for transition to KS3. \r\n\r\nWe are happy for you to arrange this placement with a school of your choice although we do suggest that the five days are completed during the first half term of your course, before timetable commitments begin to increase.\r\n\r\nYour second complementary placement begins after the Christmas break. This will be arranged on your behalf is most likely to be in one of our alliance schools. We try, as far as possible, to take into account your transport considerations, but also to provide a contrasting environment to that of your host school.\r\n","personalQualities":"Additional qualities that we look for include:\r\n\r\n•\tPassion for learning and an interest in/knowledge of education\r\n•\tExcellent communication skills (both written and verbal)\r\n•\tAbility to stay calm and deal with stressful situations\r\n•\tDrive to succeed and resilience in the face of difficulty\r\n•\tBeing part of a team and working collaboratively\r\n•\tReflective practitioner who responds to feedback\r\n•\tICT competent and confident\r\n•\tInterests outside of education\r\n\r\n\r\n","otherRequirements":"•\tExperience in a school environment or working with young people, will \r\n        strengthen your application although this is not essential at application.\r\n\r\n•\tYou must also be successful in completing a Disclosure & Barring \r\n        Service (DBS) check.\r\n","status":1,"createdAt":"2021-07-06T10:51:06.207Z","updatedAt":"2021-10-08T15:58:09.186Z","canSponsorStudentVisa":"yes","cycle":"2024"}
