{"id":"0a1f3e16-5c7e-4fca-8c82-237cfd2077b5","name":"Drama","code":"25HD","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"69052223-ca45-4781-a8d3-cb92447a6d78","code":"13","name":"Drama"}],"locations":[{"id":"1034df8e-432a-4c9e-86f0-042605f85ac4","name":"Goldsmiths University","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"628cb861-f9fb-4433-8cfc-9d176095119c","code":"185","name":"The Royal Greenwich School Alliance"},"accreditedBody":{"id":"049fe65f-08dc-4686-9ac8-606dce490128","code":"G56","name":"Goldsmiths, University of London"},"profPost":"PG","degreeGrade":"1","additionalDegreeSubjectRequirements":"false","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feesInternational":14600,"aboutCourse":"The PGCE (QTS) programme at Goldsmiths has three distinct modules. These are: \r\n•\tSchool Experience (Level 6) \r\n•\tStudies and Professional Issues in Education (Level 7) \r\n•\tSubject Studies (Level 7) \r\n\r\nSchool Experience \r\nDuring the programme you will spend a minimum of 120 days in school. These days are divided into two block school experiences allowing you to develop a broad understanding of the role of the teacher in contrasting settings.  In addition to school placements you will spend the equivalent of 8 weeks in University. In this time you will have mix of lectures and small group seminars which are designed to support you in developing a strong and confident knowledge of your subject area.  \r\n\r\nUnderpinning the programme is the Professional Studies course which is designed to prepare you fully for the wider roles and responsibilities of the teacher. This programme will be enhanced by ongoing training during school experience and will include aspects such as: behaviour management, working with pupils with English as an Additional Language and Special Educational Needs.  Assessment of this module is through a portfolio of evidence and will require you to demonstrate your engagement across all eight of the Teachers’ Standards. \r\n\r\nThe Secondary PGCE (QTS) Programme at Goldsmiths is taught and assessed at Masters Level. In addition to a recommendation for QTS, if you pass all academic elements of the programme, you will also leave with 120 Masters level credits which is equivalent to one third of a master’s degree. Full academic support is provided to ensure you are fully prepared for assessment regardless of your prior experiences. The academic element of your programme is made up of two modules. \r\n\r\nAt Goldsmiths we recognise the importance and potential of theatre as an art form, and it is our goal to use it to promote the personal, social, spiritual and cultural development of all pupils, including the ones you will go on to teach.This programme is designed to create teachers who will operate as artists in education, empowering young people through Drama, and encourage you to reach your full potential as a qualified teacher. The programme integrates process and performance, teaching both through and about the art form. In this way, you’ll be able to benefit from a whole host of transferable skills, enabling you to develop personally and professionally through both practical and theoretical enquiry. Further details about the programme can be found: https://www.gold.ac.uk/pgce/secondary-drama/\r\n","interviewProcess":"Interviews take place either at Goldsmiths or in one of our partnership schools. All interviews will require you to demonstrate your own knowledge in the subject you are intending on teaching as well as including activities to gauge your understanding of the teaching profession. \r\n\r\nAcross all subject areas, activities at interview will include: \r\n•\tA written English test;\r\n•\tAn opportunity to demonstrate group work skills; \r\n•\tAn individual interview; \r\n•\tFor certain subjects you may be required to provide a portfolio of work at interview to evidence your professional practice. \r\n\r\nIn addition, some subjects may include additional interview activities please see specific subject pages listed above. \r\n","howSchoolPlacementsWork":"The Secondary PGCE Programme at Goldsmiths offers you the opportunity to specialise in the 11-18 age range.\r\n\r\nWe work with a partnership of over 300 schools across London and beyond. This means that during your time on the PGCE (QTS) programme you will have the opportunity to work in contrasting schools and settings which will provide breadth to your understanding of the role of the teacher. \r\n\r\nYou will have two extended placements during your programme during the Autumn and Spring/ Summer terms. Placements are allocated for you once you have enrolled onto the programme. In placing you we take into account any care responsibilities or personal circumstances and we will locate a school for you that is within a reasonable travelling distance from your home in the light of this. \r\n","personalQualities":"In addition to a strong subject knowledge, we are looking for applicants that have an understanding of the nature of working in an urban settings and a have a clear commitment and enthusiasm for working with young people. You must be able to show resilience and be willing to work with others.","otherRequirements":"You do not need to have extensive school experience before applying but we do ask that you spend a minimum of 5 days in a school in the last 5 years to ensure that you are fully aware that the profession is right for you.","status":1,"createdAt":"2021-07-06T10:54:01.855Z","updatedAt":"2021-11-15T15:59:59.758Z","canSponsorStudentVisa":"yes","cycle":"2024"}
