{"id":"160021de-c816-4178-8374-dd0a2c8163c9","name":"Biology","code":"25GD","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"322cfc19-d51d-45db-91e3-bd7b4738470f","code":"C1","name":"Biology"}],"locations":[{"id":"75377abb-e8cf-45a2-a008-72b7e341c701","name":"University of Greenwich","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"628cb861-f9fb-4433-8cfc-9d176095119c","code":"185","name":"The Royal Greenwich School Alliance"},"accreditedBody":{"id":"b3681bbc-2e2a-49c3-aa4e-e453a8d0e4a5","code":"G70","name":"University of Greenwich"},"profPost":"PG","degreeGrade":"1","additionalDegreeSubjectRequirements":"false","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feeDetails":"Bursaries and scholarships are available to trainees on a fee-based teacher training course in England that leads to the award of qualified teacher status. Availability is dependent on your highest relevant academic award and the subject in which you are training to teach. PLEASE NOTE THERE IS NO BURSERY FOR PE","aboutCourse":"Biology: As a biology teacher, you will enhance pupils' understanding of themselves and the world around them to succeed in a range of important careers.\r\n\r\nOur Postgraduate/Professional Graduate Certificate in Education (PGCE) is designed to prepare you in becoming a professional, competent and reflective secondary school teacher of science, with biology as a specialist subject. Your studies will focus on addressing the needs of pupils aged eleven to sixteen and beyond. \r\n\r\nThe quality of teacher training in secondary education was rated as 'Good' in the Ofsted report for Initial Teacher Education 2016. The report found that, \"Scientists appreciate the enhancement groups where they further build on their knowledge by sharing each other's expertise. As a consequence, the trainees' and newly qualified teachers' enthusiasm and confidence in the subjects they teach motivate and inspire pupils to learn and make progress.\"\r\n\r\n98% of students indicated that the programme prepared them for teaching learners across a range of abilities and 98% of students indicated that the programme helped them secure employment.\r\n\r\nAs part of your PGCE, you will have the opportunity to gain 60 Masters-level credits and gain Qualified Teacher Status (QTS).\r\n\r\nWe work in collaboration with professionals from specialist science organisations such as the Royal Society of Biology. We also partner with the adventure learning charity, Wide Horizons, who will support your training in the area of field work, conservation and ecology. Additionally, you will receive free resources and ideas on how to plan engaging lessons in plant biology from Science and Plants for Schools.\r\n","interviewProcess":"Candidates must:\r\n\r\n* Attend an interview\r\n* Demonstrate a level of competence in Maths and English\r\n Please see [www.education.gov.uk/get-into-teaching](https://getintoteaching.education.gov.uk/) for more information\r\n","howSchoolPlacementsWork":"Our one-year programme comprises of two elements: 60 days of university-based teaching and 120 days of school-based experience. Your practical teaching experience is gained in two main schools. Here you will be allocated subject-specialist mentors who will offer dedicated feedback and guidance. During both placements, you will have the opportunity to develop your science and biology teaching with the support of a specialist teacher.\r\n \r\n","personalQualities":"","otherRequirements":"Disclosure Barring Service\r\n\r\nPlease note that it is not possible to pay for the DBS application fee from your student support and you should therefore make provision for this cost as part of your financial planning prior to the start of your programme.\r\n\r\nThe information above is dependent on your status as a [home, EU/EEA or overseas student](https://getintoteaching.education.gov.uk/funding-and-salary/overview/postgraduate-loans) and further eligibility applies. Make sure you are aware of the level of support you are eligible for before you apply for teacher training.\r\n\r\n\r\n \r\n","status":1,"createdAt":"2021-07-06T10:54:01.683Z","updatedAt":"2021-11-15T15:51:50.429Z","canSponsorStudentVisa":"no","cycle":"2024"}
