{"id":"b7599665-567b-4d67-8ba9-59f648486be4","name":"Physical Education","code":"25GJ","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"74d64a54-5e34-4590-b6c7-528dd0cf26fe","code":"C6","name":"Physical education"}],"locations":[{"id":"75377abb-e8cf-45a2-a008-72b7e341c701","name":"University of Greenwich","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"628cb861-f9fb-4433-8cfc-9d176095119c","code":"185","name":"The Royal Greenwich School Alliance"},"accreditedBody":{"id":"b3681bbc-2e2a-49c3-aa4e-e453a8d0e4a5","code":"G70","name":"University of Greenwich"},"profPost":"PG","degreeGrade":"1","additionalDegreeSubjectRequirements":"false","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feeDetails":"Bursaries and scholarships are available to trainees on a fee-based teacher training course in England that leads to the award of qualified teacher status. Availability is dependent on your highest relevant academic award and the subject in which you are training to teach. PLEASE NOTE THERE IS NO BURSERY FOR PE","aboutCourse":"PE: High-quality physical education (PE) in schools is vital in the development of physically literate people in modern society.\r\n\r\nThe quality of teacher training in secondary education was rated as \"Good\" in Ofsted's report for Initial Teacher Training Education in 2016. The report identifies \"trainees' and NQTs' breadth of subject knowledge and the ability to reflect on their teaching ensures that they clearly focus on promoting pupils' learning.\"\r\n\r\nOur highly popular programme will provide you with essential, specialist training in the teaching of physical education. Our training will ensure you will become confident and competent practitioners in a secondary school setting. We aim to develop PE teachers who are able to work effectively across a range of pedagogical areas and practical activities.\r\n\r\nProgress will be assessed through a professional portfolio, written assignments and observation of classroom teaching. In order to qualify as a teacher, you need to meet the standards for Qualified Teacher Status, as set out by the Department for Education.\r\n\r\nContinuous assessment of classroom skills and teaching effectiveness builds towards a professional development portfolio. There are also written and practical assignments with opportunities for Master's level credits in the postgraduate version.\r\n\r\n\r\nBy the end of your studies with us, you will become a confident, competent and effective teacher of physical education with the ability to reflect on both theory and practice. Graduates receive a PGCE and Qualified Teacher Status.\r\n","interviewProcess":"Candidates must:\r\n\r\n* Attend an interview\r\n* Demonstrate a level of competence in Maths and English\r\n Please see [www.education.gov.uk/get-into-teaching](https://getintoteaching.education.gov.uk/) for more information\r\n","howSchoolPlacementsWork":"Our one-year programme comprises of two elements: 60 days of university-based teaching and 120 days of school-based experience. Your practical teaching experience is gained in two main schools. Here you will be allocated subject-specialist mentors who will offer dedicated feedback and guidance. During both placements, you will have the opportunity to develop your science and biology teaching with the support of a specialist teacher.","personalQualities":"","otherRequirements":"Disclosure Barring Service\r\n\r\nPlease note that it is not possible to pay for the DBS application fee from your student support and you should therefore make provision for this cost as part of your financial planning prior to the start of your programme.\r\n\r\nThe information above is dependent on your status as a [home, EU/EEA or overseas student](https://getintoteaching.education.gov.uk/funding-and-salary/overview/postgraduate-loans) and further eligibility applies. Make sure you are aware of the level of support you are eligible for before you apply for teacher training.\r\n\r\n\r\n \r\n","status":1,"createdAt":"2021-07-06T10:54:01.718Z","updatedAt":"2021-11-15T15:53:10.876Z","canSponsorStudentVisa":"no","cycle":"2024"}
