{"id":"e989f613-3ef9-40c7-8e1b-c5be6590064c","name":"Chemistry","code":"25G6","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"912d4fb4-761b-42e9-8dc6-e968b791ea4e","code":"F1","name":"Chemistry"}],"locations":[{"id":"75377abb-e8cf-45a2-a008-72b7e341c701","name":"University of Greenwich","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"628cb861-f9fb-4433-8cfc-9d176095119c","code":"185","name":"The Royal Greenwich School Alliance"},"accreditedBody":{"id":"b3681bbc-2e2a-49c3-aa4e-e453a8d0e4a5","code":"G70","name":"University of Greenwich"},"profPost":"PG","degreeGrade":"1","additionalDegreeSubjectRequirements":"false","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feeDetails":"Bursaries and scholarships are available to trainees on a fee-based teacher training course in England that leads to the award of qualified teacher status. Availability is dependent on your highest relevant academic award and the subject in which you are training to teach. PLEASE NOTE THERE IS NO BURSERY FOR PE","aboutCourse":"Chemistry: The challenge of being a chemistry teacher will have you finding creative and diverse ways to share your knowledge with young students. \r\n\r\nOur Postgraduate/Professional Graduate Certificate in Education (PGCE) is designed to prepare you to become a professional, competent and reflective secondary school teacher of science, with chemistry as a specialist subject. Your studies will focus on addressing the needs of pupils aged 11 to 16 and beyond. \r\n\r\nAs part of your PGCE, you will have the opportunity to gain 60 Master's level credits and gain Qualified Teacher Status (QTS).\r\n\r\nOur course has support from representatives at the Royal Society of Chemistry. They bring awareness to our student teachers of the vast amount of resources and help available in order to become a chemistry teacher. This includes free online continuing professional development (CPD) courses to support you in your career.\r\n\r\n98% of students indicated that the programme prepared them for teaching learners across a range of abilities and 98% of students indicated that the programme helped them secure employment.\r\n\r\nAs part of your PGCE, you will have the opportunity to gain 60 Masters-level credits and gain Qualified Teacher Status (QTS).\r\n","interviewProcess":"Candidates must:\r\n\r\n* Attend an interview\r\n* Demonstrate a level of competence in Maths and English\r\n Please see [www.education.gov.uk/get-into-teaching](https://getintoteaching.education.gov.uk/) for more information\r\n","howSchoolPlacementsWork":"Our one-year programme comprises of two elements: 60 days of university-based teaching and 120 days of school-based experience. Your practical teaching experience is gained in two main schools. Here you will be allocated subject-specialist mentors who will offer dedicated feedback and guidance. During both placements, you will have the opportunity to develop your science and biology teaching with the support of a specialist teacher.\r\n \r\n","personalQualities":"","otherRequirements":"Disclosure Barring Service\r\n\r\nPlease note that it is not possible to pay for the DBS application fee from your student support and you should therefore make provision for this cost as part of your financial planning prior to the start of your programme.\r\n\r\nThe information above is dependent on your status as a [home, EU/EEA or overseas student](https://getintoteaching.education.gov.uk/funding-and-salary/overview/postgraduate-loans) and further eligibility applies. Make sure you are aware of the level of support you are eligible for before you apply for teacher training.\r\n\r\n\r\n \r\n","status":1,"createdAt":"2021-07-06T10:54:01.608Z","updatedAt":"2021-11-15T15:54:36.745Z","canSponsorStudentVisa":"no","cycle":"2024"}
