{"id":"a4d76503-184d-4d02-a413-3ec155bf136b","name":"Primary","code":"N663","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"fc2c5e9d-60d3-496e-9fd9-a646776050c4","name":"Axbridge C of E First School Academy","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"a042cf59-a725-4c12-9d22-2405a50c0251","code":"3J9","name":"Axbridge C of E First School Academy"},"accreditedBody":{"id":"be897ea1-5b41-4b40-8eaf-877a15ad688b","code":"S31","name":"Somerset SCITT Consortium"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"You will be trained in highly aspirational and supportive environments to enable the delivery of creative, purposeful and challenging teaching and learning. You will develop the rigour, professional knowledge, understanding and skills necessary to deliver excellent provision for young people. \r\nTraining will be delivered by expert teachers in the partnership schools enhanced by full access to the SCITT training and support programmes.\r\n\r\nThe placements in school are enriched with specific face to face training days at Somerset SCITT \r\nTrainees will study the following topic areas:\r\n•\tPedagogy and Professional Practice.\r\n•\tMaths\r\n•\tEnglish\r\n•\tScience\r\n•\tSubject Specialist Research\r\n•\tGlobal Dimensions\r\n•\tFoundation Studies\r\nAs well as the above we offer the following conference themes:\r\n•\tLearning without Limits\r\n•\tPsychologies/EAL\r\n•\tBehaviour\r\n•\tTeaching cross curricular English with a global dimension.\r\n","interviewProcess":"This is co-ordinated between Somerset SCITT and the Wessex Hub schools and Training Lead.\r\n\r\nThe interview process is currently virtual and will consist of an activity with a book activity, a presentation and formal interview.\r\n","howSchoolPlacementsWork":"You will be assigned to one of the schools in the partnership in which you will do teaching placements in the Autumn and Summer terms. \r\n\r\nPart of the Spring term will be a teaching placement in a contrasting school and Key stage within the Wessex Hub of schools.  You will be treated like a member of staff and will attend staff meetings and professional development days in the main placement school with additional opportunities to attend training across the wider hub where appropriate. \r\n\r\nEach trainee will be assigned a Professional Tutor (PT Mentor) form the school of your main placement and a Tutor Moderator from Somerset SCITT who will make a minimum of two visits per term.\r\n\r\nOur PT’s are outstanding teachers who are experienced in supporting the professional development of new and experienced teachers. They have a range of skills including coaching, effective classroom observation and feedback skills. You are therefore assured of a high level of personal and professional support in a programme which is well managed at all levels. ","personalQualities":"The Schools Direct training programme is for high quality graduates who want to train as part of a school team. We offer placements across Early Years and the Primary phase.  \r\n\r\nWe are looking for enthusiastic, committed and passionate trainee teachers to join our schools. We are seeking trainees who have a natural rapport with children and adults, an innate passion for teaching and learning and who strive to make a positive difference to children’s lives. ","otherRequirements":"All trainees must complete an enhanced clearance from the DBS service regarding their suitability to work with young people and health and medical checks. \r\n\r\nTrainees will be required to read and sign key policies regarding safeguarding (Code of Conduct, ICT Acceptable user agreement). \r\n\r\n","status":1,"createdAt":"2021-07-06T10:56:58.930Z","updatedAt":"2021-09-16T10:55:49.520Z","canSponsorStudentVisa":"no","cycle":"2024"}
