{"id":"1dd01449-4de9-4102-ad17-2d8f74135e6f","name":"Primary (3-7)","code":"X121","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"3_to_7","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"97f4f68e-0711-458c-864b-03857f31d23e","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"e328aab3-a535-4921-8ded-5e37133c76dd","code":"L46","name":"Liverpool Hope University"},"profPost":"PG","degreeGrade":"0","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feeDetails":"We are unable to  sponsor overseas students for Initial Teacher Training (ITT) courses that require a Student Visa (formerly known as the Tier 4/General student visa) with the exception of PGCE MFL. If you have lived in the UK prior to 11pm on 31/12/20, you may still be eligible to apply contact: studentimmigration@hope.ac.uk for more information.","aboutCourse":"Primary  (3-7 years) (X121)\r\n\r\nLiverpool Hope University is one of the country's leading providers of Initial Teacher Education. In the most recent National Student Survey 97% of our undergraduate QTS students expressed overall satisfaction with provision, placing us top among the fifty largest providers of teacher training in the UK and 16% above the national average.\r\n\r\nThe PGCE Primary (3-7) course is a postgraduate qualification aimed at high-quality graduates wishing to pursue a career in Early Years teaching. It is an intensive, demanding yet very rewarding programme running from late August to July Tutors are dedicated to individual student support and to working closely with our partners in local schools.\r\n\r\nOur teaching staff come from a variety of academic and professional backgrounds, with a rich diversity of experience in many types of schools. We are committed to the idea that teachers are formed not trained and need both theoretical and practical preparation to be truly outstanding teachers. Our lectures and workshops are engaging and interactive, supporting you in becoming well-informed and reflective professionals who can take independent judgements and are ready to be full members of a school community.\r\n\r\nTEF GOLD AWARD (Teaching Excellence Framework)\r\nThe Teaching Excellence Framework (TEF) was introduced by the Government to build evidence about the performance of the UK's higher education sector.  Based on the evidence available the TEF Panel judged that Liverpool Hope University delivers consistently outstanding teaching, learning and outcomes for its students. It is of the highest quality found in the UK.\r\n","interviewProcess":"It is anticipated that candidates will have read the entry requirements and have some understanding of the course for which they have applied.\r\n\r\nCandidates are required to undertake core curriculum tests.\r\n\r\nAt interview applicants take part in a group task and an individual interview. As well as scenario based resilience testing.\r\n\r\nFull interview details will be sent out prior to interview.\r\n\r\nNotification following interview\r\n\r\nApplicants will be able to track the status of their application on line.\r\n\r\nSuccessful applicants will receive notification on UCAS and also receive a confirmation letter\r\n\r\nUnsuccessful applicants will receive notification via UCAS and receive a letter with a feedback from interview.\r\n","howSchoolPlacementsWork":"At Liverpool Hope we have strong and long standing partnerships with a wide range of schools across the North West. Our partnership includes over 300 schools encompassing faith based settings, community schools, academies and schools from the private sector. All our partner schools share our vision for creating The Hope Teacher and are skilled at providing you with the practical support to become an outstanding classroom practitioner. \r\n\r\nHigh quality partnership schools are selected for students according to their training requirements. We match placements carefully ensuring students gain a range of experience in different schools and settings building on their prior knowledge and experience. All partner school have experienced, trained mentors who will support this you to succeed. \r\n\r\nPostgraduate students complete two assessed professional placements during their training. Placements increase in length as you progress through your training preparing you for the real world of teaching. There are additional opportunities for enhanced placement opportunities including early years, special educational needs and international placement experiences. \r\n","personalQualities":"Knowledge of the subject specific curriculum\r\n\r\nThe ability to articulate views on the principles and practice of education particularly as it relates to teaching of subject specific\r\n\r\nThe ability to communicate clearly, fluently and accurately in spoken and written Standard English\r\n\r\nA desire to teach and inspire children\r\n\r\nThe ability to present information and communicate well verbally and in writing.\r\n\r\nStrong organisational skills\r\n\r\nA good reference\r\n","otherRequirements":"Evidence of experiences of the world of work outside of education\r\n\r\nRange of interests and skills\r\n\r\nOther experiences of working with children, young people and/or adults","status":1,"createdAt":"2021-07-06T10:57:02.988Z","updatedAt":"2021-08-11T13:59:26.041Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
