{"id":"dc7f6eb0-bee1-4aba-80a2-a5af23ac5fa3","name":"Religious Education","code":"V6X9","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"724b5d16-28dd-4431-bc17-ea4be4daedc4","code":"V6","name":"Religious education"}],"locations":[{"id":"97f4f68e-0711-458c-864b-03857f31d23e","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"e328aab3-a535-4921-8ded-5e37133c76dd","code":"L46","name":"Liverpool Hope University"},"profPost":"PG","degreeGrade":"0","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"Religious subject at Degree level required","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feeDetails":"We are unable to  sponsor overseas students for Initial Teacher Training (ITT) courses that require a Student Visa (formerly known as the Tier 4/General student visa) with the exception of PGCE MFL. If you have lived in the UK prior to 11pm on 31/12/20, you may still be eligible to apply contact: studentimmigration@hope.ac.uk for more information.","aboutCourse":"The PGCE Secondary Religious Education course at Liverpool Hope is designed to support the individual in working towards becoming an outstanding qualified teacher.  \r\n\r\nThrough a close working partnership with our placement school’s student teachers are provided with a supportive, constructive learning environment, with mentors who are dedicated to student teacher progression and development.  Schools placements will cover the 11-16 age range, along with a KS5 enhancement.\r\n\r\nThe course also provides the opportunity to share good practice and consider a range of practical, creative teaching strategies which can then be employed in school.   Areas covered include the school RE curriculum at KS3, GCSE and 'A' level; assessment in Religious Education, Philosophy for Children  and Philosophy and Ethics. \r\n\r\nThe pedagogy of RE is an important emphasis on the course as well as the range of potential curricula in RE enabling student teachers to become confident RE practitioners.  The employment rates for the course are outstanding as are the completion and exit grades.  \r\n","interviewProcess":"If called for interview, the day will take the following format or similar to assess key skills and attributes:\r\n\r\n1. Presentation: you will be asked to give a presentation on a topic showing how you would deliver this to a class. Details are sent out with the interview letter.\r\n\r\n2. Interview: a set of questions designed to ascertain your ideas and knowledge on a range of educational issues.\r\n\r\n3. Group Task: A task will be set which requires you to work collaboratively in groups around a generic educational topic and present your findings to other candidates\r\n\r\n4. Literacy Test: A 20 minute written task to assess your standard of written English (grammar, spelling, punctuation etc)\r\n\r\n5. You will be notified of the outcome of your interview within seven to ten days via UCAS Track and letter.\r\n\r\nUpon receipt of your acceptance of the place offered, if successful, you will receive a pre-course pack outlining activities which will need to be completed before the course starts, in order to begin your training immediately and prepare you for the start of the course in September.\r\n\r\nOther requirements and recommendations from your interview may also be enclosed.\r\n\r\nIf unsuccessful you will receive a letter giving basic details of the reasons for this.\r\n","howSchoolPlacementsWork":"At Liverpool Hope we have strong and long standing partnerships with a wide range of schools across the North West. Our partnership includes over 300 schools encompassing faith based settings, community schools, academies and schools from the private sector. All our partner schools share our vision for creating the Hope Teacher and are skilled at providing you with the practical support to become an outstanding classroom practitioner. \r\n\r\nHigh quality partnership schools are selected for students according to their training requirements. We match placements carefully ensuring students gain a range of experience in different schools and settings building on their prior knowledge and experience. All partner schools have experienced, trained mentors who will support this you to succeed. \r\n\r\nPostgraduate students complete two assessed professional placements during their training. Placements increase in length as you progress through your training preparing you for the real world of teaching.   \r\n","personalQualities":"Knowledge of the subject specific curriculum\r\n\r\nThe ability to articulate views on the principles and practice of education particularly as it relates to teaching of subject specific\r\n\r\nThe ability to communicate clearly, fluently and accurately in spoken and written Standard English\r\n\r\nA desire to teach and inspire children\r\n\r\nThe ability to present information and communicate well verbally and in writing.\r\n\r\nStrong organisational skills\r\n\r\nA good reference\r\n","otherRequirements":"A’ Level in relevant subject\r\n\r\nEvidence of experiences of the world of work outside of education\r\n\r\nRange of interests and skills\r\n\r\nOther experiences of working with children, young people and/or adults","status":1,"createdAt":"2021-07-06T10:57:02.890Z","updatedAt":"2021-08-11T13:58:32.888Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
