{"id":"ffacb12a-5903-42a5-8706-f619ec6f1c3b","name":"Primary","code":"3FDS","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"3470d8d9-bc91-4d0e-a537-0cb29c4b06c6","name":"Main Site","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"8f51ccf6-68a8-4fb3-9199-7cf1427ecd53","code":"1BR","name":"Future Stars TSA"},"accreditedBody":{"id":"049fe65f-08dc-4686-9ac8-606dce490128","code":"G56","name":"Goldsmiths, University of London"},"profPost":"PG","english":"1","maths":"1","science":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feesInternational":16700,"feeDetails":"Further information regarding fees can be found here:\r\n\r\nhttps://www.gold.ac.uk/pgce/fees-funding/\r\n","financialSupport":"Further information regarding fees can be found here:\r\n\r\nhttps://www.gold.ac.uk/pgce/fees-funding/","aboutCourse":"This new path into teaching is a way to gain the qualifications and practical skills you need to become a teacher while learning on the job. You will be based at one of the schools within our Teaching School Alliance and your training will be a mixture of on the job experience and university days at Goldsmiths. \r\nThe course aims to develop all the skills, knowledge and understanding you’ll need to become a responsible and effective teacher in your chosen age phase.  It is offered in conjunction Goldsmith’s University, a renowned as a leader in the field of teacher education. Successful completion leads to a PGCE with Qualified Teacher Status (QTS). \r\nThe training is school-led which means that from the very first day you will be welcomed in one of our good or outstanding alliance schools.  You will be placed in class alongside an experienced teacher who will act as your mentor throughout your training. \r\nYour experience will consist of a rich mixture of theory and practice.  The theoretical parts of learning to be a teacher will be taught at Goldsmiths university, whilst at school you will have opportunities to put into practice what you have learnt.  The type of training we offer in school is very hands on; you will have opportunities to observe your mentor and other teachers, interview school leaders and benefit from school professional development sessions.  You will then gradually put into practice what you have learnt, building up from teaching small groups and parts of lessons to eventually teaching whole classes.  Our approach to training teachers is very much a coaching model.  We value our profession and want to support and nurture our student teachers to develop their skills and expertise with support from experienced colleagues.\r\nAs a student teacher at Future Stars TSA you will benefit from a very strong support network which will include a university tutor, our lead mentor at Queensbridge Primary School and your class teacher mentor. In addition, you will also have the support of current and previous cohorts of student teachers employed across our alliance. We have Newly Qualified Teachers (NQTs), Recently Qualified Teachers (RQTs), experienced teachers and senior leaders who have all had their own experience of the school direct programme and will be happy to help and guide you.  \r\n","interviewProcess":"You will be interviewed at the lead school, Queensbridge Primary School by school leaders from across our Teaching School Alliance.  Typically the interview process will consist of a short presentation by you, an interview from the panel, a teaching task with a small group of pupils and a literacy and numeracy test. ","howSchoolPlacementsWork":"All of the schools in our Teaching School Alliance are rated by Ofsted as 'Good' or 'Outstanding' and have a strong commitment to making learning creative, enjoyable and fun for their pupils. As an Alliance we are unique in offering a network of five schools based across three boroughs. \r\n\r\nThe schools that we work with are like minded in that they all value creativity across the curriculum but at the same time they all have distinctive identities and characteristics.  Our students will have opportunities to visit all the schools in our Alliance throughout their training which contributes to the  rich and diverse training experience that we aim to offer.  The boroughs that we cover are the adjoining boroughs of Hackney, Islington and Haringey.\r\n\r\nYou will begin your training in September based in one of our schools, in an identified class, with an experienced class teacher/mentor.  In most cases this will be your base class throughout the year.  In the Spring Term you will be based in another school for six weeks; this will constitute your second school placement.  The purpose of the placement is to give you opportunities to experience a contrasting key stage in a contrasting setting; for example if your base class is in Key Stage 1 (years 1 &2) you will be placed in Key Stage 2 (years 3/4/5/6) in your second school placement. After the placement you will return to your home school, usually back in your original class. \r\n","personalQualities":"Are you sparky and good at using your initiative with lots of lovely creative ideas? Are you hard working, energetic, enthusiastic and committed to making a difference to young children’s lives? Are you creative and a willing team player with a sense of humour?\r\nIf you can say yes to all the above, then you could be the right candidate to train with us on this course. ","otherRequirements":"","status":2,"createdAt":"2021-07-06T10:53:28.693Z","canSponsorStudentVisa":"yes","cycle":"2024"}
