{"id":"95f5bfab-b59f-490f-998b-cbac83e1048c","name":"Chemistry","code":"F1X1","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"912d4fb4-761b-42e9-8dc6-e968b791ea4e","code":"F1","name":"Chemistry"}],"locations":[{"id":"924e4217-0773-4953-9e25-4370393f8116","name":"University of East London - Stratford Campus","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"2e1ce675-b5df-42ab-bb63-1e0435ef5722","code":"E28","name":"University of East London"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":12100,"aboutCourse":"This course leads to the award of Qualified Teacher Status (QTS) for the 11 to 16 age range, which qualifies you to be a teacher in secondary schools in England and Wales. Where possible, we also give you the chance to gain experience in the 11 to 18 age range.\r\n\r\nScience, technology, engineering and mathematics (STEM) subjects are integral to the success of the UK economy and STEM education has long been identified as a major priority for schools. \r\n\r\nTeaching chemistry challenges you to find creative ways of ensuring all pupils have the same opportunities to understand the subject and its importance in everyday life.\r\n\r\nBy training to teach such an important subject, you could be eligible for the highest range of tax-free training bursaries – or a prestigious scholarship from the Royal Society of Chemistry if you have a top degree.\r\n\r\nThere are three elements to secondary training at the University of East London: subject studies, general professional studies and school-based training. It differs from courses offered by other universities in that it is very much subject-based.","interviewProcess":"You will be interviewed at UEL by the Chemistry ITT course tutor, and where possible, a practising teacher from one of our partner schools. The interview will involve two tests - one that focuses on your literacy expertise and one that considers you subject knowledge. These tests are not pass/ fail in design, but simply enable us to ascertain the best ways of supporting these areas as you hopefully progress onto the programme. You are also asked to prepare a lesson plan for Year 7 pupils, which you will present during the interview. ","howSchoolPlacementsWork":"We work within a very large partnership of schools across London and also Essex, Hertfordshire, Kent and Surrey.  You will be teaching all year groups in the 11-16 age range but we do provide 16-18 experience as well in many school placements. You will experience two, twelve week placements in two complementary schools. You will be supported in these schools by a school based mentor as well as your UEL tutor. ","personalQualities":"*Good interpersonal skills with young people and/or adults;\r\n*Evidence of ability to respond to a challenge and overcome setbacks;\r\n*Resilience and commitment;\r\n*Evidence of knowledge of wider education issues and the ability to express and justify opinions and to consider those of others.","otherRequirements":null,"status":1,"createdAt":"2021-07-06T10:56:53.390Z","updatedAt":"2021-07-21T08:08:09.385Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
