{"id":"98d3e524-325b-436d-888e-4f1faff1a42d","name":"Primary (with English as an Additional Language)","code":"X105","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"1e6e30f3-d686-4686-9d83-16b3a56cd9a0","code":"01","name":"Primary with English"}],"locations":[{"id":"924e4217-0773-4953-9e25-4370393f8116","name":"University of East London - Stratford Campus","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"2e1ce675-b5df-42ab-bb63-1e0435ef5722","code":"E28","name":"University of East London"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":12100,"aboutCourse":"This primary teacher education course is designed for graduates who are committed to becoming primary school teachers. It trains you to teach children in the five-to-11 age range. \r\n\r\nAs a trainee you will learn how to teach the entire primary curriculum as well as choosing a particular route. The English as an Additional Language route is for graduates who are particularly interested in how pupils whose first language is not English are included and supported in schools.\r\n\r\nEast London offers multicultural, multilingual and vibrant schools in which to learn, but your training at UEL will qualify you to teach anywhere in England or Wales.\r\n\r\nOur PGCE team is made up of experienced practitioners who have worked in a range of primary and early years settings across London as classroom teachers, curriculum co-ordinators, advisory teachers and school leaders.\r\n\r\nAt UEL you will be part of a diverse community of students. We want to bring to east London a teacher workforce that reflects the local community.","interviewProcess":"The entire interview process lasts about three hours. During the interview you will be asked to talk about a current educational issue.  Please ensure you have done some research into current educational issues in advance of the interview.  You could, for example, read recent editions of the Times Educational Supplement. \r\n\r\nOur aim is to find out as much as we can about your attributes, skills, knowledge and understanding in order to shape training opportunities for you, should you be offered a place on the programme. \r\n\r\nYour responses to these tasks and activities will be considered alongside all the other evidence to assess your suitability for the Primary PGCE programme.\r\n\r\nDuring the individual interview you will be given the chance to talk with a tutor about the programme and any other issues that are relevant.","howSchoolPlacementsWork":"We work within a very large partnership of schools across London and also Essex, Hertfordshire, Kent and Surrey. We do not wish to disadvantage our trainees by asking them to travel a long distance to their placement schools. Generally, we look at one hour door to door as being the maximum travel time expected.  You will experience three, eight week placements in three complementary schools. You will be supported in these schools by a school based mentor as well as your UEL tutor. ","personalQualities":"*Good interpersonal skills with young people and/or adults;\r\n\r\n*Evidence of ability to respond to a challenge and overcome setbacks;\r\n\r\n*Resilience and commitment;\r\n\r\n*Evidence of knowledge of wider education issues and the ability to express and justify opinions and to consider those of others.","otherRequirements":null,"status":1,"createdAt":"2021-07-06T10:56:53.914Z","updatedAt":"2021-07-23T09:10:32.371Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
