{"id":"dcd55930-130d-47d3-aad2-8e6524241db7","name":"Music","code":"W3X1","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"24311bef-8673-41fb-933c-53f887fb6976","code":"W3","name":"Music"}],"locations":[{"id":"924e4217-0773-4953-9e25-4370393f8116","name":"University of East London - Stratford Campus","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"2e1ce675-b5df-42ab-bb63-1e0435ef5722","code":"E28","name":"University of East London"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":12100,"aboutCourse":"This course qualifies you to be a secondary teacher of music in England and Wales.\r\n\r\nMusic is a universal language. By teaching this subject, you will be responsible for unlocking your pupils’ creativity, as well as developing their love of music and their ability to express themselves. \r\n\r\nIf you have a first, 2:1, 2:2, or a higher degree, you could be eligible for a bursary to help fund your teacher training. There will, additionally, be an expectation that you will be a confident reader of traditional staff notation\r\n\r\nA quality music education will play an important role in young people’s learning, whether they go on to become talented, adept musicians or just gain a deeper understanding of different forms and styles of music.  \r\n\r\nYou can help your pupils develop not only enduring instrumental and composition skills, but passions and interests that will stay with them for the rest of their lives. \r\n\r\nThe overall proportion of UEL Secondary teacher trainees who are in a teaching post within six months of completing the course is 100 per cent - ahead of the sector average.\r\n\r\nThere is an expectation that applicants will have a degree in Music or a closely related subject (e.g. Music Technology) and also be able to play a musical instrument with some degree of expertise (in addition to singing).","interviewProcess":"You will be interviewed at UEL by the Music ITT course tutor, and where possible, a practising teacher from one of our partner schools. The interview will involve two tests - one that focuses on your literacy expertise and one that considers you subject knowledge. These tests are not pass/ fail in design, but simply enable us to ascertain the best ways of supporting these areas as you hopefully progress onto the programme. You are also asked to prepare a lesson plan for Year 7 pupils, which you will present during the interview. You will be expected to perform on your main instrument and also to sing as part of the interview process.","howSchoolPlacementsWork":"We work within a very large partnership of schools across London and also Essex, Hertfordshire, Kent and Surrey.  You will be teaching all year groups in the 11-16 age range but we do provide 16-18 experience as well in many school placements. You will experience two, twelve week placements in two complementary schools. You will be supported in these schools by a school based mentor as well as your UEL tutor. ","personalQualities":"*Good interpersonal skills with young people and/or adults;\r\n*Evidence of ability to respond to a challenge and overcome setbacks;\r\n*Resilience and commitment;\r\n*Evidence of knowledge of wider education issues and the ability to express and justify opinions and to consider those of others.","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:56:53.881Z","updatedAt":"2021-07-23T09:02:24.292Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
