{"id":"e84730c4-9449-461c-a070-823683e9fd05","name":"Religious Education","code":"V6X1","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"724b5d16-28dd-4431-bc17-ea4be4daedc4","code":"V6","name":"Religious education"}],"locations":[{"id":"924e4217-0773-4953-9e25-4370393f8116","name":"University of East London - Stratford Campus","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"2e1ce675-b5df-42ab-bb63-1e0435ef5722","code":"E28","name":"University of East London"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":12100,"aboutCourse":"This course leads to the award of Qualified Teacher Status (QTS) for the 11 to 16 age range, which qualifies you to be a teacher in secondary schools in England and Wales. Where possible, we also give you the chance to gain experience in the 11 to 18 age range.\r\n\r\nReligious Education (RE) helps build young people’s understanding and appreciation of different beliefs, practices and religions, and how these relate to the modern world. \r\n\r\nTraining to teach RE in London offers you the chance to tackle challenging, thought-provoking topics with young people.\r\n\r\nYou can use your creativity and passion for the subject to develop lessons that help your pupils discuss and answer the most fundamental questions – from belief in God to the meaning and purpose of life.\r\n\r\nBy training as a religious education teacher, you can help your pupils become compassionate young adults, respectful of religious and cultural differences.\r\n","interviewProcess":"You will be interviewed at UEL by the RE ITT course tutor, and where possible, a practising teacher from one of our partner schools. The interview will involve two tests - one that focuses on your literacy expertise and one that considers you subject knowledge. These tests are not pass/ fail in design, but simply enable us to ascertain the best ways of supporting these areas as you hopefully progress onto the programme. You are also asked to prepare a lesson plan for Year 7 pupils, which you will present during the interview. ","howSchoolPlacementsWork":"We work within a very large partnership of schools across London and also Essex, Hertfordshire, Kent and Surrey. You will be teaching all year groups in the 11-16 age range but we do provide 16-18 experience as well in many school placements. You will experience two, twelve week placements in two complementary schools. You will be supported in these schools by a school based mentor as well as your UEL tutor. ","personalQualities":"*Good interpersonal skills with young people and/or adults;\r\n*Evidence of ability to respond to a challenge and overcome setbacks;\r\n*Resilience and commitment;\r\n*Evidence of knowledge of wider education issues and the ability to express and justify opinions and to consider those of others.","otherRequirements":null,"status":1,"createdAt":"2021-07-06T10:56:53.846Z","updatedAt":"2021-07-23T09:24:42.121Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
