{"id":"f6c470b3-8272-4992-9dbd-ab7594cf96a5","name":"Computing","code":"295Y","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"e6be6a9c-8696-4b88-8fbd-1ba1bef1b6fc","code":"11","name":"Computing"}],"locations":[{"id":"4cda7eef-2f96-41cb-9c81-585eb184868c","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"71fd55ea-8aac-4a09-b85e-0064c72f5be6","code":"1FS","name":"Pennine Lancashire Alliance"},"accreditedBody":{"id":"9be9f611-2d36-431a-9109-7fcbbfc88fc8","code":"C99","name":"University of Cumbria"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"The PGCE programme in your chosen subject will give you the necessary knowledge and skills to meet the standards for Qualified Teacher Status (QTS) and the PGCE award. The PGCE carries 60 credits at Masters Level which could later contribute towards a Master’s Degree in Education (180 credits), awarded by the University of Cumbria. This is a full time programme which runs from September to July.\r\n\r\nAs a trainee on the School Direct Programme you will spend the majority of your time in school supported by experienced mentors and teachers who are excellent classroom practitioners.  Weekly conference days will be led by experts from across the Alliance and there will be visits to the University of Cumbria (Lancaster campus) for assignment support and subject pedagogy days.\r\n\r\nTrainees will undertake two placements in different schools within the alliance.  There may also be opportunities to gain further experience in other partner schools and settings depending on individual training needs and areas of interest.\r\n\r\nThere are ten Secondary schools in the partnership, all located within a twenty mile radius:\r\n\r\n* Haslingden High School (lead school)\r\n* Alder Grange School\r\n* All Saints RC High School\r\n* Bacup & Rawtenstall Grammar School\r\n* Clitheroe Royal Grammar School\r\n* Mount Carmel RC High School\r\n* Rhyddings Business & Enterprise School\r\n* St Christopher's CE High School\r\n* Unity College\r\n* Woodhey High School\r\n\r\n\r\n","interviewProcess":"Applicants will need to submit their application through \"apply\" via the DfE website and will be short-listed with reference to the entry requirements and if successful will be invited for interview.  The interview process includes a written task, subject knowledge audit, a short teaching task and a panel interview.  This panel may comprise of a university tutor in addition to staff from the partnership schools.\r\n\r\nBefore applying it is recommended that trainees spend some time observing lessons in a secondary school.\r\n\r\nWe will be looking to recruit high quality graduates who love their subject, are able to engage and inspire young people and who have the potential to become outstanding teachers.\r\n\r\nSuccessful applicants will have energy, enthusiasm and should be able to demonstrate initiative, resilience and a real commitment to a career in the teaching profession.","howSchoolPlacementsWork":"Trainees will undertake two placements in different schools within the alliance.  The first placement runs from September to December and the second from January to June.\r\n\r\nThere are ten Secondary schools in the partnership, all located within a twenty mile radius with a mixture of large, small, urban, rural, faith and grammar schools. You will be teaching in an 11-16 school and in some cases may experience an 11-18 school.\r\n\r\nPlacements are decided after consultation with our partner schools and consideration of the individual needs of the trainee.   Trainees should consider the costs and be prepared to travel to any of our schools within the partnership.  \r\n\r\n\r\n","personalQualities":"We are looking for:- \r\n\r\n* High quality graduates who want to pursue their love of their subject and have a passion for wanting to work with young people\r\n* Energy, enthusiasm, initiative and resilience\r\n* Reflective practitioners, who understand the impact of their behaviours on others and who can model the best\r\n* Good communicators\r\n* Excellent organisational skills\r\n* People who can empathise, empower and inspire to help shape the future\r\n\r\n","otherRequirements":"You should have an understanding of current educational practice and have knowledge of your chosen subject.  School experience is recommended and in certain circumstances, we can help to arrange time in school.\r\n\r\nIf you accept a formal offer of a place you will be required to meet the Department for Education's standards for physical and mental fitness to teach and clearance to work with children. Further information, including a Declaration of Health questionnaire and details of how to apply for a Disclosure and Barring Service (DBS) Enhanced Disclosure will be sent to you after you have firmly accepted an offer.","status":1,"createdAt":"2021-07-06T10:51:00.733Z","updatedAt":"2021-07-06T14:43:53.710Z","canSponsorStudentVisa":"yes","cycle":"2024"}
