{"id":"8e3a15b4-ffa3-4a91-8294-e391660f7878","name":"Chemistry","code":"2VK3","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"912d4fb4-761b-42e9-8dc6-e968b791ea4e","code":"F1","name":"Chemistry"}],"locations":[{"id":"7c4437c3-993e-4d6c-bb1c-bb163eba0798","name":"Redditch/Worcestershire","isPublished":"Y","status":"R","vacancies":"F"},{"id":"62013ae5-fdfa-4d16-98cb-db44e55fbe7c","name":"Dudley","isPublished":"Y","status":"R","vacancies":"F"},{"id":"f060b15a-7ea7-4ff7-9698-b1dd3b58ed94","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"94fb1806-73c6-412f-b58f-21be36b200d8","code":"26A","name":"Teach Central, formerly RSA Academies’"},"accreditedBody":{"id":"62d5803b-89ca-4e21-bb6f-5c74944c56ad","code":"B25","name":"Birmingham City University"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":null,"aboutCourse":"Teach Central, part of Central Region Schools Trust, is led by Good and Outstanding schools across the West Midlands and the wider central region. We work in partnership with all phases of education including - first, primary, middle, high and secondary schools, driving action research projects and pioneering innovation in pedagogical practice.  We strive to optimise the talents and commitment of our staff, through expertise and sharing, to develop creative ways of providing education by working with exceptional trustees and school leaders. \r\n\r\nThe training programmes start with your school experience and will comprise of two contrasting teaching experiences over the course of the year, this will ensure you have access to  a range of teaching strategies.  All trainees will also attend subject and professional studies sessions which are spread throughout the year, these are delivered within our family of schools or at BCU campus.  To complement this, we offer a programme of subject knowledge and enhancement that supports the development of subject pedagogy, to ensure you are fully conversant with curriculum requirements.  The programme combines both academic based assignments and the practical teaching experience.  The assignments range from professional studies to subject specific and trainees are able to submit at master’s level.  You will complete three assignments throughout the year.  One of the assignments is a research project and we have a specialist to deliver the Design Thinking Module to support completion of this project, this is unique to Teach Central.  We offer multi-tiered levels of support to guarantee that our trainees make exceptional progress throughout their training and beyond, also ensuring trainees have access to a wide network of support.  \r\nSchool Direct is a school-based approach to teacher training, which enables you to experience the life of a ‘real’ teacher as you will be based in school from the very start of your training. We are working in partnership with Birmingham City University (BCU),  and on successful completion of the course, you will be awarded a postgraduate certificate in education (PGCE with QTS) with the opportunity to obtain additional Masters’ credits. \r\nTeachers, as experts, support our trainees to develop into the next generation of great practitioners and leaders. Our programme prepares\r\ntrainee teachers to address the needs of all learners and their communities, to overcome disadvantage and barriers to learning and to continually reflect upon the impact of their professional practice.\r\n100% of secondary trainees successfully passed with QTS.\r\n\r\n","interviewProcess":"Teach Central and BCU will check all applications. Those applicants meeting the entry criteria will be shortlisted and invited for interview which will involve:\r\n\r\nA range of tests and activities to test suitability for teaching\r\n*A formal interview which will consist of a three person panel asking a series of questions, covering a variety of topics\r\n*A short interaction with students. This will include a teaching element of up to 30 minutes\r\n*A 30 minute written task. Applicants will be given material to study relating to the task before the interview\r\n\r\n\r\n\r\nOnce all applicants have been interviewed, the Director of ITT and representatives from Teach Central will meet to discuss the outcome of the interviews, and begin to match up potentially successful applicants the allocations available. \r\nOnce a list of selected applicants have been finalised, a provisional offer will be made in writing.  This offer is provisional until several checks and agreements have been made.  \r\n\r\n      These include:\r\n*References (if not already done)\r\n*DBS\r\n*Physical & mental fitness to teach\r\n*Verification of qualifications (if not already done)\r\n\r\n\r\n \r\n\r\n","howSchoolPlacementsWork":"Teach Central is led by Good and Outstanding schools across the West Midlands and the wider central region. Our schools are located in different areas across the Midlands; we can offer training in Birmingham, Dudley, Redditch (South Birmingham), Kidderminster, Worcestershire and Warwickshire. Our training facilities in each of our schools are leading edge and comprehensive to ensure all training needs are met. We also offer specialist training through the large variety of specialisms across, not only our lead schools, but also our strategic partners.  During your training year, you will undertake two high quality school placements across our family of schools.\r\n\r\n\r\nYou will have the opportunity of teaching all age ranges, including Post 16 and have access to teach a second subject to broaden your teaching knowledge and skills - this could be solo teaching or team teaching.  Your experience will also include opportunities to spend dedicated time with our SEND teams, to support your classroom practice.  You will spend a majority of your training in your host school, Sep - July.  You will also undertake a second placement between Jan - Feb for a duration of 6 weeks.  During this time you will also undertake a day in a Primary School setting.  Our programme ensures you experience all key stages and have the opportunity to develop subject knowledge in a second subject.  ","personalQualities":"We are looking for people who have the right personal qualities and potential to be a passionate and committed teacher to improve the outcomes for the young people we work with. While extensive experience of working with young people is not essential, it is often found that the strongest applicants are those who have shown an interest in working with young people.\r\n\r\nWe are looking for :\r\n*Excellent communication and organisational skills\r\n*Commitment to working hard\r\n*Ability to establish good working relationships\r\n*Confidence and ability to engage with children\r\n*Commitment to a professional team\r\n*Commitment to excellence in education\r\n*Flexibility\r\n","otherRequirements":"All entrants have provided suitable references, and have been subject to the Disclosure and Barring Service (DBS).\r\n\r\nFor applicants that have studied outside the United Kingdom must check their qualifications with NARIC (National Academic Recognition Information Centre) before making an application to confirm that their qualifications are of an equivalent level to UK GCSEs, A Levels and undergraduate degrees - 2:2 or equivalent. \r\n\r\nFor more information visit:www.naric.org.uk\r\n\r\nMust be able to demonstrate an ability to communicate clearly and grammatically in spoken and written Standard English.\r\n","status":1,"createdAt":"2021-07-06T10:48:58.579Z","updatedAt":"2021-07-08T09:22:40.709Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"Salaried Trainees are paid at Unqualified Point 1"}
