{"id":"a7b35ae8-cfc3-4c08-947d-4684fc3f1c80","name":"Primary","code":"36MN","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"4_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"6e82301a-517d-405b-a8f1-f2280fc364e6","name":"Main Site","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"16664aaa-855a-4661-9f47-fd211efff093","code":"2GT","name":"Inspire Partnership"},"accreditedBody":{"id":"049fe65f-08dc-4686-9ac8-606dce490128","code":"G56","name":"Goldsmiths, University of London"},"profPost":"PG","degreeGrade":"9","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"School Direct is a one-year initial teacher training programme that leads to Qualified Teacher Status (QTS) and provides schools with the opportunity to deliver in-school teacher training. Within the School Direct route trainees get the opportunity to learn ‘on the job’, but shouldn’t be worried about being thrown in at the deep end. Inspire trainees are part of a team that supports each other and they receiving intensive guidance and mentoring from experienced teachers and leaders. As a family of schools, we work together to provide the best quality of support and experience as trainees learn the art of teaching and develop practice within the classroom. \r\n\r\nInspire Partnership are able to offer both the salaried and unsalaried training route of School Direct Programmes and our programmes are run in partnership with Goldsmiths University. Places for trainees are available at our schools in both Greenwich and Medway. All prospective candidates will need to go through an application and interview process with the Inspire Partnership. Once successful trainees are placed in one of our schools (working in an EYFS, KS1 or KS2 class) they will split their time working in school, training at university, participating in school-based professional development sessions, and visiting and sharing with other trainees across our partnership. \r\n\r\nWorking Alongside Goldsmiths\r\nEnrolling into the Inspire Partnership Schools Direct programme will involve undertaking training with Goldsmiths, University of London, who deliver a comprehensive training programme designed to complement all training and guidance offered in schools. The university programme provides the theory, learning and practice required for the academic award of Professional Graduate Certificate of Education (PGCE). \r\n\r\nWhilst studying with Goldsmiths, trainees will be required to submit two written assignments at Masters level. Trainees will receive comprehensive training and guidance to support them with these academic submissions as well as dedicated practical support each day within their host schools. The Inspire Partnership is proud to continue to work with Goldsmiths University who are recognised as one of the UK's top creative universities as voted for by students. http://www.gold.ac.uk/educational-studies/.\r\n","interviewProcess":"If you would like to apply for either the salaried or un salaried training route, please complete and submit an application expressing your interest through the UCAS website.\r\n\r\nOnce applications have been submitted through the UCAS system, they are forwarded to schools. Applicants that meet our entry criteria are shortlisted and invited to interview. Details of the interview will be communicated at this point. If you are successfully selected following interview we will recommend you to our training partner, Goldsmiths University of London, to make final confirmations before the offer of a place is made. Subsequently, we will contact you with further arrangements regarding your training.\r\n","howSchoolPlacementsWork":"Trainees will be placed in an EYFS, KS1 or KS2 class for the majority of their school placement. In addition to this, they will have the opportunity to be placed in a different school within the partnership, in the alternate key stage, for a shorter secondary placement. This allows trainees a broader experience as they are able to learn in two different settings across the year. Throughout the placements, the Inspire partnership will offer:\r\n\t\r\n*Support from highly skilled teachers and leaders helping you to learn the art of teaching\r\n*Opportunity to work alongside a mentor who is an experienced teacher\r\n*Opportunity to engage in the latest theory and research which underpins out practice\r\n*A comprehensive professional development programme to complement the training received through Goldsmiths as a trainee and beyond\r\n*Practical experience in schools that is personalised to trainees’ individual strengths and needs \r\n","personalQualities":"We are looking for candidates who:\r\n*Express a desire for learning\r\n*Are passionate\r\n*Wish to make a difference to the lives of the children and families within the communities they teach\r\n*Have high expectations and aspirations for all \r\n*Demonstrate strong organisational skills\r\n*Have excellent verbal and written communication skills\r\n*Have excellent attendance and punctuality\r\n\r\nAnd who will be able to:\r\n*Reflect on their practice and listen to feedback\r\n*Work collaboratively \r\n*Build and maintain good relationships with students, staff, parents and governors\r\n*Inspire and motivate those they work with\r\n*Be a positive role model for those around them\r\n*Demonstrate professional behaviours\r\n","status":1,"createdAt":"2021-07-06T10:48:21.143Z","updatedAt":"2021-09-08T14:24:32.285Z","canSponsorStudentVisa":"yes","cycle":"2024"}
