{"id":"2f6e66b0-025d-4122-b73a-ba4aad747a97","name":"Primary","code":"32NY","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"82f6bae0-d268-4b6c-bdc0-11efb00e6aee","name":"Tollbar Multi Academy Trust","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"de7a6a8b-2543-44a0-9e4a-15c2f055509b","code":"162","name":"Tollbar Academy"},"accreditedBody":{"id":"0bc933b8-dad9-4149-8bb2-fd2041d567c2","code":"H72","name":"The University of Hull"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"financialSupport":"Fees and Bursaries \r\nPlease contact the Teacher Education Team on 01482 466028/465974 for information on Fees. \r\n\r\nIf you are an International student from a non-EU country you will be charged the standard overseas student fee.\r\n\r\nTraining bursaries are available for some subjects for all UK and EU postgraduate teacher trainees. For information visit DfE website.\r\n","aboutCourse":"Tollbar Family of Academies is a unique Multi Academy Trust (MAT) led by experienced educationalists responsible for one of the largest and most successful schools in the country. Tollbar MAT aims to offer a world-class, 21st century education to the young people in all its Academies, providing life-long learning opportunities and creating centres of excellence, which model the successful practices at Tollbar Academy, bringing confidence and pride to the local community. To learn more about the Trust visit our website http://www.tollbarmat.co.uk/ \r\n\r\nTollbar MAT works closely with the University of Hull to offer teacher trainees a high quality programme which leads to Qualified Teacher Status (QTS) as well as enabling candidates to achieve a PGCE. The programme is aimed at those who want to teach children in the 5–11 age range, that is, Key Stages 1 and 2. In order to be awarded Qualified Teacher Status trainees must meet the Teachers’ Standards, set by the Government and so the programme is designed to enable trainees to achieve this by offering a balance of school and university-based periods during the year.\r\n\r\nThe PGCE Year Outline\r\nAutumn Term\r\nFor most of the autumn term trainees spend two days each week in school and three days at the university.\r\n\r\nThe university-based days comprise workshops, supplemented by lectures and tutorials, covering the full range of Core and Foundation subjects.  In addition to the subject-based sessions, the Professional Studies Course addresses generic aspects of primary education such as child development, behaviour management, planning, assessment, special educational needs, teaching pupils for whom English is an additional language.  The two days each week that are spent in schools complement the university-based sessions.\r\n\r\nSpring Term\r\nThe first teaching placement period commences straight after Christmas and lasts for eight weeks.  This is preceded by two weeks of preparatory time in the placement school immediately before Christmas.  Trainees are expected to take responsibility for whole classes of pupils, with a teaching load of 60-65% encompassing a range of subjects.  \r\n\r\nSummer Term\r\nThe summer term is devoted to the final teaching placement which, like the spring term placement, lasts for eight weeks and is preceded by two weeks of preparatory time in school.  Again, trainees are expected to teach whole classes of pupils across a range of subjects, but with a slightly increased workload of 70-75%.  \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n","interviewProcess":"Applications should be made as early as possible, of the academic year immediately preceding the proposed date of entry.\r\n\r\nSuitable applicants will be called for interview. The interview process will involve staff from Tollbar MAT and University of Hull. Candidates will complete a teaching task and formal interview as part of the process. Full details are sent to each candidate who has been selected for interview. \r\n\r\nFor more information contact: \r\nPaul Donnelly - HR Officer and School Development for Tollbar MAT\r\nEmail: donnellyp@tollbarmat.org\r\nPhone: 01472 502299\r\n\r\nTeacher Education Team, Faculty of Arts, Cultures and Education, School of Education and Social Sciences, University of Hull, Hull, HU6 7RX\r\nTel: 01482 466028/465974\r\n\r\n","howSchoolPlacementsWork":"Teaching Placements\r\nTrainees undertake two periods of teaching; one in the spring term and one in the summer. All trainees have two school placements and teach in two Academies within Tollbar MAT. Each placement is of eight weeks’ duration and is preceded by two weeks of preparatory time in the placement school.  The aim is to give every trainee a wide range of experience, encompassing pupils of different ages and schools of different size and type. \r\n\r\nTollbar MAT has extensive experience in supporting trainees through their placements. Staff at each of our Academies have a vast experience of supporting and guiding trainees to develop their craft. The Trust is keen to develop reflective practitioners who are passionate about delivering a high class education to our students. Subject mentors have received the necessary training from the University and are highly competent practitioners who are keen to aid the development of trainees. The Trust also allocates a senior member of staff on each site to oversee the support that trainees receive. During placements, bespoke sessions are ran for trainees to enhance their knowledge which underpins their classroom experiences.\r\n\r\nFor each teaching placement, trainees are assigned a university tutor who offers support and guidance before and during the placement.  This complements the role of the school mentor, who is able to monitor and assist the trainees’ development on a day-to-day basis.  University tutors and school mentors work closely in partnership with one another to ensure the best possible outcomes for all trainees.\r\n\r\nDuring the year trainees will have the opportunity to teach all primary curriculum subjects, with an emphasis on English and mathematics.  The overall teaching load for the spring placement is 60-65%, with an increase in the summer to 70-75%.  This provides a firm basis for the 80% teaching load during the NQT year.\r\n\r\n\r\n\r\n","personalQualities":"What We Are Looking For:\r\n\r\n- A commitment to primary education\r\n- An ability to motivate and inspire children of all abilities\r\n- Energy and enthusiasm\r\n- Effective interaction with children\r\n- An ability to work under pressure\r\n- Perseverance and flexibility\r\n- Oral and written communication skills\r\n- The ability to work co-operatively\r\n- An awareness of current educational issues\r\n- A broad subject-knowledge base\r\n- Reflection, self-evaluation and a willingness to learn\r\n- Awareness of what being a primary teacher entails\r\n","otherRequirements":"ICT competence\r\nPrior to interview, candidates must possess a reasonable level of competence and familiarity with ICT. \r\n\r\nExperience in primary classrooms\r\nPrior to interview, candidates must possess relevant evidence of experience related to working with children and teachers in the primary age range.\r\n\r\nProtection of Children\r\nAdmission to all Initial Teacher Training programmes will be subject to the relevant Disclosure and Barring Service enhanced checks. Entrants to Initial Teacher Training also have to show 'physical and mental fitness' to teach and will be asked to provide evidence in both respects along with completing a self-disclosure form.","status":1,"createdAt":"2021-07-06T10:52:30.409Z","updatedAt":"2021-09-30T15:17:37.655Z","canSponsorStudentVisa":"yes","cycle":"2024"}
