{"id":"cf18e849-6dcb-4438-8ed6-cbffdebeb49e","name":"Physics","code":"U464","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SC","studyMode":"P","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"bf97cd0a-224c-43d3-a021-84143df13e8d","code":"F3","name":"Physics"}],"locations":[{"id":"a2599994-404d-49b2-9b36-18f110eff24b","name":"OTT Southern Hub","isPublished":"Y","status":"R","vacancies":"P"},{"id":"5b6211c3-27ea-4256-9d49-511bfa611053","name":"OTT Northern Hub","isPublished":"Y","status":"R","vacancies":"P"},{"id":"d2c15b64-ebc7-4817-880e-814a5cc6c89b","name":"OTT Central Hub","isPublished":"Y","status":"R","vacancies":"P"}],"trainingProvider":{"id":"191401fe-efde-439a-8fbd-5c4a54b3e442","code":"24T","name":"Oxfordshire Teacher Training"},"accreditedBody":{"id":"74499090-bd95-469a-b55a-35eed0e51a0d","code":"1DE","name":"Oxfordshire Teacher Training"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We are not currently offering equivalency tests through OTT SCITT, but we can recommend third parties.  We ask candidates to get in touch with us for advice and deadlines prior to application.","courseLength":"TwoYears","feesUK":11250,"feesInternational":11250,"feeDetails":"The tuition fee for the PGCE & QTS programme is £11,250. The tuition fee for the QTS only programme is £10,150.\r\n\r\n\r\nAll successful, eligible candidates have the option of adding a Master's level PGCE to their programme; the tuition fee for the QTS and PGCE programme is £11,250.\r\n\r\nYou don't have to make a decision about undertaking the PGCE at the point of application, there is plenty of time to decide whether it's for you. There isn't a separate application process for the PGCE, you will be asked to decide before the training programme begins and your fee code/ fee amount will be adjusted accordingly. We have separate codes on the Apply system for the different routes, but if you are undecided at this stage you can apply for either. \r\n","financialSupport":"No further financial support is available from the partnership. The Central Team is able to offer support if students wish to make a claim for Disabled Students Allowance.\r\n\r\n","aboutCourse":"Our inspiring training programmes are carefully crafted to ensure the right balance of ‘theory and practise'. The curriculum, based on our seven core areas, has been designed by a committed team at Oxfordshire Teacher Training and is delivered by a range of expert colleagues who combine their extensive knowledge of the current school system with principles, research and theories drawn from the most recent and relevant sources. Our designated Subject Specialists are exceptional practitioners in their subject areas and work closely with the OTT SCITT team to ensure a coherent, focused and flexible approach.  A range of visits and external speakers are threaded throughout the programme to motivate, inspire and deepen your understanding. \r\n\r\nA crucial aspect is the innovative structure which starts with our summer ‘Induction Week’ at the beginning of July, which prepares you to spend the first few vital days of September in your placement school. Our Associate Teachers recognise the importance of this and really value being part of the team from the outset. After the Induction Week, the Rapid Development Programme begins in September and provides you with focused support and guidance to develop and test out your ‘teacher’s toolkit’. The time during this intensive programme is divided between training sessions and time in your first placement school. This combined programme of training, theory and practice continues throughout the rest of the programme, into a second, contrasting placement. Each of our training programmes is for a specified age range and beyond that we offer lots of additional opportunities to work with and learn about other age groups.\r\n\r\nAs an Associate Teacher you will collect evidence and reflections to support your development throughout the three, key phases of the programme. This is a continual process and regular advice and guidance is given about the best forms of evidence to use to show progress. You will have a designated ‘Visiting Tutor’ who will visit you at different stages throughout the programme to monitor your progress and assess the evidence that you have collected. An essay will also be required for each of the three modules of the PGCE element, should you choose to undertake it. \r\n\r\nBasic hours at placement schools and training will be approximately 8:00am-4:00pm and on limited occasions you may be required to attend additional events after school.  For the part-time programme you will attend 3 days a week (Wednesday, Thursday, Friday) from September 2022-December 2023. \r\n","interviewProcess":"Our recruitment and selection process is carefully designed to allow us to make the right decisions as a partnership and to give applicants an insight into how we operate as an ITT provider. During all stages of the recruitment and selection process you will be assessed against our Associate Teacher [Person Specification]( http://oxfordshireteachertraining.co.uk/wp-content/uploads/2018/09/AT-Person-Specification.pdf)\r\n\r\nShortlisted candidates will be invited to a recruitment and selection process, which will be a half-day (AM or PM) online process, involving a number of elements which give you an opportunity to demonstrate your skills and suitability for teaching in a range of contexts.  Candidates who are invited to interview will receive full and detailed instructions regarding the day in advance, but do also have a look at our website to get a sense of what to expect and what you may need to prepare. The different elements of the recruitment and selection day will be assessed by a panel made up of key members of our SCITT Team and colleagues from our partnership of schools.\r\n\r\nCandidates can expect to complete:\r\n●\tan interview \r\n●\ta lesson/planning activity\r\n●\ta group task\r\n●\ta subject knowledge task\r\n●\ta document check \r\n\r\nWe encourage all applicants to find out more about the application and recruitment process by reading the full details online and also by attending one of our [information events or application workshops](https://oxfordshireteachertraining.co.uk/events/) \r\n","howSchoolPlacementsWork":"Your two placements will be carefully selected to ensure that they give excellent, but contrasting experiences and we are able to be geographically specific to limit travel times as much as possible. We have a committed and growing partnership of schools and in each year work with around 75 individual schools.\r\n\r\nThe part-time programme has two placements, one runs for the whole academic year in your first year (September-July) and the second runs from September of your second year until the end of the programme in December. There are regular training and subject specialist days throughout the programme which ensure that you have ongoing input and inspiration as well as giving you an opportunity to meet the rest of your cohort and catch up with the OTT SCITT team.\r\n\r\nJuly 2022 Orientation and Induction Week:\r\n* part-time Associate Teachers will attend at least three days, and ideally all five.\r\n\r\nSeptember 2022 – October 2022: The Rapid Development Programme:\r\n* 2 days a week of training, 1 day in placement school.\r\nNovember 2022 – July 2023:\r\n* 3 days a week mostly spent in first placement school with ongoing training.\r\nSeptember 2023 – December 2023:\r\n* 3 days a week in second placement school with the option of attending training sessions if appropriate.\r\n\r\nAs a partnership we invest heavily in our partner schools and this means you will have an expert school-based Mentor and a designated Senior Link in each placement school and they will be trained by, and work closely with the OTT SCITT team to ensure that you have great input and support which allows you to develop rapidly:\r\n‘Mentors are enthusiastic about their role, take their responsibility seriously and feel privileged to contribute to trainees’ development. They provide practical guidance and rightly focus on pupils’ progress. Through mentors’ patience and empathy, together with encouraging but candid feedback, trainees are able to reflect deeply upon learning and the craft of the classroom. One commented, ‘I feel that my mentor really knew how I taught’. (Ofsted report).\r\n","personalQualities":"Our Person Specification has been carefully developed by the partnership and is the basis for the recruitment process. Full details and our [Person Specification](https://oxfordshireteachertraining.co.uk/wp-content/uploads/2018/09/AT-Person-Specification.pdf) can be found on our [website](https://oxfordshireteachertraining.co.uk/)","otherRequirements":"We run a range of [Information Events and Application Support Workshops] (https://oxfordshireteachertraining.co.uk/events/) for all applicants.\r\n\r\nSuccessful candidates will also be required to undertake statutory safer recruitment checks, such as an enhanced DBS check and ‘fitness to teach’ check, more information can be found on our [website] (https://oxfordshireteachertraining.co.uk/) and will be given after interview.  \r\n\r\n","status":1,"createdAt":"2021-07-06T10:52:48.407Z","updatedAt":"2021-10-04T21:20:35.403Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
