{"id":"2877d225-10cb-43cd-9039-74ceefc95148","name":"Modern Languages (French and Spanish)","code":"38B4","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"9727f674-61ba-4efa-b1f2-21ec7e354442","code":"15","name":"French"},{"id":"ce8523ef-9236-4cd9-b260-d826c7a521b3","code":"ML","name":"Modern Languages"},{"id":"e34fd2a3-a32e-44e9-aea1-666badf3ac03","code":"22","name":"Spanish"}],"locations":[{"id":"399548ee-8562-489d-acab-48c2667075be","name":"Inspiration Teaching School Hub","isPublished":"Y","status":"R","vacancies":"F"},{"id":"fc8bdcf3-732a-4666-9bcb-8e81ce3808f9","name":"Jane Austen College","isPublished":"N","status":"S","vacancies":"F"},{"id":"80e5c1d5-a0ca-46ed-bd48-12e2609e7e70","name":"Great Yarmouth Charter Academy","isPublished":"N","status":"S","vacancies":"F"},{"id":"361a9f46-8b75-4116-81fa-cc5149d76c9c","name":"The Thetford Academy","isPublished":"N","status":"S","vacancies":"F"},{"id":"c613ce93-42e3-4546-a17e-e33474066cd7","name":"Cromer Academy","isPublished":"N","status":"S","vacancies":"F"},{"id":"94948e05-e3a3-4b3c-86d3-140955e81dee","name":"Hethersett Academy","isPublished":"N","status":"S","vacancies":"F"},{"id":"56a77ef8-6675-4708-b263-fd21367da163","name":"East Point Academy","isPublished":"N","status":"S","vacancies":"F"},{"id":"b8268e78-69e5-4c5f-b597-b06abbb96839","name":"Hewett Academy","isPublished":"N","status":"S","vacancies":"F"},{"id":"7ac23936-29e3-4279-8b73-c474e631a5c3","name":"Wayland Academy","isPublished":"N","status":"S","vacancies":"F"}],"trainingProvider":{"id":"bc521f39-a325-4273-9604-4d07338970be","code":"2H7","name":"Inspiration Teacher Training"},"profPost":"PG","degreeGrade":"1","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"This is a course for talented linguists who want to teach French and/or Spanish in schools. You should have a belief in the emancipatory power of languages, and how mastery over another language opens up other worlds – travel, literature, employment, culture – to those who learn them. People who are fascinated by other cultures see language as inseparable from the human experience. Linguists are utterly intrigued by the complexity of language, its properties, and the way in which meaning is enshrined within it. You will have an interest in the deeper structures of language shared across different languages, and what this reveals about the way we communicate with others as humans. Trainees who follow this course have an absolute commitment to communication in all its forms, including the spoken and written word. In a modern globalised world, the ability to speak a second or third language opens doors to employment across the globe. If you have this deep love of languages and you want to inspire a similar love in pupils, then this course is for you.\r\n\r\nIn this course you will learn about language acquisition and the way in which people learn additional languages. You will study common errors and misconceptions that pupils develop, and how these can be predicted, mitigated, and overcome. You will study the grammar of your language, and what it means to study and learn grammar in the context of learning to speak a language. You will learn about different curriculum models in languages, how these are structures, and how they are assessed, including at GCSE and A Level.\r\n\r\nOne of the most distinctive characteristics of Inspiration Teacher Training is the value it places on the richness of knowledge. Firstly, you will deepen your knowledge within your subject specialism, including of literature in your language. Secondly, you will develop professional knowledge to support your subject specialism. You will survey a range of educational research which will shape your teaching practice as you develop a better understanding about learning, reading and memory.","interviewProcess":"If your application is shortlisted you will be invited to a selection day which will be held in one of our partnership schools. You will spend the day with mentors and with students, taking part in tasks including delivering a presentation, completing a written task, observing and analysing a lesson, and completing an interview. \r\nThe day will give you an insight into what it will be like to work in one of our schools, along with the opportunity to ask questions and meet members of our teaching team.\r\nWe aim to provide applicants with a decision within a week following the selection day. Depending on the outcome of the day we also offer a phone call to provide feedback on your performance during the tasks.\r\n","howSchoolPlacementsWork":"Trainees will have two placements, each in one of our alliance of primary, secondary, and sixth form schools across East Anglia. We have 13 schools within our Trust and additional partnership schools which we are able to place you in, please see [here] (http://www.inspirationtrust.org/page/?title=Where+will+my+placements+be%3F&pid=1029) for a map of where our placement schools are located. \r\nWe will try to place you in schools that are convenient for you, with priority given to trainees who have families to care for. Where possible, we will do our best to ensure your commute time is no longer than 40 minutes. \r\nIf you are on a Primary course you will be teaching pupils in the age range of 5-11. If you are on a secondary course you will be teaching pupils in the age range of 11-16 with post 16 enhancement. \r\n","personalQualities":"","otherRequirements":"If you are successful in gaining a place on our course we will need to complete suitability checks related to safeguarding, require confirmation of your health and fitness and will also need to obtain satisfactory references.\r\nThese checks are initiated by us and form part of our on boarding procedures.","status":1,"createdAt":"2021-07-06T10:55:53.723Z","updatedAt":"2021-07-27T08:26:02.387Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
