{"id":"49ef7fe3-679f-445e-9897-324d32d92944","name":"Primary with Mathematics","code":"389H","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"286cf12f-b3e3-41c5-9f33-2ff7807d2df0","code":"03","name":"Primary with mathematics"}],"locations":[{"id":"4f696059-c042-465f-a6bf-74e8b7287b70","name":"Norwich Primary Academy","isPublished":"N","status":"S","vacancies":"F"},{"id":"5c0976e9-0d98-49bd-9d66-a8c2326b32d4","name":"Cobholm Primary Academy","isPublished":"N","status":"S","vacancies":"F"},{"id":"fcd2af9d-0c53-45e7-82b8-0c4a06d9721b","name":"Stradbroke Primary Academy","isPublished":"N","status":"S","vacancies":"F"},{"id":"1ff3c266-df55-43cb-ac32-8f9f195ba8f9","name":"Charles Darwin Primary School","isPublished":"N","status":"S","vacancies":"F"},{"id":"b1a9dfcd-32e6-4184-9ee5-ee55c8dcc361","name":"Cottenham Primary School","isPublished":"N","status":"S","vacancies":"F"},{"id":"2c8e0089-7965-40cf-92f5-42a3f62599c0","name":"Great Yarmouth Primary Academy","isPublished":"N","status":"S","vacancies":"F"},{"id":"23dbd8a5-ef5c-4b2e-99f7-65d3d63c9e32","name":"Willingham Primary School","isPublished":"N","status":"S","vacancies":"F"},{"id":"399548ee-8562-489d-acab-48c2667075be","name":"Inspiration Teaching School Hub","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"bc521f39-a325-4273-9604-4d07338970be","code":"2H7","name":"Inspiration Teacher Training"},"profPost":"PG","degreeGrade":"1","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Our primary courses are designed to train you to teach in a primary school. Primary school teachers usually have one class of pupils to whom they teach all subjects. This means that a primary course needs to place a strong emphasis on building up your expertise in all of the subjects that you will teach. Some of this will be taught in our Curriculum Centre in Norwich and some will be taught in schools. It is not possible to master all the subjects you have to teach in your training year, but you will get a decent introduction to each one and a number of chances to practise teaching each subject. \r\n\r\nAll our primary trainees train in a particular subject specialism; this course is for trainees who wish to specialise in maths. We also offer specialist subjects of English, natural sciences, or humanities - if you wish to specialise in one of these, then please apply for the primary (general) course; you will choose your subject specialism once you have been accepted onto the course.\r\n\r\nEarly in the course you will have an intensive focus on teaching phonics. Learning phonics is a crucial stage in learning to read well, and getting this right at an early stage in primary school is of the utmost importance. You will learn about strategies for teaching phonics, and get the chance to practise these regularly in schools. The same is true of basic numeracy. Young children need to learn their number bonds before they can do more complex mathematics. You will learn about different methods of teaching numeracy, the misunderstandings that children often have, and what you as a teacher can do about this. \r\n\r\nYou will learn to teach well through professional practice and through critically reflecting on your own practice. Your school placements within the course will give you the opportunity to teach, to observe, to practise, to experiment, and to innovate. You have the opportunity to reflect upon your own practice within your school context. As a course entitlement, you will have the time to discuss this with you school-based subject mentor; you can then identify the ways in which you need to develop as a specialist and as a professional. What results is a highly personalised programme in which, through dialogue with your mentor, you develop your teaching style, practice, and ideas in a bespoke way.","interviewProcess":"If your application is shortlisted you will be invited to a selection day which will be held in one of our partnership schools. You will spend the day with mentors and with students, taking part in tasks including delivering a presentation, completing a written task, observing and analysing a lesson, and completing an interview. \r\nThe day will give you an insight into what it will be like to work in one of our schools, along with the opportunity to ask questions and meet members of our teaching team.\r\nWe aim to provide applicants with a decision within a week following the selection day. Depending on the outcome of the day we also offer a phone call to provide feedback on your performance during the tasks.\r\n","howSchoolPlacementsWork":"Trainees will have two placements, each in one of our alliance of primary, secondary, and sixth form schools across East Anglia. We have 13 schools within our Trust and additional partnership schools which we are able to place you in, please see [here] (http://www.inspirationtrust.org/40/school-placements) for a map of where our placement schools are located. \r\nWe will try to place you in schools that are convenient for you, with priority given to trainees who have families to care for. Where possible, we will do our best to ensure your commute time is no longer than 40 minutes. \r\nIf you are on a Primary course you will be teaching pupils in the age range of 5-11. If you are on a secondary course you will be teaching pupils in the age range of 11-16 with post 16 enhancement. \r\n \r\n","personalQualities":"","otherRequirements":"If you are successful in gaining a place on our course we will need to complete suitability checks related to safeguarding, require confirmation of your health and fitness and will also need to obtain satisfactory references.\r\nThese checks are initiated by us and form part of our on boarding procedures.","status":1,"createdAt":"2021-07-06T10:55:53.313Z","updatedAt":"2021-07-27T08:23:17.953Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
