{"id":"6354c14d-b19b-4182-9fcf-ce5cbd70d633","name":"Physics","code":"38B6","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"bf97cd0a-224c-43d3-a021-84143df13e8d","code":"F3","name":"Physics"}],"locations":[{"id":"fc8bdcf3-732a-4666-9bcb-8e81ce3808f9","name":"Jane Austen College","isPublished":"N","status":"S","vacancies":"F"},{"id":"b8268e78-69e5-4c5f-b597-b06abbb96839","name":"Hewett Academy","isPublished":"N","status":"S","vacancies":"F"},{"id":"399548ee-8562-489d-acab-48c2667075be","name":"Inspiration Teaching School Hub","isPublished":"Y","status":"R","vacancies":"F"},{"id":"361a9f46-8b75-4116-81fa-cc5149d76c9c","name":"The Thetford Academy","isPublished":"N","status":"S","vacancies":"F"},{"id":"56a77ef8-6675-4708-b263-fd21367da163","name":"East Point Academy","isPublished":"N","status":"S","vacancies":"F"},{"id":"7ac23936-29e3-4279-8b73-c474e631a5c3","name":"Wayland Academy","isPublished":"N","status":"S","vacancies":"F"},{"id":"94948e05-e3a3-4b3c-86d3-140955e81dee","name":"Hethersett Academy","isPublished":"N","status":"S","vacancies":"F"},{"id":"80e5c1d5-a0ca-46ed-bd48-12e2609e7e70","name":"Great Yarmouth Charter Academy","isPublished":"N","status":"S","vacancies":"F"},{"id":"c613ce93-42e3-4546-a17e-e33474066cd7","name":"Cromer Academy","isPublished":"N","status":"S","vacancies":"F"}],"trainingProvider":{"id":"bc521f39-a325-4273-9604-4d07338970be","code":"2H7","name":"Inspiration Teacher Training"},"profPost":"PG","degreeGrade":"1","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"This course is for passionate physicists who would like to share their subject with young people to empower them to go on to live more fulfilling lives. You may have just finished your degree, Masters, or PhD, spent time in industry, worked to some capacity in schools already, or be completing a successful career and would like to spend some purposeful years sharing your experience.\r\n\r\nBeing a teacher is one of the most rewarding careers imaginable. Science is a fundamental part of our everyday lives, both in the way that we think and the way that we live. Our students are growing into a world of increasingly sophisticated applications of science and the vast majority of careers will involve at least some degree of scientific understanding. Physics has a particularly crucial role in our rapidly developing world; the explosive growth of our communication systems, the rapid development of new energy sources and our (desperately needed) development of more sustainable vehicles are just a few of these.\r\n\r\nThe Inspiration Trust draws together a unique range of science departments from a very special group of schools, including a sixth form specialist maths and science college, exciting new free schools, rapidly developing schools in challenging areas, and established high-performing schools.\r\n\r\nYou would be learning your profession within the context of a trust that is continually pushing the envelope in terms of contemporary pedagogy while applying an unparalleled determination to improve the life chances of students in East Anglia.\r\n\r\nYour science studies will be led by two highly experienced and inspirational tutors. Both have worked as heads of subject, heads of department, and senior leaders. Between them they share experience of classroom research, writing exam papers, writing a PGCE course, and the use of ICT in education at an international level. Both tutors still teach on a weekly basis and will continue to do so as they train you.\r\n\r\nThroughout the course you will develop the subject and professional knowledge to join the wider teaching community as an able practitioner, research-led, confident in practical work, and able to communicate sensitively with students from all walks of life. You will become an excellent teacher.","interviewProcess":"If your application is shortlisted you will be invited to a selection day which will be held in one of our partnership schools. You will spend the day with mentors and with students, taking part in tasks including delivering a presentation, completing a written task, observing and analysing a lesson, and completing an interview. \r\nThe day will give you an insight into what it will be like to work in one of our schools, along with the opportunity to ask questions and meet members of our teaching team.\r\nWe aim to provide applicants with a decision within a week following the selection day. Depending on the outcome of the day we also offer a phone call to provide feedback on your performance during the tasks.\r\n","howSchoolPlacementsWork":"Trainees will have two placements, each in one of our alliance of primary, secondary, and sixth form schools across East Anglia. We have 13 schools within our Trust and additional partnership schools which we are able to place you in, please see [here] (http://www.inspirationtrust.org/40/school-placements) for a map of where our placement schools are located. \r\nWe will try to place you in schools that are convenient for you, with priority given to trainees who have families to care for. Where possible, we will do our best to ensure your commute time is no longer than 40 minutes. \r\nIf you are on a Primary course you will be teaching pupils in the age range of 5-11. If you are on a secondary course you will be teaching pupils in the age range of 11-16 with post 16 enhancement. \r\n","personalQualities":"","otherRequirements":"If you are successful in gaining a place on our course we will need to complete suitability checks related to safeguarding, require confirmation of your health and fitness and will also need to obtain satisfactory references.\r\nThese checks are initiated by us and form part of our on boarding procedures.","status":1,"createdAt":"2021-07-06T10:55:53.789Z","updatedAt":"2021-07-27T08:24:50.021Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
