{"id":"6e8dd141-90e8-4fd9-93cc-2156ffc1aeff","name":"Biology","code":"T185","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"322cfc19-d51d-45db-91e3-bd7b4738470f","code":"C1","name":"Biology"}],"locations":[{"id":"56a77ef8-6675-4708-b263-fd21367da163","name":"East Point Academy","isPublished":"N","status":"S","vacancies":"F"},{"id":"94948e05-e3a3-4b3c-86d3-140955e81dee","name":"Hethersett Academy","isPublished":"N","status":"S","vacancies":"F"},{"id":"399548ee-8562-489d-acab-48c2667075be","name":"Inspiration Teaching School Hub","isPublished":"Y","status":"R","vacancies":"F"},{"id":"fc8bdcf3-732a-4666-9bcb-8e81ce3808f9","name":"Jane Austen College","isPublished":"N","status":"S","vacancies":"F"},{"id":"361a9f46-8b75-4116-81fa-cc5149d76c9c","name":"The Thetford Academy","isPublished":"N","status":"S","vacancies":"F"},{"id":"c613ce93-42e3-4546-a17e-e33474066cd7","name":"Cromer Academy","isPublished":"N","status":"S","vacancies":"F"},{"id":"80e5c1d5-a0ca-46ed-bd48-12e2609e7e70","name":"Great Yarmouth Charter Academy","isPublished":"N","status":"S","vacancies":"F"},{"id":"b8268e78-69e5-4c5f-b597-b06abbb96839","name":"Hewett Academy","isPublished":"N","status":"S","vacancies":"F"},{"id":"7ac23936-29e3-4279-8b73-c474e631a5c3","name":"Wayland Academy","isPublished":"N","status":"S","vacancies":"F"}],"trainingProvider":{"id":"bc521f39-a325-4273-9604-4d07338970be","code":"2H7","name":"Inspiration Teacher Training"},"profPost":"PG","degreeGrade":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Who is this course for?\r\nThis course is for candidates who have a degree with substantial science content. This degree should either have some biology content or candidates should possess a biology A-level (in this instance a biology subject knowledge enhancement course will be provided for successful candidates)\r\n\r\nWe welcome candidates at all stages of their working life. Support and training will be given throughout the course to refresh and strengthen subject knowledge.\r\n\r\nWhat will I study? \r\nThe course explores the relationship between each of the science disciplines in relation to developing a student’s deeper knowledge of biology. An example would be the similarities and differences between energy as a concept in biology, chemistry and physics. We will ensure trainees have relevant knowledge of the English and mathematics curriculum so they can be efficient and precise teachers of science.  We will teach you how to use the latest research into cognitive science to deliver lessons that maximise the progress of all students, including those from less advantaged backgrounds.\r\n\r\nHuman nature drives individuals to make sense of the world around them. It is this predisposition which underpins science as a discipline but also leads to non-scientists drawing their own conclusions from their everyday experiences. These inferences can become the bedrock of an individual’s understanding of the scientific principles that govern the world. During the course trainees learn to recognise when their students possess a commonly held misconception and how as a teacher they can address these issues. There is an emphasis on how this would structure the nature of science lessons and what progress in understanding ‘looks like’.\r\n\r\nThe course provides trainees with plentiful opportunities to develop the ability to lead whole-class practical work with confidence; and deliver memorable but purposeful demonstrations in purpose-built facilities.. The role of practical work is critically evaluated with particular attention given to the use of such activities as: memorable teaching moments;  inspirational science; and the development of the scientific way of thinking. ","interviewProcess":"If your application is shortlisted you will be invited to a selection day. The selection day is a half-day and will be based at the Inspiration Teaching School Hub, Norwich. You will complete a number of tasks during the day which will include:\r\n\r\n* A formal interview\r\n* A presentation task \r\n* A reading aloud task\r\n* A written task\r\n* A numeracy task \r\n\r\nThe interview panel will usually consist of the phase lead, the course lead and the course manager. We will provide you with guidance on what we are looking for in each task prior to your selection day. \r\n\r\nThe day will give you an insight into what it will be like to work in one of our schools, along with the opportunity to ask questions and meet members of our teaching team. We aim to provide you with a decision within 3 working days of your selection day and offer feedback on your performance. You will be notified initially through Apply and if you are successful with a follow-up email outlining any conditions that we have set and the next steps. ","howSchoolPlacementsWork":"Trainees will have two placements, each in one of our alliance of primary, secondary, and sixth form schools across Norfolk. We have 13 schools within our Trust and additional partnership schools which we are able to place you in, please see [here] (http://www.inspirationtrust.org/40/school-placements) for details of where our placement schools are located. \r\nWe will try to place you in schools that are convenient for you, with priority given to trainees who have families to care for. Where possible, we will do our best to ensure your commute time is no longer than 40 minutes. \r\nIf you are on a Primary course you will be teaching pupils in the age range of 5-11. If you are on a secondary course you will be teaching pupils in the age range of 11-16 with post 16 enhancement. ","personalQualities":"","otherRequirements":"If you are successful in gaining a place on our course we will need to complete suitability checks related to safeguarding, require confirmation of your health and fitness and will also need to obtain satisfactory references. These checks are initiated by us and form part of our on boarding procedures. ","status":1,"createdAt":"2021-10-07T11:45:35.545Z","updatedAt":"2021-10-07T11:47:58.585Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
