{"id":"7355177e-6070-49ed-abb4-c2f179f1e1a6","name":"Geography","code":"H857","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3f47e67b-7fa5-4947-a5a0-74d528cd2a87","code":"F8","name":"Geography"}],"locations":[{"id":"b8268e78-69e5-4c5f-b597-b06abbb96839","name":"Hewett Academy","isPublished":"N","status":"S","vacancies":"F"},{"id":"56a77ef8-6675-4708-b263-fd21367da163","name":"East Point Academy","isPublished":"N","status":"S","vacancies":"F"},{"id":"399548ee-8562-489d-acab-48c2667075be","name":"Inspiration Teaching School Hub","isPublished":"Y","status":"R","vacancies":"F"},{"id":"7ac23936-29e3-4279-8b73-c474e631a5c3","name":"Wayland Academy","isPublished":"N","status":"S","vacancies":"F"},{"id":"fc8bdcf3-732a-4666-9bcb-8e81ce3808f9","name":"Jane Austen College","isPublished":"N","status":"S","vacancies":"F"},{"id":"361a9f46-8b75-4116-81fa-cc5149d76c9c","name":"The Thetford Academy","isPublished":"N","status":"S","vacancies":"F"},{"id":"c613ce93-42e3-4546-a17e-e33474066cd7","name":"Cromer Academy","isPublished":"N","status":"S","vacancies":"F"},{"id":"80e5c1d5-a0ca-46ed-bd48-12e2609e7e70","name":"Great Yarmouth Charter Academy","isPublished":"N","status":"S","vacancies":"F"},{"id":"94948e05-e3a3-4b3c-86d3-140955e81dee","name":"Hethersett Academy","isPublished":"N","status":"S","vacancies":"F"}],"trainingProvider":{"id":"bc521f39-a325-4273-9604-4d07338970be","code":"2H7","name":"Inspiration Teacher Training"},"profPost":"PG","degreeGrade":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"As a Geography teacher, you will be passionate about developing young people into global citizens with a rich knowledge of our ever-changing world. \r\n\r\nYou will learn how to design and deliver a knowledge-rich Geography curriculum based on the most up-to-date, evidence-informed practice. You will learn the conceptual basis of the subject and how to build students’ knowledge of locations, places, human and physical processes and fieldwork. Throughout the course, you will understand how to embed key concepts like human-environment interactions, varying viewpoints and sustainability within your teaching. We believe in developing teachers who give students the highest quality geographical education, teaching powerful geographical knowledge which will allow them to take full part in salient contemporary debates and live lives with a greater understanding of the world.\r\n","interviewProcess":"If your application is shortlisted you will be invited to a selection day. The selection day is a half-day and will be based at the Inspiration Teaching School Hub, Norwich. You will complete a number of tasks during the day which will include:\r\n\r\n* A formal interview\r\n* A presentation task \r\n* A reading aloud task\r\n* A written task\r\n* A numeracy task \r\n\r\nThe interview panel will usually consist of the phase lead, the course lead and the course manager. We will provide you with guidance on what we are looking for in each task prior to your selection day. \r\n\r\nThe day will give you an insight into what it will be like to work in one of our schools, along with the opportunity to ask questions and meet members of our teaching team. We aim to provide you with a decision within 3 working days of your selection day and offer feedback on your performance. You will be notified initially through Apply and if you are successful with a follow-up email outlining any conditions that we have set and the next steps. ","howSchoolPlacementsWork":"Trainees will have two placements, each in one of our alliance of primary, secondary, and sixth form schools across Norfolk. We have 13 schools within our Trust and additional partnership schools which we are able to place you in, please see [here] (http://www.inspirationtrust.org/40/school-placements) for details of where our placement schools are located. \r\nWe will try to place you in schools that are convenient for you, with priority given to trainees who have families to care for. Where possible, we will do our best to ensure your commute time is no longer than 40 minutes. \r\nIf you are on a Primary course you will be teaching pupils in the age range of 5-11. If you are on a secondary course you will be teaching pupils in the age range of 11-16 with post 16 enhancement. ","personalQualities":"","otherRequirements":"If you are successful in gaining a place on our course we will need to complete suitability checks related to safeguarding, require confirmation of your health and fitness and will also need to obtain satisfactory references. These checks are initiated by us and form part of our on boarding procedures. ","status":1,"createdAt":"2021-10-07T13:39:26.697Z","updatedAt":"2021-10-07T13:41:03.334Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
