{"id":"b26300d9-9d73-4f7b-9887-c137ece9d3c0","name":"Mathematics","code":"38B3","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"72345aa7-096c-488f-8649-085b8178cadb","code":"G1","name":"Mathematics"}],"locations":[{"id":"399548ee-8562-489d-acab-48c2667075be","name":"Inspiration Teaching School Hub","isPublished":"Y","status":"R","vacancies":"F"},{"id":"361a9f46-8b75-4116-81fa-cc5149d76c9c","name":"The Thetford Academy","isPublished":"N","status":"S","vacancies":"F"},{"id":"c613ce93-42e3-4546-a17e-e33474066cd7","name":"Cromer Academy","isPublished":"N","status":"S","vacancies":"F"},{"id":"fc8bdcf3-732a-4666-9bcb-8e81ce3808f9","name":"Jane Austen College","isPublished":"N","status":"S","vacancies":"F"},{"id":"7ac23936-29e3-4279-8b73-c474e631a5c3","name":"Wayland Academy","isPublished":"N","status":"S","vacancies":"F"},{"id":"b8268e78-69e5-4c5f-b597-b06abbb96839","name":"Hewett Academy","isPublished":"N","status":"S","vacancies":"F"},{"id":"94948e05-e3a3-4b3c-86d3-140955e81dee","name":"Hethersett Academy","isPublished":"N","status":"S","vacancies":"F"},{"id":"80e5c1d5-a0ca-46ed-bd48-12e2609e7e70","name":"Great Yarmouth Charter Academy","isPublished":"N","status":"S","vacancies":"F"},{"id":"56a77ef8-6675-4708-b263-fd21367da163","name":"East Point Academy","isPublished":"N","status":"S","vacancies":"F"}],"trainingProvider":{"id":"bc521f39-a325-4273-9604-4d07338970be","code":"2H7","name":"Inspiration Teacher Training"},"profPost":"PG","degreeGrade":"1","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"This course is for those who recognise the importance of mathematics in wider society, and who therefore want to train as secondary school teachers in mathematics.\r\n\r\nMathematicians know they can bring order when there is chaos, apply logic when there is none, and gain joy from solving problems. Learning mathematics changes how we think: it teaches us to take on challenges, embrace problems, and find the truth. Learning mathematics helps us understand the world around us.\r\n\r\nTrainees on the mathematics course will explore how students learn mathematics most effectively and how students remember what they learn. Trainees will learn what this looks like in the classroom and what this means for their pedagogy. What are the most common student misconceptions and how can these be used to teach students the correct methods? How can we teach all students at all stages the wonder of proving mathematical facts?  How can we gradually build on mathematical knowledge to facilitate problem solving, reasoning, and relational understanding?\r\n\r\nTeaching relies on you being an expert in your subject. This course will enable you to fully understand your expertise in mathematics and communicate it to others. There will be an emphasis on understanding both the nature of mathematics and the mathematical knowledge which is essential to learn before tackling more challenging concepts. The course will consider which mathematical knowledge is important at each stage of learning. You will learn when and how to connect one topic to another in the classroom, such as by looking at the role played by basic numeracy in a lesson teaching complex algebraic proof.\r\n\r\nYou will learn to teach well through professional practice and through critically reflecting on your own practice. Your school placements within the course will give you the opportunity to teach, to observe, to practise, to experiment, and to innovate. You have the opportunity to reflect upon your own practice within your school context. As a course entitlement, you will have the time to discuss this with your school-based subject mentor; you can then identify the ways in which you need to develop as a specialist and as a professional. What results is a highly personalised programme in which, through dialogue with your mentor, you develop your teaching style, practice, and ideas in a bespoke way.","interviewProcess":"If your application is shortlisted you will be invited to a selection day which will be held in one of our partnership schools. You will spend the day with mentors and with students, taking part in tasks including delivering a presentation, completing a written task, observing and analysing a lesson, and completing an interview. \r\nThe day will give you an insight into what it will be like to work in one of our schools, along with the opportunity to ask questions and meet members of our teaching team.\r\nWe aim to provide applicants with a decision within a week following the selection day. Depending on the outcome of the day we also offer a phone call to provide feedback on your performance during the tasks.\r\n","howSchoolPlacementsWork":"Trainees will have two placements, each in one of our alliance of primary, secondary, and sixth form schools across East Anglia. We have 13 schools within our Trust and additional partnership schools which we are able to place you in, please see [here] (http://www.inspirationtrust.org/40/school-placements) for a map of where our placement schools are located. \r\nWe will try to place you in schools that are convenient for you, with priority given to trainees who have families to care for. Where possible, we will do our best to ensure your commute time is no longer than 40 minutes. \r\nIf you are on a Primary course you will be teaching pupils in the age range of 5-11. If you are on a secondary course you will be teaching pupils in the age range of 11-16 with post 16 enhancement. \r\n","personalQualities":"","otherRequirements":"If you are successful in gaining a place on our course we will need to complete suitability checks related to safeguarding, require confirmation of your health and fitness and will also need to obtain satisfactory references. These checks are initiated by us and form part of our on boarding procedures.","status":1,"createdAt":"2021-07-06T10:55:53.646Z","updatedAt":"2021-07-27T08:26:54.599Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
