{"id":"c7574017-c5e6-4d69-ae43-9e73b93183a0","name":"English","code":"389T","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3aed1aa8-ae46-4b68-92bb-a6cc20655c59","code":"Q3","name":"English"}],"locations":[{"id":"94948e05-e3a3-4b3c-86d3-140955e81dee","name":"Hethersett Academy","isPublished":"N","status":"S","vacancies":"F"},{"id":"361a9f46-8b75-4116-81fa-cc5149d76c9c","name":"The Thetford Academy","isPublished":"N","status":"S","vacancies":"F"},{"id":"399548ee-8562-489d-acab-48c2667075be","name":"Inspiration Teaching School Hub","isPublished":"Y","status":"R","vacancies":"F"},{"id":"b8268e78-69e5-4c5f-b597-b06abbb96839","name":"Hewett Academy","isPublished":"N","status":"S","vacancies":"F"},{"id":"80e5c1d5-a0ca-46ed-bd48-12e2609e7e70","name":"Great Yarmouth Charter Academy","isPublished":"N","status":"S","vacancies":"F"},{"id":"56a77ef8-6675-4708-b263-fd21367da163","name":"East Point Academy","isPublished":"N","status":"S","vacancies":"F"},{"id":"c613ce93-42e3-4546-a17e-e33474066cd7","name":"Cromer Academy","isPublished":"N","status":"S","vacancies":"F"},{"id":"7ac23936-29e3-4279-8b73-c474e631a5c3","name":"Wayland Academy","isPublished":"N","status":"S","vacancies":"F"},{"id":"fc8bdcf3-732a-4666-9bcb-8e81ce3808f9","name":"Jane Austen College","isPublished":"N","status":"S","vacancies":"F"}],"trainingProvider":{"id":"bc521f39-a325-4273-9604-4d07338970be","code":"2H7","name":"Inspiration Teacher Training"},"profPost":"PG","degreeGrade":"1","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"This course is for people who understand that a command of language and a knowledge of great literature are fundamental elements of a child’s education and therefore want to train as secondary specialists in English. We are shaped by the thoughts and words of those who have come before us, and the best literature has the power to capture and transform human experience. Students require teachers who have the expertise to help them navigate and critically engage with this complex body of knowledge.\r\n\r\nThe course will aim to build broad knowledge while acknowledging that individual candidates will want to build their own areas of particular expertise. Our vision for English departments within the Trust is that they should be composed of teachers with a strong overall grasp of both the literary and the linguistic elements of the subject, alongside a deep understanding of particular topics. This deep, specialised knowledge will mean that over time, successful trainees will become a source of expertise and guidance for colleagues across the Trust.\r\n\r\nThe course will include a thorough foundation in grammatical knowledge, based on an awareness that this element of English has been neglected for many years. If it is to be revived then trainee teachers must be thoroughly knowledgeable and comfortable with grammatical concepts so that they can bring them to life for their students, not merely as dry rules but as a rich framework of ideas that shape meaning for us as readers and writers.\r\n\r\nYou will learn through developing your knowledge as a professional and as a subject specialist. One of the most distinctive characteristics of Inspiration Teacher Training is the value it places on the richness of knowledge. Firstly, you will deepen your knowledge within your subject specialism through wide reading of literature and literary criticism. Secondly, you will develop professional knowledge to support your subject specialism. You will survey a range of educational research which will shape your teaching practice as you develop a better understanding about learning, reading, and memory.\r\n\r\nIn these ways and others, our secondary English course will develop you as a scholarly and able practitioner, able to become a leading voice within the field.","interviewProcess":"If your application is shortlisted you will be invited to a selection day which will be held in one of our partnership schools. You will spend the day with mentors and with students, taking part in tasks including delivering a presentation, completing a written task, observing and analysing a lesson, and completing an interview. \r\nThe day will give you an insight into what it will be like to work in one of our schools, along with the opportunity to ask questions and meet members of our teaching team.\r\nWe aim to provide applicants with a decision within a week following the selection day. Depending on the outcome of the day we also offer a phone call to provide feedback on your performance during the tasks.\r\n","howSchoolPlacementsWork":"Trainees will have two placements, each in one of our alliance of primary, secondary, and sixth form schools across East Anglia. We have 13 schools within our Trust and additional partnership schools which we are able to place you in, please see [here] (http://www.inspirationtrust.org/40/school-placements) for a map of where our placement schools are located. \r\nWe will try to place you in schools that are convenient for you, with priority given to trainees who have families to care for. Where possible, we will do our best to ensure your commute time is no longer than 40 minutes. \r\nIf you are on a Primary course you will be teaching pupils in the age range of 5-11. If you are on a secondary course you will be teaching pupils in the age range of 11-16 with post 16 enhancement. \r\n","personalQualities":"","otherRequirements":"If you are successful in gaining a place on our course we will need to complete suitability checks related to safeguarding, require confirmation of your health and fitness and will also need to obtain satisfactory references. These checks are initiated by us and form part of our on boarding procedures.","status":1,"createdAt":"2021-07-06T10:55:53.511Z","updatedAt":"2021-07-27T08:29:34.635Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
