{"id":"ebe5fd63-c0a9-4441-b8e3-5242e4b8eb3f","name":"History","code":"389Y","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"5a3609a0-5bbb-4377-b919-5d89932ab622","code":"V1","name":"History"}],"locations":[{"id":"80e5c1d5-a0ca-46ed-bd48-12e2609e7e70","name":"Great Yarmouth Charter Academy","isPublished":"N","status":"S","vacancies":"F"},{"id":"fc8bdcf3-732a-4666-9bcb-8e81ce3808f9","name":"Jane Austen College","isPublished":"N","status":"S","vacancies":"F"},{"id":"7ac23936-29e3-4279-8b73-c474e631a5c3","name":"Wayland Academy","isPublished":"N","status":"S","vacancies":"F"},{"id":"94948e05-e3a3-4b3c-86d3-140955e81dee","name":"Hethersett Academy","isPublished":"N","status":"S","vacancies":"F"},{"id":"b8268e78-69e5-4c5f-b597-b06abbb96839","name":"Hewett Academy","isPublished":"N","status":"S","vacancies":"F"},{"id":"56a77ef8-6675-4708-b263-fd21367da163","name":"East Point Academy","isPublished":"N","status":"S","vacancies":"F"},{"id":"c613ce93-42e3-4546-a17e-e33474066cd7","name":"Cromer Academy","isPublished":"N","status":"S","vacancies":"F"},{"id":"399548ee-8562-489d-acab-48c2667075be","name":"Inspiration Teaching School Hub","isPublished":"Y","status":"R","vacancies":"F"},{"id":"361a9f46-8b75-4116-81fa-cc5149d76c9c","name":"The Thetford Academy","isPublished":"N","status":"S","vacancies":"F"}],"trainingProvider":{"id":"bc521f39-a325-4273-9604-4d07338970be","code":"2H7","name":"Inspiration Teacher Training"},"profPost":"PG","degreeGrade":"1","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"There is no one model of trainee teacher at Inspiration Teacher Training. Our teachers come from a wide variety of backgrounds: some will come straight from their undergraduate degree, having known for years that teaching history is what they want to do; others will come from the world of work who want to pursue a new career. Wherever they come from, they have something in common: a passion for history and a desire to pass on that passion to pupils. \r\n\r\nWhat distinguishes us from other courses and roads into the profession is our community of subject mentors. For each trainee teacher, there will be a professional mentor in one of our schools who will have read the same journal articles, academic essays, and books as the trainee teacher. This ensures that what is learned and discussed in the seminar room is directly transferable to school the next day. Our trainee teachers know that their subject mentors are as up to date with the latest research as their subject lecturer, ensuring a strong link between the theoretical and practical.\r\n\r\nBuilding a secure knowledge-based curriculum is important as it matters what pupils learn and it matters if pupils can remember what they learn. For example, if a student is given an article about Alexander the Great, and there is a reference to the importance of the Greco-Persian Wars that they discussed the previous term, then the pupils should know what is being discussed and why it is relevant. Why might a Year 10 pupil choose to use the word ‘imperial’ or ‘republican’ to describe a certain style of leadership? They use it because you have taught it to them explicitly in Years 7 and 8 and 9 and they have practised using it in many different contexts until they understand the word. Studies show it is the disadvantaged pupil who most benefits from a knowledge-based curriculum. \r\n\r\nYou will learn to teach history well by reading and by doing. Most of our course is spent in schools, although not necessarily spent teaching pupils. Your in-school training programme will be highly personalised and will often vary from week to week; more time allocated one week for reading and reflecting and in another week for more teaching. You will have regular discussions with your mentor about how your reading in the seminar can help you think about how you will teach in the classroom.\r\n","interviewProcess":"If your application is shortlisted you will be invited to a selection day which will be held in one of our partnership schools. You will spend the day with mentors and with students, taking part in tasks including delivering a presentation, completing a written task, observing and analysing a lesson, and completing an interview. \r\nThe day will give you an insight into what it will be like to work in one of our schools, along with the opportunity to ask questions and meet members of our teaching team.\r\nWe aim to provide applicants with a decision within a week following the selection day. Depending on the outcome of the day we also offer a phone call to provide feedback on your performance during the tasks.\r\n","howSchoolPlacementsWork":"Trainees will have two placements, each in one of our alliance of primary, secondary, and sixth form schools across East Anglia. We have 13 schools within our Trust and additional partnership schools which we are able to place you in, please see [here] (http://www.inspirationtrust.org/40/school-placements) for a map of where our placement schools are located. \r\nWe will try to place you in schools that are convenient for you, with priority given to trainees who have families to care for. Where possible, we will do our best to ensure your commute time is no longer than 40 minutes. \r\nIf you are on a Primary course you will be teaching pupils in the age range of 5-11. If you are on a secondary course you will be teaching pupils in the age range of 11-16 with post 16 enhancement. \r\n","personalQualities":"","otherRequirements":"If you are successful in gaining a place on our course we will need to complete suitability checks related to safeguarding, require confirmation of your health and fitness and will also need to obtain satisfactory references. These checks are initiated by us and form part of our on boarding procedures.\r\n","status":1,"createdAt":"2021-07-06T10:55:53.579Z","updatedAt":"2021-07-27T08:28:30.787Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
