{"id":"d3401271-cad0-4517-bd0e-5947bace68c2","name":"Design and Technology","code":"3BCL","qualification":"qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"118fabd7-86d0-4a40-9e9a-e5c302abe59b","code":"DT","name":"Design and technology"}],"locations":[{"id":"c77b97a6-32df-443b-87d1-b661f75a8ddf","name":"Bracknell Forest Partnership Schools","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"2c28447d-60a4-4c6f-9db3-06a1045a5a1f","code":"2FZ","name":"The Bracknell Forest Partnership"},"accreditedBody":{"id":"6439adcc-af64-4d3d-a1da-de045755db06","code":"R12","name":"The University of Reading"},"degreeGrade":"1","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We require equivalency tests to be taken prior to application.  The equivalency tests the University of Reading accept are:\n\nhttps://mathsmadeeasy.co.uk/\nhttps://www.equivalencytesting.com/\nhttps://astarequivalency.co.uk/maths/\n\nApplicants who need English can also undertake the International English Language Testing System (IELTS) - https://www.reading.ac.uk/ISLI/study-in-the-uk/tests/isli-test-ielts.aspx","courseLength":"OneYear","feesUK":7710,"feesInternational":15650,"aboutCourse":"The Bracknell Forest Partnership teacher training programme gives you the opportunity to experience life in a school whilst working towards gaining Qualified Teacher Status (QTS). \r\n\r\nThe programme is a one-year school based full-time route into teaching that, alongside classroom teaching, includes lesson observation, training within a host and second school; partnership based training days and time spent at the University of Reading. \r\n\r\nWith Bracknell Forest schools you will have the opportunity to experience teaching all age and ability groups. Our schools have very good facilities and access to technology, including interactive whiteboards, \r\n\r\nAt your host school you will be assigned a learning mentor, a qualified, experienced teacher who will work alongside you and support your professional development. You will meet with them at regular intervals throughout the year to review your individual training plan and to set professional development targets.  Being based in the school you are surrounded by experts and there is always someone to ask for help advice or just to discuss your learning.  You can also network with previous years trainees.\r\n\r\nOne morning a week will be spent on professional studies, where experts from across the partnership schools will offer you an insight into particular topics that will help you as a teacher, either developing your own skills, or enabling you to better understand the needs of your pupils. Training will either take place internally or you will train with all School Direct trainees in one of the other partnership schools.\r\n\r\nAs a qualified teacher, in your first year you will have the opportunity to partake in a structured Induction Programme to enable you to consolidate your learning and take your teaching to a new level you can also elect to complete a Post Graduate Certificate in Education. \r\n\r\nDesign & Technology is offered across the partnership from Key Stage 3 -5.  \r\n\r\nAt Key Stage 3 pupils receive training on Food Technology, Resistant Materials, Graphics and Textiles with a wide variety of theory and practical learning.\r\n\r\nAt Key Stage 4, GCSE Food Technology, Graphics and Resistant Materials are taught and a Level 3 course in Food Science and Nutrition is available to sixth form students.\r\n\r\nIf you love design technology and relish the challenge of expanding your experience in all aspects of the subject we would love you to come and work with us in our dynamic, imaginative teams.\r\n\r\n","interviewProcess":"Once we receive your application, we will undertake a short listing process. For practical reasons we cannot interview everyone so please ensure your application tells us all the relevant skills, knowledge and experience you have to offer.  The strongest candidates will be invited to an interview.\r\n\r\nSuccessful applicants will be those who will work well as part of a team, who are able to reflect on their own learning, be highly organised with good personal communication skills and keen to play a part in the wider life of the school. \r\n\r\nOur interviews are conducted via Microsoft Teams.  You do not need Office 365 to access Microsoft Teams but you will need a laptop, desktop PC or tablet, plus an internet connection and your equipment needs an internal or external camera and microphone. \r\n\r\nOur interview experience is designed to ensure that the online process gives you the opportunity to demonstrate your abilities as well as offering you an opportunity to ask the questions that you need to ask.   Within the interview we will ask you to prepare a five minute presentation detailing how you would go about teaching a 25 minute learning activity. \r\nThe interview will last for approximately one hour. \r\n","howSchoolPlacementsWork":"Our partnership schools include:\r\n\r\n•\tThe Brakenhale School RG12 7BA\r\n•\tCharters School SL5 9QY\r\n•\tEasthampstead Park Community School RG12 8FS\r\n•\tEdgbarrow School RG45 7HZ\r\n•\tGarth Hill College RG12 2AD\r\n•\tKing’s Academy Binfield RG42 4FS\r\n•\tRanelagh CE School RG12 9DA\r\n•\tSandhurst School GU47 0SD\r\n\r\nSuccessful applicants will be allocated to schools after interview, so we can best match trainees to schools. Geographical preference will be taken into account where possible.\r\n\r\nSchool Direct is a personalised route to qualified teacher status and your initial teaching responsibilities will be influenced by prior experience, however you can be sure you will have a structured introduction into teaching and can expect to build up your teaching gradually.\r\n\r\nDuring the first half of the autumn term you will observe lessons, work with small groups and teach with another teacher in your subject, using their lesson plans. Gradually as the term goes on you will have the chance to develop your own lesson plans and will take on more teaching with the focus being on shared teaching. In the first half of the term you will spend two days a week at the University, building knowledge relating to teaching your subject area.\r\n\r\nIn the Spring term you will spend two separate weeks at the university in January and February. After the first week you will start a second school placement in another school in the partnership. The focus moves to guided teaching and you will work towards teaching 50% of the week. \r\n\r\nAfter the Easter break leading up to the summer half term (May) you will have an extended period of teaching, during which you should expect to become increasingly independent in taking responsibility for teaching and learning. For your final half term of training, if you have already demonstrated that you are meeting the requirements of the Teaching Standards, you will have the opportunity to gain additional experience beyond your normal teaching timetable. \r\n","personalQualities":"We are looking for potential teachers with a passion for their subject, a desire to immerse themselves in the school community and to take responsibility for their professional growth and development.  \r\nThe ability to relate to and motivate young people is essential. Their enthusiasm and depth of knowledge for their subject should be apparent as should their keenness to share this with pupils.  \r\nWe are looking for highly motivated, enthusiastic individuals, who set their own high standards, work well as part of a team, are able to reflect on their own learning and set appropriate targets for their own development. \r\n","otherRequirements":"Before you commence training you will need to:\r\n* receive a satisfactory medical report and meet the standards for 'Fitness to Teach'\r\n* complete a Disclosure and Barring Service (DBS) Enhanced level check.\r\n* have completed any subject knowledge requirements\r\n","status":1,"createdAt":"2021-07-06T10:49:30.775Z","updatedAt":"2021-07-21T11:39:37.926Z","canSponsorStudentVisa":"yes","cycle":"2024"}
