{"id":"e2341fe1-04e6-4e4b-b37e-b90243c44d72","name":"Primary","code":"2TZS","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"4446d861-67fb-474c-9319-e5dc3c69ce6f","name":"Main Site","isPublished":"Y","status":"S"}],"trainingProvider":{"id":"2e1e2750-fa57-48d8-90b5-cbd12055895c","code":"2A8","name":"St. Michael’s Federation"},"accreditedBody":{"id":"6019b3ce-f2f6-4b0e-b2a9-5813d74c4d54","code":"W80","name":"University of Worcester"},"profPost":"PG","degreeGrade":"9","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feesInternational":14100,"feeDetails":"Please see [University of Worcester Schools Direct Information Page] (https://www.worcester.ac.uk/courses/pgce-school-direct-primary)","aboutCourse":"This course offers an immersive and inspiring, school-centred training route into teaching.\r\n\r\nAt Worcester the PGCE: School Direct Primary is tailored to your needs - building on your existing strengths and expertise.\r\n\r\nOur course is inclusive and innovative in its design and delivery, and places you at the heart of a thriving school community from day one.\r\n\r\nKey Features:\r\n\r\n* Full immersion in the daily life of a school and all the existing challenges that brings\r\n* Breadth and depth of experience across a range of schools\r\n* Outstanding additional opportunities for enrichment and extension\r\n* A dynamic taught programme, ensuring depth and breadth across all Early Years and Primary subjects\r\n* Unparalleled personal and academic support throughout the programme and beyond\r\n\r\nWhat will you study?\r\nThe Developing Teacher (30 Credits at Master's Level) - This module focuses on developing your teacher identity, through critically reflective models, experiences and analysis of relevant theories and research. \r\nThe Learning Child (30 credits at Master's Level) - This module focuses on child development and primarily how to support children to learn. You learn about subject specific pedagogies, adapting teaching to meet different needs of learners and the role of assessment. This modules covers all national curriculum subjects.\r\nLife In School: School Experience (Qualified teacher Status - QTS ) - This part of the course relates to your school placements. You will complete two different placements within our cluster schools. During this time, you will build on your university learning and apply this in role as a teacher. During your time in school, you will collate evidence to support the completion of the teacher standards. This is required to gain the QTS.\r\n\r\nHow will you be taught?\r\nYou will  gain much of your experience learning on the job in school being supported by a mentor and a class teacher. This will be complemented by a series of university days, including some blocked weeks, at university where you will receive some taught lectures.  \r\n\r\n","interviewProcess":"The interview process may include:\r\n* A formal interview where we discuss your experiences to date, your aspirations and suitability to teach\r\n* An observation where you will lead an activity with a group of children\r\n* A written task","howSchoolPlacementsWork":"The school placements are located in South West Shropshire and are a mixture of small rural primary schools. Such placements will provide you with a unique opportunity to teach mixed aged classes and develop excellent teaching skills in a supportive and friendly environment. \r\n\r\nYou will be allocated a base school which is where you will spend most of your placement (Autumn and Summer Term). In the Spring Term, you will be placed at one of our partner schools, within the cluster area, to teach in an alternative age range (e.g. if you were originally placed in a key stage one class, for this placement you will teach key stage two and vice versa).\r\n\r\nWithin the schools, you will be supported by the class teacher and a mentor. Due to the nurturing nature of our small rural schools, the staff team will help you to achieve your teaching goals. All the staff, who will work with you have many years experience of teaching in primary schools and supporting students on their teaching placements. \r\n\r\nWe partner with 5 other schools in our cluster, so there is some flexibility within schools placements, if required. ","personalQualities":"We require you to:\r\n* Like spending time with children\r\n* Be passionate about teaching children how to learn\r\n* Be a learner yourself\r\n* Be reflective\r\n* Be resilient\r\n* Be creative\r\n* Be fun\r\n* Be patient\r\n* Have a 'can do' attitude\r\n* Be flexible\r\n* Be an exceptional team player","otherRequirements":"We will require you to have a criminal records check prior to starting the course. ","status":3,"createdAt":"2021-07-06T10:53:17.309Z","updatedAt":"2021-10-13T13:35:53.972Z","canSponsorStudentVisa":"yes","cycle":"2024"}
