{"id":"6366bfd4-b978-494b-9213-3c894133e4ab","name":"Primary","code":"23WM","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_9","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"150d628c-e93c-4563-bd0b-f615888ef078","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"},{"id":"747194b4-f823-47ee-9562-9091cab23e50","name":"Northumbria University","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"9fe9e10a-d88e-4a59-8127-9ef5a96c4b35","code":"16B","name":"Tyne Valley Alliance"},"accreditedBody":{"id":"b384b008-59e2-461e-a15f-3551d1165c1e","code":"N77","name":"University of Northumbria at Newcastle"},"profPost":"BO","degreeGrade":"1","english":"1","maths":"1","science":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feeDetails":"Student loan.\r\n\r\n","financialSupport":"Student loan ","aboutCourse":"With TVTSA you will learn the skills to become an outstanding teacher.  After 9 years delivering the course we have developed a bespoke training plan to meet the needs of all trainees. \r\n\r\nOur course is unique in that we cover 5 local authorities and offer training both in conjunction with the Gateshead SCITT and through the use of our Specialist Leaders of Education. These outstanding teachers deliver training from The Arts to EAL in a small group environment to enable trainees to ask questions and feel involved.  We also run training with two other alliances so trainees have the opportunity to get to know others learning to teach and develop a network of contacts.  Placements are allocated with your travel in mind.\r\n\r\nTrainees complete two placements over the length of the course.  We have deliberately kept 2 placements as feedback tells us trainees can really get to know the children, families and staff.  Head teachers also like to have trainees in for a longer placement as they can get to know them well and this can often result in them being offered a position.  All our previous trainees have been offered teaching positions with over half within our alliance of schools. Some have now progressed on to become senior leaders.\r\n\r\nIn between placements at the start of February trainees break up the course with a two week placement at Sele First Hexham observing Science Technology Engineering and Maths teaching.  They have the opportunity to work alongside other professionals such as scientists and doctors. \r\n\r\nTrainees are given the choice of their preferred key phases for each placement and have the opportunity to spend time in all three from Early Years to Upper Key Stage 2 should they wish.  \r\n\r\nTrainees will have a school mentor, a university mentor and a lead school mentor meaning support is always readily available.  The lead school mentor lives the journey with you and will be in contact every week.  \r\n\r\nTeaching builds up gradually based on previous experiences in school. We are led by trainees as their confidence grows. \r\n\r\nTrainees will compete the course with a Post Graduate Certificate in Education (PGCE) with 60 credits towards a Masters degree.\r\n\r\nPlease visit our website at SELEfirst to read a testimonial from one of our most recent trainees.   \r\n\r\nWe also offer school direct taster sessions which will be advertised on our website.  \r\n\r\nGood luck to all with your search.  ","interviewProcess":"The panel will be a mix of school mentors including the lead school mentor and a representative from Northumbria university.\r\n\r\nThere will be one interview including the teaching of a small group of 6 children and a formal interview.  \r\n\r\nThis will take approximately one hour in total. \r\n\r\nWe welcome candidates getting in touch beforehand and are very happy for them to come into school and have a talk with the lead mentor and a look around the lead school. \r\n\r\nPlease contact Brooke.Phillips@sele.northumberland.sch.uk for further information. ","howSchoolPlacementsWork":"A trainee will have two main placements in 2 contrasting schools from our school selection.  These include several from across 5 local authorities including Northumberland, Newcastle, Sunderland, North Tyneside and Gateshead.  All with Good and Outstanding Ofsted ratings.  The schools range from small rural settings in Northumberland to large primaries by the coast.\r\n\r\nOur schools include Sele First, Ovingham First, Mickley First, Marine Park Primary, Lobley Hill Primary, Throckley Primary, St Augustines Catholic Primary, Prudhoe West First and Bensham Nursery.  We will find 2 schools that suit you best taking into account where you live. \r\n\r\nYou will also have the opportunity to observe teaching in Sele First for a mini placement and The Priory School.  The schools are all either first or primary and you will be in school from day 1. \r\n\r\nAt the end of the course there is an opportunity for an enhanced placement to develop in an area of your choice. Or if you have been offered a position you will spend it in your new school getting to know your new class  and school routines before you start officially in September. \r\n\r\nPrevious trainees have commented on how well they are matched to a school in terms of their skill set and personality to make placements as successful as possible.  This also gives you the best possible chance of being offered a teaching position at the end of the course. \r\n\r\nTrainees have also commented on the positive impact of the first placement being a paired one so we have kept this as an essential part of placement.  \r\n\r\nPlease visit our school website at SELEfirst to view the outline of our 20/21 course or email for a copy to be sent. ","personalQualities":"We are looking for passionate and enthusiastic trainees who are excited to commence the journey to become outstanding teachers.\r\n\r\nWe ultimately look for people who we can see teaching in our schools at the end of the course. The long term aim is that we can build the future success of our schools.\r\n\r\nAll schools within the alliance are different so we will be looking at a variety of  skills sets to fit the range of schools.  Please look at the websites for each school to get a flavour of what they offer.  ","otherRequirements":"All candidates will follow the requirements of Northumbria University who we work in partnership with. This will include a DBS which the university will follow up.\r\n\r\nWe can offer volunteer placements prior to applying and the school would then lead on the DBS process. ","status":1,"createdAt":"2021-07-06T10:49:54.488Z","updatedAt":"2021-09-28T12:41:06.733Z","canSponsorStudentVisa":"yes","cycle":"2024"}
