{"id":"ff871711-31bd-49a5-9edb-e8b550e0d2f9","name":"Primary","code":"F220","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"4a1756c4-385c-4327-8e73-869ca91e1884","name":"Wolfson Hillel Primary School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"7134bd5a-1514-4408-9547-955a655747bf","code":"1CP","name":"Jewish Schools Direct Primary Consortium"},"accreditedBody":{"id":"3662bd08-5f53-40bf-8768-4aeb4e5243e4","code":"28T","name":"London School of Jewish Studies (LSJS)"},"degreeGrade":"9","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We accept equivalency tests from A* Equivalency https://astarequivalency.co.uk","courseLength":"OneYear","aboutCourse":"Why train with us?\r\n \r\nThe Jewish Primary Schools Consortium is a partnership including over 20 North London schools representing the spectrum of Judaism. Our accredited provider is the Jewish Teacher Training Partnership. Within the consortium like schools will operate in clusters.\r\n \r\nOur mission is to increase the number of teachers delivering high quality primary education in the Jewish sector. We offer a unique opportunity for specialist teachers of Jewish Studies / Limmudei Kodesh and general primary practitioners to develop their teaching, personal and professional conduct within our schools.\r\n \r\nThrough our programme candidates will experience training and placements in schools of similar ethos where possible. Candidates will have an opportunity to align their placements with their own ethos.\r\n \r\nAbout this training programme:\r\n \r\nThe programme is based on the initial teaching competencies. Across the year candidates will learn about each of these areas through research, have an opportunity to observe them in practice and reflect on how they will implement this learning in their classroom. We offer a specialist Jewish Studies / Kodesh track.\r\n\r\nCandidates in the programme will be based in a class setting at the home school and expected to lead a class. Time and in school mentoring support will be given for the training programme . Throughout the year candidates will be observed by the home school and external accreditors.\r\n\r\nOpportunities have been built into the programme for members of the programme to work collaboratively. Candidates will be employed by the home school for the duration of the programme on the unqualified teachers scale.\r\n\r\n\r\n \r\n","interviewProcess":"Candidates will be required to attend an interview at one of our host schools.\r\n \r\nDuring the interview you will be required to teach a sample lesson, complete a short task and be interviewed by a panel.\r\n \r\nFollowing the interview successful candidates will either be \r\n- confirmed as being hosted by their existing school or\r\n- candidates not from a school will be matched with a host school.\r\n \r\nCandidates will be required to pass a test of their fundamental literacy and numeracy skills tests by the end of the course. This is likely to take place either at interview or early in the course.\r\n\r\n","howSchoolPlacementsWork":"We have two school placements during our course\r\n \r\nThe first is a placement in an alternative school within  the consortium. Placements are managed to adapt to the candidates travel and home situations and appropriate year group placements.\r\n \r\nThe second is a placement in a non consortium school. This is arranged with a local school near to your host school.\r\n \r\n \r\n","personalQualities":"What we are looking for\r\n \r\nPrior relevant experience\r\nThe desire to work within the Jewish schools sector\r\nPassionate about education, committed to continuous professional development\r\nAble to work as part of a team and inspire children\r\n","otherRequirements":"All applicants will be subject to enhanced DBS check, right to work in the UK and dependent on two suitable references.\r\n \r\n","status":1,"createdAt":"2021-07-06T10:47:57.995Z","updatedAt":"2021-10-14T13:35:11.127Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"\r\nAll candidates will be salaried by the host school. This will be at a minimum scale of Unqualified Teacher 1. \r\n\r\nThere is a fee of £7000 payable either through salary sacrifice or personally by  the candidate. "}
