{"id":"8da7a984-8df4-46e3-8e2a-37618f547d20","name":"Computing","code":"E971","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"B","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"e6be6a9c-8696-4b88-8fbd-1ba1bef1b6fc","code":"11","name":"Computing"}],"locations":[{"id":"369fc35a-178d-4c05-b648-fe053698f960","name":"Outwood Academy Acklam","isPublished":"Y","status":"R","vacancies":"F"},{"id":"0537827c-cd6b-4a44-9f59-651d06dc7caa","name":"Outwood Academy Redcar","isPublished":"Y","status":"R","vacancies":"F"},{"id":"e81ad13e-e866-4916-8c64-dfe0aa95f4f0","name":"Outwood Academy Bydales","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"fff96ba4-a8fa-42e8-bf39-52ef8b774f97","code":"3C7","name":"Teach North: Teesside"},"accreditedBody":{"id":"94695424-6553-46c4-9c05-181e61813587","code":"3S1","name":"Teesside University"},"profPost":"PG","degreeGrade":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"As a Teach North Computing trainee, you will drive students to think deeply and become resilient problem solvers who understand today’s technological world. Alongside your students, you will explore the four cornerstones of Computational Thinking, providing firm foundations for other topics within the subject. \r\n\r\nYou will deliver lessons that develop and consolidate students’ basic ICT skills that will allow them to access more complex Computing concepts. Your students will also explore fundamental principles and concepts of Computing, including abstraction, decomposition, logic, algorithms, and data representation.\r\n\r\nYour classroom will be brimming with extended discussion about the ethical, moral and social implication of technology in society. There will also be plentiful opportunities for practical application of key concepts through a chosen programming language as well as investigations into how computers work.  \r\n\r\nOn completion of this programme, you will be awarded a PGCE with QTS and 60 Masters credits in Education from Teesside University.\r\n\r\nWe are delighted to form our new partnership with Teesside University to deliver secondary teacher education in the Tees Valley region from September 2022. This partnership creates a collaborative model of training. \r\n\r\n[Click here to read about one of our Computing trainees](https://static1.squarespace.com/static/5b3b3ce0266c0780e2b0138d/t/5fda244e3bd7924459876763/1608131663089/OIE_Case+Study_SW.pdf)","interviewProcess":"If you meet our entry requirements, you will be invited to a remote interview to complete our selection process. \r\n\r\n[Click here to explore our remote interview process](https://teachnorth.com/remote-interviews)","howSchoolPlacementsWork":"During the programme, you will complete two placements in our alliance schools and academies. The location of these placements is decided by the Teach North team who will consider your home location, mode of transport and the capacity of the school or academy.\r\n\r\n[Click here to discover our placement schools](https://teachnorth.com/our-placement-schools)\r\n\r\nYou will be assigned a trained mentor to support and celebrate your progress as you enter the teaching profession. \r\n\r\n[Click here to meet our mentors](https://teachnorth.com/meet-our-mentors)","personalQualities":"Teach North is seeking applicants with the following qualities:\r\n\r\n- A genuine desire to put children first and a commitment to improving the life chances of young people\r\n- An ability to engage with students in a personable and professional manner\r\n- Resilience, flexibility and a passion to succeed in the teaching profession","otherRequirements":"Successful candidates must obtain clearance from the Disclosure and Barring Service (DBS) regarding suitability to work with children. Admission is also dependent on a satisfactory medical examination.","status":1,"createdAt":"2021-10-03T08:58:55.703Z","updatedAt":"2021-10-03T09:00:00.617Z","canSponsorStudentVisa":"yes","cycle":"2023"}
