{"id":"c3daf154-5e8f-4752-9ecb-7d59bd5338ff","name":"History","code":"P266","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"B","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"5a3609a0-5bbb-4377-b919-5d89932ab622","code":"V1","name":"History"}],"locations":[{"id":"0537827c-cd6b-4a44-9f59-651d06dc7caa","name":"Outwood Academy Redcar","isPublished":"Y","status":"R","vacancies":"F"},{"id":"e81ad13e-e866-4916-8c64-dfe0aa95f4f0","name":"Outwood Academy Bydales","isPublished":"Y","status":"R","vacancies":"F"},{"id":"8b42bbd9-fa3a-405b-a699-52a0ed43eba2","name":"Outwood Academy Bishopsgarth","isPublished":"Y","status":"R","vacancies":"F"},{"id":"369fc35a-178d-4c05-b648-fe053698f960","name":"Outwood Academy Acklam","isPublished":"Y","status":"R","vacancies":"F"},{"id":"c5759638-8d3f-4e51-9cad-1803313774a1","name":"Outwood Academy Ormesby","isPublished":"Y","status":"R","vacancies":"F"},{"id":"c038600f-6aa2-4c54-b41e-ed298b26c7dd","name":"Outwood Academy Normanby","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"fff96ba4-a8fa-42e8-bf39-52ef8b774f97","code":"3C7","name":"Teach North: Teesside"},"accreditedBody":{"id":"94695424-6553-46c4-9c05-181e61813587","code":"3S1","name":"Teesside University"},"profPost":"PG","degreeGrade":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"Full time: 1 Year / Part time: 2 Years","feesUK":9250,"aboutCourse":"As a Teach North History trainee, you will encourage students to make sense of current affairs by questioning the world around us and to develop a deeper understanding of why certain people act as they do. \r\n\r\nAlongside your students, you will discuss key historical concepts such as change and continuity, cause and consequence, and significance to draw conclusions, analyse trends in history and frame historically-valid questions. \r\n\r\nYou will deliver lessons that support students to effectively analyse; and then prioritise information, which will allow them to make informed decisions – a great life skill that all universities and employers will appreciate. Your students will explore key themes such as the struggle between the church and crown, and the impact that this had on the ruling classes but also on the lives of the ordinary people. \r\n\r\nYour classroom will be brimming with opportunities for students to frame their own historical questions, and through the use of the methods of historical enquiry, make supported judgements to answer them.\r\n\r\nOn completion of this programme, you will be awarded a PGCE with QTS and 60 Masters credits in Education from Teesside University.\r\n\r\nWe are delighted to form our new partnership with Teesside University to deliver secondary teacher education in the Tees Valley region from September 2022. This partnership creates a collaborative model of training. \r\n\r\n[Click here to read about one of our History trainees](https://static1.squarespace.com/static/5b3b3ce0266c0780e2b0138d/t/5fce0477c836a917f932bf9b/1607337080345/Josh+Cooper.pdf)","interviewProcess":"If you meet our entry requirements, you will be invited to a remote interview to complete our selection process. \r\n\r\n[Click here to explore our remote interview process](https://teachnorth.com/remote-interviews)","howSchoolPlacementsWork":"During the programme, you will complete two placements in our alliance schools and academies. The location of these placements is decided by the Teach North team who will consider your home location, mode of transport and the capacity of the school or academy.\r\n\r\n[Click here to discover our placement schools](https://teachnorth.com/our-placement-schools)\r\n\r\nYou will be assigned a trained mentor to support and celebrate your progress as you enter the teaching profession. \r\n\r\n[Click here to meet our mentors](https://teachnorth.com/meet-our-mentors)","personalQualities":"Teach North is seeking applicants with the following qualities:\r\n\r\n- A genuine desire to put children first and a commitment to improving the life chances of young people\r\n- An ability to engage with students in a personable and professional manner\r\n- Resilience, flexibility and a passion to succeed in the teaching profession","otherRequirements":"Successful candidates must obtain clearance from the Disclosure and Barring Service (DBS) regarding suitability to work with children. Admission is also dependent on a satisfactory medical examination.","status":1,"createdAt":"2021-10-03T09:07:09.855Z","updatedAt":"2021-10-03T09:11:25.630Z","canSponsorStudentVisa":"yes","cycle":"2024"}
