{"id":"e06b2214-7895-4548-b3bd-b1746316a4d6","name":"Design and technology","code":"U999","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"B","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"118fabd7-86d0-4a40-9e9a-e5c302abe59b","code":"DT","name":"Design and technology"}],"locations":[{"id":"e81ad13e-e866-4916-8c64-dfe0aa95f4f0","name":"Outwood Academy Bydales","isPublished":"Y","status":"R","vacancies":"F"},{"id":"369fc35a-178d-4c05-b648-fe053698f960","name":"Outwood Academy Acklam","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"fff96ba4-a8fa-42e8-bf39-52ef8b774f97","code":"3C7","name":"Teach North: Teesside"},"accreditedBody":{"id":"94695424-6553-46c4-9c05-181e61813587","code":"3S1","name":"Teesside University"},"profPost":"PG","degreeGrade":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"As a Teach North Design & Technology trainee, you will promote practical application, allowing for creative solutions to real, complex problems. Alongside your students, you will explore a wide range of aspects of the subject, such as Engineering, Electronic Products, Materials Technology, Textiles and Food & Nutrition. \r\n\r\nYou will deliver lessons that introduce many new skills and processes including; using a sewing machine, using workshop tools and machinery, learning to solder and preparing food using healthy ingredients and simple techniques. These skills will then developed into more advanced skills such as; soldering to a printed circuit board, using CAD / CAM, 3D printers and vinyl cutters, sublimation printing and combining food ingredients in more complex ways. \r\n\r\nYour classroom will be brimming with exciting practical opportunities where students can develop their resilience, confidence, self-expression and sense of achievement. \r\n\r\nOn completion of this programme, you will be awarded a PGCE with QTS and 60 Masters credits in Education from Teesside University.\r\n\r\nWe are delighted to form our new partnership with Teesside University to deliver secondary teacher education in the Tees Valley region from September 2022. This partnership creates a collaborative model of training. \r\n\r\n[Click here to read about one of our Design & Technology trainees](https://static1.squarespace.com/static/5b3b3ce0266c0780e2b0138d/t/600ffc2f4902de5bcdb15a2f/1611660336602/OIE_Case+Study_43.pdf)\r\n","interviewProcess":"If you meet our entry requirements, you will be invited to a remote interview to complete our selection process. \r\n\r\n[Click here to explore our remote interview process](https://teachnorth.com/remote-interviews)","howSchoolPlacementsWork":"During the programme, you will complete two placements in our alliance schools and academies. The location of these placements is decided by the Teach North team who will consider your home location, mode of transport and the capacity of the school or academy.\r\n\r\n[Click here to discover our placement schools](https://teachnorth.com/our-placement-schools)\r\n\r\nYou will be assigned a trained mentor to support and celebrate your progress as you enter the teaching profession. \r\n\r\n[Click here to meet our mentors](https://teachnorth.com/meet-our-mentors)","personalQualities":"Teach North is seeking applicants with the following qualities:\r\n\r\n- A genuine desire to put children first and a commitment to improving the life chances of young people\r\n- An ability to engage with students in a personable and professional manner\r\n- Resilience, flexibility and a passion to succeed in the teaching profession","otherRequirements":"Successful candidates must obtain clearance from the Disclosure and Barring Service (DBS) regarding suitability to work with children. Admission is also dependent on a satisfactory medical examination.","status":1,"createdAt":"2021-10-03T09:00:49.321Z","updatedAt":"2021-10-03T09:01:38.534Z","canSponsorStudentVisa":"yes","cycle":"2023"}
