{"id":"eb16c754-ed85-41f2-9eff-4cc7ec5bbc94","name":"Primary","code":"2MZV","qualification":"qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_7","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"7da7073e-3986-438e-93bb-ac8c381cec30","name":"Warwickshire & Coventry schools cluster","isPublished":"Y","status":"R","vacancies":"F"},{"id":"6458afae-df71-4eb0-9fa7-176d50230bfd","name":"Birmingham Cluster","isPublished":"Y","status":"R","vacancies":"F"},{"id":"2dcbfef3-3467-4f62-a713-e2b11682e3d9","name":"Solihull schools cluster","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"d06d9c3c-a3da-402b-9dfa-ab814cd0489c","code":"25R","name":"CREC Early Years Partnership"},"accreditedBody":{"id":"d06d9c3c-a3da-402b-9dfa-ab814cd0489c","code":"25R","name":"CREC Early Years Partnership"},"degreeGrade":"9","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"While we do not offer our own equivalency testing we accept several recognised tests and those of other ITT providers. We recommend that you enquire with us first before choosing a test to make sure we will accept it.","courseLength":"OneYear","feesUK":9250,"feeDetails":"This fee includes all costs associated with working towards QTS and PG Cert accreditation.","aboutCourse":"The CREC Early Years Partnership (CEYP) SCITT programme offers a one-year full-time early primary, school-based route to qualification as a primary or early years teacher with QTS. \r\n\r\nThe CEYP is based at the St. Thomas Nursery School and Children’s Centre in Birmingham, which is an internationally renowned centre of outstanding early years integrated practice, including research, quality development, and initial and advanced professional development. The SCITT programme will benefit from the direct contributions of Professor Chris Pascal and Professor Tony Bertram from CREC, both well acclaimed and highly experienced teacher educators, and a wider team of early years tutors and placement mentors. \r\n\r\nThe Partnership which will deliver the programme currently consists of over fifty ‘good’ or ‘outstanding’ nursery or primary schools across the West Midlands and Cambridgeshire. The programme will prepare trainees for teaching children aged from 2-7 (including the DfE designated age phases of Foundation Stage (3-5), and KS1 (5-7)).\r\n\r\nTrainees are based in schools but attend around 40 days of taught input spread through the year along with opportunities to visit and observe practice at other education providers including special schools, partner primary schools and nursery schools and children's centres as well as education conferences and CPD training events on safeguarding, paediatric first aid and PE.\r\n\r\nAll Trainees will complete a PG Cert alongside their QTS and this is accredited by Birmingham City University (but delivered at CREC). This comprises 3 x 3000 word assignments which require Trainees to consider the application of theory to their own classroom practice and their reflections on this process. Trainees have the opportunity to continue their Postgraduate studies and work towards a Masters in following years.\r\n\r\nOfsted has rated the ITT programme as 'Good' (2017) and currently has a 100% employment rate for graduates.","interviewProcess":"If selected for interview you will be invited to either our Lead School, St Thomas Centre Nursery School in central Birmingham or one of our partner schools across Birmingham, Solihull and Warwickshire. There you will be asked to undertake a three part process to help us identify if you have the potential to be a Trainee Teacher with us. \r\n\r\nYou'll be: \r\n\r\nobserved working with a Foundation Phase group;\r\nasked to read and respond to some classroom data;\r\ninterview by a small panel made up of SCITT staff and school leaders.\r\n\r\nApplicants are informed within one working day and everyone is given feedback. Successful applicants will also be given targeted activities to complete before commencing the course to ensure that they are as prepared as possible.\r\n\r\nAll offers are made subject to applicants obtaining satisfactory DBS clearance and Occupational Health clearance.  ","howSchoolPlacementsWork":"Trainees will spend a total of 135 days in school based training and experience (practising and school staff led) through three extended and continuous placements.\r\n\r\nPlacements 1 and 3 will take place in the same school (the Trainee's \"Home\" school) in a Foundation Stage class (3-5) , where the Trainee will become immersed as a full member of the School’s Foundation Stage team from the beginning to the end of the academic year.\r\n\r\nPlacement 2 will take place in a linked Primary school with a KS1 class (5-7) in which the Trainee will work alongside an experienced KS1 teacher, gradually assuming more responsibility for teaching and learning within that classroom. \r\n\r\nBy experiencing a school year from the day children start to the day children leave for their Summer holidays our Trainees are then prepared for what to expect in their NQT year when they'll have their own class. \r\n\r\nWhen allocating to schools we consider Trainees home locations, travel availability and the right mentor to support a Trainees needs as identified at interview. Second placements always take place in a contrasting school to ensure a real breadth of experience is had but even so we look to minimise travel time so as not to add additional difficulty to a challenging, yet rewarding year. We have partner schools across Birmingham and Solihull which makes this possible.","personalQualities":"We are looking for applicants who not only meet the minimum entry requirements, but who can also demonstrate suitability to train to teach. We are looking for the following skills, qualities and experience:\r\n \r\nA commitment to teaching and learning, particularly with reference to the Early Years;\r\nUnderstanding of children as learners;\r\nUnderstanding of educational issues;\r\nRecent experience of working with children/young people in an early years setting/school/out-of-school provision;\r\nA satisfactory standard of written and spoken English;\r\nAbility to use ICT;\r\nAbility to establish effective working relationships;\r\nAbility to take responsibility for their own professional development;\r\nResilience.","otherRequirements":"DBS clearance, and 'fitness to work' occupational health checks will be carried out prior to commencing the course.\r\n\r\nAlthough there is no minimum requirement for work experience in schools/early years settings we do expect applicants to be able to describe and reflect upon the way in which schools and teachers operate and how children learn. ","status":1,"createdAt":"2021-07-06T10:48:44.336Z","updatedAt":"2021-07-22T14:11:47.483Z","canSponsorStudentVisa":"no","cycle":"2024"}
