{"id":"4933d197-a008-442a-96fb-58fb1cc95846","name":"Chemistry","code":"F1X1","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"912d4fb4-761b-42e9-8dc6-e968b791ea4e","code":"F1","name":"Chemistry"}],"locations":[{"id":"fdb96c06-e024-4fdb-a456-c8349fd78e67","name":"Department of Education (University of Oxford)","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"6fe22ffb-07ca-4ea5-9203-2d8d17aaa68d","code":"O33","name":"Oxford University"},"profPost":"PG","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"We will also consider applications from candidates who have Third class Honours degrees if they also have extensive UK classroom experience, for example employment as a Teaching Assistant.","english":"2","maths":"2","acceptPendingGcse":"no","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"International qualifications viewed as comparable to qualifications taken within the UK are accepted for the PGCE. In order for the University of Oxford to formally recognise any overseas qualification you must present a Statement of Comparability from UK NARIC. Students in this position should first complete a course application and should then contact Get Into Teaching on 0800 389 2500. As an applicant for teacher training you can then obtain the Statement of Comparability for free (this usually costs £49.50 plus VAT).\n\nOxford's PGCE Office will only need to see the Statement of Comparability should you accept any offer to study on the course, we do not need to see the document in advance of an application or interview.\n\nIf the UK NARIC Statement of Comparability concludes that your qualifications are not equivalent, then the PGCE's Course Director will review your case. If the review is unsuccessful we may ask you to complete an equivalency test. You will be free to select the provider and type of test, as long as the final result is provided by our deadlines and is a GCSE or a direct international equivalent.","courseLength":"OneYear","feesUK":9250,"feesInternational":30330,"feeDetails":"Further details about fee status eligibility can be found on the [fee status webpage.](https://www.ox.ac.uk/admissions/graduate/fees-and-funding/fees-and-other-charges/fees#content-tab--2)\r\n\r\nEU applicants should refer to our detailed [fee status information](https://www.ox.ac.uk/admissions/graduate/fees-and-funding/fees-and-other-charges/fees#content-tab--2) and the [Oxford and the EU webpage](https://www.ox.ac.uk/students/oxford-and-the-eu) for details of the implications of the UK’s exit from the EU.\r\n\r\nIf you are a UK national who is normally resident in the Channel Islands or Isle of Man you will be assessed as an Islands student. For new entrants, Islands fees are aligned with the Home/ROI rate. These students may also be eligible for Student Finance England support; contact your local provider for tailored advice.\r\n\r\nCourse fees cover your teaching as well as other academic services and facilities provided to support your studies. Course fees do not cover your accommodation, residential costs or other living costs. As the PGCE course also requires regular travel to and from partnership schools it is recommended that all students budget approximately £720 for this purpose.  \r\n","financialSupport":"If you are a Home or Republic of Ireland student from a lower-income household, you may be eligible to receive an annual non-repayable [Oxford Bursary](https://www.ox.ac.uk/admissions/undergraduate/fees-and-funding/oxford-support) to help with living costs. The amount of bursary you get will depend on your household income, including the total value of any tax-free teacher training bursary or scholarship.\r\n\r\nThe Department of Education and Brasenose College are committed to attracting the very best candidates for Taught Master’s degrees, irrespective of their background or ability to pay. Black teachers are underrepresented in UK schools, particularly at senior levels, and the proportion of highly qualified Black students in Education Studies at Oxford is lower than across the rest of the UK. The Brasenose Graduate Opportunities Scholarship is open to PGCE offer holders with Home fee status who identify as either: Black African, Black Caribbean, Black Other or Mixed/multiple, including Black African, Black Caribbean or Black Other. The maximum value of this award is £25,000 which is intended to cover the full course fee plus a stipend. The award will be reduced if the recipient is also in receipt of a PGCE scholarship or bursary or equivalent. For full details please [click here.](https://www.bnc.ox.ac.uk/downloads/admissions/Brasenose_Graduate_Opportunities_Scholarship_advert_2021.pdf)","aboutCourse":"There are no formal application deadlines for the PGCE at the University of Oxford; if you meet our entry requirements we encourage you to apply as soon as possible.\r\n\r\nThe University of Oxford's PGCE team are running various events (virtual and in-person) throughout the year. Please [visit the Events page of our Department's website](http://www.education.ox.ac.uk/news-events/events/?event_type=open-days) for the latest details.\r\n\r\nThe University of Oxford provides an exceptional setting in terms of its academic resources and colleges. The Department of Education is small enough to make it possible for you to get to know your university tutors well, and every effort is made to provide you with strong social, academic and pastoral support. The PGCE course provides academic and professional supervision that aims to ensure you receive substantial and expert support. \r\n\r\nYou will spend about a third of the course in subject teaching sessions, professional studies lectures, and tutorials in the University. This programme is fully integrated with your school experience over the two placements (totalling 120 days), providing opportunities both to develop your subject teaching and to take on wider professional responsibilities as a teacher. The taught programme addresses subject-specific and general pedagogy as well as broader issues in schools such as safeguarding, diversity and special educational needs. Most teaching sessions are held in Oxford's Department of Education, although we occasionally make use of some of Oxford’s other teaching spaces. Depending on your subject area, you might also make use of local facilities such as the Ashmolean Museum and the Museum of Natural History, or occasionally go further afield such as a weekend residential trip to Somerset.\r\n\r\nThere are both academic and professional assessments throughout the course. There are two assessed assignments of 5,000 words each that relate to your subject teaching and one professional studies assignment also of 5,000 words. You will have tutorials in advance of the submission dates of these assignments to help you plan and structure your writing. There are also milestone assessments at the end of each term that focus on your teaching and work in school. Detailed assessment criteria for each milestone are set out in the course handbook, and these criteria relate to the Standards for Qualified Teacher Status. These criteria need to be met in order to pass the practical teaching component of the PGCE by the end of the course.","interviewProcess":"If your application meets our criteria for selection, you will be invited to interview. All applicants shortlisted for interview will be offered a clear choice: an in-person interview held in Oxford's Department of Education, or an online interview held virtually on Microsoft Teams. Regardless of method the content and criteria of the interview will be identical and so the University of Oxford does not have a preference; but we do reserve the right to remove this choice in cases where there are demanding deadlines. \r\n\r\nWe anticipate that prior to interview you will have been able to complete at least one day of observation in a non-selective, state funded UK secondary school. However if you cannot complete this observation then you are still encouraged to attend your interview.\r\n\r\nThe interviews are an opportunity for you to find out about Oxford, the Department, and our PGCE. We will try to give you a clear impression of what it is like to be a student on the course. We also want to find out about you, and you will be asked to complete a subject-specific written task. Your individual interview will normally be held by a relevant subject tutor from the University and a subject mentor from one of our partnership schools. To make our in-person and online interviews consistent there will be no group tasks.\r\n\r\nThere is only one interview. We aim to process the outcome of an interview within a week.","howSchoolPlacementsWork":"There will be two school placements during the course totalling at least 120 days in school, representing approximately two-thirds of the course. All schools in our partnership are secondary comprehensive schools, and your two placements will cover the full secondary school age range (11-18) including A-level teaching.\r\n\r\nThe longer first placement normally runs from September until April and the shorter second placement from April until the end of June. The first placement allows you to become thoroughly established in school and experience what it means to be a teacher. You will be in school two days a week and in University for three days. We call these joint (J) weeks, and these allow school experiences and university sessions to be fully integrated. From November your time in school increases to three days a week as you begin to take on more responsibilities.\r\n\r\nFrom January you will be in school full time. Just over half of your time in school each week will be spent teaching, with the rest being available to meet your subject mentor, to plan lessons, to observe experienced teachers, and to carry out other investigations to develop your teaching. You will also be in school full-time for the second placement, this will be an opportunity to enhance the teaching approaches you have developed in a new and often quite different context. There is a week in February and another in April/May when you return full time to the University. \r\n\r\nOur 35 partnership schools are located throughout Oxfordshire and neighbouring counties. The average distance from the department to a school is 15 miles. You are asked to budget £720 for the PGCE year for placement travel costs. \r\n\r\nWhen arranging school places we consider: your prior experiences, where you are living and any childcare or caring responsibilities.","personalQualities":"We seek graduates who enjoy their subject and see its relevance to everyday life. It is also highly valuable that you have a commitment to working with young people, show an interest in school teaching and know you will enjoy the environment of state-funded UK secondary schools. For example, you may have previous experience of working with young people, either on a voluntary or paid basis. You might also have spent time in a UK secondary comprehensive school, observing lessons, and talking with students and teachers.","otherRequirements":"All offers will be conditional upon:\r\n\r\n•\tA GCSE pass in Mathematics and English Language (grades 4-9 or A*-C)\r\n•\tEvidence of undergraduate degree graduation\r\n•\tCompletion of a Financial Declaration form\r\n\r\nAll candidates will also be required to complete an Occupational Health assessment, a Disclosure and Barring Service check and any appropriate international background checks. \r\n\r\nDuring your PGCE interview you will have the opportunity to discuss additional conditions to any PGCE offer, such as a Subject Knowledge Enhancement (SKE) course. \r\n\r\nAll conditions must be met before the course starts and your offer will lapse if these are not met.","status":1,"createdAt":"2021-07-06T10:49:49.841Z","updatedAt":"2021-10-04T11:19:09.650Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
