{"id":"397c6c37-02c8-4509-80b8-7bd90e89cabf","name":"Primary (Special Educational Needs)","code":"38V9","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"yes","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"d4db0a09-c4cd-4908-a9a5-297970dd0d57","name":"Main Site - Evelyn Street Primary School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"dc6d97f7-9cf6-410f-89e2-6df3c0f4f2a7","code":"15R","name":"Generate Teaching Hub"},"accreditedBody":{"id":"e328aab3-a535-4921-8ded-5e37133c76dd","code":"L46","name":"Liverpool Hope University"},"profPost":"PG","degreeGrade":"0","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We accept equivalency tests for English, Maths and Science.\nWe do not offer the tests, so recommend that candidates use Edge Hill University to complete the tests. Information can be found here [https://www.edgehill.ac.uk/admissions/edge-hill-university-equivalency-tests/]","courseLength":"OneYear","feesUK":9250,"financialSupport":"Trainee Support Available:\r\n\r\nEach trainee successfully entering a our School Direct  PGCE (QTS) programme 2022-23 has access to our device incentive. We reimburse trainees up to £250 towards a laptop/device (T&Cs apply).\r\n","aboutCourse":"Generate Teaching Hub School Direct are pleased to offer a Primary (with SEND) PGCE (QTS) route into teaching via our School Direct Programme. Successful completion of the course will qualify you to enter the teaching profession as a Early Career Teacher with a PGCE qualification which provides 20 masters credits.\r\n\r\nSchool Direct is an innovative way of delivering Initial Teacher Training via school placements and training led by successful schools themselves.  Our School Direct programme is highly successful and is led by a national Teaching School and delivered by our Alliance of highly performing schools.  \r\n\r\nTrainees undertake three school placements at different settings, maximising the range of experience received.  Experience will be gained in both mainstream and SEN settings over a minimum of 120 placement days.  In each placement trainees are treated as part of the school team and take part in all elements of the school day, attending staff meetings, supporting parents evening and extra-curricular activities for example.  This means our trainees graduate 100% ready to take on their ECT year and leave us classroom ready!\r\n\r\nTraining modules are delivered over the course of the year with 40 days being spent receiving formal training, attending masters days and in enrichment placements and experience days.  All training is delivered by the highest quality current practitioners and expert consultants meaning your training is current and relevant to schools today.  \r\n\r\nTrainees are assessed throughout the programme via placement observations, evidence files and two academic assignments.\r\n\r\nTraining days are usually delivered in and around Warrington and additionally through remote online learning. Masters Days are delivered by Liverpool Hope University.  Placement schools are usually in Warrington with some located across Cheshire West and Chester, Halton and Merseyside.\r\n\r\nGenerate Teaching Hub School Direct is proud of its outstanding team of mentors who support each of our trainees every step of the way through the programme and beyond.  With regular contact and personalised support available we have a high percentage of trainees graduating as 'Outstanding' and maintain our 100% pass and excellent employment rates.\r\n\r\n\r\n\r\n","interviewProcess":"Interviews are aimed to enable us to assess your key skills and attributes.  It will include:\r\n\r\n* Observed Classroom Activity - You will be asked to deliver a short lesson to a group of children on the subject area of your choice.  Further details will be confirmed in the invite to interview letter.\r\n\r\n* Interview - Conducted by a panel of ITT leads a set of questions designed to ascertain your ideas and knowledge on a range of educational issues will be asked.\r\n\r\n* Literacy test - You will undertake a short literacy task to assess your standard written English.\r\n\r\nThe interview process is subject to change, depending on Government guidance on Covid-19. Occasionally, interviews are held online.","howSchoolPlacementsWork":"This training route with include at least one placement within a SEN setting. \r\n In addition to this placement Generate Teaching Hub School Direct has a wide network of mainstream settings who host our trainees during placements, many of which also have SEN provision.  Most of these schools are within the Warrington area, but there are a small number of placements in schools located in Cheshire West and Chester, Halton and Merseyside Local Authority Areas.\r\n\r\nWe are able to draw on a range of school characteristics and offer schools which are for example:\r\n* Rural and semi-rural\r\n* Urban\r\n* Faith schools\r\n* Academy schools\r\n* SEN schools and colleges\r\n* High levels of Free School Meals, etc.\r\n\r\nTrainees undertake three placements in at least 2 different schools over the course totalling a minimum of 120 days.\r\n\r\nEach placement is chosen based on trainees development needs and prior experience with an aim to offer the broadest experience possible and to develop them as teaching professionals.  This training route is aimed to produce highly trained teachers who may either choose to work within the SEN settings or be equally confident working within mainstream settings and this is supported by the placements selected.  Enrichment placements will be selected to give a broad taste of the primary curriculum and to offer a wide range of setting experiences.\r\n\r\nPotential candidates are encouraged to contact the School Direct team on schooldirect@wpat.uk with any questions they may have regarding the course or placements.","personalQualities":"Generate Teaching Hub School Direct seek applications from passionate and dedicated candidates, those who are motivated by seeing children progress and receiving the best educational opportunities possible and want to be a part of that journey for children.\r\n\r\nYour capacity to learn and dedication to teaching as a profession is what we are looking for in a candidate.  Resilience, high levels of organisation and professionalism along with great communication skills and excellent written and spoken Standard English are essential for success.\r\n\r\nIt is desirable to have some classroom experience and of having worked with children or young people.","otherRequirements":"Liverpool Hope University will undertake the following prior to the start of the course:\r\n* Health Check Statement\r\n* Enhanced Disclosure from the Disclosure and Barring Service.\r\n* Overseas Declaration\r\n\r\nThe DFE have published that Skills Testing previously required are not a requirement for 2022/2023 applicants.","status":1,"createdAt":"2021-07-06T10:47:36.475Z","updatedAt":"2021-10-04T09:36:20.841Z","canSponsorStudentVisa":"no","cycle":"2024"}
