{"id":"4b2226d5-3233-4522-8e29-bc242a2a16ee","name":"Chemistry","code":"36PQ","qualification":"qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"912d4fb4-761b-42e9-8dc6-e968b791ea4e","code":"F1","name":"Chemistry"}],"locations":[{"id":"80ce5903-33e7-43f8-948e-fd2396b2b65a","name":"Doncaster ITT Partnership","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"ce4a08a6-9484-4a08-9824-7d141834f134","code":"2G3","name":"Doncaster Regional Alliance For Teacher Training Secondary"},"accreditedBody":{"id":"762ad8a4-41ad-495b-aff1-37a53aebe264","code":"D51","name":"Doncaster ITT Partnership"},"degreeGrade":"1","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Applicants without a GCSE will only be considered if they have the support of a Partner School. \n\nApplicants awaiting a GCSE award or the results of an Equivalency Test should contact the Partnership for advice before applying.","courseLength":"OneYear","feesUK":8050,"feeDetails":"Tuition-fees for SCITT & School Direct for 2022-23 are:\r\n \r\n- £8050 for QTS \r\n- £9,250 for QTS + PGCE\r\n\r\nThe PGCE is optional and applicants can decide whether to undertake the additional course (i.e. in addition to their QTS training) after being accepted onto the training programme.\r\n","aboutCourse":"As Doncaster’s ONLY Accredited ITT Provider, we aim to recruit to a range of Secondary subjects from Art & Design to Physics, with trainees placed in a wide range of Schools and Academies across Doncaster offering contrasting, yet complementary, experiences to trainee teachers. \r\n\r\nOur programmes are not just about the ‘Lead School’ as they are instead driven by genuine ‘Alliances’ of contrasting Secondary (and Primary) Schools and Academies working together locally to deliver genuinely schools-based teacher training. \r\n\r\nThe Partnership offers high-quality schools-based training and a central training programme which is personalised to the needs of trainees and delivered by outstanding practitioners from our Alliance schools.\r\n\r\nAll trainees are allocated an experienced ITT Tutor, who, in addition to holding regular tutorials with their Tutor Group to share best practice and peer review, will also carry out support visits to trainees in their placement schools. \r\n\r\nThese visits comprise discussions with in-school Mentors and the school’s Training Coordinator, as well as a lesson observation of the trainee, if appropriate, and discussion of their evidence collation on an on-line ePortfolio system. \r\n\r\nVisits are carried out each ½ term, with an initial ‘settling-in’ visit in the first half term of each placement, then a more in-depth visit towards the end of the 1st and 2nd placement terms. \r\n\r\nA final (5th) visit in late May precedes the trainee’s Summative Assessment (June / July) ahead of awarding Qualified Teacher Status. \r\n\r\n\r\nPGCE:\r\nAll Partnership trainees have the option to enrol on an additional PGCE (Post Graduate Certificate in Education) course delivered by our University Partner’s Tutors at venues in Doncaster.\r\n\r\nThe PGCE is an internationally recognised teaching qualification and the programme is fully integrated into the main QTS course and enhances the in-school and central training by adding additional academic studies.\r\n\r\nThis enables SCITT & School Direct trainee teachers to progress through a programme of part-time study to Level 7 and to the award of PGCE, in addition to achieving Qualified Teacher Status (QTS). \r\n\t\r\nTrainees do not have to complete a PGCE, as there is only a requirement to have Qualified Teacher Status (QTS) to teach in England, so we offer the PGCE as an additional optional course. \r\n\r\nThis also offers the flexible submission of assignments to avoid peak workload periods during the ITT / QTS year. \r\n","interviewProcess":"Applications need to be made to the Partnership who, in collaboration with Partner schools, complete an initial sifting process. Applicants will then be informed by the Partnership if they have progressed to the schools' recruitment process or not. \r\n\r\nIn-school assessments will include audits of literacy and numeracy skills, an interaction with pupils (if possible) and an interview (which may be on-line) with either phase or subject specialists and senior Alliance colleagues. If successful at that stage, applicants would receive information from the Partnership about the next steps in their application. \r\n\r\nSecondary applicants deemed successful at initial short-listing will be invited to attend an interview and assessment in/with an Alliance school, but this may not be the eventual training school.\r\n\r\nOur Alliance of schools then make the final decisions and will either (hopefully) confirm their offer of a training place in their school or, if not, provide reasons for not supporting an applicant. \r\n\r\nIf successful, the Partnership will then work with the school to make arrangements for induction onto the training programme to start in September. Part of this will involve starting to get to know the training school that you'll be based in initially and will also include two induction days in June/July. \r\n\r\nFurther information can be found at: [Doncaster ITT](www.doncasteritt.co.uk)","howSchoolPlacementsWork":"Our school Alliance:\r\n-\tHall Cross Academy heads up ‘DRAFTTs’ (Doncaster Regional Alliance For Teacher Training Secondary), an Alliance representing the majority of Doncaster’s larger Secondary academies.\r\n\r\nTrainees will be based in one placement school for their 1st term, a ‘contrasting’ placement school for the majority of the 2nd term and then either: return to their initial placement school; stay on in their 2nd placement or in some cases move to a 3rd placement school for the final term, based on their individual training needs.\r\n\r\nAll placements are in Doncaster schools and all training is delivered within the Borough, including the optional PGCE programme, if completed.\r\n\r\nSecondary training is 11 to 16/18 (Key Stages 3 & 4 with some KS 5 experience).","personalQualities":"Applicants must be competent in Fundamental English and Mathematics and will be assessed for their ability to:\r\n- speak, listen and communicate using standard English grammar (clear pronunciation and vocabulary);\r\n- read fluently;\r\n- write clearly and legibly (correct spelling and punctuation); \r\n- complete mathematical calculations fluently (whole numbers, fractions, decimals and percentages);\r\n- solve mathematical problems using a variety of methods and approaches (estimating, rounding, sense checking answers, breaking down problems, explaining and justifying answers using appropriate language).\r\n\r\nHigh-quality applicants will have had some classroom experience and will exhibit a genuine passion for teaching and supporting children’s learning.\r\n","otherRequirements":"Applicants must not have failed or withdrawn from a previous ITT programme unless there are exceptional circumstances, which must be discussed with schools. \r\n\r\nAs per any role in a school, you will have to complete a Disclosure and Barring Service (DBS), prohibition, disqualification and health checks before taking up a training place.\r\n\r\nGood luck with your applications!","status":1,"createdAt":"2021-07-06T10:52:04.015Z","updatedAt":"2021-09-21T15:47:27.769Z","canSponsorStudentVisa":"no","cycle":"2024"}
