{"id":"9e6f1e4c-5607-49ab-bf68-454556d34974","name":"Business Studies","code":"33MD","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"de6477b2-6027-48e6-b9f7-3206774705c2","code":"08","name":"Business studies"}],"locations":[{"id":"2d88c374-4e5c-4855-a38c-230491ff2a5d","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"efacc8e8-79db-41bb-b7c4-83300535d1fc","code":"1F2","name":"Aston Manor Academy"},"accreditedBody":{"id":"034b57f5-d231-41d7-aa08-475cd841b5e9","code":"T30","name":"Titan Partnership Ltd"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We recommend using www.equivalencytesting.com for equivalent GCSEs. If you wish to use an alternative provider, please contact us to make sure that they are accepted.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Our School Direct programme is a  37 week, full time school-led course that leads to QTS and a PGCE with Master's credits.\r\n\r\nYou will be based at Aston Manor Academy for your training, but you will need to complete a short second placement with one of our partnership schools, this will give you a balance of experience across two contrasting school settings.\r\n\r\nAfter your induction week, you will be based in school Monday-Friday.On a Tuesday morning you will attend cross-phase taught sessions at our learning hub. These sessions are designed to give you an understanding of the elements of your professional role that lie outside of the national curriculum. These sessions are delivered by a range of speakers who are experts in their field. \r\n\r\nYou will also attend twilight subject specific taught sessions to assist with you with planning, assessing and delivering your aspect of the national curriculum. These sessions will examine the particular nature of learning in your subject area and delivered by subject specialists from our partnership of schools.\r\n\r\nAs this is a school-led programme, you will spend the majority of your time in school learning from excellent practitioners. You will start by observing good practice in your placement school before starting to team teach alongside your designated school based trainer. You will then have the opportunity to  deliver solo lessons before you begin your assessed teaching practice on a 50% timetable.\r\n\r\nDuring your school placements you will be supported by your School Based Trainer (SBT) and a Professional Tutor (PT). You will have a weekly one-to-one with your SBT and regular meetings with your PT in order to review progress against the Teachers' Standards. In addition to this, you are also supported by a Subject Leader and our team of Titan ITT experts.\r\n\r\nYou will also find a number of ex-trainees in your placement schools, many of whom are in senior leadership roles, these too will prove a valuable source of guidance and support.\r\n\r\nQTS is assessed by your classroom practice, a portfolio of evidence against the Teachers' Standards and a reflective practice folder.\r\nThe PGCE is assessed through 2 written assignments and 1 research task.\r\n\r\nThis is a demanding, although highly rewarding, course and we look forward to supporting you in all aspects.\r\n","interviewProcess":"Following your successful application, you will be invited to join us for an interview. As part of our interview process you will take part in:\r\n\r\n* A 10 minute presentation\r\n* A 40 minute formal interview\r\n* A 40 minute subject knowledge test (adapted GCSE paper)\r\n* A 10 minute short reflective written task.\r\n* A 30 minute lesson \r\n","howSchoolPlacementsWork":"You will have the experience of two school settings. Your main placement will be with Aston Manor Academy. Your second school experience will be for a minimum of 25 days, this experience is likely to take place in the second term of the course.","personalQualities":"You will need to demonstrate a  passion for your subject, education and making a difference to the lives of young people. \r\n\r\nYou will need to possess good time keeping skills and be able to prioritise your workload.\r\n\r\nYou will face many new challenges and will need to have  the determination and resilience to meet these challenges and overcome any difficulties.\r\n\r\nYou need to have the ability to listen to advice and be able to act upon it. You will be offered constructive criticism on a regular basis which will be designed to help you improve your teaching skills.","otherRequirements":"Once you are accepted onto our course we will carry out a DBS and Fitness to Teach check.\r\n\r\nPlease ensure the references used on your application are of a professional nature. Where possible include a reference from a school if you have managed to gain any recent school experience.","status":1,"createdAt":"2021-07-06T10:48:08.417Z","updatedAt":"2021-09-22T10:54:14.989Z","canSponsorStudentVisa":"no","cycle":"2024"}
