{"id":"7d87e640-e4b1-4d48-91b8-c6d2ba361b48","name":"Primary (5-11)","code":"X100","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"33276166-6250-4ce7-8737-79a3edf8dada","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"d4a65e61-defa-4861-b837-17ef2a1157c7","code":"N38","name":"University of Northampton"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"If you are considering taking a GCSE equivalency test, please contact University Admissions for advice before doing so.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"This programme will develop highly employable and reflective teachers capable of transforming lives, and inspiring and leading change in schools. Throughout the PGCE Primary programme you will be enhancing your subject and pedagogic knowledge in order to become a creative, dynamic and innovative teacher. \r\n\r\nOverall there are five modules; three placement modules and two modules at Level 7. The two modules at Level 7 are Teaching, Learning and Assessment and Professional Studies. These are taught at our purpose built Waterside Campus by experienced and expert tutors and  address the  ITT Core Content Framework, National Curriculum coverage and national priorities in primary education. Over the year, there are blocks of centre-based Learning Events and three school-based training experiences (placements). There are two assignments, which are linked to the Level 7 modules.\r\n\r\nThe University of Northampton has an extensive School Experience Library which is an excellent resource offered specifically to trainee teachers to enhance their classroom practice. ","interviewProcess":"Applicants selected for interview will have an individual interview with a member of university staff and usually a Senior Leader from a Partnership school.  This will explore an applicant's capacity to train to teach.\r\n\r\nIt is the policy of The University of Northampton that candidates should not be prejudiced as a result of any disability and reasonable adjustments will be made to mitigate unfair discrimination. Therefore, all candidates with disabilities are encouraged to identify and/or request support for actual or potential circumstances.","howSchoolPlacementsWork":"The University of Northampton works in partnership with over 150 schools. The PGCE programme includes three school-based training experiences (placements) and the normal pattern is referred to as ABA where the autumn term and summer term are based in school A in the same class and the spring term in school B in the alternative key stage. The age range is 5-11. \r\n\r\n\r\nIn each placement you will have a trained mentor who will support you to develop the skills required to be a primary school teacher.","personalQualities":"To be considered for entry for the PGCE, prospective candidates must have the necessary personal attributes, meet the entry requirements required by the Teacher Regulation Agency for schools, provide suitable references to support their academic qualifications and/or their prior experiences.\r\n\r\nPersonal attributes include:\r\n\r\n *commitment to working with children and making a difference to their progress\r\n* personal organisation and time management skills\r\n* ability to work with others and respond to advice\r\n* competent use of standard spoken English.\r\n\r\n","otherRequirements":"You must be interviewed in order to assess your capacity to train to be a teacher. In order to confirm your suitability to teach you will also need to undertake checks such as the Disclosure and Barring Service (DBS) and health checks.\r\n","status":1,"createdAt":"2021-07-06T10:55:50.351Z","updatedAt":"2021-08-16T13:45:33.004Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
