{"id":"693d32a4-38e0-48d0-a5b5-15b4568d57c2","name":"Modern Languages","code":"3CFW","qualification":"qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"ce8523ef-9236-4cd9-b260-d826c7a521b3","code":"ML","name":"Modern Languages"},{"id":"4608e5e3-2a1a-48a1-8236-56c7af5a139d","code":"24","name":"Modern languages (other)"}],"locations":[{"id":"28833cd0-12d3-4c36-a03a-7f333d3af392","name":"Ipswich Academy","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"2ed9b983-2151-47c1-9042-acc32961857c","code":"1C8","name":"Paradigm Trust: Old Ford Primary Academy and Ipswich Academy"},"accreditedBody":{"id":"00782614-9301-40e4-8832-9a74cc1bbb07","code":"E75","name":"Essex Teacher Training"},"degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We advise applicants to use one of the two equivalency testing providers listed below.\n\n[Astarteachers.co.uk] (https://www.astarteachers.co.uk/gcse-equivalencies-assistance/)\n\nOR\n\n[Equivalencytesting.com] (https://www.equivalencytesting.com/)","courseLength":"OneYear","feesUK":null,"aboutCourse":"A one year, full-time, school based route.  Trainees will achieve QTS and have the option to buy-in to a PGCE Programme with Anglia Ruskin University.  The cost of this is £1300 and payable in 2 instalments.  Training is majority school-based with some centre-based training. Training is a blend of face to face and online and occurs at various locations across Essex so we take into account your home address to try to keep travelling time to a minimum.  You will receive training on the general aspects of successful teaching and training around teaching your specific subject in secondary or phase within primary.\r\n\r\nIn school you will work closely with a subject / phase specific mentor and the ITT co-ordinator, who will meet regularly with you to assist you with your training plan.   You will also have an external tutor who works for Essex Teacher Training, who will visit you in school 5 times in the year to check on your progress towards meeting the Teachers' Standards.\r\n\r\nThe PGCE is delivered locally in Essex by Anglia Ruskin University and comprises 2 assignments and related tasks, which are spread across the course of the year.\r\n\r\nTrainees will have access to an online e-portfolio system and online resources along with face to face training sessions.  These along with the excellent support from in-school mentors and tutors from Essex Teacher Training, will mean you will feel fully prepared for working in the classroom.  Your teaching load will start small and increase gradually as the year progresses.  The rate at which this increases will be decided by you and your tutors and take into account any prior experience.\r\n\r\nAssessment is via observations of you teaching, reflective pieces of writing and specific tasks relating to the different Teachers' Standards.\r\n","interviewProcess":"If you are successfully shortlisted for interview, you can expect to be observed teaching a short lesson with a class so we can assess your teaching potential.\r\n\r\nIn addition, you will attend a face-to-face interview with senior members of staff.\r\n\r\nIf successful, you will be given a conditional offer of a place to train.","howSchoolPlacementsWork":"Trainees will be based in Ipswich Academy.\r\n\r\nThe programme covers the secondary age range 11-16 and you will be required to teach at both KS3 and KS4.  You will spend the majority of your training year at Ipswich Academy but will also be required to undertake a short placement in another school.\r\n","personalQualities":"We are looking for enthusiastic, motivated and  inspirational individuals who see teaching as more than 'just a job.' People who want to make a difference and help pupils to be their very best. People who want to  change lives.\r\n\r\nIf you are looking to work with an organisation that has a proven track record of improving the life chances of thousands of children then this is the place for you.\r\n\r\nTeaching is never an easy job, but if you are willing to put in the effort and commitment, then we will support you and the rewards will be immense.\r\n\r\n","otherRequirements":"Candidates who have relevant, significant experience (6 months+) working with children in a school/ classroom setting will have an advantage.\r\n\r\nSatisfactory recruitment checks including enhanced DBS, children’s barred list, prohibition order check and reference check.","status":1,"createdAt":"2021-07-06T10:55:37.631Z","updatedAt":"2021-11-05T14:25:40.413Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"Trainees on the School Direct (salaried) programme are paid a minimum of point 1 on the unqualified teacher scale depending on experience.\r\n\r\nThere are no fees payable for this programme unless you wish to opt-in to the PGCE programme offered by Essex Teacher Training in partnership with the Anglia Ruskin University.  Fees are currently set at £1300 and payable in instalments."}
