{"id":"11cc1356-5fb9-4790-af60-da42e984726c","name":"Religious Education","code":"3CYF","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"724b5d16-28dd-4431-bc17-ea4be4daedc4","code":"V6","name":"Religious education"}],"locations":[{"id":"99e0dc81-15cc-4047-a9a1-6c65d4b876a8","name":"The Education Centre at Stockton Sixth Form College","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"f17d08c1-2257-4ccb-a4b6-e2f03205609e","code":"S60","name":"Stockton-on-Tees Teacher Training Partnership"},"profPost":"BO","degreeGrade":"1","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Please contact the provider to discuss options.","courseLength":"OneYear","feesUK":9250,"feesInternational":9250,"financialSupport":"We offer a laptop loan service for use throughout the course.\r\n\r\nIf you are responsible for Council Tax we are able to provide you with a letter to confirm your eligibility for discount as a full time student.","aboutCourse":"The training is graduated so that trainees focus on the essential concepts at different stages of training.  This is why there is a strong focus on planning and managing behaviour initially, plus core curriculum for primary trainees as well as the skill of effective observation.  Gradually over the year, trainees are introduced to more and more aspects of teaching such as SEND, foundation subjects for primary and KS4 for secondary trainees.   There is a strong focus on evidence-based practice so that trainees learn the most effective teaching strategies that have been proven to make a difference to pupil learning; knowing why something works creates better teachers. \r\n\r\nWe prioritise your subject knowledge development, both in terms of content and pedagogy (how to teach Religious Education).  Your training in school is personalised to meet your unique needs and will include a variety of activities. You will be assigned an Religious Education specialist as your mentor.  You will work closely with your mentor and other colleagues within the school every day.  Time will be spent observing experienced colleagues and learning about the craft of the classroom as well as weekly one to one sessions with mentors, participation in your placement school’s staff training, subject specific advice to support your planning and teaching, colleague and pupil shadowing, and much more.\r\n\r\nOver 70% of your time will be spent in school learning from experienced, excellent teachers.   Your progress is reviewed regularly through observation of your practice and reflective conversations with your mentor and professional tutor.  We also offer the academic, Masters Level PGCE, accredited through Sheffield Hallam University.  The PGCE is fully integrated into our programme, with direct links to educational theory.  You gain access to Sheffield Hallam’s vast online library and all training is undertaken locally in Stockton.\r\n","interviewProcess":"We have robust safeguarding procedures in place, therefore enhanced Disclosure and Barring Checks (DBS) and barred list checks are undertaken to ensure trainees are suitable to train to teach.\r\nOur recruitment process follows a number of steps:\r\n\r\n* Stage One: Screening\r\nApplications are checked to ensure that applicants' qualifications meet the entry requirements.\r\n\r\n* Stage Two: Scrutiny\r\nApplications meeting the entry requirements are scrutinised by the Partnership against set criteria.\r\n\r\n* Stage Three: School Based Interview Process\r\nCandidates who are invited to participate in stage 3 of the selection process will usually attend a Partnership school where they will be required to undertake a teaching activity. This will be followed by a formal interview with the head teacher or other school leaders alongside representatives from the Partnership and a written task. The process is designed to assess fundamental English and maths skills, subject knowledge, ability to engage with young people and assess a trainee’s overall suitability to train to teach.\r\n","howSchoolPlacementsWork":"We work with a large number of schools in the Stockton area and beyond.  Stockton’s educational outcomes are strong.  Training with Stockton SCITT means working in successful schools, with excellent teachers who ensure pupils in Stockton get the best educational deal possible.  Where primary schools have Ofsted judgements, 93.7% of Stockton primary school pupils attend a Good or Outstanding school.  95% of our partner primary schools in Stockton are Ofsted graded Good or Outstanding.  For secondary, for those schools with Ofsted judgements, 92.5% of Stockton secondary school pupils attend a Good or Outstanding school.  92.3% of our partner secondary schools are Ofsted graded Good or Outstanding. *Based on 2019 data.\r\n\r\nTrainees are assigned two placement schools across the year.  You have a host (main placement) school that you will work with the majority of the year (autumn and summer terms) and a shorter second school placement in the spring term.  In each school, you have a mentor dedicated to supporting your development.  \r\nIn school, trainees follow one of three programmes:\r\n\r\n*\tAge 3-7 primary programme, covering Key Stage One and the Early \r\n        Years\r\n\r\n*\tAge 5-11 primary programme, covering Key Stages One and Two\r\n\r\n*\tAge 11-16 secondary programme, covering Key Stages Three and Four\r\n\r\nIn addition, all trainees will have the opportunity to engage with our ‘Wider Education Week’ visiting special schools, pupil referral units and experience a different phase of teaching from the phase in which you are being trained.\r\n\r\nPlacements take the individual circumstances of trainees into account, e.g. geographical location of the school in relation to your home.\r\n","personalQualities":"Teaching is an incredibly rewarding career.   We are looking for potential; If you are passionate about making a difference to the lives of young people, have a positive outlook, are patient and adaptable, have good interpersonal skills, are creative and imaginative, have good organisational and time management skills, are reflective and strive to improve your own practice, then this could be the career for you. Previous school experience is not part of the essential criteria but some experience could help inform your decision to train to teach and is one way to enhance your application.  ","otherRequirements":"Applications are enhanced by evidence of some experience in a school but it is not a condition for application.\r\n\r\nSuccessful applicants will be required to undertake an enhanced Disclosure and Barring check, sign a declaration that they have not previously been excluded from teaching or working with children and complete a medical health questionnaire which may be subject to an occupational health referral. This will be arranged by the Partnership.","status":1,"createdAt":"2021-07-12T13:48:32.658Z","updatedAt":"2021-09-28T08:47:31.622Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
