{"id":"7694508b-b5bb-47a3-8e86-1af106dff763","name":"Primary","code":"3X5A","qualification":"qts","startDate":"2024-06-30T23:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"TA","fundingType":"apprenticeship","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"c3067a24-fe07-4b27-a5f4-99c5ea74a523","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"f17d08c1-2257-4ccb-a4b6-e2f03205609e","code":"S60","name":"Stockton-on-Tees Teacher Training Partnership"},"degreeGrade":"1","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"Please contact the provider to discuss options.","courseLength":"OneYear","feesUK":null,"aboutCourse":"This new one-year route, launched in September 2018, is designed as an additional route in to teaching to improve recruitment of teachers.   It provides a fee-free, salaried route for graduates to enter the teaching profession and gain Qualified Teacher Status (QTS) within one year.\r\n\r\n* We anticipate that schools are likely to consider this route for TAs they currently employ whom they wish to support to become qualified teachers.\r\n* Stockton SCITT does not directly recruit apprentices to place in schools.  You must already be employed in the school and the Headteacher must be willing to support your application.\r\n\r\nThe partnership prides itself on our bespoke programme personalised to meet your individual needs.  \r\n\r\nWe prioritise your curriculum knowledge development, both in terms of content and pedagogy (how to teach).  Throughout your training, you will receive substantial, bespoke curriculum training to support your subject knowledge development.  Your training in school is personalised to meet your unique needs and will include a variety of activities. You will be assigned a teaching specialist as your mentor.  You will work closely with your mentor and other colleagues within the school every day.  Time will be spent observing experienced colleagues and learning about the craft of the classroom as well as weekly one to one sessions with mentors, \r\nparticipation in your placement school’s staff training, advice to support your planning and teaching, colleague and pupil shadowing and much more.\r\nThe ethos of the programme is experiential learning and as such, over 70% of your time will be spent in school learning from experienced, excellent teachers.   You are assessed on an ongoing basis, through observation of your practice and reflective conversations with your mentor and professional tutor.  \r\n","interviewProcess":"We have robust safeguarding procedures in place, therefore enhanced Disclosure and Barring Checks (DBS) and barred list checks are undertaken to ensure trainees are suitable to train to teach.\r\nOur recruitment process follows a number of steps:\r\n* Stage One: Screening\r\nApplications are checked to ensure that your qualifications meet the entry requirements.\r\n* Stage Two: Scrutiny\r\nApplications meeting the entry requirements are scrutinised by the Partnership against set criteria.\r\n* Stage Three: School Based Interview Process\r\nIf you are invited to participate in stage 3 of the selection process, you will be offered an interview at your employing school which will involve an interview with the Partnership and a written task. \r\nCandidates who are invited to participate in stage 3 of the selection process will usually attend a Partnership school where they will be required to undertake a teaching activity. This will be followed by a formal interview with the head teacher or other school leaders alongside representatives from the Partnership and a written task. The process is designed to assess fundamental English and maths skills, subject knowledge, ability to engage with young people and assess a trainee’s overall suitability to train to teach.\r\n\r\nConditional offers are usually be made within 24 hours from the date of interview and often sooner than this. Offers will be confirmed via UCAS.\r\n\r\n","howSchoolPlacementsWork":"You train largely in the school in which they are employed.  All apprentices must undertake a second placement in another school, usually in the spring term, negotiated between the partnership and the employing school.\r\n\r\nIn school, you follow one of two programmes:\r\n\r\n* Age 3-7 primary programme, covering Key Stage One and the Early  \r\n   Years\r\n* Age 5-11 primary programme, covering Key Stages One and Two\r\n\r\nIn addition, you will have the opportunity to engage with our ‘Wider Education Week’ visiting special schools, pupil referral units and sixth form provision (secondary only).\r\n","personalQualities":"Teaching is an incredibly rewarding career.   We are looking for potential; if you are passionate about making a difference to the lives of young people, have a positive outlook, are patient and adaptable, have good interpersonal skills, are creative and imaginative, have good organisational and time management skills, are reflective and strive to improve your own practice, then this could be the career for you. Previous school experience is not an essential criteria but if you are able to gain some experience, it could help inform your decision to train to teach and is one way to enhance your application.  ","otherRequirements":"Applications are enhanced by evidence of some experience in a school but it is not a condition for application.\r\nSuccessful applicants will be required to undertake an enhanced Disclosure and Barring check, sign a declaration that they have not previously been excluded from teaching or working with children and complete a medical health questionnaire which may be subject to an occupational health referral. This will be arranged by the Partnership.\r\n","status":1,"createdAt":"2021-07-06T10:49:56.535Z","updatedAt":"2021-11-08T12:01:47.847Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024"}
