{"id":"b678e729-b68c-41fb-94b1-b6b807c916ce","name":"Geography","code":"2KWM","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3f47e67b-7fa5-4947-a5a0-74d528cd2a87","code":"F8","name":"Geography"}],"locations":[{"id":"b6f5c48a-6515-47d1-966f-45ecf7821ea2","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"de0e238a-7d46-48c4-b6e6-989a78955d34","code":"235","name":"Lincroft Academy"},"accreditedBody":{"id":"828d1c59-36a8-4678-9a60-662565ae7172","code":"C03","name":"The Cambridge Partnership"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"The Pilgrim Partnership will accept equivalent GCSE qualifications in English, maths and science by a recognised third party.  As an exam will incur a cost please contact us to make sure the awarding body is acceptable.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Trainees on the School Direct (Tuition Fee) route will be working in a classroom with an experienced appointed mentor.  You will have at least one meeting a week.\r\n\r\nTrainees will spend most of their year based in a school for four days a week and then attend training on the fifth day.  The training sessions will be led by expert practitioners, some of whom work in our excellent partner schools along with  regular training from a subject specialist. Both will support you to develop your knowledge, skills and understanding of teaching lessons effectively in a secondary school across all key stages, where applicable.  \r\n\r\nAs part of the programme trainees will complete a contrasting school placement and attend focus days to enhance your expertise and understanding of SEND and other specialist areas of education.\r\n\r\nA programme of continuous formative assessment of trainees' subject knowledge and ability to teach, as recorded within the portfolio, culminates in a rigorous assessment of the Teachers' Standards for Qualified Teacher Status (QTS) as specified by the Department for Education (DfE).  As an accredited provider, the partnership recommends trainees, on successful completion of their training programme for Qualified Teacher Status (QTS).  Trainees will also study for a PGCE alongside QTS.\r\n","interviewProcess":"Candidates who meet the entry requirements will be invited to interview.\r\n\r\nDue to the current restrictions regarding Covid-19, the interview will take place online via TEAMS and involve staff from SAF ITT.\r\n\r\nFurther information will be forwarded to candidates invited to interview to enable them to prepare for the interview.\r\n","howSchoolPlacementsWork":"Subject to COVID-19 Government Regulations:-\r\nTrainees will have two school placements in addition to other placements visits during the programme and will be supported by mentors and the SAF ITT team.  If Covid-19 restrictions allow, trainees will also spend time in a special school.\r\n\r\nTrainees will be allocated a school taking into account where they live and their individual needs.  The school will be either 11-16 age range or 11 to 18.\r\n\r\n\r\n\r\n","personalQualities":"The Pilgrim Partnership, working with The Cambridge Partnership as the accredited provider, and its partners are looking for ambitious trainee teachers who are passionate and enthusiastic about working with children.  The programme is challenging, and so we are looking for candidates with a wide range of skills, knowledge, experiences and an aptitude for teaching.\r\n","otherRequirements":"\r\n* Declaration of any convictions declared on your UCAS application\r\n* An Enhanced DBS Disclosure will be required following an offer of a place\r\n* A satisfactory health questionnaire will be required follow an offer of a place\r\n* Satisfactory clearance for registration\r\n","status":1,"createdAt":"2021-07-06T10:52:13.938Z","updatedAt":"2021-11-05T09:51:57.553Z","canSponsorStudentVisa":"no","cycle":"2024"}
