{"id":"ac3557c4-6520-4d26-bf7c-fa120161a83b","name":"Primary","code":"2RXQ","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"e2e8c0b1-c8b2-40be-ad3e-7b0f64a14baa","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"d1e18920-2720-4378-b0a7-b615ab325da1","code":"289","name":"Ashmead Combined School"},"accreditedBody":{"id":"6e6c8aa3-8d77-4c7d-af3c-4c7912b1cc2a","code":"T89","name":"Two Mile Ash ITT Partnership"},"profPost":"BO","degreeGrade":"9","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We recommend Birmingham City University for equivalency tests","courseLength":"10 months","feesUK":9250,"feeDetails":" Trainees will need to fund their own tuition fees – this can either be done privately (in three termly instalments, further details available from the Partnership if required) or by applying for a tuition fee loan from the Student Loans Company.\r\n\r\nIf you take out a tuition fee loan, the tuition fees will be paid automatically to the Partnership by the SLC and you will pay them back, according to a pre-determined schedule, once you are employed and earning over the minimum salary threshold. \r\n\r\nLoans should be applied for as soon as you have accepted your UCAS offer.\r\n\r\nDepending on your personal financial circumstances, you may also be eligible for a maintenance loan to contribute towards your costs of living. This is means-tested and will be completely individualised to each applicant. This is paid termly, at the start of each term, by the Student Loans Company.\r\n\r\n\r\nIn addition to the fees, you will also be required to cover the cost of a Disclosure and Barring Service (DBS) application (Approx. £60), which is a prerequisite for working in schools. \r\n\r\nFees of £9,250\r\n","aboutCourse":"At its core, this course has two key elements that drive its success; practical experience and personalised support. These are delivered through three main components:\r\n\r\nSchool based training:\r\nFrom the outset, trainees are immersed in a school environment, each being assigned a main school placement, a classroom base and an experienced School Based Trainer (SBT) who will support their development throughout the year. This main placement is complemented by a crossover experience, typically during the first half of the Spring term. Designed to complement each other, the crossover offers experience in a contrasting school and key stage. \r\n\r\nThe close working relationship of trainee and SBT sits at the core of this programme model and facilitates the depth of understanding necessary for personalised support. Tutorials every two weeks with a Training Manager extend this, together providing a truly individual learning journey.\r\n\r\nCore training:\r\nSchool based training is complemented by core training on a Friday within one of the partnership schools. It is delivered by a range of subject specialists and provides a comprehensive programme that closely links to the Teacher Standards in Initial Teacher Education, and other important issues such as Safeguarding, E-Safety and Emotional Well-Being. The sessions enable trainees to develop a deeper understanding of key issues and pedagogical thinking by encouraging them to critically reflect on research in relation to their own classroom practice.  \r\n\r\nUniversity led learning:\r\nAll trainees are given the opportunity to work towards a Post Graduate Certificate in Education, delivered by Birmingham City University. \r\n\r\nAll lectures and seminars are delivered by experienced BCU staff at the campus of our accredited provider, Two Mile Ash, in Milton Keynes.  The combination of higher level academic study with the hands-on, practical nature of our school-led programme gives our trainees the perfect balance of theory and practice, making for well-rounded, informed and inspirational teachers.\r\n\r\nOur collaboration with Birmingham City University provides the valuable opportunity for our written assignments to be recognised at postgraduate level. The three assignment modules are submitted to the university for assessment and lead to an award of 60 Masters Level credits.\r\n\r\nIf you would like further information about any of the training opportunities available through the Ashmead ITT partnership, please visit our website (http://www.ashmeadschoolteachertraining.org.uk/) ","interviewProcess":"The interview process is undertaken at either Ashmead School or a possible placement school within the partnership and comprises of a number of different elements; typically this would include a taught session to a group of children, a short written task and an interview that includes a verbal presentation. Also of critical importance is the opportunity for potential trainees to ask questions; we will do all we can to ensure candidates feel informed when making their choices. \r\n\r\nFor those who are successful at interview, a conditional place on the course will be offered. The conditions will vary for each applicant, but may include, successfully gaining outstanding qualifications, a criminal record check (DBS) and an occupational health assessment. To reflect individual circumstances, further conditions may be discussed at interview.","howSchoolPlacementsWork":"With a primary focus on Aylesbury town and the surrounding area, our large partnership of schools offer a broad range of learning experiences across the primary years. Typically, trainees spend four days each week in school with the fifth being allocated to core training. Matching trainees with the right schools is critically important to us and we do all we can to accommodate personal wishes; for example, proximity to home, consideration of public transport, extended experience of a different key stage or a placement in a school outside of our regular geographical partnership. Through individual discussions, travel time and individual circumstances are always taken into consideration before an offer of placement is agreed.\r\n\r\nAn indication of what each Teaching Practice comprises of is illustrated below:\r\n\r\nTP1 First Teaching Practice – Autumn\r\nTrainees work from existing school medium term planning and along with support from their SBT begin delivering lessons in accordance with their personalised targets. By the end of the Autumn term the expectation is that their teaching commitment should be approximately 40% of the week.\r\n\r\nTP2 Second Teaching Practice – Spring\r\nThis practice takes place in a different school and different key stage and lasts for six weeks. The first week is largely observation based and working with groups. The second week will involve solo teaching, building upwards to 50% teaching from Week 3 onwards and 60% in the final week. Trainees will plan full lessons, drawing from medium term planning in the school.\r\n\r\nTP 3 Final Teaching Practice – Summer\r\nThis is the final assessment period. At this stage, it is expected that trainees demonstrate that they can fully plan an appropriate sequence of work across the full range of curriculum areas. They must demonstrate that they can sustain a satisfactory teaching standard over an 80 - 90% teaching timetable. They should prepare teaching resources, mark work and fulfil the main requirements of a classroom teacher to demonstrate their abilities in readiness for entry as a qualified teacher into the profession.\r\n","personalQualities":"Prior experience of working with children is useful, but beyond that are personal qualities critical for a successful career. Teaching is both rewarding and demanding, and those wishing to undertake it must have commitment, self-motivation, and the resilience to work within a changing environment that presents different challenges each day. The ability to work openly and effectively within a team is vital; enthusiasm, empathy and trust are qualities we hope a reflective practioner would identify. If you embrace the challenge of new learning and are ambitious for the development of those around you; teaching offers the most rewarding profession.","otherRequirements":"Individualised programme agreed and Partnership Agreement signed by Headteacher.\r\n•Identification, through the selection process, as exhibiting the potential to be a Good or Outstanding teacher by the end of the programme.\r\n","status":1,"createdAt":"2021-07-06T10:57:14.535Z","updatedAt":"2021-09-24T13:47:57.028Z","canSponsorStudentVisa":"no","cycle":"2024"}
