{"id":"ea8318b8-9473-4b35-a98f-5d7b00f63351","name":"Mathematics","code":"2LF4","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"72345aa7-096c-488f-8649-085b8178cadb","code":"G1","name":"Mathematics"}],"locations":[{"id":"16b3853c-546a-4611-8cf1-b609afbfae84","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"8795230d-a2ff-43ec-8a16-384a390e27f3","code":"255","name":"Northern Lights SCITT"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"The programme is full time and runs from September until the end of June.\r\nThe programme is divided into three stages all of which are delivered in the school setting:\r\nStage 1, from September to just before Christmas, includes an initial focus on both professional learning and subject knowledge/pedagogy and a placement in your first school.  \r\nStage 2, from Christmas to March, includes further professional learning and subject studies and then a full time teaching placement in your second school. \r\nStage 3, from March to June, begins with a week of further professional learning and then your placement in your second school resumes culminating in a 60% teaching timetable alongside additional student focussed activity.   An enrichment block follows this placement with the opportunity to extend experience to a very different setting.  Further professional learning days (about 5 in total) occur in the middle and end of this placement.  This professional learning will include preparation and transition to employment. \r\nOther enrichment opportunities are scheduled in March, focussing on key national priorities for example phonics teaching in primary school.  \r\nDuring the year and in teaching placements, trainees will be supported by school mentors and their subject lead tutors.  Subject lead tutors are assigned to trainees to support them throughout the year.   These are all experienced and current classroom practitioners. \r\nPersonalisation is at the heart of the programme.   Subject Leads and Mentors have key roles in ensuring that, not only is personalisation meaningful for every trainee but that support and guidance are built in and readily available on a day to day basis. The Subject Lead stays with the trainee throughout the year mentoring, coaching and supporting acceleration and consolidation as appropriate. Mentors are specialists who support each trainee through the day to day issues and opportunities that every new teacher faces in the classroom as they put in place the building blocks of learning.\r\nCurrent trainee feedback:  'My thoughts about the course so far... The launch was fantastic. …... I began to appreciate the key features of learning from the point of view of both teacher and student. I realised how important teachers are in the lives of young people. I am now in my first placement and it's great.' \r\n","interviewProcess":"Senior staff and subject leaders from partnership schools will be involved in the selection process. \r\nInterviews will be based in a secondary school within the Alliance and will consist of a number of different elements. These will include working alongside a subject specialist and students in a classroom as well as a written task and a formal interview, which will begin with a short presentation by the candidate. \r\nThrough this process we assess applicants' subject specific knowledge and their communication skills. \r\nDuring COVID we will make any necessary changes to this process to ensure candidates’ safety.\r\n","howSchoolPlacementsWork":"Personalisation is at the heart of our programme, we consider carefully each school placement and every trainee is supported by a specialist mentor.\r\nAll our trainees will train to teach in KS3 and KS4.\r\nAll trainees will have placements in two schools to give them a diverse learning experience.","personalQualities":"","otherRequirements":"We expect you to have an understanding of the current key issues relating to teaching and learning in their curriculum and age range.  Ideally, this will be through recent experience of being in a classroom and working with pupils in the United Kingdom.  Please evidence this on your personal statement.  \r\n\r\nYou will be required to complete an Enhanced DBS Check if your application to train with us is successful.  \r\n","status":1,"createdAt":"2021-07-06T10:56:15.495Z","updatedAt":"2021-10-05T07:34:11.187Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
