{"id":"ebb0f769-d9a0-4819-96c7-7f060827568f","name":"Modern Languages (Spanish)","code":"32CJ","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"ce8523ef-9236-4cd9-b260-d826c7a521b3","code":"ML","name":"Modern Languages"},{"id":"e34fd2a3-a32e-44e9-aea1-666badf3ac03","code":"22","name":"Spanish"}],"locations":[{"id":"16b3853c-546a-4611-8cf1-b609afbfae84","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"8795230d-a2ff-43ec-8a16-384a390e27f3","code":"255","name":"Northern Lights SCITT"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"The programme is full time, from September 2022 until the end of June 2023, and split into three Stages over the year.  The Stages have an increasing amount of teaching commitment, building from 30% in Stage 1 to 75% by the end of Stage 3.  At the end of Stage 3, you will have the opportunity to experience being part of a very different setting, for example a Special School or Pupil Referral Unit.  This range of experiences to draw from will give you a sound springboard as you transition into employment.\r\n\r\nYour first teaching placement in school will start from the second week of the course; you will be an integral part of your school’s team from Monday to Thursday every week.  Your Mentor will be your cheerleader, supporting and guiding you to reflect, learn and improve.  In addition to their ongoing support, they will meet with you formally once a week to discuss your wellbeing, your achievements that week and review your progress against agreed targets.\r\n\r\nYour Fridays will be spent with our team of expert Leads.  They will enable you to develop and contextualise your subject knowledge and application.  Our professional learning programme is designed to respond to every trainee’s individual professional development needs.  Underpinned by the Initial Teacher Training Core Content Framework, you will have a sound, applied understanding of the ‘Learn that’ and ‘Learn how’ statements as well as key national priorities.  This will enable you to make a smooth transition into the Early Career Framework in your first year of teaching.  \r\n\r\nThis is what our current trainees have to say about Northern Lights:\r\n\r\n'My favourite thing about the Northern Lights SCITT is by far the level of support they have put in place for trainees.  Even in the busiest of weeks, time is taken to check in with each and every student'\r\n\r\n'The professional learning aspect of the course fits seamlessly with what we are putting into practice on placement, and both the teams at Northern Lights and at my placement school have been immensely supportive and welcoming'\r\n\r\n'Starting my PGCE and choosing Northern Lights to guide me through the year was the best decision I could have made. The team are unbelievably supportive!'\r\n\r\n'The most amazing placements offering great learning experiences and the best support'\r\n\r\n'The support we have received has been absolutely great and there when we have needed it'\r\n","interviewProcess":"We take our responsibilities to all pupils, our partnership schools and our trainees most seriously.  \r\n\r\nOn application, you will take part in a rigorous selection process designed to assess your suitability to train to teach.  We take pride in developing the teachers of tomorrow.  As such, it is essential that all our trainees are safe to work with children and young people and that they have the necessary skills and aptitudes to thrive over the year.\r\n\r\nSenior staff and Subject Leads from partnership schools will be involved in the selection process alongside the SCITT team, who are trained in Safer Recruitment. We will assess your understanding of your age range and curriculum alongside your communication skills.  \r\n\r\nWhere possible, interviews will be held in schools and will consist of a number of different elements to assess, depending on current government COVID-19 guidance.  These elements may include a short teaching activity, a short presentation, a written task and a formal interview.  \r\n","howSchoolPlacementsWork":"Our SCITT is based at Skipton Girls' High School, an outstanding school at the forefront of teaching and learning.  Partner schools in North Yorkshire, Lancashire, Harrogate, Keighley and Bradford offer subject expertise and supportive teaching placements.   \r\n\r\nYou will train to teach in two Key Stages.  You will have placements in two differing schools to gain a diverse learning experience.  \r\nYou will be able to apply, develop and embed your professional learning from the previous Friday over the course of the week and have the opportunity to discuss it with your Mentor and review it with your Lead; integration of learning, cohesion, reflection and review are key aspects of our professional learning programme.  \r\n\r\nYour assessment tasks for the SCITT will be based on pupils and classes at your placement school.  You will contextualise and reference your professional learning within your placement school.  \r\n\r\nIn each Stage, you will be asked to write detailed case studies about pupils’ progress and the strategies you and your colleagues use that contribute to the pupils’ successes.  You will plan, deliver and evaluate a sequence of learning for the pupils you teach.  Other assessment tasks will be linked to your ongoing professional development in the context of your school placement.  \r\n","personalQualities":"","otherRequirements":"We expect you to have an understanding of the current key issues relating to teaching and learning in their curriculum and age range.  Ideally, this will be through recent experience of being in a classroom and working with pupils in the United Kingdom.  Please evidence this on your personal statement.  \r\n\r\nYou will be required to complete an Enhanced DBS Check if your application to train with us is successful.  \r\n","status":1,"createdAt":"2021-07-06T10:56:15.763Z","updatedAt":"2021-10-05T07:36:40.599Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
