{"id":"113eed09-b659-4053-9889-9cecb11b4f43","name":"Physics with Mathematics","code":"F3GX","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"72345aa7-096c-488f-8649-085b8178cadb","code":"G1","name":"Mathematics"},{"id":"bf97cd0a-224c-43d3-a021-84143df13e8d","code":"F3","name":"Physics"}],"locations":[{"id":"2430e919-84cf-48e3-ab06-8e9bc7982376","name":"Highfield Campus","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"2b84ae64-ebca-4e4d-88b1-13effff3a411","code":"S27","name":"University of Southampton"},"profPost":"PG","english":"3","maths":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feesInternational":18812,"aboutCourse":"The Southampton University Led Secondary M level PGCE course provides an excellent route into teaching. The course has consistently been rated highly by former trainees, and has been successful in a series of recent Ofsted inspections. Our PGCE Secondary programme is designed and taught jointly by the Southampton Education School (SEdS) in partnership with over 125 schools across the region in seven different subject areas, and has a very good track record of moving successful trainees into employment, locally and beyond. Two thirds of the PGCE is spent in two school placements, starting in October, under the guidance of curriculum mentors who are all experienced classroom teachers. One third is spent in university, under the guidance of curriculum tutors, who all have extensive school teaching experience.\r\nOverview of the PGCE Secondary Science: Physics with Maths course\r\nThis innovative programme combines all the best elements of practical experience in school but also draws on cutting-edge developments in cognitive psychology and the extensive research expertise available here at one of the top Schools of Education in the UK, to deliver an exceptional training experience in science and maths teaching.\r\nThe programme is led by a team of dedicated, passionate and knowledgeable tutors, all with extensive experience of classroom teaching. Beyond this core team, some of the very best science teachers and senior leaders currently working in our area contribute to the high quality of the training provided. There will also be a structured opportunity to plan and conduct fieldwork sessions, and, of course, the opportunity to work with an exceptional team of school-based mentors.\r\nThe PGCE Secondary Science: Physics with Maths course\r\n(https://www.southampton.ac.uk/education/postgraduate/itt_courses/pgce_physics_mathematics.page)\r\n","interviewProcess":"At interview, candidates will meet the tutor team and learn about key elements of the programme, including how trainees are supported and developed, how placements work and how trainees are assessed. Each candidate will give a short presentation related to their curriculum subject and will complete a written task followed by an individual interview with subject tutors.","howSchoolPlacementsWork":"Each trainee undertakes two block placements in schools within our Partnership. We aim to provide schools that offer contrasting placement experiences in order to develop a breadth and range of skills. During the placement blocks, one day per week is dedicated to training with the university in either curriculum or professional development. A regular programme of school based professional training is also delivered whilst trainees are on placement. Whilst on placement, each trainee is allocated a mentor from their subject area and a professional mentor to oversee the professional training. Trainees will also receive visits from their university tutor to support them in their teaching and professional development.","personalQualities":"","otherRequirements":"You will be required to obtain:\r\n* complete a form describing your state of health which will be checked against the DfE Fitness to Teach regulations \r\n* to provide an Enhanced Disclosure from the Disclosure and Barring Service (DBS) to confirm that there are no criminal offences on your record which should bar you from teaching. Visit www.disclosure.gov.uk for more information. \r\n\r\nThese must be completed before commencement of the programme to which you have applied.\r\n","status":2,"createdAt":"2021-07-06T10:55:26.927Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
