{"id":"737ffbad-9b18-4c2f-ac07-8bc12abe29db","name":"History","code":"V1X1","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"5a3609a0-5bbb-4377-b919-5d89932ab622","code":"V1","name":"History"}],"locations":[{"id":"2430e919-84cf-48e3-ab06-8e9bc7982376","name":"Highfield Campus","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"2b84ae64-ebca-4e4d-88b1-13effff3a411","code":"S27","name":"University of Southampton"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We offer our own Equivalency tests. We are unable to accept third party equivalency tests. Details will be provided for any successful offer of a place.","courseLength":"OneYear","feesUK":9250,"feesInternational":21000,"aboutCourse":"The Southampton University Led Secondary M level PGCE course provides an excellent route into teaching where you will equip yourself with the very latest research and practice. The course has consistently been rated highly by former trainees and has been successful in a series of recent Ofsted inspections. Our PGCE Secondary programme is designed and taught jointly by the Southampton Education School in partnership with over 125 schools across the region in eight different subject areas, and has a very good track record of moving successful trainees into employment, locally and beyond. You’ll engage with research-led approaches to enhance the quality of teaching you can offer your students and begin your career with confidence. Two thirds of the PGCE is spent in two school placements, starting in October, under the guidance of curriculum mentors who are all experienced classroom teachers. One third is spent in university, under the guidance of curriculum tutors, who all have extensive school teaching experience. \r\n\r\nOur PGCE Secondary course will equip you with the necessary skills and knowledge to teach History across the 11-16 age range, including some opportunities to know more about 16-19 teaching. The course is designed to create history teachers that have a clear and well-founded philosophy towards history and how to teach it. We aim for reflective and dynamic practitioners willing to use a variety of teaching strategies to inspire all students. You will gain a clear understanding of the problems pupils encounter in history, be prepared to find ways to overcome these difficulties and help pupils make progress. \r\nThe course leader works in close partnership with local schools to develop your subject and pedagogical knowledge though a variety of engaging approaches including interactive teaching, group discussions, micro-teaching and independent and collaborative exploration of secondary school history.\r\n\r\nThe PGCE Secondary History course\r\nhttps://www.southampton.ac.uk/courses/history-pgce\r\n\r\n","interviewProcess":"At interview, candidates will meet the tutor team and learn about key elements of the programme, including how trainees are supported and developed, how placements work and how trainees are assessed. Each candidate will give a short presentation related to their curriculum subject and will complete a written task followed by an individual interview with subject tutors.","howSchoolPlacementsWork":"You’ll be placed in schools for most of your course. This university is based in Southampton, and your school placements will be within commuting distance. Our partnership covers an extensive area, which enables us to offer a wide range of school experiences, from large urban secondary schools to smaller rural schools. You can’t pick which schools you want to be in, but your university will try to take your journey time into consideration.\r\n\r\nEach trainee undertakes two block placements in schools within our Partnership. We aim to provide schools that offer contrasting placement experiences in order to develop a breadth and range of skills. During the placement blocks, one day per week is dedicated to training with the university in either curriculum or professional development. A regular programme of school based professional training is also delivered whilst trainees are on placement. Whilst on placement, each trainee is allocated a mentor from their subject area and a professional mentor to oversee the professional training. Trainees will also receive visits from their university tutor to support them in their teaching and professional development.\r\n","personalQualities":"Please refer to our website for further details:https://www.southampton.ac.uk/courses/history-pgce#entry","otherRequirements":"You will be required to obtain:\r\n* complete a form describing your state of health which will be checked against the DfE Fitness to Teach regulations \r\n* to provide an Enhanced Disclosure from the Disclosure and Barring Service (DBS) to confirm that there are no criminal offences on your record which should bar you from teaching. Visit www.disclosure.gov.uk for more information. \r\n\r\nThese must be completed before commencement of the programme to which you have applied.\r\n","status":1,"createdAt":"2021-07-06T10:55:27.231Z","updatedAt":"2021-10-01T10:52:53.462Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
