{"id":"d24a90c1-4999-405b-b795-a0f82fe6e50e","name":"Primary with Mathematics","code":"2DXB","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"286cf12f-b3e3-41c5-9f33-2ff7807d2df0","code":"03","name":"Primary with mathematics"}],"locations":[{"id":"2430e919-84cf-48e3-ab06-8e9bc7982376","name":"Highfield Campus","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"2b84ae64-ebca-4e4d-88b1-13effff3a411","code":"S27","name":"University of Southampton"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"1","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"*Please note to follow the maths specialism route, you’ll need to have GCSE maths at grade A or A* (or equivalent) and an A or AS level (or equivalent) would be desirable. We’ll also consider mathematical elements of your degree or significant work experience involving Mathematics.   \n*We offer our own Equivalency tests. We are unable to accept third party equivalency tests. Details will be provided for any successful offer of a place.","courseLength":"OneYear","feesUK":9250,"feesInternational":21000,"aboutCourse":"The programme will suit those who aspire to become excellent primary school teachers, of children aged 5 to 11 with an interest in mathematics, and who want to gain an understanding of some of the theory underpinning effective teaching and learning in the primary school. At the heart of the programme is the development of reflective and creative practitioners who are committed to promoting the learning and progress of all children. Those following the maths specialism route will have a deeper understanding of key areas in this subject.\r\n\r\nPlanned and delivered in close collaboration with practising teachers in local primary schools, with addition support from the local Maths Hub, the programme will enable you to learn, in a systematic and critically engaging manner, how to teach primary school children. During the LATiS (Learning About Teaching in School) weeks, you will spend time in university and in a school to specifically learn key skills and develop knowledge about teaching in preparation for the first school placement. Throughout the programme you are introduced to the primary curriculum, learning how to effectively plan, teach and assess National Curriculum and other subjects. You will also learn how to organise and manage a primary school classroom. The programme aims to develop your knowledge through a range of teaching and learning approaches: workshops, seminars, lectures, demonstrations, fieldwork, micro-teaching, independent and group research, and through reading and writing activities. The assignments focus on the teaching and learning of mathematics but include a high degree of choice and strongly link theory and practice. As well as preparing you to teach across the primary curriculum, the programme offers opportunities to tailor some provision to your own training needs and interests. On the mathematics specialism route, you will also have additional sessions in school and university exploring the mathematics curriculum in greater depth. There is also the general route available through the PGCE (Primary) programme that does not involve the focus on mathematics teaching and learning.\r\n\r\nFurther details are available on the university’s Primary (PGCE) course page (https://www.southampton.ac.uk/courses/primary-pgce) \r\n\r\n\r\n\r\n","interviewProcess":"If you are invited to interview you will be asked to prepare a short presentation to a small group of candidates and engage in discussion.\r\n\r\nYou will also be interviewed by members of the course team and school partners. We also ask you to undertake a short written reflective task to satisfy ourselves of your capability in written English. Your performance in all aspects of the process will be assessed and a decision made. \r\n\r\nWe would encourage all prospective trainees to spend time in a primary school, where possible, so you are informed about the school environment and to confirm your own wish to teach. Your views about teaching will be explored at interview and you need to be able to reflect on aspects of what teachers and schools do and be able to talk convincingly about teaching in primary schools.\r\n","howSchoolPlacementsWork":"For most of the programme, you will spend your time in school. The school placements will include a particular focus on the teaching of mathematics, alongside the other subjects in the Primary curriculum. The university is based in Southampton and school placements will be within commuting distance.\r\n\r\nYou cannot pick which schools you want to be in, but the university will try to take your journey time into consideration.\r\n\r\nThe university works with over 100 potential placement schools. Most will be within 10 miles of the university, but you should not expect a commute time of more than an hour. The partnership of schools covers a wider area including Hampshire, Dorset, Wiltshire and the Isle of Wight. Placements will be sought in these areas should they be more local to you.\r\n\r\nAs well as LATiS weeks, you will undertake two block placements in schools within the partnership. The programme aims to provide schools that offer contrasting placement experiences in order to develop a breadth and range of skills. Whilst on placement, you will be allocated a mentor who is the teacher of the class in which you are placed. You will also receive visits from your university tutor to support you in your teaching and professional development.\r\n\r\n\r\n","personalQualities":"Please refer to our website for further information: https://www.southampton.ac.uk/courses/primary-pgce#entry","otherRequirements":"You will be required to:\r\n* complete a form describing your state of health which will be checked against the DfE Fitness to Teach regulations \r\n*provide an Enhanced Disclosure from the Disclosure and Barring Service (DBS) to confirm that there are no criminal offences on your record which should bar you from teaching. Visit www.disclosure.gov.uk for more information. \r\n\r\nThese must be completed before commencement of the programme to which you have applied.\r\n","status":1,"createdAt":"2021-07-06T10:55:26.790Z","updatedAt":"2021-10-01T11:17:55.790Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
