{"id":"e58defe9-09cc-497e-8386-3b13b28e5685","name":"Computing","code":"G5X1","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"e6be6a9c-8696-4b88-8fbd-1ba1bef1b6fc","code":"11","name":"Computing"}],"locations":[{"id":"2430e919-84cf-48e3-ab06-8e9bc7982376","name":"Highfield Campus","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"2b84ae64-ebca-4e4d-88b1-13effff3a411","code":"S27","name":"University of Southampton"},"profPost":"PG","english":"3","maths":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feesInternational":18812,"aboutCourse":"The Southampton University Led Secondary M level PGCE course provides an excellent route into teaching. The course has consistently been rated highly by former trainees, and has been successful in a series of recent Ofsted inspections. Our PGCE Secondary programme is designed and taught jointly by the Southampton Education School (SEdS) in partnership with over 125 schools across the region in seven different subject areas, and has a very good track record of moving successful trainees into employment, locally and beyond. Two thirds of the PGCE is spent in two school placements, starting in October, under the guidance of curriculum mentors who are all experienced classroom teachers. One third is spent in university, under the guidance of curriculum tutors, who all have extensive school teaching experience.\r\nOverview of the PGCE Secondary Computer Science and Information Technology course \r\nOur PGCE Secondary CS&IT course will equip you with the necessary skills and knowledge to teach Computing (CS, IT, Digital Literacy) across the secondary age range, including some opportunities to explore 16-19 teaching.  The course is designed to create Computing teachers that have a clear and well-founded philosophy towards the subject and can teach Computing at all levels.  \r\nWe aim for reflective and dynamic practitioners willing to use a variety of teaching strategies to inspire all learners.  After completing the course, you will have a clear understanding of the problems pupils encounter in Computing, you will be prepared to find ways to overcome these challenges, and you will be able to help learners make progress.  \r\nIn a combined effort from the university and our partnership schools, we develop your subject knowledge in Computing and your understanding of how to teach Computing through a range of approaches.  These include workshops, seminars, lectures and demonstrations, micro-teaching activities, and independent and group research.  \r\nWe utilise the wide range of teaching resources currently available to create fully reflective practitioners who have the potential to truly impact pupil learning.\r\n","interviewProcess":"At interview, candidates will meet the tutor team and learn about key elements of the programme, including how trainees are supported and developed, how placements work and how trainees are assessed. Each candidate will give a short presentation related to their curriculum subject and will complete a written task followed by an individual interview with subject tutors.","howSchoolPlacementsWork":"Each trainee undertakes two block placements in schools within our Partnership. We aim to provide schools that offer contrasting placement experiences in order to develop a breadth and range of skills. During the placement blocks, one day per week is dedicated to training with the university in either curriculum or professional development. A regular programme of school based professional training is also delivered whilst trainees are on placement. Whilst on placement, each trainee is allocated a mentor from their subject area and a professional mentor to oversee the professional training. Trainees will also receive visits from their university tutor to support them in their teaching and professional development.","personalQualities":"","otherRequirements":"You will be required to obtain:\r\n* complete a form describing your state of health which will be checked against the DfE Fitness to Teach regulations \r\n* to provide an Enhanced Disclosure from the Disclosure and Barring Service (DBS) to confirm that there are no criminal offences on your record which should bar you from teaching. Visit www.disclosure.gov.uk for more information. \r\n\r\nThese must be completed before commencement of the programme to which you have applied.\r\n","status":2,"createdAt":"2021-07-06T10:55:27.056Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
