{"id":"91779bc0-1d89-4132-ae25-b1ecde624e16","name":"Primary (3-7)","code":"AK76","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"other","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_7","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"d9779c26-6ba0-49cf-96f7-fcc25ff94bce","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"57beac36-52e5-4092-8eb7-920aedbceba1","code":"21J","name":"Kernow Initial Teacher Education"},"accreditedBody":{"id":"d41a1821-e35b-48eb-bf02-4842872b04a2","code":"E84","name":"University of Exeter"},"profPost":"PG","degreeGrade":"0","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We accept equivalency tests from A Star Equivalency and equivalencytesting.com (please do contact us for further guidance before signing up for an equivalency test).","courseLength":"OneYear","feesUK":9250,"feesInternational":18500,"financialSupport":"All of our programmes are eligible for student loans and any applicable bursaries.\r\n\r\nFor information on Government loans and training bursaries, please visit the [Student Finance England]( https://www.gov.uk/student-finance) and [Get into Teaching]( https://getintoteaching.education.gov.uk/) websites.\r\n\r\n\r\nFor more information, please see our [Fees and finance]( https://www.exeter.ac.uk/teachertraining/apply/feesandfinance/) webpages\r\n","aboutCourse":"As a Primary teacher, you can play an essential role in children’s development. You’ll make a lasting, positive impact on children’s well-being and creativity, opening young minds to new concepts through rich and practical learning experiences, expanding their natural curiosity. Giving children the building blocks to provide firm foundations for lifelong learning.\r\nYou need to be able to work with a range of people from parents and teachers to professionals from other services and members of the community. You need to be energetic, creative, have a thirst for learning, love the outdoors whatever the weather and be practical in your delivery.\r\nTrainees who are undertaking the 3-7 Primary programme will train with our General Primary programme and have specialist input from our EYS to KS2 colleagues. Their main ITT placements will be in EYFS/ KS1  with an opportunity to look at KS2 later  in the year.\r\nThe Qualification will be PGCE Primary 3-7\r\nWe are delivering the Primary PGCE in partnership with The University of Exeter \r\nWe closely adhere to the Exeter entry requirements for their PGCE courses along with the subject specific requirements. The University of Exeter has a general requirement of a degree classification of Upper Second (2:1). A 2:2 is considered in exceptional circumstances. Please find the links below to the information on the Exeter website. (https://www.exeter.ac.uk/teachertraining/apply/entry/)","interviewProcess":"We interview all our applicants in the school setting and our interviews will include\r\n*A tour of one of our schools\r\n*Formal interview with Teaching School representatives and a Senior school leader\r\n*Classroom experience\r\n*Teaching Episode\r\n*Literacy & Numeracy tests\r\n*An opportunity to meet previous trainees\r\n","howSchoolPlacementsWork":"The KTSA has 27 primary partners allowing you to experience a wide range of educational contexts. Our primaries are in Rural, Coastal and urban settings and include academy chains, multi academy trusts, faith schools, EYS and KS1 only settings and KS2 settings and a through school KS2 – 5. In fact if there is a type of setting or leadership structure that you wish to experience you will find it within our alliance partners.\r\nThe programme will allow you to spend time in two main placements both different in their context. (1 x 2 terms, 1 x 1 term) Our 3-7 year trainees will spend their placements in EYFS and KS1. There will also be opportunities to visit other primary settings and our secondary, FE & HE, Special schools and our pupil referral partners.\r\nOur aim is for all of our trainees to be successful and with that in mind we take into consideration each individuals personal situation and endeavour to place them so that they have no more than a 40 minute journey to work.\r\nOur current school direct trainees have already found themselves in the classroom, on the beach and receiving training in at least 4 different school settings. They have had the opportunity to attend Ofsted training, Guided reading and writing, First Aid, Child Protection, Assessment for Learning, mental health & wellbeing training with colleagues from across our multi academy Trusts. ","personalQualities":"As a Primary teacher, you play an essential role in children’s development, making a lasting, positive impact on well-being and creativity, opening young minds to new concepts through rich and practical learning experiences, expanding their natural curiosity. Giving children the building blocks to provide firm foundations for lifelong learning.\r\nYou need energy, creativity, a thirst for learning and have the drive to become critically reflective teachers and change agents. You will love the outdoors whatever the weather and be practical in your delivery,  learn to work with a range of people from parents, teachers, other professionals & the community.  ","otherRequirements":"In addition to the academic requirements listed, selection is based on performance at interview, a satisfactory fitness to teach assessment and a satisfactory DBS enhanced disclosure.\r\n\r\nAlthough not essential it would be an advantage to be able to reflect on any school-based experience or experience working with young people in another context at interview.\r\n\r\nThe ‘Qualifications’ section describes our standard offer. However, if you have a different academic background, equivalent to degree level, you are welcome to make an application through UCAS for consideration or contact us [http://kernowteachingschool.org/] for more information.\r\n\r\n","status":1,"createdAt":"2021-07-06T10:54:20.536Z","updatedAt":"2021-09-29T07:37:36.716Z","canSponsorStudentVisa":"yes","cycle":"2024","applicationsOpenDateOther":"2021-11-02T00:00:00.000Z"}
