{"id":"e82e26a9-6e0f-41aa-ada3-f607cc0d1c08","name":"Primary (SEND)","code":"V894","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"yes","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"e1ef78ba-7025-4732-8d9e-2e2d95d94b42","name":"Trenance Learning Academy","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"57beac36-52e5-4092-8eb7-920aedbceba1","code":"21J","name":"Kernow Initial Teacher Education"},"accreditedBody":{"id":"a4e84530-e1f1-47c6-b57e-ec693d629637","code":"P63","name":"Plymouth Marjon University"},"profPost":"PG","degreeGrade":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":18500,"financialSupport":"All of our programmes are eligible for student loans and any applicable bursaries.\r\n\r\nFor information on Government loans and training bursaries, please visit the [Student Finance England]( https://www.gov.uk/student-finance) and [Get into Teaching]( https://getintoteaching.education.gov.uk/) websites.\r\n\r\n\r\nFor more information, please see the Marjon website\r\nhttps://www.marjon.ac.uk/courses/fees-and-funding/","aboutCourse":"This programme is for those who have a real interest in working with children with Special Educational Needs or Disability. You may be interested in working in a specialist setting or with children in  mainstream setting.\r\nYou need to be energetic, creative, have a thirst for learning, love the outdoors whatever the weather and be practical in your delivery. Our trainees will need to be able to work with a range of people from parents and teachers to professionals from other services and members of the community. \r\n\r\nTrainees who are undertaking the Primary SEND programme will train with our 5-11 and 3-7 Primary trainees. You will have additional specialist input from our Special School partnership colleagues. \r\n\r\nYou will acquire the skills and knowledge required to teach in a Primary setting and will also study SEND topics in more detail. For example:\r\n*SEND Code of Practice\r\n*Working with SENCOs\r\n*Emotional Literacy/SEMH\r\n*SEND: Behaviour as communication\r\n*Autism Spectrum Disorder & Structured Teaching\r\n* The Team Around the Child \r\n*SEND: Planning & Assessment\r\n\r\n\r\nThe Qualification will be PGCE Primary with SEND specialism\r\nWe are delivering the Primary PGCE in partnership with The University of St Mark & St John (Marjon)\r\nWe closely adhere to the Marjon entry requirements for their PGCE courses  Marjon has a general requirement of:\r\n\r\nA degree at 2:2 or above.\r\n\r\nGCSE English, Mathematics and Science at grade 4 or grade C or above (or an equivalent qualification).\r\n\r\nExperience of working with young people.","interviewProcess":"We interview all our applicants in the school setting and our interviews will include\r\n\r\n*A tour of one of our schools\r\n*Formal interview with Teaching School representatives and a Senior Specialist school leader\r\n*Classroom experience\r\n*Teaching Episode/Activity\r\n*Literacy & Numeracy tests\r\n*An opportunity to meet previous trainees\r\n","howSchoolPlacementsWork":"KITE has a large number of primary partners and partners in specialist provision. Our specialist settings include Special schools, ARBs and alternative  provision academies, allowing you to experience a wide range of educational contexts. Our primaries are in Rural, Coastal and urban settings and include academy chains, multi academy trusts, faith schools, EYS and KS1 only settings and KS2 settings and a through school KS2 – 5.\r\nIn fact if there is a type of setting or leadership structure that you wish to experience you will find it within our alliance partners.\r\n\r\nThe programme will allow you to spend time in 3/4 placements, different in their context. There will be a main placement of 1 term in Primary, 1 term in a Specialist setting, 1/2 term in a second Primary setting and 1/2 term choice of Primary or Specialist setting. \r\n\r\nOur aim is for all of our trainees to be successful and with that in mind we take into consideration each individuals personal situation and endeavour to place them so that they have no more than a 40 minute journey to work.\r\n\r\nOur current school direct trainees have already found themselves in the classroom, on the beach and receiving training in at least 4 different school settings. They have had the opportunity to attend Ofsted training, Guided reading and writing, First Aid, Child Protection and Assessment for Learning","personalQualities":"Primary teachers, play an essential role in children’s development, making a lasting, positive impact on well-being and creativity, opening young minds to new concepts through rich and practical learning experiences, expanding their natural curiosity, encouraging lifelong learning. Our trainees are energetic, creative, wanting to learn, having the drive to become critically reflective teachers.\r\nYou’ll have high expectations for all children, with a focus on those with SEN and a strong commitment to meeting the SEND Code of Practice. Most importantly you will hold the values and attitudes required to contribute to an inclusive community where barriers to learning are removed.\r\n\r\n","otherRequirements":"In addition to the academic requirements listed, selection is based on performance at interview, a satisfactory fitness to teach assessment and a satisfactory DBS enhanced disclosure.\r\n\r\nAlthough not essential it would be an advantage to be able to reflect on any school-based experience or experience working with young people with Special Educational Needs in another context at interview.\r\n\r\nThe ‘Qualifications’ section describes our standard offer. However, if you have a different academic background, equivalent to degree level, you are welcome to make an application for consideration or contact us for more information.","status":1,"createdAt":"2021-09-29T14:49:58.787Z","updatedAt":"2021-09-29T15:23:12.841Z","canSponsorStudentVisa":"yes","cycle":"2024"}
