{"id":"0b5c9344-e3e1-4e61-a27c-5f3b166644b5","name":"Primary","code":"X100","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"c958e2bd-37e7-46a9-9b04-0dee309c827f","name":"Bognor Regis Campus","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"3f5b1139-3651-4ee5-845c-54cd9e999b08","code":"C58","name":"University of Chichester"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"This is a full-time programme over one academic year. The programme is taught at master’s level and allows students to gain up to 60 credits towards a master’s qualification. \r\n\r\nThe university-based study is divided into three key areas which will develop the knowledge, understanding and skills required to plan and manage creative and effective lessons while ensuring that pupils of all abilities are motivated to learn. These key areas are:\r\n\r\n - Core Curriculum\r\n - Wider Curriculum\r\n - Professional Studies\r\n\r\nCore Curriculum Studies\r\nThe Core Curriculum module develops student teachers’ enthusiasm for and enjoyment of English, Mathematics and Science. Through separate subject strands this course will develop student teacher subject, curriculum and pedagogical knowledge in each subject. By linking their learning to their school experience, it aims to promote the necessary competencies and understanding student teachers need to plan, teach and assess the core curriculum well.\r\n\r\nWider Curriculum (e.g. History, PE, ICT, MFL etc.)\r\nThis module aims to develop student teachers’ critical understanding of and enthusiasm for the foundation subjects and associated pedagogies. Students will develop a systematic knowledge and understanding of key curriculum and framework documents. It will prepare students to plan, teach and assess effectively the foundation subjects and to develop cross-curricular approaches to teaching and learning.\r\n\r\nProfessional Studies\r\nThis module aims to develop student teachers’ critical and rigorous understanding of the principles which underpin primary education. It will develop student teachers’ knowledge and understanding of the nature of the primary curriculum, children’s developmental needs and how children learn.  It will introduce and critique educational research methodology, analysis and ethics. It will advance their abilities to critically apply such knowledge and understanding in a professional context through lesson planning, teaching, assessment and behaviour management and critical reflection on these.\r\n\r\nThe module aims to enable student teachers to begin to develop their own personal educational philosophies, so that they can apply these in the classroom and articulate them to other professionals.\r\n\r\n\r\n\r\n\r\n","interviewProcess":"","howSchoolPlacementsWork":"The PGCE programme is taught in affiliation with a range of primary schools. During the programme, you’ll be placed in two different schools for extended placements. In addition you will have three short group placements, with the aim to develop your understanding of special educational needs, progression, inclusion and signature pedagogy.\r\n\r\nThe school experiences will draw on your own prior experiences and skills and develop them within the partnership of school-based and university-based training and support. During School Experience, school-based mentors are partners in identifying individual training needs and refining your individual action plans. Initially, you’ll focus on teaching small groups of pupils the core curriculum subjects, leading to proficiency in teaching a whole class subjects across the primary curriculum by the end of the second placement.\r\n\r\nYou’ll develop a broader understanding of the relationship between theory and practice in education and the wider context within which schools operate. You’ll also be able to identify areas for future development during your own teaching career.\r\n","personalQualities":"Your personal statement is important. It should demonstrate that you have an understanding of the profession which you are entering. ","otherRequirements":"All successful applicants who accept a place with the University will be subject to an enhanced disclosure check with the Disclosure and Barring Service as well as an occupational health check to establish  fitness to practice.","status":1,"createdAt":"2021-07-06T10:46:47.484Z","updatedAt":"2021-07-07T11:12:00.235Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
