{"id":"3559adf9-d40a-4d24-8168-a91986947927","name":"Early Years (3-7)","code":"3DHN","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"3_to_7","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"c958e2bd-37e7-46a9-9b04-0dee309c827f","name":"Bognor Regis Campus","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"3f5b1139-3651-4ee5-845c-54cd9e999b08","code":"C58","name":"University of Chichester"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"This is a full-time programme that runs over nine months. The programme is taught at master’s level and allows students to gain up to 60 credits towards a master’s qualification. \r\n\r\nThe course enables you to develop your skills of critical analysis and engage with educational research at the same time as developing practical classroom skills through school experience. By the end of the course, you’ll be equipped as reflective practitioners to continue your professional learning throughout your career.\r\n\r\n","howSchoolPlacementsWork":"The PGCE programme is taught in affiliation with a range of primary schools. During the programme, you’ll be placed in two different schools for extended placements. Plus you’ll have three two-week group placements focusing on the teaching of maths, English or teaching pupils with Special Educational Needs.\r\n\r\nThe school experiences will draw on your own prior experiences and skills and develop them within the partnership of school-based and university-based training and support. During School Experience, school-based mentors are partners in identifying individual training needs and refining your individual action plans. Initially, you’ll focus on teaching small groups of pupils the core curriculum subjects, leading to proficiency in teaching a whole class subjects across the primary curriculum by the end of the second placement.\r\n\r\nYou’ll develop a broader understanding of the relationship between theory and practice in education and the wider context within which schools operate. You’ll also be able to identify areas for future development during your own teaching career.","personalQualities":"Your personal statement is important. It should demonstrate that you have an understanding of the profession which you are entering. ","otherRequirements":"All successful applicants who accept a place with the University will be subject to an enhanced disclosure check with the Disclosure and Barring Service as well as an occupational health check to establish  fitness to practice.","status":1,"createdAt":"2021-07-06T10:46:47.330Z","updatedAt":"2021-07-07T11:07:28.163Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
