{"id":"d4761808-9c86-4d24-8db2-57e85b65c78e","name":"Dance","code":"3D2X","qualification":"pgce_with_qts","startDate":"2022-09-01T09:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"49dcc400-03df-4732-af93-1c56ae22897f","code":"12","name":"Dance"}],"locations":[{"id":"0a0b1aa7-f1bb-4431-90ad-46313da88fff","name":"Bishop Otter Campus","isPublished":"true","status":"running","vacancies":"full_time"}],"trainingProvider":{"id":"3f5b1139-3651-4ee5-845c-54cd9e999b08","code":"C58","name":"University of Chichester"},"profPost":"PG","degreeGrade":"0","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"The PGCE Dance Secondary course will enable you to build on your previous experience of Dance teaching and build awareness of Dance as a curriculum subject. The course is taught holistically allowing theoretical understanding to underpin all aspects of dance practice. An understanding of high-quality dance teaching is explored through whole group seminars, workshops, individual tutorials, and collaborative group work. \r\n\r\nIt is a full-time programme over one academic year. The programme is taught at master’s level and allows students to gain up to 60 credits towards a master’s qualification.\r\n\r\nThe university-based study is designed to help you become a reflective, creative and effective classroom practitioner. It is informed by the latest research and practice, and the programme has a very strong relationship with the schools in its partnership.  \r\n\r\nYour time in university will be divided equally between the Professional Studies module and Subject Study. In Professional Studies, you will be working with trainees from a range of subjects.  The module is designed to develop student teachers’ knowledge and understanding of professional requirements and behaviours, as well as the broader role, of the teacher in the secondary context.  It will introduce and critique educational research methodology, analysis and ethics, in order to develop understanding of the relationship between theory and practice.  These themes are developed and contextualised in the Subject Study modules, where you will learn how these relate to the teaching of your own subject.\r\n\r\nThree quarters of your time will be spent in school.  You will complete two main placements in contrasting schools, to gain as wide an experience of teaching as possible in preparation for a career in education.  \r\n\r\nThe course is run by a team of experienced, dedicated, and enthusiastic tutors, all of whom have taught in secondary schools.  This is a programme for people who aspire to become inspirational secondary teachers, committed to supporting the learning of all pupils in their classes, who can use the latest research and theory to keep their teaching fresh throughout their careers.\r\n","interviewProcess":"The PGCE Dance interview process is structured as follows:\r\n\r\n* Candidates will be expected to submit a solo electronically in advance of the interview date, \r\n* Candidates will complete a practical teaching task, complete a Subject Knowledge task, a Numeracy and Literacy skills audit and attend a formal interview. \r\n* The interview process is expected to last for approximately 4 hours in total. \r\n","howSchoolPlacementsWork":"During the course of the year, you will spend 24 weeks in school.  These school experience placements are chosen by the tutors who you will be working with most closely as they are best placed to know your strengths and development needs.  The placements are carefully chosen to give you a varied and broad experience of teaching in school.\r\n\r\nWhile in school you will be supported by a school-based mentor who is a specialist in teaching your own subject and who has been trained for the role.  You will have the opportunity to learn from a range of expert colleagues, and to observe good practice as well as planning and teaching your own lessons.  You will have a gradual introduction to teaching, but there is flexibility over how quickly you take on your full teaching load in each school, to allow more confident and experienced trainees to start teaching sooner.\r\n\r\nThe partnership extends over East and West Sussex and Hampshire, and includes schools on the Isle of Wight and in Surrey.  Your commute will not usually exceed 1 hour from your term time address to the placement school, and students not in receipt of a government bursary may receive a contribution towards travel costs depending upon the distance.\r\n","personalQualities":"Your personal statement is important. It should demonstrate that you have an understanding of the profession which you are entering. ","otherRequirements":"All successful applicants who accept a place with the University will be subject to an enhanced disclosure check with the Disclosure and Barring Service as well as an occupational health check to establish  fitness to practice.","status":1,"createdAt":"2021-10-15T14:47:36.048Z","updatedAt":"2021-10-15T14:48:19.131Z"}