{"id":"bd41cfd0-525c-4f47-8a31-a21c8a0b0686","name":"Primary","code":"36FW","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"a2f8dd1a-1b0e-44ec-ae5c-8025927dfe20","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"},{"id":"5012a3ea-fd30-4631-8604-ac7445b43642","name":"St. Godrics RC Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"18efe552-5284-499c-9d33-6520969b193a","name":"St. Oswald's CE Aided Primary and Nursery School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"3a8619d0-253b-4863-961c-ab0411963132","name":"Neville's Cross Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"3a851330-38fe-4cd4-a06a-00989b88d632","name":"Shincliffe CE Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"4cbdb54b-2f42-4901-9e28-c0949f949cff","name":"St. Thomas More","isPublished":"Y","status":"R","vacancies":"F"},{"id":"0829c0a1-e090-4a79-bf22-61a458a534c6","name":"St Joseph's RC Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"09a08a0d-cc77-40af-a60f-1cd5694307ab","name":"St. Bede's R.C. Primary School, Sacriston","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"dd18f93c-8a01-41f2-8958-974ef705b432","code":"2FF","name":"Durham St Margaret’s"},"accreditedBody":{"id":"b384b008-59e2-461e-a15f-3551d1165c1e","code":"N77","name":"University of Northumbria at Newcastle"},"profPost":"BO","degreeGrade":"1","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"This will need to be discussed with Amy Bell to assess individual cases.","courseLength":"OneYear","feesUK":9250,"financialSupport":"SFE will provide a Tuition Fee loan to cover training costs. This and any other financial support to be organised by the trainee in conjunction with Northumbria University.","aboutCourse":"Trainees are placed in their 'home' school in Durham from day 1 of the academic year in September until June. Monday to Thursday are school based days, with Friday being 'training' day shared equally between school based training days in Durham and University based training days at Coach Lane Campus.\r\n\r\nOver the year, trainees are supported by their class mentor to develop their skills, with three observed placement periods of 5 weeks each across the year. The middle placement will take place in one of our other central Durham schools to give trainees experience in other school environments and with other age ranges of children, whilst retaining the similarities shared by our Durham schools.","interviewProcess":"Once you have applied, we will make contact with you very quickly. We are always keen for you to visit site, either before or after application, to get a feel for our partnership and find out if it is the right training for your needs. \r\n\r\nWe will then agree an interview date, involving a simple presentation, short written task and a small group reading activity with children. A formal set of interview questions will then be shared with the lead mentor and head teacher.\r\n\r\n**some changes to interview process may be needed depending on the current COVID19 regulations.","howSchoolPlacementsWork":"The 8 schools in our partnership have been developed through the close relationships we have within the Durham area. Our primary schools are all within 5 miles of our main site at St. Margaret's and are all good and outstanding providers with strong school ethos and supportive staff teams. Our school mentors are all known personally and meet regularly to ensure high standards of support. We have a range of settings available, including CE, RC and non-faith schools and also a range of school and class sizes. We would be happy to work with trainees who have a particularly school preference.","personalQualities":"As a school, our ethos encourages everyone to be caring, celebratory, courageous, Christ-like members of a community rooted in love. If you can combine these values with a passion and dedication to be the best you can be then you will enjoy training at St. Margaret's.","otherRequirements":"A DBS check will be required on acceptance to the course.\r\nProvision can be made to gain experience in our schools in advance of beginning the training.","status":1,"createdAt":"2021-07-06T10:51:30.408Z","updatedAt":"2021-09-14T13:58:39.692Z","canSponsorStudentVisa":"yes","cycle":"2024"}
