{"id":"113b17eb-93f1-4435-8b5d-ee84b11b4194","name":"Primary with Mathematics","code":"3BPN","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"B","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"286cf12f-b3e3-41c5-9f33-2ff7807d2df0","code":"03","name":"Primary with mathematics"}],"locations":[{"id":"37886b7d-c653-40d6-8206-320e78c0cfbe","name":"Aldingbourne Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"0fb73153-84a6-44ae-a5f4-28d433281f54","name":"St Wilfrid's Catholic Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"6c19a961-4246-4e36-9a63-610955057b10","name":"St Robert Southwell Catholic Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"033cfd74-d7da-4cc8-80a1-7700e8ccbeac","name":"St Richard's Catholic Primary School, Chichester","isPublished":"Y","status":"R","vacancies":"F"},{"id":"6c9e707f-1eaa-4259-b960-7877e46ee374","name":"St Mary's Catholic Primary School, Worthing","isPublished":"Y","status":"R","vacancies":"F"},{"id":"b7e22cf0-2d95-4e32-8d30-5ec381e0d0e4","name":"Annecy Catholic Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"8f7f56e3-e27a-410a-a6d6-105977e072be","name":"St Mary's Catholic Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"d674fb62-bc3b-47f0-8f35-8047decd3123","name":"Our Lady Queen of Heaven Catholic Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"070d7907-7b83-4605-98c1-9f516c9eaaaf","name":"Main Site Primary","isPublished":"Y","status":"R","vacancies":"F"},{"id":"8a25be96-c2b2-49ae-92e7-d72c40d6a2a0","name":"St Joseph's Catholic Primary School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"1a675a06-71eb-4ba8-9d26-ea18262884d9","code":"1KY","name":"Bosco Sussex"},"accreditedBody":{"id":"4d4cceab-1516-4a6c-a9ab-5de0e32e1fe1","code":"S90","name":"University of Sussex"},"profPost":"PG","degreeGrade":"1","english":"1","maths":"1","science":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"Candidates will need to be able to source and pay for their own equivalency test. We accept online tests offered by Birmingham City University, A Star, and Equivalency testing.com We strongly advise those in need of an equivalency test to make arrangements to study for and book a test as soon as you accept your place on the course. Some candidates need to take their test more than once to secure a pass and we are not able to admit trainees onto the PGCE course in September without passes in all three subjects.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"The Sussex Schools Partnership Primary PGCE course is a 1 year fulltime programme awarding Qualified Teacher Status (QTS) and a PGCE of 90 Masters Level Credits which allows and progress onto our Part-time Masters in Education for newly qualified teachers.\r\nThe PGCE course enables you to develop your own philosophy of learning with an investigative, hands-on approach in which the children you teach are engaged through exploration and discovery. We encourage, challenge and support trainees helping to become effective, reflective teachers whose classroom practice puts children at the centre of a creative and engaging learning process.\r\nThe Sussex approach fully integrates education theory and practice encouraging you to critically reflect on approaches to learning and teaching and develop a subject specialism.  Over the year you will be placed in two different schools and required to pass both placements. Additional assessments are via a Masters level essay submitted in February and an innovative Viva style Masters level exit interview at the end of the course.\r\nWe have developed strong partnerships with primary schools who share our philosophy of a creative and reflective approach starting with the individual child and the environment. Teachers in these schools are key members of our training team and lead on many areas of this course.\r\nThe Sussex Primary course is unique in offering a very long first school placement of six months allowing you to really get to know your school and fully understand pupil progression. Your schools are carefully selected for you by the Primary Tutor team. \r\nThe shorter second placement builds on this by applying your skills and knowledge in another setting. You will also have opportunities to explore transition with time in key Stage 3 and Foundation Stage.\r\nThe course begins in September with a stimulating full-time three week induction course on our campus to prepare you for starting your school placement. Once in school you will then spend Monday to Thursday each week training in school. On Fridays you will attend the University Campus for lectures, workshops and seminars with our team of experienced primary tutors. \r\n\r\nhttp://www.sussex.ac.uk/education/ite/primary","interviewProcess":"Applicants who meet the entry requirements will be invited to a Sussex selection event either face to face or online via Zoom. Following a successful interview schools will then invite the candidate for a school interview.","howSchoolPlacementsWork":"You will have a ‘home’ and ‘away’ school placements over the course of the year. You will usually start in your home school in September at the beginning of term and then go on two weeks induction at the university. After this you will be on first placement at your home school. Your average week will be 4 days at school and 1 day (a Friday) at the university. This first placement phase lasts until Easter. After Easter, you will go to your ‘away’ school. This will offer some kind of contrast to your first placement school to support your meeting the Teacher Standards. This short placement will come to at the end of May. We feel this sense of a home school supports developed professional relationships with colleagues and students anchoring your practice and development as a teacher.","personalQualities":"At Sussex we are looking for; \r\n* A passion for working with young children \r\n* A strong knowledge and understanding of Primary education, and a sound awareness of current issues in English Primary schools\r\n* Effective communication skills and good organisational ability \r\n* Experience with young people and commitment to developing individuals * Enthusiasm, energy and creativity \r\n* The ability to evaluate practice and to address your weaknesses \r\n* Initiative, flexibility and responsiveness to change\r\n* A sense of responsibility * The ability to work in a team.","otherRequirements":"We also require the following \r\n* Working with children: You must not be excluded from working with children, as a result of a criminal record or other reason. The Disclosure and Barring Service provides access to records held nationwide through its disclosure service. All trainees must obtain successful DBS clearance before starting an initial teacher-training programme. \r\n* Health requirements: All trainees must be screened for mental and physical fitness to teach by the University's Occupational Health Department before admission to the programme.","status":1,"createdAt":"2021-07-06T10:47:06.676Z","updatedAt":"2021-10-05T12:57:53.262Z","canSponsorStudentVisa":"yes","cycle":"2024"}
