{"id":"c22e1435-8c24-44eb-8344-fe88c68579bd","name":"Biology","code":"2K3P","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"B","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"322cfc19-d51d-45db-91e3-bd7b4738470f","code":"C1","name":"Biology"}],"locations":[{"id":"87c061d9-0cbf-4a29-9103-ef3edc3f70ac","name":"St. Philip Howard Catholic High School","isPublished":"Y","status":"R","vacancies":"B"},{"id":"e35a349a-5f87-494e-a8f9-877fc38a43d9","name":"St Paul's Catholic College","isPublished":"Y","status":"R","vacancies":"B"},{"id":"48543e97-5160-430e-81e0-1a26b164647e","name":"Downlands Community School","isPublished":"Y","status":"R","vacancies":"B"},{"id":"8175aebd-2664-4fda-b4e0-e310585e5cb6","name":"St Oscar Romero  Catholic School","isPublished":"Y","status":"R","vacancies":"B"},{"id":"b46d2f37-b8ce-411b-b8e5-47ec16e87d62","name":"Sackville School","isPublished":"Y","status":"R","vacancies":"B"},{"id":"4e0187a2-0233-4cee-b38e-bc491c90083b","name":"St Wilfrid s Catholic School","isPublished":"Y","status":"R","vacancies":"B"},{"id":"99244aab-687e-496a-9750-4a2226ce7620","name":"Felpham Community College","isPublished":"Y","status":"R","vacancies":"B"}],"trainingProvider":{"id":"1a675a06-71eb-4ba8-9d26-ea18262884d9","code":"1KY","name":"Bosco Sussex"},"accreditedBody":{"id":"4d4cceab-1516-4a6c-a9ab-5de0e32e1fe1","code":"S90","name":"University of Sussex"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We require candidates to source and undertake GCSE Equivalency tests at their own expense. We can accept equivalency test passes from 'A Star' and 'Equivalency testing.com'","courseLength":"OneYear","feesUK":9250,"aboutCourse":"This is a school- based route but delivered and quality assured in partnership with the University of Sussex.  Schools in our alliance are committed to supporting the needs of trainees by treating them as members of staff. Schools will want to foster relationships with potential applicants via email and school visits.\r\n\r\nOur School Direct includes a full PGCE with 60 Master’s credits from the university. This is an important feature of our offer to applicants as we, as an alliance, are committed to research and evidence based teaching approaches.\r\n\r\nDuring the course you will learn to:\r\n\r\n*\tExpress the values, virtues and expectations of successful professionals, challenging learners to fulfil their potential and enjoy learning\r\n\r\n*\tSecure a strong subject knowledge and critical appreciation of the curriculum and pedagogy in subject specialisms\r\n\r\n*\tPlan, teach and reflect upon successful teaching and learning strategies, and their impact on pupil progress\r\n\r\n*\tAnticipate and respond to the different learning, motivation and personal abilities and needs of individuals, groups and classes\r\n\r\n*\tDevelop effective classroom management techniques which promote good behaviour\r\n\r\n*\tAssess the progress pupils make, and the ways in which this can be enriched\r\n\r\n*\tEstablish an understanding of a range of whole-school issues, the values and assumptions that underpin them, and their application to school and classroom practice\r\n\r\n*\tMeet the professional requirements for conduct and practice as set out in the Teacher Standards \r\n\r\nYou will attend a full-time three week induction course on the university Campus during September to prepare you for starting your school placement with us towards the end of the month.\r\nFull-time candidates spend Monday to Thursday each week training in one of our partnership schools and attending the University Campus on Fridays for lectures, workshops and seminars with our team of experienced subject tutors. Part-time candidates attend Sussex University on Fridays and train for two days a week in school in year 1 and three days in year 2.\r\n\r\nhttp://www.sussex.ac.uk/education/ite/pgceandschooldirectsecondary/science#\r\n","interviewProcess":"Applicants who meet the entry requirements will be invited to a Sussex selection event either face to face or online via Zoom. Following a successful interview schools will then invite the candidate for a school interview.","howSchoolPlacementsWork":"You will have a ‘home’ and ‘away’ school placements over the course of the year. You will usually start in your home school in September at the beginning of term and then go on two weeks induction at the university. After this you will be on first placement at your home school. Your average week will be 4 days at school and 1 day (a Friday) at the university. This first placement phase lasts until February half-term. After this one-week break, you will go to your ‘away’ school. This will offer some kind of contrast to your first placement school to support your meeting the Teacher Standards. This short placement will come to an end at Easter and then you will return to your home school for the last 6 weeks of the course. We feel this sense of a home school supports developed professional relationships with colleagues and students anchoring your practice and development as a teacher.","personalQualities":"As a partnership we are looking for; \r\n* A passion for Biology and interest and involvement beyond your degree\r\n* A strong knowledge and understanding of the study of Biology, and a sound awareness of how the subject is taught within UK secondary schools\r\n* Effective communication skills and good organisational skills\r\n* Awareness of current educational developments and issues\r\n* Experience with young people and commitment to developing individuals\r\n* The ability to evaluate practice and address your weaknesses\r\n* Initiative, flexibility and responsiveness to change\r\n* A sense of responsibility and ability to work in a team.\r\n","otherRequirements":"Working with children: You must not be excluded from working with children, as a result of a criminal record or other reason. The Disclosure and Barring Service provides access to records held nationwide through its disclosure service. All trainees must obtain successful DBS clearance before starting an Initial Teacher Education programme.\r\n\r\n* Health requirements: All trainees must be screened for mental and physical fitness to teach by the University's Occupational Health Department before admission to the programme.\r\n","status":1,"createdAt":"2021-07-06T10:47:06.196Z","updatedAt":"2021-10-05T12:48:28.116Z","canSponsorStudentVisa":"yes","cycle":"2024"}
