{"id":"0c1d9572-f3b3-4a6a-8d71-dd30a5ab1ab8","name":"Further education","code":"K594","qualification":"pgde","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","subjectLevel":"further_education","isSend":"no","subjects":[{"id":"9de4b2d2-5739-4c34-92d2-9b4384760298","code":"41","name":"Further education"}],"locations":[{"id":"2ca822c0-ede7-48de-9546-396e7cd6a7d2","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"1d95b6cb-0e08-4485-848a-0e304d71102a","code":"B38","name":"Bishop Grosseteste University"},"profPost":"PG","degreeGrade":"9","english":"9","maths":"9","science":"9","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":14280,"aboutCourse":"The Level 6 Professional Graduate Diploma in Education Training and Skills offers education, training and development to graduates who are aspiring to teach in the education, training and skills sector such as further education colleges, private sector training providers and offender education. It provides a route into teaching in the Further Education and Skills sector for graduates, and leads to a robust teaching qualification, which is recognised by the sector.\r\n\r\nPlease Note: Non-graduates may study this programme at level 5. More information can be found here.","interviewProcess":"","howSchoolPlacementsWork":"All modules contain elements of theory and practice, and require you to take responsibility for your progress by maintaining a personal development portfolio and teaching practice portfolio, tracking your progression. A named personal tutor, cohort learning sets and online learning materials are available to support you as you progress.\r\n\r\nYour learning experience will be made up of directed learning, which typically involves scheduled learning and tutorials with the programme teaching team, as well as a placement of 80 days (560 hours) split into 140 hours per module. This will enable you to undertake the required minimum 100 hours of teaching time and to engage with a variety of activities in order to develop the teaching of your specialist subject. As part of this you will be expected to undertake independent study which may include reading, research, portfolio building, group projects, action planning, developmental activities, events and maintaining industry connections.","status":1,"createdAt":"2021-09-29T10:45:17.705Z","updatedAt":"2021-09-29T10:49:06.523Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
