{"id":"1998e090-8584-403d-af9c-b0ca1b0c0aea","name":"Chemistry","code":"F2X1","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"912d4fb4-761b-42e9-8dc6-e968b791ea4e","code":"F1","name":"Chemistry"}],"locations":[{"id":"2ca822c0-ede7-48de-9546-396e7cd6a7d2","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"1d95b6cb-0e08-4485-848a-0e304d71102a","code":"B38","name":"Bishop Grosseteste University"},"profPost":"BO","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"Applicants should typically have 50% of their degree in the subject they intend to teach.","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"For full details of the qualifications we accept as equivalent to GCSEs and details of the equivalency tests that we accept, please visit https://www.bishopg.ac.uk/apply-now/gcses-equivalency","courseLength":"OneYear","feesUK":9250,"feesInternational":14280,"aboutCourse":"This PGCE course prepares you to teach Science, with an emphasis on Chemistry, in the 11-16 age ranges with opportunities to gain experience of teaching post-16. It is an integrated academic and professional preparation for teaching, combining study at either postgraduate or professional level with practical training to meet the Teachers’ Standards.\r\n\r\nThe PGCE Secondary Science course supports trainees to teach all of the Science subjects at KS3 and KS4 (GCSE) with post-16 enhancement in their specialist subject of Biology, Chemistry or Physics. There is a part-time option available.\r\n\r\nTrainees following this course are encouraged to explore a wide range of creative approaches to planning, teaching and evaluating Science lessons. \r\n\r\nThe course is built upon principles of inclusion and diversity in teaching and learning for all pupils, whatever their potential and achievements.\r\n\r\nThroughout the course, trainees study different methods of assessment and how they support classroom learning and teaching; in particular, the role of formative assessment in the development of metacognitive skills. Outside speakers are invited in to supplement the University sessions, including from the ‘Institute of Physics’, the ‘Royal Society of Chemistry’ and the ‘Association for Science Education’.\r\n\r\n A visit to the National STEM Centre in York is also part of the course. Classroom practical work is encouraged and supported. \r\n\r\nIn addition we are keen to introduce trainees to joys of learning outside of the classroom with learning visits to, for example, a local nature reserve and to Woolsthorpe Manor, the home where Sir Isaac Newton made so many of his wonderful scientific discoveries.","interviewProcess":"Interviews for PGCE programmes are currently being conducted via Microsoft Teams. The interview will consist of two tasks – one is related to the subject that you want to teach and the other is more generic written task. You will also have an interview with a member of the PGCE team.\r\n\r\nWhen your application has been received, the Admissions team will check that you meet the requirements for your chosen programme and will then invite you to book yourself onto an interview day that suits you.\r\n\r\nOnce you’ve booked your interview, you’ll receive all the information you need to fully prepare. This will include details of a short 5-minute teaching task that you’ll be asked to prepare. We’ll ask you about this as part of your subject interview.\r\n\r\nAfter your interview day, we’ll process your decision as quickly as possible and send you more information about meeting your conditions. \r\n\r\nIf you’ve applied for a School Direct place, we’ll also let the school know the outcome of the interview. For successful applicants, the School Direct partner will then make a decision as to whether to invite you to a second interview day in school.","howSchoolPlacementsWork":"While studying this course, you will spend two-thirds of the year in placements in partner schools and other educational settings gaining rich and varied experiences designed to support meeting the standards for Qualified Teacher Status (QTS).\r\n\r\nWorking with peers, tutors and school-based colleagues, you will develop your abilities to promote effective learning among 11-16-year-olds. You will also have opportunities to gain experience of the key stages before and after the ones in which you will qualify.","personalQualities":"","otherRequirements":"Find out more on our website: https://www.bishopg.ac.uk/course/pgcesecche/","status":1,"createdAt":"2021-07-06T10:46:43.769Z","updatedAt":"2021-09-25T10:35:47.287Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
