{"id":"3a462012-6627-47a8-8d8a-d94e0fa9b69d","name":"Music","code":"W3X1","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"24311bef-8673-41fb-933c-53f887fb6976","code":"W3","name":"Music"}],"locations":[{"id":"2ca822c0-ede7-48de-9546-396e7cd6a7d2","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"1d95b6cb-0e08-4485-848a-0e304d71102a","code":"B38","name":"Bishop Grosseteste University"},"profPost":"BO","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"Applicants should typically have 50% of their degree in the subject they intend to teach.","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"For full details of the qualifications we accept as equivalent to GCSEs and details of the equivalency tests that we accept, please visit https://www.bishopg.ac.uk/apply-now/gcses-equivalency","courseLength":"OneYear","feesUK":9250,"feesInternational":14280,"aboutCourse":"This PGCE course prepares you to teach Music in the 11-16 age ranges with opportunities to gain experience of teaching post-16. It is an integrated academic and professional preparation for teaching, combining study at either postgraduate or professional level with practical training to meet the Teachers’ Standards.\r\n\r\nThe aim of this course is that you should become a reflective practitioner – a teacher who thinks about their experiences and learns from them in order to improve their practice. During the course, you will study two academic modules.\r\n\r\nThe first of these, ‘Subject Knowledge and Pedagogy’, allows you to explore several different pedagogical approaches to a particular project that you are going to teach. A chosen pedagogy is justified, taught and then evaluated, clearly linking theory to practice. \r\n\r\nIn the ‘Classroom Focused Development’ module, you will undertake a small research project in school having explored relevant research methods. You will also have a focus on the professional learning needed to meet the Teachers’ Standards, including looking at planning, assessment and classroom management along with the underpinning theory.\r\n\r\nThis PGCE secondary Music course draws upon the strong heritage and tradition of BGU within the field of Teacher Training, within the University’s School of Teacher Development. The course tutors are experienced Music teachers and performers who delight in the opportunity to work with the next generation of Music teachers. \r\n\r\nThe course will equip you to become an outstanding secondary school teacher and facilitator of Music. \r\n\r\nThis inspiring course includes taught seminars, active workshops and 1:1 tutorial support. Music trainees work in a supportive group, sharing classroom experience, teaching resources, and sharing individual expertise. BGU ‘enjoys an excellent reputation locally and employment rates are high’ (Ofsted 2010). \r\n\r\nYou will spend two thirds of the year in partner schools and other educational settings gaining rich and varied experiences designed to support meeting the standards for Qualified Teacher Status (QTS). \r\n\r\nThe course benefits from a close working relationship with the Lincolnshire Music Service, providing experiences across Key Stages and within the wider school community. \r\n\r\nYou will consider the broader aspects of teaching, contexts for learning, the latest government initiatives and contemporary issues in teaching, learning and assessment.\r\n\r\nYou will also work alongside trainee teachers of other subjects to consider cross-curricular aspects of education. These topics will introduce you to your career in the teaching profession.","interviewProcess":"Interviews for PGCE programmes are currently being conducted via Microsoft Teams. The interview will consist of two tasks – one is related to the subject that you want to teach and the other is more generic written task. You will also have an interview with a member of the PGCE team.\r\n\r\nWhen your application has been received, the Admissions team will check that you meet the requirements for your chosen programme and will then invite you to book yourself onto an interview day that suits you.\r\n\r\nOnce you’ve booked your interview, you’ll receive all the information you need to fully prepare. This will include details of a short 5-minute teaching task that you’ll be asked to prepare. We’ll ask you about this as part of your subject interview.\r\n\r\nAfter your interview day, we’ll process your decision as quickly as possible and send you more information about meeting your conditions. \r\n\r\nIf you’ve applied for a School Direct place, we’ll also let the school know the outcome of the interview. For successful applicants, the School Direct partner will then make a decision as to whether to invite you to a second interview day in school.","howSchoolPlacementsWork":"While studying this course, you will spend two-thirds of the year in placements in partner schools and other educational settings gaining rich and varied experiences designed to support meeting the standards for Qualified Teacher Status (QTS).\r\n\r\nWorking with peers, tutors and school-based colleagues, you will develop your abilities to promote effective learning among 11-16-year-olds. You will also have opportunities to gain experience of the key stages before and after the ones in which you will qualify.","personalQualities":"","otherRequirements":"[Find out more on our website](https://www.bishopg.ac.uk/course/pgcesecmus/)","status":1,"createdAt":"2021-07-06T10:46:43.914Z","updatedAt":"2021-09-25T11:19:39.767Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
