{"id":"b4701be2-4334-437c-9625-843fe94d2750","name":"Religious Education","code":"2GRF","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"724b5d16-28dd-4431-bc17-ea4be4daedc4","code":"V6","name":"Religious education"}],"locations":[{"id":"2ca822c0-ede7-48de-9546-396e7cd6a7d2","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"1d95b6cb-0e08-4485-848a-0e304d71102a","code":"B38","name":"Bishop Grosseteste University"},"profPost":"BO","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"Applicants should typically have 50% of their degree in the subject they intend to teach.","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"For full details of the qualifications we accept as equivalent to GCSEs and details of the equivalency tests that we accept, please visit https://www.bishopg.ac.uk/apply-now/gcses-equivalency","courseLength":"OneYear","feesUK":9250,"feesInternational":14280,"feeDetails":"[Find more info about fees and funding on our website](https://www.bishopg.ac.uk/fees-funding/) ","financialSupport":"[Find more info about financial support on our website](https://www.bishopg.ac.uk/fees-funding/) ","aboutCourse":"This PGCE course prepares you to teach Religious Education in the 11-16 age ranges with opportunities to gain experience of teaching post-16. It is an integrated academic and professional preparation for teaching, combining study at either postgraduate or professional level with practical training to meet the Teachers’ Standards. \r\n\r\nThe BGU Secondary Religious Education PGCE will equip you to become an outstanding secondary school teacher. \r\n\r\nYou will be encouraged to engage creatively and critically with a wide range of religions, philosophies, and current social and ethical issues, developing your own subject knowledge and considering ways of exploring these issues with young people. \r\n\r\nThe BGU ITE partnership is a close working relationship between schools, colleges, and the University. Your school based RE mentor will provide ongoing developmental feedback, and help you to practically apply your thinking and learning about religious education pedagogy. \r\n\r\nIn addition to university based sessions you will participate in field visits and school based experiences as well as developing your own subject knowledge and learning the craft of the classroom.\r\n\r\nYou will also be encouraged to explore your own personal life stance and how this impinges on classroom practice.\r\n\r\nYou will consider the broader aspects of teaching, contexts for learning, the latest government initiatives and contemporary issues in teaching, learning and assessment. \r\n\r\nYou will also work alongside trainee teachers of other subjects to consider cross-curricular aspects of education. These topics will introduce you to your career in the teaching profession.\r\n\r\nThroughout your year of study, you will explore all aspects of your subject. This includes those areas that are your strengths, as well as areas you may need to improve upon. \r\n\r\nYou will study how pupils learn in your subject area, how you need to assess them and how to keep abreast of new developments within your subject. You will learn how to plan and deliver topics in ways that include all types of learners in meaningful ways.\r\n\r\nYou will spend two thirds of the year in partner schools and other educational settings gaining rich and varied experiences designed to support meeting the standards for Qualified Teacher Status (QTS). \r\n\r\nWorking with peers, tutors and school-based colleagues, you will develop your abilities to promote effective learning among 11-16 year olds. \r\n\r\nYou will also have opportunities to gain experience of the key stages before and after the ones in which you will qualify.","interviewProcess":"Interviews for PGCE programmes are currently being conducted via Microsoft Teams. The interview will consist of two tasks – one is related to the subject that you want to teach and the other is more generic written task. You will also have an interview with a member of the PGCE team.\r\n\r\nWhen your application has been received, the Admissions team will check that you meet the requirements for your chosen programme and will then invite you to book yourself onto an interview day that suits you.\r\n\r\nOnce you’ve booked your interview, you’ll receive all the information you need to fully prepare. This will include details of a short 5-minute teaching task that you’ll be asked to prepare. We’ll ask you about this as part of your subject interview.\r\n\r\nAfter your interview day, we’ll process your decision as quickly as possible and send you more information about meeting your conditions. \r\n\r\nIf you’ve applied for a School Direct place, we’ll also let the school know the outcome of the interview. For successful applicants, the School Direct partner will then make a decision as to whether to invite you to a second interview day in school.","howSchoolPlacementsWork":"While studying this course, you will spend two-thirds of the year in placements in partner schools and other educational settings gaining rich and varied experiences designed to support meeting the standards for Qualified Teacher Status (QTS).\r\n\r\nWorking with peers, tutors and school-based colleagues, you will develop your abilities to promote effective learning among 11-16-year-olds. You will also have opportunities to gain experience of the key stages before and after the ones in which you will qualify.","personalQualities":"","otherRequirements":"[Find out more on our website](https://www.bishopg.ac.uk/course/pgcesecrel/)","status":1,"createdAt":"2021-07-06T10:46:42.874Z","updatedAt":"2021-09-25T11:26:28.409Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
