{"id":"d069e4e3-d2ea-4cce-a456-f341b88348c3","name":"Biology","code":"3435","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"HE","studyMode":"P","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"322cfc19-d51d-45db-91e3-bd7b4738470f","code":"C1","name":"Biology"}],"locations":[{"id":"2ca822c0-ede7-48de-9546-396e7cd6a7d2","name":"Main Site","isPublished":"Y","status":"R","vacancies":"P"}],"trainingProvider":{"id":"1d95b6cb-0e08-4485-848a-0e304d71102a","code":"B38","name":"Bishop Grosseteste University"},"profPost":"BO","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"Applicants should typically have 50% of their degree in the subject they intend to teach.","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"For full details of the qualifications we accept as equivalent to GCSEs and details of the equivalency tests that we accept, please visit https://www.bishopg.ac.uk/apply-now/gcses-equivalency","courseLength":"TwoYears","feesUK":9250,"feesInternational":14280,"aboutCourse":"This PGCE course prepares you to teach your specialist subject in either the 11-16 (with post-16 enhancement) or 14-19 age phases. It is a very practical course with around two thirds of the time spent in schools, mostly working with teachers and pupils, and around one third spent on directed study, with partnership training in the University and school. \r\n\r\nIt is an integrated academic and professional preparation for teaching, combining study at either postgraduate or professional level with practical training to meet the Teachers’ Standards.\r\n\r\nThe aim of this course is that you should become a reflective practitioner – a teacher who thinks about their experiences and learns from them in order to improve their practice. \r\n\r\nDuring the course you will study two academic modules. The first of these, ‘Theory into Practice’, allows you to explore your subject and its context in school. A chosen lesson in your subject is evaluated using a reflective tool, clearly linking theory to practice. \r\n\r\nIn the ‘Classroom Focused Research’ module you will undertake a small research project in school having explored relevant research methods. You will also have a focus on the professional learning needed to meet the Teachers’ Standards, including looking at planning, assessment and classroom management along with the underpinning theory.","interviewProcess":"Interviews for PGCE programmes are currently being conducted via Microsoft Teams. The interview will consist of two tasks – one is related to the subject that you want to teach and the other is more generic written task. You will also have an interview with a member of the PGCE team.\r\n\r\nWhen your application has been received, the Admissions team will check that you meet the requirements for your chosen programme and will then invite you to book yourself onto an interview day that suits you.\r\n\r\nOnce you’ve booked your interview, you’ll receive all the information you need to fully prepare. This will include details of a short 5-minute teaching task that you’ll be asked to prepare. We’ll ask you about this as part of your subject interview.\r\n\r\nAfter your interview day, we’ll process your decision as quickly as possible and send you more information about meeting your conditions. \r\n\r\nIf you’ve applied for a School Direct place, we’ll also let the school know the outcome of the interview. For successful applicants, the School Direct partner will then make a decision as to whether to invite you to a second interview day in school.","howSchoolPlacementsWork":"While studying this course, you will spend two-thirds of the year in placements in partner schools and other educational settings gaining rich and varied experiences designed to support meeting the standards for Qualified Teacher Status (QTS).\r\n\r\nWorking with peers, tutors and school-based colleagues, you will develop your abilities to promote effective learning among 11-16-year-olds. You will also have opportunities to gain experience of the key stages before and after the ones in which you will qualify.","personalQualities":"","otherRequirements":"Find out more on our website: https://www.bishopg.ac.uk/course/pgcesecbio/","status":1,"createdAt":"2021-07-12T13:47:59.921Z","updatedAt":"2021-09-25T09:29:44.252Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
