{"id":"e5398df4-7448-436d-848c-5762e031c143","name":"English","code":"29TT","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3aed1aa8-ae46-4b68-92bb-a6cc20655c59","code":"Q3","name":"English"}],"locations":[{"id":"2ca822c0-ede7-48de-9546-396e7cd6a7d2","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"1d95b6cb-0e08-4485-848a-0e304d71102a","code":"B38","name":"Bishop Grosseteste University"},"profPost":"BO","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"Applicants should typically have 50% of their degree in the subject they intend to teach.","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"For full details of the qualifications we accept as equivalent to GCSEs and details of the equivalency tests that we accept, please visit https://www.bishopg.ac.uk/apply-now/gcses-equivalency","courseLength":"OneYear","feesUK":9250,"feesInternational":14280,"aboutCourse":"This PGCE course prepares you to teach English in the 11-16 age ranges with opportunities to gain experience of teaching post-16. It is an integrated academic and professional preparation for teaching, combining study at either postgraduate or professional level with practical training to meet the Teachers’ Standards. \r\n\r\nThe BGU Secondary English PGCE is run by tutors who relish the opportunity to work with the next generation of English teachers. It will equip you to become an outstanding secondary school teacher. The course is vibrant and participatory and includes taught seminars, active workshops and 1:1 tutorial support. English trainees work in a supportive group, sharing classroom experience and teaching resources, and cascading individual expertise. The course benefits from a close working relationship with Drama PGCE colleagues, enabling expert input into drama within English. Additionally, the course includes outside enrichment such as visits to theatres such as The Globe in London, visits from authors and being involved with national reading and poetry projects.\r\n\r\nYou will consider the broader aspects of teaching, contexts for learning, the latest government initiatives and contemporary issues in teaching, learning and assessment. You will also work alongside trainee teachers of other subjects to consider cross-curricular aspects of education. These topics will introduce you to your career in the teaching profession.\r\n\r\nThroughout your year of study, you will explore all aspects of English. This includes those areas that are your strengths, as well as areas you may need to improve upon. You will study how pupils learn in your subject area, how you need to assess them and how to keep abreast of new developments within your subject. You will learn how to plan and deliver topics in ways that include all types of learners in meaningful ways.","interviewProcess":"Interviews for PGCE programmes are currently being conducted via Microsoft Teams. The interview will consist of two tasks – one is related to the subject that you want to teach and the other is more generic written task. You will also have an interview with a member of the PGCE team.\r\n\r\nWhen your application has been received, the Admissions team will check that you meet the requirements for your chosen programme and will then invite you to book yourself onto an interview day that suits you.\r\n\r\nOnce you’ve booked your interview, you’ll receive all the information you need to fully prepare. This will include details of a short 5-minute teaching task that you’ll be asked to prepare. We’ll ask you about this as part of your subject interview.\r\n\r\nAfter your interview day, we’ll process your decision as quickly as possible and send you more information about meeting your conditions. \r\n\r\nIf you’ve applied for a School Direct place, we’ll also let the school know the outcome of the interview. For successful applicants, the School Direct partner will then make a decision as to whether to invite you to a second interview day in school.","howSchoolPlacementsWork":"While studying this course, you will spend two-thirds of the year in placements in partner schools and other educational settings gaining rich and varied experiences designed to support meeting the standards for Qualified Teacher Status (QTS).\r\n\r\nWorking with peers, tutors and school-based colleagues, you will develop your abilities to promote effective learning among 11-16-year-olds. You will also have opportunities to gain experience of the key stages before and after the ones in which you will qualify.","personalQualities":"","otherRequirements":"[Find out more on our website](https://www.bishopg.ac.uk/course/pgceseceng/)","status":1,"createdAt":"2021-07-06T10:46:42.807Z","updatedAt":"2021-09-25T10:41:56.805Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
