{"id":"fc29e7cf-c77e-4c25-ac79-5c76fd842853","name":"Primary","code":"2ZYQ","qualification":"qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"0640669c-a2a7-4f3e-aa33-c3a0e1337398","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"1d95b6cb-0e08-4485-848a-0e304d71102a","code":"B38","name":"Bishop Grosseteste University"},"degreeGrade":"1","english":"1","maths":"1","science":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":12500,"financialSupport":"Fees and Finance:\r\nYou could be eligible for either:\r\n•\ta scholarship of £17,000\r\n•\ta bursary of £15,000\r\n\r\nTo qualify for a scholarship, you’ll need a degree of 2:1 or above. For a bursary you’ll need a 2:2 or above in any subject.\r\n\r\nPlease contact university finance for more details.","aboutCourse":"The course offered is a PGCE with QTS, through our provider, Bishop Grossteste University, through a School Direct, Unsalaried Route.\r\n\r\nThis PGCE course prepares you to teach children in the 5 to 11 age range as a general primary teacher. It is a very practical course with around two-thirds of the time spent in schools, mostly working with teachers and pupils, and around one third spent on directed study, with partnership training in the University and school. \r\n\r\nFind out more on our website: https://www.bishopg.ac.uk/course/pgceprim511/\r\n\r\n This makes it ideal for those who have some experience of the working world, mature students and also those that wish to learn more on the job. \r\n\r\nThe course is delivered through full-time training with an assigned teacher mentor on the school site, with a chosen year group and class, for the entire academic year. \r\n\r\nEach Friday is spent training off-site, at Bishop Grosseteste University, Lincoln, where a program of basic training and support is provided.\r\n\r\nWhen training at school, the course is managed by the assigned mentor, and school based lead mentor, with regular checks on progress and further support offered by the university based mentor, at least three times a year. \r\n\r\nBy the end of the course, the trainee will need to prove that they have met all of the core teaching standards effectively, in order to lead on the planning, teaching and learning of a class of children, with support, and up to 80% of the curriculum timetable. \r\n\r\nThe school also provides a comprehensive package of additional training within special training sessions, INSET and Staff Meetings, which are designed to cover all aspects of mandatory teacher training, specialist training on areas such as Pupil Premium, SEN Interventions and Running Trips and Visits. Many aspects of this training also include the development of core employ-ability skills. \r\n\r\nFull details of the course can be found in the schedule on the school website, at www.malcolmsargentschool.co.uk. \r\n\r\nYou can also look on the Apply For Teacher Training Website, to search for and apply for our course: https://www.gov.uk/apply-for-teacher-training ","interviewProcess":"Interviews for PGCE programmes are conducted onsite. The interview will consist of an observation of you working with a small group of children, on a task that you have designed. There are two short tasks – one is a written task and the other is numeracy task. You will also have an interview. \r\n\r\nWhen your application has been received, the Admission team and BGU will check that you meet the requirements for your chosen programme and will then invite you to book yourself onto an interview day that suits you, by contacting Malcolm Sargent Primary School. \r\n\r\nOnce you’ve booked your interview, you’ll receive all the information you need to fully prepare.\r\n\r\nAfter your interview day, we’ll process your decision as quickly as possible and send you more information about meeting your conditions.\r\n","howSchoolPlacementsWork":"The Stamford ITE Cluster, consists of several local schools, and the lead school site, Malcolm Sargent Primary School, where a majority of our trainees are based. \r\n\r\nHowever, we are also happy to find alternative placements at other schools should our trainees have a preference, and work with the Rutland Teaching Alliance, Keystone Teaching School in Bourne and Penn Green in Corby. \r\n\r\nThe course placements are broken down into four main aspects. \r\n\r\nThe Introductory Placement is for the Autumn Term where the trainee begins to gather information about the school and begins to work with individuals and groups in the class.  It builds growing confidence for the trainee to begin to teach alongside the mentor, taking responsibility for some aspects of planning and delivery of lessons.\r\n\r\nThe second aspect, is called the Developing Placement, and is for the first half of the Spring Term, spent at a different, contrasting school locality, within the cluster. During this placement, trainees continue to develop their practice and learn about how different schools operate. \r\n\r\nThe third aspect of training is called Enrichment, and is coordinated by the trainee, with the support of the lead mentor, to find enriching opportunities to explore other areas of the core teaching standards that would otherwise be difficult to fulfill at the main school setting. \r\n\r\nThe fourth aspect of training is the Extending Placement, which lasts for the Summer Term at the main school. Over this placement, the responsibility for teaching extends to 80% of the timetable, for both planning, delivery and assessment, with the full support of the mentor and teaching team. \r\n\r\nTrainees are supported through their journey by School Based Mentors and also by University Based Mentors, regularly discussing practice and monitoring progress through lesson observations and the collecting of evidence to demonstrate meeting the Teachers’ Standards. Tutors also offer pastoral support to help trainees manage their workload and wellbeing. \r\n\r\nTrainees should aim to develop strong subject knowledge of English, Phonics and mathematics, in particular, as well as all other areas of the primary curriculum. \r\n","personalQualities":"Teaching is an extremely rewarding and fascinating career, seeing the outcomes of the support given to children; career opportunities for future development into leadership and an attractive salary and pension scheme. \r\n\r\nIt is also a challenging career. Teachers need to be passionate about supporting and developing children, fostering excellent relationships. \r\n\r\nTeachers need be confident when working with others and need to be prepared to work hard, motivated by challenge and reward. \r\n\r\nTeachers need to have resilience and flexibility to work in a changing profession, where development of practice is a key part of the role. ","otherRequirements":"•\tExperience – We encourage you to gain some experience in schools as this is a good starting point for you to gain an interview for the Primary PGCE\r\n\r\n•\tHealth & Physical Capacity to Teach check\r\n\r\n•\tDBS (formerly the CRB) Enhanced Disclosure","status":1,"createdAt":"2021-07-06T10:53:48.778Z","updatedAt":"2021-09-09T11:50:50.889Z","canSponsorStudentVisa":"yes","cycle":"2024"}
