{"id":"7d60755c-15ea-4f48-afbe-7e1f12e4d3d5","name":"Modern Languages","code":"38JG","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"B","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"4608e5e3-2a1a-48a1-8236-56c7af5a139d","code":"24","name":"Modern languages (other)"},{"id":"ce8523ef-9236-4cd9-b260-d826c7a521b3","code":"ML","name":"Modern Languages"}],"locations":[{"id":"9caf5f1f-2959-45dd-8a01-d639a495eb43","name":"Main Site","isPublished":"Y","status":"R","vacancies":"B"},{"id":"fc74bed0-a330-4694-aaa3-624abd6aec74","name":"John Taylor Free School","isPublished":"Y","status":"R","vacancies":"B"},{"id":"79f05f23-4050-4d32-a0b5-71a51fef8e4b","name":"Paulet High School","isPublished":"Y","status":"R","vacancies":"B"},{"id":"1eacf4a5-b3ac-4a1c-a831-b18215c860b4","name":"Chase Terrace Academy","isPublished":"Y","status":"R","vacancies":"B"},{"id":"2dd9ad7a-c6f0-4966-8804-3f24e16452b9","name":"Kingsmead School","isPublished":"Y","status":"R","vacancies":"B"},{"id":"ba602050-9a92-4df4-9030-a86bf18a3887","name":"King Edward VI School, Lichfield","isPublished":"Y","status":"R","vacancies":"B"},{"id":"94b4c2f0-a4c4-4a2f-8334-4507508e1e32","name":"Blythe Bridge High School","isPublished":"Y","status":"R","vacancies":"B"},{"id":"5d6e264f-d3be-43e2-bfce-6d04c6283e8e","name":"The Pingle Academy","isPublished":"Y","status":"R","vacancies":"B"}],"trainingProvider":{"id":"c616964c-a4bb-4341-9dc0-d3edfa65134f","code":"1L6","name":"John Taylor High School"},"accreditedBody":{"id":"174b60fe-3dac-47c0-a65a-5691b6dda11c","code":"24V","name":"The John Taylor SCITT"},"profPost":"PG","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"The subject of your degree, together with any A Levels you have completed will be looked at to assess you are adequately prepared for the programme with regard to subject knowledge.\nYou may be asked to undertake a Subject Knowledge Enhancement course prior to your ITE programme.","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"All candidates must evidence that they have achieved a Grade 4/C in English and Maths or an equivalent qualification prior to the commencement of the programme.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Our Programme is essentially divided into 6 phases:\r\n* Phase 1: 7-day induction in the SCITT\r\n* Phase 2: Classroom Practice 1 in your home school. \r\n* Phase 3: Classroom Practice 2 in a contrasting setting. This will be a 9 week placement \r\n* Phase 4: Week in a special School.\r\n* Phase 5: Three day placement in a primary setting.\r\n* Phase 6: Classroom Practice 3 in your home school.\r\n\r\nIn each Phase of Classroom Practice you will spend 4 days in school from Monday - Thursday. Every Friday is a training day at the training centre based at the John Taylor High School. In the morning all trainees undertake general professional studies training or work with a colleague from the University of Derby on PGCE assignments and in the afternoon split into subject groups. \r\n\r\nOur Subject Pedagogy Tutor for MFL is an experienced teacher and has designed our programme to give trainees the skills and subject knowledge to meet the demands of all key stages. You will be given the opportunity to explore and research how pupils learn, discover a range of teaching skills and perfect strategies that meet the needs of all pupils, helping to develop their linguistic ability and your own teaching skills. The course combines a practical focus from theoretical perspectives in MFL teaching which will help trainees develop a personal approach to their own MFL teaching.  It provides many opportunities to receive individual feedback in a supportive environment as well as offering collaborative opportunities to develop your subject knowledge. If you are passionate about MFL, keen to share your enthusiasm with young people and develop your own subject knowledge we would welcome your application for our MFL SCITT programme.\r\n\r\nSchool and subject based tasks support face to face training sessions and you will have the opportunity to share experiences with other during the reflect and review sessions on training days. \r\n\r\nThere will be 3 main assessment points throughout the year and by the end of the year you will need to demonstrate and evidence that you have fully met each of the eight Standards for Qualified Teacher Status as well as Part 2 of The Standards. A Subject Knowledge and Teaching Standards Viva at the end of the programme will provide you with the opportunity to demonstrate how you have developed your MFL subject knowledge over the course of the year.   \r\n","interviewProcess":"If your application meets the eligibility and programme requirements, you will be invited to attend an interview in the Training Centre at John Taylor High School where you will be interviewed by a panel consisting of representatives of the SCITT Team, a representative from a partner school  or a subject specialist. \r\nPrior to interview we will ask you to complete a subject knowledge audit and undertake a small amount of research in preparation for the interview. On the interview day we will ask you to:\r\n* deliver a five minute presentation \r\n* plan a short  teaching activity for a small group of KS3 pupils. In this activity we are only looking to assess your ability to breakdown a concept to enable children to learn, your presence and professionalism and your ability to interact with pupils.\r\n* undergo a personal interview in which we will explore your reasons for wanting to become a teacher, your understanding of what it means to be a teacher and what constitutes outstanding teaching and learning.\r\n* Complete an English and Maths test.\r\n\r\nThere will a be an information session prior to the formal interview when we go through the programme with you in detail and provide an informal opportunity for you to ask any questions that you may have about our programme. ","howSchoolPlacementsWork":"The John Taylor SCITT works in collaboration with 15 secondary, 35 primary and 3 special schools across our local area. Schools are usually within 30 minutes travelling time from John Taylor High School . When assigning you to a school we will give consideration to a school’s competence and capacity, we will also plan for two contrasting placements and look at where you live. When applying for a location, we consider this a preference and cannot guarantee that you will be placed at your requested school.\r\nOurs is an 11-16 programme with post 16 enhancement and so you will teach across KS3 and 4 and, according to your aspirations and confidence, acquire Post 16 experience also. We encourage all our partners to provide a KS5 teaching experience for you, as we believe that this enhances employability which is extremely important to us. \r\nYour Home School, where you start and end your training, will oversee the whole of your training year and communication between your home and second placement mentor is  important to us to ensure a smooth transition between the phases. Both mentors will be involved in your end of phase 1 and 2 assessments and transition information shared. \r\nPrior to returning to your home school for your final phase, you will spend 3 days in a primary setting in order to develop your understanding of what pupils have learnt and what they can do when they arrive at their secondary school to continue their educational journey. You will look at how your subject is taught in the primary school in order that you are aware of their existing skills and can plan to build on them effectively. \r\nAfter completing you second placement in the spring term you will spend a week in a special school to deepen your understanding of the barriers to learning that some pupils experience and different strategies deployed by special schools to help pupils overcome them. We work with a number of different types of special schools and a Pupil Referral Unit who all support us with this component of our training. ","personalQualities":"To be successful on our programme, you need to have excellent subject knowledge and be highly motivated, with a real passion for teaching and your subject. You should be able to demonstrate a good understanding of what it means to be a teacher, ideally through school experience and be able to evidence resilience and good organisational skills. It is important that you can work effectively as part of a team, are a good listener and receptive to constructive criticism","otherRequirements":"* An Enhanced DBS check and related safeguarding checks will be carried out no more than three months in advance of the course start date.\r\n* All applicants will be subject to medical clearance checks.\r\n* Upon interview we will review your GCSE and Degree certificates. \r\n* We may ask you to further evidence your Fundamental Competencies in Maths and English depending on the outcome of your Maths and English tests.\r\n\r\n","status":1,"createdAt":"2021-07-06T10:55:30.926Z","updatedAt":"2021-10-01T09:58:52.040Z","canSponsorStudentVisa":"no","cycle":"2024"}
