{"id":"fbccaf78-feff-4416-bcca-48b18b413267","name":"Art and design","code":"G146","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"P","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"d461a678-3335-4ca2-9616-1dc479d31a49","code":"W1","name":"Art and design"}],"locations":[{"id":"9caf5f1f-2959-45dd-8a01-d639a495eb43","name":"Main Site","isPublished":"N","status":"N","vacancies":"P"}],"trainingProvider":{"id":"c616964c-a4bb-4341-9dc0-d3edfa65134f","code":"1L6","name":"John Taylor High School"},"accreditedBody":{"id":"174b60fe-3dac-47c0-a65a-5691b6dda11c","code":"24V","name":"The John Taylor SCITT"},"profPost":"PG","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"TwoYears","feesUK":6935,"feeDetails":"As a part-time route, fees are set at £6,935 per year.","financialSupport":"There is no bursary funding available for Art & Design in 2021/22.","aboutCourse":"Our Programme is essentially divided into 6 phases:\r\n* Phase 1: 7-day induction in the SCITT\r\n* Phase 2: Classroom Practice 1 in your home school. \r\n* Phase 3: Classroom Practice 2 in a contrasting setting. \r\n* Phase 4: Week in a special School.\r\n* Phase 5: Three day placement in a primary setting.\r\n* Phase 6: Classroom Practice 3 in your home school.\r\n\r\nIn each Phase of Classroom Practice you will spend a pro-rata'd number of days in school from Monday - Thursday. Every Friday is a training day at the training centre based at the John Taylor High School. In the morning all trainees undertake general professional studies training or work with a colleague from the University of Derby on PGCE assignments and in the afternoon split into subject groups. You will engage in subject workshops learning how to Teach Art and Design. Our Subject Pedagogy Tutor for Art and Design is a highly experienced Curriculum Area Leader and has designed our  programme to give trainees the skills and subject knowledge to meet the demands of new assessment specifications and an ever-evolving educational landscape. You will be given the opportunity to explore and research how pupils learn, discover a range of teaching skills and perfect strategies that meet the needs of all pupils, develop their creativity and your own skills. The course is practical, provides many opportunities to receive individual feedback as well as offering collaborative opportunities to develop your subject knowledge. The environment in which you will work is extremely supportive. If you are passionate about Art and Design, keen to share your enthusiasm and develop your own subject knowledge we would welcome your application for our Art and Design SCITT programme. \r\n\r\nSchool and subject based tasks support face to face training sessions and you will have the opportunity to share experiences with others during the reflect and review sessions on training days. \r\n\r\nThere will be 3 main assessment points throughout the programme and by the end you will need to demonstrate and evidence that you have fully met each of the eight Standards for Qualified Teacher Status as well as Part 2 of The Standards. A Subject Knowledge viva at the end of the programme will provide you with the opportunity to demonstrate how you have developed your Art and Design subject knowledge throughout the year.   ","interviewProcess":"If your application meets the requirements of the programme you will be invited to attend an interview either remotely via an online interview or in person at John Taylor High School training centre, where you will be interviewed by a panel consisting of representatives of the SCITT Team, a representative from a partner school  or a subject specialist. \r\nPrior to interview we will ask you to complete a subject knowledge audit and undertake a small amount of research in preparation for the interview. On the interview day we will ask you to:\r\n* complete a literacy and numeracy test\r\n* deliver a five minute presentation \r\n* plan a short  teaching activity for a small group of KS3 pupils. In this activity we are only looking to assess your ability to breakdown a concept to enable children to learn, your presence and professionalism and your ability to interact with pupils.\r\n* have a personal interview in which we will explore your reasons for wanting to become a teacher, your understanding of what it means to be a teacher and what constitutes outstanding teaching and learning.\r\nThere will a be an information session prior to the formal interview when we go through the programme with you in detail and provide an informal opportunity for you to ask any questions that you may have about our programme. \r\n\r\n","howSchoolPlacementsWork":"The National Forest Teaching School Alliance is an alliance of 14 secondary schools, 17 primary schools and 3 special schools across our local area. No school is more that 30 minutes travelling time from John Taylor High School . When assigning you to a school we will give consideration to a school’s competence and capacity in your subject area, plan for two contrasting placements and look at where you live. \r\nOur programme is an 11-16 programme with post 16 enhancement and so you will have to teach across KS3 and 4 and according to your aspirations and confidence acquire Post 16 experience as well. We strongly encourage all our partners to provide a KS5 teaching experience for our trainees, as we believe that this enhances employability which is extremely important to us. \r\nYour Home School, where you start and end your training, will oversee the whole of your training year and communication between your home School and second placement mentor is very important to us to ensure a smooth transition between the phases. To that end both mentors will be involved in your end of phase 1 and 2 assessments and transition information shared. \r\nPrior to returning to your home school for your final phase of training you will spend 3 days in a primary setting in order to develop your understanding of what pupils have learnt and what they can do when they arrive at their secondary school to continue their educational journey. You will look at how your subject is taught in the primary school in order that you are aware of their existing skills and can plan to build on them effectively. \r\nAfter completing you second placement in the spring term you will spend a week in a special school to deepen your understanding of the barriers to learning that some pupils experience and different strategies deployed by special schools to help pupils overcome them. We work with a number of different types of special schools and a Pupil Referral Unit who all support us with this component of our training. ","personalQualities":"To be successful on our programme, you need to have excellent subject knowledge and be highly motivated, with a real passion for teaching and your subject. You should be able to demonstrate a good understanding of what it means to be a teacher, ideally through school experience and be able to evidence resilience and good organisational skills. It is important that you can work effectively as part of a team, are a good listener and receptive to constructive criticism","otherRequirements":"* An Enhanced DBS check and related safeguarding checks will be carried out no more than three months in advance of the course start date.\r\n* All applicants will be subject to medical clearance checks.\r\n* Upon interview we will review your GCSE and Degree certificates. ","status":2,"createdAt":"2021-07-06T10:55:30.989Z","canSponsorStudentVisa":"no","cycle":"2024"}
