{"id":"c1a5022a-e7a0-4b11-a5c6-3f709f340f5c","name":"Chemistry","code":"2QB4","qualification":"pgce_with_qts","startDate":"2024-07-31T23:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"912d4fb4-761b-42e9-8dc6-e968b791ea4e","code":"F1","name":"Chemistry"}],"locations":[{"id":"3122320a-38a5-4787-ad81-443c308cbfaf","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"1ad0ce7b-9fcc-4c77-8b06-88779a629750","code":"26L","name":"Cheshire Vale Teaching Support Alliance"},"accreditedBody":{"id":"ec34b77c-cba3-4598-93be-23f0471adff1","code":"L51","name":"Liverpool John Moores University"},"profPost":"BO","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"Degree-Applications are welcomed from high quality graduates or holders of equivalent qualifications or those in the final year of their degree programme. At the start of your teacher training you must hold a relevant first degree from a UK higher education institution with a degree classification of 2:2 (Hons) or above. Any offer is conditional on meeting this requirement prior to the start of the Course.","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"For the purpose of initial teacher training level 2 numeracy and literacy qualifications are not considered as equivalent to GCSE Grade C/4 in Mathematics or English. Any offer is conditional on providing copies of Certificates prior to the start of the Course. CVTSA do not offer Equivalency Tests. If you need to complete these, please use a 3rd party Supplier. CVTSA do not cover the costs of any Equivalency Tests.","courseLength":"OneYear","feesUK":9250,"feesInternational":14000,"aboutCourse":"Cheshire Vale Teaching Support Alliance, working in partnership with Liverpool John Moores University,  provides a school led initial teacher training programme. Our course offers in-depth professional development experiences and is delivered by expert teachers drawn from our partnership schools.  Each school will also develop a more bespoke Professional Development Programme to match the needs of the individual trainees placed at that school. \r\n\r\nYou will attend regular taught sessions at LJMU which focus predominantly on developing your subject knowledge and subject pedagogy. Sessions are led by subject experts and are designed to equip students with the knowledge, understanding and skills needed to become confident teachers. In addition, university led lectures and seminars develop student teachers’ confidence in a range of relevant issues; classroom and behaviour management; meeting individual needs and inclusion; planning and assessment etc. There is a strong emphasis on social justice issues in education and on mental health and well-being. Sessions are largely workshop-based and participatory so that theoretical, research-informed teaching is explicitly linked to its practical implications for the classroom.You will be trained in a highly supportive and aspirational environment and will develop the rigour, professional knowledge, understanding and skills necessary for the delivery of creative, purposeful and challenging teaching and learning. \r\n\r\nThe Postgraduate Certificate is assessed through 2 Modules. The course team and our partnership schools have worked together to ensure that the PGCE Award is both relevant and manageable. The Award of QTS is integral to one of the academic modules. Trainees also submit one academic essay in two parts which focuses on reflecting on aspects of your practice.","interviewProcess":"Applications are screened initially by the Admissions and Information Officer at LJMU. \r\n\r\nInterviews take place in one of our partner schools and take about half a day. \r\nYour interview will include: \r\n•\tA formal  interview\r\n•\t25-30 min lesson to about 12 x KS3 students (Details will be forwarded prior to interview)\r\n•\tTour of the school\r\n•\tWritten task-This is an opportunity for you to further demonstrate your enthusiasm for your subject.\r\n\r\nPlease note - Due to the current global pandemic surrounding Covid-19,  Interview processes are subject to change and may be conducted by telephone or online.  We will notify you of any changes to interview structure as soon as possible.  In the event that they are carried out remotely, we will still follow the above procedure albeit with some amendments to how it is delivered.\r\n\r\nAt the end of the interview you will be asked if you have a geographical preference for your home school placement should you be successful in securing a conditional offer of a place on our School Direct course.\r\n\r\nAfter the interview your application will be considered and you will be notified later that day whether you have been successful and, if so, you will be given details of the conditions of any offer.","howSchoolPlacementsWork":"In addition to attending regular training at LJMU over the course, you will complete your training in 2 schools. You will be assigned to a home school for the majority of your training. When allocating home schools, we aim to accommodate geographical preferences across our alliance wherever possible and this will be discussed with you at interview.  You should advise at application/interview stage, if you will be reliant on Public Transport when the Course starts.\r\n\r\nHome school placements are confirmed in July, prior to the start of the course.  You will join your home school at the beginning of September.  \r\n \r\nYou will spend half a term, from January to February, at an alternate placement and then return to your home school to complete your training.  ","personalQualities":"Teaching is both a demanding and rewarding job. Applicants need to be enthusiastic and  committed and able to take responsibility for their continuing professional development. They need to value and respect all the students they work with and be concerned for raising their educational achievement. They need to respect students' social, cultural, linguistic, religious and ethnic backgrounds and have the highest expectations for all.\r\nApplicants need to demonstrate that they are capable of reflective practice; that they can learn from their experiences and use research and understanding to inform their work with young people. ","otherRequirements":"You are required to meet the Department for Education’s standards for physical and mental fitness to teach and clearance to work with children. Further information, including a Declaration of Health questionnaire and details of how to apply for a Disclosure and Barring Service (DBS) Enhanced Disclosure will be sent to you after you have firmly accepted an offer. \r\n\r\nYour offer is conditional on completing ALL conditions of entry.\r\n","status":1,"createdAt":"2021-07-06T10:50:04.588Z","updatedAt":"2021-09-15T12:12:07.890Z","canSponsorStudentVisa":"yes","cycle":"2024"}
