{"id":"70ac3628-d1cd-4d34-817e-450c17204610","name":"Modern Languages (French, German, Spanish)","code":"34BT","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"fbb00c08-2dbc-4f26-adb3-3b23afba18c1","code":"17","name":"German"},{"id":"9727f674-61ba-4efa-b1f2-21ec7e354442","code":"15","name":"French"},{"id":"ce8523ef-9236-4cd9-b260-d826c7a521b3","code":"ML","name":"Modern Languages"},{"id":"e34fd2a3-a32e-44e9-aea1-666badf3ac03","code":"22","name":"Spanish"}],"locations":[{"id":"573f8d7d-0a42-491d-bfb5-6084e9707cf0","name":"Easthampstead Park Community School","isPublished":"N","status":"S","vacancies":"F"},{"id":"1d7b13c4-25f2-4b6a-9e28-c55edbc45d93","name":"Maiden Erlegh School in Reading","isPublished":"Y","status":"R","vacancies":"F"},{"id":"3b777e30-8552-49fc-a3d3-62f26050d34a","name":"Maiden Erlegh School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"c715aeed-62c7-4b1e-89cb-a557c09bc17c","name":"Blessed Hugh Faringdon Catholic School","isPublished":"N","status":"S","vacancies":"F"}],"trainingProvider":{"id":"43670709-fc69-4edf-8f5a-e6ed6d4386a9","code":"1Y1","name":"Maiden Erlegh Institute"},"accreditedBody":{"id":"6439adcc-af64-4d3d-a1da-de045755db06","code":"R12","name":"The University of Reading"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":16045,"feeDetails":"\r\n","aboutCourse":"The majority of the training takes place in schools and is generally of a practical, skills-based nature.  Sessions are arranged with in-house specialists in given fields, and each trainee is assigned an experienced subject mentor.  The university balances this with the provision of a rigorous academic element, which enables trainees to reflect on work done in schools.\r\n\r\nThe University of Reading has a long and highly successful experience of ITT and particularly of working with schools on school-based training programmes.  Initial teacher training courses are based on the belief that education is about active and meaningful learning through which teachers become analytical, creative and receptive to new ideas. The universities work closely with partnership schools, planning and delivering training programmes in collaboration - teaching is practice-led as well as research-led. The universities support us in recruiting the highest-calibre trainees who become excellent teachers at the end of their training.\r\n\r\nSubject specialism is at the core of the university-based periods of training. You will work with specialist tutors in your subject, many of whom play a leading role in national research and policy developments. Staff from schools and other organisations (including national subject associations) work closely alongside university staff. You will also benefit from specialist facilities at the universities’ campuses.\r\n","interviewProcess":"","howSchoolPlacementsWork":"The Modern Languages School Direct PGCE will enable you to develop the professional skills and knowledge to teach Modern Languages.\r\n\r\nYou will:\r\n•\tDevelop a knowledge and understanding of the national curriculum and its content\r\n•\tDevelop your knowledge of contemporary issues in Modern Language  education\r\n•\tDevelop a critical understanding of wider statutory requirements\r\n•\tDevelop your subject knowledge and a range of teaching materials\r\n•\tDevelop teaching methods and practical knowledge","personalQualities":"You will need to demonstrate sufficient understanding of and insight into the role of the teacher, the classroom environment and the processes involved in learning and teaching. In order to show such understanding and insight it may be beneficial to undertake a visit to a school. ","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:50:23.180Z","updatedAt":"2021-09-15T12:00:11.682Z","canSponsorStudentVisa":"yes","cycle":"2024"}
