{"id":"f6b17a6e-bcdb-421b-88d0-51d8bc3debfa","name":"Religious Education","code":"3DTM","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"724b5d16-28dd-4431-bc17-ea4be4daedc4","code":"V6","name":"Religious education"}],"locations":[{"id":"9f28bf39-96bc-4065-9ac4-968092ec21cc","name":"Furze Platt Senior School - Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"f305037e-0d4a-49f2-b80f-dabbf56d3bdf","code":"286","name":"Teach Maidenhead"},"accreditedBody":{"id":"6439adcc-af64-4d3d-a1da-de045755db06","code":"R12","name":"The University of Reading"},"profPost":"PG","degreeGrade":"9","english":"2","maths":"2","acceptPendingGcse":"no","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":18650,"aboutCourse":"Teach Maidenhead trainees are allocated a subject mentor to oversee day to day development and work on planning, delivery, marking and assessment.   The subject mentor also monitors and observes trainees, helping to ensure they develop the qualities necessary to meet the national Teacher Standards.   Each school also has its own Teach Maidenhead Professional Coordinating Mentor who oversees the subject mentors, while weekly Professional Studies sessions are led by experts from across the five schools.  \r\n\r\nTrainees receive on-the-job training in a highly supportive and aspirational environment by expert teachers in the partnership schools.  In addition they attend training at the University of Reading. \r\n\r\nThis course explores secularism and non-secularism education. You’ll consider the purpose of religious education in schools, exploring topics such as morality, philosophy, ethics and logic.   Initial Teacher Training courses at the University of Reading are based on the belief that education is about active and meaningful learning through which teachers become analytical, creative and receptive to new ideas. The University works closely with Teach Maidenhead, planning and delivering training programmes in collaboratively.   \r\n\r\nThe programme comprises two main aspects: Professional Studies and Subject Studies: \r\nProfessional Studies develops insights into general aspects of education essential for entrants to the teaching profession. It gives consideration to whole-school issues, such as behaviour management, special educational needs and educational theories that contextualise the teaching of your subject. It is taught in small, mixed-subject seminar groups.\r\n\r\nSubject Studies enables trainees to study the teaching of their chosen subject. This includes consideration of aspects such as: the nature of the subject in the secondary school; its place in The National Curriculum; what is taught; how it is taught; how it is assessed; providing for young people with different backgrounds and abilities; teaching in accordance with examination specification requirements; and using ICT effectively to facilitate learning.\r\nTrainees will be assessed against the eight Teachers’ Standards, based on the evidence of their teaching, wider contribution to school life and ability to reflect on and evaluate these experiences. Assessment will be carried out in school and moderated by University tutors.\r\n\r\nTrainees are required to write three assignments during the year. These are designed to deepen their reflection on their school experience in the light of educational research, and to develop their ability to research their own practice. As well as being assessed in their own right, the assignments will contribute evidence towards the assessment against the Teachers’ Standards. \r\n","interviewProcess":"The recruitment process is rigorous and thorough, designed to get the best match of applicant to the places available.\r\nShortlisted applicants will be invited for one interview at the Teach Maidenhead school usually where they will carry out their main placement.  A representative from the University of Reading may also attend for part of the process.  During this process, applicants will undertake a range of activities to judge their suitability for a career in teaching. These will include:\r\n\r\n*\tAn introduction to Teach Maidenhead training courses \r\n*\tA tour of the school and opportunity to meet key staff in the school\r\n*\tThe opportunity to meet with members of the subject department\r\n*\tIf time permits the chance to observe some teaching\r\n*\tAt least one written activity which may take the form of a written piece or may involve a practice exam paper of the subject the applicant wishes to train to teach\r\n*\tA group activity or student panel, where appropriate\r\n*\tA formal interview with a member of Teach Maidenhead (Senior Leadership Team member), the subject Head of Department and possibly a representative from Reading University\r\n\r\nWe aim to feed back to applicants regarding the outcome of their interview within 48 hours of attending.  Should applicants be unsuccessful we will endeavour to provide feedback also within that time limit.  \r\n","howSchoolPlacementsWork":"The five Teach Maidenhead schools (Furze Platt Senior School, Desborough College, Altwood School, Cox Green School and Holyport College) are all located in Maidenhead which is halfway between London and Reading, one mile from the M4 and six miles from the M40.  The five main Teach Maidenhead schools are located in the four corners of the town, a few miles away from each other.  Maidenhead benefits from excellent rail and road connections which will improve still further when Crossrail opens. Maidenhead is 15 minutes from Reading University by train and 20 minutes from London on a non-stop train.  \r\n\r\nThe training course consists of two placements, one main placement and a second lasting six weeks which takes place half way through the main placement.   All five schools are able to offer trainees the opportunity to teach a secondary school age range of 11 to 18.  \r\n\r\nThe course itself is structured broadly as follows (and based on the 2020-21 secondary programme structure): \r\n\r\n*\tEnrolment at The University of Reading during the first week of September\r\n*\tAn intensive week of subject matter study during the second week of September\r\n*\tSix weeks where the trainee spends two days at the university and three in school\r\n*\tA week focusing on the PGCE and tutorials\r\n*\tA further six weeks spending five days in school\r\n*\tA week shared between the university and an induction at the second placement school\r\n*\tChristmas break\r\n*\tSix weeks at the second placement school (beginning of January to mid- February) – we aim to inform trainees of their second placement location between September and November\r\n*\tA week focusing on the PGCE and tutorials\r\n*\tAn intensive week of subject matter study at the end of February at the university\r\n*\tTen weeks at the main placement school with a break for Easter\r\n*\tTwo weeks of enrichment organised by the University of Reading.\r\n","personalQualities":"*\tThe ability to communicate effectively in spoken and written English\r\n*\tEvidence of subject knowledge \r\n*\tEnthusiasm and interest in the particular field of study\r\n*\tThe ability to reflect creatively and critically\r\n*\tEvidence of the understanding the importance of establishing respectful, supportive and constructive relationships\r\n*\tHigh expectations of young people and a commitment to their achievement\r\n*\tSense of the scope of a teacher’s professional skills and responsibilities\r\n*\tAbility to cope well in highly pressurised and demanding contexts\r\n*\tCommitment to collaboration and co-operative working \r\n*\tCommitment to teaching and the School Direct programme   \r\n","otherRequirements":"All successful trainees:\r\n\r\n*\twill be subject to an enhanced Disclosure via the Disclosure and Barring Service.  \r\n\r\n*\twill be expected to be able to travel to and between the five Teach Maidenhead schools and our accrediting provider The University of Reading.\r\n\r\n*\twill need to be available to start the training course on 1st September 2021\r\n\r\n*\twill need to provide original evidence of qualifications.\r\n\r\n*\tmust be able to prove they have the right to study and work in the UK.\r\n\r\n*\twill need to complete a medical questionnaire for the university\r\n","status":1,"createdAt":"2021-07-06T10:49:57.135Z","updatedAt":"2021-09-21T15:18:48.257Z","canSponsorStudentVisa":"yes","cycle":"2024"}
