{"id":"766da7f3-3a80-467d-b767-c7e0e2176b4c","name":"Primary","code":"2ZPF","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"4bbd5370-5d71-45c8-b723-aa28e3adf1c6","name":"The Langdale Centre","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"7d226956-8115-42bb-81d9-2730ab356296","code":"N73","name":"North Tyneside SCITT"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We will accept equivalency tests from third parties. For further information please contact the SCITT office via e-mail at scitt@northtyneside.gov.uk or via telephone at 0191 643 8855.","courseLength":"OneYear","feesUK":9250,"feeDetails":"You may be eligible for a [loan while you study](https://getintoteaching.education.gov.uk/funding-your-training#tuition-fee-and-maintenance-loans) Please note that you’ll have to apply for [undergraduate student finance] (https://www.gov.uk/teacher-training-funding)","aboutCourse":"The North Tyneside School Centred Initial Teacher Training (SCITT) programme provides a practical introduction into primary teaching, awarding trainees with Qualified Teacher Status (QTS).\r\n\r\nOur programme is the best way to train if you're looking for lots of practical, hands-on experience, and want to benefit from the expertise of teachers on the ground. Our unique and distinctive training will equip you with the knowledge, skills and understanding to become a highly effective primary school teacher.\r\n\r\nWe offer training specialising in the 5-11 years old age range based within key stage one and key stage two. The award of Post Graduate Certificate in Education (PGCE) is validated by Northumbria University.\r\n\r\nThe programme offers you the chance to train within a professional environment and incorporates supportive and developmental training opportunities based within North Tyneside's School Improvement Service and in a variety of our partnership schools. \r\n\r\nYou'll be part of a small cohort which means we can offer you personalised support tailored to your needs, and really nurture and support your professional development. The course offers many layers of professional guidance both whilst centre-based and in schools to support and enable students to become highly effective primary teachers.\r\n\r\nThe programme is structured around four distinct but inter-related modules. The four modules are:\r\n\r\n* Reflective Primary Teacher\r\n* Curriculum Studies\r\n* Critical Curriculum Studies\r\n* Educational Placements\r\n\r\nA key strength of the programme is that the practical and taught elements are strongly linked. Each week trainees spend time in schools in addition to school  placements; this enables the taught the taught elements of the course to be firmly grounded in classroom experience. Our expert mentors in schools work closely to ensure a bespoke and developmental experience for all our trainees. \r\n\r\nThe programme has no formal examinations. Instead, you will be assessed through written assignments and practical work in schools. The school placements represent a vital component towards Qualified Teacher Status (QTS). \r\n\r\nThe standards for QTS require you to be successful in all areas, and from the outset you will be involved in reflecting upon your own learning and setting targets for your professional development.\r\n\r\n\r\n","interviewProcess":"All interviews for North Tyneside SCITT will be held in our partnership schools, this gives applicants the opportunity to find out about our programme first hand from head teachers, expert mentors and trainees in schools. Candidates will be required to undertake a variety of tasks during the day such as:\r\n\r\n* Observation task working with a small group of children \r\n* Maths task\r\n* English task\r\n* Formal interview\r\n\r\nSchool staff and SCITT tutors are members of the interviewing panel. Further information regarding the roll out of the interview day and tasks to be completed will be detailed within correspondence prior to the interview.\r\n\r\nWhilst ensuring that we can provide the conditions and training required, you must be prepared to demonstrate a strong potential to train as a primary teacher and your suitability for an offer of a place. The SCITT has thorough and rigorous selection procedures to ensure that the strongest applicants are offered places on the programme. \r\n\r\nInterview results are communicated as soon as possible after the interview takes place. However, any offer is conditional upon sight of original qualification certificates, receipt of a satisfactory medical health check, enhanced DBS check as well as a full work history and referencing check.\r\n\r\n","howSchoolPlacementsWork":"The SCITT offers guaranteed placements within our North Tyneside partnership schools where you'll get practical, hands-on classroom experience and train alongside some really inspiring teachers. \r\n\r\nYou will undertake three extended placements in different schools where you will develop and refine your skills working with the 5-11 age range. \r\nPlacements are confirmed once the course starts and are allocated based on specific elements such as locality, transport and other additional needs.\r\n\r\nEach school has experienced mentors who offer support, advice and guidance and who will oversee each placement.\r\n","personalQualities":"When completing your application form you must include within your personal statement the reason(s) and motivation as to why you wish to teach primary aged children.  \r\n\r\nWe will also need details of any recent and relevant experience with children (length of time and dates need to be included). We are particularly interested in your experience with children in the age phase you are looking to train in. We however understand that obtaining school experience may not be possible. Therefore your application will not be rejected on the basis.\r\n","otherRequirements":"As teaching involves working with children on a daily basis we strongly recommend that you have had at least 5 days recent and relevant experience of working with primary aged children in mainstream UK schools within the age phase you are looking to train in prior to interview.  This experience will strengthen your application and should be detailed within your personal statement. \r\n\r\nAll offers are conditional upon you obtaining a satisfactory health check, enhanced DBS check and reference checks. These checks will be done once you have accepted your offer of a place. \r\n","status":1,"createdAt":"2021-07-06T10:56:46.725Z","updatedAt":"2021-10-06T11:25:21.523Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
