{"id":"3084922e-6bd6-4b98-94f3-eb06ed3d0569","name":"Physical Education","code":"X9C6","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"74d64a54-5e34-4590-b6c7-528dd0cf26fe","code":"C6","name":"Physical education"}],"locations":[{"id":"2823c965-5be7-4236-af19-6b47cb01f97b","name":"Newman University","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"4aa8177a-27b8-4566-b77a-c45515e46739","code":"N36","name":"Newman University"},"profPost":"BO","degreeGrade":"9","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Equivalency tests will be accepted in English and maths\n\nA list of accepted equivalent qualifications together with details of Equivalency Tests from Newman University can be found on our website at\n\nhttps://www.newman.ac.uk/knowledge-base/gcse-equivalent-qualifications-accepted-by-newman-university-for-teaching-training-courses-programmes/","courseLength":"OneYear","feesUK":9250,"aboutCourse":"This course will not only prepare you to teach Physical Education (PE) across the 11-16 age range with post 16 enhancement in secondary schools, but will provide you with valuable knowledge so you develop into an effective classroom practitioner. Providing you with a solid foundation of professional awareness and understanding, the course will foster and develop your competence and confidence in imparting your subject knowledge to young people. Newman can offer you a rich diversity of partnership schools, through a combination of supportive school experiences and active teaching and learning sessions you will develop as a teaching professional.\r\n\r\nStudents are encouraged to develop into reflective teachers; practitioners who can respond effectively to the learning needs of young people in school and apply imaginatively the principles underpinning a broad and balanced physical education programme.\r\n\r\nA significant part of the course will be spent in schools obtaining valuable classroom experience under the supervision of trained mentors and Newman lecturers.\r\n\r\nThe rich diversity of partner schools ensures a variety of school contexts within which teaching skills can be developed. Nationally recognised sports coaching courses are also available to students studying this course at Newman.\r\n\r\nThe Teaching Agency has professional standards for qualified teacher status (QTS) in relation to:\r\n\r\n* Professional Values and Practice\r\n\r\n* Knowledge and Understanding\r\n\r\n* Teaching.\r\n\r\nThe major aim of the PGCE course is to enable you to meet those standards.\r\n\r\nIn addition to developing knowledge of the secondary PE curriculum you can also expect to focus on classroom management, lesson planning and assessment techniques, learning and teaching styles and strategies.\r\n\r\nNewman University’s international links in both Europe and South Africa have developed thriving partnerships that have produced a wealth of resources that allows PE trainees to incorporate an international dimension into their teaching e.g. the Create to Innovate programme (developed in through links with learners in South African townships). \r\n\r\n• You may have the opportunity to benefit from Newman’s International involvement by contrasting UK teaching to that in overseas locations\r\n\r\n• Teaching comprises a balanced mix of lectures, seminars, workshops, school-based experience and fieldwork to furnish you with transferable skills\r\n\r\n• Individual development will be assessed in a variety of ways throughout your course including the evaluation and monitoring of professional classroom competencies by school-based mentors supported by Newman tutors\r\n","interviewProcess":"Our aim is to make this a two way informative process that is as enjoyable as possible, despite being an interview. We want every candidate to have the opportunity to demonstrate their potential to be a good teacher and to thrive as a teacher in their following career.\r\n\r\nFull details of the interview process will be sent to applicants who have progressed successfully to this stage, further details can also be found on the Newman website.\r\n\r\nInterview candidates will be invited to our Faculty of Education to meet academic staff and tutors. \r\n\r\nThe interview day is made up of 2 main components:\r\n● Micro-teaching session with a small group of other candidates, \r\nInterviewers will be looking for you to include: a brief introduction; a main body, engaging the audience and making good use of the available time; a definitive ending summarizing the learning\r\n● Personal interview. The interviewer will use your personal statement as a starting point, to find out about you and your interests, experiences and skills relevant to becoming a teacher\r\n\r\nWe will be looking for:\r\n● Your passion to become an outstanding teacher\r\n● Good communication skills, including an ability to speak confidently  and communicate effectively with individuals and groups\r\n● a knowledge of the National Curriculum in your subject or age area and current educational developments","howSchoolPlacementsWork":"Teaching experiences take place in two blocks of 7 and 12 weeks respectively. Students are placed in a number of local schools so as to gain as much experience as possible. During the PGCE year you are offered a variety of other experiences including working in primary schools, outdoor education sessions and special educational needs (SEN) schools so as to further develop your skills and knowledge.\r\n\r\nYou will gain experience of teaching in at least two secondary schools and acquire high level skills in the application of new technologies in teaching and learning. School-based learning includes observation of experienced teachers, a structured programme of group and whole class teaching and a series of directed activities to explore whole school issues. In addition, there is the opportunity to develop your own professional interests through individual experiences. You will be encouraged to explore further aspects of PE education with groups of pupils across the age and ability range, including those with special educational needs.","personalQualities":"The quality and variety of your personal statement is an important factor in the decision to call you to interview. Candidates must attend an interview at Newman University.","otherRequirements":"Obtaining a Disclosure and Barring (DBS) clearance and meeting the requirements for Fitness to Teach are also required.","status":1,"createdAt":"2021-07-06T10:56:00.824Z","updatedAt":"2021-08-06T09:49:28.578Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
