{"id":"4bc4aff1-4927-4a7d-b694-892242c642ab","name":"Religious Education","code":"V6X1","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"724b5d16-28dd-4431-bc17-ea4be4daedc4","code":"V6","name":"Religious education"}],"locations":[{"id":"2823c965-5be7-4236-af19-6b47cb01f97b","name":"Newman University","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"4aa8177a-27b8-4566-b77a-c45515e46739","code":"N36","name":"Newman University"},"profPost":"BO","degreeGrade":"9","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Equivalency tests will be accepted in English and maths\n\nA list of accepted equivalent qualifications together with details of Equivalency Tests from Newman University can be found on our website at:\n\nhttps://www.newman.ac.uk/knowledge-base/gcse-equivalent-qualifications-accepted-by-newman-university-for-teaching-training-courses-programmes/","courseLength":"OneYear","feesUK":9250,"aboutCourse":"This course will prepare you to teach secondary religious education in a variety of school settings, including Roman Catholic faith schools, academies and local authority secondary schools, across the 11-16 age range with post 16 enhancement. You will develop a good understanding of religious education and gain a solid foundation of professional awareness and understanding to help you develop your competence and confidence in imparting your subject knowledge to young people. In addition to enhancing your subject knowledge, the course will develop your practical teaching skills to meet the standards for qualified teacher status (QTS) and will improve your ability to demonstrate a range of key skills, that will support your wider professional development.\r\n\r\nThe course is designed to help deepen your knowledge and understanding of not only Christianity, which is the main religion taught within all schools, but also all of the other major world religions including Judaism, Islam, Hinduism, Sikhism and Buddhism. During your studies you will be introduced to current debates and practices within religious education, as well as those issues relating to the promotion of the spiritual, moral, social and cultural development of all pupils. You will be provided with opportunities to engage in the use of study trips to a variety of places of worship, including synagogues, churches, mosques, temples, Gurdwaras and pagodas in teaching RE.\r\n\r\nYou will gain a vast amount of experience of teaching as a substantial component of the course involves teaching placements. You will undertake 40 weeks of full-time study at Newman (from early September to the beginning of July), and you can expect to spend at least 24 weeks in school. This focuses on an introduction to secondary teaching, developing standards through partnership school experience and extending and developing your professional skills. Experienced teaching colleagues, including subject mentors – teachers trained to provide beginning teachers with support and guidance - will support you through these placements.\r\n\r\nPartnership Tutors from Newman will be allocated to provide advice and support. You will attend taught sessions at Newman providing you with a thorough understanding of education theory that you will be able to apply in the classroom. A key feature of the course is the opportunity to develop your own professional interests thorough individual experiences. You will be encouraged to explore further aspects of religious education with groups of pupils across the age and ability range, including those with special educational needs.\r\n","interviewProcess":"Our aim is to make this a two way informative process that is as enjoyable as possible, despite being an interview. We want every candidate to have the opportunity to demonstrate their potential to be a good teacher and to thrive as a teacher in their following career.\r\n\r\nFull details of the interview process will be sent to applicants who have progressed successfully to this stage, further details can also be found on the Newman website.\r\n\r\nInterview candidates will be invited to our Faculty of Education to meet academic staff and tutors. \r\n\r\nThe interview day is made up of 2 main components:\r\n● Micro-teaching session with a small group of other candidates, \r\nInterviewers will be looking for you to include: a brief introduction; a main body, engaging the audience and making good use of the available time; a definitive ending summarizing the learning\r\n● Personal interview. The interviewer will use your personal statement as a starting point, to find out about you and your interests, experiences and skills, relevant to becoming a teacher\r\n\r\nWe will be looking for:\r\n● Your passion to become an outstanding teacher\r\n● Good communication skills, including an ability to speak confidently  and communicate effectively with individuals and groups\r\n● a knowledge of the National Curriculum in your subject or age area and current educational developments","howSchoolPlacementsWork":"One of the best features of studying this course at Newman is the high level of tutor support it offers. You may also have the option to study for the Catholic Certificate in Religious Studies (CCRS), which enables you to teach in Catholic schools.","personalQualities":"The quality and variety of your personal statement is an important factor in the decision to call you to interview. Candidates must attend an interview at Newman University.","otherRequirements":"Obtaining a Disclosure and Barring (DBS) clearance and meeting the requirements for Fitness to Teach are also required.","status":1,"createdAt":"2021-07-06T10:56:00.726Z","updatedAt":"2021-08-06T09:52:27.619Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
