{"id":"7cbd29fb-1d26-4d1b-ab91-2a5bc3af5356","name":"English","code":"Q3X1","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3aed1aa8-ae46-4b68-92bb-a6cc20655c59","code":"Q3","name":"English"}],"locations":[{"id":"2823c965-5be7-4236-af19-6b47cb01f97b","name":"Newman University","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"4aa8177a-27b8-4566-b77a-c45515e46739","code":"N36","name":"Newman University"},"profPost":"BO","degreeGrade":"9","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Equivalency tests will be accepted in English and maths\n\nA list of accepted equivalent qualifications together with details of Equivalency Tests from Newman University can be found on our website at:\n\nhttps://www.newman.ac.uk/knowledge-base/gcse-equivalent-qualifications-accepted-by-newman-university-for-teaching-training-courses-programmes/","courseLength":"OneYear","feesUK":9250,"aboutCourse":"This course prepares you to teach English in secondary schools. Providing you with a solid foundation of professional awareness and understanding, it will build and develop your competence and confidence in imparting your subject knowledge to young people. Building on your English studies at undergraduate level, you will be encouraged to develop effective classroom and teaching skills whilst considering the theories, policies and developments within English teaching.\r\n\r\nYou will acquire an awareness of the teaching and learning strategies which will help you develop the reading, writing, speaking and listening abilities of pupils across the 11-16 range with post 16 enhancement. Teaching related areas such as media and drama, as well as the post-16 curriculum, will also be explored during the course. You will develop the strategies and expertise necessary to teach an understanding and appreciation of both language and literature which will hopefully stay with pupils throughout their lives.\r\n\r\nNewman understands that visual, interactive methods of teaching are an exciting way to make learning more fun and engaging for students. A strength of the course is the focus on showing you how to use classroom technology and multimedia programmes effectively when teaching English. The additional skills gained on the ICT/media module of the course make our graduates especially attractive to employers.\r\nIf your degree does not include enough English, or if you just need a refresher course, places may be available on our Subject Knowledge Enhancement courses.\r\n\r\n\r\nOur lecturers and visiting teachers use a variety of teaching methods including lectures, seminars, workshops and special projects. Assessment is through coursework, presentations, project work and practical teaching ability.\r\n","interviewProcess":"Our aim is to make this a two way informative process that is as enjoyable as possible, despite being an interview. We want every candidate to have the opportunity to demonstrate their potential to be a good teacher and to thrive as a teacher in their following career.\r\n\r\nFull details of the interview process will be sent to applicants who have progressed successfully to this stage, further details can also be found on the Newman website.\r\n\r\nInterview candidates will be invited to our Faculty of Education to meet academic staff and tutors. \r\n\r\nThe interview day is made up of 2 main components:\r\n● Micro-teaching session with a small group of other candidates, \r\nInterviewers will be looking for you to include: a brief introduction; a main body, engaging the audience and making good use of the available time; a definitive ending summarizing the learning\r\n● Personal interview. The interviewer will use your personal statement as a starting point, to find out about you and your interests, experiences and skills, relevant to becoming a teacher\r\n\r\nWe will be looking for:\r\n● Your passion to become an outstanding teacher\r\n● Good communication skills, including an ability to speak confidently  and communicate effectively with individuals and groups\r\n● a knowledge of the National Curriculum in your subject or age area and current educational developments","howSchoolPlacementsWork":"All students complete placements in secondary schools – usually in the West Midlands area. You will benefit from Newman’s excellent partnerships with Birmingham schools, providing you with support and encouragement from colleagues in the field.","personalQualities":"The quality and variety of your personal statement is an important factor in the decision to call you to interview. Candidates must attend an interview at Newman University.","otherRequirements":"Obtaining a Disclosure and Barring (DBS) clearance and meeting the requirements for Fitness to Teach is also required.","status":1,"createdAt":"2021-07-06T10:56:00.693Z","updatedAt":"2021-08-06T09:43:54.880Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
