{"id":"88ff3532-cda6-474a-95ba-1304354efe51","name":"Geography","code":"3D3B","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3f47e67b-7fa5-4947-a5a0-74d528cd2a87","code":"F8","name":"Geography"}],"locations":[{"id":"2823c965-5be7-4236-af19-6b47cb01f97b","name":"Newman University","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"4aa8177a-27b8-4566-b77a-c45515e46739","code":"N36","name":"Newman University"},"profPost":"BO","degreeGrade":"9","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Equivalency tests will be accepted in English and maths\n\nA list of accepted equivalent qualifications together with details of Equivalency Tests from Newman University can be found on our website at\n\nhttps://www.newman.ac.uk/knowledge-base/gcse-equivalent-qualifications-accepted-by-newman-university-for-teaching-training-courses-programmes/","courseLength":"OneYear","feesUK":9250,"aboutCourse":"If you are passionate about geography this course will equip you with the skills to provide secondary school students across the 11-16 age range plus post 16 enhancement, with an understanding of the complex geographical systems in the world around them. The course is designed to provoke thought, challenge assumptions and help develop you as a reflective practitioner of the subject, so that you can enter the teaching profession with clear educational priorities and the skills with which to achieve them.\r\n\r\nYou will have the opportunity to explore and develop ideas on how to teach students:\r\n\r\n* Why human and physical environments and landscapes appear as they are, how they form and operate, and how they inter-relate at various scales\r\n\r\n* How and why patterns of human and physical features differ from place to place across the Earth\r\n\r\n* Differences and inequalities within the human world, especially the economic, social and political causes of inequality and economic development\r\n\r\n* The importance of different spatial scales – global to local – and time scales for physical and human processes, together with their interactions and interdependence\r\n\r\n* How to observe, describe, analyse, represent, interpret and report information about the world\r\n\r\n* Changes in human and physical worlds\r\n\r\n* A variety of field and laboratory analytical approaches including techniques such as Geographical Information Systems (GIS) and the use of modern technology in promoting learning\r\n\r\nThe programme is designed to develop you as professional geographers confident to challenge misconceptions and teach with passion and authority.  A thinking skills approach and enquiry based learning underpin the course as these have been shown to both motivate and interest young learners as well as enhance their understanding of the world in which we live.\r\n\r\nThe PGCE course has both a pedagogical and practical aspect. After a short period of time in University preparing you for school experience, much of the course is spent in schools in a programme that gives you an opportunity to gain an advanced understanding of secondary schools and skills in classroom management and lesson delivery. During the year you will gain experience of teaching in at least two secondary schools and will acquire high level skills in the application of new technologies in teaching and learning.\r\n\r\nYou will have the opportunity to experience post 16 education, primary school settings and fieldwork.  ","interviewProcess":"Our aim is to make this a two way informative process that is as enjoyable as possible, despite being an interview. We want every candidate to have the opportunity to demonstrate their potential to be a good teacher and to thrive as a teacher in their following career.\r\n\r\nFull details of the interview process will be sent to applicants who have progressed successfully to this stage, further details can also be found on the Newman website.\r\n\r\nInterview candidates will be invited to our Faculty of Education to meet academic staff and tutors. \r\n\r\nThe interview day is made up of 2 main components:\r\n● Micro-teaching session with a small group of other candidates, \r\nInterviewers will be looking for you to include: a brief introduction; a main body, engaging the audience and making good use of the available time; a definitive ending summarizing the learning\r\n● Personal interview. The interviewer will use your personal statement as a starting point, to find out about you and your interests, experiences and skills, relevant to becoming a teacher\r\n\r\nWe will be looking for:\r\n● Your passion to become an outstanding teacher\r\n● Good communication skills, including an ability to speak confidently  and communicate effectively with individuals and groups\r\n● a knowledge of the National Curriculum in your subject or age area and current educational developments","howSchoolPlacementsWork":"The PGCE course has both a pedagogical and practical aspect. After a short period of time in University preparing you for school experience, much of the course is spent in schools in a programme that gives you an opportunity to gain an advanced understanding of secondary schools and skills in classroom management and lesson delivery. During the year you will gain experience of teaching in at least two secondary schools and will acquire high level skills in the application of new technologies in teaching and learning.\r\n\r\nIn addition to your main school placements, you will have the opportunity to experience post 16 education, primary school settings and fieldwork.  Furthermore, you will develop the skills required to enhance your own professional understanding and develop your own areas of professional interest.\r\n\r\nContact FED@newman.ac.uk for further details.","personalQualities":"The quality and variety of your personal statement is an important factor in the decision to call you to interview. Candidates must attend an interview at Newman University.","otherRequirements":"Obtaining a Disclosure and Barring (DBS) clearance and meeting the requirements for Fitness to Teach are also required.","status":1,"createdAt":"2021-07-12T13:49:30.755Z","updatedAt":"2021-08-06T09:44:37.563Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
