{"id":"9b11bbd9-c3ad-4c8a-bb86-aaedfaa1cfcd","name":"Art and design","code":"Q224","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"d461a678-3335-4ca2-9616-1dc479d31a49","code":"W1","name":"Art and design"}],"locations":[{"id":"2823c965-5be7-4236-af19-6b47cb01f97b","name":"Newman University","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"4aa8177a-27b8-4566-b77a-c45515e46739","code":"N36","name":"Newman University"},"profPost":"PG","degreeGrade":"9","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"A UK Bachelors Degree (or recognised equivalent qualification) of which 50% content must be related to the named subject, and this will be a condition of any offer where the degree has not already been awarded.","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"A list of accepted equivalent qualifications together with details of Equivalency Tests  from Newman University can be found on our website at \n\nhttps://www.newman.ac.uk/knowledge-base/gcse-equivalent-qualifications-accepted-by-newman-university-for-teaching-training-courses-programmes/","courseLength":"OneYear","feesUK":9250,"feeDetails":"You may be eligible for a loan while you study – note that you’ll have to apply for undergraduate student finance.\r\n\r\nFind out about financial support if you’re from outside the UK.\r\n\r\nThe course fees for UK students in 2022 to 2023 are £9,250.","aboutCourse":"The PGCE Art course will lead to a professional qualification to enable you to enter the teaching profession in a secondary school as an Art teacher. During the course you will develop subject knowledge, along with practical skills and an understanding of pedagogical issues related to teaching Art in the 11-16 with post 16 enhancement range. In addition, you will follow a pathway based on your degree qualification and experience that will enhance your understanding of the teaching of Art at Key Stage 4\r\n\r\nYour suitability for the Art pathway will be explored at interview and your bursary eligibility will depend on the subject specialism of your offer of a place.\r\n\r\nEntry requirements\r\n\r\nA UK Bachelors Degree (or recognised equivalent qualification) of which 50% content must be related to the named subject, and this will be a condition of any offer where the degree has not already been awarded.\r\nYou need to demonstrate a commitment to the teaching of Art.\r\n","interviewProcess":"Our aim is to make this a two way informative process that is as enjoyable as possible, despite being an interview. We want every candidate to have the opportunity to demonstrate their potential to be a good teacher and to thrive as a teacher in their following career.\r\n\r\nFull details of the interview process will be sent to applicants who have progressed successfully to this stage, further details can also be found on the Newman website.\r\n\r\nInterview candidates will be invited to our Faculty of Education to meet academic staff and tutors.\r\n\r\nThe interview day is made up of 2 main components: ● Micro-teaching session with a small group of other candidates, Interviewers will be looking for you to include: a brief introduction; a main body , engaging the audience and making good use of the available time; a definitive ending summarizing the learning ● Personal interview. The interviewer will use your personal statement as a starting point, to find out about you and your interests, experiences and skills relevant to becoming a teacher\r\n\r\nWe will be looking for: ● Your passion to become an outstanding teacher ● Good communication skills, including an ability to speak confidently and communicate effectively with individuals and groups ● A knowledge of the National Curriculum in your subject or age area and current educational developments","howSchoolPlacementsWork":"You’ll be placed in schools for most of your course. Your school placements will be within commuting distance.\r\n\r\nYou can’t pick which schools you want to be in, but your university will try to take your journey time into consideration.\r\n\r\nUniversities can work with over 100 potential placement schools. Most will be within 10 miles of the university, but sometimes they can cover a wider area, especially outside of cities.\r\n\r\nYou will spend the majority of your time on the course in schools, developing your teaching skills.\r\n\r\nYou will complete two main teaching placements at different secondary schools; one of 8 weeks and a second longer placement of 12 weeks.\r\n\r\nDuring both placements you are likely to have the opportunity to teach Art across Key Stages 3 and 4. During your placements your professional development will be supported by both the school and Newman tutors. Newman has an excellent reputation with local schools for providing a strong partnership with schools that support students during their placements","personalQualities":"The quality and variety of your personal statement is an important factor in the decision to call you to interview. Candidates must attend an interview at Newman University.","otherRequirements":"Obtaining a Disclosure and Barring (DBS) clearance and meeting the requirements for Fitness to Teach is also required.","status":1,"createdAt":"2021-10-11T09:30:05.430Z","updatedAt":"2021-10-11T10:21:15.510Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
