{"id":"9f5653c7-aa5f-4495-a551-97016a5aa14c","name":"Biology","code":"2QGP","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"322cfc19-d51d-45db-91e3-bd7b4738470f","code":"C1","name":"Biology"}],"locations":[{"id":"2823c965-5be7-4236-af19-6b47cb01f97b","name":"Newman University","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"4aa8177a-27b8-4566-b77a-c45515e46739","code":"N36","name":"Newman University"},"profPost":"BO","degreeGrade":"9","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"A list of accepted equivalent qualifications together with details of Equivalency Tests  from Newman University can be found on our website at \n\nhttps://www.newman.ac.uk/knowledge-base/gcse-equivalent-qualifications-accepted-by-newman-university-for-teaching-training-courses-programmes/","courseLength":"OneYear","feesUK":9250,"aboutCourse":"The PGCE Secondary Science course with an enhancement in Biology, leads to a professional qualification to enable you to enter the teaching profession in a secondary school as a Science teacher with a biology subject specialism. During the course you will develop subject knowledge across all three science areas, along with practical skills and an understanding of pedagogical issues related to teaching Science in the 11-16 with post 16 enhancement range. In addition, you will follow a pathway based on your degree qualification and experience that will enhance your understanding of the teaching of Biology at Key Stage 4\r\n\r\nYour suitability for the biology pathway will be explored at interview and your bursary eligibility will depend on the subject specialism of your offer of a place.\r\n\r\nScience with Biology \r\n\r\nA UK Bachelors Degree (or recognised equivalent qualification) of which 50% content must be related to the named subject, and this will be a condition of any offer where the degree has not already been awarded.\r\n\r\nIf your degree does not contain enough Biology, you may also consider applying for this pathway in combination with a Biology Subject Knowledge Enhancement Course. You need to demonstrate a commitment to the teaching of Biology.\r\n\r\nYou will explore the science curriculum at Key Stage 3 and 4 through practical work in chemistry, physics and biology that leads to the development of subject knowledge and pedagogical skills. These sessions will take place in newly built laboratories equipped to model modern school science facilities. Several learning and teaching themes are developed throughout the year including safe management of laboratory practical work, teaching outside the classroom, how science works, contemporary issues in science teaching, using models and analogies, literacy, differentiation, use of games, pupil misconceptions, using ICT, inclusion, questioning techniques and citizenship. At all times you are supported by well qualified and experienced tutors.\r\n\r\nIn addition to elements of taught sessions at Newman, directed activities and independent laboratory study time will provide you with the opportunity to deepen your subject knowledge and pedagogy in your specialist subject of Biology and prepare you to begin to take on a leadership role in your specialism within a science department.  These activities will be linked to your audit of subject knowledge and enable you to meet your individual training needs.","interviewProcess":"Our aim is to make this a two way informative process that is as enjoyable as possible, despite being an interview. We want every candidate to have the opportunity to demonstrate their potential to be a good teacher and to thrive as a teacher in their following career.\r\n\r\nFull details of the interview process will be sent to applicants who have progressed successfully to this stage, further details can also be found on the Newman website.\r\n\r\nInterview candidates will be invited to our Faculty of Education to meet academic staff and tutors. \r\n\r\nThe interview day is made up of 2 main components:\r\n● Micro-teaching session with a small group of other candidates, \r\nInterviewers will be looking for you to include: a brief introduction; a main body , engaging the audience and making good use of the available time; a definitive ending summarizing the learning\r\n● Personal interview. The interviewer will use your personal statement as a starting point, to find out about you and your interests, experiences and skills relevant to becoming a teacher\r\n\r\nWe will be looking for:\r\n● Your passion to become an outstanding teacher\r\n● Good communication skills, including an ability to speak confidently  and communicate effectively with individuals and groups\r\n● A knowledge of the National Curriculum in your subject or age area and current educational developments","howSchoolPlacementsWork":"You will spend the majority of your time on the course in schools, developing your teaching skills. \r\n\r\nYou will complete two main teaching placements at different secondary schools; one of 8 weeks and a second longer placement of 12 weeks. \r\n\r\nDuring both placements you are likely to have the opportunity teach science across Key Stages 3 and 4 and teach your specialism (biology) at Key Stage 4. During your placements your professional development will be supported by both the school and Newman tutors. Newman has an excellent reputation with local schools for providing a strong partnership with schools that support students during their placements. \r\n\r\nYou will also work in a primary school for a short placement, looking at science teaching methods across earlier key stages. \r\n\r\nThe course offers further flexible opportunities for individual ‘focus’ weeks towards the end of training, where specialised areas can be further developed, including AS/A2 examinations and Education and Professional Studies links with science and your specialism.","personalQualities":"The quality and variety of your personal statement is an important factor in the decision to call you to interview. Candidates must attend an interview at Newman University.","otherRequirements":"Obtaining a Disclosure and Barring (DBS) clearance and meeting the requirements for Fitness to Teach is also required.","status":1,"createdAt":"2021-07-12T13:49:30.591Z","updatedAt":"2021-08-06T09:21:27.451Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
