{"id":"a7b2a31e-6ced-4f50-b344-43db3ab3c285","name":"Computing","code":"IX99","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"e6be6a9c-8696-4b88-8fbd-1ba1bef1b6fc","code":"11","name":"Computing"}],"locations":[{"id":"2823c965-5be7-4236-af19-6b47cb01f97b","name":"Newman University","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"4aa8177a-27b8-4566-b77a-c45515e46739","code":"N36","name":"Newman University"},"profPost":"BO","degreeGrade":"9","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Equivalency tests will be accepted in English and maths\n\nA list of accepted equivalent qualifications together with details of Equivalency Tests from Newman University can be found on our website at:\n\nhttps://www.newman.ac.uk/knowledge-base/gcse-equivalent-qualifications-accepted-by-newman-university-for-teaching-training-courses-programmes/","courseLength":"OneYear","feesUK":9250,"aboutCourse":"This course will provide you with the relevant skills to teach Computing across the 11-16 age range with post 16 enhancement and, in the longer term, progress your career by giving you the subject knowledge to become a subject coordinator, head of department or ICT co-ordinator. Computer Science is included as a science subject in the EBacc performance measure which will create a huge demand for computing teachers so you can expect to have excellent employment prospects on completion.\r\n\r\nFor those applicants that have a good grasp of ICT but need to enhance their subject knowledge of Computing to give flexibility at secondary level, places may be available on our Subject Knowledge Enhancement courses.\r\n\r\nYou will study a programme that gives you an opportunity to gain knowledge, skills and understanding of planning, classroom management and delivery of secondary computing lessons. The focus will be upon the teaching and development of the computing curriculum at Key Stages 3 and 4.\r\n\r\nYou can also expect to engage with several key topics which will furnish you with valuable knowledge and enable you to develop into an effective classroom practitioner including:\r\n\r\n• Programming\r\n\r\n• Computational Thinking\r\n\r\n• Capture and Manipulation of Data\r\n\r\n• Appropriate Presentation of Information\r\n\r\n• Engaging students with emerging technologies\r\n\r\n• Creativity and Innovation\r\n\r\n• Ethical Issues in ICT\r\n\r\n• Digital Literacy\r\n\r\nThe programme consists of 40 weeks of full-time study (from early September to the beginning of July), and you can expect to spend at least 24 of those weeks in schools. You will attend taught sessions at Newman which will provide you with a thorough understanding of education theory that you will be able to apply in the classroom. You will also benefit from Newman’s excellent partnerships with schools in the West Midlands.\r\n\r\nAfter completing the course, you will have acquired high level skills in the application of new technologies in teaching and learning. You can expect to be supported through these placements by experienced teaching colleagues, including subject mentors – teachers trained to provide trainee teachers with support and guidance. Partnership Tutors from Newman will also be allocated to provide advice and support.\r\n\r\nA key feature of the course is the opportunity to develop your own professional interests through individual experiences. You will be encouraged to explore further aspects of computer science education with pupils across the age and ability range, including those with special educational needs.","interviewProcess":"Our aim is to make this a two way informative process that is as enjoyable as possible, despite being an interview. We want every candidate to have the opportunity to demonstrate their potential to be a good teacher and to thrive as a teacher in their following career.\r\n\r\nFull details of the interview process will be sent to applicants who have progressed successfully to this stage, further details can also be found on the Newman website.\r\n\r\nInterview candidates will be invited to our Faculty of Education to meet academic staff and tutors. \r\n\r\nThe interview day is made up of 2 main components:\r\n● Micro-teaching session with a small group of other candidates, \r\nInterviewers will be looking for you to include: a brief introduction; a main body, engaging the audience and making good use of the available time; a definitive ending summarizing the learning\r\n● Personal interview. The interviewer will use your personal statement as a starting point, to find out about you and your interests, experiences and skills relevant to becoming a teacher\r\n\r\nWe will be looking for:\r\n● Your passion to become an outstanding teacher\r\n● Good communication skills, including an ability to speak confidently  and communicate effectively with individuals and groups\r\n● a knowledge of the National Curriculum in your subject or age area and current educational developments","howSchoolPlacementsWork":"You will gain a vast amount of experience of teaching, as a substantial component of the course involves teaching placements in at least two secondary schools. ","personalQualities":"The quality and variety of your personal statement is an important factor in the decision to call you to interview. Candidates must attend an interview at Newman University.","otherRequirements":"Obtaining a Disclosure and Barring (DBS) clearance and meeting the requirements for Fitness to Teach is also required.","status":1,"createdAt":"2021-07-06T10:56:00.655Z","updatedAt":"2021-08-06T09:44:05.895Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
