{"id":"e4d37b9a-0cc3-4f8c-ae1e-e5eaa183041d","name":"Primary","code":"M778","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"2823c965-5be7-4236-af19-6b47cb01f97b","name":"Newman University","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"4aa8177a-27b8-4566-b77a-c45515e46739","code":"N36","name":"Newman University"},"profPost":"PG","degreeGrade":"9","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feeDetails":"Unfortunately we are unable to accept international students as we do not hold a Tier 4 Licence,","financialSupport":"Please refer to our website for further details www.newman.ac.uk ","aboutCourse":"Overview\r\nChoosing to study a PGCE in Primary Education is your first step to inspiring children in learning about their world, and we here at Newman University would love to support you in joining the profession. We understand that the Primary 3-11 age range is a crucial time for children’s development and learning. It is at this formative and particularly receptive stage of development that attitudes towards learning are formed, attitudes that will impact on future life course development. \r\nThe PGCE Primary (3-11) is designed to prepare you for teaching across the Primary age range. There are three modules developed to support your knowledge and understanding of theory, policy and practice, including the Early Years, National Curriculum and SEND frameworks. Two level 7 modules are linked to children’s learning and development as well as curriculum, assessment and pedagogy and you will study these consecutively in the first and second term. The final training module, studied across all three school terms, enables you to observe, reflect on and then undertake the role of the teacher in the Primary phase. The course will enable you to meet the requirements for Qualified Teacher Status (QTS). For those wishing to work within Catholic schools, or who wish to develop their understanding of Religious education, there is also the opportunity to undertake the Catholic Certificate in Religious Studies (CCRS) – see Additional Information for details.\r\nTo ensure that the course content is as up-to-date and relevant to current teaching theory and practice as possible, this course will be re-validated at least every five years or sooner, if external changes require it.\r\n","interviewProcess":"All candidates are interviewed.","howSchoolPlacementsWork":"Additional information:\r\nWork related placements in school and visits to other education settings will require some travel. Placements may be 1 hour and/or approximately a 40 miles radius from a student’s term time address.\r\n\r\n\r\n","personalQualities":"Please refer to our website for further details: www.newman.ac.uk\r\n\r\n","otherRequirements":"","status":1,"createdAt":"2021-09-24T09:54:47.754Z","updatedAt":"2021-09-24T10:11:40.936Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
