{"id":"e77f8cec-0225-4d7d-9f8f-a3e481ae8054","name":"History","code":"3CQQ","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"5a3609a0-5bbb-4377-b919-5d89932ab622","code":"V1","name":"History"}],"locations":[{"id":"2823c965-5be7-4236-af19-6b47cb01f97b","name":"Newman University","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"4aa8177a-27b8-4566-b77a-c45515e46739","code":"N36","name":"Newman University"},"profPost":"BO","degreeGrade":"9","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Equivalency tests will be accepted in English and maths\n\nA list of accepted equivalent qualifications together with details of Equivalency Tests from Newman University can be found on our website at\n\nhttps://www.newman.ac.uk/knowledge-base/gcse-equivalent-qualifications-accepted-by-newman-university-for-teaching-training-courses-programmes/","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Are you passionate about teaching history in school?  The course combines academic study and application of history education with a range of school experiences to prepare you for teaching secondary school students across the 11-16 age range. Approximately two-thirds of your time will be spent in schools developing your practical teaching skills with the support of experienced history teachers.   A wide range of teaching methods are incorporated into the course, including lectures, group discussion, practical workshops, trainee-led presentations and peer reviews.  The course is designed to provoke thought, challenge assumptions and help develop you as a reflective practitioner of the subject, so that you can enter the teaching profession with clear educational priorities and the skills with which to achieve them. \r\n\r\nYou will explore what is the use or relevance of studying History and why it matters what happened long ago? You will be able to educate pupils in how to interpret the past and the legacies of the past in the present. Understanding the linkages between past and present is absolutely basic for a good understanding of the condition of being human. \r\n\r\nIn addition, the programme is designed to develop you as professional history teachers confident to challenge misconceptions and teach with passion and authority.  A thinking skills approach and enquiry based learning underpin the course as these have been shown to motivate and interest young learners as well as enhance their understanding of the world in which we live.  \r\n\r\nThe PGCE course has both a pedagogical and practical aspect.  After a short period of time in University preparing you for school experience, much of the course is spent in schools in a programme that gives you an opportunity to gain an advanced understanding of secondary schools and skills in classroom management and lesson delivery. During the year you will gain experience of teaching in at least two secondary schools and will acquire high level skills in the application of new technologies in teaching and learning.\r\n","interviewProcess":"Our aim is to make this a two way informative process that is as enjoyable as possible, despite being an interview. We want every candidate to have the opportunity to demonstrate their potential to be a good teacher and to thrive as a teacher in their following career.\r\n\r\nFull details of the interview process will be sent to applicants who have progressed successfully to this stage, further details can also be found on the Newman website.\r\n\r\nInterview candidates will be invited to our Faculty of Education to meet academic staff and tutors. \r\n\r\nThe interview day is made up of 2 main components:\r\n● Micro-teaching session with a small group of other candidates, \r\nInterviewers will be looking for you to include: a brief introduction; a main body, engaging the audience and making good use of the available time; a definitive ending summarizing the learning\r\n● Personal interview. The interviewer will use your personal statement as a starting point, to find out about you and your interests, experiences and skills, relevant to becoming a teacher\r\n\r\nWe will be looking for:\r\n● Your passion to become an outstanding teacher\r\n● Good communication skills, including an ability to speak confidently  and communicate effectively with individuals and groups\r\n● a knowledge of the National Curriculum in your subject or age area and current educational developments","howSchoolPlacementsWork":"The programme consists of 36 weeks of full-time study (from early September to the beginning of July), and you can expect to spend at least 24 of those weeks in schools. You will gain experience of teaching in at least two secondary schools and will acquire high level skills in the application of new technologies in teaching and learning.\r\n\r\nAll students complete placements in secondary schools – usually in the West Midlands area. You will benefit from Newman’s excellent partnerships with Birmingham schools, providing you with support and encouragement from colleagues in the field.","personalQualities":"The quality and variety of your personal statement is an important factor in the decision to call you to interview. Candidates must attend an interview at Newman University.","otherRequirements":"Obtaining a Disclosure and Barring (DBS) clearance and meeting the requirements for Fitness to Teach are also required.","status":1,"createdAt":"2021-07-06T10:56:00.616Z","updatedAt":"2021-08-06T09:45:25.231Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
