{"id":"c7098896-ec98-489f-b902-6f8a6afd6844","name":"Primary","code":"2MKN","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_7","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"d026b952-ee1a-44fb-85c3-e3b3f041cec9","name":"Scalby School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"6c979976-3b03-4d5f-a81e-b0e0c9813ca1","name":"University of Hull","isPublished":"Y","status":"R","vacancies":"F"},{"id":"be34a5f0-72e9-41ea-891f-c59d79c89579","name":"Childhaven Community Nursery School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"2e5a0261-1710-4ed6-9dca-ff6c7fc2d0b5","name":"Newby & Scalby Primary School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"5320faa7-881b-457d-80ad-211957724ffe","code":"1YS","name":"Scarborough Teaching Alliance"},"accreditedBody":{"id":"0bc933b8-dad9-4149-8bb2-fd2041d567c2","code":"H72","name":"The University of Hull"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"The Postgraduate Certificate in Education with QTS is an initial qualification in education for those who intend to have a career in teaching. Its three main threads are to provide you with the information, knowledge and skills to enable you to embark on a teaching career and become an effective teacher help you develop a professional interest in educational issues as the basis for further thought or training.  \r\nYou will also receive 60 credits towards your Masters should you wish to pursue further academic research.\r\n\r\nThis course is to teach Primary 3-7 (Early Years & KS1)","interviewProcess":"We will be holding interview days throughout the next academic year. (please ask us or check out our website for more details)  You will be invited to interview in one of our host schools where you will be given a tour of the school and an introduction to the Scarborough Teaching Alliance.  You will have a chance to ask questions and find out more about the alliance and your particular area of teaching.\r\nYou will spend time in the classroom where you will be observed as you interact with the children.  Following  the observation you will be interviewed by lead staff from the alliance and a member of staff from the University of Hull.\r\nThe University of Hull also holds entrance tests in Literacy and Numeracy to ensure the high standard of basic skills with all new entrants to the profession.  These will be held as part of the interview day\r\nYou will be informed of the decision within 48 hours of your interview.","howSchoolPlacementsWork":"You will be placed in your 'host school' in the Autumn Term. You will have a diversity placement in the Spring Term.   You will then spend Summer Term  placement back in your 'host' school.\r\nYour placements will be interspersed with blocks of study at the University on Campus in Hull or one of our training venues in Scarborough.","personalQualities":"We want students who can demonstrate the characteristics of effective learning themselves: to show real interest and enthusiasm for children's learning, to be resilient and be prepared to work hard, to show creativity and be able to critically reflect on their own learning. We have high standards for the children in our schools and the adults who work with us. ","otherRequirements":"DBS checks will be carried out on all trainees before they are able to begin placement.  Any offer of a place on the programme will be subject to a satisfactory DBS check.","status":1,"createdAt":"2021-07-06T10:47:05.124Z","updatedAt":"2021-10-05T13:14:16.002Z","canSponsorStudentVisa":"yes","cycle":"2024"}
