{"id":"64fc3e65-e163-4975-b8cf-8acbb9470820","name":"Primary","code":"3DRM","qualification":"qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"3_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"2dbc1cc4-a4f0-49ac-aac2-1fe2d171ac58","name":"Main Site","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"ddae7874-ec9d-49c9-89ff-2d10d9a7c4ca","code":"1AY","name":"Pudsey Primrose Hill"},"accreditedBody":{"id":"4808c596-11e0-4586-8cb4-116a1d9838b3","code":"E65","name":"Educate Group Initial Teacher Training"},"english":"3","maths":"3","science":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","aboutCourse":"All salaried trainees spend a full-time year teaching and training in schools, but also attend provider-led lecture/workshop sessions to enhance understanding of Primary classroom practice.  \r\n\r\nCentralised training sessions cover content such as High Expectations, Behaviour Management, How Pupils Learn, Adaptive Teaching, Classroom Practice, Curriculum and Assessment in line with the Core Content Framework. This is supplemented by a programme of Primary curriculum subject knowledge (including Phonics), delivered in Pudsey's purpose-built training facilities and directly related to the realities of the classroom. \r\n\r\nAll trainees submit three assignments throughout the year as an integral part of the teaching and assessment programme:\r\n1. School Based Independent Study \r\n2. Developing Subject Competency \r\n3. Professional Values and Practice\r\n\r\nTrainees are supported to improve their knowledge, understanding and application of the Educate Initial Teacher Education (ITE) Curriculum, leading to the development of classroom practice skills and their professional teaching role.  Final assessment is made on a trainee's ability to meet the Teachers' Standards.","interviewProcess":"After application, suitable candidates are invited to a selection event at Pudsey Primrose Hill Primary School in Leeds - although please note that a trainee may be employed by any school in the Leeds/Bradford School Direct consortium (i.e. not necessarily Pudsey Primrose itself).\r\nThe selection event will consist, as a minimum, of\r\n•\tthe assessment of personal qualities and attributes\r\n•\tassessment of the ability to communicate effectively\r\n•\tan assessment of the literacy and numeracy skills required to teach\r\n•\tan evaluation of current educational knowledge and understanding\r\n•\ta presentation\r\n•\tan interview.\r\n\r\nCandidates are interviewed by Pudsey Primrose/Consortium School Headteachers or Senior Leaders and/or Educate Group Initial Teacher Training personnel.\r\n","howSchoolPlacementsWork":"Trainees are employed by a main training school for the majority of their training, but spend six weeks in a contrasting school immediately after Christmas. The main and contrasting schools are all part of the Leeds/Bradford School Direct consortium.\r\nPrimary (3-11) trainees choose whether to focus their training on the 3-7 or 5-11 age range and this determines the age of the pupils they will teach in the two main placements.  \r\nTraining should never cover fewer than 4 school year groups and so ample provision is made to meet this criteria and to ensure that trainees experience a suitable range of placement enhancement in their main and other schools.\r\nAll Primary trainees spend at least one day in a 0-3 setting, in a Special School or PRU and in a Secondary School.  They also visit a school with good EAL provision if this is not experienced in their main or contrasting school.","personalQualities":"We are looking for confident and capable applicants who demonstrate true commitment to a teaching career and a robust, determined, positive attitude. We are looking for trainees who can fit very well into their school team, who can respond positively to feedback and who can make a valuable contribution to school life. We are not looking for a 'finished product' but for trainees who demonstrate real potential to succeed. Candidates should be able to communicate effectively with a whole range of people and be engaging, warm and sociable. They should be organised, prepared and professional.","otherRequirements":"Enhanced Criminal Record Check.","status":0,"createdAt":"2021-07-06T10:56:33.213Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"The salary will be determined by the trainee's employing school, based on the unqualified teachers' pay scales.\r\nSalaried trainees can choose to add a PGCE, validated by Leeds Beckett University, for a fee of £2,000.\r\nIf the PGCE option is not taken, there are no fees for the salaried route."}
