{"id":"612326bf-6a07-484a-9e0b-58e042922bd8","name":"Primary","code":"X100","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"7703a126-79d0-45cb-bc0b-6c307c83921d","name":"Cheltenham Campus","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"9aa67012-b776-4027-89f4-5531efb3a9d2","code":"G50","name":"The University of Gloucestershire"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We accept equivalency tests through www.equivalencytesting.com","courseLength":"OneYear","feesUK":9250,"financialSupport":"Our money advice team is here to help you talk through your options, whatever your situation. We can offer confidential advice and information on how to organise your budget.\r\n\r\nWe can also provide you with information regarding bursaries, loans and grants and explore what you’re entitled to.\r\n\r\n","aboutCourse":"The PGCE primary teacher training course at the University of Gloucestershire is taught in partnership with primary schools, and students work alongside experienced tutors, teachers and mentors throughout training.\r\n\r\nThe programme aims to prepare you for entry to the teaching profession through placements, lectures, seminars, practical workshops and directed study. There is significant emphasis on the principals of teaching and learning with frequent reference to the latest research and national curriculum requirements.    \r\n\r\nYou will develop the skills and understanding needed to teach and assess the full range of core and foundation primary subjects for children aged 5-11. You will also develop the knowledge required to cultivate management and leadership skills.\r\n\r\nA key focus will be to enable you to understand the teacher's wider role, including through the holistic support of children’s health and wellbeing. The course gives high priority to developing your abilities of analysis and evaluation. You will be coached in inclusive practice so that all children, including those with special educational needs and disabilities, can be highly successful. You will work within a supportive learning environment where pastoral care of students is a priority.\r\n\r\nIn addition, you will have the opportunity to gain Master’s level credits, with potential progression to a Master's level degree programme.  \r\n\r\nThe PGCE is awarded following satisfactory performance in relation to all the standards for Qualified Teacher Status. Evidence of success will be drawn from coursework, study tasks, and teaching competence which is demonstrated on school experience.\r\n","interviewProcess":"Appropriate candidates are invited to interview where they will have the opportunity to meet members of teaching team and support staff.\r\n\r\nFull guidance on the interview and selection process will be made available to applicants via email.\r\n\r\nIndividual support arrangements can be made on request.\r\n\r\n\r\n","howSchoolPlacementsWork":"The pattern of School Experience has been determined in collaboration with partnership primary schools. You will undertake a variety of types of school experience including serial visits and block school experience.\r\n\r\nOur partnership consists of diverse schools throughout Gloucestershire and beyond. Placements are arranged for students with appropriate consideration of personal and professional needs.\r\n\r\nWhile our placements team will endeavour to limit the amount of travel necessary, students should be prepared for 15 to 75 minutes travel time.\r\n\r\n\r\n","personalQualities":"Successful applicants will be proactive, engaging, willing to learn and resilient with a drive to make a positive difference to the lives of children and their families. The University of Gloucestershire is committed to safeguarding and promoting the welfare of children and expects all our trainees to share this commitment.\r\n","otherRequirements":"* Satisfactory Safeguarding checks including the receipt of a ‘satisfactory’ Enhanced DBS return including children’s barred list information;\r\n* Satisfactory completion of Declaration of Health signed off by the university doctor;\r\n* Verification of two references; \r\n* Satisfactory completion of suitability form;\r\n*  Satisfactory Certificate of Good conduct, where applicable, for those who have lived or worked abroad.\r\n","status":1,"createdAt":"2021-07-06T10:47:42.153Z","updatedAt":"2021-10-01T13:57:52.422Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
