{"id":"39fb05d8-7612-4137-81bd-5d87ce0848c0","name":"Art and Design","code":"2L99","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"d461a678-3335-4ca2-9616-1dc479d31a49","code":"W1","name":"Art and design"}],"locations":[{"id":"ee580801-f262-4008-8d73-37f002793f01","name":"Learners First Schools Partnership","isPublished":"Y","status":"R","vacancies":"F"},{"id":"3fd91885-4136-4886-b5ad-082a395d1376","name":"Learners First 6","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"11837e30-bbcb-4958-9bf2-df59160ffb6e","code":"1GX","name":"Learners First Schools Partnership"},"accreditedBody":{"id":"899178cc-20a7-4df5-951a-ee83c1b3d4d1","code":"S21","name":"Sheffield Hallam University"},"profPost":"BO","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"If your degree is not relevant then you may need to complete a Subject Knowledge Enhancement prior to commencing your Initial Teacher Training year. This can be discussed with a member of the Learners First team.","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Any outstanding GCSE's must be completed prior to commencing the course in September. Any offer made at interview would be subject to successful completion. A member of the Learners First team would be more than happy to sign post you to relevant equivalency testing sites if you are unsure.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"This programme is delivered jointly by Learners First Schools Partnership (LFSP) and Sheffield Hallam University.  You will spend 85% of your time in one of our partner schools, with the other 15% spent attending training sessions facilitated by highly experienced Learners First Partner School senior colleagues or university tutors.  Upon successful completion of the programme, you will be awarded QTS and a PGCE.\r\nYou will be primarily based at your ‘home’ school, but will be expected to attend to attend training sessions throughout the year. \r\nLFSP offer two School Direct Secondary ITT routes – salaried and non-salaried.  On the salaried route you are employed by your ‘home’ school and paid on the UQT Scale point 1.  Trainees on the salaried route are expected to be able to potentially undertake a higher teaching commitment.  The salaried route is generally best suited to those trainees that have broad experience within a school setting.  On both routes a tuition-fee is payable; on the non-salaried route it is the responsibility of the trainee to pay the tuition-fee, but subject to eligibility they could access Student Finance if they so wished.  ","interviewProcess":"Subject to eligibility checks, you will be invited to attend an individual interview via APPLY, as well as email invitation from a member of the LFSP team.  At your online interview, there will be a formal interview, as well as a variety of other tasks throughout the process in order for the panel to observe your interaction with the pupils.  You will be informed of these tasks prior to interview.  A decision as to whether or not you will be offered a place on this programme will be made, and you will be informed of this decision via APPLY.","howSchoolPlacementsWork":"All school placements are arranged and organised by LFSP, and you will spend time in at least 2 contrasting schools, as well as gaining additional post-16 experience if required.  Whilst consideration is taken with regards to the location of your placement school/s in relation to your home address, trainees should anticipate that they could possibly have to travel up to 1 hour to reach their placement school.  The average travel time to a placement school is approximately 20-30 minutes.\r\n\r\nYou’ll have the support of mentors in schools who will help you to develop your practice through observations, planning meetings, weekly tutorials, reports and in-depth lesson evaluations, all based around the ITT Core Content Framework.\r\n\r\nYour university subject tutor will visit you in school to guide, support and evaluate your progress. There is an emphasis on practical engagement with the curriculum whilst developing your understanding of the theoretical perspectives which underpin the best models of classroom practice.\r\n","personalQualities":"\r\n* High level of motivation\r\n* Strong work ethic\r\n* Potential to become an effective classroom leader\r\n* Good communicator and listener\r\n* Patience, adaptability, resilience, team-work, imagination\r\n* Positive expectations\r\n* Be organised, and have good time management\r\n* Passion for your subject.\r\n\r\nLet us know why you want to teach, and provide evidence that you understand the rewards and challenges of teaching.  Previous experience is not compulsory, but if you do have relevant work/voluntary experience, please include this on your application.  Tell us about the range of relevant abilities and skills you can bring to teaching.\r\n","otherRequirements":"Satisfactory enhanced DBS clearance","status":1,"createdAt":"2021-07-06T10:46:53.197Z","updatedAt":"2021-09-29T10:34:42.579Z","canSponsorStudentVisa":"no","cycle":"2024"}
