{"id":"657362ce-b7ef-44bf-a749-24ffb5928dd8","name":"Primary","code":"U712","qualification":"pgce_with_qts","startDate":"2024-06-30T23:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"TA","fundingType":"apprenticeship","studyMode":"F","ageRange":"3_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"ee580801-f262-4008-8d73-37f002793f01","name":"Learners First Schools Partnership","isPublished":"Y","status":"R","vacancies":"F"},{"id":"de2ece1a-4598-4f1d-a96b-bac9a325fe3a","name":"Learners First 1","isPublished":"Y","status":"R","vacancies":"F"},{"id":"bd908855-cb73-4243-a999-9c613627e256","name":"Learners First XP","isPublished":"Y","status":"R","vacancies":"F"},{"id":"3dfaf323-e8cd-453b-984c-ee34d424726b","name":"Learners First 3","isPublished":"Y","status":"R","vacancies":"F"},{"id":"0be698bf-4e29-4200-b7b6-0c783b23626d","name":"Learners First 4","isPublished":"Y","status":"R","vacancies":"F"},{"id":"a9fd1fb0-ed96-4229-9418-55ff54d7d8fa","name":"Learners First 5","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"11837e30-bbcb-4958-9bf2-df59160ffb6e","code":"1GX","name":"Learners First Schools Partnership"},"accreditedBody":{"id":"791f82c8-19fd-4339-9c7b-301dee8067ce","code":"H60","name":"University of Huddersfield"},"profPost":"PG","degreeGrade":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","additionalGcseEquivalencies":"Any outstanding GCSE's must be completed prior to commencing the course in July. Candidates must also have completed degree. Any offer made at interview would be subject to successful completion.","courseLength":"OneYear","aboutCourse":"This programme is delivered jointly by Learners First Schools Partnership (LFSP) and The University of Huddersfield. You will spend 80% of your time in one of our partner schools, with the other 20% spent attending training sessions facilitated by SLE’s or university tutors. Upon successful completion of the programme, you will be awarded QTS and a PGCE. You will be primarily based at your ‘home’ school, but will be expected to attend to attend training sessions at various local venues. On the Teaching Apprenticeship route you are employed by your ‘home’ school and paid on the UQT Scale point 1. Trainees on this route are expected to be able to potentially undertake a higher teaching commitment, with the possibility that they may be given their own class responsibility from the beginning of the programme. This route is generally best suited to those trainees that have broad experience within a school setting. ","interviewProcess":"Subject to eligibility checks, you will be invited to attend an interview via APPLY, as well as email invitation from a member of the LFSP team.  At your interview, the panel will be a group of SLE’s from our teaching schools and partner schools.  There will be a formal interview, and you will also be required to deliver a teaching task. Prior to the interview, you will be made aware of which year group you will deliver your teaching task to.  A decision as to whether or not you will be offered a place on this program will be made, and you will be informed of this decision via APPLY.","howSchoolPlacementsWork":"All additional school placements are arranged and organised, in collaboration with the employing apprenticeship school, by LFSP. You will spend time in at least 2 contrasting schools, as well as gaining additional EAL and SEND exposure. Whilst consideration is taken with regards to the location of your placement school/s in relation to your home address, trainees should anticipate that they could possibly have to travel up to 1 hour to reach their placement school. The average travel time to a placement school is approximately 20-30 minutes.\r\nYou’ll have the support of mentors in schools who will help you to develop your practice through observations, planning meetings, weekly tutorials, reports and in-depth lesson evaluations based around the ITT Core Content Framework.\r\nYour university tutor will visit you in school to guide, support and evaluate your progress. There is an emphasis on practical engagement with the curriculum whilst developing your understanding of the theoretical perspectives which underpin the best models of classroom practice.\r\n","personalQualities":"•\tHigh level of motivation\r\n•\tStrong work ethic\r\n•\tPotential to become an effective classroom leader\r\n•\tGood communicator and listener\r\n•\tPatience, adaptability, resilience, team-work, imagination\r\n•\tPositive expectations\r\n•\tBe organized, and have great time management\r\nLet us know why you want to teach, and provide evidence that you understand the rewards and challenges of teaching. Previous experience is not compulsory, but if you do have relevant work/voluntary experience, please include this on your application. Tell us about the range of relevant abilities and skills you can bring to teaching.\r\n","otherRequirements":"Satisfactory enhanced DBS clearance","status":1,"createdAt":"2021-07-20T09:50:55.912Z","updatedAt":"2021-09-29T10:42:08.959Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024"}
