{"id":"448eb85e-7978-4585-b890-1c35ec984246","name":"Primary with LEAF","code":"F799","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"a62a0e77-1613-46bb-b0f5-57ebfac0de46","name":"St Katherine's School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"6f183701-d97f-4538-9943-e7d25f2922c8","name":"Coxheath Primary School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"6ededb74-a80f-43e9-aa9a-52389aa1cf3f","code":"2JR","name":"LEAF"},"accreditedBody":{"id":"1165d5fd-11f4-4dab-99c9-47b309481463","code":"C10","name":"Canterbury Christ Church University"},"degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"no","courseLength":"OneYear","feesUK":5960,"financialSupport":"You may be eligible for financial support while you study.","aboutCourse":"School based learning:\r\n\r\nGraduates will be based in a mainstream primary school supported by excellent teachers and trained mentors. The second placement, a minimum of 4 weeks as one block, is in one of the local partnership special schools. \r\n\r\nYou will have a wealth of opportunity to develop your skills in a range of areas including many of the day to day teacher responsibilities such as assessing, planning, learning and teaching, positive behaviour management, differentiation and the primary curriculum.\r\n\r\nOur graduates will benefit from a comprehensive programme of coaching and mentoring. \r\n\r\nUniversity Training Days:\r\n\r\nCanterbury Christ Church has a long established reputation for ITT, it is one of the most successful providers of ITT in the country. The School Direct route with Canterbury Christ Church leads to the award of QTS. \r\n\r\nThe training programme includes 15 training days at Canterbury Christ Church University; these consist of professional development days and subject related days. Trainees are expected to attend all 15 days and further demonstrate this learning in classroom practice. Progress will be monitored by your mentor and Canterbury Christ Church University. \r\n\r\n\r\nFor more information please visit the LEAF website\r\n\r\nwww.leaftrainingpartnership.co.uk\r\n\r\n","interviewProcess":"Potential candidates will be invited to attend an assessment day. This is an opportunity to meet some of the partnership school leaders, spend time in the classroom and find out more about what we can offer.\r\nFollowing the assessment day there will be a formal interview. \r\n","howSchoolPlacementsWork":"All placement schools are within the primary age range and within the Maidstone area. Trainees will be based in a mainstream school where you will spend the majority of your time. There are 7 schools within the LEAF partnership, 5 of those being mainstream primary and 2 special schools. \r\n\r\nThe school will ensure that you are able to attend university days. Teaching responsibility increases gradually to reflect the progress of the student teacher; some will make faster or slower progress than others. \r\n\r\nFurther information about our partnership schools can be found on the LEAF website;\r\n\r\nwww.leaftrainingpartnership.co.uk\r\n","personalQualities":"We are looking to recruit candidates who are passionate about education, want to make a difference and have the values, qualities and attributes needed to become outstanding teachers.","otherRequirements":"An enhanced DBS check will be conducted on all candidates.","status":1,"createdAt":"2021-07-12T13:49:09.148Z","updatedAt":"2021-10-01T11:59:38.225Z","canSponsorStudentVisa":"yes","cycle":"2024"}
