{"id":"0dca3f46-af57-4c4e-a86f-ab8fec460069","name":"Computing","code":"2SRR","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"e6be6a9c-8696-4b88-8fbd-1ba1bef1b6fc","code":"11","name":"Computing"}],"locations":[{"id":"8e1f3757-8575-43b6-a413-438097ee29cb","name":"North Manchester ITT Partnership","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"2962e2eb-d49a-49bc-8bc8-1f1fdf15f66f","code":"25K","name":"North Manchester ITT Partnership"},"profPost":"BO","degreeGrade":"2","english":"2","maths":"2","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9000,"aboutCourse":"North Manchester Initial Teacher Training Partnership offers the Computing training route programme for the 11-16 age range.  We are extremely proud to work with three partnership schools, who share our vision, and provide bespoke, subject specialist mentoring to our cohort of trainees.\r\n\r\nNMITTP is affiliated with Manchester Communication Research School (part of the EEF’s Research School Network). We offer a comprehensive training programme, underpinned by the best available evidence which provides regular opportunities to rehearse and practise key skills, prior to teaching in the classroom.\r\n\r\nOur curriculum is carefully planned and sequenced to ensure progression of skills throughout the academic year, starting with a focus on behaviour which is refined throughout the programme.  Over the course of the year, trainees learn how to confidently and efficiently plan well sequenced lessons, provide effective instruction, check for student understanding and adapt their teaching to meet the needs of their learners.\r\nAs a school centred training provider, we offer above the minimum requirement of 120 days of school experience, which provides our trainees with ample opportunity to experience life as a teacher within the classroom.  Our package allows trainees to develop their teaching first hand within schools from Monday to Thursday, whilst each Friday is set aside for high quality centralised training at our training base in North Manchester.\r\n\r\nWe provide a second placement in a different school for all trainees, which is usually a six-week period after Christmas.  This enables trainees to gain knowledge and experience of teaching within a contrasting setting. In addition to this, we provide our ITTs with the opportunity to gain experience of KS2, Post-16 and an SEND provision.\r\n\r\nTrainees will also complete a Post Graduate Certificate in Education (School Centred Initial Teacher Training) with Manchester Metropolitan University.  Two assignments will be completed during the academic year and successful completion offers 60 credits at Masters level.\r\n","interviewProcess":"We strive to select trainees who are passionate and eager to enter the teaching profession, particularly with a focus on learning within areas of disadvantage.\r\n\r\nOur interview process enables us to meet candidates and to find out more about what they are able to offer the teaching profession.\r\n\r\nOur interview process will consist of the following:\r\n•\tA short presentation defining what a candidate believes makes a great teacher\r\n•\tA short teaching task with a small group of children\r\n•\tA formal interview\r\n•\tTime for questions and answers\r\n\r\nIf candidates are successful after interview, they are informed in writing and asked to accept their place at their earliest convenience.\r\nAt the end of August, as part of our induction training days, trainees will be asked to complete relevant English and Mathematics assessments so that the team at North Manchester Initial Teacher Training Partnership, are able to offer bespoke subject knowledge enhancement guidance, where appropriate.\r\n","howSchoolPlacementsWork":"All of our trainee teachers are placed within one of our partnership schools and will be allocated an expert mentor from the onset.  Mentors receive frequent training from North Manchester Initial Teacher Training Partnership to ensure consistency and tailored expertise within our partnership schools.\r\n\r\nTrainees will remain in their host placement school for the duration of the academic year, however they will experience a contrasting placement from January to February, for a six-week block.  \r\n\r\nTrainees will spend over 135 days within schools, which is above the minimum requirement of 120 days.\r\n","personalQualities":"We are looking for dynamic, passionate and resilient candidates who are eager to enter the teaching profession and improve the life chances of young people by mitigating the impact of disadvantage.\r\n\r\nAs a school centred provider, we embrace the opportunity for trainees to predominately train within a school setting.  A dedication for putting the needs and learning of children first is essential.\r\n\r\nOur ideal candidate will be self-motivated and eager to take ownership of their own professional development. \r\n\r\n\r\n","otherRequirements":"","status":1,"createdAt":"2021-07-12T13:48:05.520Z","updatedAt":"2021-09-30T13:40:39.978Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
