{"id":"f150ad44-2070-41ed-b80d-f49062b9d578","name":"Primary","code":"2SSC","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"3_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"8e1f3757-8575-43b6-a413-438097ee29cb","name":"North Manchester ITT Partnership","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"2962e2eb-d49a-49bc-8bc8-1f1fdf15f66f","code":"25K","name":"North Manchester ITT Partnership"},"english":"2","maths":"2","science":"2","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":null,"aboutCourse":"This course is designed for candidates that are already employed in a primary school setting and have the support of this school for the training year.\r\n\r\nTrainees on the salaried route will be expected to start on a 50% timetable and  therefore experience of planning, teaching and assessing is vital and a course requirement.\r\n\r\nDuring the year you will have teaching experience in your specialist age range in 2 complementary placements, practising both core and foundation subjects.  \r\n\r\n","interviewProcess":"Your salaried interview process will consist of the following:\r\n\r\n* general information discussion about the course\r\n* information about the North Manchester ITT Partnership\r\n* numeracy and literacy audit\r\n* primary scenario task\r\n* 20 minute teaching task\r\n* 30 minute planning task \r\n* formal interview\r\n\r\nYour interview will be held at your school. \r\n\r\nWe aim to make a decision within 24 hours of your interview","howSchoolPlacementsWork":"You will have experience in 2 complementary placements.  \r\n\r\n5-11 age range - KS1 and KS2  (You will also spend some time in KS3 so that you can observe the importance of the transition.\r\n\r\n3-7 age range - Reception and KS1  ( You also have some experience of nursery)\r\n\r\nIf it safe to do so you will complete 2 main teaching placements during the year.  You will be based in one school for the majority of they year, with a second school experience taking place usually in term 2 and lasting for approx. 6 weeks.\r\n\r\nTrainees are based in a school Monday - Thursday  from the start of the academic year.  Every Friday trainees will return to the SCITT training rooms for professional study sessions. These sessions are planned to develop subject knowledge and pedagogy. \r\nSalaried trainees will also have the option to complete a PGCert(SCITT) with Manchester Metropolitan University.  Two assignments will be completed during they year giving the trainee 60 credits at Masters level. This will be funded by the trainee or the trainees school.\r\n\r\n\r\nOverall we give you 135 days in school.\r\n","personalQualities":"","otherRequirements":"For a salaried place, you will need to have worked for at least 3 years - so that you have the relevant experience.  You will also need to be financially supported by your school as they will need to agree to employ you through your training year. \r\n\r\nYou will also need to be familiar with the Primary curriculum (2014).  ","status":2,"createdAt":"2021-07-12T13:48:05.816Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"For a salaried place, you will be already working in a school who is willing to employ you through your training year.\r\n\r\nYour salary will be comensurate with an unqualified teacher's salary.  This will be in agreement with your own school. "}
