{"id":"a18e2d16-0a5a-4815-909e-85012094e894","name":"Religious Education","code":"2HNJ","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"724b5d16-28dd-4431-bc17-ea4be4daedc4","code":"V6","name":"Religious education"}],"locations":[{"id":"ff1e874f-f0f7-4c8e-9fe1-4e967e6afc40","name":"St Wilfrid's Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"524a9943-eb5f-4b31-8e69-c8e1fcac60b6","code":"1ZX","name":"Diocese of Leeds BKCAT Alliance"},"accreditedBody":{"id":"19a3446e-382d-4c14-83bb-a76563cef3c1","code":"L24","name":"Leeds Trinity University"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Please contact provider for details","courseLength":"OneYear","feesUK":9250,"aboutCourse":"We are looking for the next generation of outstanding teachers who are passionate about children and education but also care about our schools, the communities they serve and the distinctive ethos each of those schools have. \r\nThey may have experience of working with young people - perhaps voluntary work such as youth groups, sports teams, church groups, community groups and ideally some of which is in school so they have a good awareness of how schools operate and teachers work. They will be able to talk about how they have engaged, communicated with and inspired young people they have worked with. They might have non education work and life experience that they can draw on to show they will be a great role model to young people and a natural communicator and professional team player in a school. They might have experience that shows they can work under pressure, learn quickly and take constructive feedback to improve one's own performance\r\n\r\nWe work in partnership with Leeds Trinity University who accredit and co-deliver our course. The course is a blend of university and school based delivery which leads to a PGCE qualification with QTS and Master's credits. \r\nAssessment is both summative and formative during each of three progressive stages, each taking place over a twelve week period. At the end of each stage you will be required to submit a portfolio of evidence which is moderated and validated by school based and university based tutors for Quality Assurance. \r\n\r\n\r\nTrainee teachers will have school experience days. They will also have web access to Leeds Trinity University's Learning Platform for the PGCE and Master's element of the course and most schools provide web access to their own Learning Platforms and Staff Intranets and email systems to enable working for home for planning lessons and assessing children's work remotely. \r\n","interviewProcess":"Interviews are subject specific and will include a formal interview about subject knowledge and teaching methods, understanding of the role and responsibility of teachers as well as observed sessions where you will be working with children. \r\n\r\nAs we are a large alliance we often work as a team to interview groups of applicants in one school. This means applicants should read about the schools they wish to be placed in and should also consider contacting them to ask for a visit so they understand the ethos of the school, its catchment and practicalities like travelling distances and are then better able to express a preference for home school placement. We cannot guarantee to offer successful applicants their first choice of school but we try hard to match applicants to schools for mutual benefit.\r\n","howSchoolPlacementsWork":"If there is any impact on school placements as a result of Covid 19, we will inform you before the course starts.\r\n\r\nWe work in partnership with Leeds Trinity University who accredit and co-deliver our course. The course is a blend of school based and university based study, which leads to a PGCE qualification with 60 Master's credits. The school based approach means you will train by working alongside and being mentored by people who can demonstrate and model exemplary practice on a daily basis with the same children you will be teaching. \r\n\r\nYou will spend most of the training year in one school (the 'home school'). These schools are central to the selection process and our school based interview system. You can express a preference for your home school but we cannot guarantee to meet everyone's preference. \r\nYou will complete the course in your home school having experienced a shorter placement in an alternative, contrasting setting part way through the year. Whilst we make every attempt to make sure the alternative placement school is in an accessible location it may involve a few weeks of travelling further to get that all important contrasting experience. \r\nThroughout the course there are regular study days delivered by a blend of Leeds Trinity University staff and school based staff which take place at a local hub school or Leeds Trinity site. At the hub school you will work with a small group of fellow trainees from other Diocese of Leeds BKCAT Alliance Schools so not only will you be able to enjoy lively interactive sessions where others contribute to your learning you will also have that all important peer group for support and a social life when it's time to relax.\r\n","personalQualities":null,"otherRequirements":null,"status":1,"createdAt":"2021-07-06T10:56:52.218Z","updatedAt":"2021-09-27T08:59:35.750Z","canSponsorStudentVisa":"yes","cycle":"2024"}
