{"id":"e52a6137-befd-4466-b19d-9d29a53f5b08","name":"Primary","code":"R050","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"0752233c-1895-4f5c-a5e7-084a08e1e5be","name":"St. John's CE Primary School - Lead School - choose this for all applications","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"af6c4cd8-c90a-4412-869d-50f8a47f901f","code":"15D","name":"West Essex SCITT (St John’s C of E Primary School)"},"accreditedBody":{"id":"85fff496-4075-4cb3-9ad0-65e7958ea202","code":"2BB","name":"West Essex SCITT"},"profPost":"PG","degreeGrade":"0","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"If you require any further information, please contact Susan Marbe by email at smarbe@efspt.org","courseLength":"OneYear","feesUK":9250,"aboutCourse":"This course is a School Direct Training Programme (fee funded/unsalaried) leading to the award of QTS and PGCE.\r\n\r\nThis path into teaching is a great way to gain the qualifications and practical skills you need to become a teacher. It enables those who have a degree to combine teacher training with learning on the job. The course delivers the curriculum (ITT core content framework) alongside the practical experience of being in a classroom. Trainees are assessed against the Teachers Standards prior to the award of Qualified Teacher Status (QTS). Additional assignments are required  to be awarded the Post Graduate Certificate of Education (PGCE).\r\n\r\nTrainees applying for a place on this course should be aware that the workload and academic assignments are greater than that of QTS only courses, that can be applied for. Suitability for this course will be discussed in more detail at interview.\r\n\r\nThe majority of our partnership schools are in the Epping Forest and Harlow areas and are accessible by Central Line Tube, Overground or major bus routes.\r\n\r\nThis course will be based in one school for the majority of the training period with a second placement in a contrast school setting. Trainees will spend 80% of their time in schools. The remaining 20% will be delivered through weekly training days. These will be held on a Wednesday, predominantly in the training room at The Alderton Junior School in Loughton, Essex, IG10 3HE.\r\n\r\nThose on the PGCE course will have additional training sessions and assignments, they will be delivered and validated by the University of Derby.\r\n\r\nOur Teacher Educators and Tutors are leading practitioners that attend training and meet regularly to further develop their skills in supporting trainees. Trainees will attend training and implement this into their practice. They will write reflectively on a weekly training plan and these will form the majority of the evidence alongside weekly observations conducted by the Teacher Educator. Termly reviews and professional learning conversations will ensure that trainees are on track to meet the Teachers’ Standards and be awarded QTS on completion of the course.\r\n\r\nSchool Direct requires a commitment of 5 days a week for 10 months from September to July. Trainees are expected to participate fully in the everyday life of the schools in which they train and, therefore, attendance at occasional evening or extra-curricular events will be expected. \r\n\r\nFurther information can be found on our website http://www.westessexscitt.co.uk/School-Direct-ITT","interviewProcess":"We will be using online video conferencing to recruit. Interviews will be offered and conducted using ZOOM\r\n\r\nThe selection process is as follows: \r\n\r\n•\tYou will be invited to conduct a 10 minute presentation. You will be asked to prepare a maths activity and deliver it as though you are presenting it to a group of Primary aged pupils. This will be followed by a more formal 30 minute interview\r\n\r\n•\tCandidates who are considered to have sufficient proficiency in English and Maths will be considered suitable for the programme and will then be asked to make contact with and visit partner schools in order to confirm their main placement school.\r\n\r\nCandidates who are successful at interview and have secured a placement in a partner school, are offered a conditional place. These are subject to: \r\nSatisfactory references and satisfactory medical assessment. Disclosure and Barring Service (DBS) check and National and Local Terms and Conditions of Employment. \r\n\r\nIt is the duty of all schools to protect vulnerable children and adults. If you are offered a place on the programme, a DBS check is a vital entry requirement for this training programme. ","howSchoolPlacementsWork":"The School Direct training programme path into teaching is a great way to gain the qualifications and practical skills you need to become a teacher. It enables those who have finished a degree, to combine teacher training with actually doing and learning on the job, focusing on the core content framework, Teachers’ Standards and leading to the award of Qualified Teacher Status (QTS). The award of the Post Graduate Certificate of Education (PGCE) is validated by the University of Derby.\r\n\r\nWe work closely with over 20 schools across Epping, Waltham Abbey, Abridge, Loughton, Buckhurst Hill and Harlow. We also have new schools joining us on a regular basis.\r\n\r\nWe will do everything we can to help find a school that is best suited to your needs.\r\n\r\nTrainees will train in their main placement school from September to July. There will be a short contrast placement which takes place after Christmas and lasts 5 weeks.\r\n\r\nFollowing the interview, we will make suggestions of the schools suitable for your requirements and support you in making contact with these schools, in order for you to arrange a visit.\r\n\r\nA list of our partner schools is available on our website: http://www.westessexscitt.co.uk/Partner-Schools/","personalQualities":"We are looking for outstanding candidates who can demonstrate a real aptitude for teaching. Applicants must possess: \r\n\r\n. a love of children and education \r\n\r\n. good personal skills \r\n\r\n. good levels of communication \r\n\r\n. enthusiasm and be hard working \r\n\r\n. desire to be the best that they can be\r\n","otherRequirements":"Applicants who are successful at interview, are offered a conditional place. These are subject to: \r\n\r\nSatisfactory references and satisfactory medical assessment. \r\nDisclosure and Barring Service (DBS) check and National and Local Terms and Conditions of Employment. \r\n\r\nIt is the duty of all schools to protect vulnerable children and adults. If you are offered a place on the programme, a DBS check is a vital entry requirement for this training programme.","status":1,"createdAt":"2021-07-29T15:13:38.685Z","updatedAt":"2021-09-28T08:51:19.679Z","canSponsorStudentVisa":"no","cycle":"2024"}
