{"id":"925d2802-c234-4f3a-adea-fe19c12843da","name":"Primary (with Mathematics)","code":"3D2M","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"286cf12f-b3e3-41c5-9f33-2ff7807d2df0","code":"03","name":"Primary with mathematics"}],"locations":[{"id":"67c85493-64de-4e36-b961-5cd66d72f3ad","name":"Main Site","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"dc3ff7c7-c0ad-4a3c-8a08-bd7cfae33429","code":"2J6","name":"Red Kite Primary School Direct (Leeds)"},"accreditedBody":{"id":"4b15c2df-7f1b-4210-ba42-b1f14381e87b","code":"2B9","name":"Red Kite Teacher Training"},"profPost":"BO","english":"1","maths":"1","science":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feeDetails":"We are unable to sponsor Tier 2 visas.","financialSupport":"Many Trainees apply for student finance in order to pay their fees with a Tuition Fee Loan and have access to Maintenance Loan. Additional financial support may be available if you’re a parent or have a disability.\r\n\r\nRed Kite offers a monthly payment schedule for those planning to self-finance.\r\n\r\n","aboutCourse":"The Primary with Mathematics course provides a broad range of teaching experience across Key Stages 1 and 2 plus the benefit of additional leadership of Maths training, with a view to you becoming a Maths leader.\r\n\r\nAs with all Red Kite Primary courses, you’ll develop the skills to teach any Primary age group, but this course will give you the opportunity to specialise in teaching Maths during your placements.\r\n\r\nYou’ll enjoy working with many inspirational teachers from across the partnership, including exceptional Primary Maths leaders, and you’ll work with the Yorkshire Ridings Maths Hub where you will develop your maths subject knowledge, pedagogy and be prepared to lead Maths within Primary school.\r\n\r\nYou’ll see how teachers continuously strive to improve practice in the classroom and enable progression across the full range of Primary year groups. You’ll also develop inspirational and innovative techniques to enthuse and engage young people.","interviewProcess":"For the foreseeable future, interviews will be held virtually on Microsoft Teams. Interviews are conducted by representatives from Red Kite Teacher Training and partnership schools.\r\n\r\nPreparation for the interview will include to plan for a pupil activity.\r\n\r\nYou will be given the opportunity to meet current trainees and course leaders. \r\n\r\nWhen it is possible to access schools freely, we shall ask that you conduct a pupil activity and complete a written English test.","howSchoolPlacementsWork":"We have a large partnership of schools, meaning our trainees have flexibility when it comes to placements. Our trainees can also benefit from the placements our partners can offer, which can vary from rural settings to the buzz of the city.\r\n\r\nWhen allocating main placements, we consider trainee preferences, transport and location. Our dedicated team work hard to organise placements early, giving you as much time as possible to make arrangements.\r\n\r\nAll trainees undertake two main placements. The first placement runs from the first day of the Autumn Term until December. The second placement, in a contrasting school environment, runs from January until late June.\r\n\r\nTrainees will also take part in mini placements across the year, which give trainees a unique opportunity to broaden their experience in a range of schools and contexts.\r\n","personalQualities":"\r\n* Passionate about making a difference to the lives and development of young people\r\n* Independent, resilient and adaptable\r\n* Friendly and approachable, with the ability to engage young people\r\n* Enthusiastic about their subject and are continuing to develop their subject knowledge\r\n* Creative and imaginative\r\n* Good organisational skills and excellent time management skills\r\n* Reflective and strive to improve their own practice\r\n* High standards of spoken and written English\r\n* Demonstrate a professional attitude\r\n* Have made a considered and informed decision to train to teach\r\n","otherRequirements":"Experience of being in a school and/or working with young people is not essential, however, it will be beneficial during the application process. You can contact us to arrange experience within a school.\r\n\r\nAdmission is dependent upon satisfactory medical examination conducted by Red Kite's preferred supplier.\r\n\r\nCandidates who are offered a place on the course are required to complete a declaration regarding any criminal convictions.\r\n\r\nCandidates are required to obtain clearance from the Disclosure and Barring Service (DBS) regarding their suitability for work involving children. Successful candidates will have these checks conducted at the expense of Red Kite.\r\n","status":2,"createdAt":"2021-07-06T10:54:28.439Z","canSponsorStudentVisa":"no","cycle":"2024"}
