{"id":"2ff1c4ff-5d65-45e6-a385-baa4282e6ff9","name":"Primary","code":"3FCJ","qualification":"pgce_with_qts","startDate":"2024-05-31T23:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"TA","fundingType":"apprenticeship","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"dfc81c1c-b772-4394-9207-814920395995","name":"Westdene Primary School  Brighton","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"224fdd23-b0ce-4eb5-b7aa-921720092234","code":"1BK","name":"The Millais Alliance"},"accreditedBody":{"id":"d2ba71f2-c125-4d86-bb22-736e67043120","code":"B72","name":"University of Brighton"},"profPost":"PG","degreeGrade":"9","english":"1","maths":"1","science":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"4 terms","feesUK":null,"aboutCourse":"If you are applying for this apprenticeship route, the chances are that your school has agreed to provide a place for you and the course details are already known to you. \r\nIf this is not the case, please do not apply.\r\n\r\nThis course includes a PGCE.","interviewProcess":"If you have applied for an employment-based place with us, you need to expect two interview stages - the first with the university, the second with the school offering the place.\r\n\r\nThe university interview will be with staff from the School of Education and the department of your subject. They will also want to check your documentation to ensure you are eligible and compliant, so it’s worth looking for the originals of GCSE, degree and marriage certificates before that interview. If you haven’t got them, or haven’t yet finished your degree, you will be given time to order copies and showing then mot the university will become part of any conditional offer you might be made. Copies can take up to six weeks and there is a charge, so factor that in to your planning.\r\nIf successful at the university stage, you will then be invited to a school-based interview which will take two to three hours. You will be expected to:\r\n\r\n-\tteach a short part of a lesson on a specific topic; you'll be given  information as to the numbers in the group, their ability and the point they are at in that topic.\r\n-\tgive a short presentation to the interview panel – this is likely to consist of senior subject and leadership staff, possibly the Headteacher\r\n-\tcomplete a written task\r\n\r\nIf you are unsuccessful at the university stage, it is unlikely that the school will proceed any further with your application.\r\n","howSchoolPlacementsWork":"You will need a six-week second placement which must be in a contrasting key stage.","personalQualities":"We are looking for ambitious trainee teachers who are passionate and enthusiastic about their subject and have a desire to share that with young people of all abilities in this particular age range. Strong subject knowledge will make your training year easier. \r\nYou must like working with young people and making a difference to their lives; resilience and patience are also key qualities.\r\nAlthough school experience is no longer a compulsory requisite, we do feel that you should have a basic understanding of the challenges of education before you commence your training.\r\n","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:48:11.638Z","updatedAt":"2021-12-08T08:38:33.437Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024"}
