{"id":"9d0e5746-2c1e-460b-ad1f-a57088ec51c4","name":"Modern Languages","code":"L455","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"other","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"ce8523ef-9236-4cd9-b260-d826c7a521b3","code":"ML","name":"Modern Languages"},{"id":"9727f674-61ba-4efa-b1f2-21ec7e354442","code":"15","name":"French"},{"id":"fbb00c08-2dbc-4f26-adb3-3b23afba18c1","code":"17","name":"German"},{"id":"e34fd2a3-a32e-44e9-aea1-666badf3ac03","code":"22","name":"Spanish"}],"locations":[{"id":"dcae929e-ecf1-4f5f-89fd-3c2e5e984be9","name":"Tanbridge House School","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"224fdd23-b0ce-4eb5-b7aa-921720092234","code":"1BK","name":"The Millais Alliance"},"accreditedBody":{"id":"3f5b1139-3651-4ee5-845c-54cd9e999b08","code":"C58","name":"University of Chichester"},"profPost":"PG","degreeGrade":"9","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"A good honours degree","english":"3","maths":"3","science":"9","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feeDetails":"Please see the University of Chichester PGCE section for any further detail.","financialSupport":"The Millais Alliance does not offer any further financial support.","aboutCourse":"Students appreciate the creative and modern approach to language teaching provided by the Modern Languages course.\r\n\r\nContent includes thorough coverage of National Curriculum and assessment requirements combined with a focus on creativity in lesson planning and delivery.\r\n\r\nStudents will develop their understanding of how children acquire additional languages and how to best support their learning in listening, speaking, reading and writing.\r\n\r\nParticular attention is paid to the effective teaching of grammar to young learners and to the development of independent learners.  \r\n\r\nStudents will develop a range of strategies to motivate young learners effectively, including through the use of song, drama and ICT.\r\n\r\nAs part of the course students spend some time observing in Key Stage 2 and benefit from joint training with students on the Primary PGCE MFL specialism. \r\n\r\nThere are opportunities for students to continue to improve their second foreign language.\r\n\r\nSessions are delivered at the Bognor Regis campus but also include a number of off-site visits to local partnership schools; there are also opportunities to benefit from the expertise of visiting speakers.\r\n\r\nOur course includes a well-respected summer conference to which prospective, current and past students are invited along with local teachers, and which provides the opportunity to hear a number of national speakers present on a variety of engaging and thought-provoking topics. \r\n\r\nThe Modern Foreign Languages modules are complemented by a Professional Studies programme, which is also based at Bognor Regis. \r\n\r\nThere is also the option to gain some experience at Key Stage 2. The subject specific element of the course is delivered at our Bognor Regis Campus. \r\n\r\nNote that The Weald is the only school with an 11-18 age range. Tanbridge is 11-16.","interviewProcess":"If you have applied for a School Direct place with us, you need to expect two interview stages - the first with the university, the second with the school offering the place.\r\n\r\nThe university interview will be with staff from the School of Education and the department of your subject. They will also want to check your documentation to ensure you are eligible and compliant, so it’s worth looking for the originals of GCSE, degree and marriage certificates before that interview. If you haven’t got them, or haven’t yet finished your degree, you will be given time to order copies and showing then mot the university will become part of any conditional offer you might be made. Copies can take up to six weeks and there is a charge, so factor that in to your planning.\r\nIf successful at the university stage, you will then be invited to a school-based interview which will take two to three hours. You will be expected to:\r\n-\tteach a short part of a lesson on a specific topic; you'll be given  information as to the numbers in the group, their ability and the point they are at in that topic.\r\n-\tgive a short presentation to the interview panel – this is likely to consist of senior subject and leadership staff, possibly the Headteacher\r\n-\tcomplete a written task\r\nIf you are unsuccessful at the university stage, it is unlikely that the school will proceed any further with your application.","howSchoolPlacementsWork":"On the School Direct route, you have applied to train at a specific school and, following interview, have been offered and accepted a place at that school. You therefore know where your first school will be, unlike those on the PGCE route. \r\nYou will start at your school in mid-late September and will have a few days of  induction to settle you in. You'll stay at this school until February half term and will be there most of the week; on some weeks you may have additional training days at university. You'll be very much part of the school and the more you join in, the more you'll get out.\r\nAfter February half term, you will move to another school for your short  second placement which lasts for most of the second half of the spring term. This second placement is sorted by the Lead school late in the Christmas term and under the directive given by the ITT criteria, must provide a contrasting experience to your host school.  As with all second placements, you must expect up to 40 minutes travel.\r\nIf you have a child in a school in the partnership, you wouldn't be placed there, so please make this known early on. \r\nYou will return to your host school for the last week of the Spring term and the first half of the summer term when your training year will finish. You would expect to be awarded QTS (Qualified Teacher Status) towards the mid/end of June.","personalQualities":"We are looking for ambitious trainee teachers who are passionate and enthusiastic about their subject and have a desire to share that with young people of all abilities in this particular age range. Strong subject knowledge will make your training year easier. \r\nYou must like working with young people and making a difference to their lives; resilience and patience are also key qualities.\r\nAlthough school experience is no longer a compulsory requisite, we do feel that you should have a basic understanding of the challenges of education before you commence your training.\r\n","otherRequirements":"DBS checks will be carried out by the university for those on the SD tuition route.","status":1,"createdAt":"2021-07-06T10:48:12.027Z","updatedAt":"2021-10-08T10:10:59.195Z","canSponsorStudentVisa":"yes","cycle":"2024","applicationsOpenDateOther":"2021-10-15T00:00:00.000Z"}
