{"id":"005bbe28-4b14-43ab-aee1-b2a1def91367","name":"Primary (5-11)","code":"E723","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"a02aa81f-5988-4c88-85c1-816f19f557c4","name":"St Andrew's Teaching School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"4847b31d-34c2-4976-af76-2295a7174410","code":"2C7","name":"St Andrew’s Alliance"},"accreditedBody":{"id":"9d03acb4-95ce-41e1-8458-0b4bec147b6b","code":"M20","name":"The University of Manchester"},"profPost":"PG","degreeGrade":"0","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"Currently, the University of Manchester does not offer equivalency tests, but would accept equivalency tests from these providers:\n\nhttps://www.equivalencytesting.com/\n\n\nhttps://www.bcu.ac.uk/education-and-social-work/initial-teacher-training/gcse-equivalency-test/gcse-equivalency-tests-non-bcu-applicants\n\nhttps://astarequivalency.co.uk/\n\n\n\nCandidates are required to have two A levels at grade c or above.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"St Andrew's Teaching School Alliance offers:\r\n* A demanding and intensive course which will lead to a recommendation of Qualified Teacher Status (QTS) and a Postgraduate Certificate of Education (PGCE 5-11) accredited by the University of Manchester.\r\n* The highest quality of support and mentoring from experienced teachers and school mentors. \r\n* 120 days in two contrasting schools, observing, planning and teaching. \r\n* Opportunity to scrutinise a specialist area of practice. \r\n* A focus on the latest research in pedagogy and teaching methods. \r\n* A well planned programme of professional practice studies.  \r\n* The first steps on a path of career development. \r\n* The opportunity to become an outstanding teacher. ","interviewProcess":"On application, candidates should demonstrate the following: \r\n* a commitment to and understanding of primary education\r\n*  suitable personal and presentational qualities\r\n* the ability to communicate clearly in spoken and written English with a good understanding of grammar.\r\n\r\nOur rigorous selection processes ensure we recruit high quality trainees. Candidates whose initial applications meet our criteria will be invited for an interview. \r\n\r\nAt interview, candidates will be asked to deliver a short presentation before being interviewed by a panel.\r\n\r\nThe interviewers will be assessing the following important skills and qualities for intending primary teachers: \r\n\r\n* Interpersonal skills \r\n* Presentation skills and ability to communicate orally in Standard English\r\n* The ability to inspire and motivate primary pupils \r\n* Knowledge of curriculum areas\r\n* Enthusiasm for teaching \r\n* Evidence of creative thinking\r\n\r\nSuccessful candidates will be enthusiastic and passionate about delivering the best possible outcomes for pupils.  They will demonstrate that they are dynamic, motivated and analytical and that they can relate well to children.","howSchoolPlacementsWork":"Trainees on our School Direct programme complete school experience placements in two different schools, teaching different age phases in each setting.\r\n\r\nAdditionally, trainees will gain school experience in EYFS, SEND and KS3 settings.","personalQualities":"* To be friendly and personable.\r\n* A passion to teach and inspire children.\r\n* To be able to communicate clearly.\r\n* Strong work ethic and excellent organisational skills. \r\n* Creativity and the ability to think 'on your feet'.\r\n\r\n\r\n","otherRequirements":"Offers will be subject to a successful interview, as well as a Health Check Statement and an Enhanced Disclosure from the Disclosure and Barring Service.\r\n\r\nStrong references.\r\n\r\nRelevant experience in a primary school setting within the last twelve months is beneficial for your application but not essential.","status":1,"createdAt":"2021-07-06T10:54:19.735Z","updatedAt":"2021-09-24T15:53:04.893Z","canSponsorStudentVisa":"yes","cycle":"2024"}
