{"id":"44d8ec84-c79a-4c81-a905-415e1e3cc656","name":"Biology (SEND)","code":"L130","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"yes","subjects":[{"id":"322cfc19-d51d-45db-91e3-bd7b4738470f","code":"C1","name":"Biology"}],"locations":[{"id":"fe287042-f2ab-4229-81c4-8719b9b77974","name":"Yorkshire Inclusive TSA at John Jamieson School","isPublished":"N","status":"N","vacancies":"F"},{"id":"5baf2cb4-3328-4204-bee6-e0b2347a8b8b","name":"Oakfield Park School","isPublished":"N","status":"N","vacancies":"F"},{"id":"5a82a3ae-44da-4ca5-b29a-077bb8e7e03e","name":"NW SILC Penny Fields","isPublished":"N","status":"N","vacancies":"F"},{"id":"c193a48c-802a-4808-82aa-bc1414e5504d","name":"Benton Park School","isPublished":"N","status":"N","vacancies":"F"},{"id":"708abf07-99f2-49b9-8f07-d25a697ba6d7","name":"The Woodlands Academy","isPublished":"N","status":"N","vacancies":"F"},{"id":"d4bf7513-a00d-483b-95e2-bab80c928b11","name":"NW SILC Green Meadows","isPublished":"N","status":"N","vacancies":"F"},{"id":"38b73309-a675-4d82-be88-2c542dc61fdb","name":"North Ridge Community School","isPublished":"N","status":"N","vacancies":"F"},{"id":"c7d9d8c2-160d-4c84-9686-3fee9192d416","name":"Mowbray School","isPublished":"N","status":"N","vacancies":"F"},{"id":"ec474e2f-7876-4c09-a517-4fd634317d0e","name":"West SILC","isPublished":"N","status":"N","vacancies":"F"},{"id":"8d954939-c44f-4181-837c-0ebf663c9c3c","name":"Rossett School","isPublished":"N","status":"N","vacancies":"F"},{"id":"5891e0b4-d657-44a4-a93d-1e09920ba3a8","name":"South Craven","isPublished":"N","status":"N","vacancies":"F"},{"id":"d4afb0b6-ac85-4917-ae25-26fdcdcc05b7","name":"Roundhay School","isPublished":"N","status":"N","vacancies":"F"},{"id":"887096a9-cac9-41fa-b390-2881c5b809a0","name":"Springwater School","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"2a9e902c-11f5-47fe-9b7e-1eaefe052133","code":"1ER","name":"Yorkshire Inclusive TSA"},"accreditedBody":{"id":"4b15c2df-7f1b-4210-ba42-b1f14381e87b","code":"2B9","name":"Red Kite Teacher Training"},"profPost":"PG","english":"3","maths":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feeDetails":"We are unable to sponsor Tier 2 visas.","financialSupport":"Many Trainees apply for student finance in order to pay their fees with a Tuition Fee Loan and have access to Maintenance Loan. Additional financial support may be available if you’re a parent or have a disability.\r\n\r\nRed Kite offers a monthly payment schedule for those planning to self-finance.\r\n","aboutCourse":"This high-quality programme is designed for entrants to the teaching profession who aspire to teach in special schools or to become Special Educational Needs Coordinators in mainstream schools.\r\n\r\nYou will learn how to teach Biology in a way that inspires and nurtures fascination in the living world, developing the well-rounded scientists of the future all within the 11-16 age range. Our courses also include post 16 enhancement where you will develop your understanding of post 16 teaching.\r\n\r\nOn the course, you’ll work in schools with exceptional teachers to develop your subject knowledge in everything from genetics to ecology and evolution. You’ll also spend time learning how to teach Chemistry and Physics to Key Stage 3, broadening your skill set to be able to teach secondary Science.\r\n\r\nBy the end of the programme, you will have worked in five different science departments. Trainees will be equipped to teach in both mainstream and special schools, and will also gain the foundations of special educational needs to consider training further for a special needs coordinator role, having had specific training on:\r\n\r\n* SEN policy and legislation\r\n* Inclusive practice and understanding the pupil as a learner\r\n* Differentiation\r\n* Behaviour management, including de-escalation techniques\r\n* Communication, including the use of assistive technology to support learning and teaching\r\n* Knowledge and experience of special school curricula\r\n* Detailed understanding of barriers to learning\r\n* New models of assessment\r\n\r\nThe programme will be delivered by outstanding practitioners from across our mainstream and special school partnership. Trainees will experience placements in both mainstream and special school settings. If you are currently working in a special school you may be able to have a placement with them but we also have placements in special schools from across our region.","interviewProcess":"For the foreseeable future, interviews will be held virtually on Microsoft Teams.\r\n \r\nPreparation for the interview will include:\r\n\r\n* Workload prioritisation activity\r\n* Plan for a pupil activity\r\n\r\nYou will be given the opportunity to meet current trainees and course leaders. \r\n \r\nWhen it is possible to access schools freely, we shall ask that you conduct a pupil activity and complete a written English test.","howSchoolPlacementsWork":"We have a large partnership of schools, meaning our trainees have flexibility when it comes to placements. Our trainees can also benefit from the placements our partners can offer, which can vary from rural settings to the buzz of the city. \r\n \r\nWhen allocating main placements, we consider trainee preferences, transport and location. Our dedicated team work hard to organise placements early, giving you as much time as possible to make arrangements.\r\n \r\nAll trainees undertake two main placements. The first placement runs from the first day of the Autumn Term until December. The second placement, in a contrasting school environment, runs from January until late June. \r\n \r\nTrainees will also take part in mini placements across the year, which give trainees a unique opportunity to broaden their experience in a range of schools and contexts.\r\n","personalQualities":"\r\n* Passionate about making a difference to the lives and development of young people\r\n* Independent, resilient and adaptable\r\n* Friendly and approachable, with the ability to engage young people\r\n* Enthusiastic about their subject and are continuing to develop their subject knowledge\r\n* Creative and imaginative\r\n* Good organisational skills and excellent time management skills\r\n* Reflective and strive to improve their own practice\r\n* High standards of spoken and written English\r\n* Demonstrate a professional attitude\r\n* Have made a considered and informed decision to train to teach\r\n","otherRequirements":"Experience of being in a school and/or working with young people is not essential, however, it will be beneficial during the application process. You can contact us to arrange experience within a school.\r\n \r\nAdmission is dependent upon satisfactory medical examination conducted by our preferred supplier. \r\n \r\nCandidates who are offered a place on the course are required to complete a declaration regarding any criminal convictions. \r\n \r\nCandidates are required to obtain clearance from the Disclosure and Barring Service (DBS) regarding their suitability for work involving children. Successful candidates will have these checks conducted at our expense.\r\n","status":2,"createdAt":"2021-07-06T10:51:45.307Z","canSponsorStudentVisa":"no","cycle":"2024"}
