{"id":"a270ccd3-d14f-4065-be80-b9ae6f75bbbd","name":"Primary","code":"N743","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"ba7dd117-d296-4f3c-a9ec-8f9a110fd8ea","name":"Yorkshire Inclusive TSA","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"2a9e902c-11f5-47fe-9b7e-1eaefe052133","code":"1ER","name":"Yorkshire Inclusive TSA"},"accreditedBody":{"id":"4808c596-11e0-4586-8cb4-116a1d9838b3","code":"E65","name":"Educate Group Initial Teacher Training"},"profPost":"PG","english":"3","maths":"3","science":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feesInternational":9250,"feeDetails":"The QTS programme with PGCE costs £9,250, for which a student tuition fee loan can be accessed.","financialSupport":"Financial support for 2021 to 2022 will be announced soon. Further information is available on Get Into Teaching.","aboutCourse":"All trainees spend a full-time year teaching and training in schools, but also attend provider-led lecture/workshop sessions to enhance understanding of Primary classroom practice. Centralised, core training days cover content such as Behaviour Management, an Environment for Learning, Planning and Adaptive Teaching, Assessment, Diversity, Inclusion, Special Educational Needs and Disabilities and e-safety. This is supplemented by a programme of Primary curriculum subject knowledge (including Phonics), delivered in schools and directly related to the realities of the classroom. All trainees submit three assignments throughout the year:\r\n1.\tA School Based Independent Study (a Child Study)\r\n2.\tTeaching and Learning through a Scheme of Work\r\n3.\tEffective Assessment Strategies\r\nTrainees are supported to improve their knowledge, understanding and application of the Educate Initial Teacher Education (ITE) Curriculum, leading to the development of classroom practice skills and their professional teaching role. Final assessment is made on a trainee’s ability to meet the Teachers’ Standards.\r\n","interviewProcess":"After application, suitable candidates are invited to a selection event at Alwoodley Primary School in Leeds, although please note that a trainee may be placed in any school across our alliance. The selection event will consist, as a minimum, of\r\n•\tthe assessment of personal qualities and attributes\r\n•\tassessment of the ability to communicate effectively\r\n•\tan assessment of the literacy and numeracy skills required to teach\r\n•\tan evaluation of current educational knowledge and understanding\r\n•\ta presentation\r\n•\tan interview. Candidates are interviewed by school senior leaders and/or Educate Teacher Training personnel.\r\nCurrently, all interviews are being held on-line.\r\n","howSchoolPlacementsWork":"Trainees are placed in a main training school for the majority of their training, but spend six weeks in a contrasting school immediately after Christmas. Primary (3-11) trainees choose whether to focus their training on the 3-7 or 5-11 age range and this determines the age of the pupils they will teach in the two main placements.\r\nTraining should never cover fewer than 4 school year groups and so ample provision is made to meet this criteria and to ensure that trainees experience a suitable range of placement enhancement in their main and other schools. All Primary trainees spend at least one day in a 0-3 setting, in a Special School or PRU and in a Secondary School. They also visit a school with good EAL provision if this is not experienced in their main or contrasting school.\r\n","personalQualities":"We are looking for confident and capable applicants who demonstrate true commitment to a teaching career and a robust, determined, positive attitude. We are looking for trainees who can fit very well into their school team, who can respond positively to feedback and who can make a valuable contribution to school life. We are not looking for a ‘finished product’ but for trainees who demonstrate real potential to succeed. Candidates should be able to communicate effectively with a whole range of people and be engaging, warm and sociable. They should be organised, prepared and professional.","otherRequirements":"Enhanced Criminal Record Check.","status":2,"createdAt":"2021-07-06T10:51:45.499Z","canSponsorStudentVisa":"no","cycle":"2024"}
