{"id":"ab18a4b5-22a9-480f-9b49-036ccd2a4842","name":"Mathematics","code":"C001","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"72345aa7-096c-488f-8649-085b8178cadb","code":"G1","name":"Mathematics"}],"locations":[{"id":"ba7dd117-d296-4f3c-a9ec-8f9a110fd8ea","name":"Yorkshire Inclusive TSA","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"2a9e902c-11f5-47fe-9b7e-1eaefe052133","code":"1ER","name":"Yorkshire Inclusive TSA"},"accreditedBody":{"id":"4b15c2df-7f1b-4210-ba42-b1f14381e87b","code":"2B9","name":"Red Kite Teacher Training"},"profPost":"PG","english":"3","maths":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","aboutCourse":"A salaried programme offers you exactly the same opportunity as the fee-funded programme, except that you will earn a salary whilst training to become a qualified teacher.  You’ll be paid and taxed as an unqualified teacher.  You will not be entitled to a bursary or a student loan, but neither will you pay any course fees!\r\n\r\nBefore applying for this course, you should have an agreement with the school that is prepared to employ you during your training year.\r\n\r\nThe Secondary Maths course will build on your subject knowledge and give you the skills you need to teach Maths at GCSE and A Level. When you love everything about Maths, you’re already well on your way to becoming an inspiring Maths teacher!\r\n\r\nOur specialist Maths teachers have years of experience and strategies to use in the classroom. They’ll work with you to plan your lessons to make sure you’re answering the BIG questions and using key words, so students become familiar with them and what is expected of them in response.\r\n\r\nYou’ll be able to look for evidence of learning, offer constructive feedback and use questioning for depth of understanding.\r\n\r\nMisconceptions and errors can be golden opportunities – learn how to use them to your advantage!\r\n","interviewProcess":"For the foreseeable future, interviews will be held virtually on Microsoft Teams.\r\n \r\nPreparation for the interview will include:\r\n\r\n* Workload prioritisation activity\r\n* Plan for a pupil activity\r\n\r\nYou will be given the opportunity to meet current trainees and course leaders. \r\n \r\nWhen it is possible to access schools freely, we shall ask that you conduct a pupil activity and complete a written English test.","howSchoolPlacementsWork":"We have a large partnership of schools, meaning our trainees have flexibility when it comes to placements. Our trainees can also benefit from the placements our partners can offer, which can vary from rural settings to the buzz of the city. \r\n \r\nWhen allocating main placements, we consider trainee preferences, transport and location. Our dedicated team work hard to organise placements early, giving you as much time as possible to make arrangements.\r\n \r\nAll trainees undertake two main placements. The first placement runs from the first day of the Autumn Term until December. The second placement, in a contrasting school environment, runs from January until late June. \r\n \r\nTrainees will also take part in mini placements across the year, which give trainees a unique opportunity to broaden their experience in a range of schools and contexts.\r\n","personalQualities":"\r\n* Passionate about making a difference to the lives and development of young people\r\n* Independent, resilient and adaptable\r\n* Friendly and approachable, with the ability to engage young people\r\n* Enthusiastic about their subject and are continuing to develop their subject knowledge\r\n* Creative and imaginative\r\n* Good organisational skills and excellent time management skills\r\n* Reflective and strive to improve their own practice\r\n* High standards of spoken and written English\r\n* Demonstrate a professional attitude\r\n* Have made a considered and informed decision to train to teach\r\n","otherRequirements":"Experience of being in a school and/or working with young people is not essential, however, it will be beneficial during the application process. You can contact us to arrange experience within a school.\r\n \r\nAdmission is dependent upon satisfactory medical examination conducted by our preferred supplier. \r\n \r\nCandidates who are offered a place on the course are required to complete a declaration regarding any criminal convictions. \r\n \r\nCandidates are required to obtain clearance from the Disclosure and Barring Service (DBS) regarding their suitability for work involving children. Successful candidates will have these checks conducted at our expense.\r\n","status":2,"createdAt":"2021-07-06T10:51:44.819Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"The salary is up to the employing school, but starts at a minimum of £18,169."}
