{"id":"d63764fa-3087-4155-85f0-f4325006f733","name":"Primary","code":"V257","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"72d87f94-9c21-47d2-90a4-52ae630fcc39","name":"Yorkshire Inclusive TSA at Parkinson Lane Community Primary School","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"2a9e902c-11f5-47fe-9b7e-1eaefe052133","code":"1ER","name":"Yorkshire Inclusive TSA"},"accreditedBody":{"id":"74d0e1b3-80ac-4a0e-b93d-f19cb6587144","code":"1WK","name":"Kirklees and Calderdale SCITT"},"profPost":"PG","english":"3","maths":"3","science":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feesInternational":9250,"feeDetails":"The course fees for 2020 are as follows:\r\nStudent type\tFees to pay\r\nUK students\t£9,250\r\nEU students\t£9,250\r\nThe tuition fees for the Parkinson Lane School Direct Partnership (Calderdale) programme are £9,250.\r\n","financialSupport":"Financial support\r\nYou may also be eligible for a loan while you study – note that you’ll have to apply for undergraduate student finance.\r\nFind out about financial support if you’re from outside the UK.\r\nFinancial support from the training provider\r\nOur partner provider, Kirklees and Calderdale SCITT, are able to provide information on financial matters relating to your application. Please email training@kcscitt.com\r\n","aboutCourse":"Parkinson Lane School Direct Partnership (Calderdale) has:\r\n\r\nA track record of supporting and bringing new teachers into the profession.\r\n\r\nA committed team of experienced mentors, coaches and tutors providing support throughout the programme.\r\n\r\nA wide range of schools within the partnership offering outstanding training and placements within varying contexts.\r\n\r\nYou’re in school from the first day of term, seen as a staff member by everyone. You’re in one school four days a week to the end of the school year, spending spring half term at a contrasting school. One day a week you’ll be at with our partner ITT provider, Kirklees and Calderdale SCITT, sharing and learning from each other’s experiences. Our model enables you to experience a full year in school and fully appreciate the demands/rewards that brings.\r\nWorking alongside your mentor, you’ll identify your ongoing level of knowledge, skills and experience and from that draw up and work continuously on a training plan. This will involve observing experienced teachers and training activities leading to delivering whole class.\r\nYour core training is extremely diverse from theoretical input to observing excellent practice. We support our trainees throughout their training year, enabling them to be fully prepared for teaching during their training and beyond.\r\nIn order to gain Qualified Teacher Status (QTS) you have to be judged competent against the Teacher Standards.\r\nAssessment includes -\r\n•\tHalf-termly Tutor visit reports\r\n•\t3 termly reports\r\n•\t2nd school placement report\r\n•\t3 Reflection Points (training activities which focus on a group of standards feeding into 2 Assignments)\r\nWe work hard to create a reduced workload approach to assessment, basing many of our judgements on professional dialogue - not paper trails. Assessment is based upon day-to-day practice and should complement your teaching and reduce the amount of additional work required.\r\n","interviewProcess":"Once we receive your application, we’ll acknowledge by email and update UCAS if you are invited to interview. We’ll e-mail or call you with the details.\r\nYou’ll be interviewed at Kirklees & Calderdale SCITT by colleagues from our partnership and the SCITT.\r\nYou’ll be expected to answer a range of questions designed to explore your personal qualities and meeting the course criteria. The interview gives you the opportunity to discuss why you want to teach, what you would bring to the profession, and show us your resilience and initiative. You will be asked to bring a prepared task and you’ll undertake a written task on the day demonstrating your ability to read effectively and communicate clearly and accurately in Standard English.\r\nYou’ll need to bring interview original certificates of all qualifications and proof of identity as part of our Safeguarding processes. If you are successful, we’ll offer you a place. Ideally within 48 hours. We’ll update UCAS and contact you. If you accept, you will visit a partner school as a prospective trainee.\r\nOffers will be subject to an Enhanced DBS which will be organised for you. You will also be subject to the following checks: health, identity, relevant work qualifications, right to work in the UK, professional registration, references and a Childcare Disqualification and Disqualification by Association Declaration. We will carry out a criminal background check and other requisite checks.\r\n","howSchoolPlacementsWork":"We will source and arrange your school placement across our partnership of schools across Calderdale and Kirklees. If you have a school in mind, you’re welcome to approach us about it and we’ll work with you to arrange the best experience for you. You will be placed in a school which we feel will fully support you in your subject specialism.\r\nYou will spend most of the year in one school with a second experience in a contrasting school (usually Christmas to February half term). This enables you to deepen your experience and ensures that you have the opportunity to meet all the Teacher Standards. When in school, you are expected to follow the timings, practices and culture of the school. Having an extended practice in one main school means that you can develop your practice well and show that you have a positive impact on your pupils, in your own classes. We always try to take into consideration the location of our trainees and their placement schools to assist in their daily commute and try to work around other personal situations.\r\n","personalQualities":"We aim to recruit excellent candidates who have the drive and ambition to become outstanding teachers with a passion about improving the lives and development of children. You must demonstrate a passion for working with children, have relevant school experience and show why teaching is for you! You should also have –\r\n•\tExcellent interpersonal skills with a friendly approach\r\n•\tGood organisational skills, time management and responsibility for own professional development\r\n•\tCreativity and imagination\r\n•\tCommitment to teaching and learning\r\n•\tUnderstanding of children as learners and educational issues\r\n•\tUnderstanding the demands of teaching\r\n•\tResilience\r\n","otherRequirements":"We are looking at your potential to train to teach!\r\nOur goal is to ensure that trainees are at least good teachers by the end of the programme. Our professional programme is designed and delivered by School-based practitioners in partnership with Kirklees & Calderdale SCITT.\r\nWe have a track record of successfully supporting new and talented trainees into the profession. Our trainees will receive outstanding support from school based and experienced mentors, tutors and coaches.\r\nThe programme leads to Qualified Teacher Status (QTS) from Kirklees and Calderdale SCITT and a Post-Graduate Certificate of Education (PGCE) from the University of Huddersfield.\r\n","status":2,"createdAt":"2021-07-06T10:51:45.638Z","canSponsorStudentVisa":"no","cycle":"2024"}
