{"id":"f97f41a4-b6e6-4f3c-98ed-cbc44992f369","name":"Drama","code":"33FG","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"69052223-ca45-4781-a8d3-cb92447a6d78","code":"13","name":"Drama"}],"locations":[{"id":"ba7dd117-d296-4f3c-a9ec-8f9a110fd8ea","name":"Yorkshire Inclusive TSA","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"2a9e902c-11f5-47fe-9b7e-1eaefe052133","code":"1ER","name":"Yorkshire Inclusive TSA"},"accreditedBody":{"id":"74d0e1b3-80ac-4a0e-b93d-f19cb6587144","code":"1WK","name":"Kirklees and Calderdale SCITT"},"profPost":"PG","english":"3","maths":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feeDetails":"£9250 for QTS with PGCE. This PGCE element equates to 60 Masters credits which we offer through the University of Huddersfield.\r\n","financialSupport":"Our partner provider, Kirklees and Calderdale SCITT, is able to provide information on financial matters relating to your application.  Please email training@kcscitt.com\r\n","aboutCourse":"Yorkshire Inclusive TSA is training the next generation of outstanding teachers for the Leeds area. We are committed to providing the highest standard of education and we want to recruit student teachers who share the same commitment.  Our current cohort of student teachers is training to teach in primary and secondary in both mainstream and special school settings.\r\n\r\nYou’re in school from the first day of term, seen as a staff member by everyone.  You’re in one school four days a week to the end of the school year, spending Spring half term at a contrasting school.  One day a week you’ll be at our central venue alongside other trainees, sharing and learning from each other’s experiences.  Our model enables you to experience a full year in school and fully appreciate the demands/rewards that brings.\r\n\r\nWorking alongside your mentor, you’ll identify your ongoing level of knowledge, skills and experience and from that draw up and work continuously on a training plan.  This will involve observing experienced teachers and training activities leading to delivering whole class.\r\n\r\nYour core training is extremely diverse from theoretical input to observing excellent practice.  We support our trainees throughout their training year, enabling them to be fully prepared for teaching during their training and beyond.\r\n\r\nYou will benefit from 10 Subject Knowledge days, giving you the opportunity to further enhance your subject knowledge. By the end of the training year you will be fully equipped to deliver your subject from Year 7 to 11 including the GCSE specification.\r\n\r\nIn order to gain Qualified Teacher Status (QTS) you have to be judged competent against the Teacher Standards.  \r\n\r\nAssessment is;\r\n\r\n- Half-termly Tutor visit reports \r\n- 3 termly reports\r\n- 2nd placement report\r\n- 3 Reflection Points (training activities which focus on a group of standards feeding into 2 Assignments)\r\n\r\nWe work hard to create a reduced workload approach to assessment, basing many of our judgements on professional dialogue - not paper trails. Assessment is based upon day-to-day practice and should complement your teaching and reduce the amount of additional work required.\r\n\r\n","interviewProcess":"Once we receive your application, we’ll acknowledge by email and update UCAS if you are invited to interview. We’ll e-mail or call you with the details.  \r\n\r\nYou’ll be interviewed at Kirklees & Calderdale SCITT by colleagues from our Teaching School Alliance and the SCITT.\r\n\r\nYou’ll be expected to answer a range of questions designed to explore your personal qualities and meeting the course criteria.  The interview gives you the opportunity to discuss why you want to teach, what you would bring to the profession, and show us your resilience and initiative.  You will be asked to bring a prepared task and you’ll undertake a written task on the day demonstrating your ability to read effectively and communicate clearly and accurately in Standard English.\r\n\r\nYou’ll need to bring interview original certificates of all qualifications and proof of identity as part of our Safeguarding processes.  If you are successful, we’ll offer you a place. Ideally within 48 hours.  We’ll update UCAS and contact you.  If you accept, you will visit a partner school as a prospective trainee.  \r\n\r\nOffers will be subject to an Enhanced DBS which will be organised for you. You will also be subject to the following checks: health, identity, relevant work qualifications, right to work in the UK, professional registration, references and a Childcare Disqualification and Disqualification by Association Declaration.  We will carry out a criminal background check and other requisite checks.  \r\n\r\n","howSchoolPlacementsWork":"We will source and arrange your school placement within our partnership of schools across West Yorkshire.  If you have a school in mind, you’re welcome to approach us about it and we’ll work with you to arrange the best experience for you.  You will be placed in a school which we feel will fully support you in your subject specialism.  \r\n\r\nYou will spend most of the year in one school with a second experience in a contrasting school (usually Christmas to February half term).  This enables you to deepen your experience and ensures that you have the opportunity to meet all the Teacher Standards.  When in school, you are expected to follow the timings, practices and culture of the school.  Having an extended practice in one main school means that you can develop your practice well and show that you have a positive impact on your pupils, in your own classes.\r\n\r\nWe always try to take into consideration the location of our trainees and their placement schools to assist in their daily commute and try to work around other personal situations.\r\n","personalQualities":"We are looking to recruit high calibre candidates who have:\r\n\r\n•\tExcellent interpersonal skills and a friendly and approachable nature\r\n•\tGood organisational skills and excellent time management and able to take responsibility for own professional development\r\n•\tCommitment to teaching and learning, with a clear educational philosophy\r\n•\tUnderstanding of children as learners and current educational issues\r\n•\tUnderstanding the demands of a school-based route into teaching\r\n•\tResilience\r\n\r\nRecent experience of your subject in a secondary school is preferable in order for you to have a greater understanding of the demands of school life.\r\n","otherRequirements":"Remember, we are looking at your potential to train to teach!\r\n\r\nOur goal is to ensure that all trainees are good or better teachers by the end of the programme.   Our programme is designed and delivered by School-based practitioners in partnership with Kirklees & Calderdale SCITT.\r\n\r\nWe have a track record of successfully supporting new and talented trainees into the profession through the delivery of excellent innovative teacher training programmes.  Our trainees will receive outstanding support from school based and experienced mentors, tutors and coaches.  Trainees will also have ample opportunity to meet, network and share experiences throughout the year.\r\n\r\n\r\n","status":2,"createdAt":"2021-07-06T10:51:44.661Z","canSponsorStudentVisa":"no","cycle":"2024"}
