{"id":"882d8dc6-2f11-4452-8186-f41c1367738e","name":"Primary","code":"U815","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"8d6047c8-6d80-4361-a03a-25a7f312f4b9","name":"Rickleton Primary School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"708e7649-8652-41ba-8b1f-a78a6f9ec3b0","code":"2W4","name":"Washington and Chester le Street Teacher Training Alliance"},"accreditedBody":{"id":"926804ac-be7a-4f0a-97f9-a26a5f5f032a","code":"S84","name":"University of Sunderland"},"profPost":"PG","degreeGrade":"1","english":"1","maths":"1","science":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"Candidates would need to arrange and fund any equivalence tests themselves, ensuring they are of an acceptable level with the University of Sunderland. These must be complete before the commencement of the training year.","courseLength":"OneYear","feesUK":9250,"feeDetails":"The amount providers charge varies – for UK and EU students, it can be up to £9,250 per year for a full-time programme starting in 2018. It’s a big investment, but there’s often funding available to help you.","financialSupport":"We do not offer or arrange student finance, but we can give you information and advice about funding and support to help point you in the right direction.\r\n\r\nScholarships – for certain in-demand subjects, you can apply for a tax-free scholarship to support your training. To be eligible, you will typically need a 2:1 degree or above in the subject you want to teach (or a closely related subject). Visit Get Into Teaching to find out more.\r\n\r\nBursaries – tax-free bursaries are available for training to teach a range of subjects. The level of funding and eligibility will vary depending on the subject you choose to teach, and your degree classification. For more information, visit Get Into Teaching.\r\n\r\nTuition fee and maintenance loans – if you’re not eligible to receive a bursary or scholarship, you can still apply for a student loan to cover your training programme fees and living costs. Find out more from Student Finance England.\r\n\r\nExtra student funding – if you have dependents, you could access further funding to support your teacher training, such as Parents' Learning Allowances, Childcare Grants, or Child Tax Credits. The student finance calculator from Student Finance England allows you to estimate the level of funding that may be available.\r\n \r\nDisabled students and care leavers – universities and colleges have different ways of supporting you in higher education. Check if you are entitled to additional support and funding.","aboutCourse":"Our PGCE course with QTS, is focussed on the Foundation and Primary age range (age 3 to 11). Qualified teacher status is awarded based on 3 periods of in-school assessment across the academic year, alongside University based assignments and evidencing of teaching standards.\r\n\r\nOur trainees will be based in their 'home' school from the first day of the school year, being allocated their own class and teacher mentor for support. Over time, responsibility and percentage of teaching is gradually passed over to the trainee as they find their feet via observation, group teaching and in school learning tasks. Towards the end of term, trainees enter their first assessed period, where teaching delivery and preparation begin to be graded, in order to offer prompts for improvement.\r\n\r\nDuring the Spring term (after Christmas) trainees move to an exchange school (within our local group of schools), fulfilling government training requirements to experience two school settings and a different age range of children. A second assessed period then monitors the continual improvement of our trainees as they complete this middle placement. \r\n\r\nAs they approach the end of their year-long school placement, our trainees return to their 'home' school, to complete a final assessed period, with partnership and university mentors using this period to measure the consistent standard which trainees can reach against the teacher standards document.\r\n\r\nAlongside in school training and assessment requirement, trainees access weekly Friday University lectures and workshops, supporting them to increase their theoretical knowledge of education and to integrate this in to their classroom practice, via a series of assignments and tasks. ","interviewProcess":"We want to ensure that we select trainees capable of reaching the highest standards and who go on to be the outstanding teachers of tomorrow. This process begins at interview, where we want to ensure trainees have the strong basic skills needed to both access the University elements of the course and also to deliver the high level of basic skills which the current National Curriculum requires pupils to achieve.\r\n\r\nWhen we receive an application, which can come at any time across the academic year from October, we will make contact with you in person. If qualifications are at the correct level, you will then be invited for interview. An agreed date will be arranged and a letter outlining some simple interview tasks will be sent, allowing you to be fully prepared.\r\n\r\nThe interview sessions will usually last 1 - 2 hours and may be for one individual or a group of applicants depending on how many applications have been received at that time.\r\n\r\nDuring the interview, the pre-described tasks are designed to assess applicants written and verbal communication skills, with both adults and children. We are interested to know why you hope to enter the profession and the journey you have taken to get there. We also want to see how well you relate to primary age children.\r\n\r\nThe important message about our interview process is that we are not looking for an experienced teacher; we are looking for someone with the potential to be an outstanding one.","howSchoolPlacementsWork":"Term 1 (Sep to Dec) - placement in your home school.\r\nGet to know the profession, school, staff, children in your class etc by being there consistently and living the daily life of a primary school teacher. Experience lessons, planning sessions, curriculum development but also the unseen work of a teacher - registers, duties, visits and visitors, parent communication, staff meetings, after school clubs etc. As you begin to feel at home, your involvement in teaching and planning will gradually increase at a pace comfortable for yourself and the class mentor. The placement will finish with a 5 week assessed period where your teaching will start to be graded in order to highlight your areas of strength and areas for focus.\r\n\r\nTerm 2 (Jan to Mar) - exchange placement in one of our partner schools.\r\nDevelop your abilities by experiencing a new school setting and age group of children. See different routines and experience different teaching styles, safe in the knowledge that the school will still be local and the paper work and expectations are standardised across our partnership. Complete the placement with another 5 week assessed period to monitor how your teaching is progressing and the impact of the new environment on your style and expectations.\r\n\r\nTerm 3 (Apr to June) - return to your home school to complete your final assessed period, where mentors will ascertain the consistent level of your planning and delivery in preparation for your university based grading.\r\n\r\nThroughout the year, your Friday University release day will give you access to the theory and practical guidance you need in order to complete the tasks and assignments required to work alongside your school based placement.","personalQualities":"There are many different qualities which make an outstanding teacher. \r\nWe believe that passion and enthusiasm for the role and someone who thrives on helping children to be the best they can be are the most important.\r\n\r\nThe role of a teacher is one which will require a huge amount of team work and resilience. As a trainee, being open to help and accepting constructive criticism will certainly be of benefit.","otherRequirements":"Safeguarding of all pupils is our utmost priority and, as such, you will be required to undertake a DBS enhanced certificate and check against the working with children barred list.","status":1,"createdAt":"2021-07-06T10:52:01.117Z","updatedAt":"2021-08-29T11:14:20.547Z","canSponsorStudentVisa":"yes","cycle":"2024"}
