{"id":"1fd15d77-25ad-4a30-8c47-eab346f0fb01","name":"Physical Education","code":"2ZB3","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"74d64a54-5e34-4590-b6c7-528dd0cf26fe","code":"C6","name":"Physical education"}],"locations":[{"id":"3b49e238-5af7-4237-a784-13adb07eedb2","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"6165f351-fb9e-4ef5-a638-6ce47fb757d3","code":"1FW","name":"Gladesmore Community School"},"accreditedBody":{"id":"d6961000-f4b7-41cb-9dbd-4da057d9057d","code":"K84","name":"Kingston University"},"profPost":"BO","degreeGrade":"9","additionalDegreeSubjectRequirements":"false","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"PE School Direct Tuition Fee; link university - Kingston Lead by The Hub for Sport and Physical Education @ Kingston University and Gladesmore Community School. This School Direct course combines the best of school and university based teacher education in physical education. This is London’s only physical education specific partnership. The university tutor has worked with the school mentors for many years, with a proven track record of excellence. Virtually all previous trainees completed the course with a Grade 1 (outstanding) or Grade 2 (Good). Employment rates stand at over 98%. ","interviewProcess":"Please read our Entry Profile on the UCAS website carefully. It will tell you what we expect in the way of qualifications, experience and approach.\r\nPlease do not send any details of yourself, nor your applications to the schools. We are only able to process applications via the UCAS system.\r\nPlease note that we do not confirm receipt of applications, although information concerning your application will be updated on the UCAS website\r\n","howSchoolPlacementsWork":"Successful applicants will be in school for most of the year with school experience following an A-B model. However, to ensure continuity, the mentors for the B (assessed) placement will have contact with trainees during the first school experience as schools will work in reciprocal pairs as far as possible. University days will take place at the start of the course with an intense period of subject and PE pedagogy input taking place in September. The university may consider holding a summer school in August to ensure trainees are well prepared to meet the demands of school experience A. Unlike many ITE PE programmes, there will be a heavy practical component to the University based module. These sessions will take place at both a central London venue and a few will take place at Kingston University. Assessment and Qualifications As well as school experience and physical education curriculum modules, trainees will complete the Professional and Academic modules that lead to the award of masters credits upon successful completion. These credits can be used to continue on to a Master’s degree in Research at Kingston University for academically ambitious teachers.","personalQualities":"","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:49:33.938Z","updatedAt":"2021-10-19T13:02:58.133Z","canSponsorStudentVisa":"yes","cycle":"2024"}
