{"id":"97de2bf0-fa57-4229-a1bf-c87212c42d9e","name":"Mathematics","code":"297H","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"72345aa7-096c-488f-8649-085b8178cadb","code":"G1","name":"Mathematics"}],"locations":[{"id":"3b49e238-5af7-4237-a784-13adb07eedb2","name":"Main Site","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"6165f351-fb9e-4ef5-a638-6ce47fb757d3","code":"1FW","name":"Gladesmore Community School"},"accreditedBody":{"id":"9188f17a-79c4-43a9-b459-4952815b739a","code":"M80","name":"Middlesex University"},"english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":null,"aboutCourse":"The Gladesmore Community School Direct Partnership offers incredible opportunities for working and learning. It provides an ideal school based learning opportunity within excellent schools to train as a teacher. This inspirational partnership comprises thirty three schools,  We have a straightforward and powerful vision: To provide an outstanding all round education where all students make impressive progress in a positive, friendly, family community atmosphere. Thus, we create an environment in which staff, pupils and trainee teachers alike feel valued and supported. We have worked with trainee teachers for many years and we fully appreciate how their vibrancy, enthusiasm and drive contribute to the school community. \r\n\r\nSchool Direct requires a commitment of 5 days a week from September to July. Trainees are expected to participate fully in the everyday life of the schools in which they train and, therefore, occasional evening or extra-curricular events will be obligatory.\r\n\r\nFor further details about our training provider: https://www.mdx.ac.uk/courses/degree-apprenticeships/postgraduate-teacher-apprenticeship-qts ","interviewProcess":"There are three parts to the selection process;\r\n•\tThere will be an initial observation of a short teaching activity followed by written tasks including a Maths and English test.\r\n•\tSuccessful candidates will be invited to a more formal interview.\r\nApplicants who are successful at interview, are offered a conditional place. These are subject to:\r\n•\tSatisfactory references and satisfactory medical assessment.\r\n•\tDisclosure and Barring Service (DBS) check.\r\n•\tNational and Local Terms and Conditions of Employment.\r\nIt is the duty of all schools to protect vulnerable children and adults. If you are offered a place on the programme, a DBS check is a vital entry requirement for this training programme.\r\n","howSchoolPlacementsWork":" Supportive and Aspirational In our partnership you will be trained in a carefully structured and aspirational environment. You will develop the rigour, professional knowledge, understanding and skills necessary for creative, purposeful and challenging teaching and learning. Each of the training places is allocated to a particular school within the partnership. Successful applicants will be in school for most of the year with school experience following an A-B model. However, to ensure continuity, the mentors for the B (assessed) placement will have contact with trainees during the first school experience as schools will work in reciprocal pairs as far as possible. ","personalQualities":"Candidates who can demonstrate a real aptitude for teaching. Applicants must possess:\r\n. a love of children and education\r\n. good personal skills\r\n. good levels of communication\r\n. enthusiasm and be hard working\r\n. desire to be the best that they can be\r\n","otherRequirements":"Other requirements\r\nApplicants who are successful at interview, are offered a conditional place. These are subject to:\r\nSatisfactory references and satisfactory medical assessment.\r\nDisclosure and Barring Service (DBS) check and National and Local Terms and Conditions of Employment.\r\nIt is the duty of all schools to protect vulnerable children and adults. \r\n","status":2,"createdAt":"2021-07-06T10:49:33.854Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"We are offering school direct salaried placements to graduates, or those who are looking for a change of career. These places are salaried and are offered with a salary of point 1 unqualified teacher rate. There is no training programme fee due for the School Direct salaried training programme\r\nSchool Direct requires a commitment of 5 days a week for 10 months from September to July. Trainees are expected to participate fully in the everyday life of the schools in which they train and, therefore, occasional evening or extra-curricular events will be obligatory\r\n"}
