{"id":"82e067fe-a2cd-4c5d-8aa1-cc0cb630de38","name":"Mathematics","code":"366K","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"72345aa7-096c-488f-8649-085b8178cadb","code":"G1","name":"Mathematics"}],"locations":[{"id":"6b20071b-a2bd-48b2-b54a-f1889f4923f3","name":"The Burgess Hill Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"7e03e8ae-d5a3-439c-b848-9433674b9c4a","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"},{"id":"0e456741-04ce-43ff-9411-74114f0282ac","name":"The Hastings Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"991ebd0b-1168-490c-9946-08aa437f2877","name":"The St Leonards Academy","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"f8964237-2d91-4b66-a571-9ffb72db6d0a","code":"2FU","name":"University of Brighton Academies Trust School Direct Programme"},"accreditedBody":{"id":"d2ba71f2-c125-4d86-bb22-736e67043120","code":"B72","name":"University of Brighton"},"profPost":"BO","degreeGrade":"9","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":14040,"financialSupport":"The School Direct training programme is funded by tuition fees paid by the trainee. \r\n\r\nFurther information is available here: https://www.brighton.ac.uk/courses/study/school-direct-tuition-and-school-direct-salaried.aspx#fees","aboutCourse":"On the School Direct training programme you’ll graduate with a Postgraduate Certificate in Education (PGCE) from the University of Brighton and Qualified Teacher Status (QTS).\r\n\r\nThis is an intensive year with two-thirds of the course based in our academies and the remainder in university-based lectures, seminars and independent study.\r\n\r\nYou’ll either choose, or be assigned, a host academy where you’ll gain most of your experience and training. Over the year you will also spend time in another academy within the Trust. We believe this will help you to develop as a teacher, by broadening your experience of how different academies work.\r\n\r\nThe programme is offered in all three of our secondary academies:\r\n\r\n* The Hastings Academy has a formidable reputation for high standards and innovation, delivered by a team of talented professional staff. It has  approximately 900 students and hosts a special facility for  young people with speech, language and communication difficulties. \r\n\r\n* The St Leonards Academy is an innovative school with dedicated and determined staff, united by its values. It has approximately 1500 students and hosts a special facility for young people with physical disabilities or severe autism. The academy the highest expectations that each and every child will achieve personal and academic success.\r\n\r\n* At The Burgess Hill Academy students experience an innovative and dynamic approach to learning in all their lessons, as well as high-quality pastoral care. The academy is committed to ensuring that every pupil leaves with the qualifications, enrichment experiences and employability skills they need for life. It has a published admissions number of 240 and total capacity of 1200 students.  \r\n\r\nIn your academy you’ll have a mentor who will meet with you every week to look at where you’re making progress and to set personalised targets for your development.\r\n\r\nYou will receive a thorough induction programme which includes shadowing pupils in order to give you the best preparation for you to begin your teaching journey. Following your induction you will work alongside teachers, often team teaching, in order to get to know your pupils and the subject matter well enough to then take over the classes fully.\r\n\r\nBy training with the University of Brighton Academies Trust you’ll also benefit from networking opportunities with trainees based at our other academies, and when your training is complete our continuing professional development (CPD) programme will help you to enhance your skills as your teaching career develops. ","interviewProcess":"Once we’ve assessed your application, we’ll let you know whether you’ve been selected to attend an interview in person at the University of Brighton’s Falmer campus.\r\n\r\nThe interview will include a number of structured activities aimed at allowing you to show your potential.\r\n\r\nIf your interview at the university is successful, we’ll invite you to attend a further interview at the academy to which you are applying . This will include a pre-planned teaching activity, together with an interview with a member of the academy’s Leadership Team and the appropriate Subject Leader. ","howSchoolPlacementsWork":"Candidates can indicate their preferred academy and this will be met where possible. Your host academy will be confirmed before the programme starts, so that you can arrange accommodation in advance. \r\n\r\nYou will be teaching students aged 11 to 16. \r\n\r\nThe majority of your school placement will be in your host academy. In February you’ll join another academy for 4-6 weeks, then continue at your host academy for the remainder of the year. \r\n\r\nYou will normally attend university based sessions for two days a week; the rest of the time is spent on school placement. \r\n\r\n","personalQualities":"You will need a realistic awareness of the teaching profession with the capacity to thrive in a demanding and fast moving environment. \r\n\r\nWhile experience in a school is not a condition of entry for initial teacher education courses we recommend that you take up opportunities to gain a realistic understanding of whether teaching is right for you.  We may be able to provide you with this opportunity before you decide to apply; alternatively, the Get Into Teaching School Experience Programme offers opportunities across the country to book a day’s worth of experience.","otherRequirements":"All offers of places are subject to a satisfactory health check and a Disclosure and Barring Service (DBS) enhanced check.","status":1,"createdAt":"2021-07-06T10:54:25.649Z","updatedAt":"2021-08-18T13:22:11.370Z","canSponsorStudentVisa":"yes","cycle":"2024"}
