{"id":"84ada71f-5dd0-4aa2-85f6-4bdd8942d8d8","name":"Primary","code":"E166","qualification":"qts","startDate":"2024-05-31T23:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"TA","fundingType":"apprenticeship","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"7e03e8ae-d5a3-439c-b848-9433674b9c4a","name":"Main Site","isPublished":"Y","status":"R"},{"id":"edd7cd67-a324-43f6-81ad-630401f775e0","name":"West St Leonards Primary Academy","isPublished":"Y","status":"R"},{"id":"7d490830-574d-4d20-b0ce-12dd111d0863","name":"The Baird Primary Academy","isPublished":"Y","status":"R"},{"id":"5d5f6506-1ed4-4457-a15a-671f360090b6","name":"Silverdale Primary Academy","isPublished":"Y","status":"R"},{"id":"db592b59-b4c3-47df-b31d-210a552998c7","name":"Robsack Wood Primary Academy","isPublished":"Y","status":"R"},{"id":"b717e4c8-03d3-4e6b-8ccb-09e05a82a229","name":"Pound Hill Infant Academy","isPublished":"Y","status":"R"},{"id":"d9dfe24f-22d8-40ed-9db5-e1abfe993df6","name":"Lindfield Primary Academy","isPublished":"Y","status":"R"},{"id":"8309e019-12f9-4849-8e7e-193ae4aecb78","name":"Holmbush Primary Academy","isPublished":"Y","status":"R"},{"id":"f8f7c3a4-fa03-4b8a-bbf5-8aa21d373024","name":"Hollington Primary Academy","isPublished":"Y","status":"R"},{"id":"d6f33a2c-15bd-4417-8a91-c2992b3dd170","name":"Desmond Anderson Primary Academy","isPublished":"Y","status":"R"},{"id":"23599ad9-fd0d-4d01-9f36-9ebd34a7aae3","name":"Churchwood Primary Academy","isPublished":"Y","status":"R"},{"id":"853fa0c2-69a9-4552-a016-2b6140884181","name":"Blackthorns Community Primary Academy","isPublished":"Y","status":"R"},{"id":"b622aa9d-b422-4c2f-9f85-e2be5538423a","name":"Dudley Infant Academy","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"f8964237-2d91-4b66-a571-9ffb72db6d0a","code":"2FU","name":"University of Brighton Academies Trust School Direct Programme"},"accreditedBody":{"id":"d2ba71f2-c125-4d86-bb22-736e67043120","code":"B72","name":"University of Brighton"},"degreeGrade":"9","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":null,"aboutCourse":"On successful completion of the Postgraduate Teaching Apprenticeship programme you will be awarded the Postgraduate Teaching Apprenticeship Standard that will enable you to gain Qualified Teacher Status (QTS) and a Postgraduate Certificate from the University of Brighton. \r\n\r\nThe Postgraduate Teaching Apprenticeship is open to existing employees of the University of Brighton Academies Trust  and is designed for experienced professionals and graduates aspiring to become a teaching professional. Typical entry roles include a Teaching Assistant or Cover Supervisor.\r\n\r\nThe Postgraduate Teaching Apprenticeship blends workplace learning with part-time university study. You will be based in one of our secondary academies for the duration of the year long apprenticeship, and  80 per cent of your time will be spent engaging in on-the-job school-based training. The remaining 20 per cent will be spent studying through a mix of web-based, face-to-face and independent learning, covering:\r\n\r\n* Subject Knowledge Inputs\r\n* Professional Practice Development\r\n* Contemporary Issues In Education\r\n* Evidence Based Practice\r\n* Professional Knowledge Enquiry\r\n\r\nThe Primary Postgraduate Teaching Apprenticeship programme is offered in all of the Trust's infant and primary academies.\r\n\r\nIn your academy you’ll have a mentor who will meet with you every week to look at where you’re making progress and to set personalised targets for your development.\r\n\r\nYou will receive a thorough induction programme which includes shadowing pupils in order to give you the best preparation for you to begin your teaching journey. Following your induction you will work alongside teachers, often team teaching, in order to get to know your pupils and the subject matter well enough to then take over the classes fully.\r\n\r\nBy training with the University of Brighton Academies Trust you’ll also benefit from networking opportunities with trainees based at our other academies, and when your training is complete our continuing professional development (CPD) programme will help you to enhance your skills as your teaching career develops. ","interviewProcess":"Once we’ve assessed your application, we’ll let you know whether you’ve been selected to attend an interview in person at the University of Brighton’s Falmer campus.\r\n\r\nThe interview will include a number of structured activities aimed at allowing you to show your potential.","howSchoolPlacementsWork":"The majority of your school experience will be in your host academy, where you will receive on the job training. \r\n\r\nYou will be teaching pupils aged 5 to 11. ","personalQualities":"You will need a realistic awareness of the teaching profession with the capacity to thrive in a demanding and fast moving environment. \r\n\r\nWhile experience in a school is not a condition of entry for initial teacher education courses we recommend that you take up opportunities to gain a realistic understanding of whether teaching is right for you.  We may be able to provide you with this opportunity before you decide to apply; alternatively, the Get Into Teaching School Experience Programme offers opportunities across the country to book a day’s worth of experience.","otherRequirements":"All offers of places are subject to a satisfactory health check and a Disclosure and Barring Service (DBS) enhanced check. ","status":1,"createdAt":"2021-07-06T10:54:26.042Z","updatedAt":"2021-08-18T13:43:42.872Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024"}
