{"id":"cd49f9fc-8436-4f8c-a336-fe9cf0110bd2","name":"Primary (3-7)","code":"D853","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"7df759f0-6df7-4a85-97c5-49dc0a5d13aa","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"f1bd8660-b91f-4133-838c-77e9cbc428dc","code":"S17","name":"SCITT in East London Schools (SCITTELS)"},"profPost":"PG","degreeGrade":"9","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Grade 4 (C) or above in English, maths and science, or equivalent qualification\n\nCandidates with pending GCSEs will be considered Equivalency tests will be accepted in English, maths or science.\n\nWe accept:\n\n* https://www.astarteachers.co.uk/gcse-equivalencies-assistance/\n\n* https://www.equivalencytesting.com/\n\n* https://www.bcu.ac.uk/education-and-social-work/initial-teacher-training/gcse-equivalency-test/gcse-equivalency-tests-non-bcu-applicants","courseLength":"OneYear","feesUK":9250,"aboutCourse":"The SCITTELS PGCE (3 to 7 age range) programme is a full time, fee funded, one year programme taught over three terms. It starts at the beginning of September, and follows school term dates. \r\n\r\nDistinctive features of this course:\r\n\r\n* We have a strong commitment to Equal Opportunities and promote this with the utmost importance. Inclusion and anti-racism are key features and strengths of our programmes and we are committed to training teachers who will value and build on the linguistic, religious, ethnic and cultural diversity that children in East London communities bring to school and who in turn, will prepare all children for life in a diverse society. \r\n\r\n* Trainees are mainly based in one school, where they will develop a close working relationship with the staff, pupils and parents. \r\n\r\n* We have a balance of centre-based training in theory and practice with extended school placements where trainees can put this learning into practice.\r\n\r\n* Focus on preparing trainees for teaching children with diverse needs (for example pupils with English as an Additional Language or SEN; higher attaining pupils, vulnerable or Looked After Children). \r\n\r\n* We have high expectations of our trainees - both academically and in their classroom practice. \r\n\r\n* We have a great commitment to equal opportunities, including raising attainment for all and closing the gap. \r\n\r\n* A particular focus on teaching reading (including systematic synthetic phonics); early maths; assessment and P.E.\r\n\r\nAssessment:\r\n\r\nAt the start of the programme, all trainees will meet with their designated professional tutor - from SCITTELS - to devise a bespoke action plan based on their individual needs. Subsequently, trainees will be assessed weekly by their School Based Mentor against their targets. Training activities will enable trainees to gather evidence towards their targets throughout the year. \r\n\r\nThe School Direct PGCE programme leads to Qualified Teacher Status (QTS) and the academic award of a Post Graduate Certificate in Education (PGCE), comprising of 60 M Level credits. The programme is currently validated by Goldsmiths University. \r\n\r\nTrainees on the programme complete two assignments which are assessed at level 7. ","interviewProcess":"From autumn, interviews will be conducted at Colegrave Primary School. This will usually be with a member of the SCITT team and a leader from one of our partnership schools. \r\n\r\nStage 1:\r\n\r\nApplication Scrutiny:\r\n\r\nPersonal Statement\r\n\r\nWhen scrutinising your personal statement we are particularly looking for evidence of: \r\n\r\n* Recent, relevant experience \r\n\r\n* Reflection on school experience that shows what you have learnt from this experience \r\n\r\n* Understanding of the demands of the teaching profession \r\n\r\n* Excellent written English \r\n\r\n* Understanding of the demands of the PGCE and the teaching profession \r\n\r\nStage 2:\r\n\r\nInterview:\r\n\r\n* The second stage of the selection process is the selection day. This will involve the following activities: \r\n\r\nEnglish Task: \r\n* A short spelling task;\r\n* Correcting sentences to Standard English;\r\n* Adding punctuation to sentences;\r\n* Complete a piece of writing, based on a given question.\r\n\r\nPresentation: \r\n\r\nIn order to assess your potential to teach, including the ability to present information clearly, and to reflect on your performance in order to improve, you will be asked to carry out a short presentation activity (Details of the presentation theme will be sent to you before the interview day).\r\n\r\nInterview: \r\n\r\nYou will be asked a series of questions designed to assess your potential, this will include questions designed to assess your personal skills and qualities. \r\n","howSchoolPlacementsWork":"Placements for this route will be in Early Years and Key Stage 1 (3 to 7 age range)\r\n\r\nWe work in partnership with over 40 schools in Newham and the surrounding boroughs. We aim to place our trainees in a school that is within 30 minutes commute by public transport. Due to our expansive partnership schools are never too far away.\r\n\r\nTrainees will spend their time training in a minimum of 2 different schools. Trainees will spend the autumn term at their first placement school. Following this, they will then go to another school for half a term in Spring (different age range) and return to their first placement school in the Summer.\r\n\r\nTrainees spend most of their time in school. 4 days are spent in school and 1 day, usually a Friday, is spent at SCITTELS for training.\r\n\r\n(Placement arrangements may change depending on government guidance re: COVID-19)","personalQualities":"* The ability to communicate clearly and accurately in Standard English (both written and orally). \r\n\r\n* A commitment to teach and a motivation to learn (you need to demonstrate that you are a quick learner and can meet the professional demands of the programme). \r\n\r\n* Well developed personal qualities and skills such as self-organisation, resilience and reflectiveness. \r\n","otherRequirements":"In addition to the required qualifications above, before the start of the course, you will be asked to:\r\n\r\n* Complete an Enhanced Disclosure and Barring Service Check\r\n* Undergo an occupational health assessment to assess fitness for teaching.\r\n","status":1,"createdAt":"2021-09-15T14:43:22.427Z","updatedAt":"2021-09-15T15:01:39.493Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
