{"id":"7552082c-1a3d-42f9-ac70-f72b1ac02208","name":"Primary","code":"323K","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"df33e9b2-bf8d-4373-b3df-a3cb2ad68c12","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"a03e3f52-0708-4475-9f13-8f6f3edad28a","code":"2DB","name":"Colchester Teacher Training (CTTC)"},"accreditedBody":{"id":"beed0fbc-2ee8-42e8-a507-f1956664a9f0","code":"C76","name":"Colchester Teacher Training Consortium"},"profPost":"BO","degreeGrade":"9","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9000,"aboutCourse":"Our Primary School Direct Programme offers high quality training, leading to the award of Qualified Teacher Status (QTS) and a Post Graduate Certificate in Education (PGCE), including credits at Masters level, validated by the University of Greenwich.\r\n\r\nThe course is 37 weeks long and combines practical teaching with professional training.  It has been designed to give Trainee Teachers the necessary learning opportunities and support to enable them to demonstrate they have developed the knowledge, skills and behaviours to meet the Teachers' Standards for QTS.  There are built-in assessment structures which help Trainees track their progression throughout the Colchester Teacher Training Consortium (CTTC) curriculum.  This curriculum is centred around 4 key values: CREATIVITY, TARGETED INTERVENTION, THINKING CRITICALLY AND COLLABORATION and ensures trainees have full access to their entitlement under the Initial Teacher Training Core Content Framework. \r\n\r\nThe training consists of placements within two contrasting schools, along with centre-based training and engagement with evidence based academic research.  \r\n\r\nWe offer non-salaried and salaried courses however, please note that we are unable to find salaried placements for applicants.  They should already have received an offer of employment with a school prior to applying to us. ","interviewProcess":"We invite short-listed applicants to participate in a selection process involving the following:\r\n\r\n\r\n* Presenting a lesson\r\n* Written task\r\n* Maths task\r\n* Interview\r\n\r\nWe ask all interviewees to present a lesson planned for a class of children, the subject of which can be chosen by the candidate. \r\n\r\nApplicants will then be asked to complete a written task (handwritten), which offers the opportunity to reflect accurately on the teaching activity's strengths along with areas for development.   This also gives the opportunity for applicants to demonstrate they can communicate in writing, accurately and effectively.\r\n\r\nThe interview will last for approximately 40 minutes.  Questions will be framed around the applicant's previous relevant experience, skills, developing subject knowledge and aptitude for becoming a teacher of the future.  The process will also ensure that potential candidates are safe and appropriate to work with children and ensure their commitment to celebrating economic, social and cultural diversity. \r\n\r\n","howSchoolPlacementsWork":"We have a high number of schools within our Consortium who offer placements to our trainees, all of whom provide excellent support and have been rated by ex-trainees as preparing them, across a range of phases, as 100% good and outstanding.  \r\n\r\nWe have a diverse range of schools within our consortium, all of whom provide excellent guidance and support which 100% of trainees have agreed has prepared them to become highly effective teachers. \r\n\r\n\r\n\r\n","personalQualities":"Applicants should have excellent personal attributes that enable them to relate to young people, communicate effectively and embrace the economic, social and cultural diversity of modern Britain.  An understanding of what makes effective teaching and learning in the primary phase would be of benefit.   \r\n\r\nQualities sought include:\r\n\r\n* Commitment to the safeguarding of young people \r\n* Enthusiasm & commitment to continuing professional development\r\n* A willingness to train,  listen to advice and learn from mistakes\r\n* Ability to cope with difficult and challenging situations\r\n* Good written and verbal communication skills\r\n* Well organised and hardworking\r\n* Sense of humour\r\n\r\n\r\n","otherRequirements":"We recognise that applicants will bring with them into teaching other relevant experience which falls broadly into 3 categories:\r\n\r\n* Experience of working with young people e.g. both paid and voluntary work\r\n* Experience of applying subject knowledge e.g. employment in your specialist field\r\n* Experience of working with people e.g. managing people in the work place, voluntary work with adults\r\n\r\nOffers of a training place are subject to safer recruitment procedures including pre-course screening checks where safeguarding references will be sought and all applicants will be required to undertake an enhanced DBS check. \r\n","status":1,"createdAt":"2021-07-06T10:55:51.919Z","updatedAt":"2021-09-29T13:10:52.590Z","canSponsorStudentVisa":"no","cycle":"2024"}
