{"id":"b2243f97-7721-4242-8100-fb3c34d70e7c","name":"Chemistry","code":"322J","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"912d4fb4-761b-42e9-8dc6-e968b791ea4e","code":"F1","name":"Chemistry"}],"locations":[{"id":"df33e9b2-bf8d-4373-b3df-a3cb2ad68c12","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"a03e3f52-0708-4475-9f13-8f6f3edad28a","code":"2DB","name":"Colchester Teacher Training (CTTC)"},"accreditedBody":{"id":"beed0fbc-2ee8-42e8-a507-f1956664a9f0","code":"C76","name":"Colchester Teacher Training Consortium"},"profPost":"BO","degreeGrade":"9","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","aboutCourse":"Our Secondary Programme offers high quality training, leading to the award of Qualified Teacher Status (QTS) and a Post Graduate Certificate in Education (PGCE), including credits at Masters level, validated by the University of Greenwich.\r\n\r\nThe course is 37 weeks long and combines practical teaching with professional training. It has been designed to give Trainee Teachers the necessary learning opportunities and support to enable them to demonstrate they have developed the knowledge, skills and behaviours to meet the Teachers’ Standards for QTS. There are built-in assessment structures which help Trainees track their progression throughout the Colchester Teacher Training Consortium CTTC curriculum. This curriculum is centred around 4 key values: CREATIVITY, TARGETED INTERVENTION, THINKING CRITICALLY AND COLLABORATION and ensures trainees have full access to their entitlement under the Initial Teacher Training Core Content Framework.\r\n\r\nThe training consists of placements within two contrasting schools across the secondary age phase, along with centre-based training and engagement with evidence based academic research. There is also the opportunity to gain experience within SEND, EAL, Sixth form and Pupil Referral Unit settings. Additionally, trainees will have a lead mentor for subject studies to develop their chosen discipline. \r\n\r\n","interviewProcess":"We invite short-listed applicants to participate in a selection process involving the following:\r\n\r\n * Teaching a Lesson \r\n * English (spelling and grammar) task\r\n * Maths (data) task\r\n * Interview\r\n\r\nWe ask all interviewees to teach a micro lesson to a group of pupils.\r\n\r\nApplicants will then be asked to complete a spelling and grammar task, and a data task, which offers the opportunity to provide a written analysis of the task. This also gives the opportunity for applicants to demonstrate they can communicate in writing, accurately and effectively.\r\n\r\nThe interview will last for approximately 25 minutes and includes a 10 minute presentation on the lesson discussing the reasoning behind the candidates lesson design.  Questions will be framed around the applicant’s previous relevant experience, skills, knowledge of the curriculum and aptitude for becoming a teacher of the future.  The process will also ensure that potential candidates are safe and appropriate to work with children and ensure their commitment to celebrating economic, social and cultural diversity.\r\n\r\nApplicants will also be invited to  attend an interview with the Employing School.\r\n","howSchoolPlacementsWork":"We have a high number of schools within our Consortium who offer placements to our trainees, all of whom provide excellent support and have been rated by ex-trainees as preparing them, across a range of phases, as 100% good and outstanding. If you wish to train in a subject not listed please contact us and we can advise you.\r\n\r\nPlease see our website or contact us for a list of our partner schools and for further details.\r\n\r\n\r\n\r\n\r\n","personalQualities":"It is essential for applicants to have excellent personal attributes, which will enable them to relate to young people and communicate effectively. Ideally, an understanding of what makes effective teaching and learning in the primary phase will also be of benefit.\r\n\r\nQualities sought include:\r\n\r\n* Commitment to the safeguarding of young people\r\n* Enthusiasm and commitment to continuing professional development\r\n* A willingness to train, listen to advice and learn from mistakes\r\n* Ability to cope with difficult and challenging situations\r\n* Good written and verbal communication skills\r\n* Well organised and hardworking\r\n* Sense of humour\r\n","otherRequirements":"We recognise that applicants will bring with them into teaching other relevant experience which falls broadly into three categories:\r\n\r\n* Experience of working with young people e.g. both paid and voluntary work\r\n* Experience of applying subject knowledge e.g. employment in your specialist field.\r\n* Experience of working with people e.g. managing people in the work place, voluntary work with adults.\r\n\r\nOffers of a training place are subject to safer recruitment procedures including pre-course screening checks where safeguarding references will be sought and all applicants will be required to undertake an Enhanced DBS check.\r\n","status":1,"createdAt":"2021-07-06T10:55:51.835Z","updatedAt":"2021-09-28T15:20:43.722Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"For the period of training all applicants must be employed as an unqualified teacher at a school, and (except applicants employed in academies or independent schools) must be paid in accordance with at least the minimum of the unqualified teacher pay range for the period of their training.\r\n\r\nThere will be a fee payable either by the trainee or school (to be agreed independently of CTTC) for the PGCE from the University of Greenwich."}
