{"id":"ad96945c-854f-41c5-b0bd-13944916c3a7","name":"Primary","code":"3CLS","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"40efcc8f-77a7-4c91-9f09-6c79e74e58f7","name":"Car Mill Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"fcd71cc4-b3e8-4abf-89fe-e8d66f89c2b5","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"},{"id":"c210dc18-6c07-4e74-865e-73cff0fd9f83","name":"Knowsley First - Holy Family Catholic Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"6f2a6717-a40c-48eb-a2a6-e1ea67e9e7d3","name":"Oakdene Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"f7f82f60-92d7-4443-a835-d0898316d3da","name":"Quest Federation","isPublished":"Y","status":"R","vacancies":"F"},{"id":"a78f4fec-b181-4e45-95c1-e1f6c3cd2c26","name":"Bishop David Shepherd CE Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"4d9e458a-c9df-4e24-bd87-4764fe2dcdc1","name":"School Direct Teaching Centre","isPublished":"Y","status":"R","vacancies":"F"},{"id":"107b7935-6d22-45a2-8661-adf86213e228","name":"Longton Lane Community Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"dd657d4d-6574-4e24-a5ec-9ea936de7cd6","name":"St Mary and St Paul's CE Primary","isPublished":"Y","status":"R","vacancies":"F"},{"id":"7a18c207-81a9-4709-8f57-53e8c281ab11","name":"Wavertree CE Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"0ad1fcfe-87f4-4be3-9e4c-033fe6e485c5","name":"Hale CE Primary","isPublished":"Y","status":"R","vacancies":"F"},{"id":"7243c1d9-ad49-4363-bde0-fab611c4b2b5","name":"Liverpool Diocese Schools Trust","isPublished":"Y","status":"R","vacancies":"F"},{"id":"6b420ea8-3304-4b1d-890b-726c03aeca43","name":"Lander Road Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"5806c110-42f9-4734-a0ee-32bff39777cd","name":"Prescot Primary Community School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"5352ece9-38a8-4217-96ca-b5985d23cc8c","name":"Malvern Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"57fba385-0391-41b3-9db4-6a1c2d1640fc","name":"Banks Road Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"4d554046-ec86-40d2-9e99-33614ae9f619","name":"Christchurch CE Primary School","isPublished":"N","status":"S","vacancies":"F"},{"id":"edc443c6-3347-423a-a650-61bfd6e1de37","name":"Yew Tree Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"ae805bab-39d3-4a97-b68a-7aa11c4dbaaa","name":"Winwick CE Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"990220fb-8e87-42a5-92bb-0c2a810ed612","name":"St John Fisher Catholic Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"721ec243-d570-4389-99c5-294e7b04426e","name":"Whiston Willis Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"c8ef5348-3031-4ffb-9f23-dee4f12c4bc0","name":"Our Lady Immaculate Catholic Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"b645e406-d5c7-4130-9311-bf343a7616b5","name":"Halsnead Primary School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"0474899b-bf2a-4cf9-a9be-b5168fe63e1c","code":"17Q","name":"Mersey Boroughs ITT Partnership (School Direct)"},"accreditedBody":{"id":"85451f1d-964e-4f76-903b-884d31a63bec","code":"1X8","name":"Mersey Boroughs ITT Partnership"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Our full time, one academic year programme gives trainees the chance to spend a significant amount of time in school, becoming part of a school team from the very first week and learning from excellent current practitioners both in school and through our taught programme.\r\n\r\nOur aim is quality throughout the programme.\r\n\r\n*Top quality candidates selected through a rigorous interview process.\r\n\r\n*Guaranteed placements in schools that offer quality mentoring and support.\r\n\r\n*High quality training delivered by outstanding current classroom practitioners.\r\n\r\n*Quality Masters-level input from our university partner.\r\n\r\n*Top quality support throughout the programme from experienced tutors and the programme team.\r\n\r\n*Access to our quality ECT and RQT development programmes free of charge for all of our successful trainees, ensuring support continues through their first year of teaching and beyond.\r\n\r\nWhen you are not engaged with your placement school, our taught sessions are delivered in a classroom environment and provide informative, interactive and up to date teaching ideas, supporting you across the full primary curriculum to become highly employable well-informed and reflective practitioners.\r\n\r\nThere are no ongoing essays required as the programme progresses. For the final award of QTS our trainees will have been assessed and supported in their development with regular observations and evaluations of their teaching. Towards the end of the programme trainees will submit documentary evidence that they have met each Teachers’ Standard across two different age phases.\r\n\r\nThe PGCE element of the programme is delivered by our partner university at their city centre campus. For your PGCE award the two masters modules require a short reflective essay or presentation based on your classroom research.\r\n\r\nSupport continues throughout the first year of teaching and beyond for all of our successful trainees with access to our quality ECT and RQT development programmes. “The partnership provides comprehensive and highly valued initial teacher training and continuing professional development for NQTs and recently qualified teachers (RQTs)” – Ofsted.\r\n\r\nWe are very proud that our inspection recognised the positive impact the teachers Mersey Boroughs train have on young learners. Our trainees are very well prepared for their employment and both Ofsted and employing head teachers acknowledge that a Mersey Boroughs trained teacher is an asset and arrives in their first post fully equipped for the teaching profession. “Trainees and NQTs have highly appropriate professional attributes, are committed to teaching, very positive about their training and support.” – Ofsted.\r\n\r\n\r\n\r\n","interviewProcess":"We are looking for people with the ambition, enthusiasm and resilience to be successful on our ITT programme and to become outstanding teachers for the future.\r\n\r\nOur selection process is co-ordinated by and interviews held at St Mary & St Paul's Cof E Primary School in Prescot L35 5DN.\r\n\r\nWe aim to offer a relaxed, fully inclusive interview process and as such there is no requirement to plan for or teach during our one day interviews. Applicants who are shortlisted from their initial DfE 'Apply' application will be invited to spend a day in school with us, during which they will undertake a comprehensive selection process: Applicants will spend the morning in a class acting in the role of a teaching assistant, we are keen to see applicant's interaction with children and adults, knowledge, use of standard English and aptitude. They will then complete a short written reflection on their morning, which will be used to assess their ability to reflect and learn from experience and their use of standard written English. Applicants will then have a formal interview, including a short presentation linked to a teaching resource of their choice. Prior to the interview day applicants are expected to complete a short online maths task. \r\n\r\nOur selection panel is always made up of staff and/or tutors from our leadership team and partner schools.\r\n\r\nWe are happy to accommodate any adjustments as required to assist candidates on the day but ask that they are relayed to us in advance.\r\n","howSchoolPlacementsWork":"Originally a group of 20 primary schools working across five of the Merseyside boroughs: Knowsley, St Helens, Halton, Liverpool, Sefton and Quest Primary Federation in Wigan. The schools in the partnership share a common vision: to train and develop outstanding teachers for the future.\r\n\r\nWith their professional training needs in mind our trainees complete significant placements in two contrasting primary schools, carefully selected by the leadership team from within the established partnership .\r\n\r\nTrainees are assigned a 'home school' where they are based during the autumn term. The first half term blends time in school with a taught programme delivered by outstanding practitioners, building up to a first teaching 'block' leading up to Christmas.\r\n\r\nTrainees then move on to their second school in the spring term, again combining time in school with taught sessions but also benefiting from a series of 'broadening experience' activities. Trainees complete a second substantial teaching 'block' in their second school.\r\n\r\nThe summer term is spent back in the 'home school' where trainees are able to put all of the skills and knowledge that they've developed together in delivering their final 'block' of teaching.\r\n\r\nDuring the year trainees also complete a number of tasks that will support them in meeting the standards required for the award of QTS and will also complete pieces of assessed work linked to their PGCE study.\r\n\r\nOur trainees spend more than the minimum required days working in schools. They have a wide range of opportunities to observe and learn from good and outstanding practitioners. Trainees also undertake helpful ’broadening experience visits’ and ‘mini placements’ in secondary, nursery and special schools arranged by the partnership.\r\n\r\nWe feel that our programme is rigorous but really successful in preparing trainees for a career in teaching and to become outstanding teachers in their own right. Feedback from our successful cohorts has been overwhelmingly positive and we've are delighted to continue our relationship with former trainees through the free of charge programmes of ECT and RQT support and development that we offer.\r\n","personalQualities":"","otherRequirements":"Offers will be subject to\r\n\r\na) Evidence of relevant qualifications\r\n\r\nb) Successful interview\r\n\r\nc) *Health check Statement*\r\n\r\ne) *Enhanced Disclosure from the Disclosure and Barring Service (DBS)*\r\n\r\nOffers will be conditional subject to all of the above being in place prior to the programme start date. *Mersey Boroughs will administer and cover the costs of these requirements.\r\n","status":1,"createdAt":"2021-07-06T10:46:26.890Z","updatedAt":"2021-09-30T10:22:52.769Z","canSponsorStudentVisa":"no","cycle":"2024"}
