{"id":"5715f408-3495-4a98-8317-50a78994b570","name":"Primary","code":"R966","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"62faeb68-90a6-4112-bd53-61c64ea4218f","name":"A Primary School in Suffolk","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"032afe13-53d6-47d3-9901-8478b3da1638","code":"3C6","name":"EAST SCITT"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"There will be costs incurred by yourself to achieve equivalency tests.\n\nWe will consider accepting equivalency tests in lieu of GCSE English & Maths ( grade 4 (C) or above ) on an individual basis.","courseLength":"OneYear","feesUK":9250,"feesInternational":9250,"feeDetails":"This fee includes the PGCE element to the programme  in addition to the QTS.\r\n\r\nIf you are unsure at the time of applying, whether to choose QTS only or QTS with PGCE, we recommend you apply for both programmes with us. We will discuss these options more fully with you at the interview stage. Should you choose the QTS only programme, the fee would be reduced to £8250 ( correct as at 1st October 2020).","financialSupport":"\r\nYou don’t have to apply for a Department of Education bursary - if you’re eligible, you’ll automatically start receiving it once you begin your course. \r\n\r\nYou may be eligible for a  loan while you study – note that you’ll have to apply for  undergraduate student finance. \r\n\r\nFind out about financial support if you’re from  outside the UK. ","aboutCourse":"Training starts in early September through to June. Carefully designed, delivered by experienced teachers to ensure it reflect the needs of the modern classroom and enables you to start your teaching career equipped with the best combination of skills and knowledge. A crucial aspect of this programme is the innovative 10 day Induction period preparing you to spend the first few vital days in mid-September in your first placement school. \r\n\r\nAdditionally, our programme offers: \r\n\r\nBespoke arrangements made after selection day, to discuss further your training needs and a reading list to enable you to develop relevant knowledge and skills before the course starts. \r\n\r\nSessions with experienced subject experts enabling you to develop your pedagogical skills \r\n\r\nWeekly sessions focusing on: \r\n\r\n* Managing behaviour \r\n\r\n* How pupils learn and cognitive science \r\n\r\n* Literacy across the curriculum \r\n\r\n* Mathematics \r\n\r\n* Science \r\n\r\n* Assessment for learning \r\n\r\n* Special Educational Needs and Disability \r\n\r\n* Managing workload and well-being \r\n\r\n* Planning for curriculum progression \r\n\r\n* Developing thinking skills & use of group work \r\n\r\n* Visit to a special school \r\n\r\n* Personal, Social and Health Education \r\n\r\n* Metacognition \r\n\r\n* Adaptive teaching and pupil progress \r\n\r\n* Primary curriculum foundation subjects \r\n\r\n* Preparing for your ECT years \r\n\r\n* Career progression & applying for your first teaching job \r\n\r\n* Action research \r\n \r\n\r\nFull cohort sessions are based at one of our training centres at Farlingaye High School or Kesgrave High School or at a local primary school. \r\n\r\nSchool Placements \r\n\r\nYou will spend 80% of the course in school. Once per week you will receive general professional and subject knowledge sessions. \r\n\r\nYour teaching will build up gradually: you will start by undertaking structured observations of teachers followed by team teaching, then full lesson teaching. \r\n\r\nAssessment \r\n\r\nYou will be provided with regular feedback to help you progress in your teaching skills through \r\n\r\n* observation of your lessons \r\n\r\n* assessment tasks \r\n\r\n* your reflections linking theory from training to your practice in the classroom \r\n\r\nThere are three formal reviews of progress throughout your training, with the final assessment to gain Qualified Teacher Status taking place in the summer term. \r\n\r\nWritten submissions are evenly spread throughout the programme. The wellbeing of our trainees is of the utmost importance to us, we provide various options to support you. ","interviewProcess":"Our recruitment and selection process is designed to allow us to make the right decisions for you as an applicant and for our placement schools. \r\n\r\nOnce we receive your application, it will be considered by a subject specialist and SCITT lead. If successful to the next stage, you will be invited to a Selection & Recruitment day. \r\n\r\nThe day will consist of: \r\n\r\n* Welcome by a member of the SCITT team \r\n\r\n* Document check & hand in of your pre completed subject audit form \r\n\r\n* Tour of the school in which the interview takes place \r\n\r\n* A 20 minute pupil task  ( usually a story reading task) \r\n\r\n* Formal Interview \r\n\r\n* Written Task (to display knowledge & understanding of your subject) \r\n\r\n* English & Maths diagnostic activities \r\n\r\nWe encourage applicants to find out more about the application and recruitment process details online and also by attending one of our information events. \r\n\r\nSuccessful candidates will be offered a place within days. An offer letter will be issued and may detail some conditions, e.g. passing your degree/ undertaking SKE \r\n\r\nAll trainees offered a place must: \r\n\r\n* Pass a Fitness to Teach medical assessment; \r\n\r\n* Undergo an enhanced DBS check to verify their suitability to work with young people. \r\n\r\nCovid 19 restrictions may alter the interview process, if so, you will be notified of arrangements. ","howSchoolPlacementsWork":"Your placements will be carefully selected to ensure that they give excellent but contrasting experiences whilst also considering a reasonable travelling distance from your home.  \r\n\r\nIf you wish to nominate a school for one of your placements, we will be pleased to talk to the Headteacher about our programme, but we can never guarantee a request for a specific placement will be fulfilled. \r\n\r\nWe know many of our Professional Tutors and School Mentors well and try to match our trainees with their mentor to build that strong professional relationship. \r\n\r\nEach full-time trainee will be placed in the same school for term 1 and 3, term 2 will be in a different school providing a contrasting school environment. Our schools comprise predominantly of comprehensive schools which also include faith schools.\r\n\r\nEach of our training programmes is for a specified age range. We strive to provide experiences at special schools, pupil referral units and alternative educational settings.  \r\n\r\n Schools play such an important part in the programme, and that’s why we can provide you with an outstanding foundation on which to build your future career. You will have an expert school-based Mentor and a designated Senior Link (Professional Tutor) in each placement school and they will be trained by, and work closely with the SCITT team to ensure that you have great input and support which allows you to develop rapidly. \r\n\r\n“You all, along with everyone at Farlingaye, made my first term of training to teach the best experience ever. I was able to learn so much from everyone and you were all incredibly supportive in the process! I honestly can’t sing your praises highly enough!” \r\n\r\n“The support provided at each school was outstanding, both the support from my mentor and regular training sessions allowed me to start my NQT year feeling confident and equipped with the correct knowledge to start my career. I would highly recommend both schools as fantastic places to start your career as a teacher”.   ","personalQualities":" \r\n*  Enthusiastic and committed \r\n\r\n* Show humility, respect and empathy \r\n\r\n* Analytical and reflective in order to improve \r\n\r\n* Have high expectations \r\n\r\n*  Sense of humour \r\n\r\n*  Sense of purpose \r\n\r\n* Resilient and adaptable \r\n\r\n* Self-aware\r\n\r\n*  Establish and maintain professional relationships with students and adults \r\n\r\n* A team player\r\n\r\n* Confidence to lead learning and the work of others \r\n\r\n* Evidence of creative thinking and appropriate risk taking to solve problems \r\n\r\n* Excellent skills in communication, time-management, planning and organisation \r\n\r\n* A positive and engaging presence \r\n\r\n\r\n\r\nStrong literacy and  numeracy skills \r\n\r\nPotential to develop strong subject knowledge for teaching \r\n\r\n","otherRequirements":"Disclosure and Barring Service (DBS) \r\n\r\nThe Disclosure and Barring Service has taken the place of the CRB check and it is a condition of all ITT courses that trainees must have a satisfactory enhanced DBS check before commencing training.  Arrangements for completing DBS check applications will be explained as part of the selection and induction process. \r\n","status":1,"createdAt":"2021-07-06T10:52:33.000Z","updatedAt":"2021-09-22T10:16:38.057Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
