{"id":"f4094fe9-1f22-4d71-bcc8-228ba60421d4","name":"Biology","code":"X542","qualification":"qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"322cfc19-d51d-45db-91e3-bd7b4738470f","code":"C1","name":"Biology"}],"locations":[{"id":"82e55e82-43e3-49df-9e15-fb59f84c6685","name":"A secondary school in Suffolk","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"032afe13-53d6-47d3-9901-8478b3da1638","code":"3C6","name":"EAST SCITT"},"degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"It is important that your degree has a science composition.","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"There will be costs incurred by yourself to achieve equivalency tests.\n\nWe will consider accepting equivalency tests in lieu of GCSE English or Maths ( grade 4 (C) or above ) on an individual basis","courseLength":"OneYear","feesUK":8250,"feesInternational":8250,"feeDetails":"The fees above does NOT include PGCE . If you wish to apply for a full time  QTS + PGCE  programme this is possible. The QTS + PGCE only full time programme will be £9250 in total ( correct as at 01/10/2021)\r\n\r\nIf you are unsure at the time of applying, we recommend you apply for both programmes with us, and we will discuss these options more fully with you at the interview stage. ","financialSupport":"You don’t have to apply for a Department of Education bursary - if you’re eligible, you’ll automatically start receiving it once you begin your course. \r\n\r\nYou may be eligible for a  loan while you study – note that you’ll have to apply for  undergraduate student finance. \r\n\r\nFind out about financial support if you’re from  outside the UK. ","aboutCourse":"Training starts in early September through to June. Carefully designed, delivered by experienced practising teachers and expert trainees to ensure your training prepares you for the needs of the modern classroom and enables you to start your teaching career equipped with the best combination of knowledge and skills. A crucial aspect of this programme is the innovative 10 day induction period which prepares you to commence your first teaching placement in mid - September. \r\n\r\nAdditionally, our programme offers: \r\n\r\nA minimum of 6 subject knowledge sessions with a subject expert who will enable you to develop your pedagogical skills. \r\n\r\nWeekly sessions focusing on: \r\n\r\n* Managing behaviour \r\n\r\n* How pupils learn and cognitive science \r\n\r\n* Assessment for learning \r\n\r\n* Special Educational Needs and disabilities \r\n\r\n* Adaptive teaching and pupil progress \r\n\r\n* Planning for curriculum progression \r\n\r\n* Managing workload and well-being \r\n\r\n* Developing thinking skills & use of group work \r\n\r\n* Metacognition \r\n\r\n* Literacy across the curriculum \r\n\r\n* Action research \r\n\r\n* Visit to a special school \r\n\r\n* Personal, Social and Health Education \r\n\r\n* Career progression & applying for your first teaching job \r\n\r\n* Preparing for your ECT years \r\n\r\nFull cohort sessions are based at one of our training centres at Farlingaye High School or Kesgrave High School. \r\n\r\nSchool Placements \r\n\r\nYou will spend 80% of the course in school. Once per week you will receive general professional and subject knowledge sessions. \r\n\r\nYour teaching will build up gradually: you will start by undertaking structured observations of teachers followed by team teaching then full lesson teaching. \r\n\r\nAssessment \r\n\r\nYou will be provided with regular feedback to help you progress in your teaching skills through \r\n\r\n* observation of your lessons \r\n\r\n* assessment tasks \r\n\r\n* your reflections linking theory from training to your practice in the classroom. \r\n\r\nThere are three formal reviews of progress throughout your training, with the final assessment to gain Qualified Teacher Status taking place in the summer term.\r\n\r\nWritten submissions are evenly spread throughout the programme. The well being of our trainees is of the utmost importance to us. We take pride in the personalised provision we offer trainees and have a comprehensive support structure in place to to ensure all aspects of your training are successful.","interviewProcess":"Our recruitment and selection process is designed to allow us to make the right decisions for you as an applicant and for our placement schools. \r\n\r\nOnce we receive your application, it will be considered by a subject specialist and SCITT lead. If successful to the next stage, you will be invited to a Selection & Recruitment day. \r\n\r\nThe day will consist of: \r\n\r\n* Welcome by a member of the SCITT team \r\n\r\n* Document check & hand in of your pre completed subject audit form \r\n\r\n* Tour of the school in which the interview takes place \r\n\r\n* A 20 minute task with pupils \r\n\r\n* Formal Interview \r\n\r\n* Written Task (to display knowledge & understanding of your subject) \r\n\r\n* English & Maths diagnostic activities \r\n\r\nWe encourage applicants to find out more about the application and recruitment process details online and also by attending one of our information events. \r\n\r\nSuccessful candidates will be offered a place within days. An offer letter will be issued and may detail some conditions, e.g. passing your degree/ undertaking subject knowledge enhancement. \r\n\r\nAll trainees offered a place must: \r\n\r\n* Pass a Fitness to Teach medical assessment; \r\n\r\n* Undergo an enhanced DBS check and all other mandatory Safer Recruitment activities to verify their suitability to work with young people. \r\n\r\n\r\nCovid 19 restrictions may alter the interview process, if so, you will be notified of arrangements. ","howSchoolPlacementsWork":"Your placements will be carefully selected to ensure that they give excellent but contrasting experiences whilst also considering a reasonable travelling distance from your home. \r\n\r\nIf you wish to nominate a school for one of your placements, we will be pleased to talk to the Headteacher about our programme, but we can never guarantee a request for a specific placement will be fulfilled. \r\n\r\nWe have established excellent working relationships with our Professional Tutors and School Mentors and try to match our trainees with their mentor to build strong professional relationships. \r\n\r\nEach full-time trainee will be placed in the same school for terms 1 and 3, term 2 will be in a different school providing a contrasting school environment.Our schools comprise predominantly of comprehensive schools but include Church of England schools. \r\n\r\nEach of our training programmes is for a specified age range. We strive to provide experiences at special schools, pupil referral units and alternative educational settings. \r\n\r\nSchools experience is at the heart of our training programme. Our expert school-based mentors will provide you with an outstanding foundation on which to build your future career alongside a designated Senior Link (Professional Tutor) who will and work closely with the SCITT team to ensure that you have great input and support which allows you to develop rapidly. You will also be supported by a SCITT tutor who will monitor your progress and provide you with additional support. \r\n\r\n“You have made the start of training to teach a fantastic experience. I have able learned so much from everyone. The organisation has been top drawer!”  \r\n\r\n“The training sessions have been really inspiring. Having the opportunity to learn theory and then go and see it in the classroom has been so useful.”  \r\n\r\n \r\n\r\n ","personalQualities":"\r\n*  Enthusiastic and committed \r\n\r\n* Show humility, respect and empathy \r\n\r\n* Analytical and reflective in order to improve \r\n\r\n* Have high expectations \r\n\r\n*  Sense of humour \r\n\r\n*  Sense of purpose \r\n\r\n* Resilient and adaptable \r\n\r\n* Self-aware\r\n\r\n*  Establish and maintain professional relationships with students and adults \r\n\r\n* A team player\r\n\r\n* Confidence to lead learning and the work of others \r\n\r\n* Evidence of creative thinking and appropriate risk taking to solve problems \r\n\r\n* Excellent skills in communication, time-management, planning and organisation \r\n\r\n* A positive and engaging presence \r\n\r\n\r\n\r\nStrong literacy and  numeracy skills \r\n\r\nPotential to develop strong subject knowledge for teaching \r\n","otherRequirements":"EAST SCITT follow the Safer Recruitment procedures as set out in Keeping Children Safe in Education 2021 version.\r\n\r\nThis includes but is not limited to:\r\n\r\nDisclosure and Barring Service (DBS)  - The Disclosure and Barring Service has taken the place of the CRB check and it is a condition of all ITT courses that trainees must have a satisfactory enhanced DBS check before commencing training.  Arrangements for completing DBS check applications will be explained as part of the selection and induction process. \r\n\r\nChecking the Prohibited Teachers List \r\n\r\nChecking references and gaining reassurance where necessary\r\n","status":1,"createdAt":"2021-07-06T10:52:33.386Z","updatedAt":"2021-09-27T13:25:02.590Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
