{"id":"98940411-c6f8-48ad-b326-7bcc874134f9","name":"Primary","code":"35S2","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"8ea3e452-75a5-4051-8287-228b12d6677e","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"c5ede260-f452-441e-aaef-bd06722397ab","code":"2H2","name":"Eastgate Academy"},"accreditedBody":{"id":"1d95b6cb-0e08-4485-848a-0e304d71102a","code":"B38","name":"Bishop Grosseteste University"},"profPost":"BO","degreeGrade":"2","english":"2","maths":"2","science":"2","acceptPendingGcse":"no","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":12500,"feeDetails":"[Find more info about fees and funding on our website](https://www.bishopg.ac.uk/fees-funding/) \r\n","financialSupport":"To qualify for a scholarship, you’ll need a degree of 2:1 or above in SUBJECT HERE or a related subject. For a bursary you’ll need a 2:2 or above in any subject.\r\nYou can’t claim both a bursary and a scholarship - you can only claim one.\r\n\r\nFind out how to apply for a scholarship. You don’t need to apply for a bursary - if you’re eligible, you’ll automatically start receiving it once you begin your course. Find out how you’ll be paid.\r\nYou may also be eligible for a loan while you study – note that you’ll have to apply for undergraduate student finance.\r\nFind out about financial support if you’re from outside the UK\r\n","aboutCourse":"This PGCE course prepares you to teach children in the 5 to 11 age range as a general primary teacher. It is a very practical course with around two-thirds of the time spent in schools, mostly working with teachers and pupils, and around one third spent on directed study, with partnership training in the University and school. \r\nFind out more on our website: https://www.bishopg.ac.uk/course/pgceprim511/\r\n\r\nThis course can be taken full or part-time, studying for 3-7 age phase or 7-11 age phase. \r\nThe full-time course is for one year with 120 days in school and 60 days training. School placements are carefully structured to ensure gradual development of your confidence as an effective teacher through building up experiences by working with other trainees, link tutors and teachers. \r\nPlacements begin in the Autumn Term with a non-assessed placement when you will share organisational responsibilities with another trainee. The longer placements follow in the second and third terms and there is a one week enrichment placement. \r\nDepending on the age range you choose, you will be trained to teach all National Curriculum subjects. The Early Years Foundation Stage (EYFS) is also studied for those on the 3-7 routes with an emphasis on the core subjects and ICT. \r\n\r\nSpecial Features\r\nAt present you register for the course at Post Graduate level, gaining 60 masters credits (level 7) or you can gain a professional graduate qualification with either 60 credits at level 6 or 30 credits at level 6 and 30 at level 7. \r\nThe modules relate to the professional role of the teacher, the need to be a reflective practitioner, to developing your own knowledge of subjects and areas taught within primary schools and early years setting and how you teach to support children in effective learning. \r\nThe course will include lectures, seminars, workshops, Independent Study, tutorials, school-based training and will recommend you for Qualified Teacher Status (QTS). The University-based sessions are very much a starting point for the training undertaken in schools through observation and working alongside experienced teachers. \r\n","interviewProcess":"The majority of the School Direct Course is based in class, in school, learning alongside experienced mentors and outstanding teachers. Applicants for the School Direct Route apply directly to their chosen Cluster. Whilst the process is overseen by the Admissions department at BGU, applicants are interviewed in school, usually at the lead school for the Cluster. They are then allocated placements in schools which are part of, or that work with, the Cluster. This means that schools can be directly involved in selecting trainees who will become part of their staff team. The interview process will include being asked to complete tasks and engage in professional discussion around teaching and learning.\r\n\r\nWe will invite you to Eastgate Academy and during the time you are with us you will be asked to complete a number of tasks. You will meet with students and staff to discuss topical issues. The purpose of the day is for us to get to know you and for you to get to know us. Once the interview has taken place the panel will discuss how they can best support you in becoming an outstanding teacher and which one of our schools are best placed to help you achieve. \r\nThere will be a pre-course task which will enable you to be prepared for your first placement school. \r\n","howSchoolPlacementsWork":"The School Direct Route generally involves working in a base school with an additional placement in an alternative school or setting, normally for at least six weeks, and in a different age phase. \r\nThese placements take place alongside training which is based within the Cluster, together with regular University-based training across the year, including completion of two academic modules.\r\nTrainees are supported through their journey by School Based Mentors and also by University Based Mentors, regularly discussing practice and monitoring progress through lesson observations and the collecting of evidence to demonstrate meeting the Teachers’ Standards. Tutors also offer pastoral support to help trainees manage their workload and wellbeing. \r\nTrainees should aim to develop strong subject knowledge of English, Phonics and mathematics, in particular, as well as all other areas of the primary curriculum. \r\nTrainees work alongside mentors in school developing confidence, knowledge and skills, gradually taking more responsibility for managing behaviour, planning and teaching lessons across the curriculum and assessing pupil progress.\r\nThe full-time course is for one year with a minimum of 120 days in school and 60 days training. School placements are carefully structured to ensure gradual development of your confidence as an effective teacher through building up experiences by working with other trainees, link tutors and teachers.\r\n\r\nPlacements begin in the autumn term. The spring and summer term placements follow with you taking the lead within the classroom across core and foundation subjects. You will also undertake an enrichment placement in key stage three and early years. Whilst on placement you will work closely with your School Based Mentor(SBM). Your SBM will observe your practice throughout the week and will also meet with you weekly to enable you to identify targets to further develop your professional practice. You will also attend one afternoon a week at a local training session where senior staff will work with you and help you develop your classroom practice.\r\n","personalQualities":"We are looking for someone who has a love of learning and who wishes to ensure that others do too. \r\nBesides academic qualifications we are looking for a confident communicator who has a passion for learning. We are looking for someone who is well organised and has the ability and desire to become a team player. Your interpersonal skills are important as is your curriculum knowledge. We want to work with people who want to make a difference to individuals' lives. \r\n","otherRequirements":"","status":1,"createdAt":"2021-07-12T13:49:03.658Z","updatedAt":"2021-11-02T14:20:40.892Z","canSponsorStudentVisa":"yes","cycle":"2024"}
