{"id":"c256c848-c27e-4da2-a60b-fa022c11979e","name":"Primary","code":"2YR4","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"b1c5a025-b277-4a3f-b8ae-0f6437a62a35","name":"Greenholm Primary School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"35714fe0-b257-45c2-9e53-b3a40a2b3487","code":"19R","name":"Greenholm Primary School"},"accreditedBody":{"id":"086451b8-c0c2-45b7-94eb-c79c1c4fd637","code":"1WE","name":"Services for Education"},"degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"please get in contact with Services for Education for further information","courseLength":"OneYear","feesUK":7500,"feeDetails":"Please get in contact with Services for Education for further information.","financialSupport":"Please get in contact with Services for Education for further information.","aboutCourse":"We offer excellent practical teaching experience under the guidance of highly skilled and dedicated professionals. We offer personalised training to develop teaching skills within a wide range of settings. \r\nWe work in close association with Services for Education (SFE) so all  students are supported with academic studies, career guidance and pastoral care. \r\nTrainees will be placed with a well-qualified teacher and trained about all aspects of primary teaching and learning. They develop their knowledge and understanding of teacher standards,  pedagogy and how  primary pupils learn. Trainees are observed  regularly  by highly qualified teachers who give personalised targets which develop trainee's knowledge and understanding. Most training will happen at the main school allocated but trainees will visit other venues during the training.During the training year, the focus is on getting trainees classroom ready.  The centre based programme is complimented with the school based support from  highly qualified teachers.  The content of the course includes  but not limited to: Numeracy, Literacy and phonics, Science, behaviour management, Child development, Emotional literacy, PSHE, Fundamental British values, Physical Education, Vocal training, SEND, EAL, Humanities through theme based work, Art, Music and assessment and reporting both for personalising learning, but also to comply with statutory requirements.\r\n70% of the course is spent in schools, learning from and with practitioners, leading learning and supporting pupil progress.  The  amount of time spent  per week in school increases across the length of the programme, so  the experience of teaching is as realistic as possible.\r\nTrainees are continual assessed across the year.  The final outcome is a cumulative decision based on observations, evidence folders, centre based tasks which are assessed.  The school mentor and SFE tutor agree an outcome to be approved by exam board before QTS is awarded.\r\nWe have 14 partnership schools across the partnership in various locations in Birmingham.  Our centre based training is delivered predominantly at our lead school Greenholm Primary\r\n We are a good programme (Ofsted grading), with excellent completion rates and 100% employability rates.  We pride ourselves on our pastoral care, making sure that at any stage in the trainees development they are seen as an individual and support is available to them. We have a strong partnership with our training schools, and many of our trainees go on to work in the schools with many previous trainees now taking on significant managerial responsibility in our training schools.\r\n\r\n","interviewProcess":"Candidates will be interviewed by a panel including headteachers from within the partnership and representatives from Services for Edication . There is one interview to attend and during the interview candidates will take part in a range of tasks including a presentation, writing task, curriculum task, classroom observation and possibly an interview by the school council.\r\n\r\n","howSchoolPlacementsWork":"All trainees  do at least two placements in two different schools in two different phases. All placements are within the primary phase and trainees teach pupils between the ages of 4-11 years of age with a range of abilities and disabilities. \r\nGreenholm endeavours to  support the needs of the trainee and the requirement  of the primary school when allocating placements, we try to allocate schools close to trainee's home address, for both the main placement and second placement, if it is possible.\r\nOur partnership of schools extends all across Birmingham with a wide range of primary schools.","personalQualities":"Candidates will :\r\nHave excellent speaking and written skills. \r\nExcellent numeracy and ICT skills. \r\nBe inspirational and aspirational. \r\nWork effectively in a team. \r\nMake decisions, problem-solve, have and show empathy. \r\nBe hardworking. \r\nBe dynamic. \r\nBe creative. \r\nBe flexible. \r\nBe enthusiastic. \r\nListen well. \r\nBe determined to achieve and do the best for the pupils within the partnership\r\nStrive for excellence. \r\nBe caring. \r\nBe emotionally literate. \r\nShow leadership skills. \r\nHave a 'can do' attitude and be up for a challenge. \r\nBe someone who wants to give children in their care the best start to life that they can. \r\nHave some school experience","otherRequirements":"All trainees are DBS checked and will need to complete CDF form\r\nIf they have been out of the country for more than 3 months, potential candidate needs to provide a certificate of good conduct from the embassy of the country they visited.\r\nIt is beneficial if trainees have some experience either salaried or voluntary of working within a primary school.","status":1,"createdAt":"2021-07-12T13:49:38.877Z","updatedAt":"2021-08-18T14:47:28.059Z","canSponsorStudentVisa":"no","cycle":"2024"}
