{"id":"9db9b723-9fa2-4677-b82d-56c76c384342","name":"Primary (7-11 with Mathematics)","code":"E042","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"7_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"286cf12f-b3e3-41c5-9f33-2ff7807d2df0","code":"03","name":"Primary with mathematics"}],"locations":[{"id":"cc329c04-44b9-4a0e-889e-753967093743","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"b8bcaeed-f311-4867-a1e3-c0fde20809d6","code":"E14","name":"University of East Anglia"},"profPost":"PG","degreeGrade":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"38 weeks","feesUK":9250,"feeDetails":"For any additional course costs at the University of East Anglia please [visit our website](https://www.uea.ac.uk/about/university-information/finance-and-procurement/finance-information-for-students/tuition-fees/additional-course-fees)","aboutCourse":"Our 38-week, full-time PGCE Primary with Mathematics programme will prepare you to become a general class teacher in the age range 5-11 years, with an additional focus on teaching and learning Mathematics.\r\n\r\nYou will undertake two main school placements in contrasting schools, where possible, to giving you a breadth of school-based experience.  You should apply if you enjoy Mathematics and want to inspire the next generation as a Maths teacher.\r\n\r\nUpon successful completion of your PGCE, you will graduate with Qualified Teacher Status (QTS) and 90 Master’s credits.\r\n\r\n[Sign up for one of our information sessions](https://bit.ly/3tcWy8j)\r\n","interviewProcess":"Interviews are part of the formal selection process. You will need to present yourself well, come prepared, and dress smartly. Your interview day will include:\r\n* An introductory talk\r\n* An individual interview\r\n* A written task\r\n\r\nYou may also be asked to complete other relevant tasks such as:\r\n* Working with small groups of pupils\r\n* Giving a presentation\r\n* A group interview\r\n* Literacy, numeracy and subject knowledge questions\r\n\r\n","howSchoolPlacementsWork":"School experience takes place in our partnership schools across the region.\r\n \r\nDuring the two extensive placements in our partnership schools, you will gain a broad range of practical teaching experience. \r\n\r\nOur aim is for your placements to be in contrasting schools, to give you a breadth of school-based experience. You will learn to put ideas and theory into practice.\r\n","personalQualities":"Trainees are selected on the basis of their application form, references and an interview. You are encouraged to prepare thoroughly.\r\n\r\nApplication forms should demonstrate strengths in subject and curriculum knowledge, your enthusiasm and commitment to a career in teaching, and the age range for which you have applied.\r\n","otherRequirements":"Prior to submitting your application, we recommend you gain some observational experience in a classroom environment if possible. This will help you gain an up-to-date understanding of how classrooms are managed and how teaching and learning takes place.\r\n\r\nPrior to commencing the course, applicants must also obtain:\r\n* An Enhanced Criminal Records check from the [Disclosure and Barring Service](https://www.gov.uk/government/organisations/disclosure-and-barring-service)\r\n* A satisfactory Health Check. All PGCE trainee teachers must meet the Secretary of State's requirements for physical and mental fitness to teach.\r\n\r\n","status":1,"createdAt":"2021-09-29T17:08:50.701Z","updatedAt":"2021-10-05T08:57:56.584Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
