{"id":"0fcc783d-b854-47e1-8444-786ca0364c9d","name":"Primary (SEND)","code":"W048","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"TA","fundingType":"apprenticeship","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"yes","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"322e3c5c-25d0-4960-9082-6467756724b5","name":"Queensmill School","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"567b32af-2b43-499d-a9ae-b407f35d5780","code":"1EL","name":"West London Teacher Training Alliance (Primary)"},"accreditedBody":{"id":"30bda414-7b00-426c-956b-18a187efe967","code":"L68","name":"London Metropolitan University"},"profPost":"PG","degreeGrade":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"For both the degree and GCSEs, where appropriate, see our important guidance on [Overseas Qualifications](https://www.wltta.org.uk/initial-teacher-training/primary-courses-for-sept-2022/overseas-qualifications/).\n\nSee also which equivalency tests we accept [GCSE Equivalency tests](https://www.wltta.org.uk/initial-teacher-training/primary-courses-for-sept-2022/gcse-equivalency-tests/).\n\nWe would not shortlist anyone with all three GCSEs outstanding.  \n\nWe prioritise shortlisting of those with either none outstanding, or only one outstanding, over someone who still needs to take two equivalency tests.","courseLength":"Just over 1 year, see fuller explanation below","aboutCourse":"QUALIFICATION\r\n \r\nThis salaried teacher apprenticeship W048 with a SEN school , leads to [PGCE(M) QTS PGTA](https://www.wltta.org.uk/initial-teacher-training/primary-courses-for-sept-2022/qualification-outcomes/).  The programme focusses on ages 5-11 but once qualified would not restrict the primary ages you could teach.\r\n\r\nTEACHER APPRENTICESHIP\r\n\r\nThis is a nationally recognised, work-based route into teaching. It offers the postgraduate-level qualification with no tuition fees and the opportunity to earn while you learn. It is aimed primarily at candidates with a good understanding of what it means to work in a school and have built up some experience, perhaps as a teaching assistant or similar role.\r\n\r\nPGCE(M) + QTS awarded by July 2023; PGTA end point assessment Autumn 2023\r\n\r\nSPECIAL FEATURES\r\n\r\nThe programme is run by  West London Teacher Training Alliance (WLTTA) in partnership with London Metropolitan University.  We make prompt shortlisting decisions and liaise with you quickly if we need additional information.\r\n\r\nWLTTA enables you to choose your employing host school at application.  If later, there is a teaching vacancy in your school and they are keen to retain you as a qualified teacher, this can be done without the post being advertised.  By becoming a WLTTA trainee, all our schools could employ you this way and if you needed it, we operate a pool.  \r\n\r\nOur aim is to produce exceptional teachers who could remain in alliance schools to continue their careers, taking advantage of further professional development, including the accredited Early Career induction programme.\r\n\r\nTHE TRAINING\r\n\r\nYou will register at the university and be employed by your chosen school.\r\nYou will undertake off-the-job training, which will occupy 20% of your teaching time; this is split between face-to-face training at the University and independent training tasks in school.\r\n\r\nYou will receive an induction at the University. The course will then build on well-established and successful foundations by combining the expertise of the university’s course tutors who are experienced classroom practitioners and teacher trainers; with a dynamic curriculum designed to cater to your needs as a teacher apprentice. \r\n\r\nYou will be encouraged to reflect upon your own practice and to critically engage with current research, policy and pedagogy.\r\n\r\nIn the spring term you will gain experience in a contrasting (mainstream) school for approx. 6 weeks to add further depth to the training\r\n\r\nWith your school mentors you will feel supported as you progress and become ready to teach aiming for 40-60% by Christmas and building to 80% by the summer term. ","interviewProcess":"We enable you to select your preferred employing host school(s) at application and later through a referral process.  We provide information about the schools to help you choose.  \r\n\r\nSTAGE 1: SCHOOL INTERVIEW\r\n\r\nOnce shortlisted, we would invite you to an interview with your chosen school.  In addition to the panel interview, you may be asked to prepare in advance to carry out a task in the classroom, e.g. to discuss an object of your choice with the pupils; or to teach a specified topic to a small group for a short time.\r\n\r\nYou would also be asked to complete a short literacy/numeracy test.\r\n\r\nINTERNAL REFERRALS\r\n\r\nIf you are not selected as the preferred candidate, but have demonstrated potential, you can then choose another school or programme of ours and we would recommend you for shortlisting.  We hope to fit good candidates with schools that they are happy with and where they can secure an offer.\r\n\r\nThere remains an advantage however in initially applying for a place at more than one of our schools, because such applications would be considered in parallel rather than sequentially. \r\n\r\nSTAGE 2: UNIVERSITY INTERVEW & DIAGNOSITIC ASSESSMENT \r\n\r\nIf you are selected from the school interview, we arrange for you to be invited to an online university interview and diagnostic assessment. \r\n\r\nYou will be asked to upload ID documents and relevant certificates if available.  We can still make an offer subject to later verification of qualifications.","howSchoolPlacementsWork":"CHOOSING YOUR SCHOOL\r\n\r\nWith WLTTA, you select the main host school (or federation) at application.  We then later arrange your second placement at another contrasting WLTTA school to provide greater depth to your training experience. \r\n\r\nThe schools seeking trainees on this particular course are listed below.\r\n \r\n*Knowledge Trust Primaries (3 schools W6, W6 & W14)\r\n*Berrymeade [Infant & Junior] School W3\r\n\r\nThe characters/location of our schools are varied. To help you decide, please refer to our [WLTSA Primary School Summary Descriptions](https://www.wltta.org.uk/initial-teacher-training/primary-courses-for-sept-2022/wltta-primary-school-summary-descriptions/) and our [Map of WLTTA Schools.](https://www.wltta.org.uk/location-map-with-magnifier/) \r\n\r\nYou can contact us to ask how many applications (if any) are being considered by different schools when you are applying.\r\n  \r\nDETAILED WEBSITE AND LIVE ONLINE PRESENTATION & Q&A\r\n\r\nWe recommend that you visit our website [www.wltta.org.uk](https://www.wltta.org.uk/) to properly see all our vacancies.  We have many other primary teacher training courses at other schools including a few salaried places.  You can download the course documents and see a video about us, with previous trainees being interviewed.  \r\n\r\nYou can also sign up there to join our fortnightly Zoom presentation about getting into teaching and it includes an opportunity for Q&A. The presentation explains all about the different routes into teaching and their separate benefits; how the money works; tips about using the 'Find Postgraduate Teacher Training' portal; applications; offers; etc.  No pressure, you don't have to attend this at all - it's just there for anyone who is trying to understand it all better.  We get excellent feedback on this year after year.","personalQualities":"We want you to have passion and enthusiasm.  We need trainees who can engage and inspire students to a love of learning, who are:   \r\n\r\n*committed to championing their students;\r\n*open to learn about children’s physical/social/emotional/cognitive needs and how these can affect behaviour;\r\n*in good health with the ability to cope with stress.  Teaching is incredibly rewarding, but it also requires an element of resilience!\r\n*professional and committed to equal opportunities;\r\n*able to communicate well in written/spoken English, with at least basic computer skills and commitment to developing these.\r\n*have a sense of humour and an ability to laugh at yourself.  \r\n","otherRequirements":"Queensmill is a specialist school for autism. This programme provides significant specialist setting experience, to  enhance your  primary training.   Successful candidates will have a passion for SEND young people and education and will have significant and sustained experience relevant to the context of the school. For all candidates it is advised to contact the school before application to discuss your suitability for the training programme.\r\nA realistic understanding of the role of a teacher is vital as is a level of maturity (irrespective of age) in order  to operate as a responsible salaried member of staff.\r\n","status":1,"createdAt":"2021-08-02T15:52:50.634Z","updatedAt":"2022-01-26T12:20:51.360Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024"}
