{"id":"514e40d8-8941-4070-a829-32b6a57fc6a0","name":"Primary","code":"2VP3","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"06e5098d-c8c2-44c6-bc46-bb6b8dfd66da","name":"West Twyford Primary School,","isPublished":"Y","status":"R","vacancies":"F"},{"id":"c2350af7-110f-44ae-808c-d082fac8a826","name":"Bousfield Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"42cc5787-219b-4f12-8dfe-eee380b199d5","name":"St James & St John CE Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"5ded4d92-e59a-4141-a569-418ecc267929","name":"Wormholt Park Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"dbff7f73-9d00-4c3e-a436-87912fe0871a","name":"Thomson House School","isPublished":"Y","status":"R"},{"id":"71a9fb6b-e2f3-4a2e-90b8-0b13fbfcbed7","name":"Oratory RC Primary School","isPublished":"Y","status":"R"},{"id":"ade86779-2b68-4e9f-bd1f-b21dd23c2abd","name":"Barnes Primary School","isPublished":"Y","status":"R"},{"id":"0414a58b-3a45-4c54-bf21-9d8d82b20ec7","name":"Barlby Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"a4bf3002-43a1-4583-af52-d057010dff45","name":"Fox/Ashburnham Federation & Avonmore Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"53ab88e2-0e20-4693-837d-b53a232fede0","name":"Marlborough Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"0ccbec74-5a46-4127-a127-6224b1c699be","name":"North Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"a71ec380-1a8b-43a2-856e-efca3ef42b3e","name":"Colville Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"0b198af4-8a74-4a68-b39c-9e164e2151b5","name":"Brackenbury Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"77c3ea97-ea19-43eb-aece-c5185bee10eb","name":"St John XXIII Catholic Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"199cfc0a-4e14-41e1-882a-aca90bc82858","name":"Bevington Primary School","isPublished":"Y","status":"R"},{"id":"876ed8b7-33f1-4087-92d4-8a01c5332550","name":"Knowledge Schools Trust Primaries","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"567b32af-2b43-499d-a9ae-b407f35d5780","code":"1EL","name":"West London Teacher Training Alliance (Primary)"},"accreditedBody":{"id":"33037eab-f75d-4350-b1e2-967c41e9d4c6","code":"R48","name":"Roehampton University"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"For the avoidance of doubt:  ALL WLTTA primary courses require a degree equivalent to a UK honours degree at 2:2 or above.\n\nFor both the degree and GCSEs, where appropriate, see our important guidance on [Overseas Qualifications](https://www.wltta.org.uk/initial-teacher-training/primary-courses-for-sept-2022/overseas-qualifications/).\n\nSee also which equivalency tests we accept [GCSE Equivalency tests](https://www.wltta.org.uk/initial-teacher-training/primary-courses-for-sept-2022/gcse-equivalency-tests/).\n\nWe would not shortlist anyone with all three GCSEs outstanding.  \n\nWe prioritise shortlisting of those with either none outstanding, or only one outstanding, over someone who still needs to take two equivalency tests.","courseLength":"OneYear","feesUK":9250,"financialSupport":"SCHOOL BURSARIES\r\n\r\nAll trainees on this course will receive a bursary from the school despite bursaries not being available from DfE. Full details of this unique additional funding can be seen in the tab on the Primary Courses page on our website [WLTTA Primary School Bursaries](https://www.wltta.org.uk/initial-teacher-training/primary-courses-for-sept-2022/wltta-primary-school-bursaries/).\r\n\r\n STUDENT LOANS\r\n\r\nYou can also take out a student loan if eligible even if you already have an undergraduate loan. Loans for tuition fees are not means tested (whereas loans for maintenance are means tested) but you should confirm this using the official DfE loan link above.\r\n \r\nOTHER FINANCIAL SUPPORT\r\n\r\nWhile not provided directly by WLTTA, please be aware that as a full time student you would be eligible for cheaper travel in London using a student oyster card and in many boroughs you can get a reduction on your council tax payments.","aboutCourse":"QUALIFICATION OUTCOME\r\n \r\nThis course 2VP3 leads to PGCE(M)QTS.   The significance of the qualifications can be found [here](https://www.wltta.org.uk/initial-teacher-training/primary-courses-for-sept-2022/qualification-outcomes/)\r\n\r\nSPECIAL FEATURES\r\n\r\nThis course is run by the West London Teacher Training Alliance (WLTTA) in partnership with the University of Roehampton.  We make prompt shortlisting decisions and will liaise with you quickly if we need additional information.\r\n\r\nSome WLTTA primary courses (including this one) come with our unique school bursaries, see more in the finance section below.  \r\n\r\nWLTTA enables you to choose your host school.  Later, if there is a teaching vacancy and they want to retain you, you can be employed for the following year without the post being advertised.  By becoming a WLTTA trainee, all our other schools could employ you this way and we operate a pool.\r\n\r\nOur aim is to produce exceptional teachers who could remain in alliance schools to continue their careers, taking advantage of further professional development, including the accredited Early Career induction programme.\r\n\r\nTHE TRAINING\r\n\r\nMost of the training occurs in your host school (and at the school that WLTTA select as a contrasting placement for approx. 6 weeks,) but you still enrol as a student at the university with full access to their facilities and mentors. \r\n\r\nPart of your training is also delivered from the university and part from our strategic lead primary (Fox Primary School, W8).  Fox is rated ‘Outstanding’ by Ofsted, with very high academic standards and significant experience of teacher training.\r\n\r\nAs a guide: [Typical timetable](https://www.wltta.org.uk/initial-teacher-training/roe-primary-unsal-typical-timetable/)\r\n\r\nAt school, through an initial programme of observations you will become familiar with the organisation and working of the school (pupil groups and pastoral systems, staffing, curriculum, resources, facilities, approaches to learning and teaching, lesson planning and assessment. \r\n\r\nYou will be treated like a member of staff. With your school mentors, you will feel supported as you progress and become ready to teach. Our mentors are excellent teachers and undertake rigorous training to develop their mentoring skills. In school provides you with the opportunity to develop your teaching expertise and relationships with children and young people in a familiar environment. \r\n\r\nYour university tutor will visit to monitor your progress at both schools and discuss your development with you and your mentors. You will maintain close links with your host school throughout the course. ","interviewProcess":"Our schools seek trainees that aspire to work for them. We enable you to select your preferred host school(s) at application and later through a referral process.  We provide information about the schools to help you choose.  \r\n\r\nOnce shortlisted, we arrange for you to be invited to the school interview. You may be asked to complete short online literacy/numeracy tests.  Each of our schools interview independently of each other, but the process is administered centrally through WLTTA.  \r\n\r\nYou will need to email scans of your degree (if you have this already) and any GCSE Maths, English and Science qualifications you have already, to WLTTA (Pippa Currey)[pcurrey@sacredh.lbhf.sch.uk]\r\n\r\nWe can still make an offer subject to later verification of particular qualifications.\r\n\r\nINTERNAL REFERRALS\r\n\r\nIf you do not get an offer after the school interview, but have demonstrated potential, you can choose another school and we would recommend your shortlisting.  \r\n\r\nWe hope to fit good candidates with schools that they are happy with and where they can secure an offer.\r\n\r\nThere remains an advantage initially in applying to the course at more than one school, because such applications would be considered in parallel rather than sequentially. If you have a clear first choice, email us and we can try to ensure a sensible order for the interviews.  \r\n\r\nAPPLICATIONS\r\n\r\nThe application process (using the button at the end of this listing) is intuitive, but we have made a short guide to the information you will need and how it works: [How application system works](https://www.wltta.org.uk/initial-teacher-training/primary-courses-for-sept-2022/how-application-system-works/).","howSchoolPlacementsWork":"CHOOSING YOUR SCHOOL\r\n\r\nWith WLTTA, you select the main host school at application.  We then later arrange your second placement at another contrasting WLTTA school to provide greater depth to your training experience. \r\n\r\nIf you want to see when you would be at the university; when at your main host school; and when the contrasting school, see our  typical timetable linked above.\r\n\r\nThe schools seeking trainees on this particular course are listed below.  \r\n\r\n* Barlby Primary School, W10\r\n* Barnes Primary School, SW13\r\n* Bevington Primary School, W10\r\n* Brackenbury Primary School, W6\r\n* Colville Primary School, W11\r\n* Fox Federation (3 schools, W8, SW10, W14)\r\n* Knowledge Schools Trust Primaries (3 sch W6, W6, W14)\r\n* Marlborough Primary School, SW3\r\n* North Primary School, UB1\r\n* St James & St John CE Primary School, W2\r\n* St John XXIII Catholic Primary School, \r\n* The Oratory Primary RC School, SW3\r\n* Thomson House School, SW14\r\n* Wormholt Park Primary School, W12\r\n\r\nThe characters/location of our schools are varied. To help you decide, please refer to our [WLTSA Primary School Summary Descriptions](https://www.wltta.org.uk/initial-teacher-training/primary-courses-for-sept-2022/wltta-primary-school-summary-descriptions/) and our [Map of WLTTA Schools.](https://www.wltta.org.uk/location-map-with-magnifier/) \r\n\r\nYou can contact us to ask how many applications (if any) are being considered by different schools when you are applying.\r\n  \r\nDETAILED WEBSITE AND LIVE ONLINE PRESENTATION & Q&A\r\n\r\nWe recommend that you visit our website [www.wltta.org.uk](https://www.wltta.org.uk/) to properly see all our vacancies.  We have many other primary teacher training courses at other schools including a few salaried places.  You can download the course documents and see a video about us, with previous trainees being interviewed.  \r\n\r\nYou can also sign up there to join our fortnightly Zoom presentation about getting into teaching and it includes an opportunity for Q&A. The presentation explains all about the different routes into teaching and their separate benefits; how the money works; tips about using the 'Find Postgraduate Teacher Training' portal; applications; offers; etc.  No pressure, you don't have to attend this at all - it's just there for anyone who is trying to understand it all better.  We get excellent feedback on this year after year.","personalQualities":"We seek trainees with a passion to engage and inspire students to a love of learning,  who are:   \r\n\r\n* committed to championing their students;\r\n* open to learning about children’s physical/social/emotional/cognitive needs and how these can affect behaviour;\r\n* in good health with ability to cope with stress.  Teaching is incredibly rewarding, but also requires an element of resilience!\r\n* professional and committed to equal opportunities;\r\n* able to communicate well in written/spoken English, with at least basic computer skills and commitment to developing these.\r\n\r\nIt helps to have a sense of humour and an ability to laugh at yourself!","otherRequirements":"A realistic understanding of the role of a teacher and an awareness of some current issues facing the profession is also important.  We have some advice relating to school experience on our website: [WLTTA School Experience tab](https://www.wltta.org.uk/initial-teacher-training/primary-courses-for-sept-2022/school-experience/)\r\n\r\nOffers are conditional on satisfactory outcome of a DBS check (approx. £60) and an occupational health check (approx. £20) both administered through the university after an offer is accepted.  ","status":1,"createdAt":"2021-07-06T10:55:21.008Z","updatedAt":"2021-08-02T14:27:54.933Z","canSponsorStudentVisa":"yes","cycle":"2024"}
