{"id":"a6aacb94-83fb-467b-be1f-8d6b1e390231","name":"Primary with Mathematics","code":"2VP5","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"286cf12f-b3e3-41c5-9f33-2ff7807d2df0","code":"03","name":"Primary with mathematics"}],"locations":[{"id":"ade86779-2b68-4e9f-bd1f-b21dd23c2abd","name":"Barnes Primary School","isPublished":"N","status":"N","vacancies":"F"},{"id":"a4bf3002-43a1-4583-af52-d057010dff45","name":"Fox/Ashburnham Federation & Avonmore Primary School","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"567b32af-2b43-499d-a9ae-b407f35d5780","code":"1EL","name":"West London Teacher Training Alliance (Primary)"},"accreditedBody":{"id":"33037eab-f75d-4350-b1e2-967c41e9d4c6","code":"R48","name":"Roehampton University"},"profPost":"PG","english":"3","maths":"1","science":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"financialSupport":"SCHOOL BURSARIES\r\n\r\nIn addition to the DfE bursary mentioned above, all trainees on this course will receive an extra bursary from the school.   Full details of this unique additional funding can be seen in the tab on the Primary Courses page on our website: [WLTSA Primary School Bursaries](http://www.wltsa.org.uk/initial-teacher-training/primary-courses/wltsa-primary-school-bursaries/).\r\n\r\nOTHER\r\n\r\nWhile not provided by WLTSA directly, as a full time student you are eligible for cheaper travel in London using a student oyster card and in many boroughs you can get a reduction on your council tax payments as a full time student.","aboutCourse":"QUALIFICATION OUTCOME\r\n\r\nThis course 2VP5 leads to PGCE(M)QTS.  [The significance of different teacher training qualifications](http://www.wltsa.org.uk/initial-teacher-training/primary-courses/qualification-outcomes/)\r\n\r\nSPECIAL FEATURES\r\n\r\nThis course is run by the West London Teaching School Alliance (WLTSA) in partnership with (and accredited by) the University of Roehampton with extra funding for trainees above DfE provision, see 'Financial Support' below.\r\n\r\nWLTSA enables you to choose your host school at application.  If during the training year there is a teaching vacancy in your school and they are keen to retain you, you can be employed for the following year without the post being advertised.  By becoming a WLTSA trainee, all our 43 primary schools could employ you this way; we operate a pool.  \r\n\r\nOur aim is to produce exceptional teachers who can then remain in alliance schools, continuing to further their career with the benefit of our on-going CPD.\r\n\r\nTHE TRAINING\r\n\r\n‘Primary with Maths’ trains you to be a general primary teacher, but with an extra focus on mathematics so you could later lead on maths in a school.   \r\n\r\nMost of the training occurs in your host school (and at the school that WLTSA select as a contrasting placement for approx. 6 weeks in the Autumn), but you still enrol as a student at the university with full access to their facilities and mentors. \r\n\r\nPart of your training is delivered from the university and part from our strategic lead primary (Fox Primary School, W8).  Fox is rated ‘Outstanding’ by Ofsted, with very high academic standards and significant experience of teacher training.\r\n\r\nAt school, through an initial programme of observations you will become familiar with the organisation and working of the school (pupil groups and pastoral systems, staffing, curriculum, resources, facilities, approaches to learning and teaching, lesson planning and assessment). \r\n\r\nYou will be treated like a member of staff.  With your school mentors, you will feel supported as you progress and become ready to teach. Our mentors are excellent teachers and undertake rigorous training to develop their mentoring skills. In school, you will have the opportunity to develop your teaching expertise and relationships with children in a familiar environment. \r\n\r\nYour university tutor will visit to monitor your progress at both schools, to discuss your development with you and your mentors. You will maintain close links with your host school throughout the programme. WLTSA also provides additional opportunities /seminars.","interviewProcess":"The interview process for this course may change as the year progresses depending on the Covid situation.\r\n\r\nPrior to Covid we had face to face interviews at your chosen school and you would be asked to bring your original qualification certificates where possible.\r\n\r\nWe have now moved to an online interview system and we anticipate that this new system will persist certainly throughout the autumn term, and possibly for the remainder of the year.\r\n\r\nYour application will be considered by your chosen school, in collaboration with the WLTSA centrally and the university.  This process is administered by the WLTSA Teaching School office.  We will confirm that you have been shortlisted but you will be sent technical arrangements for the interview directly by the school.\r\n\r\nYou will need to email scans of your degree and Maths, English and Science qualifications if available to WLTSA centrally (Pippa Currey) pcurrey@sacredh.lbhf.sch.uk\r\n\r\nIf you are still taking your degree or GCSE equivalency tests, that’s fine but if you don’t have access to original certificates of exams already taken for your degree and maths, English  and science GCSEs, this is something that you should start to resolve now.  If you don’t have them in time for the interview, please be assured that we can still make an offer to you but it would be subject to later verification of original documents and sometimes certified copies can take a while to arrive.\r\n\r\nWe try to ensure that you have at least a week’s notice of interviews.","howSchoolPlacementsWork":"With WLTSA you select the main host school at application.  We then later arrange your second placement at another contrasting WLTSA school to provide greater depth to your training experience. \r\n\r\nCHOOSING YOUR SCHOOL\r\n\r\nThis particular course is being run at only one of our host school ‘groups’ - Fox Federation. Fox Federation comprises three schools and your preferred school within this group is a matter that you could discuss at interview with them.\r\n   \r\n* Barnes primary School, SW13\r\n* Fox Federation (3 schools, W8, SW10, W14)\r\n\r\nYou can read a description of all these schools in our overall [WLTSA Primary School Summary Descriptions](http://www.wltsa.org.uk/initial-teacher-training/primary-courses/wltsa-primary-school-summary-descriptions/).  Our [Map of WLTSA Schools](http://www.wltsa.org.uk/map-of-all-wltsa-schools/) may also be helpful.\r\n\r\nPlease be aware that we have many other [salaried and unsalaried primary teacher training courses] (http://www.wltsa.org.uk/initial-teacher-training/primary-courses/)  at other schools.  You can make three choices overall when you apply.\r\n\r\nTHE TECHNICAL BIT!\r\n\r\nYou don’t have to restrict yourself to one school within a course, but each school would count as one application and you get three choices overall in Round 1.  Please also be aware that we have so many partner schools that we have been forced to split artificially on UCAS into three provider names.  See [How to apply & how to choose more than one school on a course](http://www.wltsa.org.uk/initial-teacher-training/primary-courses/how-to-apply-how-to-choose-more-than-1-school-on-a-course/). \r\n \r\nBE STRATEGIC WHEN YOU APPLY\r\n\r\nYou can always contact us to ask how many applications (if any) are being considered by different schools at the point that you are about to apply.  We also keep our website up to date so that you can see which schools have already shortlisted and are interviewing. ","personalQualities":"We want you to have passion and enthusiasm.  We need trainees who can engage and inspire students to a love of learning, who are:   \r\n\r\n*committed to championing their students;\r\n*open to learn about children’s physical/social/emotional/cognitive needs and how these can affect behaviour;\r\n*in good health with the ability to cope with stress.  Teaching is incredibly rewarding, but it also requires an element of resilience!\r\n*professional and committed to equal opportunities;\r\n*able to communicate well in written/spoken English, with at least basic computer skills and commitment to developing these.\r\n*have a sense of humour and an ability to laugh at yourself.\r\n","otherRequirements":"A realistic understanding of the role of a teacher and of issues facing the profession, is important. Tutoring experience could be helpful.  We recognise that it may not be possible to spend a couple of days observing relevant lessons while schools are maintaining discrete separation of their pupils in relation to Covid.  [Top tips for getting some observational experience](http://www.wltsa.org.uk/initial-teacher-training/secondary-courses/school-experience/).\r\n\r\nIf you wish to train at one of our faith schools, they will also be looking for someone sympathetic to the values of their faith.\r\n","status":2,"createdAt":"2021-07-06T10:55:21.121Z","canSponsorStudentVisa":"yes","cycle":"2024"}
