{"id":"a3efc199-29c7-4d0b-aed6-2f3d46ff4894","name":"Art and Design","code":"373R","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"d461a678-3335-4ca2-9616-1dc479d31a49","code":"W1","name":"Art and design"}],"locations":[{"id":"d64e8852-9797-44d8-9b08-904fc7b13516","name":"St Clere's School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"53c3b0c5-2331-4a5f-9369-e0d77207f763","code":"1CN","name":"TTTC (Thurrock Teacher Training Company)"},"accreditedBody":{"id":"de0e702b-b19b-4594-b433-aa49be29f4d9","code":"H40","name":"Tes Institute"},"profPost":"BO","degreeGrade":"9","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feeDetails":"£9250 for the PGCE and £8625 for Qualified Teacher Status only.","aboutCourse":"All of our schools have a track record with working with university PGCE providers and other ITT providers.  St Clere's has lead high quality teacher training for over 15 years which ensures that cooperation between the schools is established and remains a strength of the partnership.  Each school provides a fully trained mentor for each trainee, support by a Pathway Tutor from TES institute who visits every half term to monitor progress and helps quality assure the programme.  This route has provided consistent employment for trainees within the partnership on completion of their training.  In 2020-21, all of the trainees had been employed before the end of the course, the majority in the schools where they had trained.\r\n\r\nSuccessful applicants can choose to gain Qualified Teacher Status (QTS) or PGCE which costs a little more in fees.","interviewProcess":"You will be trained in schools which have finely developed systems in place to nurture development of the whole teacher and equip that trainee teacher with the 'tools of the trade'.  St Clere's will place  you in one of our partnership schools.   Each successful trainee is placed in a school for the majority of the placement and the training will be provided by expert practitioners.  \r\nDuring the interview process you will be asked to deliver an activity to a small group of pupils as well as a formal interview and a written English  and numeracy task.","howSchoolPlacementsWork":"There are 17 schools in the partnership, including many outstanding or good features and managed by Thurrock Teacher Training.  The unique blended learning programme combines the best of school based training, online learning materials, a network of experienced subject specialists to deliver pedagogy and subject knowledge and a number of off-site visits to special schools, primary schools and Leading Teacher days.\r\nSubject Knowledge enhancement is provided on-line as part of the course delivery.  Several days will be spent in a local primary school to gain Key Stage 2 experience and there will be visits to a Special School of which we have two in our Alliance.  \r\nA dedicated Face to Face programme takes place each week at St Clere's School.  In the spring term, there is a 6 week second placement in a contrasting school setting usually one of the partnership schools.  Some of the partnership schools have 11-18 intake and offer Key Stage 5 opportunities.  All of the schools are fully comprehensive.","personalQualities":"Thurrock Teacher Training wish to find dedicated and inspiring individuals passionate to get into teaching.  The course requires good organisational skills and would suit candidates who are proactive and committed. ","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:53:06.470Z","updatedAt":"2021-09-30T10:16:17.082Z","canSponsorStudentVisa":"no","cycle":"2024"}
