{"id":"b886dd31-5030-4c8f-8f6f-e42d9eb92988","name":"Primary with Mathematics","code":"4R09","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"286cf12f-b3e3-41c5-9f33-2ff7807d2df0","code":"03","name":"Primary with mathematics"}],"locations":[{"id":"e8189f45-0c2c-482c-8f5f-8c8997473c3e","name":"Kingston Primary","isPublished":"N","status":"S","vacancies":"F"},{"id":"b4fa00f4-af7a-44d2-a897-3b0ad703cef6","name":"Hadleigh Junior school","isPublished":"N","status":"S","vacancies":"F"},{"id":"46a7609e-593b-4086-a9cc-c8ff806c240a","name":"Kents Hill Junior","isPublished":"Y","status":"R","vacancies":"F"},{"id":"f73089ea-fea6-412c-b4c9-5f9fc4317756","name":"Ghyllgrove Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"1fb2abf8-925c-41fe-bda2-a3af9077d0e4","name":"Lubbins Park Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"75baaad2-3051-4805-90b3-aaa870ef924b","name":"Northwick Park Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"8390a80e-79a4-48a4-a264-de1aea8fe83a","name":"Westwood Academy","isPublished":"N","status":"S","vacancies":"F"},{"id":"342e40ad-de74-49a2-b61e-bdee0a3b4300","name":"Leigh North Street","isPublished":"N","status":"S","vacancies":"F"},{"id":"afcec60d-2017-461a-ba9f-290ce6912a87","name":"Canvey Infant School","isPublished":"N","status":"S","vacancies":"F"},{"id":"e17b1409-79f9-458a-a51b-b01fe8384b58","name":"Grove Wood Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"021503d4-8f14-429b-895a-b981529ce5b8","name":"Edward Francis Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"a7b23800-aae1-4f4f-b66a-1ab7c666ad2e","name":"Canvey Junior School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"b9ddf655-011d-43ef-b161-7c6bbf6423a8","name":"Montgomerie Primary school","isPublished":"Y","status":"R","vacancies":"F"},{"id":"53cca3a4-94f1-4f2f-8dd1-7a0745f962ab","name":"Winter Gardens Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"6de0085d-10ce-48e3-852a-53ec6cae08ad","name":"Woodham Ley Primary","isPublished":"Y","status":"R","vacancies":"F"},{"id":"04f045a4-436d-41e3-92fb-ad5a01669ec7","name":"Robert Drake Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"e497144c-7441-444b-bfcb-1ce39bb0505b","name":"Bardfield Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"901cbf07-8fd3-402f-a87f-ecc42e73b796","name":"Jotmans Hall Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"e64a572b-ed4b-46f4-bc62-c828c747d65b","name":"Thundersley Primary School","isPublished":"N","status":"S","vacancies":"F"},{"id":"b6ae9f8e-e304-4bad-80d6-22c225bb495f","name":"South Benfleet Foundation Primary School","isPublished":"N","status":"S","vacancies":"F"}],"trainingProvider":{"id":"1274db06-d413-4798-bc6f-d4deda140b19","code":"1JH","name":"Benfleet Team Supporting All"},"accreditedBody":{"id":"de0e702b-b19b-4594-b433-aa49be29f4d9","code":"H40","name":"Tes Institute"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feeDetails":"ITT tuition fees for academic year 2022/23\r\n•\t£8,625 ITT leading to QTS only\r\n•\t£9,250 ITT leading to QTS and a PGCE\r\n\r\nTrainees may choose to use their NCTL bursary to cover some or all of their tuition fees if available. Payment options may also be available on request to TES Institute but an additional administration fee may apply.\r\nITT bursary\r\nDepending on the subject that you wish to teach, you may be eligible to receive a tax-free ITT training bursary from the National College for Teaching and Leadership (NCTL). The amount of funding that you may be able to receive depends on the level of your degree qualification, the subject that you want to teach and you meeting all of the eligibility criteria. This bursary payments offered vary from year to year as recruitment priorities change nationally. \r\nTeacher training grants and loans\r\nApplicants may be able to apply for a tuition fee loan and/or a living cost loan or grant through the Student Loans Company to help with costs associated with the programme.  \r\nFor full details of the ITT bursaries and eligibility criteria visit https://getintoteaching.education.gov.uk/bursaries-and-funding.\r\n","aboutCourse":"Our highly effective School Direct Initial Teacher training Programme for Primary trainees is delivered in school through a blended learning approach. The combination of face to face training, online learning and 1-1 personalised feedback will enable you to develop the skills, knowledge and experiences needed to be a successful and highly respected teacher. \r\n\r\nThe BTSA and its partner schools provide in-school training and teaching practice supported by highly skilled mentors and their departments. Mentors will meet with you formally for a minimum of one hour per week and ensure that you receive a formal lesson observation every week with targeted feedback. \r\nYou and others in your cohort will meet on a regular basis to participate in training and discuss your views and opinions. In this way you will establish the confidence to use your personality in the classroom and develop your own personal style.  \r\n\r\nYou will be treated as a member of the school staff from the moment you start and as such have the opportunity to have a real impact on the life of the school. This also brings great accountability as what you do really does matter. \r\n\r\nTES Institute, our strategic partner provides you with high-quality on-line learning materials, many of which are delivered by national experts in their field. These are studied in your host school during the designated study day.  Highly qualified and experienced Pathway Tutors (external mentor) will provide you with the interactive feedback and will support and challenge you, along with the school mentor, throughout the programme. \r\n\r\nYour pathway tutor will monitor your progress in these learning modules with interactive feedback. They will visit you a minimum of six times in the year, for half a day per half term. During their visits they will observe you teaching and provide bespoke feedback on what they have seen. Specific objectives will then be agreed for you to deliberately practice. Monitoring of your progress will be ongoing as you progressively gain the skills and knowledge needed to be effective in the classroom. \r\n\r\nThe course is assessed through observations by your mentor, your external tutor and the senior managers of your school. You will compile a portfolio of evidence against the Teachers’ Standards across the year, completed by the end of the course. There will also be three written assignments if opting for the PGCE route and two assignments for QTS only.","interviewProcess":"We will assess your application form to see if you have met our entry requirements. Your application should be presented in an accurate and professional manner. Your personal statement is your opportunity to provide your reasons for wishing to pursue a career in teaching, to mention any additional skills you may have and to reflect on your experiences.\r\n\r\n If you are shortlisted you will be invited for an interview at one of our partnership schools. Representatives from up to three of the partnership schools may be present at the interview. \r\n\r\nThe Interview day will involve an observation of you teaching a class for at least 30 minutes. Advance notice will be given of the topic, year group and ability of the children that you will be teaching. This will be followed by a formal interview where you will be asked to reflect on what went well during your lesson and on areas for development.\r\n\r\nThe BTSA and every partner school is committed to safeguarding and promoting the welfare of children and young people.  All staff and volunteers must share this commitment.  Successful candidates will be subject to an Enhanced Criminal Record Disclosure  from the Disclosure and Barring Service along with other relevant employment checks, including overseas criminal background checks, where applicable. All new trustees, employees and volunteers will be required to undertake safeguarding training in induction which will be regularly updated in line with statutory guidance. \r\n\r\n\r\n\r\nBoth references will be verified and if necessary follow up checks made.","howSchoolPlacementsWork":"We have listed all partnership schools who could potentially offer to host trainees in this subject. If you identify a preference for a host school at application stage we will endeavour to see if this is possible.  However, due to changing circumstances this cannot be guaranteed. \r\n\r\nWhen selected for interview up to three of our partner schools could be present at your interview. If you are offered a training place by more than one school you will have the opportunity to visit the schools to spend some time getting to know the school, students and the staff in your subject department. Once you have done this you make the choice as to which of the schools in which you would like to train. \r\n\r\nSchools in the BTSA \r\nInfant and Primary\r\nBardfield Academy, Basildon\r\nCanvey Infant School, Canvey Island\r\nCanvey Junior School, Canvey Island\r\nGhyllgrove Primary, Basildon\r\nHadleigh Junior School, Hadleigh\r\nJotmans Hall, Benfleet\r\nKents Hill Junior School, Benfleet\r\nKingston Primary, Thundersley \r\nLeigh North Street, Leigh on Sea \r\nLubbins Park Primary School, Canvey Island\r\nMontgomerie Primary School, Benfleet\r\nNorthwick Park Primary, Canvey Island\r\nRobert Drake, Benfleet \r\nSouth Benfleet Primary School, Benfleet\r\nThundersley Primary School, Thundersley\r\nWestwood Academy, Thundersley \r\nWinter Gardens Academy, Canvey \r\nWoodham Ley Primary, Benfleet\r\n\r\n\r\nThe main placement will be in your host school from the start of September to the beginning of July with a second placement in a school in a contrasting context, from January to February half term. \r\nYou will also have a two day visit to a school at the key stage below or above that in which you are training. There will also be a one day visit to Special educational needs school and a one day visit to a school with a high proportion of pupils with English as an additional language.\r\n","personalQualities":"Teachers are required to communicate with a wide range of people  therefore it is essential that applicants can demonstrate excellent communication skills.  Teaching is a challenging and demanding career both in terms of the training and the actual role. To ensure that we train teachers who go on to be successful, it is essential that applicants are fully committed to a career in teaching, understand exactly what such a career involves and have the necessary resilience . Having a sound grasp and understanding of  your subject and being enthusiastic about working with young people is essential. ","otherRequirements":"School experience is not essential and we welcome applications from all interested candidates.\r\n\r\nIf you are interested in getting classroom experience this could help you decide whether teaching is right for you and we will happily help you arrange this in one of our partner schools.\r\nOn a school experience visit, during your time in a school, you will have the opportunity to:\r\n*talk with teachers about day to day school life\r\n*observe teaching and pastoral work\r\n*watch a range of lessons and age groups being taught\r\n\r\nContact: mhoward@theappletonschool.org to discuss arranging a visit. ","status":1,"createdAt":"2021-07-06T10:52:39.605Z","updatedAt":"2021-09-15T12:27:23.613Z","canSponsorStudentVisa":"no","cycle":"2024"}
