{"id":"90681b6b-4071-4cad-a407-1b30ce0b24c7","name":"Art and Design","code":"L966","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"other","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"d461a678-3335-4ca2-9616-1dc479d31a49","code":"W1","name":"Art and design"}],"locations":[{"id":"061a4561-9252-413b-bebf-a5325bd454fe","name":"Main Site","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"2016ba42-fef9-4ccd-8657-9bddaae97e4f","code":"1DR","name":"Portsmouth and Solent Training Alliance"},"accreditedBody":{"id":"113c549b-e314-4bbb-bde7-20ed63d7dfb4","code":"1X9","name":"The Hampshire SCITT Partnership"},"profPost":"PG","english":"3","maths":"3","science":"9","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9000,"feesInternational":14000,"feeDetails":"Our HEI partners Initial Teacher Training fees are £9,000 per academic year.\r\n\r\nInternational students fees are between £14,000 and £16,000 depending upon the HEI\r\n\r\nSome subject areas have a tax free bursary available and further information can be found at (https://getintoteaching.education.gov.uk/funding-and-salary/overview)\r\n\r\nThere are three type of funding available for teacher training and depending on your circumstances you may receive all three: tax free bursary, tuition fee loan and maintenance loan and additional financial support if you are a parent or have a disability.\r\n","aboutCourse":"Training in school and learning ‘on the job’ alongside experienced teachers is the best way to gain first-hand experience of teaching. Your training year will be underpinned with regular theory sessions and pedagogy either delivered weekly with our partner alliance in Southampton or at our Portsmouth training centre (both of whom are Ofsted Outstanding providers). Typically you will be based in school four days a week and attend training on day five.\r\n\r\nWe believe it is important that trainees feel part of the school environment from Day 1 so we usually host our interviews in school. This is an opportunity to meet the staff and feel part of their community before you officially start in September.\r\n\r\nTo ensure you have the best start in school we deliver pre-course training on 12 and 13 July and 1,2,3 September 2021 before starting in school on 6 September. These training days are delivered in our dedicated training centre where you will meet fellow trainees, gain an understanding of the programme and receive the underpinning training that best prepares you for your first few days in school e.g. behaviour management, lesson observations, Teacher's Standards etc. Our trainees say they really value these sessions. \r\n\r\nEvery trainee is allocated a mentor who is a highly-experienced teacher and will offer personalised support and guidance throughout the year. Weekly mentor meetings will focus on setting short and long-term targets as well as reviewing your progress against the Teachers' Standards. You will feel like a valued member of staff as you will attend staff meetings and school training sessions. Assessment takes place in a variety of forms e.g. weekly formal lesson observations, weekly review meetings, academic assignments and gathering evidence towards the Teachers Standards.\r\n\r\nYou will be assigned a host school for the autumn and summer term and in the spring term you will spend a minimum 6 weeks in another school to teach in another Key Stage. All school placements are discussed with you and organised by the Teaching School Alliance.\r\n\r\nOn successful completion you will achieve a PGCE with the option of 60 Masters Credits) and QTS. We are so proud that we have a strong track record and 100% of our School Direct trainees pass and subsequently find employment in schools.\r\n\r\nIf you want to be part of our success, then join us on your journey to teaching.\r\n","interviewProcess":"Your application is important to us and we will carefully consider you for interview. You will be interviewed by us and one of our alliance schools so you can meet the team and/or department from the beginning.  \r\n\r\nInterview day includes:\r\n\r\nWritten task, group discussion, micro teach, interview, short teaching session and a review of your Art Portfolio.\r\n\r\nYou will be given at least one week's notice to prepare for your interview. We appreciate that you will feel a little nervous and we take that into account. We look for your potential to teach and how you will engage with and interact with pupils. Feedback from applicants shows that they really value our interview days.\r\n\r\nOnce accepted you will be invited to our pre- course training days.\r\n\r\nSelection criteria\r\n\r\nWe are looking for potential, not the finished article.\r\n\r\nApplicant qualities:\r\n\r\nConfident, articulate and who can communicate clearly in written and spoken English.\r\nCommand the attention of young people and adults.\r\nCan demonstrate a passion for working with young people.\r\nUnderstand the importance of being professional and committed.\r\nBe open to learning and adaptable to changing situations.\t\r\nWork collaboratively as a member of a team.\r\nA willingness to work beyond the 'school day'.\r\nHave a good sense of humour and an ability to laugh at oneself.\r\nBe resilient and in good health.\r\nBe confident in the use of Information and Communication Technology (ICT).\r\nHave gained some school experience so you know that a school environment is for you.\r\n\r\n","howSchoolPlacementsWork":"As we interview with partner schools you will know your placement school early on. The advantage of this is that you will feel part of their community and can visit school before you start.\r\n\r\nWe work with over 40 primary and secondary schools in Portsmouth, Hampshire and the Isle of Wight. When shortlisting for interview we select you based on your geographical area, skills and experience. The interview stage is an opportunity to select applicants who show great potential to teach.\r\n\r\nYou will spend the autumn and summer term in your host school and then in the spring term you will spend a minimum of 6 weeks in a different Key Stage or setting.\r\n\r\nOur School Direct route has the advantage of starting in school from the beginning of term and experiencing the academic year cycle which prepares you for your Newly Qualified Teacher training year (NQT). Generally you will spend four days in school and one day in training.\r\n\r\n\r\n\r\n\r\n","personalQualities":"We are looking for confident, enthusiastic, ambitious and talented graduates who are passionate about improving educational outcomes for children of all abilities. Ideally you should have some experience working with young people within the age group you wish to teach. This may be as little as a day in school or other work/voluntary work with young people. If you are a career changer then we know you will have many transferable skills to share in the classroom. Most importantly you need to be a good communicator and someone who enjoys encouraging young people to learn.","otherRequirements":"You need to be a competent user of ICT.\r\n\r\nDisclosure and Barring Service\r\nWe have a duty to protect children and ensure that they are not put at risk. Successful completion of an Enhanced Disclosure Certificate from the DBS.\r\nThis is free once you have enrolled.\r\n\r\nMedical Fitness\r\nTeaching is physically and mentally demanding and there are fitness requirements set by the DfE for applicants to initial teacher training programmes. Successful candidates will be sent a relevant health questionnaire to complete. Your GP may charge a fee.","status":2,"createdAt":"2021-07-06T10:51:31.390Z","canSponsorStudentVisa":"no","cycle":"2024","applicationsOpenDateOther":"2021-10-15T00:00:00.000Z"}
