{"id":"27fac711-57ec-4471-a657-0c87e20abc37","name":"Primary","code":"D635","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"16244f78-7a4b-4452-9817-45290eaa5adf","name":"Brent Initial Teacher Training partnership -  Main Site Primary","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"b5828845-f49c-4b21-843a-0ab64f4d7b24","code":"25Z","name":"Brent Initial Teacher Training (BITT)"},"accreditedBody":{"id":"9188f17a-79c4-43a9-b459-4952815b739a","code":"M80","name":"Middlesex University"},"profPost":"PG","degreeGrade":"1","english":"1","maths":"1","science":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"PGCE with QTS - School Direct Tuition Fee route\r\nStudents will join the PGCE programme for training at Middlesex in September, however the placements will be arranged by the BITT within its partnership of schools. \r\n\r\nThe School Direct Tuition Fee programme provides the opportunity to gain a postgraduate qualification, which can be used towards a master's degree in the future. This will enable you to develop your skills for teaching and for understanding the interrelationship between learning and teaching, as you develop in to a critically reflective practitioner. \r\n\r\nThe programme is designed to include 120 days of school-based training, this will provide you with opportunities to teach across the 5-11 age range. Brent Initial Teacher Training (BITT)  is a strong partnership of primary and secondary schools working with Middlesex University to provide high quality teacher training. Our vision is to train and develop the next generation of outstanding teachers. \r\n\r\nStudent teachers will be trained in a highly supportive and aspirational environment and will develop the rigour, professional knowledge, understanding and skills necessary for the delivery of creative, purposeful and challenging teaching and learning. Training will be delivered by expert teachers within our partnership of schools, with a wealth of experience to support your professional development.\r\n\r\nMiddlesex University provides the PGCE central training programme (60 days),  which includes lectures, seminars and practical workshops these will be provided in a blended learning environment.\r\n\r\nModules:\r\nLearning and Teaching : a broad and balanced curriculum (30 Credits)- Compulsory\r\nPrimary Professional Development One (School-based) (30 Credits)- Compulsory\r\nAcross the curriculum, beyond the classroom (30 Credits)- Compulsory\r\nPrimary Professional Development Two (School-based) (30 Credits)- Compulsory\r\n\r\nAll University-based modules are assessed by coursework. School-based modules are assessed against the standards for Qualified Teacher Status (QTS). \r\n\r\nYou will critically evaluate the effectiveness of a wide range of resources and your own lesson plans. You will analyse research data and critically evaluate how research has contributed to the knowledge and understanding of how to teach effectively.\r\n\r\nCompleting the course will lead to the award of PGCE with QTS.\r\n\r\nhttps://www.mdx.ac.uk/courses/postgraduate/primary-education-qts ","interviewProcess":"You will attend an interview at one of the BITT's partnership of schools; a subsequent interview may take place with the University. \r\n\r\nYou will be asked to engage in a short activity with a class of children to assess your interaction and communication skills with young people.\r\n\r\nAt the interview stage, your suitability for teaching will be assessed including your subject knowledge for teaching and competency in the fundamental skills of English and maths. If any shortfall is identified, you may be required to complete some additional work to secure the appropriate level of competency before being accepted on the programme. During the programme, your competency in these areas will be assessed and developed to ensure you reach the required level.","howSchoolPlacementsWork":"Students will join the PGCE programme for training at Middlesex in September, however the placements will be arranged by the BITT within its partnership of schools. \r\n\r\n- Byron Court Primary (Lead school)\r\n- Sudbury Primary\r\n- Mount Stewart Schools\r\n- Uxendon Manor Primary\r\n- Oliver Goldsmith Primary\r\n- Elsley Primary\r\n- Preston Manor Lower\r\n- Preston Park Primary\r\n- Barham Primary\r\n- Wykeham Primary\r\n- Kingsbury Green Primary\r\n- Wembley Primary\r\n- East Lane Primary\r\n\r\nThe programme includes 120 days of school-based training across 3 school based experience blocks. 2 of these will be in your main placement school and the 3rd in a different school setting, within the BITT partnership. \r\n\r\nTeaching placements with our partnership of schools will enable you to understand, critically evaluate and respond to the needs of children in multicultural, multilingual and multi-faith settings.\r\n\r\nThe consortium of schools within the BITT involved in the delivery of Initial Teacher Training has a high level of expertise and strong commitment to delivering high quality training. We have been successfully training teachers for many years. \r\n\r\nWithin the school setting you will be allocated an experienced mentor to guide you. We try to create an environment in which staff, pupils and trainee teachers’ alike feel valued and supported. Our staff are our most valuable resource and have a proven track record in training and professional development. Our teachers are excellent practitioners with exemplary behaviour management strategies and are eager to share their skills, knowledge and practice with the next generation of teachers.\r\n\r\nInitially, you will observe and then assist the class teachers before taking responsibility for the classes for a substantial period in the spring and summer terms. Your teaching timetable will reflect your trainee status and will give you plenty of time to shadow and observe, plan and prepare.","personalQualities":"We are looking for ambitious trainee teachers who demonstrate their passion and enthusiasm for teaching and have a desire to share this with young people. \r\n\r\nYou should be highly motivated, able to adapt and have the resilience to work well under pressure. Ideal candidates will be organised and demonstrate good inter-personal skills.\r\n\r\nTrainees should have the ability to reflect critically on their own practice and progress.\r\n","otherRequirements":"All applicants will be expected to have gained some experience in a classroom, ideally prior to interview. \r\n\r\nTeacher Training providers have a responsibility to ensure that trainees have the health and physical capacity to teach and will not put children at risk of harm. All applicants will be required to successfully complete Occupational Health and Disclosure Barring Service (DBS) Enhanced Disclosure checks.\r\n\r\nIf you have lived, worked or travelled in another country for three months or longer in the last ten years, you will need to obtain a Certificate of Good Conduct from the relevant country/countries.\r\n\r\nPlease see; www.mdx.ac.uk\r\n","status":1,"createdAt":"2021-07-06T10:54:32.541Z","updatedAt":"2021-07-23T08:13:08.076Z","canSponsorStudentVisa":"no","cycle":"2024"}
