{"id":"7115edcc-8b12-4ce9-a318-0ee9f3bd05ef","name":"Chemistry","code":"3FRN","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"912d4fb4-761b-42e9-8dc6-e968b791ea4e","code":"F1","name":"Chemistry"}],"locations":[{"id":"e579a58d-9741-4e6c-bc97-39fd2a7cd976","name":"Claremont High School","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"b5828845-f49c-4b21-843a-0ab64f4d7b24","code":"25Z","name":"Brent Initial Teacher Training (BITT)"},"accreditedBody":{"id":"9188f17a-79c4-43a9-b459-4952815b739a","code":"M80","name":"Middlesex University"},"english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","aboutCourse":"The School Direct (Salaried) programme is an employment based route.\r\n\r\nThe BTSA offers a comprehensive training programme throughout the year to support your professional development. You will be in school from the first day of the school year so you will feel part of the team from day one. From the beginning you will be treated like a member of staff and will attend staff meetings and parents’ evenings. You will be assigned a mentor from the staff of your host school. Our mentors are outstanding teachers with a wealth of experience including but not limited to coaching, effective classroom observation and feedback skills. \r\n\r\nThe Salaried programme involves attending a programme of lectures and workshop at Middlesex University for 20 days during the Autumn and Spring terms. These sessions will engage with generic and subject specific areas and will encourage you to become a reflective teacher.  They will\r\n•\tProvide you with opportunities to enhance your knowledge and pedagogy of your subject, or specialist area of the curriculum.\r\n•\tDevelop your understanding of key contemporary issues within education, such as those around inclusion or EAL and SEND provision in schools.\r\n\r\nYou will critically evaluate the effectiveness of a wide range of resources and your own lesson plans. You will analyse research data and critically evaluate how research has contributed to the knowledge and understanding of how to teach effectively.\r\n\r\nYou will also be assigned a university tutor who will help to create your bespoke training programme as well as support your development as a teacher through, visits to school and guidance with assignments.  \r\n\r\nCompleting the course will lead to the award of PG Certificate in Teaching and QTS.\r\nhttps://www.mdx.ac.uk/courses/postgraduate/school-direct-qts\r\nhttps://www.mdx.ac.uk/courses/postgraduate/teaching-pgcert\r\n\r\n\r\n\r\n\r\n\r\n","interviewProcess":"The Head of Department at the 'host' school will be interviewing you along with a member of the Senior Leadership Team. \r\n\r\nYou will also be asked to prepare a lesson or part of a lesson in your subject to deliver to a group of students in order to assess your interaction and communication skills with young people. \r\n\r\nAt the interview stage, your suitability for teaching will be assessed including your subject knowledge for teaching and competency in the fundamental skills of English and Maths. If any shortfall is identified, you may be required to complete some additional work to secure the appropriate level of competency before being accepted on the programme. During the programme, your competency in these area.\r\n\r\nOne interview will take place at the school and then a further interview may take place with the university.","howSchoolPlacementsWork":"Your training will be predominantly based at the host school, your employing school with the exception of a second placement at another secondary school for approx. 6 weeks in the second term.\r\n\r\nThrough an initial programme of observations and research you will become familiar with the organisation and working of the school and department (pupil groups and pastoral systems, staffing, curriculum, resources, facilities, methods of teaching, lesson planning, and assessment).\r\n\r\nYou will be allocated an experienced mentor to guide you from the first day of your training. Your teaching timetable will reflect your trainee status and will give you plenty of time to shadow and observe, to plan and prepare and to read and research current theory and practice. \r\nYour practical learning will be enhanced by your attendance at Middlesex University for central training sessions where you will also be allocated a tutor to oversee both your academic studies and the development of your classroom practice. \r\n","personalQualities":"We are looking for ambitious trainee teachers who demonstrate their passion and enthusiasm for teaching and have a desire to share this with young people. \r\n\r\nYou should be highly motivated, able to adapt and have the resilience to work well under pressure. Ideal candidates will be organised and demonstrate good inter-personal skills.\r\n\r\nTrainees should have the ability to reflect critically on their own practice and progress.\r\n\r\n\r\n\r\n\r\n\r\n","otherRequirements":"All applicants will be expected to have gained some experience in a classroom, ideally prior to interview. \r\n\r\nYou must be judged suitable to work with children after being subject to a Disclosure and Barring Service enhanced disclosure check and other required background checks. \r\n\r\nIf you have lived, worked or traveled in another country for three months or longer in the last ten years, you will need to obtain a Certificate of Good Conduct from the relevant country/countries.\r\nPlease see; www.mdx.ac.uk","status":2,"createdAt":"2021-07-06T10:54:31.543Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"BTSA Salaried School Direct trainees are paid on point one of the unqualified teachers' scale (Band A, Inner London) area.\r\n\r\nFees for the course are paid directly by the BTSA to the University.\r\n\r\nAs a salaried trainee you will not be entitled to a bursary.\r\n"}
