{"id":"9445936a-550e-43db-b602-984b5c7a64c4","name":"Mathematics","code":"3FRX","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"72345aa7-096c-488f-8649-085b8178cadb","code":"G1","name":"Mathematics"}],"locations":[{"id":"5ef401c4-695a-43f9-830e-c4ccb922deec","name":"Preston Manor School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"ca8b4196-3d12-4efd-b408-dc47ae3c21bc","name":"Wembley High Technology College","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"b5828845-f49c-4b21-843a-0ab64f4d7b24","code":"25Z","name":"Brent Initial Teacher Training (BITT)"},"accreditedBody":{"id":"9188f17a-79c4-43a9-b459-4952815b739a","code":"M80","name":"Middlesex University"},"profPost":"PG","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"Applicants are required to have a second-class honours degree 2:2 or above with at least 50% Maths content supported by a strong A Level (or equivalent)","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"financialSupport":"If you are successful in your application to teach Maths, you could be eligible for a tax-free bursary.\r\n\r\nWith a first, 2:1, 2:2, Master’s or PhD, you could get a £24,000 tax-free bursary while you train as a teacher.\r\n\r\nWith or without a bursary or scholarship, you can still access a Tuition Fee Loan and Maintenance Loan to help fund your training and cover tuition fees,","aboutCourse":"This School Direct Secondary programme will prepare trainees in line with the requirements of the Teachers’ Standards (2012) for the award of QTS.\r\n\r\nYou will attend university training days at Middlesex alongside trainees recruited via other routes. You will carry out academic assignments leading to the award of masters level credits.\r\n\r\nThe School Direct Secondary PGCE develops effective, confident teachers whose classroom practice is informed by an advanced knowledge of educational theory, and who will continue to learn and reflect throughout their careers. You will critically evaluate the effectiveness of a wide range of resources and your own lesson plans. You will analyse research data and critically evaluate how research has contributed to the knowledge and understanding of how to teach Maths effectively.\r\n\r\nWe will help trainees to acquire the mathematics skills and expertise to support student’s learning, prepare them to teach in an inclusive environment, provide professional development and ensure that trainees show a concern for professional values and demonstrate the positive attitudes and behaviour expected from pupils.\r\n\r\nFor further information\r\nhttps://www.mdx.ac.uk/courses/postgraduate/school-direct-qts\r\nhttps://www.mdx.ac.uk/courses/postgraduate/mathematics","interviewProcess":"The Head of Department at the 'host' school will be interviewing you along with a member of the Senior Leadership Team. \r\n\r\nYou will also be asked to prepare a lesson or part of a lesson in your subject to deliver to a group of students in order to assess your interaction and communication skills with young people. \r\n\r\nAt the interview stage, your suitability for teaching will be assessed including your subject knowledge for teaching and competency in the fundamental skills of English and Maths. If any shortfall is identified, you may be required to complete some additional work to secure the appropriate level of competency before being accepted on the programme. During the programme your competency in these areas will be developed and assessed to ensure you reach the required level.\r\n\r\nOne interview will take place at the school followed by a second interview at Middlesex University.","howSchoolPlacementsWork":"During your training year, you will spend at least 120 days in schools. This includes placements in two secondary schools, your host school that you have stated on your application form and an alternative school, organised by the Brent Initial Teacher Training (BITT) partnership. The 2nd placement school will allow you to experience different approaches to school management and organisation as well as varied teaching and learning styles. \r\n\r\nYou will teach classes across the 11-16 age range and have the opportunity for post 16 enhancement. You will return to University for one day each week for lectures, seminars and workshops with the secondary education team. Each placement provides a sustained teaching experience with a gradual increase in responsibility for planning, teaching and assessment. \r\n\r\nWithin the placements, you will be supported by school-based mentors as well as your University Tutor.\r\n","personalQualities":"We are looking for ambitious trainee teachers who demonstrate their passion and enthusiasm for teaching and have a desire to share this with young people. \r\n\r\nYou should be highly motivated, able to adapt and have the resilience to work well under pressure. Ideal candidates will be organised and demonstrate good inter-personal skills.\r\n\r\nTrainees should have the ability to reflect critically on their own practice and progress\r\n","otherRequirements":"All applicants will be expected to have gained some experience in a classroom, ideally prior to interview. \r\n\r\nTeacher Training providers have a responsibility to ensure that trainees have the health and physical capacity to teach and will not put children at risk of harm. All applicants will be required to successfully complete Occupational Health and Disclosure Barring Service (DBS) Enhanced Disclosure checks.\r\n\r\nIf you have lived, worked or traveled in another country for three months or longer in the last ten years, you will need to obtain a Certificate of Good Conduct from the relevant country/countries.\r\nPlease see; (www.mdx.ac.uk)\r\n","status":1,"createdAt":"2021-07-06T10:54:31.909Z","updatedAt":"2021-07-23T08:07:58.384Z","canSponsorStudentVisa":"no","cycle":"2024"}
