{"id":"098a411f-bca7-4813-8ec1-0bae24eba6e7","name":"Physics","code":"2YLG","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"B","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"bf97cd0a-224c-43d3-a021-84143df13e8d","code":"F3","name":"Physics"}],"locations":[{"id":"dbdeaa9c-7459-444a-8618-88ce06d6ddb9","name":"Knole Academy","isPublished":"Y","status":"R","vacancies":"B"}],"trainingProvider":{"id":"f2be5be8-a2ff-4062-8b27-677c514ca81a","code":"2CC","name":"Kent Oaks Consortium"},"accreditedBody":{"id":"4d4cceab-1516-4a6c-a9ab-5de0e32e1fe1","code":"S90","name":"University of Sussex"},"profPost":"BO","degreeGrade":"9","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"1 Year FT, 2 Years PT","feesUK":9250,"aboutCourse":"Successful applicant(s) for this course are usually placed at Knole Academy Sevenoaks.  \r\nOur well-established and long-running programme provides trainees with the opportunities to undertake a practical and theoretical training programme in a vibrant and dynamic primary or secondary school environment.   \r\nOur School Direct programme is delivered in conjunction with our accrediting training provider, the University of Sussex.  Trainees will undertake four days of training per week in their placement school and attend the University of Sussex on Fridays to undertake sessions that cover the theory and practice of teaching.  Trainees will attend a 3-week induction in September at the University of Sussex, thereafter the main school placements will commence with the first week being comprised of a detailed induction by your school's professional and subject mentors.  Trainees will carry out detailed lesson observations for the first two to three weeks followed by around 5 hours of teaching per week, with the number of hours increasing throughout the year as your professional skills and confidence increases.\r\nTrainees will also continue to have professional development sessions with their relevant mentors throughout the year.  Sessions will focus on the development of your subject knowledge and the craft of teaching through observing other teachers, team-teaching, joint planning sessions, etc.  We will also organise for our trainees a 4-6 weeks placement in a complementary school during the latter part of the academic year.  This will provide trainees with a comprehensive understanding of teaching in different school environments. \r\nAll trainee teachers must demonstrate that they have met the Teachers’ Standards in order to gain Qualified Teacher Status (QTS). You will keep a portfolio of evidence to show that you have done so. \r\nPart-time participants will undertake the programme over a 2-year training programme with hours increasing year-on-year.  During the first year, you will teach two days per week with Fridays at Sussex, and submit the main 6,000 word written assessment comprised of a series of lessons that you will design, teach, evaluate and analyse at Master’s Degree level.  In the second year you will teach for three days per week with a 5-week block of teaching at the end of your course.  \r\nSuccessful School Direct trainees will gain Qualified Teacher Status (QTS) with the option to achieve a Postgraduate Certificate in Education (PGCE) from the University of Sussex worth 60 Masters level credits.\r\n[Kent Oaks Consortium](http://www.kentoaksconsortium.co.uk/)\r\n[University of Sussex Teacher Training](http://www.sussex.ac.uk/education/ite/schooldirect)\r\n\r\n\r\n\r\n","interviewProcess":"Candidates’ applications will be processed via the university clearing system, UCAS. After an initial screening to check you meet the minimum entry requirements your application will then be read by an expert panel who will invite successful applicants to interview. The interview will take place at the lead school (Knole Academy) or in one of our partnership schools and is likely to include a preliminary interview comprised of:\r\n\r\n * A Short 20 Minutes Teaching Session - potential secondary trainees are required to teach a given task and primary trainees can choose an appropriate activity. Tasks can be found on the Resources page.\r\n * Written Tasks - designed to assess the quality of candidates’ written English and their understanding of current issues in education \r\n * Student Interview - a selection of students across the year groups will conduct an informal interview for secondary applicants\r\n * Formal Interview - panel interview with members of the selection panel \r\n * A Brief (10 Minutes) Presentation – this will be on an aspect of your subject which you feel is misunderstood or difficult to teach.\r\n\r\nCandidates will be advised of the exact format in advance.  There will then be a second interview/meeting with The University of Sussex.\r\n","howSchoolPlacementsWork":"All primary and secondary schools within the consortium are based in West Kent, including the lead school, Knole Academy, and they undergo continuous quality assurance in order to provide rigorous training standards.  We currently have seven partner school within the consortium.  We have limited availability in each secondary school subject area placements and primary school placements, therefore applicants are advised to apply as early as possible. ","personalQualities":"","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:50:08.159Z","updatedAt":"2021-09-24T10:20:29.328Z","canSponsorStudentVisa":"yes","cycle":"2024"}
