{"id":"7307cc1a-4d6e-4ab4-8484-e91154503188","name":"Design and technology","code":"D219","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"B","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"118fabd7-86d0-4a40-9e9a-e5c302abe59b","code":"DT","name":"Design and technology"}],"locations":[{"id":"dbdeaa9c-7459-444a-8618-88ce06d6ddb9","name":"Knole Academy","isPublished":"Y","status":"R","vacancies":"B"}],"trainingProvider":{"id":"f2be5be8-a2ff-4062-8b27-677c514ca81a","code":"2CC","name":"Kent Oaks Consortium"},"accreditedBody":{"id":"4d4cceab-1516-4a6c-a9ab-5de0e32e1fe1","code":"S90","name":"University of Sussex"},"profPost":"PG","degreeGrade":"9","additionalDegreeSubjectRequirements":"false","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"TwoYears","aboutCourse":"The University of Sussex Schools’ Partnership offers high quality professional and academic School Direct teacher Education courses leading to Qualified Teacher Status (QTS), a PGCE of 90 Masters Level Credits and a progression route onto a MA in Education. \r\nWith a history of innovation, we pioneered a model of school-based teacher training 50 years ago, now adopted nationally. Schools and the university work together at every stage of the selection, training, and assessment of our beginner teachers. This long-standing relationship results in excellent support from experienced teachers mentoring trainees on placement and dedicated University tutors offering models of successful pedagogy.\r\n\r\nTrainees with disabilities and other needs\r\nThe University of Sussex Schools’ Partnership welcomes applications from any candidates who have the potential to make excellent teachers regardless of disability and additional needs. We have previously successfully supported trainee teachers with Dyslexia, Dyspraxia, Autism, Mental Health conditions and a range of physical, hearing, and visual impairments.\r\nAll candidates complete an online health questionnaire administered by the University's Occupational Health Department in the summer before beginning the course. This is to establish mental and physical fitness for teaching. Following this, if you have a disability or health condition, you are then advised to register with the University Student Support service and an assessment is arranged to establish your needs and to identify additional support and adjustments needed to help you be as successful as possible on the course. At all stages we strongly recommend trainees fully disclose their individual needs so a support package can be tailored to everyone.\r\n\r\nYou will attend a full-time three-week induction course on the university Campus during September to prepare you for starting your school placement with us towards the end of the month.\r\nFull-time candidates spend Monday to Thursday each week training in one of our partnership schools and attending the University Campus on Fridays for lectures, workshops, and seminars with our team of experienced subject tutors. Part-time candidates attend Sussex University on Fridays and train for two days a week in school in year 1 and three days in year 2.\r\nOver the year you will be placed in two different schools and required to pass both placements. Additional assessments are via a Masters level essay submitted in late February and an innovative Viva style Masters level exit interview at the end of the course.\r\n\r\nhttp://www.sussex.ac.uk/education/ite/pgceandschooldirectsecondary/dt\r\n","interviewProcess":"Applicants who meet the entry requirements will be invited to a Sussex selection event either face to face or online via Zoom. Following a successful interview schools will then invite the candidate for a school interview.\r\n\r\nBefore the selection day \r\n* Listen to a video talk giving further information about the Sussex course\r\n* Complete some paperwork including our 'Suitability for Teaching Declaration'. \r\nBoth the above will be sent to you by email in your invitation to interview\r\n\r\nOn the selection day \r\n* Have an individual online interview, via Zoom or face to face with a Sussex tutor and an experienced  teacher from a partnership school\r\n* Deliver a short pre-prepared classroom type teaching task or presentation to the panel. You will receive details of the task in your invitation to interview.\r\n* Show the interview panel a form of photo ID on camera or in person for checking\r\n* Have an opportunity to ask the panel questions you may have about the course and your individual circumstances.\r\n\r\nAfter the selection day\r\n* If we offer you a place on the course and you decide to accept we will need you to send us or bring in your original Undergraduate Degree, and GCSE Maths and English certificates \r\n\r\nShowing  an awareness of the curriculum and school life is part of the selection process so if logistically possible candidates may wish to prepare themselves by spending some time in an appropriate school setting for the subject/phase they intend to teach beforehand.\r\n","howSchoolPlacementsWork":"Full-time Course - two periods of Professional Practice in two contrasting schools over the academic year September to June, training to teach in Key Stage 4 (14-16) and Key Stage 5 (16-18).\r\n\r\nPlacement 1: End of September to February half-term. Trainees benefit from a serial placement where the working week is divided between four days in school and a day of reflection and training at the University on Fridays.\r\n\r\nPlacement 2: February Half-term to Easter in a contrasting school or college with a return to your original placement school until May half term to complete the course. There are fewer University days to give you experience of working a 5 day school week. \r\n\r\nOur Part-time Course \r\nYear One: 2 days* a week in school and Fridays at the University \r\nYear Two 3 days* a week in a second contrasting school and occasional University days. Towards the end of your course you will undertake a full-time 5 week teaching block.\r\n* Days of the week individually negotiated to suit both school and trainee.\r\n\r\nWe are looking for; \r\n* A passion for DT and interest and involvement beyond your degree\r\n* A strong knowledge and understanding of the study of DT, and a sound awareness of how the subject is taught within UK secondary schools\r\n* Effective communication and organisational skills\r\n* Awareness of current educational developments and issues\r\n* Experience with young people and commitment to developing individuals\r\n* The ability to evaluate practice and address your weaknesses\r\n* Initiative, flexibility and responsiveness to change\r\n* A sense of responsibility and ability to work in a team.\r\n\r\n* All trainees must obtain successful DBS clearance before starting an Initial Teacher Education programme.\r\n\r\n* All trainees must be screened for mental and physical fitness to teach by the University's Occupational Health Department before admission to the programme.\r\n\r\nGCSEs\r\nGrade 4 (C) or above in English and Maths, or equivalent qualification\r\nCandidates with pending GCSEs will be considered Equivalency tests will be accepted in English or maths at their own expense. We can accept equivalency test passes from 'A Star' and 'Equivalency testing.com'\r\n","status":1,"createdAt":"2022-01-14T10:57:34.905Z","updatedAt":"2022-01-14T11:05:18.606Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"he"}
