{"id":"7fbbf705-9569-4d2c-97e3-b828d92f9d8a","name":"Primary","code":"36VC","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"059fc7ff-c80d-472d-839d-49ab69d042d9","name":"Sherborne Area Schools Trust","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"376f08f6-1827-4fd9-89f1-1e0e4d03f939","code":"18M","name":"Sherborne Area Schools Trust"},"accreditedBody":{"id":"4a3dc1e3-2ee8-496d-85d1-b5d9f9eae94f","code":"B20","name":"Bath Spa University"},"profPost":"BO","degreeGrade":"1","english":"1","maths":"1","science":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We are looking at candidates who ideally already have a GCSE grade C or above equivalent in English, maths and science","courseLength":"OneYear","feesUK":9250,"aboutCourse":"While you’re a Bath Spa teacher, you’ll explore models of teaching and the many ways in which children learn. Emphasis is placed on how parents and carers, families, schools and communities can impact children’s learning and well-being.\r\n\r\nWhen you complete your initial teacher training, you’ll be fully qualified to teach, with the essential skills and confidence that you’ll need to be successful in the classroom.\r\n\r\nUniversity-based training:\r\nWe’ll encourage you to think critically about research, national initiatives and classroom practice, as well as supporting you in the process of reflective evaluation.\r\n\r\nYou’ll be taught in lectures, seminars and workshops covering the following key strands:  English, Maths, Science, Professional Studies, Teaching in a Diverse Society and Teachers as Researchers.\r\n\r\nSchool-based training:\r\nYou’ll be placed in at least two schools or settings, meaning you’ll become familiar with their work and the nature of teaching.\r\n\r\nThis is your opportunity to practise your developing teaching skills. During school training you’ll be able to reflect on your university training in the context of children’s learning environments.\r\n\r\nYou’ll be required to undertake a range of assignments which assess your understanding of theories and practices relating to teaching. The PGCE qualification requires you to sit three formal assessments across the year. In addition, you’re required to pass two assessed school/setting phases which will demonstrate your skills in planning, teaching, assessing and evaluating.\r\n\r\nWe’ll help you monitor and track your progress; offering you advice on how to improve your performance as a teacher. You will be assigned an Academic Tutor who will regularly meet with you to review your progress, as well as visiting you during your assessed school training. During school training you will also be supported by a training mentor, who is usually the class teacher.\r\n","interviewProcess":"From your application, potential trainees will be selected for interview and will be informed in writing of their interview date. \r\n\r\nDuring this process you will meet the Teaching School Manager, the Lead Practitioner for Primary Teacher Education and our leads for primary education from our Alliance schools.\r\n\r\nThe interview will include some or all of the following and may take place online, depending on current Gov.uk guidelines:\r\n\r\nA teaching episode – potential trainees are asked to teach a short lesson (20-30 mins) either to other interviewees and the Selection Panel, or to a group of students. If the interview is online, candidates are asked to talk through a lesson plan, details given in advance of the interview.\r\nFormal interview – panel interview with members of the Selection Panel and if available a member of the appropriate HEI / ITE provider.\r\nShort written task - you will be asked to complete a short written task, the details of which are given on the interview day.\r\nStudent panel – potential trainees will be interviewed by a panel of students. ","howSchoolPlacementsWork":"We will work with you to ensure you are placed in schools that will best support your year of training. We will ask you to express an area of preference for your placements so that we can make sure this is part of our decision making process. \r\n\r\nFor an informal chat by phone or in person, please contact: Isabelle Rawlings, Teaching School Manager on 07741 578699, 01935 811066, or isabelle.rawlings@northdorsettsa.org.uk.\r\n\r\nThe trainee will complete two placements. The first is between October and February. The second school placement runs from February until June in a complementary setting (i.e. with the opposite key stage to the first placement). \r\n\r\nWe work schools in and around South Somerset and North Dorset. Our schools range in size and we will endeavour to give you the chance to experience working in both large and small primary settings. You will also have the option to visit alternative and special provision as well.","personalQualities":"Well Organised.\r\nResilient.\r\nHard working.\r\nPatient.\r\nCreative.\r\nGood communicator.\r\nPassionate about working with young people.\r\n","otherRequirements":"DBS clearance.\r\nSatisfactory References.\r\nEligibility to study in the UK.\r\nProof of adequate knowledge of the phase in which you wish to teach.\r\n","status":1,"createdAt":"2021-07-12T13:49:43.645Z","updatedAt":"2021-09-16T10:31:43.864Z","canSponsorStudentVisa":"yes","cycle":"2024"}
