{"id":"8b3a6ee5-244f-4be3-b25c-62f6cb8701ac","name":"Biology","code":"2S2P","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"322cfc19-d51d-45db-91e3-bd7b4738470f","code":"C1","name":"Biology"}],"locations":[{"id":"059fc7ff-c80d-472d-839d-49ab69d042d9","name":"Sherborne Area Schools Trust","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"376f08f6-1827-4fd9-89f1-1e0e4d03f939","code":"18M","name":"Sherborne Area Schools Trust"},"accreditedBody":{"id":"0fd2de51-736a-4516-81ce-94659d58951d","code":"M84","name":"Mid Somerset Consortium for Teacher Training"},"profPost":"BO","degreeGrade":"1","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We recommend a third party company for equivalency tests.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"We have a strong and successful longstanding partnership with schools across North Dorset. We are friendly and supportive aiming to get the best out of each of our trainees and make them the best teachers that they can be. \r\nThe training course has a simple structure. Trainees spend Monday, Wednesday, Thursday and Friday training on the job in their schools. They then meet together as a group on Tuesdays with the MSC at Crispin School for Professional Training. \r\nProfessional Training is run by current practitioners and MSC staff and is tailored to ensure that trainees have appropriate pedagogical input at the different stages of their development as teachers.  We practice what we preach ensuring a balance of modelling techniques and strategies with current research. We also visit other partnership schools which are leaders in their particular fields of expertise so that trainees get a great breadth of training and are fully prepared for their first year in teaching.\r\nOur trainees are able to build up their teaching hours from the beginning of the course at a pace which suits them. A mentor in school is at hand to offer advice and support to each trainee.\r\nOur programme starts on 1st September and ends on 30th June. Trainees are in school from day 1 and are regarded as full members of the school community.\r\nTrainees are able to gain QTS and PGCE with us. Assessment for QTS is through weekly lesson observation and portfolio tasks which are specifically designed to allow trainees to showcase their practice. Our PGCE is delivered through the MSC's Professional Training (accredited by Bath Spa University). Assessment is in the form of three written assignments at Masters' level.\r\nWe have excellent outcomes for our trainees; we were ranked 27 out of 153 secondary trainers across the UK in the Good Teacher Training Guide 2017.\r\n","interviewProcess":"From your application, potential trainees will be selected for interview and will be informed in writing of their interview date. The interview will include some or all of the following:\r\n•A teaching episode – potential trainees are asked to teach a short lesson (20-30 mins) either to other interviewees and the Selection Panel, or to a group of students.\r\n•A meeting with the subject department – a subject specific group exercise where the potential trainees meet the Head of Department, their future mentor and 1 or 2 members of the department. Through a subject based discussion, this task will assess suitability to work with the whole subject department.\r\n•Student panel – potential trainees will be interviewed by a panel of students.\r\n•Generic lesson observation (1/2 lesson).\r\n•Formal interview – panel interview with members of the Selection Panel and if available a member of the appropriate HEI / ITE provider.\r\n•Short written task - you will be asked to complete a short written task, the details of which are given on the interview day.\r\n\r\nTrainees are also required to complete a Disclosure and Barring Service form, once the position has been offered.\r\n","howSchoolPlacementsWork":"If more than one of our schools is offering a subject training place, candidates will be required to express a preference at the point of interview. If the first preference cannot be met, candidates may be offered an alternative place within the Alliance. We will discuss the best option for the most suitable placement for both the trainee and our schools. \r\n\r\nFor an informal chat by phone or in person, please contact: Isabelle Rawlings, Teaching School Manager on 07741 578699, 01935 811066, or isabelle.rawlings@northdorsettsa.org.uk.\r\n\r\nTrainees have to spend 6 weeks in a second school. The trainee is free to choose where this is as long as it provides a complementary experience from the home school. This placement takes place straight after Christmas. The trainees then return to their home schools for the final term and a half.\r\n\r\nWe work schools in and around South Somerset and North Dorset. The majority of our schools are 11-16 although some do have sixth forms. We try and ensure that all trainees have some experience of post sixteen during their course.","personalQualities":"Well Organised.\r\nResilient.\r\nHard working.\r\nPatient.\r\nCreative.\r\nGood communicator.\r\nPassionate about working with young people.\r\nEnthusiastic about your subject area.\r\n","otherRequirements":"DBS clearance.\r\nSatisfactory References.\r\nEligibility to study in the UK.\r\nProof of adequate subject knowledge to teach your subject if your degree is in another subject.\r\n","status":1,"createdAt":"2021-07-06T10:52:21.086Z","updatedAt":"2021-09-15T07:18:22.787Z","canSponsorStudentVisa":"no","cycle":"2024"}
