{"id":"39fff1a8-88e6-478b-9fd7-0bae4b5dc158","name":"Primary","code":"2M7V","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"1596ef31-f478-4f49-bda2-7551a7b8fc43","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"c74e13a6-22cf-4fbd-88e9-682aabd7391a","code":"1KF","name":"Carmel College"},"accreditedBody":{"id":"5bce9a0d-f372-4667-b3ec-3d58d42a1345","code":"C23","name":"Carmel Teacher Training Partnership (CTTP)"},"profPost":"BO","degreeGrade":"9","english":"1","maths":"1","science":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We accept equivalency tests from Equivalency Testing.\nFor further information:\nwww.equivalencytesting.com/\ninfo@equivalencytesting.com","courseLength":"OneYear","feesUK":9000,"feeDetails":"Students can apply for course fees through Student Finance (if eligible). ","aboutCourse":"•\tPersonalised, school-based training from September 2022- June 2023.\r\n•\tAchieve Qualified Teacher Status from a highly regarded, well established Provider in the northeast of England.\r\n•\tPost Graduate Certificate in Education (PGCE) awarded by Leeds Trinity University and delivered face to face in CTTP Lead Schools.\r\n•\tDedicated, modern training facilities.\r\n•\tOur curriculum is designed by expert practitioners and delivered in practical and interactive weekly training sessions to compliment your classroom experience.\r\n•\tAllocated mentor for each trainee to ensure personalised, bespoke support and training to meet individual needs.\r\n•\tUnique recruitment process with schools represented at each stage- they ‘choose’ you!\r\n•\tTraining in two school settings- main and second school placement (January- February).\r\n•\tTrainee progress is monitored throughout the year and assessed against the Teachers’ Standards.","interviewProcess":"The selection procedures which follow aim to ensure that:\r\n\r\nEntry requirements specified in DfE Qualified Teacher Status Standards (2012) are applied carefully, giving due weight to academic equivalencies, experiences and motivation.\r\n\r\nEntrants are given a sound understanding of the nature and demands of the course in order to assure successful applicants complete the course and enjoy their new profession in education\r\n\r\nSelection will be based on: - a teaching activity related to the age and phase of the class, completion of a written task and a formal interview. \r\n\r\nDocumentation\r\n\r\nApplicants are asked to bring to the interview the relevant certificates which verify the academic profile described on the application form.  Successful applicants will also be asked to bring appropriate certification and other documentation as requested to verify their identity and for the DBS check, prior to the start of the course. The document check is made by the Administrator and provides an audit for registration purposes at the commencement of the course. All documents must be 'original' and not a photocopy. Copies of critical documents will be stored on file under the new GDPR guidelines.\r\n","howSchoolPlacementsWork":"All trainees teach in two schools during their training year. Their second school placement is chosen to provide a different context to their main school experience.  Trainees will have a mentor and Professional Tutor in this placement.  A Partnership Link Tutor (PLT) is assigned to each trainee; each half term she/he will visit the trainee in school to support, observe and QA the school-based experience to moderate and to ensure consistency of training across the Partnership. ","personalQualities":"We are looking for enthusiastic applicants with very good communication skills, the determination to succeed, a commitment to working hard and the ability to work with others. Successful applicants are confident and passionate about teaching and also able to contribute to the wider school ethos and community. Training to teach is both challenging and rewarding. Developing excellent interpersonal skills will enable trainees to support the learning of groups of young people from diverse backgrounds effectively. We are looking for people who strive to improve and who are committed to their own professional development.","otherRequirements":"All entrants will go through an enhanced Disclosures and Barring Service DBS, in order to ascertain that they have no criminal background which might prevent them from working with children. In addition, entrants are required to sign a declaration that they have not previously been excluded from teaching or working with children.\r\n\r\nSchool experience is a desirable characteristic but not essential and no applicant would be rejected because of a lack of school experience.  ","status":1,"createdAt":"2021-07-06T10:54:59.913Z","updatedAt":"2021-10-04T14:01:53.363Z","canSponsorStudentVisa":"no","cycle":"2024"}
