{"id":"15860155-3aef-4d56-a1f1-b131267bdf9f","name":"Primary (3-7)","code":"H544","qualification":"pgde_with_qts","startDate":"2023-07-31T23:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_7","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"b87393d0-8049-4c9f-b58e-18f47897c4fa","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"71aaa47a-b3ed-423c-b8e8-14dca17f28ed","code":"168","name":"MAITT (Merseyside Alliance Initial Teacher Training)"},"accreditedBody":{"id":"ec34b77c-cba3-4598-93be-23f0471adff1","code":"L51","name":"Liverpool John Moores University"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":14000,"feeDetails":"There are a range of ways in which you can arrange to pay your course fees, including in monthly instalments.","aboutCourse":"\r\nThe PGDE  Primary Early Years (3-7) course focuses on Foundation Stage and Key Stage 1. The course is offered by MAITT  in collaboration with LJMU.  It is taught by experienced and friendly staff who have been successful teachers and continue to maintain strong links with schools.  \r\n\r\nOur trainee teachers usually spend Monday at University and receive subject knowledge and professional study sessions on Friday at MAITT’s training centre. The other 3 days are based in school.  As the programme progresses the amount of time spent in school increases, with up to 80% teaching commitment. Throughout the year students return to University for additional full training weeks, however, the majority of time (at least 120 days) is spent developing teaching skills in one of our partnership schools.\r\n\r\nThe Primary programme will focus predominantly on developing your subject knowledge and subject pedagogy in all primary curriculum subjects, so that you have the knowledge, understanding and skills needed to become a confident teacher of the 3-7 age range. In addition, lead lectures and seminars will develop your confidence in a range of relevant issues; classroom and behaviour management; meeting individual needs and inclusion; planning and assessment etc. There is a strong emphasis on social justice issues in education and on mental health and well-being.  We want you to develop into an inclusive and reflective teacher, with the skills, energy and resilience needed to make a real difference in schools.\r\n\r\n\r\nIn order to achieve Qualified Teacher Status, you will demonstrate that you are able to meet all the requirements of the Teachers’ Standards. This aspect of assessment is largely undertaken by our school-based mentors.  LJMU staff are in regular contact with all trainees on placement, undertake co-observations of their teaching and Quality Assure the school-based training across the Partnership. \r\n\r\n\r\nThe Postgraduate Diploma is assessed through 4 modules. The course team and our Partnership schools have worked together to ensure that this gold standard teacher training PGDE Award remains both relevant and manageable. The Award of QTS is integral to one of these academic Modules. You will also complete two essays, (one of which focuses on the development of a Scheme of Work) and deliver a case-study presentation.\r\n","interviewProcess":"\r\nAll applicants who meet the entry requirements will be invited to attend a selection event at one of our partnership schools.\r\n\r\nThe selection process involves  a written literacy task and an individual interview with members of MAITT.  Details to support preparation for the event are sent to successful applicants along with an invitation to attend. Our selection and interview procedure will also give applicants further information about our programme and provide an opportunity to meet our friendly staff team. \r\n\r\nAn applicant's performance in each part of the selection process is assessed and a final decision is made, based on a judgement of performance across the day. Applicants are normally informed of decisions within 24 hours.\r\nApplicants will be assessed for their:\r\n•\tRelevant subject knowledge for Primary teaching and their interest in and enthusiasm for teaching the 5-11 age range\r\n•\tAbility to successfully engage learners and to make learning exciting and meaningful to children in a range of contexts\r\n•\tCommitment to supporting learners, including in areas of challenging social context\r\n•\tEnthusiasm, energy and resilience and ability to work with others in teams\r\n•\tPotential to work successfully at Master’s level.\r\n\r\nApplicants are asked to bring evidence of GCSEs in English, Mathematics and Science or evidence  with them to interview, along with degree certificates if they have already graduated\r\n\r\n","howSchoolPlacementsWork":"Your school-based experience takes place in a Home School, supported by experienced, well-trained mentors. A long term placement in a Home School ensures that you are fully integrated into school life and are a recognised and valued member of the school team. A liaison tutor from LJMU is assigned to each school and is responsible for visiting regularly to support both trainees and their mentors. \r\n\r\n\r\nIn addition to a Home School placement you will also undertake a 6 week alternative placement.  You have the opportunity to develop your skills in a different Key Stage and contrasting setting.  When required school experienced is further enhanced by visits to different schools to experience a range of contexts.\r\n\r\nMAITT hold an annual matching day for our tuition trainees to meet Partnership Schools, this supports us in matching you with a placement school which allows you to thrive and develop your ability to be an outstanding and reflective practitioner.  Matching day has proven to be very successful in placing our trainee teachers in their placements.\r\n\r\nYou are supported through a weekly review/feedback meeting with your mentor and regular support from your Liaison Tutor. This “wraparound” care ensures that you are consistently supported from start to finish, both personally and professionally. Relationships are very close and constructive.\r\n\r\n\r\nWe work with schools across a number of North West local authorities; these include a diverse range of settings.  Our MAITT family of schools is committed to trainee teacher development and to the Partnership with the University.  Mentor training and development events hosted both at MAITT/LJMU ensure our experienced mentors understand our expectations and are committed to offering high quality guidance and support to each trainee.\r\n\r\nThe programmes focuses on the 5-11 age range, however trainees also gain some experience of the Early Years Foundation Stage curriculum.\r\nSchool experience is structured in Phases, this begins with an observation phase, so that you can develop appropriate confidence and competence. You will take on greater responsibility for planning and teaching as the year progresses. Your final assessment for QTS is conducted at the end of the year.\r\n","personalQualities":"We are looking for applicants who have a passion for teaching the 5-11 age range and wish to share their passion with children. You should have a genuine belief that education transforms life chances and want to make a positive difference to children and to their communities. At interview we hope to see your enthusiasm along with evidence of some experiences which have informed your decision to become a teacher. A minimum of 5 days’ work experience in a UK primary school is helpful prior to commencing the programme. We can help to arrange this for successful applicants.","otherRequirements":"You will also be required to meet the Department for Education’s standards for physical and mental fitness to teach and clearance to work with children. Further information, including a Declaration of Health questionnaire and details of how to apply for a Disclosure and Barring Service (DBS) Enhanced Disclosure will be sent to you after you have firmly accepted an offer.\r\n\r\n","status":1,"createdAt":"2021-07-06T10:50:41.593Z","updatedAt":"2021-10-01T12:06:23.837Z","canSponsorStudentVisa":"yes","cycle":"2024"}
