{"id":"b2287734-a570-4f75-a380-a557115fd709","name":"Primary","code":"33MS","qualification":"pgce_with_qts","startDate":"2024-07-31T23:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"b87393d0-8049-4c9f-b58e-18f47897c4fa","name":"Main Site","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"71aaa47a-b3ed-423c-b8e8-14dca17f28ed","code":"168","name":"MAITT (Merseyside Alliance Initial Teacher Training)"},"accreditedBody":{"id":"ec34b77c-cba3-4598-93be-23f0471adff1","code":"L51","name":"Liverpool John Moores University"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","aboutCourse":"The Salaried course at MAITT is offered in collaboration with LJMU and is aimed at applicants with prior experience. This normally involves previous employment in a school-setting but other career changes are welcome to apply. Applicants for this employment-based route must apply with the support of a school who is willing to employ them as an unqualified teacher for the duration of the programme.\r\n\r\nThe Salaried programme includes a Postgraduate Certificate (PGCE), alongside Qualified Teacher Status. The PGCE is assessed through 2 Modules. The Award of QTS is integral to one of these academic Modules. You will also complete a two part essay which asks you to reflect on your practice. The PGCE will be taught by experienced and friendly staff from LJMU and you will join a community of students at IMMarsh campus for University – based sessions, which begin with a Summer School during the last week of August 2021. You will also receive additional subject knowledge through training at MAITT.\r\n\r\nAs a Salaried School Direct trainee you may be expected to teach up to 90% of a teacher timetable and be responsible for the planning, teaching and assessment of your class(es) from early on in the year. Trainees on the salaried programme are selected, recruited and employed directly by schools, and often continue teaching in their school following training.\r\nIn order to achieve Qualified Teacher Status, you will demonstrate that you are able to meet all the requirements of the Teachers’ Standards. This aspect of assessment is largely undertaken by our school-based mentors. LJMU staff are in regular contact with all trainees on placement, undertake co-observations of their teaching and Quality Assure the school-based training.\r\n","interviewProcess":"All applicants who meet the entry requirements will be invited for an individual interview.  Interviews will be held, and will involve staff from, either your supporting school or MAITT.  \r\n\r\nDetails to support preparation for the event are sent to successful applicants along with an invitation to attend. Our selection and interview procedure will also give applicants further information about our programmes and provide an opportunity to meet our friendly staff team.  An applicant's performance at interview is assessed and a final decision is made. Applicants are normally informed of decisions within 24 hours.\r\n\r\nApplicants will be assessed for their:\r\n\r\n•\tRelevant subject knowledge for primary teaching and their interest in and enthusiasm for teaching the 5-11 age range\r\n•\tAbility to successfully engage learners and to make learning exciting and meaningful to learners in a range of contexts\r\n•\tCommitment to supporting learners, including in areas of challenging social context\r\n•\tEnthusiasm, energy and resilience and ability to work with others in teams\r\n\t","howSchoolPlacementsWork":"Your school-based experience takes place largely in your employing school, supported by well- trained mentors. A member of LJMU staff is attached to each school and is responsible for visiting regularly in order to support trainees and their mentors. Relationships are very close and constructive.\r\n\r\nAll trainees are entitled to weekly review and feedback meetings with their mentors and to tutorials with LJMU staff. This “wraparound” care ensures that you are consistently supported from start to finish, both personally and professionally.\r\n\r\nIn addition to the time spent in a Home School you will also undertake an alternative placement of a minimum of 2 weeks in a contrasting school.\r\nYour final assessment for QTS is conducted at the end of the year.\r\n","personalQualities":"We are looking for applicants who have a passion for teaching and wish to share this with learners. You should have a genuine belief that education transforms life chances and want to make a positive difference to children and to their communities. At interview we hope to see your enthusiasm along with evidence of some experiences which have informed your decision to become a general primary teacher. A minimum of 5 days’ work experience in a UK primary school is helpful prior to commencing the programme. We can help to arrange this for successful applicants.","otherRequirements":"You will also be required to meet the Department for Education’s standards for physical and mental fitness to teach and clearance to work with children. Further information, including a Declaration of Health questionnaire and details of how to apply for a Disclosure and Barring Service (DBS) Enhanced Disclosure will be sent to you after you have firmly accepted an offer.\r\n\r\n","status":1,"createdAt":"2021-07-06T10:50:41.528Z","updatedAt":"2021-10-01T12:06:11.199Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"You will be paid as an unqualified teacher by your employing school for the duration of your training. This will be calculated using the unqualified teachers’ pay scales. Your employing school will pay the costs of your PGCE training and assessment, however in some instances a contribution towards the PGCE fee is requested from trainees by the employing school.  The PGCE is awarded by Liverpool John Moores University, who will also recommend you for Qualified Teacher Status. "}
