{"id":"1b037b94-5612-4551-8fa0-79cbf1f36fb4","name":"Primary","code":"33YT","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"e7bd39d9-6264-46c5-8a4a-1c39d9019060","name":"Boston St Mary's RC Primary Academy","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"8cda030c-d039-427c-86dc-f50fe83a22d6","code":"2C5","name":"St Mary’s School Direct Partnership Programme"},"accreditedBody":{"id":"1d95b6cb-0e08-4485-848a-0e304d71102a","code":"B38","name":"Bishop Grosseteste University"},"profPost":"BO","degreeGrade":"1","english":"1","maths":"1","science":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"financialSupport":"Find more info about financial support on our website https://www.bishopg.ac.uk/fees-funding/","aboutCourse":"This course is full-time course, studying for 3-7 age phase or 5-11 age phase. \r\n\r\nThe full-time course is for one year with at least 120 days in school and 60 days training. School placements are carefully structured to ensure gradual development of your confidence as an effective teacher through building up experiences by working with other trainees, link tutors and teachers. \r\n\r\nDepending on the age range you choose, you will be trained to teach all National Curriculum subjects. The Early Years Foundation Stage (EYFS) is also studied for those on the 3-7 routes with an emphasis on the core subjects and ICT. \r\n\r\nAt present, you register for the course at Post Graduate level, gaining 60 masters credits (level 7) or you can gain a professional graduate qualification with either 60 credits at level 6 or 30 credits at level 6 and 30 at level 7. \r\n\r\nThe modules relate to the professional role of the teacher, the need to be a reflective practitioner, to developing your own knowledge of subjects and areas taught within primary schools and early years settings and how you teach to support children in effective learning. \r\n\r\nThe course will include lectures, seminars, workshops, Independent Study, tutorials, school-based training and will recommend you for Qualified Teacher Status (QTS). The University-based sessions are very much a starting point for the training undertaken in schools through observation and working alongside experienced teachers. ","interviewProcess":"Your interview will take place in a school and be conducted by the programme leaders of the course in conjunction with school leaders.\r\n\r\nThe selection activities may include:\r\n•\tA formal interview\r\n•\tA small group activity with primary school children\r\n•\tA literacy and numeracy task\r\n\r\nDuring the interview, preferences for training schools and locations will be discussed with applicants.\r\n\r\nA formal offer of training will then be made to you through UCAS Teacher Training.\r\n\r\nFollowing your successful interview, you may be invited to spend some time in a primary school which may then provide your training.\r\n\r\nAt the school visit you will have the opportunity to meet with senior leaders and staff members in the school and spend time in the classroom.\r\n\r\n","howSchoolPlacementsWork":"Trainees are in their main training school from the first day of the academic year, thereby gaining an insight into how teachers establish the learning environment and build relationships with pupils and staff. Trainees are in school four days a week throughout the year with one day per week spent in training.\r\n\r\nIn addition, after the Christmas break trainees have a second placement in a contrasting school to develop their awareness of a range of school settings.","personalQualities":"We are looking for someone who has a love of learning and who wishes to ensure that others do too. \r\n\r\nBesides academic qualifications we are looking for a confident communicator who has a passion for learning. Someone who is well organised and has the ability and desire to become a team player. Your interpersonal skills are important as is your curriculum knowledge. We want to work with people who want to make a difference to young people's lives. \r\n","otherRequirements":"•\tExperience – We encourage you to gain some experience in schools as this is a good starting point for you to gain an interview for the Primary PGCE","status":1,"createdAt":"2021-07-06T10:47:56.953Z","updatedAt":"2021-10-22T12:05:50.275Z","canSponsorStudentVisa":"yes","cycle":"2024"}
