{"id":"178e7dfa-0804-41c2-8b80-1ff8e1b00a0a","name":"Geography","code":"E780","qualification":"qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"B","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3f47e67b-7fa5-4947-a5a0-74d528cd2a87","code":"F8","name":"Geography"}],"locations":[{"id":"52153f55-57ac-4dac-a0d3-72a8ac6b92fb","name":"The St Marylebone  CE School","isPublished":"Y","status":"R","vacancies":"B"}],"trainingProvider":{"id":"ecc85c2d-855d-4e29-8904-3cb7c203d557","code":"1ET","name":"St Marylebone Collaborative"},"accreditedBody":{"id":"252d7e03-741e-4453-b6a8-3d361e6c9d1b","code":"E69","name":"e-Qualitas"},"degreeGrade":"9","additionalDegreeSubjectRequirements":"false","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":8000,"feeDetails":"Trainees pay eQ a tuition fee of £6,000 + VAT + £2,000 disbursement which is forwarded to the school. \r\n\r\nTuition Fee Loan and Maintenance Loan\r\n\r\nA Tuition Fee Loan is available to cover course costs – if you take one out, you don’t have to pay your course costs upfront\r\nA Maintenance Loan is available to help with living costs\r\nIt doesn’t matter if you already have a student loan – you can still apply for both of these loans to support your teacher training\r\nYou will only start making repayments when you earn over the threshold \r\nIf you have a student loan already, taking out a further loan for your teacher training will not see your monthly repayments increase\r\nTo find out more please visit the Get Into Teaching website (https://getintoteaching.education.gov.uk/funding-my-teacher-training\r\n\r\nExtra financial support\r\n\r\nThere is extra financial support available if you are a parent, have an adult dependant or a disability. To find out more please visit the Get Into Teaching website (https://getintoteaching.education.gov.uk/funding-my-teacher-training/extra-financial-support)\r\n\r\n\r\n","financialSupport":"Trainees may be  eligible for a £15,000 bursary.  See here for details(https://getintoteaching.education.gov.uk/funding-your-training)","aboutCourse":"At St Marylebone you will work with experienced teachers, first of all observing and team teaching, then teaching independently. This is complimented by a placement of about 6 weeks’ teaching in another school. \r\nWe have been successively rated ‘outstanding’ by Ofsted and SIAMS,  and are one of the best performing non-selective state schools nationally.\r\n \r\nThe course content is organised into six modules, the first three of which may be worked on concurrently.\r\nTraining Module 1A: Lesson planning. How to plan lessons well, including choosing the most appropriate teaching and learning strategies.\r\nTraining Module 1B: Behaviour. How to manage pupils during lessons, and motivating them towards learning.\r\nTraining Module 1C: Assessment. How to assess pupils' learning in each subject, and use assessment information when planning and teaching lessons.\r\nTraining Module 2: Meeting needs of different groups of pupils. How to ensure that all groups of pupils do as well as possible e.g. those who speak English as an additional language, high attaining pupils, those with special educational needs.\r\nTraining Module 3: The wider context of teaching and learning in schools today. Barriers to learning i.e. why some pupils do not do as well as they should, and how teachers can make a difference to this.\r\nTraining Module 4: Subject teaching. Bringing everything together, how to teach really effectively. This builds on all the earlier training in how to teach effectively, and involves an in-depth study of an aspect of subject teaching.\r\nThere are two formal assignments: an essay exploring aspects of meeting the needs of different groups of pupils (linked to Training Module 2), and a subject-related essay (linked to Training Module 4).\r\nPGCE\r\ne-Qualitas collaborates with Leeds Beckett University, who offer a distance learning PGCE as an addition to the e-Qualitas QTS-focused training programme. The PGCE may be undertaken during the teacher training programme or afterwards (for workload reasons, we suggest that it is better to do it afterwards, as part of the continuing professional development of the induction year). Leeds Beckett charges £1500 for the PGCE. Entry to PGCE is in September.\r\n","interviewProcess":"We will invite selected candidates to an interview. The invitation letter will give full details of the interview.  This is likely to be a classroom exercise, literacy test, and panel interview. \r\nInterview\r\nApplicants must bring the following to interview: their qualifications certificates; identity documents (photo id e.g. a passport, and evidence of residence e.g. a mobile phone bill or bank/savings statement). Overseas applicants must provide evidence of their eligibility to live and study in the UK\r\nOffers\r\nIf we make you an offer, it could be conditional upon various things such as DBS clearance. You are entitled to wait for the outcome of all your applications before accepting an offer  and we fully endorse this\r\n","howSchoolPlacementsWork":"Your training will be predominantly based in your host (employing) school other than\r\n•\tTen days with the e’Qualitas across the year\r\n•\tyour second placement at another school for approx. 6 weeks.\r\nThrough an initial programme of observations and research you will become familiar with the organisation and working of your host school (pupil groups and pastoral systems, staffing, curriculum, resources, facilities, methods of teaching, lesson planning, Assessment for Learning).  \r\nFrom the beginning, you will be treated like a member of the teaching staff by fellow professionals. With your School Based Mentor (SBM), you will feel supported as you progress and become ready to teach as the placement progresses. Our mentors are experienced teachers and undertake rigorous training to develop their mentoring skills to support your development as a teacher. Your time in school provides you with the opportunity to develop your teaching expertise and relationships with young people in a familiar environment. \r\nAs a secondary trainee you will have the opportunity to teach a range of year groups between years 7 to 11. You will have experience of the new curriculum and assessment procedures. \r\nYour second teaching placement is intended for you to apply and develop your teaching skills at a different setting whilst also widening your experience of the school system in a new context. \r\nWhile in your main host school and during your second placement, your tutor from e’Qualitas will visit to monitor your progress and discuss your development with you and your mentors. You will maintain close links with your host school throughout the programme.\r\n","personalQualities":"We are looking for applicants who have the potential to become outstanding teachers, and who are able to work independently on their studies while training in a school context. These personal attributes include:\r\n•\tSubject knowledge \r\n•\tMotivation to become the best teacher possible\r\n•\tAbility to analyse and learn from experience\r\n•\tCreativity and imagination \r\n•\tCapacity for hard work \r\n•\tPerseverance \r\n•\tGood organisational skills \r\n•\tEmpathy and a liking for young people.\r\n•\tAmbition to make a difference by becoming an inspirational teacher.\r\n•\tMust pass Secretary of State’s requirement for physical and mental fitness to teach. \r\n\r\n","otherRequirements":"Prior to the course, it is a recommendation  that you undertake at least 10 days’ experience in the UK state secondary sector. Five of these days should be before you apply, to strengthen your application and to support interview answers. \r\nThe  School  is  committed  to  safeguarding  and  promoting  the  welfare  of  children  &  vulnerable  adults  and  it  is  our  expectation that  all  staff  and  volunteers  share  this  commitment.  Any  offers  of  employment  will  be  subject  to  satisfactory  references  and an  Enhanced  Disclosure  and  Barring  Service  (DBS)  check.","status":1,"createdAt":"2022-01-13T11:55:48.574Z","updatedAt":"2022-01-13T11:59:06.224Z","canSponsorStudentVisa":"no","cycle":"2024"}
