{"id":"27a9708c-5ff7-4f04-8e09-2031b3b34af2","name":"Mathematics","code":"3FM6","qualification":"qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"TA","fundingType":"apprenticeship","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"72345aa7-096c-488f-8649-085b8178cadb","code":"G1","name":"Mathematics"}],"locations":[{"id":"140cbff9-eb9f-408c-bac3-7bdd43147478","name":"The St Marylebone CEBridge School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"ecc85c2d-855d-4e29-8904-3cb7c203d557","code":"1ET","name":"St Marylebone Collaborative"},"accreditedBody":{"id":"252d7e03-741e-4453-b6a8-3d361e6c9d1b","code":"E69","name":"e-Qualitas"},"degreeGrade":"9","additionalDegreeSubjectRequirements":"false","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We will accept equivalent qualifications. We recommend (https://www.equivalencytesting.com/) or similar","courseLength":"1 year plus","aboutCourse":"The course content is organised into six modules, the first three of which may be worked on concurrently.\r\nTraining Module 1A: Lesson planning. \r\nTraining Module 1B: Behaviour. How to manage pupils during lessons, and motivating them towards learning.\r\nTraining Module 1C: Assessment. How to assess pupils' learning in each subject, and use assessment information when planning and teaching lessons.\r\nTraining Module 2: Meeting needs of different groups of pupils. \r\nTraining Module 3: The wider context of teaching and learning in schools today. \r\nTraining Module 4: Subject teaching. Bringing everything together, how to teach really effectively. \r\nThere are two formal assignments: an essay exploring aspects of meeting the needs of different groups of pupils (linked to Training Module 2), and a subject-related essay (linked to Training Module 4).\r\nPGCE\r\ne-Qualitas collaborates with Leeds Beckett University, who offer a distance learning PGCE as an addition to the e-Qualitas QTS-focused training programme. The PGCE may be undertaken during the teacher training programme or afterwards (for workload reasons, we suggest that it is better to do it afterwards, as part of the continuing professional development of the induction year). Leeds Beckett charges £1500 for the PGCE. Entry to the PGCE is in September.\r\n","interviewProcess":"We will invite selected candidates to an interview. The invitation letter will give full details of the interview.  This is likely to be a classroom exercise, literacy test, and panel interview. \r\nInterview\r\nApplicants must take the following to interview: their qualifications certificates; identity documents (photo id e.g. a passport, and evidence of residence e.g. a mobile phone bill or bank/savings statement); evidence of having taken the practice skills tests, or passed the actual skills tests. Overseas applicants must provide evidence of their eligibility to live and study in the UK\r\nOffers\r\nIf we make you an offer, it could be conditional upon various things such as DBS clearance, passing the professional skills tests by a set date. You are entitled to wait for the outcome to all your applications before accepting an offer on UCAS and we fully endorse this\r\n\r\n","howSchoolPlacementsWork":"Your training will be predominantly based in The St Marylebone Bridge school other than\r\n•\tTen days with the e’Qualitas across the year\r\n•\tyour second placement at another school \r\nThrough an initial programme of observations and research you will become familiar with the organisation and working of your host school (pupil groups and pastoral systems, staffing, curriculum, resources, facilities, methods of teaching, lesson planning, Assessment for Learning).  \r\nFrom the beginning, you will be treated like a member of the teaching staff by fellow professionals. With your School Based Mentor (SBM), you will feel supported as you progress and become ready to teach as the placement progresses. Our mentors are experienced teachers and undertake rigorous training to develop their mentoring skills to support your development as a teacher. Your time in school provides you with the opportunity to develop your teaching expertise and relationships with young people in a familiar environment. \r\nAs a secondary trainee you will have the opportunity to teach a range of year groups between years 7 to 11. You will have experience of the new curriculum and assessment procedures. \r\nYour second teaching placement is intended for you to apply and develop your teaching skills at a different setting whilst also widening your experience of the school system in a new context. \r\nWhile in your main host school and during your second placement, your tutor from e’Qualitas will visit to monitor your progress and discuss your development with you and your mentors. You will maintain close links with your host school throughout the programme.\r\n\r\n","personalQualities":"We are looking for applicants who have the potential to become outstanding teachers, and who are able to work independently on their studies while training in a school context. These personal attributes include:\r\n•\tSubject knowledge \r\n•\tMotivation to become the best teacher possible\r\n•\tAbility to analyse and learn from experience\r\n•\tCreativity and imagination \r\n•\tCapacity for hard work \r\n•\tPerseverance \r\n•\tGood organisational skills \r\n•\tEmpathy and a liking for young people.\r\n•\tAmbition to make a difference by becoming an inspirational teacher.\r\n•\tMust pass Secretary of State’s requirement for physical and mental fitness to teach. \r\n\r\n","otherRequirements":"Prior to the course, it is a requirement that you undertake at least 10 days’ experience in the UK state secondary sector. Five of these days must be before you apply, to strengthen your application and to support interview answers. ( this may not be possible at this time)\r\nThese two weeks are an important and integral element of the course, providing you with the opportunity to observe a variety of teaching styles and to engage in some initial group and class teaching. \r\n\r\n","status":1,"createdAt":"2021-07-06T10:52:16.163Z","updatedAt":"2021-10-26T09:27:11.360Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024"}
