{"id":"8081dd65-2e03-4ed2-a256-8fde665a68bb","name":"Primary","code":"29XB","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"trainingProvider":{"id":"a85d1731-bf24-4734-9a72-5719cd94584c","code":"1BC","name":"Gipsy Hill Federation"},"accreditedBody":{"id":"3c17f1f1-e695-473f-8836-57997d910e5b","code":"L75","name":"London South Bank University"},"profPost":"BO","english":"3","maths":"3","science":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","aboutCourse":"LEVEL 6 MODULES:\r\n* Key Stage 1 and 2 core curriculum (including Maths, English, Science and ICT);\r\n* Professional Studies;\r\n* Foundation Subjects;\r\n* School Experience;\r\n* An Alternative Educational Setting placement\r\n\r\nMASTER'S LEVEL MODULES:\r\n\r\nCompulsory module: Equality, Inclusion and Citizenship.\r\n\r\nOptions: You will be able to choose an option. The following are examples: SEND (Special Educational Needs and Disability); Inquiry Based Science Learning; Raising Achievement in Mathematics; Exploring Mathematics; Connect, Consume, Create: ICT in the Primary School; Language, Literature and Learning; Performing Arts; and Early Years Education.\r\n","interviewProcess":"SELECTION\r\nWe shortlist trainee teachers who can demonstrate the following, as well as meet our entry requirements:\r\n\r\nA personal statement which will be marked against the following criteria:\r\n\r\n* Written in Standard English with no ambiguities or grammatical errors;\r\n* The candidate's ability to reflect upon what they have learned from their experience in an educational setting;\r\n* The candidate's ability to reflect upon how their individual qualities and skills would be an asset to primary schools.\r\n\r\nApplications must be supported by two strong academic and/or employer references. On enrolment, original certificates of degree awards and GCSEs must be produced.\r\n\r\nINTERVIEW\r\nWe will invite shortlisted applicants to an interview.\r\n\r\n* The first part of the interview day will consist of a Maths, English and Science skills audit.\r\n* Candidates will then be asked to deliver a storytelling session to a class (20 minutes max), followed by a short reflection on this session with the interview panel.\r\n* Candidates will then be required to give a short presentation demonstrating an awareness of the role of a teacher, as well as some knowledge of current issues in primary education.\r\n* Finally, candidates will undertake a formal interview which will include a series of questions.","howSchoolPlacementsWork":"Students will undertake two placements during their training year. \r\n\r\nThe first placement will take place in an Alternative Education Setting (AES) for 12 days in the latter part of the Autumn Term. This placement is arranged by the trainee and must take place in a 'school' setting in England as defined in Section C2.3 ITT Criteria (2016, p.19-20), e.g. a Pupil Referral Unit (PRU) or a Special School.\r\n\r\nThe second placement is in a consecutive Key Stage in a different school to your main setting. This placement lasts for 18 days and takes place in the latter part of the Spring Term. Students will be allocated a placement in a school within Gipsy Hill Federation. The placement is a teaching placement and teaching will be graded.","personalQualities":"We’re looking for applications from:\r\n\r\n* Inspirational people who will bring commitment, enthusiasm and energy to our schools \r\n* People with ambition and determination to be the best they can be in whatever direction they want their career to go - we provide the opportunities and welcome ambition\r\n* Creative people who can think ‘out of the box’ \r\n* Someone with ‘fire in their belly’ who will fight for our children to succeed and really care about them. ","otherRequirements":"Gipsy Hill Federation, Lambeth and Southwark council are committed to safeguarding and promoting the welfare of children and young people and expect all staff and volunteers to share this commitment. All staff will be expected to hold or be willing to obtain an enhanced DBS disclosure for this authority.","status":2,"createdAt":"2021-07-06T10:51:16.975Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"Students will receive a salary on the unqualified teacher scale at point one (UQ01) for Inner London. \r\n\r\nUniversity fees will be covered by the Federation."}
