{"id":"1cf5fd41-9918-4694-99a6-65aa19a64035","name":"Chemistry","code":"25DQ","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"912d4fb4-761b-42e9-8dc6-e968b791ea4e","code":"F1","name":"Chemistry"}],"locations":[{"id":"c526003a-3988-418a-a64f-fbd061a63236","name":"Main Site - Broughton High School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"a6adab46-9f62-4450-a020-27998aa416f7","code":"12V","name":"Preston Primary and Secondary Alliance"},"accreditedBody":{"id":"9be9f611-2d36-431a-9109-7fcbbfc88fc8","code":"C99","name":"University of Cumbria"},"profPost":"PG","degreeGrade":"9","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feeDetails":"\r\nYou may be entitled to a bursary as financial incentives are offered to trainees intending to train to teach in order to encourage the best graduates to enter the profession.  There is a wide range of funding available to support your teaching career and, depending on the subject you want to teach, you could receive a generous bursary or scholarship. \r\nFor more detailed information on bursaries and scholarships contact our Administrator Sandra Duggan, telephone 01772 867210 or email at duggans@broughtonhigh.co.uk .  Further information is also available on the Department for Education Get Into Teaching website.\r\n\r\n","aboutCourse":"The majority of the course will be delivered by the expert teachers in our alliance schools in the Preston area. There will also be full support and academic preparation from tutors and our University programme leaders at the University of Cumbria Lancaster campus, although most of the course will be delivered in school. The programme gives you PGCE and recommendation for QTS; the PGCE is awarded by the University of Cumbria and includes 60 Master's credits.\r\n\r\nOur secondary trainees will complete two placements in two of our partner schools. Following an Induction week in your placement school you will start your teaching practice from Monday through to Thursday and on Fridays you will participate in a Conference Day with the other trainees on a variety of key themes designed to support your developing practice. The Conferences will be run by the experts from our partnership in each field and ranging from Safeguarding, lesson planning, behaviour management, assessment and many more. Our Conference deliverers model the teaching and learning strategies which we know work in the classroom. There will also be opportunities to spend some time in different school contexts in order that you gain a diverse and contrasting range of experiences, for example other Primary, Secondary, Special School and Sixth Form settings, as appropriate. Each partner school has a trained Professional Mentor and Subject Mentor who will oversee your training and assist you with your role in the context of the whole school and, in addition, support you in your classroom practice with subject specific expertise.\r\n\r\nDuring the training there are twelve subject pedagogy days where you will be able to work with other trainees from other school direct programmes with the University of Cumbria on your subject expertise at the Lancaster campus. The programme includes opportunities where you can gain assignment support with your University Programme Leader at Broughton High School, Preston and you will have full access to the University learning and support services throughout the course which will enable you to access library resources and assistance with your academic work. We have allocated time for Professional Reading, Subject Knowledge Enhancement sessions and Assignment Writing Days which will aid both your assignment writing and inform your classroom practice.\r\n","interviewProcess":"Candidates apply through UCAS and are shortlisted following reference to the entry requirements and if successful are invited for interview. Broughton High School coordinates the recruitment process and the interview will take place in one of the secondary schools in the alliance or online.\r\n\r\nFollowing a welcome by our Partnership Programme Leader Jackie Williams and our School Administrator, there are four parts to the interview. Your documentation will be reviewed including examination certificates and ID. A written task which is set by the University of Cumbria prior to interview, and notes completed in advance, is completed on the day. Candidates also deliver a short mini-teach on a pre-prepared topic. There is an interview with the Partnership Programme Leader and one or two other teachers from our alliance schools which lasts around 20 minutes. Our Secondary candidates also complete a 30 minute subject knowledge audit in their chosen subject.\r\n\r\nDoing some research about the Preston Primary and Secondary Alliance and the University that will be leading the training is good preparation and we will of course provide you with plenty of opportunities to ask questions on the day.\r\n\r\nFollowing the interview we update UCAS which is followed up by the University’s formal offer letter to confirm your place, if successful. Depending on the assessment at interview, there may be a need to complete a Subject Knowledge Enhancement course.\r\n\r\n","howSchoolPlacementsWork":"The Preston Primary and Secondary Alliance consists of over 40 schools - a variety of primary, secondary and special schools all in and around the Preston area. We select our schools carefully and the vast majority have been graded Good and Outstanding by Ofsted. We pride ourselves on the strong relationships we have developed over the years and are committed to a warm welcome and a supportive environment for all. You will be training in placement schools which are different in context to provide you with a wide experience of how different pupils are taught and learn. We select placement schools very carefully to offer the best and most suitable provision possible, which includes ensuring that trainees do not have to travel long distances or have time-consuming journeys. \r\n\r\nSecondary trainees will teach in KS3 and KS4 (ages 11-16). Some trainees will have the opportunity to teach in Sixth form and all our trainees receive training on A Level courses and have experience in an A Level setting during the year. The first placement runs from September to December and the second, longer placement from January to June. A typical week involves four days in school when you will spend a great deal of time observing teachers in your subject area and around school, ultimately building up a timetable for your own teaching practice of seven hours by Christmas. On second placement, following your induction period, you will build up to a time table of twelve teaching hours. Fridays have been allocated for conference training on the key themes in education.\r\n\r\nYou will also have the opportunity to spend full days in our partner primary schools, special schools and sixth forms.\r\n\r\n","personalQualities":"We are looking to recruit talented trainees who have the qualities and attributes suited to a career in teaching, together with the enthusiasm, energy and ambition to develop into outstanding practitioners. This is an ideal opportunity if you have just completed your degree or are looking to change career. If you are positive and have good communication and interpersonal skills, if you have a passion for your subject area and a love of learning then we would love to hear from you.","otherRequirements":"Before applying we do advise you to spend some time or research the daily life of in a Secondary school.  We can help you gain this experience in one of our partner schools or on one of our School Experience sessions at Broughton High School. Our programme will give you the experience of a typical day, provide you with the opportunity to talk to teachers and current trainees and allow you to gain valuable guidance and tips on applying for teacher training. The details of our School Experience sessions are regularly updated on our PTSA website. ","status":1,"createdAt":"2021-07-12T13:49:22.942Z","updatedAt":"2021-10-05T13:12:35.147Z","canSponsorStudentVisa":"yes","cycle":"2024"}
