{"id":"3bec798b-e8ea-4ea8-85d2-e84e6e291d5a","name":"Primary","code":"25JJ","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"c526003a-3988-418a-a64f-fbd061a63236","name":"Main Site - Broughton High School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"a6adab46-9f62-4450-a020-27998aa416f7","code":"12V","name":"Preston Primary and Secondary Alliance"},"accreditedBody":{"id":"9be9f611-2d36-431a-9109-7fcbbfc88fc8","code":"C99","name":"University of Cumbria"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"The majority of this course will be delivered by the expert teachers in our Alliance Schools in the Preston area. There will also be full support and academic preparation from our University Programme Leader in our Preston training facilities. The programme gives you PGCE and recommendation for QTS; the PGCE is awarded by the University of Cumbria and includes 60 Master's credits. The two 30-credit masters level modules are practically focused and titled ‘Raising the Achievement of Children’ and ‘High Quality Learning and Teaching’. Both are designed to focus on your priorities and interests as you develop your teaching skills. They involve a total of three written assessments, one of which is a formative piece to support your academic development. The University of Cumbria lecturers work closely with our school direct programme team to ensure that theory and practice are closely entwined to really inform your teaching and give you a useful toolkit to take forward in your career. \r\n\r\nYou will complete three placements in three of our partner schools, one per term. Following an induction week you will start your teaching practice from Monday through to Wednesday. On Thursdays our University Programme Leader will deliver sessions to support you with pedagogy and the completion of your assignments and on Fridays you will participate in a Conference Day on a variety of key themes. The Conferences will be run by the experts from our partnership in each field and ranging from Safeguarding, lesson planning, behaviour management, assessment and many more.  There will also be opportunities to spend some time in different school contexts in order that you gain a diverse and contrasting range of experiences, for example other Primary, Secondary, and Special Schools. Each partner school has trained mentors who will oversee your training and assist you with your role in the context of the whole school and, in addition, support you in your classroom practice with subject specific expertise.\r\n\r\nThe programme includes opportunities where you can gain assignment support at the University of Cumbria, and you will have full access to the University learning and support services throughout the course which will enable you to access library resources and assistance with your academic work. We have allocated time for Professional Reading, Subject Knowledge Enhancement sessions on all subject areas and Assignment Writing Days which will aid both your assignment writing and your classroom practice.\r\n","interviewProcess":"Candidates apply through UCAS and are shortlisted following reference to the entry requirements and if successful are invited for interview. Our Primary Administrator coordinates the recruitment process and the interview will take place in one of the Primary Schools in the Alliance, or online in line with current Government COVID guidelines.\r\nFollowing a welcome by our Partnership Programme Leader and our Primary Lead, there are three parts to the interview which generally takes place over a full morning or online. Your documentation will be reviewed including examination certificates and ID. Candidates will deliver a short mini-teach on a pre-prepared numeracy or literacy topic. There is an interview with the Partnership Programme Leader and one or two other Head teachers, and teachers from our Alliance Schools which lasts around 20 minutes. \r\nDoing some research about the Preston Primary and Secondary Alliance and the University that will be leading the training is good preparation, and we will of course provide you with plenty of opportunities to ask questions on the day.\r\nFollowing the interview we update UCAS which is followed up by the University’s formal offer letter to confirm your place, if successful.\r\n","howSchoolPlacementsWork":"The Preston  Primary and Secondary Alliance consists of over 40 schools in total - a variety of primary, secondary and special schools all in and around the Preston area. We select our schools carefully and the vast majority have been graded Good and Outstanding by Ofsted. We pride ourselves on the strong relationships we have developed over the years and are committed to a warm welcome and a supportive environment for all. You will be training in placement schools which are different in context to provide you with a wide experience of how different pupils are taught and learn. We select placement schools very carefully to offer the best and most suitable provision possible, which includes ensuring that trainees do not have to travel long distances or have time-consuming journeys. \r\nOur General Primary candidates will teach in KS1 and in KS2 (from 4-11 years) and will have three placements as part of their training. The three different placements take place in the Autumn, Spring and Summer terms, and a typical week involves three days in school. On Fridays you will participate in a Conference Day with the other trainees on a variety of key themes designed to support your developing practice, on Thursdays our University Programme Leader will deliver sessions to support you with pedagogy and the completion of your assignments.  During each term there will be a period where trainees are being assessed and they will be in school each day.\r\n\r\n","personalQualities":"We will be looking to recruit talented trainees who have the qualities and attributes suited to a career in teaching, together with the enthusiasm, energy and ambition to develop into outstanding practitioners. This is an ideal opportunity if you have just completed your degree or are looking to change career. If you are positive and have good communication and interpersonal skills, if you have a passion for working with children, and a love of learning then we would like to hear from you.\r\n\r\n","otherRequirements":"Before applying we advise you to spend some time in Primary school settings.  You will be able to observe teaching in action and we can help you gain this experience in one of our partner schools or on one of our School Experience Days at Queen’s Drive Primary School. Our programme will give you the experience of a typical day; provide you with the opportunity to talk to teachers and current trainees, and allow you to gain valuable guidance and tips on applying for teacher training. The details of our School Experience Days are regularly updated on our PTSA website.","status":1,"createdAt":"2021-07-12T13:49:23.396Z","updatedAt":"2021-10-05T13:27:24.775Z","canSponsorStudentVisa":"yes","cycle":"2024"}
