{"id":"f4eefead-ab01-423b-aa7c-8bcec089e0e4","name":"Primary (3-7)","code":"H833","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_7","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"d40305ea-bc72-497f-b105-b866e207ecf5","name":"Alfreton Nursery School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"e42576ab-5005-412e-bfae-ecf0cd334bf1","code":"2C2","name":"Alfreton Nursery School"},"accreditedBody":{"id":"aa023df3-b71e-4249-b9c4-41fca8bd135e","code":"D39","name":"University of Derby"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"Other","feesUK":9250,"feeDetails":"University tuition fees, £9,250, are payable by you and you will be able to access the standard financial package of student support available to all students in England.","aboutCourse":"Our School Direct programme is a school-led teacher training course where, as a trainee teacher, you will become embedded within your school teaching team from day one.  \r\n\r\nOur programme has been written in collaboration with The University of Derby.  Trainees are supported through school mentors, Derby University, link tutors, as well as within their School Direct peer support network.\r\n\r\nOur bespoke package enables students to train in our local schools. Training days take place locally at Alfreton Nursery School or The University of Derby.    \r\n\r\nThis Postgraduate Certificate in Education; primary (3-7 years) programme leads to qualified teacher status, together with 60 masters credits. \r\n\r\nThe programme fully prepares students for the practical demands of teaching, with experienced outstanding teachers sharing their knowledge and expertise.\r\n\r\nOur innovative and integrated programme is at the cutting edge of teacher training, we aim to produce outstanding reflective practitioners who can provide creative, challenging and purposeful teaching and learning.\r\n\r\nThere are no formal examinations however you will be continuously assessed throughout your course so you become the best you can be for your future students and career as a Newly Qualified Teacher.\r\n","interviewProcess":"Trainees completing an Initial Teacher Training Programme must demonstrate the required competencies in the Fundamentals and English and Maths outlined by the Department for Education before Qualified Teacher Status is awarded.\r\n\r\nTo ensure trainees meet the required competencies you will be required to undertake and pass the University’s agreed assessment which will take place when you commence your course. Full details of the required competencies and assessment will be provided in due course.   Please note it is the trainee’s responsibility to secure these fundamental skills.\r\n\r\nThe UCAS form requires candidates to provide the details of two referees. If candidates have studied within the last 5 years, an academic reference must be provided. Ideally, candidates should choose someone who can comment on their character and suitability to enter the teaching profession. The other reference should be a school or employer's reference. Please be aware that if references are not appropriate, they may delay the processing of your application\r\n\r\nInterviews will be held at Alfreton Nursery School.","howSchoolPlacementsWork":"You will spend the Autumn and Summer term in your main host school, gradually increasing the amount of time spent in the role of a teacher; working closely with an experienced and skilled practitioner and mentor.  To gain maximum experience, during the Spring term you will move to a complimentary placement school, with a contrast to your first placement.  There will also be the opportunity to engage in Enhanced Placement weeks of your choice, again broadening your knowledge and experience.\r\n\r\nWe want all our students to gain maximum benefits from their School Direct placement schools.  We will work with you to ensure you are placed in the right schools for you through our bespoke package of support.  ","personalQualities":"We are looking for motivated students with a passion for teaching, with the ability to build caring relationships with students.  You must be friendly and approachable and demonstrate a strong work ethic and resilience.  \r\n\r\n","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:51:20.709Z","updatedAt":"2021-07-16T12:05:03.650Z","canSponsorStudentVisa":"yes","cycle":"2024"}
