{"id":"4b5f8dd0-73e4-4d79-a4d4-50a243f95eab","name":"Primary","code":"X765","qualification":"qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"6c289979-ecb4-4898-a352-239aa4d301ea","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"6790c223-2102-460a-afb9-0dffeb0ce142","code":"279","name":"Kirkby Primary Partnership"},"accreditedBody":{"id":"d2b7d074-fac9-42c5-a0d3-d5471b35f7d9","code":"N91","name":"Nottingham Trent University"},"degreeGrade":"1","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"financialSupport":"This is open to all graduates (including those who expect to complete their degree prior to the September start date). You will pay tuition fees and may be eligible for student loans, and a bursary or scholarship.","aboutCourse":"Candidates will spend 4 days per week in their placement school and 1 day per week at NTU.  Candidates will have an experienced professional mentor (usually their class teacher) to guide their school-based training.  There will be weekly school-based observations and meetings to develop their professional skills.\r\nWe work in partnership with Nottingham Trent University (NTU) to train outstanding teachers who make a significant difference to their pupils, their schools and their profession. NTU is an established and successful provider of initial teacher-training and education-related courses. Staff at our school work with the experienced researchers and practitioners at the University to design and deliver our courses which can be tailored to meet your individual needs. These courses carefully blend significant hands-on teaching experience in our schools with the critical thinking and theoretical underpinning that is so important for the teaching profession. The University offers a Postgraduate Certificate in Education, which can be obtained alongside the recommendation for Qualified Teacher Status. National surveys show that NTU’s trainee teachers highly recommend their course, and over 9 out of 10 are employed in a teaching role in the year following graduation – well above the national average. Many go on to progress successfully into leadership roles. ","interviewProcess":" The aim of the NTU Assessment Centre is to identify your aptitude and potential to meet the Teacher's Standards at the highest level, and to meet the demands of the course.   Our aim at the University’s Assessment Centre is to identify your aptitude and potential to meet the Teachers’ Standards at the highest level and the demands of the course.\r\nIf invited for interview, you will be asked to evidence two things:\r\n1: You will be asked to evidence your subject knowledge. We will explore the level of that subject knowledge in relation to your potential to teach the full breadth of the curriculum and the subject specific examination specifications.\r\n2: You will be asked to evidence your research into the teaching profession. We will explore the practical steps that you have taken to research thoroughly the requirements of professional training for\r\nentry into the teaching profession.\r\nAt this time you may also evidence any experience of observation in primary schools.\r\nSchool interviews will take place in the lead school by a selection of Head Teachers from the partnership.  It will be a single interview where candidates will be required to make a short presentation about why they want to be a primary school teacher, a 30 minute session with a group of children and a short formal interview.","howSchoolPlacementsWork":"Kirkby Primary Partnership includes a total of 6 primary schools.  The partnership usually trains 4 students per year.  The schools working with students each year differs, depending on the requirements of each particular school that year.  Each student will have a main placement school, where they will spend the majority of their practice.  In this school they will be assigned a specific year group in either KS1 or KS2 and they will remain in that Key Stage throughout.  Each student will also have a 2nd placement school within the partnership.  This 2nd placement will take place after Christmas, whereupon the student will work in the opposite Key Stage to the one in their main school.\r\nThe candidate usually spends 4 days per week in school and 1 day at NTU.  The days at university decrease as the placement enters its final term.","personalQualities":"We are looking for candidates who can demonstrate that they have a genuine passion for teaching, a talent for inspiring children and  resilience for the rigours of the profession.","otherRequirements":"If your application is successful, prior to starting teacher training although not necessary prior to interview.\r\n• You will need to undergo a Disclosure and Barring Service check (formerly known as a Criminal Records Bureau or CRB check) and provide information relating to Childcare Disqualification regs.\r\n","status":1,"createdAt":"2021-07-06T10:52:00.769Z","updatedAt":"2021-09-16T15:54:54.582Z","canSponsorStudentVisa":"yes","cycle":"2024"}
