{"id":"411162dc-4f6f-4fe0-85a5-55a2478ca71d","name":"Primary (3-7)","code":"X122","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"3_to_7","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"0775ebd7-b621-421a-b4c6-a9b446206883","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"d8b99dc6-52c0-4d80-925e-28c11c305477","code":"P60","name":"University of Plymouth"},"profPost":"PG","degreeGrade":"1","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":13800,"feeDetails":"The course fees shown are those for 2020 entry","financialSupport":"This programme is eligible for Initial Teacher Education (ITE) tuition fee loans and maintenance grants. Please see this link for further details: [Get in to Teaching](https://getintoteaching.education.gov.uk/funding-my-teacher-training/bursaries-and-scholarships-for-teacher-training) \r\n\r\nPlease note: The government bursary funding is subject to change and revision.\r\n\r\nStudent teachers receive a contribution towards travel costs to placements that are a greater travelling distance than their travel from their term time address to the university.\r\n","aboutCourse":"This dynamic, placement-focused programme enables you to become an enthusiastic and stimulating teacher, ready to inspire young children. \r\n\r\nLearn to teach the relevant curricula and build your understanding of how young children think, develop and learn. Supported by our inspirational staff, this programme will enable you to build the skills needed for a career in Early Years Foundation Stage settings and in Key Stage 1 in primary schools.\r\n\r\nYou’ll combine 14 weeks of campus-based lectures and seminars with two different placements totalling 24 weeks. Learn to teach Areas of Learning for the Early Years Foundation Stage, the core subjects of the national curriculum for Key Stage 1 as well as an introduction to the non-core subjects.\r\n\r\nYou’ll learn through lectures, seminars and workshops and through independent research. Throughout the year you’ll reflect upon your professional development as a teacher, bringing together your understanding of educational theory with your developing knowledge of outstanding practice. \r\n\r\nYour first placement will be in an Early Years Foundation Stage setting, where you will learn to provide exciting learning opportunities for young children. In your final placement, which will be in Key Stage 1, you will take on – as closely as possible - the full responsibilities of a qualified teacher. You will be supported with your preparations for your first teaching post as a newly qualified teacher (NQT).\r\n\r\nCore modules:\r\n\r\nEPGP605 Blocked Experience in Educational Settings 1\r\n\r\nEPGP607 Final Experience in Educational Settings\r\n\r\nEPGP613 The Broader Curriculum in EYFS and Key Stage 1\r\n\r\nEPGP700 Reflection on Professional Studies\r\n\r\nEPGP711 Early Years Foundation Stage & KS1 Core Curriculum Subjects\r\n\r\nKey Features:\r\n\r\n-A programme with a national reputation for its quality.\r\n\r\n-Learn to teach and assess all the Areas of Learning for the Early Years Foundation Stage and the required subjects of the national curriculum for Key Stage 1 with confidence and creativity.\r\n\r\n-Benefit from the high-quality teaching of experienced university tutors.\r\n\r\n-Engage in your own research about early years education and gain up to 60 credits at master’s level.\r\n\r\n-Become an outstanding teacher of young children as you progress through 24 weeks in different placements, supported by expert mentors. \r\n\r\n-Benefit from close partnerships with a very diverse range of schools and educational settings across the whole of the South West of England, London and internationally.","interviewProcess":"All short-listed applicants are invited to an interview. You'll be sent an article to read beforehand, as well as suggestions for further research on a current topic, such as phonics. \r\n\r\nOn the day there will be a presentation to give you information about the PGCE programme and an opportunity for you to ask questions. You'll be involved in a group discussion about the article and have a paired interview with a tutor on the PGCE course. \r\n\r\nWe are looking for people who can talk about educational issues and children's learning, drawing on their own personal experiences as a learner and on their observations of teachers in primary schools. There is also an audit of your English skills with a short test. \r\n\r\nAt the end of the process, we want you to be clear what the programme offers, what you can expect from us and what our expectations are of you, so please make sure you ask any questions that you may have.","howSchoolPlacementsWork":"The placement structure is divided into placement 1a, placement 1b and placement 2.  Placement 1 will be undertaken at the same school to allow you the time and space to gain further skills and understanding back on campus before you return to the same placement school.  You then have the opportunity to put your new skills and ideas into practice in an environment that you know and where you have developed professional relationships with the children you teach.\r\n\r\nPlacement 2 offers a different experience in a new school.\r\n","personalQualities":"Suitability for the PGCE Primary Early Years programme is judged on a range of factors including academic qualifications, ability to work with other people and a real interest in learning and teaching young children.\r\n\r\nLife experiences will also be taken into consideration, so we would encourage you to apply!","otherRequirements":"There is also a requirement to pass minimum standards for literacy and numeracy.\r\n\r\nAll offers made for this course are subject to a satisfactory Disclosure and Barring Service (DBS) Enhanced Disclosure check.\r\n\r\nYou are required to complete Fitness to Teach health screening.\r\n\r\nSchool experience is desirable, but not essential.","status":1,"createdAt":"2021-07-06T10:52:05.614Z","updatedAt":"2021-09-08T12:56:57.455Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
