{"id":"5d747698-0a2e-4df8-8ef9-12620b1dfecd","name":"Mathematics","code":"G1X1","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"72345aa7-096c-488f-8649-085b8178cadb","code":"G1","name":"Mathematics"}],"locations":[{"id":"0775ebd7-b621-421a-b4c6-a9b446206883","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"d8b99dc6-52c0-4d80-925e-28c11c305477","code":"P60","name":"University of Plymouth"},"profPost":"PG","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"Mathematics degree or other relevant subject.  If joint honours at least  50% of degree needs to be Mathematics.","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Will accept BTEC Level 2 First Certificate for Maths and English as equivalent to GCSE Grade C/4. GCSE equivalences done within an Access Course prior to 2014 or pass in English and/or Maths equivalency tests - please contact institution for further information.","courseLength":"OneYear","feesUK":9250,"feesInternational":14200,"feeDetails":"The fee's displayed are those for 2022 entry.","financialSupport":"This programme is eligible for Initial Teacher Education (ITE) tuition fee loans and maintenance grants. Please see this link for further details: [Get in to Teaching](https://getintoteaching.education.gov.uk/funding-my-teacher-training/bursaries-and-scholarships-for-teacher-training) \r\n\r\nBursaries available for English and Mathematics teachers subject to meeting edibility criteria [here](https://www.feadvice.org.uk/i-want-work-fe-skills-sector/i-want-be-teacher-fe-skills/incentives-new-teachers/itt-bursaries)\r\n\r\nPlease note: The government bursary funding is subject to change and revision.\r\n\r\nStudent teachers receive a contribution towards travel costs to placements that are a greater travelling distance than their travel from their term time address to the university.\r\n","aboutCourse":"An 11-16 course (with A level experience). Education is a complex and intellectually challenging process and a basic purpose of it is to prepare young people to embrace a rapidly changing society. Our very successful full time, one year programme will help you to apply your graduate knowledge, expertise and enthusiasm to the imaginative and practical teaching of your subject to children of all abilities. It also enables you to qualify for the national Teachers’ Standards for Qualified Teacher Status (QTS).\r\nWe are committed to the pursuit of excellence and learning in secondary education. The teaching team believes fully in the role that practising teachers have in training the next generation of teachers. Indeed, the programme is planned and implemented in partnership with the full involvement of partners in secondary schools. We believe in building strong cross-curricular links in order to share ideas and perspectives but also to develop a strong support structure for you within faculty sessions and whilst out in your placement.\r\n\r\n[pgce-secondary-mathematics]\r\n(https://www.plymouth.ac.uk/courses/postgraduate/pgce-secondary-mathematics)","interviewProcess":"You will attend an interview day which will consist of a writing task, a short presentation (5 minutes) to the panel and fellow applicants and an interview conducted by small panel which will include members of the tutor team and may also include a representative from a partnership school.\r\n\r\nThe interview day is just as much for you to decide on the right course as it is for us to decide if you are right for the course. You will get an introduction to the course structure and support systems and there is plenty of opportunity to ask questions.","howSchoolPlacementsWork":"You will have two secondary placement schools with your PGCE. The first placement runs from the end of Sept to Christmas and the second longer placement is from January to the end of June. Students often comment that one of the key strengths of the course is that you start off with two days a week when starting your placements. This means that you can see the links between theory and practice and build your rapport with classes and your confidence in teaching.\r\n\r\nSchools are selected for you from the placement offers from our partnership schools. We take into account where you live and whether you can drive when allocating. We have a clear placement policy that prioritises requirements, whether you have particular responsibilities, such as being a lone parent of young children. \r\n\r\nYou will be teaching 11-16 and will also receive A level enhancement experience across the 40-50 schools we partner with.","personalQualities":"Suitability for the PGCE Secondary programme is judged on a range of factors including academic qualifications, ability to work with other people and a real interest in learning and teaching. \r\n\r\nWe would encourage you to apply because a range of life experiences may well make you an excellent candidate for this course.","otherRequirements":"There is also a requirement to pass minimum standards for literacy and numeracy.\r\n\r\nAll offers made for this course are subject to a satisfactory Disclosure and Barring Service (DBS) Enhanced Disclosure check.\r\n\r\nYou are required to complete Fitness to Teach health screening.\r\n\r\nSchool experience is desirable, but not essential.","status":1,"createdAt":"2021-07-06T10:52:05.431Z","updatedAt":"2021-09-08T13:10:39.144Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
