{"id":"78fcad56-b094-4f21-93ce-c963bbda2f55","name":"Post-Compulsory Education and Training","code":"X341","qualification":"pgce","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","subjectLevel":"further_education","isSend":"no","subjects":[{"id":"9de4b2d2-5739-4c34-92d2-9b4384760298","code":"41","name":"Further education"}],"locations":[{"id":"0775ebd7-b621-421a-b4c6-a9b446206883","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"d8b99dc6-52c0-4d80-925e-28c11c305477","code":"P60","name":"University of Plymouth"},"profPost":"PF","degreeGrade":"2","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"A bachelors or Maters degree in the subject you wish to teach","english":"9","maths":"9","science":"9","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feesInternational":13800,"feeDetails":"The fee's displayed are those for 2020 entry.\r\n\r\n","financialSupport":"Student teachers receive a contribution towards travel costs to placements that are a greater travelling distance than their travel from their term time address to the university.","aboutCourse":"The government aims to make sure that the Further Education and Skills (FES) sector provides the skilled workforce employers need and helping individuals reach their full potential. Central to achieving this stated aim is having highly skilled and effective teachers within the FES sector. \r\nIf you want to teach in the Further Education and Skills (FES) sector then this is the programme for you. This programme meets the teaching qualification criteria for [QTLS](https://set.et-foundation.co.uk/professionalism/qtls/) (Qualified Teacher Learning and Skills). \r\nDuring this one year, [full-time programme](https://www.plymouth.ac.uk/courses/postgraduate/pgce-incorporating-the-diploma-in-education-and-training) you will be required to complete four 30-credit modules and eight teaching observations. As a full-time trainee, you will be committed to a Monday to Friday week of academic and professional study, consisting of two full days per week of on-campus study, two days per week of professional practice placement (arranged by the University) and one day per week of independent study and research. You will work closely with your colleagues on the programme, learning together and from one another, with peer-support an important part of the programme organisation and learning. University tutors and subject specialist mentors, in an atmosphere of professional evaluation and support, will carry out your teaching observations. The four 30-credit modules (one at level 6 and three at level 7) each consist of three assessed components and the emphasis is on the interplay between theory and practice with reflexivity the golden thread running throughout.  \r\n","interviewProcess":"We expect applicants to have a broad overview of the role of a teacher in the Further Education and Skills sector and be able to articulate this at interview. A member of the course teaching team will conduct the initial interview and then, if successful, you will be interviewed at a later date with a placement tutor. The second interview is to ascertain your levels of subject specialist knowledge within the teaching placement context. \r\nDuring the initial interview you will be expected to show and articulate your experience of the sector; your understanding of the role of a teacher of your subject specialism; and your ability to research government policies and initiatives relevant to the sector. You will also be required to prepare and present a five-minute micro teach on a subject that you might reasonably be required to teach. This is an opportunity for you to demonstrate your potential to undertake Initial Teacher Education. You will also have a literacy, numeracy and free writing task to undertake. This final task does not affect the outcome of the interview but serves as an indicator of areas that might need refreshing.\r\nPlease note: you are not required to undertake the professional skills test or have school experience for this programme.","howSchoolPlacementsWork":"We arrange your placement at one of our local colleges. You will be in the same placement organisation throughout the whole year and there is an expectation that you gain breadth of practice experience opportunities in different Further Education and Skills (FES) settings. You will typically be in placement for two days a week (Monday, Wednesday or Friday) and will be expected to participate in the full range of teaching activities including: planning, delivery and assessment of taught sessions and wider teaching related activities such as curriculum development and planning, student support and pastoral roles, course marketing events. Entry onto this programme is conditional on the University identifying a suitable placement and mentor.","personalQualities":"We expect our trainee teachers to work within our professional body’s [code of conduct](https://set.et-foundation.co.uk/membership/code-of-professional-practice/) and uphold its values, skills and attributes at all times. Being a trainee teacher requires resilience, determination and excellent self-management skills. These qualities will be further developed whilst on programme to ensure that you are best prepared to enter your new career teaching in the further education and skills sector. ","otherRequirements":"Applicants with overseas qualifications can check their compatibility with the UK equivalent through [NARIC](https://www.naric.org.uk/naric/), who provide an advisory service.\r\n\r\nNon-academic requirements\r\n•\tYou’ll be required to complete a satisfactory enhanced DBS Disclosure, register with the Independent Safeguarding Authority and complete a criminal convictions self-declaration form. \r\n•\tYou must be deemed fit to teach.\r\nAll appropriately qualified candidates will be given equal consideration during the selection process. ","status":1,"createdAt":"2021-07-06T10:52:05.665Z","updatedAt":"2021-09-08T13:01:08.240Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
