{"id":"de317a33-c960-4317-a427-03c163492e9a","name":"Primary","code":"2C23","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"ed6f78d7-ddb3-42e5-b938-04dfef5d1010","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"aa8f69eb-d5ae-4ee3-8c1f-0ba2f8062469","code":"1D8","name":"Teach Heart Alliance"},"accreditedBody":{"id":"9be9f611-2d36-431a-9109-7fcbbfc88fc8","code":"C99","name":"University of Cumbria"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"Third party tests accepted.","courseLength":"OneYear","feesUK":9250,"financialSupport":"You may be eligible for a loan while you study. \r\n\r\nFind out about financial support if you’re from outside the UK. \r\n\r\nFinancial support from the training provider\r\n\r\nAnyone who applies for a place can also apply for financial support through the Student Loan Company.\r\nTo find out more, visit: https://www.gov.uk/apply-for-student-finance\r\nBursaries, scholarships and financial support for 2020/21 will be announced soon.\r\n","aboutCourse":"The success of this PGCE course is underpinned by both an academic teaching philosophy and the practical skills of real school-based learning. This learning process allows beginning teachers to develop their teaching skills and reflect on the impact they make on pupils, the school and the community. Teach Heart Alliance work with highly successful schools in Bolton, Wigan, Rochdale, Oldham, Manchester and Salford. Our mission at HEART is to enable beginning teachers to enthuse and inspire children aged 5-11 with creative teaching. We aim to provide an innovative, school-led programme whereby beginning teachers can learn from specialist tutors and expert practitioners at the cutting edge of developments in education.\r\n\r\nWith their professional training needs in mind our beginning teachers complete significant placements in three primary schools.\r\n\r\nBeginning teachers are assigned a 'Home School' where they are based when not in lectures or on placement. The first half term blends time in school with a taught programme delivered by a team of outstanding practitioners. Beginning teachers use their ‘Home School’ to develop their practice whilst building up to a first teaching 'Beginning Placement' after the October half term. Beginning teachers move on to their second ‘Developing Placement’ school in the spring term and complete their final placement ‘Extending Placement’ in the summer term.  During the year beginning teachers also complete a number of tasks that will support them in meeting the standards required for the award of QTS and will complete pieces of assessed work linked to their PGCE study.\r\n\r\nOur beginning teachers have a wide range of opportunities to observe and learn from good and outstanding practitioners. Beginning teachers also undertake helpful ’broadening experience visits’ and ‘mini placements’ in secondary, nursery and special schools arranged by the partnership.\r\n\r\nWe feel that our programme is rigorous but successful in preparing beginning teachers for a career in teaching and to become outstanding teachers in their own right. Feedback from our successful cohorts has always been overwhelmingly positive.\r\n\r\n","interviewProcess":"What are we looking for?\r\nIf you want to inspire life-long learners and are passionate to improve the outcomes for primary pupils you are what Teach Heart Alliance is looking for.\r\n\r\nTeach Heart Alliance\r\n\r\nThe interview will take place at Teach Heart Alliance and will include:\r\n• 20 minute observed focus activity\r\n• An interview\r\n• Written task\r\nThe aim of the interview is to get the very best from our candidates and is carried out in a fair and professional manner.\r\nYou will be informed prior to your interview the content of the activity and the age group you will be teaching. Our Interview team will consist of Teach Heart Alliance school staff. The rigorous and thorough process is aimed at recruiting trainees of the highest calibre.\r\nWe look forward to receiving your application to join this prestigious programme.\r\n","howSchoolPlacementsWork":"Teach Heart Alliance programme, in partnership with the University of Cumbria and over 20 schools in Bolton, Wigan, Rochdale, Oldham, Preston, Manchester and Salford offers a PGCE with QTS and is aimed at producing Outstanding Teachers and Leaders of tomorrow. Our schools are selected on the basis of their commitment to supporting our future teaching profession.\r\n\r\nEach beginning teacher will be expected to receive the following:\r\n1 Home school placement - Beginning teachers are assigned a 'home school' where they are based when not in lectures or on placement. The first half term blends time in school with a taught programme delivered by a team of outstanding practitioners\r\n\r\nThree placement blocks in differing schools and covering all primary phases. \r\n\r\nAll placements are planned on an  individual basis with the requests of each candidate carefully considered. \r\n\r\n\r\n","personalQualities":"We are looking for applicants that are passionate about their subject with a real desire to inspire and improve the outcomes for all of our students. You will need to be:\r\n- Reflective and appreciative of the demands and rewards that a career in teaching offers.\r\n- Passionate and have excellent knowledge  of your subject area.\r\n- Able to work as part of a team and maintain appropriate relationships.\r\n- Organised and have good time management skills.\r\n- Committed to being involved in the wider life of the school/extracurricular activities.","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:49:24.511Z","updatedAt":"2021-10-05T09:38:51.657Z","canSponsorStudentVisa":"yes","cycle":"2024"}
