{"id":"c52641ce-8f6c-4d4e-8493-a315a5cf8733","name":"Primary","code":"34VB","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"other","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"trainingProvider":{"id":"2a8c96df-d304-47d2-acb2-8f84849496f0","code":"1AC","name":"Amwell View School"},"accreditedBody":{"id":"feecdec5-259c-45e3-b1cf-4e391936ee90","code":"H36","name":"University of Hertfordshire"},"english":"2","maths":"2","science":"2","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":null,"aboutCourse":"Amwell View School and Specialist Sports College is a Lead School for School Direct Training and judged outstanding by Ofsted (2006/7, 2009/10, 2014/15 and 2018/19).  There are eleven special schools and two primary schools working within this partnership.\r\n\r\nDedicated to delivering excellence in education as well as first class teacher training working in partnership with the University of Hertfordshire to offer an exciting and innovative school direct programme.  The course is full time with a series of training sessions and tutorials covering all aspects of teaching the Primary curriculum subjects, which compliment the in school experience provided. The training sessions are held at the UH and will be led by expert practitioners to develop your knowledge, skills and understanding of effectively teaching lessons in a primary school.\r\n\r\nA programme of continuous formative assessment of trainees' subject knowledge and ability to teach, as recorded within the portfolio, culminates in a rigorous assessment of the Teachers' Standards for Qualified Teacher Status (QTS) as specified by the Department for Education (DfE). As an accredited provider, the partnership recommends trainees, on successful completion of their training programme for Qualified Teacher Status (QTS).\r\n\r\nTrainees will be employed by their training school and paid a salary equivalent to point one on the unqualified teacher scale. They are not required to pay tuition fees.  Trainees on the School Direct salaried route will be in a classroom working with experienced colleagues. You will also be appointed a mentor with whom you will meet at least once a week for a meeting.\r\n","interviewProcess":"\r\n \r\n\r\n\r\n","howSchoolPlacementsWork":"The school direct trainee will have two school placements one term will be within a mainstream primary school and two terms within their training special school.\r\n\r\nThe Headteacher of the training school will select a partner mainstream primary school and arrange the dates for the placement.\r\n\r\nA Professional Mentor will oversee the school-based training and attend the relevant aspect of the Induction Programme and further Professional Mentor Development Session.\r\n\r\nA Teacher Mentor will support all aspects of the training across two consecutive Key Stages and attend relevant aspects of the Induction Programme and further Mentor Development Sessions.\r\n\r\nYou will be released from school for the trainee for attendance at the School Direct Salaried Professional Learning Course (Wednesdays).\r\n\r\nYou will be released from school for a Second School Experience.\r\n\r\nYou will receive an appropriate timetable, including time for observations, mentor meetings and other planned activities.\r\n\r\nThere will be access and liaison with a UH Visiting Tutor. \r\n\r\nThere will be access for an UH Senior Tutor and External Moderator for any Quality Assurance visits required.\r\n","personalQualities":"We are looking for candidates with a real passion for teaching. You will need to be self-motivated and resilient with a drive to make a difference to the lives of young people.\r\n\r\n","otherRequirements":"This placement is classed as having a high degree of contact with children or vulnerable adults and is exempt from the Rehabilitation of Offenders Act 1974.  An enhanced disclosure will be sought through the Criminal Records Bureau as part of Hertfordshire County Council’s pre-employment checks.  \r\n\r\nObservation time in a mainstream school is recommended, however, not essential.  Candidates will need to show some knowledge of the school curriculum as well as the Teachers' Standards.","status":2,"createdAt":"2021-07-06T10:53:02.034Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","applicationsOpenDateOther":"2021-12-14T00:00:00.000Z","salaryDetails":"You will be employed during your training period as an unqualified teacher and paid at point 1 on the unqualified teacher scale.\r\n\r\nThere are no fees or other costs for this course.\r\n"}
