{"id":"b74ce84d-2d8c-4624-afcf-8a394991fc8c","name":"Primary","code":"2ZKM","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"a976bf37-8a05-4e8f-8545-7ef381c5094b","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"98454838-ceb8-4138-96a2-7effabb15f51","code":"2DP","name":"Durham Schools Together"},"accreditedBody":{"id":"926804ac-be7a-4f0a-97f9-a26a5f5f032a","code":"S84","name":"University of Sunderland"},"profPost":"PG","degreeGrade":"1","english":"1","maths":"1","science":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feesInternational":10750,"aboutCourse":"Durham Schools Together School Direct course is a primary teaching course with QTS and you will achieve a PGCE. All placements will take place at one of the five partner schools: Coxhoe Primary School (lead school), Esh Church of England, Bowburn Primary School, West Cornforth Primary School and Newker Primary School. \r\n\r\nThe course is tuition meaning that you will pay a tuition fee for your course and you will be eligible to apply for the many generous, tax-free government scholarships on offer.\r\n\r\nAssessments will be a mix of written assignments, case studies and one to one assessments of your teaching practice. You will be taught via lectures, seminars, tutorials, project work and group work. You will be in University (University of Sunderland) for an average of 15 days during the full training year; the University will provide support with your education assignments and practice-based research. \r\n\r\nOn the School Direct route your work-based learning will be based in the school. You will have a School Mentor and a University Tutor who will assess your written work and your teaching practice. You will also have support from a University Mentor.","interviewProcess":"After receiving applications, successful applicants will be invited to interview. Invitations are sent via Dfe Apply and the email provided on your application. The selection criteria will be based on personal attributes and experience across the primary age range.\r\nDuring the selection day candidates are required to deliver a short guided reading lesson to a small group of children, complete a written task and take part in various discussion tasks. This will be followed have an interview. Head teachers and school mentors from our lead school and associated schools will carry out the selection procedure. We aim to ensure that selection days are calm and allow you to have a positive experience. The quotes below are from some of our past students who took part in the selection day:\r\n‘I was, understandably, quite nervous leading up to my interview, however the staff were so welcoming and I was immediately made to feel at ease. I found the interview itself rather enjoyable and would definitely recommend the school and staff alike - such a lovely atmosphere.’","howSchoolPlacementsWork":"Throughout the Primary School Direct course, you will teach across the 3-11 age range. Durham Schools Together is currently a partnership of five good-outstanding schools. One of these schools will become your host school where will complete two of your assessed placements. The third placement will be in an alternative partnership setting and will usually be based in the Early Years Foundation Stage. As well as having university days, the five partnerships schools will each offer bespoke, focused training days throughout the year.","personalQualities":"We are looking for candidates who demonstrate a genuine passion to work with children and make a difference in their lives. Candidates should be confident, creative and inspire effort and trust in their pupils. Candidates will demonstrate a strong desire to teach at an outstanding level and continually improve and develop as a practitioner. They must have the ability to deal with a heavy workload; be able to meet deadlines and enjoy working as part of a team.","otherRequirements":"In addition to the specific entry requirements detailed, the following DfE Requirements must be met.\r\nAll candidates must:\r\n- Meet the Secretary of State's requirements for physical and mental fitness to teach\r\n- Have been subject to a Disclosure and Barring enhanced disclosure check\r\n- Have the intellectual and academic capabilities needed to meet the required DfE Teachers' Standards\r\n- Communicate clearly and accurately in Standard English\r\n- Possess the appropriate qualities, attitudes and values expected of a teacher","status":1,"createdAt":"2021-07-06T10:57:19.052Z","updatedAt":"2021-09-22T12:21:50.280Z","canSponsorStudentVisa":"yes","cycle":"2024"}
