{"id":"196e9732-41a0-4f58-8941-51ba381711df","name":"Geography","code":"2LWL","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3f47e67b-7fa5-4947-a5a0-74d528cd2a87","code":"F8","name":"Geography"}],"locations":[{"id":"3f9a8788-a9b2-4a4a-b994-56af56d9690f","name":"Main Site - one of our partner schools across Surrey","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"741b762e-b8eb-43ae-b93e-9ec2e43495bf","code":"1OV","name":"George Abbot SCITT School Direct"},"accreditedBody":{"id":"b453d6f2-8dfc-43c2-9734-08ef0a80b2a7","code":"G12","name":"George Abbot SCITT"},"profPost":"BO","degreeGrade":"1","additionalDegreeSubjectRequirements":"false","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We accept equivalency tests from www.astarequivalency.co.uk or www.equivalencytesting.com .  All costs must be borne by the applicant and the equivalency test must be passed by 31st August prior to the course starting.","courseLength":"OneYear","feesUK":8300,"feeDetails":"The fee is £8300 for those following the Qualified Teacher Status (QTS) only programme.\r\n\r\nThe fee is £9250 for those following the PGCE programme whereby a PGCE qualification will be gained as well as Qualified Teacher Status.  \r\n\r\n[For information about tuition fees loans, click here](https://getintoteaching.education.gov.uk/funding-your-training)\r\n","financialSupport":"Exceptional candidates identified at interview may be offered a scholarship which includes a £1000 reduction in fees as well as entry onto a middle management leadership course.  \r\n\r\nMore information including qualifying criteria regarding our scholarships can be found in our information pack.  \r\n\r\nTo request an information pack, please email: contactscitt@georgeabbot.surrey.sch.uk\r\n","aboutCourse":"This programme will equip trainees to teach Geography to students aged 11 to 16 but may give experience of Key Stage 5 (A level) teaching, dependent upon the school in which you are based.  \r\n\r\nThis is a full-time school based training programme starting in September and finishing the following July. You will spend 4 days a week in school working alongside a mentor and gradually building up your classroom experience. You will observe expert colleagues and embody the qualities and role of a teacher.  On the fifth day you will undertake study sessions as a Secondary cohort. These sessions cover key teaching theories, strategies, policies and approaches. In addition, you will break into subject specialisms to explore the themes of your subject in greater depth.\r\n\r\nTrainees can opt for the QTS (Qualified Teacher Status) only programme or the PGCE programme.  The difference between these two routes is that the PGCE earns a trainee 60 Masters credits alongside their QTS, essays are written with an academic focus. The QTS route still includes essay writing but this is rooted in classroom practice and reflection. Our PGCE is accredited by Kingston University but all delivery takes place within our training programme and there is no need for trainees to attend the University at any time. You will have access to all the online library and support systems remotely.\r\n\r\n","interviewProcess":"Our interview process will include the following:\r\n\r\n* a formal interview \r\n* a presentation that you will be asked to prepare in advance of the day\r\n* a group task focused on learning\r\n\r\nThe interview panel is likely to comprise of two members of the SCITT team but may also include a member of staff from one of our partner schools.  \r\n\r\nPrior to the interview we will send you details on how to complete our online fundamental Maths and English test.\r\n\r\n[More information on what we are looking for from candidates can be found on our website](www.georgeabbottraining.co.uk)","howSchoolPlacementsWork":"Successful candidates will be matched with a main placement school. This is the school where they will work for the Autumn, Spring 1 and Summer term.  All trainees have a mentor who supports their development.\r\n\r\nWhen selecting a main placement school, we take into consideration the following:   \r\n\r\n* schools that can accommodate a trainee in the required subject\r\n\r\n* the ability of the school to support a trainee based on the trainee's strengths and weaknesses\r\n\r\n* travel to the placement school\r\n\r\n* any links that trainees may have with schools\r\n\r\nThe placement school selection is completed in conjunction with the trainee. A taster day helps the trainee to identify whether the school placement is a good match.\r\n\r\nA second placement takes place in the second half of the Spring term in a contrasting school.  \r\n\r\nTrainees are expected to be in school before the school day begins and to attend meetings, events and training that will go beyond the hours that the pupils are on site. \r\n\r\nOn Wednesdays all trainees participate in Professional Study sessions - these predominantly take place in the training room at George Abbot School but could take place in any of our partner schools.  They are a blend of face-to-face and remote learning opportunities.\r\n\r\nAll candidates will also spend one week in an SEN setting and observe in KS2 and KS5.\r\n\r\nFor further information, request an information pack via lfilby@georgeabbot.surrey.sch.uk\r\n","personalQualities":"We are looking for the following personal qualities (this list is not exhaustive!):\r\n\r\n* A commitment to the teaching profession and improving the lives of young people;\r\n* Enthusiasm for teaching, learning and your subject;\r\n* Relevant knowledge of UK education system, the National Curriculum and an awareness of current educational issues;\r\n* Commitment to professional development;\r\n* Organisational and communication skills;\r\n* The ability to establish effective professional relationships with both pupils and adults;\r\n* Flexibility and a willingness to act upon advice;\r\n* Fundamental numeracy and literacy skills\r\n* Tenacity and resilience;\r\n* Readiness for hard work.\r\n\r\n","otherRequirements":"All offers made will be subject to:\r\n\r\n* the candidate demonstrating fundamental English and Maths skills \r\n* receipt of a satisfactory enhanced Disclosure and Barring Service (DBS) \r\n*satisfactory references to include the current or most recent employer (if applicable)\r\n*a mutually suitable placement school being identified\r\n*completion of Fitness to Teach questionnaire\r\n\r\nFor all candidates:  please note we require sight of original GCSE, A level and degree certificates at interview.  For those who have studied overseas we also require sight of any original ENIC documentation.\r\n","status":1,"createdAt":"2021-07-06T10:55:54.031Z","updatedAt":"2021-09-30T12:14:43.205Z","canSponsorStudentVisa":"no","cycle":"2024"}
