{"id":"1cc6c431-70a5-4c52-b5dc-513f32ff3606","name":"Primary","code":"Y308","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"other","programType":"SD","fundingType":"fee","studyMode":"P","ageRange":"3_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"3f9a8788-a9b2-4a4a-b994-56af56d9690f","name":"Main Site - one of our partner schools across Surrey","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"741b762e-b8eb-43ae-b93e-9ec2e43495bf","code":"1OV","name":"George Abbot SCITT School Direct"},"accreditedBody":{"id":"b453d6f2-8dfc-43c2-9734-08ef0a80b2a7","code":"G12","name":"George Abbot SCITT"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We accept equivalency tests from www.astarequivalency.co.uk or www.equivalencytesting.com .  All costs must be borne by the applicant and the equivalency test must be passed by 31st August prior to the course starting.","courseLength":"4 terms - September 2022 to December 2023","feesUK":8300,"feeDetails":"The fee is £8300 for those following the Qualified Teacher Status (QTS) only programme.\r\n\r\nThe fee is £9250 for those following the PGCE programme whereby a PGCE qualification will be gained as well as Qualified Teacher Status.  \r\n\r\n[For information about tuition fees loans, click here](https://getintoteaching.education.gov.uk/funding-your-training)\r\n","financialSupport":"Exceptional candidates identified at interview may be offered a scholarship which includes a £1000 reduction in fees as well as entry onto a middle management leadership course.  \r\n\r\nMore information including qualifying criteria regarding our scholarships can be found in our information pack.  \r\n\r\nTo request an information pack, please email: contactscitt@georgeabbot.surrey.sch.uk","aboutCourse":"This programme is only for those applicants who are currently employed in a primary setting and whose employing school are willing and able to support them during their training.  \r\n\r\nThe course will equip trainees to teach subjects across the primary curriculum to students aged from 3 to 7 or from 5 to 11.\r\n\r\nThis is a school based training programme over 4 terms, spending 2 days a week in school working alongside a mentor and gradually building up your classroom experience. You will observe expert colleagues and embody the qualities and role of a teacher.  One day a week, you will undertake study sessions as a Primary cohort. These sessions cover key teaching theories, strategies, policies and subjects. \r\n\r\nThe remaining 2 days a week leave you free to be employed by your current employing school as a TA or LSA.  This means that you will have some income during the training year.\r\n\r\nIn the second half of the 3rd term until the end of the programme you will move to training in school 3 days a week.\r\n\r\nTrainees can opt for the QTS (Qualified Teacher Status) only programme or the PGCE programme.  The difference between these two routes is that the PGCE earns a trainee 60 Masters credits alongside their QTS, essays are written with an academic focus. The QTS route still includes essay writing but this is rooted in classroom practice and reflection. Our PGCE is accredited by Kingston University but all delivery takes place within our training programme and there is no need for trainees to attend the University at any time. You will have access to all the online library and support systems remotely.","interviewProcess":"Our interview process will include the following:\r\n\r\n* a formal interview \r\n* a presentation that you will be asked to prepare in advance of the day\r\n* a group task focused on learning\r\n\r\nThe interview panel is likely to comprise of two members of the SCITT team but may also include a member of staff from one of our partner schools.  \r\n\r\nPrior to the interview we will send you details on how to complete our online fundamental Maths and English test.\r\n\r\n[More information on what we are looking for from candidates can be found on our website](www.georgeabbottraining.co.uk)","howSchoolPlacementsWork":"Successful candidates will be placed in a main placement school for the majority of the 4 terms of training.\r\n\r\nAll trainees have a mentor, usually the class teacher,  for support.  The focus will be on teaching students from age 3 to 7 or from 5 to 11, depending on which route the candidate and placement school agree upon.  \r\n\r\nApplicants on this programme must already have an employing primary  (or infant or middle) school willing to support them over the training period.\r\n\r\nA second placement will take place in the second half of the Summer term.  This placement must be in a different Key Stage so the trainee has experience of more than one age group over the training year.  During the second placement the trainee will remain employed 2 days a week at the main placement school.\r\n\r\nTrainees are expected to be in school before the school day begins and to attend meetings, events and training that will go beyond the hours that the pupils are on site. \r\n\r\nOn Thursdays all trainees participate in Professional Study sessions - these predominantly take place in the training room at George Abbot School but could take place in any of our partner schools.  They are a blend of face-to-face and remote learning opportunities.\r\n\r\nAll candidates will also spend one week in an SEN setting and observe in different key stages.\r\n\r\nFor further information, request an information pack via lfilby@georgeabbot.surrey.sch.uk","personalQualities":"We are looking for the following personal qualities (this list is not exhaustive!):\r\n\r\n* A commitment to the teaching profession and improving the lives of young people;\r\n* Enthusiasm for teaching, learning and your subject;\r\n* Relevant knowledge of UK education system, the National Curriculum and an awareness of current educational issues;\r\n* Commitment to professional development;\r\n* Organisational and communication skills;\r\n* The ability to establish effective professional relationships with both pupils and adults;\r\n* Flexibility and a willingness to act upon advice;\r\n* Fundamental numeracy and literacy skills\r\n* Tenacity and resilience;\r\n* Readiness for hard work.\r\n\r\n","otherRequirements":"All offers made will be subject to:\r\n\r\n* the candidate demonstrating fundamental English and Maths skills \r\n* receipt of a satisfactory enhanced Disclosure and Barring Service (DBS) \r\n*satisfactory references to include the current or most recent employer (if applicable)\r\n*a mutually suitable placement school being identified\r\n*completion of Fitness to Teach questionnaire\r\n\r\nFor all candidates:  please note we require sight of original GCSE, A level and degree certificates at interview.  For those who have studied overseas we also require sight of any original ENIC documentation.\r\n","status":1,"createdAt":"2021-07-06T10:55:54.861Z","updatedAt":"2021-09-30T12:16:42.118Z","canSponsorStudentVisa":"no","cycle":"2024","applicationsOpenDateOther":"2022-04-01T00:00:00.000Z"}
