{"id":"a91e1145-3c26-436f-8fc0-eedddde49207","name":"Primary","code":"2LWR","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"3_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"3f9a8788-a9b2-4a4a-b994-56af56d9690f","name":"Main Site - one of our partner schools across Surrey","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"741b762e-b8eb-43ae-b93e-9ec2e43495bf","code":"1OV","name":"George Abbot SCITT School Direct"},"accreditedBody":{"id":"b453d6f2-8dfc-43c2-9734-08ef0a80b2a7","code":"G12","name":"George Abbot SCITT"},"profPost":"BO","english":"3","maths":"3","science":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","aboutCourse":"This programme will equip trainees to teach subjects across the primary curriculum to students aged from 3 to 7 or from 5 to 11.\r\n\r\nThis is a school based training programme, spending 4 days a week in school completing 'on the job' training.  One day a week will be classroom based where more in depth studies can be made into pedagogy and covering a variety of topics including behaviour management, lesson planning, assessment for learning etc.  These sessions will be either take place face to face or virtually, depending on the COVID-19 regulations at the time.\r\n\r\nSalaried trainees will be asked to teach unsupervised for 3 lessons a week from the start of the programme.  Therefore we are looking for exceptional leadership and organisational qualities, and some previous experience leading training or working with children from salaried applicants.\r\n\r\nTrainees can opt for the QTS only programme or the PGCE programme which requires assignments to be written at Masters level.  These assignments are more research-based whereas the QTS assessments are more reflective, basing your work on your own classroom practice.\r\n\r\nOur PGCE is accredited by Kingston University but there is no need to visit Kingston, as you will have access to all the online resources and assessors will visit trainees to introduce assignments.\r\n\r\nGeorge Abbot SCITT has 100% employment records for trainees following the end of the programme.\r\n\r\n","interviewProcess":"Due to COVID-19, this year our interview process will comprise of:\r\n\r\n* a face to face interview via Zoom or other online platform, during which you will run through an idea for a lesson in your subject and how you might execute it\r\n\r\nThis interview panel is likely to comprise of two members of the SCITT team but may also include a member of staff from one of our partner schools.  Interviews may be recorded.\r\n\r\nSuccessful candidates will then be required to complete:\r\n\r\n* a written test designed to demonstrate your fundamental English \r\n* an online Maths test designed to demonstrate your fundamental numeracy skills\r\n* a written subject specific paper designed to test your knowledge of the syllabus\r\n\r\n[More information on what we are looking for from candidates can be found on our website](www.georgeabbottraining.co.uk)","howSchoolPlacementsWork":"Successful candidates will be placed in a main placement school for the majority of the academic year, with 4 weeks spent in a minor placement. \r\n All trainees have a mentor, usually the class teacher,  for support.  The focus will be on teaching students from age 3 to 7 or from 5 to 11, depending on which route the candidate and placement school agree upon.  \r\n\r\nThe majority of our salaried trainees already are known to their placement schools, either as Teaching Assistants or parent-volunteers.  However we usually have a small number of schools for whom we find salaried trainees.\r\n\r\nIn this case, when selecting a main placement school, we take into consideration the following:  \r\n\r\n* which of our partner schools would like a trainee \r\n* the ability of our partner schools to support a trainee based on the trainee's strengths and weaknesses\r\n* distance between the trainee's home and the placement school\r\n* any links that trainees may have with schools\r\n\r\nThe placement school selection is usually done in conjunction with the trainee and confirmed following a visit or online discussion between the potential trainee and the suggested school.\r\n\r\nA second, minor placement will take place in the second half of the Spring term in a contrasting school to the main placement school.  Again, all trainees have a mentor for assistance.\r\n\r\nTrainees are expected to be in their placement school before the school day begins and to stay for some time after school to attend necessary meetings etc.\r\n\r\nOn Thursdays all trainees will come together for Professional Studies and Subject Knowledge Enhancement sessions - these mainly take place at George Abbot School but could take place in any of our partner schools, or as virtual seminars.  \r\n\r\nAll candidates will also spend one week in an SEN setting as well as occasional days in other settings, with advance notice given.\r\n\r\nFor further information, request an information pack via kslatford@georgeabbot.surrey.sch.uk\r\n","personalQualities":"We are looking for the following personal qualities (this list is not exhaustive!):\r\n\r\n* A commitment to the teaching profession and improving the lives of young people;\r\n* Enthusiasm for teaching, learning and your subject;\r\n* Relevant knowledge of UK education system, the National Curriculum and an awareness of current educational issues;\r\n* Commitment to professional development;\r\n* Organisational and communication skills;\r\n* The ability to establish effective professional relationships with both pupils and adults;\r\n* Flexibility and a willingness to act upon advice;\r\n* Fundamental numeracy and literacy skills\r\n* Tenacity and resilience;\r\n* Readiness for hard work.\r\n\r\n","otherRequirements":"Salaried applicants must have the skills and experience to plan and deliver lessons on their own from the start of the course.  \r\n\r\nAll offers made will be subject to:\r\n\r\n* the candidate demonstrating they possess fundamental English and Maths skills\r\n* receipt of a satisfactory enhanced Disclosure and Barring Service (DBS) check\r\n* two satisfactory references to include the candidate's current or most recent employer (if applicable)\r\n\r\nFor all candidates:  please note we require sight of original GCSE, A level and degree certificates at interview.  For those who have studied overseas we also require sight of any original NARIC documentation.\r\n","status":2,"createdAt":"2021-07-06T10:55:54.161Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"There are no fees for this course and no bursaries or scholarships are awarded on any salaried training programmes.\r\n\r\nThe salary awarded will depend on the school in which the trainee is placed.  For trainees placed in schools with academy status, the salary will be 'at the advertised rate' which will be approximately £13,500 pro rata.\r\n\r\nFor trainees placed in other schools the salary will be at point UNQ1 of the Unqualified Teachers Salary Scale.  This is approximately £18,000 pro rata.\r\n\r\n"}
