{"id":"52ed2d72-0cb8-4ef1-93fc-cf465dd74684","name":"Physics","code":"2NMB","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"bf97cd0a-224c-43d3-a021-84143df13e8d","code":"F3","name":"Physics"}],"locations":[{"id":"38a3699f-2c21-473a-bd08-96ba0f8cffb5","name":"Main Site","isPublished":"N","status":"N","vacancies":"F"},{"id":"046be36b-a823-4ba6-9086-b7653d665693","name":"Phoenix Academy","isPublished":"N","status":"N","vacancies":"F"},{"id":"b79b8cde-f9a2-448c-bfd0-ab1f9c7cea84","name":"Hertfordshire Partnership","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"19f7aa7d-b0c7-4f65-b7e7-1425ae0100a9","code":"1ZC","name":"Pimlico Academy"},"accreditedBody":{"id":"42bce8af-e86c-4e4a-b811-3dc72ef20ed4","code":"P58","name":"Future Teacher Training"},"profPost":"BO","english":"2","maths":"2","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feesInternational":9250,"feeDetails":"The course fees for UK students in 2021 to 2022 are £9,250 \r\n\r\n\r\nInternational applicants:\r\n\r\nPlease see the information on our website for more guidance for international applicants: https://www.futuretraining.org/page/?title=Overseas+applicants+and+qualifications&pid=49\r\n","financialSupport":"There are tax-free bursaries available for a range of secondary subjects. If you are successful in obtaining a place, and your subject is eligible, we inform you of your eligibility for a bursary. This will be issued over ten monthly instalments, starting in October of your training year.\r\n\r\nTuition fee loans are available from the Student Loans Company to support with paying the £9,250 tuition fee. Other maintenance loans and grants are available through the Student Loans Company, subject to individual personal circumstances.\r\n\r\nThrough the trust we are part of, Future Academies, we are also able to offer:\r\n•Accommodation at an affordable and competitive rate, for applicants moving to London\r\n•The Future Teach Scholarship for high-calibre candidates to provide tuition fees covered and a bursary payment of £29,000 over 10 monthly instalments. Applicants must first successfully have obtained an offer from us, and if shortlisted for a scholarship, will go through a rigorous interview process with our sponsors at Future Academies.\r\n","aboutCourse":"The Pimlico-London SCITT offers an academically rigorous and school-led ITT programme. Our SCITT programme was awarded ‘Outstanding’ by Ofsted and ranked as the third best provider in the country (top in London) in The Good Teacher Training Guide 2017. We believe in the primacy of knowledge and that teacher-led, school based education can transform lives. Our trainee teachers learn to see themselves as the leaders of their pupils, as custodians of the best that has been thought, known, and created, and as a catalyst for innovation and transformation through the valuable knowledge and skills they will impart to those they teach. \r\n\r\nWe believe that as a student teacher you should be immersed in your host schools for the majority of the time so that you can benefit from the support and guidance of subject experts. Here you will benefit from a mentor who will observe your weekly progress against the Teachers’ Standards. You will also receive half a day of training in term time for training. \r\n","interviewProcess":"Interviews will be conducted by telephone conferencing. This will usually be with two members of the SCITT team, and you will be sent a link to this meeting on the day. \r\n\r\nPre-interview Tasks \r\n\r\nYou will be asked to complete a series of tasks before the interview and send to us by email before the interview. This includes a short essay on what makes great teaching and a lesson plan document you will be asked to complete based on a set learning objective. \r\n\r\nWe will provide more details about the interview when we confirm this with you.\r\n\r\nWhat will happen on the day of the interview?\r\n\r\nThe video Interview \r\n\r\nThe interview will last around 25-30 minutes. \r\n\r\nWe will ask you a series of questions about why you have chosen teaching as a career, and why you have chosen our route and us as a provider. There will also be the opportunity to ask us any questions you may have. \r\n\r\nSubject-Knowledge Task \r\n\r\nAfter the interview we will ask you to complete a subject-knowledge task. This will be a past paper GCSE-level question, for which no preparation is required. \r\n\r\nBefore the course\r\n\r\nIn addition to the required qualifications above, before the start of the course:\r\n•Provide proof of all qualifications\r\n•Complete an Enhanced Disclosure and Barring Service check before starting the course \r\n•Undergo an occupational health assessment to assess fitness for teaching.\r\n","howSchoolPlacementsWork":"The Pimlico London SCITT is part of Future Academies, a family of schools which has built a reputation for achieving the highest standards for all its pupils. We believe the most effective way to experience all aspects of school life is to be based in a host school throughout the year. To supplement this, trainee teachers will also participate in three focused placements. Trainee teachers do a three week placement in the second term, which will offer them a contrasting experience within our network of excellent schools. This network includes many independent, grammar and specialist schools. \r\n\r\nFurthermore, trainee teachers will also benefit from a week’s placement in a primary (for secondary trainees), or a secondary (for primary trainees). They will also gain experience within the Tri Borough Alternative Provision. \r\n","personalQualities":"We also assess applicants against the following qualities in their preliminary applications and interviews: \r\n- A strong academic record and passion for your subject \r\n- Strong communication and leadership skills.\r\n- The enthusiasm required to work with the children\r\n\r\n","otherRequirements":"In addition to the required qualifications above, before the start of the course, you will need to:\r\n\r\n•\tHave undergone an Enhanced Disclosure and Barring Service Check\r\n•\tHave undergone an occupational health assessment to assess fitness for teaching.\r\n","status":2,"createdAt":"2021-07-06T10:49:34.197Z","canSponsorStudentVisa":"no","cycle":"2024"}
