{"id":"8b6b23a2-a585-43ee-9321-289dece93054","name":"Social sciences","code":"W297","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"TA","fundingType":"apprenticeship","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"bd9a2174-f682-4f18-9551-498c2f7a48f9","code":"14","name":"Social sciences"}],"locations":[{"id":"046be36b-a823-4ba6-9086-b7653d665693","name":"Phoenix Academy","isPublished":"N","status":"N","vacancies":"F"},{"id":"b79b8cde-f9a2-448c-bfd0-ab1f9c7cea84","name":"Hertfordshire Partnership","isPublished":"N","status":"N","vacancies":"F"},{"id":"38a3699f-2c21-473a-bd08-96ba0f8cffb5","name":"Main Site","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"19f7aa7d-b0c7-4f65-b7e7-1425ae0100a9","code":"1ZC","name":"Pimlico Academy"},"accreditedBody":{"id":"42bce8af-e86c-4e4a-b811-3dc72ef20ed4","code":"P58","name":"Future Teacher Training"},"profPost":"PG","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","aboutCourse":"This route is a salaried route towards gaining Qualified Teacher Status (QTS). If successful, you will be employed by a main placement school for at least twelve months. You will receive the same entitlement to our excellent training programme and expert mentoring as unsalaried trainees. However, due to being salaried by the placement school, you would teach a higher number of lessons independently. Alongside your QTS training, all our trainees can choose to complete their PGCE through our top university provider.  \r\n\r\nWe are a top-ranked training provider (third in the most recent ‘Good teacher training guide’) and are committed to providing trainees with the best possible start to their teaching careers. We are rated Outstanding in all areas by OFSTED and  \r\n\r\nOn this route you will have access to excellent weekly training, led by our highly experienced team of trainers and subject curriculum experts. Through these curriculum experts you will also have access to exemplar curriculum and planning resources to alleviate the burden of planning from scratch in the early stages of your career. Furthermore, you will receive weekly, incremental, actionable feedback using our online instructional coaching programme.  \r\n\r\nFor more information: https://www.futuretraining.org/page/?title=Routes+On+offer&pid=14 \r\n","interviewProcess":"Interviews will be conducted by telephone conferencing. This will usually be with two members of the SCITT team, and you will be sent a link to this meeting on the day.  \r\n\r\nPre-interview Tasks  \r\n\r\nYou will be asked to complete a series of tasks before the interview and send to us by email before the interview. This includes a short essay on what makes great teaching and a lesson plan document you will be asked to complete based on a set learning objective.  \r\n\r\nWe will provide more details about the interview when we confirm this with you. \r\n\r\nWhat will happen on the day of the interview? \r\n\r\nThe video Interview  \r\n\r\nThe interview will last around 30-45 minutes.  \r\n\r\nWe will ask you a series of questions about why you have chosen teaching as a career, and why you have chosen our route and us as a provider. There will also be the opportunity to ask us any questions you may have.  \r\n\r\nSubject-Knowledge Task  \r\n\r\nAfter the interview we will ask you to complete a subject-knowledge task. This will be at GCSE level and will support us in identifying the support needed in advance of starting in September and during your training year. \r\n\r\nBefore the course \r\n\r\nIn addition to the required qualifications above, before the start of the course: \r\n\r\n- Provide proof of all qualifications \r\n- Complete an Enhanced Disclosure and Barring Service check before starting the course  \r\n- Undergo an occupational health assessment to assess fitness for teaching. ","howSchoolPlacementsWork":"The Pimlico London SCITT is part of Future Academies, a family of schools which has built a reputation for achieving the highest standards for all its pupils. We believe the most effective way to experience all aspects of school life is to be based in a host school throughout the year. This offers you continuity with your classes and your mentor.  \r\n\r\nTo supplement the main placement, you will also participate in three focused placements. The first is a three-week placement in the same phase as your main placement. This will offer you a contrasting experience within our wider network of excellent schools. This network includes many independent, grammar and specialist schools. In addition, you will also benefit from a week’s placement in a primary (for secondary trainees), or a secondary (for primary trainees) alongside a short observational experience in an alternative provision.  \r\n","personalQualities":"We also assess applicants against the following qualities in their preliminary applications and interviews:  \r\n\r\n- A strong academic record and passion for your subject  \r\n\r\n- Strong communication and leadership skills \r\n\r\n- The enthusiasm required to work with the children \r\n\r\n- Applicants also need experience gained from working in the classroom ","otherRequirements":"In addition to the required qualifications above, before the start of the course, you will need to: \r\n\r\n- Have undergone an Enhanced Disclosure and Barring Service Check \r\n\r\n- Have undergone an occupational health assessment to assess fitness for teaching. \r\n","status":2,"createdAt":"2021-07-06T10:49:34.810Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024"}
