{"id":"f8420412-2792-43d8-be66-ecf5af771388","name":"Primary Maths","code":"3F6B","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"38a3699f-2c21-473a-bd08-96ba0f8cffb5","name":"Main Site","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"19f7aa7d-b0c7-4f65-b7e7-1425ae0100a9","code":"1ZC","name":"Pimlico Academy"},"profPost":"BO","english":"3","maths":"3","science":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feesInternational":9250,"feeDetails":"International Applicants:\r\n\r\nThere are no additional fees for international applicants. However, please note that the right to work and study in the UK is required to undertake this programme with us as we are unable to sponsor applicants.\r\n\r\nStudent Loans Company\r\n\r\nIf assistance is required with paying for this course, please visit the Student Loans Company website to find out what assistance is available.","financialSupport":"This course carries a bursary of £6,000 for the year, divided into 10 monthly instalments. You must meet the A Level requirements in order to qualify for this.\r\n\r\nWe also can provide some candidates with accommodation at discounted rates.","aboutCourse":"The Pimlico-London SCITT offers an academically rigorous and school-led ITT programme. Our SCITT programme was awarded ‘Outstanding’ by Ofsted and ranked as the third best provider in the country (top in London) in The Good Teacher Training Guide 2017. We believe in the primacy of knowledge and that teacher-led, school based education can transform lives. Our trainee teachers learn to see themselves as the leaders of their pupils, as custodians of the best that has been thought, known, and created, and as a catalyst for innovation and transformation through the valuable knowledge and skills they will impart to those they teach.\r\n\r\nWe believe that as a student teacher you should be immersed in your host schools for the majority of the time so that you can benefit from the support and guidance of subject experts. Here you will benefit from a mentor who will observe your weekly progress against the Teachers’ Standards. You will also receive half a day of training in term time for training. \r\n","interviewProcess":"","howSchoolPlacementsWork":"Pimlico London SCITT is part of Future Academies, a family of schools which has built a reputation for achieving the highest standards for all its pupils. We believe the most effective way to experience all aspects of school life is to be based in a host school throughout the year. To supplement this, trainee teachers will also participate in three focused placements. Trainee teachers do a three week placement in the second term, which will offer them a contrasting experience within our network of excellent schools. This network includes many independent, grammar and specialist schools. Furthermore, trainee teachers will also benefit from a week’s placement in a primary (for secondary trainees), or a secondary (for primary trainees). They will also gain experience within the Tri Borough Alternative Provision.","personalQualities":"We are looking for highly-qualified and talented graduates. It would be beneficial to have had some observational experience in a school. It is essential that you have a passion for your subject, enjoy working with young people, and have the ability to inspire, motivate and challenge others.","otherRequirements":"Before the start of the course you will:\r\n•\tUndergo an Enhanced Disclosure and Barring Service Check\r\n•\tBe assessed on your literacy, numeracy and subject knowledge\r\n•\tHave undergone an occupational health assessment to assess fitness for teaching.\r\n\r\nPlease note that for this course it is also a specific requirement to have an A Level in Maths, at least grade B or above,","status":2,"createdAt":"2021-07-06T10:49:34.481Z"}
