{"id":"5da648dc-a160-4767-b6fe-ad4f2d9853bd","name":"Business Studies","code":"26ZH","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"de6477b2-6027-48e6-b9f7-3206774705c2","code":"08","name":"Business studies"}],"locations":[{"id":"7c7d12e0-670e-460d-a318-70321b8d0f04","name":"Main Site","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"d4c14d22-ab8a-4734-880f-2c8e35898cda","code":"1FM","name":"Kingston School Direct"},"accreditedBody":{"id":"7f11aaed-7c3e-42c5-af7a-023d33b45fa3","code":"U80","name":"UCL, University College London"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"https://astarequivalency.co.uk/ - grade 5\nor\nhttps://www.equivalencytesting.com/ - grade 5","courseLength":"OneYear","feesUK":9250,"aboutCourse":"The course is run by the UCL Institute of Education (Russell Square), lasts from September to June, and leads to the award of Qualified Teacher Status, PGCE and 60 MA credits.\r\n\r\nYou will develop the professional skills and attitudes to teach business in schools and colleges, as part of both academic (A level and GCSE) and applied courses. The PGCE emphasises the particular skills you will need to teach young people aged 14 to 19, and prepares you to make links between education and industry. You may teach some business elements in other subject areas as part of your practical teaching experience. \r\n\r\nWe aim to give you insight into the continuously evolving subject of business and its application to classroom teaching. A collaborative approach is used to help develop you as a thoughtful teacher who can work confidently and flexibly within the broad framework of the 14 to 19 curriculum. \r\n\r\nTutors have been actively involved in schools, colleges and recent major curriculum development projects in business education. The team carries out research, publishes widely and has an international reputation for the professional development of established teachers as well as those entering the profession. \r\n\r\nNew teachers are able to find good teaching positions on completion of the PGCE. We have strong links with the Economics and Business Education Association (EBEA) in the UK. We provide access to national and regional conferences for students and teachers and to the awarding bodies. \r\n\r\nDuring the PGCE you will work with national and international experts in secondary education and in the teaching of your subject, and draw on the results of major UCL IOE research studies in education. As part of the programme you will be assigned a university tutor who will support your development as a teacher through tutorials, visits to school and guidance with assignments. \r\n\r\nYou will have full access to the university's facilities. \r\n\r\nFor further information [click here](http://www.ucl.ac.uk/ioe/courses/teacher-training/business-education-pgce)","interviewProcess":"We operate a two stage process on our UCL programmes.\r\n\r\nCoombe Girls' School, as the lead school in the partnership, will co-ordinate the recruitment process. The UCL IOE will carry out all the necessary academic eligibility checks. \r\n\r\nFollowing successful shortlisting, the first stage will involve you spending a day in school, up to twenty five working days after we receive your application. This may include an individual interview, teaching part of a lesson, a subject knowledge assessment and a written task. This will also be an opportunity for you to learn about the training programme and partnership, see the school and talk to some staff and pupils. The process will be rigorous and will enable us to assess your potential for the teaching profession and to identify strengths and weaknesses for you to begin to address. \r\n\r\nIf you are successful at the school interview, our university partner will also invite you to an interview day at the UCL Institute of Education. This day will also serve as an opportunity to learn more about the PGCE course, the tutors and the facilities at the Institute. ","howSchoolPlacementsWork":"Once you have been accepted onto the programme, your placement schools will be allocated from the pool of schools offering your subject.  \r\nThis process is not normally finalised until late June, by when our schools will have fixed their staffing for September.\r\n\r\nYou will have two consecutive placements of roughly equal length - something which we consider a real strength of our programme, as it means that you will gain a deep understanding of both schools, their challenges, approaches and contexts.  We aim to give you two contrasting settings, in order for you to experience this variety.  Schools will give you a balance of year groups and abilities and, where possible, arrange for you to teach KS5, but this is not always manageable in both placement schools.\r\n\r\nPlacement one will run from October to January and placement two will run from February to May.\r\n\r\nYou may express a preference of school, which we will consider when drawing up the placements - but we cannot guarantee it.  We aim to keep your travel time to a maximum of one hour, although in most cases travel time is much less.\r\n\r\nFrom the beginning you will be treated as a member of staff, welcomed into your subject department and invited to attend staff meetings, development days, staff social activities and relevant educational trips.\r\n\r\nEach trainee will have a dedicated mentor in their placement school, who will guide you and work alongside you to identify needs and provide personalised support as you develop. Our mentors are outstanding teachers who are required to undertake a rigorous training programme to develop their coaching, effective classroom observation and feedback skills. They will work with you to develop rigour, professional knowledge, understanding and skills in order to deliver creative, purposeful and challenging teaching and learning. \r\n\r\nYou will gradually build up your contact time with students as you develop your confidence, teaching skills and time management. \r\n\r\nYou will be assigned to a tutor group, in order to regularly shadow a tutor and support all-important pastoral work. ","personalQualities":"We are looking for ambitious trainee teachers who are passionate and enthusiastic about their subject, with a real desire to share this with young people of all abilities, needs and backgrounds at secondary level. \r\n\r\nBusiness experience is a considerable advantage, and applicants with such experience are particularly welcome. Information technology skills are essential and there is ample opportunity to enhance them further during the programme. It is important for you to have a broad outlook on business and education matters and a commitment to relating the disciplines to young people's lives. You should have advanced subject knowledge in business. \r\n","otherRequirements":"You will ideally have some experience of working with young people, perhaps through volunteer work, young clubs, sports teams or charities. \r\n\r\nWe recommend that you gain some experience in a classroom prior to interview.\r\n\r\nAll places on the PGCE are subject to satisfactory health and criminal convictions assessments. Applicants will be required to complete an enhanced Criminal Records Bureau Disclosure and Barring Service (DBS) check. We expect you to share our commitment to safeguarding and promoting the welfare of children, young people and vulnerable adults.","status":1,"createdAt":"2021-07-06T10:53:44.892Z","updatedAt":"2021-10-04T11:18:55.557Z","canSponsorStudentVisa":"yes","cycle":"2024"}
