{"id":"aac95f7d-0a93-4d55-b417-6fccbec295d1","name":"Biology","code":"3C8L","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"322cfc19-d51d-45db-91e3-bd7b4738470f","code":"C1","name":"Biology"}],"locations":[{"id":"7c7d12e0-670e-460d-a318-70321b8d0f04","name":"Main Site","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"d4c14d22-ab8a-4734-880f-2c8e35898cda","code":"1FM","name":"Kingston School Direct"},"accreditedBody":{"id":"33037eab-f75d-4350-b1e2-967c41e9d4c6","code":"R48","name":"Roehampton University"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"www.equivalencytesting.com","courseLength":"OneYear","feesUK":null,"aboutCourse":"The PGCE Secondary science programmes at Roehampton University (Science with Biology, Science with Chemistry and Science with Physics) are designed to enable you to teach, as a minimum, all the science specified in the National Curriculum for science at Key Stage 3, and your chosen science specialism from biology, chemistry or physics, at Key Stage 4 and, if appropriate, at post-16. \r\n\r\nStudents join the course with a variety of science degrees and backgrounds. Few, if any, are confident from the start in all aspects of science demanded by the National Curriculum or even by their own subject specialism. Early in the course you will complete a personal audit and begin an action plan to build on your general science and subject specialism knowledge. This is an important thread running through the programme. A similar approach is followed with your understanding and skills in ICT, so that you will be able to make appropriate use of these when teaching. \r\n\r\nThe programme is the result of close collaboration between school-based mentors and the Roehampton team. It is arranged into three terms. In the first term you begin to learn how pupils develop science understanding and skills while at the same time building enough confidence to plan and teach a science lesson. The second term extends this by using teaching experience to improve lesson performance and revisit and extend issues within science education. The third term addresses science education outside the classroom and broader issues concerning the role of science within the school curriculum. Towards the end of this term, you will develop an action plan to provide a basis for progression and development within your first year of teaching. \r\n\r\nScience education at Roehampton is well staffed and resourced so that we are able to provide you with practical workshops as well as seminars and personal tutorials. Throughout the programme we aim to produce more than strong classroom practitioners; we aim also to produce reflective teachers who will go on to participate in, and influence, the future development of science education. \r\n\r\nScience Subject Studies will take place throughout the year on Wednesdays - at university, in a partner institution or site of educational interest.  On some Wednesdays you will focus on Professional Studies (more generic aspects of teaching and learning) with student teachers from other specialisms.  This will take the form of lectures, seminars, workshops or research. \r\n\r\nFor further information [click here](https://www.roehampton.ac.uk/postgraduate-courses/pgce-secondary/pgce-secondary-science-specialism/)\r\n","interviewProcess":"We operate a one stage process on our Roehampton programmes.\r\n\r\nCoombe Girls' School, as the lead school in the partnership, will co-ordinate the recruitment process. The University of Roehampton will carry out all the necessary academic eligibility checks. \r\n\r\nFollowing successful shortlisting, you will be invited for an assessment day in school, up to twenty five working days after we receive your application. This may include an individual interview, a presentation task, leading part of a lesson, a subject knowledge assessment and a written task. This will also be an opportunity for you to learn about the training programme and partnership, see the school and talk to some staff and pupils. The process will be rigorous and will enable us to assess your potential for the teaching profession and to identify strengths and weaknesses for you to begin to address. \r\n\r\nIf you are successful at the school interview, our university partner will carry out a paper scrutiny of your application and may invite you to an interview day to clarify certain points and give you an opportunity to learn more about the PGCE course, the tutors and the facilities at the university. ","howSchoolPlacementsWork":"You will have one main placement school, your employing school, and one short experience placement school (the A-B-A model).  You will begin in school A in September and finish in July.  During the Spring term you will move to  your short experience placement which lasts about 6 weeks, and then return to your employing school.\r\n\r\nWe aim to give you two contrasting settings, in order for you to experience a variety of context, approaches and challenges.  Schools will give you a balance of year groups and abilities and, where possible, arrange for you to teach KS5, but this is not always manageable in both placement schools.\r\n\r\nDuring this placement time, you spend four days a week in school (not Wednesdays).  \r\n\r\nFrom the beginning you will be treated as a member of staff, welcomed into your subject department and invited to attend staff meetings, development days, staff social activities and relevant educational trips.\r\n\r\nEach trainee will have a dedicated mentor in their placement school, who will guide you and work alongside you to identify needs and provide personalised support as you develop. Our mentors are outstanding teachers who are required to undertake a rigorous training programme to develop their coaching, effective classroom observation and feedback skills. They will work with you to develop rigour, professional knowledge, understanding and skills in order to deliver creative, purposeful and challenging teaching and learning. \r\n\r\nYou will gradually build up your contact time with students as you develop your confidence, teaching skills and time management. \r\n\r\nYou will be assigned to a tutor group, in order to work with a tutor team and support all-important pastoral work. ","personalQualities":"We are looking for ambitious trainee teachers who are passionate and enthusiastic about their subject, with a real desire to share this with young people of all abilities, needs and backgrounds at secondary level. \r\n\r\nWe expect you to have a good basic knowledge of biology, chemistry and physics, and be willing to learn more.  We normally expect you to have an A level in biology and one other science subject at minimum grade D, or the equivalent. Candidates without these qualifications may be accepted if they have acquired knowledge through other routes (e.g. work experience).\r\n","otherRequirements":"You must have good practical skills and technical know-how, particularly in biology-related practical work. \r\n\r\nYou will ideally have some experience of working with young people, perhaps through volunteer work, young clubs, sports teams or charities. \r\n\r\nWe strongly recommend that you gain some experience in a classroom prior to interview.\r\n\r\nAll places on the PGCE are subject to satisfactory health and criminal convictions assessments. Applicants will be required to complete an enhanced Criminal Records Bureau Disclosure and Barring Service (DBS) check.  We expect you to share our commitment to safeguarding and promoting the welfare of children, young people and vulnerable adults.","status":1,"createdAt":"2021-07-06T10:53:45.614Z","updatedAt":"2021-10-04T10:30:47.152Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"You will be paid on point 1 of the unqualified teacher scale, which is currently in the region of £21,000, from September to August.  Please be advised that, as a salary, this is taxable.\r\n\r\nYour course fee will be paid by your employing school."}
