{"id":"e61593bf-ab8e-455d-90f4-19c94240f0d5","name":"Art and Design","code":"E911","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"d461a678-3335-4ca2-9616-1dc479d31a49","code":"W1","name":"Art and design"}],"locations":[{"id":"7c7d12e0-670e-460d-a318-70321b8d0f04","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"d4c14d22-ab8a-4734-880f-2c8e35898cda","code":"1FM","name":"Kingston School Direct"},"accreditedBody":{"id":"33037eab-f75d-4350-b1e2-967c41e9d4c6","code":"R48","name":"Roehampton University"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"www.equivalencytesting.com","courseLength":"OneYear","feesUK":9250,"aboutCourse":"The key aim of this programme is to enable students to become confident, knowledgeable and enthusiastic teachers of art and design. The programme provides opportunities for students to explore the theory and practice of art and design education through a range of lectures, workshops and tutorials, and to develop their expertise in the classroom through two school placements.\r\n\r\nThe course will provide students with an awareness of the theoretical foundations of the subject, of strategies for teaching and learning in art and design and of current issues surrounding art and design education. Workshops will enable students to explore a range of practical processes including drawing, painting, printmaking, sculpture, textiles, photography and digital art. Regular tutorials enable students to receive individual support from tutors. Lecturers on the programme are experienced teachers of art and design and active researchers in the field of art and design education, while visiting artists offer workshops in specific processes.\r\n\r\nDuring school placements, students benefit from working alongside experienced teachers of art and design. Students have opportunities to observe excellent teaching before experimenting with approaches to teaching and learning across the secondary age range, during which time they are supervised and supported by teachers and tutors.\r\n\r\nIf you have specific questions about the programme please email the subject leader Robert Watts.\r\n\r\nFor further information [click here](https://www.roehampton.ac.uk/postgraduate-courses/pgce-secondary/pgce-art-and-design-specialism/)\r\n","interviewProcess":"We operate a one stage process on our Roehampton programmes.\r\n\r\nCoombe Girls' School, as the lead school in the partnership, will co-ordinate the recruitment process. The University of Roehampton will carry out all the necessary academic eligibility checks. \r\n\r\nFollowing successful shortlisting, you will be invited for an assessment day in school, up to twenty five working days after we receive your application. This may include an individual interview, a presentation task, leading part of a lesson, a subject knowledge assessment and a written task. This will also be an opportunity for you to learn about the training programme and partnership, see the school and talk to some staff and pupils. The process will be rigorous and will enable us to assess your potential for the teaching profession and to identify strengths and weaknesses for you to begin to address. \r\n\r\nArt candidates will be expected to provide and talk through a portfolio of their work at university and in their employment. They will be required to discuss Art and Design teaching in their specialist areas that they have seen or experienced recently in schools. \r\n\r\nIf you are successful at the school interview, our university partner will carry out a paper scrutiny of your application before approving it.","howSchoolPlacementsWork":"Once you have been accepted onto the programme, your placement schools will be allocated from the pool of schools offering your subject.  \r\nThis process is not normally finalised until late June, by when our schools will have fixed their staffing for September.\r\n\r\nYou will have two consecutive school placements (the A-B model).  The first lasts three months and the second lasts five months, meaning you will gain a deep understanding of both schools, their challenges, approaches and contexts.  We aim to give you two contrasting settings, in order for you to experience this variety.  Schools will give you a balance of year groups and abilities and, where possible, arrange for you to teach KS5, but this is not always manageable in both placement schools.\r\n\r\nPlacement one runs from late September to mid-December and placement two runs from January to the start of June.  During this placement time, you spend four days a week in school (not Wednesdays).  \r\n\r\nYou may express a preference of school, which we will consider when drawing up the placements - but we cannot guarantee it.  We aim to keep your travel time to a maximum of one hour, although in most cases travel time is much less.\r\n\r\nFrom the beginning you will be treated as a member of staff, welcomed into your subject department and invited to attend staff meetings, development days, staff social activities and relevant educational trips.\r\n\r\nEach trainee will have a dedicated mentor in their placement school, who will guide you and work alongside you to identify needs and provide personalised support as you develop. Our mentors are outstanding teachers who are required to undertake a rigorous training programme to develop their coaching, effective classroom observation and feedback skills. They will work with you to develop rigour, professional knowledge, understanding and skills in order to deliver creative, purposeful and challenging teaching and learning. \r\n\r\nYou will gradually build up your contact time with students as you develop your confidence, teaching skills and time management. \r\n\r\nYou will be assigned to a tutor group, in order to regularly shadow a tutor and support all-important pastoral work. ","personalQualities":"We are looking for ambitious trainee teachers who are passionate and enthusiastic about their subject, with a real desire to share this with young people of all abilities, needs and backgrounds at secondary level. \r\n","otherRequirements":"You will ideally have some experience of working with young people, perhaps through volunteer work, young clubs, sports teams or charities. \r\n\r\nWe strongly recommend that you gain some experience in a classroom prior to interview.\r\n\r\nAll places on the PGCE are subject to satisfactory health and criminal convictions assessments. Applicants will be required to complete an enhanced Criminal Records Bureau Disclosure and Barring Service (DBS) check.  We expect you to share our commitment to safeguarding and promoting the welfare of children, young people and vulnerable adults.","status":1,"createdAt":"2021-07-06T10:53:46.099Z","updatedAt":"2021-10-04T09:52:39.015Z","canSponsorStudentVisa":"yes","cycle":"2024"}
