{"id":"fa1b3ce7-a853-44c7-a5fb-a1464932219f","name":"Primary","code":"2RP7","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"7c7d12e0-670e-460d-a318-70321b8d0f04","name":"Main Site","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"d4c14d22-ab8a-4734-880f-2c8e35898cda","code":"1FM","name":"Kingston School Direct"},"accreditedBody":{"id":"33037eab-f75d-4350-b1e2-967c41e9d4c6","code":"R48","name":"Roehampton University"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"www.equivalencytesting.com","courseLength":"OneYear","feesUK":9250,"aboutCourse":"The PGCE Primary course is for graduates intending to qualify as primary school teachers.  You will develop the knowledge and skills required of primary and early years teachers. \r\n\r\nYou will gain a broad understanding of a wide range of curricular areas, including English, mathematics, science, art and design, design and technology, geography, history, information and communication technology, music, physical education and religious education. \r\n\r\nDuring the course you will develop the skills and knowledge appropriate for teaching across the 3-11 age range, with opportunities for particular emphasis on either the Foundation Stage and Key Stage 1, or Key Stage 1 and Key Stage 2. Roehampton also provides plenty of opportunity for your self-development. \r\n\r\nYou will undertake 120 days of practical placements in one of our diverse range of partner schools during the course, providing you with substantial classroom experience appropriately staged throughout the year. During the placements, you will progress from participant observer, via support teacher and sharing teacher, to lead teacher. \r\n\r\nThe assessment of your professional development takes place at regular intervals during the year and is a collaborative exercise involving you, your class teacher and your university tutor.  We do all we can to ensure that this process takes place smoothly, and that there is a continuous monitoring of professional development throughout the course. \r\n\r\nAll our tutors have extensive teaching experience in schools, and many have served in local authorities or subject associations as advisory teachers, as Ofsted inspectors or as consultants. This means our programmes are based on the reality of the classroom and education system. Many work at the cutting edge of research in teacher education, which has a positive impact on the quality of provision for all of our students. \r\n\r\nThe PGCE will prepare you to organise pupils' learning effectively. In particular, the course aims to foster the following qualities in student teachers:- \r\n* positive attitudes, values and high standards of personal and professional conduct \r\n* the facility to engage and motivate pupils to develop a love of learning \r\n* knowledge and understanding of how pupils learn and how this impacts on teaching \r\n* an understanding of the need to respond to the strengths and needs of all pupils \r\n* good subject knowledge across the curriculum \r\n* effective use of assessment data to develop teaching practice and secure pupils' progress \r\n* responsibility for development through self-evaluation, responding to advice and feedback \r\n\r\nFor further information [click here](https://www.roehampton.ac.uk/postgraduate-courses/pgce-primary/)","interviewProcess":"We operate a one stage interview process on our primary tuition fee route.\r\n\r\nCoombe Girls' School, as the lead school in the partnership, will co-ordinate the recruitment process.  Roehampton University will carry out all the necessary academic eligibility checks. \r\n\r\nFollowing successful shortlisting, you will spend a day in school carrying out the following tasks: an individual interview, a presentation task, leading part of a lesson and a written task. \r\n\r\nThis will also be an opportunity for you to learn about the training programme and partnership, see the school and talk to some staff and pupils. The process will be rigorous and will enable us to assess your potential for the teaching profession and to identify strengths and weaknesses for you to begin to address. ","howSchoolPlacementsWork":"Once you have been accepted onto the programme, your placement schools will be allocated from the pool of schools offering your subject.  \r\nThis process is not normally finalised until late June, by when our schools will have fixed their staffing for September.\r\n\r\nYou will carry out two blocks of teaching practice, in two different placement schools in our area. You will also attend two weeks in an alternative setting/phase, such as a special school or secondary school, in order to give you a wider experience from which to build your practice. \r\nFrom the beginning you will be treated as a member of staff, welcomed into your team and invited to attend staff meetings, development days, staff social activities and any relevant educational trips. \r\n\r\nYour placement schools will provide a mentor to guide you and work alongside you to identify needs and provide personalised support as you develop. You will gradually build up your contact time with students as you develop your confidence, teaching skills and time management. You will also shadow and support all-important pastoral work. \r\n\r\nOur mentors are outstanding teachers who are required to undertake a rigorous training programme to develop their coaching, effective classroom observation and feedback skills. They will work with you to develop rigour, professional knowledge, understanding and skills in order to deliver creative, purposeful and challenging teaching and learning. \r\n\r\nOn the course you will have full access to the university's facilities.  You will be assigned a university tutor who will support your development as a teacher through tutorials, visits to school and guidance with assignments. ","personalQualities":"We are looking for ambitious trainee teachers who are passionate and enthusiastic about their subject, with a real desire and ability to communicate this with young people of all abilities, needs and backgrounds at primary level. \r\n\r\nPrevious experience of working with, or observing, primary age children in school or other contexts is a considerable advantage. Part of the interview process will include reflection on this experience. \r\n\r\n","otherRequirements":"You will ideally have some experience of working with young people, perhaps through volunteer work, young clubs, sports teams or charities. \r\n\r\nWe strongly recommend that you gain some experience in a classroom prior to interview.\r\n\r\nAll places on the PGCE are subject to satisfactory health and criminal convictions assessments. Applicants will be required to complete an enhanced Criminal Records Bureau Disclosure and Barring Service (DBS) check.  We expect you to share our commitment to safeguarding and promoting the welfare of children, young people and vulnerable adults.","status":1,"createdAt":"2021-07-06T10:53:45.314Z","updatedAt":"2021-10-04T11:07:23.213Z","canSponsorStudentVisa":"yes","cycle":"2024"}
