{"id":"46a2ee93-a18f-4fc5-b03a-2de92d3dfe5a","name":"Primary","code":"W545","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"P","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"fd97fc18-88f2-4796-b147-d6a20f80e337","name":"Ilkley All Saints' Primary School (Main Site)","isPublished":"Y","status":"R","vacancies":"P"},{"id":"42ccfc6d-d7d1-4887-833a-82870cd5d81c","name":"Kettlewell Primary School","isPublished":"Y","status":"R","vacancies":"P"},{"id":"1cab0bc3-882b-49b3-889e-dcd5df090331","name":"Burnsall Primary School","isPublished":"Y","status":"R","vacancies":"P"},{"id":"b82ce096-50e5-45c3-8f94-517ec2fb125d","name":"Grassington Primary School","isPublished":"Y","status":"R","vacancies":"P"}],"trainingProvider":{"id":"cca26a08-0948-4523-ac77-893f7de1821e","code":"2DX","name":"Ilkley All Saints’ Teacher Training Partnership"},"accreditedBody":{"id":"79af57c6-053f-4e75-995a-2eae20fe2ed1","code":"2B2","name":"Yorkshire and Humber Teacher Training"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"TwoYears","feesUK":6935,"feeDetails":"The cost is £6935  per year.","aboutCourse":"THIS IS THE 3-7 PART-TIME COURSE:\r\n\r\nThis course is part-time over two years. It is a new course for 2021-22 as we have recognised the need for part-time teacher training in our area. We would be very keen to discuss with you how this programme might work in-line with your other commitments in order to make this part-time option a viable route into teaching. \r\n\r\nThe majority of our sessions will be face-to-face though the PGCE sessions will be delivered by the university via online platforms. This will allow you to have further flexibility with your learning and studying.\r\n\r\nWe provide unique teacher training opportunities in a supportive and forward-thinking environment. \r\n\r\nOur course is different in the sense that all the training sessions are delivered in schoo. All of our teaching sessions are delivered by school-based staff from our small and niche partnership.\r\n\r\nAs we are a small group of trainees, the programme becomes very personalised and bespoke as the year progresses. For example, we can alter and change our training sessions to meet your needs. \r\n\r\nTo date, 100% of our trainees have either been employed or entered into further education. \r\n\r\nThe teachers in our partnership are outstanding practitioners who share a desire to be at the forefront of curriculum innovation, making learning topical, purposeful and thought-provoking. \r\n\r\nWe look forward to working with you, offering high-quality training, mentoring and coaching that will develop you as a teacher. Ilkley All Saints’ Primary School is a National Support School which demonstrates our commitment to teacher development.","interviewProcess":"You will be invited to interview at All Saints' Primary School, Ilkley. At interview, you will be asked to deliver a 30 minute lesson to 10 children with  follow-up questions.","howSchoolPlacementsWork":"We offer two Teacher Training programmes; PGCE Primary (3-7) and PGCE Primary (5-11). Both courses provide you with supported, school-based experiences, split into three teaching placements. Your first placement will be in a host school, followed by a second and third placement which will be in a home school. These placements will give you the training experiences and access to specialist support that will develop your confidence for the start of your teaching career. \r\nYou will receive teaching from the university academic staff and training under the direction of the All Saints’ Primary School Teacher Training Partnership. Through our partnership, you will have access to specialist leaders who will contribute to your professional development. We have a range of professionals who can develop your skills and practice in specific areas, including: EYFS, Computing, SEND, Growth Mindsets and Assessment. In addition, you will supported by an experienced Lead Mentor and outstanding practitioners. \r\nFor more information about our Schools Direct Teacher Training Partnership please visit:\r\nallsaintsilkley.bradford.sch.uk/teacher-training\r\n","personalQualities":"•\tMeet the ‘national requirements\r\n(Degree, GCSEs, DBS check, health clearance)\r\n•\tHave a good subject knowledge at degree level\r\n•\tHave some subject curriculum knowledge\r\n•\tHave a good understanding of what teachers do\r\n•\tOften have some experience of working with children\r\n","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:51:07.593Z","updatedAt":"2021-08-25T22:01:28.992Z","canSponsorStudentVisa":"no","cycle":"2024"}
