{"id":"7a209169-0ffc-4a3c-96a9-6900eb7ad206","name":"Primary","code":"39ZW","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"TA","fundingType":"apprenticeship","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"trainingProvider":{"id":"cca26a08-0948-4523-ac77-893f7de1821e","code":"2DX","name":"Ilkley All Saints’ Teacher Training Partnership"},"accreditedBody":{"id":"e5b8e187-ccc1-4253-9dd0-376d6abf7e66","code":"2EY","name":"Exceed SCITT"},"english":"3","maths":"3","science":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":null,"aboutCourse":"THIS ROUTE INTO TEACHING IS DESIGNED FOR THOSE WHO ARE ALREADY WORKING IN A SCHOOL AS A HLTA OR TEACHING ASSISTANT AND WHOSE SCHOOL IS WILLING TO FUND YOUR TRAINING.\r\n\r\nPLEASE ONLY APPLY FOR THIS ROUTE IF YOU MEET THE ABOVE CRITERIA. \r\n\r\nThis is a new course that is currently in the process of being designed. \r\nThe majority of the training will take place in school or in schools in the local area. You will spend a minimum of 120 days in school with 20% off the job training. On this route into teaching, you will be a member of staff as it is considered a vocational route into the profession. \r\n\r\nPlease contact cwhitehead@allsaintsilkley.bradford.sch.uk for further information.\r\n","interviewProcess":"You will be invited into school to meet the lead mentor and asked to attend a formal interview.","howSchoolPlacementsWork":"Your first placement will be in a host school, followed by a second and third placement which will be in a home school. These placements will give you the training experiences and access to specialist support that will develop your confidence for the start of your teaching career. \r\n We have a range of professionals who can develop your skills and practice in specific areas, including: EYFS, Computing, SEND, Growth Mindsets and Assessment. In addition, you will supported by an experienced Lead Mentor and outstanding practitioners. \r\nFor more information about our Schools Direct Teacher Training Partnership please visit:\r\nallsaintsilkley.bradford.sch.uk/teacher-training\r\n","personalQualities":"","otherRequirements":"","status":2,"createdAt":"2021-07-06T10:51:07.396Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024"}
