{"id":"8e6fb3db-4d37-4555-990d-b4d1e22827b3","name":"Primary (3-11)","code":"HB23","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"other","programType":"HE","studyMode":"F","ageRange":"3_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"34f7f105-7d34-49c6-9997-edbe722eaf0d","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"6e7f844d-71e5-49be-a4d6-0211287d7480","code":"B35","name":"University College Birmingham"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"Acceptable are equivalency test in English, Mathematics and Science from www.equivalencytesting.com and https://astarequivalency.co.uk.","courseLength":"OneYear","feesUK":9250,"feeDetails":" - PGCE+ \r\n\r\nStudents who complete a UCB PGCE and wish to complete a further 60 credits to obtain a Postgraduate Diploma in Education and Learning can do so for a further payment cost of £600.\r\n\r\nAdditionally a £500 discount is applied if the PGCE fee is paid in full by 5 October.","financialSupport":"- The Kick Start Scheme\r\n\r\nFor new PGCE students starting in September, University College Birmingham will provide financial support in the form of the ‘The Kick-Start Scheme’. All students will receive £300, which can be used on a dedicated website to purchase course-related materials or on certain items within UCB. The great news is, these funds don't need to be paid back!","aboutCourse":"UCB Open Days: https://www.ucb.ac.uk/open-days/\r\n\r\nUCB Course Page: https://www.ucb.ac.uk/study/courses/postgraduate/pgce-primary-education-qts-qualified-teacher-status/\r\n\r\nTeaching is far more than a job.\r\n\r\nFor many, it’s a calling, a burning desire to make a difference. To inspire the next generation and arm children with the skills and knowledge they will need to lead well-informed lives and go onto have fulfilling careers themselves.\r\n\r\nOur PGCE Primary QTS course not only gives you the professional theory and knowledge you will need to teach and excel in a modern primary school setting, but also the invaluable, hands-on experience of working where it counts. The classroom.\r\n\r\nWhether your aspiration is to work in a mainstream school or one for children with special educational needs and disabilities (SEND), completion of this course will lead to Early Career Teacher (ECT) status upon completion of our PGCE, enabling you to start your journey in a profession which boasts a competitive salary, generous pension and financial support while training. \r\n\r\nThe course offers two pathways, which facilitate placements in different phases of the primary school. The 3-7 pathway will comprise two school placements in either nursery or reception, year 1 or year 2. The 5-11 pathway will comprise school placements in years 1-6, where students will work in years 1 and 2, 3 and 4 or 5 and 6.","interviewProcess":"For those making it through the initial online selection process, there will be a Mathematics and English assessment to provide UCB with your current level of attainment, we require applicants to achieve Level 1 in both areas of this assessment.\r\n\r\nThis will be followed by an online presentation and online individual interview, after which the evidence from the above selection procedures will be considered.\r\n\r\nFull details of these procedures will be sent to applicants who have progressed successfully to this stage.\r\n\r\nStudent feedback from Hannah Thompson PGCE Primary Education QTS (Qualified Teacher Status)\r\n\"My overall impression was so good from the moment I made the initial enquiry on the phone right through to my interview. Staff were extremely helpful and so accommodating. The course is very well organised and the range of placements are invaluable both for your CV and for developing your confidence\".","howSchoolPlacementsWork":"You will spend a minimum of 120 days within our partnership schools working alongside our trained professional mentors. They will work with you to build your confidence so that you can gradually take responsibility for teaching a whole class.\r\n\r\nWe will help you recognise your strengths and develop plans and targets to achieve the highest standard possible for the children you work with and help you to become a successful teacher.\r\n\r\nThis is a key element of the course and is superbly summed up by former student RusKhsar Ijaz who is now a Year 1 teacher. She explained: “The best part of the course was the school placements. These took place in a variety of different schools in different areas around the West Midlands.\r\n\r\nYou were also placed at different key stages and this really helps you to identify where you would like to specialise.”\r\n\r\nAnd another former UCB student Sofia Khan added: “The best part of the course was the quality of the placements which gave me invaluable experience, confidence and preparation for my current teaching role.”\r\n\r\nThe placements are taken in two blocks - eight weeks in the autumn term and 10 weeks in the summer term. There is also a SEND school placement for two weeks.","personalQualities":"\r\n","otherRequirements":"- DBS \r\n\r\nStudents must also complete a Disclosure and Barring Service check (DBS) before starting this course.\r\n\r\n- Work Experience\r\n\r\nWork Experience: You will also need to have experience of working with children through placements or voluntary or paid work in schools.\r\n","status":1,"createdAt":"2021-07-12T13:47:58.844Z","updatedAt":"2021-10-06T11:02:06.200Z","cycle":"2024","applicationsOpenDateOther":"2021-10-27T00:00:00.000Z","fundingType":"fee","canSponsorStudentVisa":"yes"}
