{"id":"549aec8b-e79f-4a3e-92ca-5072a1483c33","name":"Modern Languages (French and Spanish)","code":"M977","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"ce8523ef-9236-4cd9-b260-d826c7a521b3","code":"ML","name":"Modern Languages"},{"id":"e34fd2a3-a32e-44e9-aea1-666badf3ac03","code":"22","name":"Spanish"},{"id":"9727f674-61ba-4efa-b1f2-21ec7e354442","code":"15","name":"French"}],"locations":[{"id":"b9ec789c-8b10-4a25-88d4-6bc2353a607f","name":"Horizon Community College","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"4fa35b82-a5a8-4a90-8ff0-04b8195a3a45","code":"2C3","name":"Tykes TSA"},"accreditedBody":{"id":"19a3446e-382d-4c14-83bb-a76563cef3c1","code":"L24","name":"Leeds Trinity University"},"profPost":"PG","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"Degree subject should match or be closely related to Modern Languages (French and Spanish).","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"On successful completion of the course students are awarded QTS, PGCE, comprising 60 credits at Master Level 6. \r\n\r\nStudents are placed in two highly performing schools, mentored by good and outstanding teachers. \r\n\r\nThey will experience all aspects of school life which is invaluable when applying for future teaching positions. \r\n\r\nStudents will spend more than 120 days in schools on placement. \r\n\r\nWe arrange for students visit provision to increase their awareness of where children transition from and to (pre and post secondary), providing a holistic understanding of childrens progression. \r\n\r\nStudents will also have the opportunity to view best practice for SEN and EAL children. \r\n\r\nPlease note that during the Covid-19 pandemic we are conducting Selection Events remotely via Zoom.","interviewProcess":"We invite applicants who successfully meet the application criteria to attend a Selection Event at Horizon Community College.  \r\n\r\nThe event will be led by staff from our partnership schools along with a staff member from Tykes Teaching Alliance. The event will last approximately two to three hours and will include:\r\n\r\nA meet & greet – an introductory talk about the course and Tykes   Teaching School Alliance \r\nA learning walk – where you will be shown around school by a group of pupils\r\nAn individual interview\r\nA teaching task \r\n\r\nAt this stage we assess your;\r\n•         ability to communicate clearly, both orally and on paper\r\n•         knowledge of the area of education you are interested in\r\n•         interest in, and commitment to, a career in teaching\r\n•         ability to work effectively with children in an educational setting (for primary education courses you will need to bring the reference from the educational setting you attended)\r\n \r\n","howSchoolPlacementsWork":"The course begins with an induction at Horizon CC before commencing the first placement in an alternative school. After Christmas the remainder of the school year is spent at Horizon CC in their Modern Foreign Languages department.\r\n\r\nDedicated to providing all students with a broad and exciting language curriculum, the Modern Foreign Language Department at Horizon is committed to designing and delivering lessons covering a range of cultural topics and linguistic structures to the highest level. We believe in nurturing a love of both the language studied and the world that surrounds this, enabling our students to benefit from the transferable skills that language learning offers. Our team offers a unique opportunity for passionate aspiring teachers to develop their teaching craft through a breadth of experience and teaching styles. We provide excellent mentoring and CPD to our Early Career Teachers whilst offering opportunities for individuals to lead their own initiatives. So, if you have the same drive and enthusiasm as us, come and join this fantastic team.\r\n\r\n ","status":1,"createdAt":"2021-08-25T13:24:35.414Z","updatedAt":"2021-08-25T13:25:57.728Z","canSponsorStudentVisa":"yes","cycle":"2024"}
