{"id":"92ffbf5d-43c3-47e5-a892-0b90f6c0e43a","name":"Chemistry","code":"Y079","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"912d4fb4-761b-42e9-8dc6-e968b791ea4e","code":"F1","name":"Chemistry"}],"locations":[{"id":"b9ec789c-8b10-4a25-88d4-6bc2353a607f","name":"Horizon Community College","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"4fa35b82-a5a8-4a90-8ff0-04b8195a3a45","code":"2C3","name":"Tykes TSA"},"accreditedBody":{"id":"19a3446e-382d-4c14-83bb-a76563cef3c1","code":"L24","name":"Leeds Trinity University"},"profPost":"PG","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"Degree subject should match or be closely related to Chemistry.","acceptPendingGcse":"no","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"If you do not already have the appropriate GCSEs, or if you are unable to provide proof of your grades, we can accept GCSE equivalency tests taken with www.equivalencytesting.com, www.astarequivalency.co.uk or Birmingham City University (BCU) www.bcu.ac.uk. You only need to do the test if you are offered a place with us that you firmly accept. We can only accept tests from these providers and you will need to contact them directly for details on how to book and their costs.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"On successful completion of the course students are awarded QTS, PGCE, comprising 60 credits at Master Level 6. \r\n\r\nStudents are placed in two highly performing schools, mentored by good and outstanding teachers. \r\n\r\nThey will experience all aspects of school life which is invaluable when applying for future teaching positions. \r\n\r\nStudents will spend more than 120 days in schools on placement. \r\n\r\nWe arrange for students visit provision to increase their awareness of where children transition from and to (pre and post secondary), providing a holistic understanding of childrens progression. \r\n\r\nStudents will also have the opportunity to view best practice for SEN and EAL children. \r\n","interviewProcess":"We invite applicants who successfully meet the application criteria to attend a Selection Event at Horizon Community College.  \r\n\r\nThe event will be led by staff from our partnership schools along with a staff member from Tykes Teaching Alliance. The event will last approximately two to three hours and will include:\r\n\r\nA meet & greet – an introductory talk about the course and Tykes   Teaching School Alliance \r\nA learning walk – where you will be shown around school by a group of pupils\r\nAn individual interview\r\nA teaching task \r\n\r\nAt this stage we assess your;\r\n•         ability to communicate clearly, both orally and on paper\r\n•         knowledge of the area of education you are interested in\r\n•         interest in, and commitment to, a career in teaching\r\n•         ability to work effectively with children in an educational setting (for primary education courses you will need to bring the reference from the educational setting you attended)\r\n \r\nPlease note that during the Covid-19 pandemic we will be conducting Selection Events remotely via Zoom, \r\n","howSchoolPlacementsWork":"The course begins with an induction at Horizon CC before commencing the first placement in an alternative school. After Christmas the remainder of the school year is spent at Horizon CC in their Science department.\r\n\r\nLocated in a suite of state of the art, fully resourced labs, the Science Department at Horizon offers a fantastic environment in which to begin your teaching journey. In total we have 7 full Science labs, 6 STEM rooms and one electronics room – all of which are maintained and resourced by two experienced lab technicians. Our schemes of learning aim to equip students with the knowledge, skills and mindset that will enable them to succeed to potential in their Science GCSEs and prosper in post-16 opportunities beyond this. We provide many opportunities for students to visit places of significant scientific interest in both Britain and Europe, and our dedicated STEM lead is currently planning a trip to CERN in Geneva for some of our keenest scientists. The Department has a wealth of experience in developing early career teachers, so why not come and join this excellent team!\r\n ","status":1,"createdAt":"2021-08-25T13:37:41.821Z","updatedAt":"2021-08-25T13:38:36.817Z","canSponsorStudentVisa":"yes","cycle":"2024"}
