{"id":"a54c39aa-6962-4aca-8873-d3894317385a","name":"Geography","code":"R834","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3f47e67b-7fa5-4947-a5a0-74d528cd2a87","code":"F8","name":"Geography"}],"locations":[{"id":"b9ec789c-8b10-4a25-88d4-6bc2353a607f","name":"Horizon Community College","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"4fa35b82-a5a8-4a90-8ff0-04b8195a3a45","code":"2C3","name":"Tykes TSA"},"accreditedBody":{"id":"19a3446e-382d-4c14-83bb-a76563cef3c1","code":"L24","name":"Leeds Trinity University"},"profPost":"PG","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"Degree subject should match or be closely related to Geography.","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"If you do not already have the appropriate GCSEs, or if you are unable to provide proof of your grades, we can accept GCSE equivalency tests taken with www.equivalencytesting.com, www.astarequivalency.co.uk or Birmingham City University (BCU) www.bcu.ac.uk. You only need to do the test if you are offered a place with us that you firmly accept. We can only accept tests from these providers and you will need to contact them directly for details on how to book and their costs.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"On successful completion of the course students are awarded QTS, PGCE, comprising 60 credits at Master Level 6. \r\n\r\nStudents are placed in two highly performing schools, mentored by good and outstanding teachers. \r\n\r\nThey will experience all aspects of school life which is invaluable when applying for future teaching positions. \r\n\r\nStudents will spend more than 120 days in schools on placement. \r\n\r\nWe arrange for students visit provision to increase their awareness of where children transition from and to (pre and post secondary), providing a holistic understanding of childrens progression. \r\n\r\nStudents will also have the opportunity to view best practice for SEN and EAL children. \r\n","interviewProcess":"We invite applicants who successfully meet the application criteria to attend a Selection Event at Horizon Community College.  \r\n\r\nThe event will be led by staff from our partnership schools along with a staff member from Tykes Teaching Alliance. The event will last approximately two to three hours and will include:\r\n\r\nA meet & greet – an introductory talk about the course and Tykes   Teaching School Alliance \r\nA learning walk – where you will be shown around school by a group of pupils\r\nAn individual interview\r\nA teaching task \r\n\r\nAt this stage we assess your;\r\n•         ability to communicate clearly, both orally and on paper\r\n•         knowledge of the area of education you are interested in\r\n•         interest in, and commitment to, a career in teaching\r\n•         ability to work effectively with children in an educational setting (for primary education courses you will need to bring the reference from the educational setting you attended)\r\n \r\nPlease note that during the Covid-19 pandemic we are conducting Selection Events remotely via Zoom.","howSchoolPlacementsWork":"The course begins with an induction at Horizon CC before commencing the first placement in an alternative school. After Christmas the remainder of the school year is spent at Horizon CC in their Geography department.\r\n\r\nEnsuring students understand the world in which they live lies at the heart of the Geography Department at Horizon. The future of our planet has never been more at risk and so our aim is to equip students with geographical knowledge, whilst enabling them to understand the wider consequences of mankind’s actions on the planet and human environments. We also provide students with the opportunity to experience geography in action in the UK, further enhancing their skills and knowledge. We have an excellent track record of developing and supporting our trainees within the department so, if you have the enthusiasm to equip future geographers with the tools they need to shape the future of our planet, come and join our team!\r\n ","status":1,"createdAt":"2021-08-25T13:40:09.128Z","updatedAt":"2021-08-25T13:41:21.483Z","canSponsorStudentVisa":"yes","cycle":"2024"}
