{"id":"b76c9249-84a2-49be-95e6-56976f5af6a8","name":"Mathematics (11-16)","code":"AE33","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"72345aa7-096c-488f-8649-085b8178cadb","code":"G1","name":"Mathematics"}],"locations":[{"id":"b9ec789c-8b10-4a25-88d4-6bc2353a607f","name":"Horizon Community College","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"4fa35b82-a5a8-4a90-8ff0-04b8195a3a45","code":"2C3","name":"Tykes TSA"},"accreditedBody":{"id":"899178cc-20a7-4df5-951a-ee83c1b3d4d1","code":"S21","name":"Sheffield Hallam University"},"profPost":"PG","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"Degree subject should match or be closely related to Mathematics (11-16).","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"financialSupport":"You maybe eligible to claim the difference in cost from travelling to your placement school and travelling to Sheffield Hallam University. ","aboutCourse":"On successful completion of the course students are awarded QTS, PGCE, comprising 60 credits at Master Level 6. \r\n\r\nStudents are placed in two highly performing schools, mentored by good and outstanding teachers. \r\n\r\nThey will experience all aspects of school life which is invaluable when applying for future teaching positions. \r\n\r\nStudents will spend more than 120 days in schools on placement. \r\n\r\nWe arrange for students visit provision to increase their awareness of where children transition from and to (pre and post secondary), providing a holistic understanding of childrens progression. \r\n\r\nStudents will also have the opportunity to view best practice for SEN and EAL children. \r\n","interviewProcess":"We invite applicants who successfully meet the application criteria to attend a Selection Event at Horizon Community College.  \r\n\r\nThe event will be led by staff from our partnership schools along with a staff member from Tykes Teaching Alliance. The event will last approximately two to three hours and will include:\r\n\r\nA meet & greet – an introductory talk about the course and Tykes   Teaching School Alliance \r\nA learning walk – where you will be shown around school by a group of pupils\r\nAn individual interview\r\nA teaching task \r\n\r\nAt this stage we assess your;\r\n•         ability to communicate clearly, both orally and on paper\r\n•         knowledge of the area of education you are interested in\r\n•         interest in, and commitment to, a career in teaching\r\n•         ability to work effectively with children in an educational setting (for primary education courses you will need to bring the reference from the educational setting you attended)\r\n \r\nPlease note that during the Covid-19 pandemic we are conducting Selection Events remotely via Zoom.","howSchoolPlacementsWork":"Students will be spend the vast majority of their time at Horizon Community College. After February half term students will spend 4 weeks in an alternative placement school. \r\n\r\nThe Mathematics Department at Horizon is absolutely committed to our vision of teaching maths for understanding. Our commitment to ongoing professional development is evident in our research driven CPD offer. We also have a strong track record of developing our trainees, with high quality mentoring and a wealth of opportunities for further career development within the Department. We create high quality schemes of learning to support all staff, focussing on full curriculum coverage and, in partnership with our feeder primary schools, ensure a purposeful and challenging transition for students from KS2 to KS3. We also offer a rich variety of enrichment opportunities, such as Further Maths, UKMT and Pop maths, to help foster our students love of numbers. If you share a similar passion for the subject as we do, then please get in touch!\r\n\r\n ","personalQualities":"We are looking for people to change the lives of children in Barnsley. \r\n\r\nWe are keen to receive applicants from people with a genuine passion for improving the outcome of children and young people in our local area. ","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:48:13.630Z","updatedAt":"2021-07-09T13:24:09.257Z","canSponsorStudentVisa":"no","cycle":"2024"}
