{"id":"e1f7100b-863f-4791-a614-1b1a71f77508","name":"Primary with Physical Education","code":"AT39","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"5ae4c96e-1da2-4831-91a3-64439b606fed","code":"06","name":"Primary with physical education"}],"locations":[{"id":"24d557d5-0ca5-4bec-b999-5d171355b6ab","name":"Tykes TSA offices","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"4fa35b82-a5a8-4a90-8ff0-04b8195a3a45","code":"2C3","name":"Tykes TSA"},"accreditedBody":{"id":"899178cc-20a7-4df5-951a-ee83c1b3d4d1","code":"S21","name":"Sheffield Hallam University"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"financialSupport":"You maybe eligible to claim the difference in cost from travelling to your placement school and travelling to Sheffield Hallam University. ","aboutCourse":"This course prepares you for a career as a skilled primary teacher, specialising in physical education. As well as dedicated PE tuition, you gain an up-to-date knowledge of core Key Stage 1 and 2 subjects including English, science and mathematics.\r\n\r\nOn successful completion of the course students are awarded QTS, PGCE, comprising 60 credits at Master Level 6. \r\n\r\nStudents take part in a summer school PE and sport programme designed to develop specialist skills to lead physical education in a primary school setting.\r\n\r\nThe PE programme includes the opportunity to take part in a 5 day PE placement in Gran Canaria. This takes place the week following February half term and provides PE trainees with a taste of what it might be like working in an international school. Sheffield Hallam offers funding to support this experience (this funding is determined year on year). \r\n\r\nStudents are placed in two highly performing schools, mentored by good and outstanding teachers. \r\n\r\nThey will experience all aspects of school life which is invaluable when applying for future teaching positions. \r\n\r\nStudents will spend more than 120 days in schools on placement. \r\n\r\nWe arrange for students to visit EYFS provision to increase their awareness of where children transition into Key Stage 1 from, we will also arrange for students to visit a secondary school to increase their awareness of where children transition on to from Key Stage 2. \r\n\r\nStudents will also have the opportunity to view best practice for SEN and EAL children. \r\n","interviewProcess":"We invite applicants who successfully meet the application criteria to attend a Selection Event at one of our schools. \r\n\r\nThe event will be led by staff from our partnership schools along with a staff member from Tykes Teaching Alliance. The event will last approximately two to three hours and will include:\r\n\r\nA meet & greet – an introductory talk about the course and Tykes   Teaching School Alliance \r\nA learning walk – where you will be shown around school by a group of pupils\r\nAn individual interview\r\nA teaching task \r\n\r\nAt this stage we assess your;\r\n•         ability to communicate clearly, both orally and on paper\r\n•         knowledge of the area of education you are interested in\r\n•         interest in, and commitment to, a career in teaching\r\n•         ability to work effectively with children in an educational setting (for primary education courses you will need to bring the reference from the educational setting you attended)\r\n \r\nPlease note that during the Covid-19 pandemic we are conducting Selection Events remotely via Zoom.","howSchoolPlacementsWork":"Students will be placed in two primary schools within the Barnsley borough, schools placement schools will be selected based on the strength of their provision, with a particular focus on physical education. \r\n\r\nWherever possible will be place students in placement schools that are located conveniently for their needs, especially if the student has caring responsibilities. Students will not be expected to travel further than 25 miles from their home address to their placement school. \r\n\r\nStudents will be asked their preferred key stage (KS1 or KS2) and will spend the vast majority of the their placement within this key stage.\r\n\r\nStudents will spend from September to December in their alternative placement school before spending from January through to June in their preferred key stage. This 6 month block allows students to develop a sense of ownership of their class and develop relationships with children, parents and the staff team. ","personalQualities":"We are looking for people to change the lives of children in Barnsley. \r\n\r\nWe are keen to receive applicants from people with a genuine passion for improving the outcome of children and young people in our local area. \r\n\r\nIdeally applicants will be able to demonstrate some experience of coaching/training/teaching physical activity with children. ","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:48:13.757Z","updatedAt":"2021-07-09T13:34:17.456Z","canSponsorStudentVisa":"no","cycle":"2024"}
