{"id":"9961fdbe-4212-43b9-bbe1-833b8d0589b9","name":"Drama","code":"343D","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"69052223-ca45-4781-a8d3-cb92447a6d78","code":"13","name":"Drama"}],"locations":[{"id":"681046e9-3948-438b-b76a-e32796968371","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"5db371d5-ead6-4592-b4b0-a6546ada221e","code":"1FU","name":"St John Bosco"},"accreditedBody":{"id":"e328aab3-a535-4921-8ded-5e37133c76dd","code":"L46","name":"Liverpool Hope University"},"profPost":"BO","degreeGrade":"0","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"DRAMA 343D\r\n\r\nAcross our Partner schools and wider Alliance, we have real expertise in the Performing Arts. This is showcased though in-school events as well as collaborative productions where opportunities arise. \"Ten Piece\" was one such event for the BBC in 2016 which saw schools from across the city perform different interpretations for ten pieces of music through dance or drama.\r\n\r\nYou will be supported in your development by a subject mentor on each of your school placements, as well as being able to draw upon the expertise of tutors at Liverpool Hope University. \r\n\r\nPractical by nature, Drama relies upon performance and participation through the curriculum as well as extra -curricular activities. These form a large part of school life and are a real way to draw the community together.\r\n\r\nSchool placements will cover the 11-16 age range, along with a KS5 enhancement.\r\n\r\nEntry requirements\r\nEssential:\r\n\r\n* An undergraduate Honours Degree 2:1 or above, incorporating at least 50% Drama.\r\n\r\n* GCSE Grade C/4 or above in English and Mathematics. These can be pending but required before enrolment.\r\n\r\n* Offers will be subject to a successful interview, as well as a Health Check Statement and an Enhanced Disclosure from the Disclosure and Barring Service (formerly the Criminal Records Bureau CRB).\r\n\r\n* Mainstream secondary school experience is beneficial but not essential.\r\n","interviewProcess":"As part of the process, you will be required to:\r\n\r\n* Complete and submit a written task prior to interview\r\n* Plan, prepare and deliver a short input to a small group of students on a pre-given topic. This may be adapted in light of any COVID restrictions at the time of your interview whereupon you will be expected to either deliver or explain the lesson to the interview panel, outlining what you would expect pupils to achieve as a result of your input \r\n* Undertake a formal interview with a small panel\r\n* Complete a timed written task, usually reflecting upon your teaching input or creating a letter to parents on a given issue.\r\n\r\nInterviews are with a small panel comprising of the Director of Teacher Development Partnership, a subject teacher/Head of Department and a representative from Liverpool Hope University. In some instances, a colleague from one of our Partner schools will attend.\r\n","howSchoolPlacementsWork":"Trainees spend three to four days per week in their placement across the first two terms and are there full time in the final term. The rest of the week is comprised of: one day per week at Liverpool Hope University further developing subject knowledge and pedagogy. \r\n\r\nIn addition, there are 12 Masters days across the academic year which are also delivered at Liverpool Hope University. Initial Professional Development (School) sessions form part of the training delivered at St John Bosco. These sessions are delivered by our wide-ranging specialist practitioners who are experts in their field.\r\nAs part of the programme, trainees undertake a placement within our network of SEND schools as well as an enrichment week, experiencing other aspects of school life.","personalQualities":"What are we looking for in a candidate?\r\n\r\nWe are looking to recruit talented candidates who have the qualities and attributes suited to a career in teaching coupled with the drive and ambition to make it happen.\r\n\r\nThe sorts of personal qualities we are looking for are:\r\n\r\n* A friendly and approachable nature\r\n* Good interpersonal skills\r\n* Organisation and time management\r\n* Resilience \r\n* A passion for your subject\r\n* A positive outlook\r\n* A creative and innovative approach\r\n* The ability to reflect on and improve practice\r\n* Potential leadership capabilities\r\n","otherRequirements":"When attending interview, candidates will be required to bring photo ID along with GCSE certificates (English & Mathematics) and degree certificate if already received. Proof of name change is required if applicable (i.e. if you have married since receiving your certificates).\r\n\r\n If interviews have to be conducted virtually in response to COVID restrictions, the above will be required as scanned documents or photographs but the actual documents may be required by Liverpool Hope University in order that conditions can be fully met.\r\nA condition of any offer requires candidates to undertake a DBS check (formerly CRB) and an Overseas check.\r\n","status":1,"createdAt":"2021-07-06T10:46:39.980Z","updatedAt":"2021-09-28T13:21:01.027Z","canSponsorStudentVisa":"no","cycle":"2024"}
