{"id":"5727d188-eb5a-4d42-8b78-ae21378eca54","name":"Art and Design","code":"36VV","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"d461a678-3335-4ca2-9616-1dc479d31a49","code":"W1","name":"Art and design"}],"locations":[{"id":"caa5cabc-a4ab-467f-8e24-8b3516544224","name":"Chellaston Academy","isPublished":"Y","status":"S"}],"trainingProvider":{"id":"aa023df3-b71e-4249-b9c4-41fca8bd135e","code":"D39","name":"University of Derby"},"accreditedBody":{"id":"aa023df3-b71e-4249-b9c4-41fca8bd135e","code":"D39","name":"University of Derby"},"profPost":"PG","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"Degree subject should match or be closely related to Art and Design.","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Equivalency tests must be taken via Birmingham City University to be accepted.","courseLength":"OneYear","feesUK":9250,"feeDetails":"Studying for a postgraduate degree is a good investment in your future, but you need to carefully consider how you’re going to pay for your course and your living costs.\r\nMost students will be able to apply for loans and depending on where you live and your circumstances, bursaries and scholarships might also be available.\r\nOur postgraduate degrees are competitively priced and all the essential equipment and activities are included.\r\nThey vary slightly from course to course depending on what facilities and resources are required. For example, online courses tend to be slightly cheaper because they use fewer facilities.\r\nThe most up-to-date fees will be listed on the course page – search for your course on our website and look for the section on fees.\r\n","financialSupport":"To pay for your tuition fees and living costs, you may be able to take out a student loan. These loans don’t usually need to be paid back until you have graduated and are earning a good salary.\r\nSometimes, bursaries and scholarships are also available - it depends on your circumstances and which country you usually live in. These don’t need to be paid back.\r\nPlease visit our website for more information or call our helpline on 01332 592000. \r\n","aboutCourse":"You will spend most of your time in your main placement school, spending (on average) every other Wednesday in University. This will coincide with the days all other students following the University of Derby School Direct programme are in. This enables you to be part of a large group of beginning teachers, exploring the underpinning principles and philosophies of, and approaches to teaching. \r\nYou will have a mentor assigned by the school who will undertake regular training at the University.  Your mentor will be supported in school by a coordinator, usually a senior member of staff.  You will also be allocated a university link tutor who will work closely with you and your mentor and coordinator. From the beginning of the course, which starts at the end of August, you will be regarded as a member of staff but also as a beginning teacher. You will attend development days, consultation sessions and extra-curricular activities. \r\nIn the second term you will undertake a placement in a second school.  This is an opportunity to learn within a different context and share your experiences with other trainees.\r\nAssessment\r\nThe School Direct PGCE course is assessed at postgraduate certificate level.  It incorporates modules which may be counted towards the MA in Education. The assignments may be written pieces or presentations and may include collaborative work.\r\nFor the award of the PGCE and to achieve Teacher Standards, you must have reached the required standard in both the theoretical and practical elements of the course. In keeping with the nature of the course, which is vocational and postgraduate in approach, there are no written examinations.\r\nPractical Teaching is assessed by the university tutors, school based mentors and coordinators, and External Examiners.  Account is taken of your work over all school-based elements of the course and your own records of such work.","interviewProcess":"The School Coordinator at the lead School screens your application and decides whether to offer you an interview. If you are offered an interview this will be at the school you have applied for. If successful at this stage you will then be allocated a home school. This is not necessarily the lead school.\r\nWhen you attend a School Direct interview, there are likely to be other applicants being interviewed alongside you. You will not be in competition with the other applicants - in fact, we are keen to see that you can work collaboratively with others. The criteria we will use at interview to decide whether or not we offer you a place on the course are:\r\n•\tan awareness of current educational issues\r\n•\ta realistic and positive view of schools and schooling\r\n•\tan open and enquiring mind\r\n•\tclear reasons for wanting to teach\r\n•\tmotivation and commitment to teaching all pupils \r\n•\tmaturity and self confidence\r\n•\tan appropriate level of subject knowledge in your subject\r\nDuring the interview you will undertake the following tasks:\r\n•\ta short presentation to students on a subject topic (details will be sent to you before the interview)\r\n•\tcomplete a subject knowledge audit\r\n•\tcomplete a self-evaluation test\r\n•\tan individual interview","howSchoolPlacementsWork":"In our alliance there are 4 schools, 2 11-16 and 2 11-18 schools.\r\nFrom the beginning of the course, which starts at the end of August, you will be regarded as a member of staff but also as a beginning teacher. You will attend development days, consultation sessions and extra-curricular activities. \r\nIn the second term you will undertake a placement in a second school. An opportunity to learn within a different context and share your experiences with other trainees.  You will return to your ‘home’ school for the remained of the school academic year.\r\nThe practical experience is underpinned by theoretical approaches that are discussed and explored during University based sessions. There is a focus on both ‘Schools and Society’ and ‘Teaching and Learning’ and your assignments will ensure that these aspects are closely considered in relation to your teaching in school.","personalQualities":"All applicants are required on entry to the course to hold a UK degree or equivalent qualification. This must be in, or closely related to, your proposed teaching subject.\r\nAs a guideline we would expect to see that at least 50% of your first degree is directly relevant to the National Curriculum subject you intend to teach.\r\nIn additional to a degree you will need have passed GCSE English Language and mathematics at grade C (grade 4) or above, or equivalent.  \r\n","otherRequirements":"Trainees completing an Initial Teacher Training Programme must demonstrate the required competencies in the Fundamentals and English and Maths outlined by the Department for Education before Qualified Teacher Status is awarded. \r\nTo ensure trainees meet the required competencies you will be required to undertake and pass the University’s agreed assessment which will take place when you commence your course. Full details of the required competencies and assessment will be provided in due course.  \r\nYou will be subject to safeguarding checks which include an enhanced DBS check and required to meet the standards for 'Fitness to Teach'.","status":3,"createdAt":"2021-07-06T10:47:17.176Z","updatedAt":"2021-10-05T09:17:05.069Z","canSponsorStudentVisa":"yes","cycle":"2024"}
