{"id":"aeb925c9-62b6-4601-a2b9-417a8abf7488","name":"PGCE Post-14 (Education and Training)","code":"X34X","qualification":"pgce","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","subjectLevel":"further_education","isSend":"no","subjects":[{"id":"9de4b2d2-5739-4c34-92d2-9b4384760298","code":"41","name":"Further education"}],"locations":[{"id":"47c0bc6f-c595-4d9c-92e6-a64cb42e5425","name":"Derby Campus","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"aa023df3-b71e-4249-b9c4-41fca8bd135e","code":"D39","name":"University of Derby"},"profPost":"PF","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"In a subject that is applicable to the Further Education and Skills sector, such as psychology, law, media, sports and music technology","english":"9","maths":"9","science":"9","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"www.astarequivalency.co.uk\nFunctional Skills","courseLength":"OneYear","feesUK":9250,"feeDetails":"Our postgraduate degrees are competitively priced and all the essential equipment and activities are included.\r\n\r\nThey vary slightly from course to course depending on what facilities and resources are required. For example, online courses tend to be slightly cheaper because they use fewer facilities.\r\n\r\nThe most up-to-date fees will be listed on the course page – search for your course on our website and look for the section on fees.\r\n\r\nThe fees are slightly different depending on whether you normally live in the UK/EU or outside of the EU.","financialSupport":"To pay for your tuition fees and living costs, you may be able to take out a student loan. These loans don’t usually need to be paid back until you have graduated and are earning a good salary.\r\n\r\nSometimes, bursaries and scholarships are also available - it depends on your circumstances and which country you usually live in. These don’t need to be paid back.\r\n\r\nPlease visit our website for more information or call our helpline on 01332 592000. ","aboutCourse":"Prepare for a worthwhile career teaching and training in the Further Education and Skills sector. This postgraduate course paves the way for you to teach post-14 learners in settings ranging from colleges, academies and secondary schools to prisons and voluntary organisations.\r\n\r\nStudy on a course rated ‘outstanding' by Ofsted for its high standard of training and assessment. We are currently the only university to be awarded this rating under the new Ofsted regime as well as 95% overall satisfaction in the Postgraduate Taught Experience Survey 2019. \r\n\r\nSelect an optional specialist pathway where you can focus on a key subject area: choose from English, Maths, Engineering, Sport, or teaching learners with disabilities. ","interviewProcess":"Your interview experience is an exciting opportunity for you to demonstrate your passion for the course you are applying for.\r\n\r\nThe selection process will last approximately 3 hours and will include:\r\n\r\n- Identification and documentation check\r\n- A course presentation – see additional information: please read this prior to your interview\r\n- Individual presentation\r\n- An interview with one or more members of the teaching team\r\n","howSchoolPlacementsWork":"This is a highly practical hands-on course which gives you the chance to explore the full range of roles undertaken by qualified teaching staff in the Further Education and Skills sector.\r\n\r\nTeaching experience will be the cornerstone of your studies. Full-time students will study at our main campus, Kedleston Road, and spend two days a week on teaching placement, as well as undertaking a six-week block placement. We also provide extensive support throughout: you will be allocated a mentor from the University’s teaching team as well as a subject specific mentor to guide you on your placement. \r\n\r\nTo broaden your outlook, you are also expected to complete an alternative placement in a different educational setting, embedded into a specific week during the year. We will provide full information and advice on this at pre-induction.","personalQualities":"","otherRequirements":"A Disclosure and Barring Service (DBS) is required at the point of accepting a place at the University. \r\n\r\nIf you have lived outside of the UK in the past five years, you will need to provide a current Certificate of Good Conduct from the country you were resident in. ","status":1,"createdAt":"2021-07-06T10:51:17.257Z","updatedAt":"2021-09-06T09:16:11.158Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
