{"id":"ac6588c7-3112-4125-92ce-ae3dc24d3ae9","name":"Art and Design","code":"2R2S","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"d461a678-3335-4ca2-9616-1dc479d31a49","code":"W1","name":"Art and design"}],"locations":[{"id":"12f66734-c50a-4b40-8c66-52a2c9ad6d88","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"67acf977-b01b-4e10-9477-d8ed789caad6","code":"1MU","name":"The Beckfoot School Direct Partnership"},"accreditedBody":{"id":"154509e2-743e-4f0b-9d99-396393aa57ff","code":"L27","name":"Leeds Beckett University"},"profPost":"BO","degreeGrade":"1","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Equivalency Tests to be undertaken with Leeds Beckett University's specified provider. Costs to be met by applicant.","courseLength":"OneYear","feesUK":9250,"feeDetails":"The tuition fee for the year for students entering in 2019/20 is £9250. The amount you will pay may increase each year to take into account the effects of inflation.","aboutCourse":"This course is accredited by Leeds Beckett University.\r\nYour skills and knowledge will be nurtured in a supportive learning community with vast experience of training the next generation of teachers. Your network of support will include our research staff and course tutors, who will be on hand to sharpen your teaching expertise and knowledge of the subject, ensuring it is informed by the latest research and practices.\r\n\r\nWe will develop your communication skills so that you can confidently manage a large group of pupils. For example, you will understand the importance of varying your tone of voice during group activities, learn how to use equipment such as whistles appropriately and how to address and maintain the attention of your pupils when teaching Art & Design.\r\n\r\nWe will also give you the skills to confidently manage classes with wide differences in ability. You will be able to devise lessons that develop from personalised activities to games that involve and stimulate your entire class.\r\n\r\n\r\nYour training will also develop your understanding of how PE can be used to motivate and strengthen learning in your pupils beyond the physical benefits of sport.","interviewProcess":"","howSchoolPlacementsWork":"For the vast majority of your course, you will be based in your provider school or schools, learning on the job while being supported by experienced teachers and mentors. You will attend our Headingley Campus one day a week (usually a Friday) for key module seminars. \r\n\r\nYou will have 3 placements during the course.","personalQualities":"","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:51:13.454Z","updatedAt":"2021-09-01T14:17:00.620Z","canSponsorStudentVisa":"yes","cycle":"2024"}
