{"id":"da8f6b86-9311-4a84-90eb-78ce82f95466","name":"English","code":"2R2P","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3aed1aa8-ae46-4b68-92bb-a6cc20655c59","code":"Q3","name":"English"}],"locations":[{"id":"12f66734-c50a-4b40-8c66-52a2c9ad6d88","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"67acf977-b01b-4e10-9477-d8ed789caad6","code":"1MU","name":"The Beckfoot School Direct Partnership"},"accreditedBody":{"id":"19a3446e-382d-4c14-83bb-a76563cef3c1","code":"L24","name":"Leeds Trinity University"},"profPost":"PG","degreeGrade":"9","english":"1","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Equivalency Tests to be undertaken with Leeds Trinity University's specified provider. Costs to be met by applicant.","courseLength":"OneYear","feesUK":9250,"feeDetails":"The tuition fee for the year for students entering in 2019/20 is £9250. The amount you will pay may increase each year to take into account the effects of inflation.","aboutCourse":"Degree Requirements: a 2:2 or above is preferred, however we consider applicants with 3rd class degrees on a case by case basis.\r\n\r\nAge Range: 11-16 years\r\n\r\nHands on experience – From day one trainees are immersed in school life, gaining experience and reflecting on learning. Trainees work with outstanding colleagues in classrooms on placements in different schools, and they experience special school education at Hazelbeck.\r\nTrainees very quickly get to know and become part of our school and student communities; ensuring they feel comfortable and confident in this environment.\r\n\r\nStage one – Introduction to teaching \r\nIn your first five weeks you will spend 2 days per week at Leeds Trinity University, and 3 days per week in your placement school. You will take part in seminars and workshops that prepare you for your school-based training.\r\n\r\nSubject knowledge and applied pedagogy\r\nIn these sessions, our subject teacher experts will give you a good understanding of what it means to teach your subject. You’ll study the school curriculum, and understand how other expert teachers have taught it successfully. You’ll also learn how to plan sequences of learning that address your pupils’ needs so that you can develop your practice and have a positive impact on their learning.\r\n\r\nStage two – Developing your knowledge \r\nYour University-based training will comprise the same elements as stage one, but you’ll focus on building on the knowledge you’ve already developed to prepare for your next school-based training block. You’ll spend one week at university. Before your second placement, you’ll again spend time in a school for one week to observe and familiarise yourself with the routine and teaching practice.\r\n\r\nStage three \r\nHaving developed and applied your subject and curriculum knowledge, you’ll spend several days at university during your placement, consolidating your practice and completing activities that will prepare for your teaching career. We also run a one-week conference for all trainees.\r\nYou will be in the same school for Stage 2 & 3\r\n\r\nIf there is any impact on school placements as a result of Covid 19, we will inform you before the course starts\r\n","interviewProcess":"\tIf you are invited to interview you can expect a typical day to look like this…..\r\nSECONDARY:\r\no\tPhoto ID & document check\r\no\tIntro & School Direct Overview\r\no\tSubject based task (30 mins)\r\no\tTour of school with Student Ambassadors\r\no\tMeet current ITT Students\r\no\tLesson observation & Peer observation assessment with staff member for Senior Leadership Team\r\no\tFormal interview including 3 minute presentation at the start about a teaching & learning experience you think has worked well and why.\r\n","howSchoolPlacementsWork":"The Beckfoot School Direct Partnership is a collaboration between all schools in the Beckfoot Trust, including Hazelbeck, a forward-thinking secondary special school co-located with Beckfoot, and Immanuel College. All schools are located within a 20 minute drive of Beckfoot, making planning and experiencing placements easier. [View a map of our school locations] (http://www.beckfoottrust.org/wp-content/uploads/2018/09/Trust-Map-September-2018.pdf)\r\n\r\nYou will have 2 placements: October - December & January - June.","personalQualities":null,"otherRequirements":null,"status":1,"createdAt":"2021-07-12T13:48:44.168Z","updatedAt":"2021-09-16T12:27:09.722Z","canSponsorStudentVisa":"yes","cycle":"2024"}
