{"id":"37905970-e31c-4827-856e-fbc9b36c19ac","name":"Computing","code":"2HTM","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"e6be6a9c-8696-4b88-8fbd-1ba1bef1b6fc","code":"11","name":"Computing"}],"locations":[{"id":"d952e879-dd02-45ed-b443-3c3f344e8f1b","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"59eb7608-a81b-453a-9307-aca71323382b","code":"1OO","name":"St Thomas More Catholic School"},"accreditedBody":{"id":"917facc1-82bb-4a00-a765-a1522edcb916","code":"2BA","name":"Sacred Heart Newcastle SCITT"},"profPost":"PG","degreeGrade":"1","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Every aspect of the programme is aimed at developing you as a Professional. This course aims to develop your pedagogical skills and knowledge in all aspects of the relevant curriculum, ensuring you have the very best start on your journey to becoming an outstanding teacher. Your studies will consider all aspects of teaching including: educational theory, behaviour management, assessment, pedagogy, pastoral care and a host of other areas specific to your teaching phase and discipline.\r\nThe programme aims to develop your skills progressively over the year. The training starts with observations of expert teachers over the first half term, progressing to you taking greater and more responsibility for classes as your confidence develops. Over the three terms you will go from observing lessons, to leading your own classes, guided and supported at every stage as you develop your skills. By the summer term you will be delivering up to 80% of an NQT's timetable fully prepared for your first job!\r\nYou will have two contrasting school placements during your training year. Each trainee teacher will have their own experienced classroom practitioner within both schools, who will be assigned as their individual mentor. A Professional Tutor responsible for school based pedagogical training will be based in all partnership schools. Central training will take place at Sacred Heart and at Newcastle University both of which provide an extremely high standard of facilities, including resources and IT provision. Each trainee will also be assigned a centrally based SCITT Tutor who will visit them in their school setting on a half termly basis and assess their progress.\r\n\r\nComputers are omnipresent, and today most children learn how to interact with icons and apps before they learn how to read. However, using computers and understanding how they operate are two different things, which is why schools employ educators trained to teach computer science to their students.\r\n\r\nBy definition, computer science is a field that focuses on the understanding and design of computers, and computational processes. Within in schools we focus on developing computer scientists who can create algorithms, solve problems and write code as well developing ones that design and implementation hardware and software. ","howSchoolPlacementsWork":"You will spend the majority of your training year in one school placement. Here you will have the opportunity to establish yourself as part of the team within the department and the school, as well as building rapport with the students as you build up a teaching timetable. You will be supported in organising a short second school placement at another school, ensuring that the mentoring will be of equal quality. \r\nYou will begin by observing lessons, supporting the classroom teacher and you will slowly build up a teaching timetable, with free periods for reflective practise and feedback.\r\n","personalQualities":"Those wishing to training to teach computer science would ideally have experience/qualities in the following:\r\n\r\nWorking with a range of software programs, problem solving skills, creating algorithms using flowcharts, strong mathematical skills, the ability to write complex code using python and another text based language. Trainees would need to have an understand of the key principles of networking, network technology and the internet, alongside a keen interest in new and emerging technologies.","otherRequirements":"Pass the professional skills tests. \r\nWhilst we would not wish to be prescriptive in the amount of experience an applicant must have spent in schools before applying, no application will be accepted where no recent, relevant experience has been gained. As a guide, 10 school 'days' may be taken as sufficient.\r\n","status":1,"createdAt":"2021-07-06T10:56:14.859Z","updatedAt":"2021-09-30T14:40:44.258Z","canSponsorStudentVisa":"no","cycle":"2024"}
