{"id":"1d57ec98-45b2-4554-a67b-81809c4bc597","name":"Chemistry","code":"F2X1","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"912d4fb4-761b-42e9-8dc6-e968b791ea4e","code":"F1","name":"Chemistry"}],"locations":[{"id":"b9e40e08-f9cb-4193-a530-60eaad1041f4","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"b3681bbc-2e2a-49c3-aa4e-e453a8d0e4a5","code":"G70","name":"University of Greenwich"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"https://astarequivalency.co.uk/\nhttps://www.equivalencytesting.com/","courseLength":"OneYear","feesUK":9250,"feeDetails":"Disclosure Barring Service\r\n\r\nPlease note that it is not possible to pay for the DBS application fee from your student support and you should therefore make provision for this cost as part of your financial planning prior to the start of your programme.\r\n\r\n(https://getintoteaching.education.gov.uk/funding-and-salary/overview/postgraduate-loans) and further eligibility applies. Make sure you are aware of the level of support you are eligible for before you apply for teacher training.\r\n\r\nYou will be required to fill in an occupational health questionnaire.","financialSupport":"Bursaries and scholarships are available to trainees on a fee-based teacher training course in England that leads to the award of qualified teacher status. Availability is dependent on your highest relevant academic award and the subject in which you are training to teach. \r\n\r\nTo receive a bursery or scholarship, you must be entitled to support under the [Student Finance England](https://www.gov.uk/student-finance/who-qualifies) criteria. Residents of Wales, Scotland and Northern Ireland will need to be entitled for support as set out by your country's student finance body (Student Finance Wales, Student Awards Agency Scotland or Student Finance NI). Both elements will be assessed by your teacher training provider. \r\n\r\nIf you have a degree from outside the UK, you should refer to the [overseas degree equivalency table](https://www.gov.uk/government/publications/overseas-degree-equivalency-table-and-methodology) to see the bursary your degree may attract. You can also contact your training provider for clarification on your degree's equivalency and your eligibility for a bursary and student finance. \r\n\r\nFor more information, please visit our [Teacher Training Bursaries](https://www.gre.ac.uk/study/finance/teacher-training/bursary) page.\r\n","aboutCourse":"The challenge of being a chemistry teacher will have you finding creative and diverse ways to share your knowledge with young students. \r\n\r\nOur Postgraduate/Professional Graduate Certificate in Education (PGCE) is designed to prepare you to become a professional, competent and reflective secondary school teacher of science, with chemistry as a specialist subject. Your studies will focus on addressing the needs of pupils aged 11 to 16 and beyond. \r\n\r\nAs part of your PGCE, you will have the opportunity to gain 60 Master's level credits and gain Qualified Teacher Status (QTS).\r\n\r\nOur course has support from representatives at the Royal Society of Chemistry. They bring awareness to our student teachers of the vast amount of resources and help available in order to become a chemistry teacher. This includes free online continuing professional development (CPD) courses to support you in your career.\r\n\r\n98% of students indicated that the programme prepared them for teaching learners across a range of abilities and 98% of students indicated that the programme helped them secure employment.\r\n\r\nAs part of your PGCE, you will have the opportunity to gain 60 Masters-level credits and gain Qualified Teacher Status (QTS).\r\n","interviewProcess":"Candidates must:\r\n\r\n* Attend an interview\r\n* Demonstrate a level of competence in Maths and English\r\n*Demonstrate a competency in Chemistry\r\n\r\n","howSchoolPlacementsWork":"Our one-year course comprises two elements:\r\n\r\n*60 days of university-based teaching\r\n* 120 days of school-based experience\r\n\r\nYour practical teaching experience is gained in two main schools. Here you will be allocated subject-specialist mentors who will offer dedicated feedback and guidance. During both placements, you will have the opportunity to develop your science and chemistry teaching with the support of a specialist teacher.","personalQualities":"Candidates will be required to have a genuine passion for the subject in which you will teach. Candidates will need to be motivated to develop and learn throughout the programme. They will need to be proactive in their learning and engage with both university lectures and placements.","otherRequirements":"Candidates must undergo a Disclosure and Barring Service check and an occupational health screening.\r\n\r\nStudents are required to obtain an enhanced disclosure certificate through the Disclosure Barring Service (DBS) prior to the start of their programme. If satisfactory clearance is not received during your registration, you may encounter problems in receiving some elements of your student funding. \r\n\r\nStudents must also complete an Occupational Health Check. To avoid any delay, it is important that you respond to all emails and correspondence sent to you concerning the [DBS and Occupational Health processes](http://www2.gre.ac.uk/current-students/reg/dbs).\r\n","status":1,"createdAt":"2021-07-06T10:52:21.616Z","updatedAt":"2021-09-21T14:20:23.889Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
