{"id":"61bbe966-30fa-4c34-96f2-f2319fed1bba","name":"Further education","code":"J039","qualification":"pgce","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","subjectLevel":"further_education","isSend":"no","subjects":[{"id":"9de4b2d2-5739-4c34-92d2-9b4384760298","code":"41","name":"Further education"}],"locations":[{"id":"b9e40e08-f9cb-4193-a530-60eaad1041f4","name":"Main Site","isPublished":"Y","status":"S"}],"trainingProvider":{"id":"b3681bbc-2e2a-49c3-aa4e-e453a8d0e4a5","code":"G70","name":"University of Greenwich"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"no","additionalGcseEquivalencies":"https://astarequivalency.co.uk/\nhttps://www.equivalencytesting.com/","courseLength":"OneYear","feesUK":9250,"feeDetails":"Disclosure Barring Service\r\nPlease note that it is not possible to pay for the DBS application fee from your student support and you should therefore make provision for this cost as part of your financial planning prior to the start of your programme.\r\n","financialSupport":"You may also be eligible for a loan while you study – note that you’ll have to apply for undergraduate student finance. \r\nFind out about financial support if you’re from outside the UK. \r\nFinancial support from the training provider\r\nBursaries and scholarships are available to trainees on a fee-based teacher training course in England that leads to the award of qualified teacher status. Availability is dependent on your highest relevant academic award and the subject in which you are training to teach. \r\nTo receive a bursery or scholarship, you must be entitled to support under the Student Finance England criteria. Residents of Wales, Scotland and Northern Ireland will need to be entitled for support as set out by your country’s student finance body (Student Finance Wales, Student Awards Agency Scotland or Student Finance NI). Both elements will be assessed by your teacher training provider. \r\nIf you have a degree from outside the UK, you should refer to the overseas degree equivalency table to see the bursary your degree may attract. You can also contact your training provider for clarification on your degree’s equivalency and your eligibility for a bursary and student finance. \r\nFor more information, please visit our Teacher Training Bursaries page.\r\n\r\n\r\n\r\n\r\n\r\n","aboutCourse":"As a further education teacher, you will have a range of career opportunities and will open doors for a wide variety of students, helping them realise their ambitions. \r\nThe quality of teacher training in further education was rated as ‘Good’ in Ofsted’s report on our initial teacher provision in 2016. The report found that, “Mentors provide good support for trainees. They assess their skills well and challenge trainees to improve through good feedback following observations of teaching and in frequent meetings”.\r\nOur Professional Graduate Certificate in Education (ProfGCE) OR Post Graduate Certificate (PGCE) in the Further Education and Skills Sector will give you the skills to become a teacher in further education colleges. Here you will learn vital practice and classroom management. \r\nTraining with us will lead to the essential qualifications required to achieve your goals. Our PGCE focuses on career teaching in colleges, adult education centres, art colleges, healthcare, and community organisations. It also encompasses training for public services and a wide range of commercial and voluntary organisations. \r\nWe offer this qualification with a level 5 diploma in teaching these subjects as an endorsement for:\r\n•\tNumeracy\r\n•\tLiteracy\r\n•\tESOL\r\n•\tESOL and literacy\r\n","interviewProcess":"Candidates must:\r\n•\tAttend an interview\r\n•\tUndertake a literacy screening assessment\r\n","howSchoolPlacementsWork":"For the full-time mode, you will be placed in a college where you will participate in a range of professional activities. \r\nYou will be in University 2 days per week and on placement for 3 days per week.\r\nIn total, you will complete a minimum of 100 hours of teaching experience. \r\nDuring your placement, you will be supported and assessed by a mentor at the placement and a tutor at the university.\r\nMeanwhile, your studies at the university will focus on pedagogic skills and knowledge. Here you will explore the theory that underpins teaching and learning. Throughout your assignments, you will focus on your professional development through your teaching specialism. \r\nWe offer our full-time students placements in a number of subject areas. These include:\r\n•\tAnimal care/science\r\n•\tArt and design, and art (3D/2D)\r\n•\tBeauty\r\n•\tCatering\r\n•\tChildcare\r\n•\tConstruction\r\n•\tEnglish for speakers of other languages (ESOL)\r\n•\tHairdressing\r\n•\tHumanities\r\n•\tLeisure and tourism\r\n•\tLiteracy\r\n•\tNumeracy\r\n•\tPhotography\r\n•\tSports science\r\nPlease contact us for other subject areas that may not be listed.\r\n","personalQualities":"Candidates will be required to have a genuine passion for the subject in which you will teach. You will need to show an understanding of the variety of institutions and learners within the sector. Candidates will need to be motivated to develop and learn throughout the programme.","otherRequirements":"Candidates must undergo a Disclosure and Barring Service check and an occupational health screening.\r\nStudents are required to obtain an enhanced disclosure certificate through the Disclosure Barring Service (DBS) prior to the start of their programme. If satisfactory clearance is not received during your registration, you may encounter problems in receiving some elements of your student funding. \r\nStudents must also complete an Occupational Health Check. To avoid any delay, it is important that you respond to all emails and correspondence sent to you concerning the DBS and Occupational Health processes\r\n","status":3,"createdAt":"2021-07-06T10:52:21.709Z","updatedAt":"2021-09-21T13:45:10.297Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
