{"id":"72708954-28a3-4ced-bf24-0573503b9121","name":"Further Education and Skills Sector","code":"2MM3","qualification":"pgce","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","subjectLevel":"further_education","isSend":"no","subjects":[{"id":"9de4b2d2-5739-4c34-92d2-9b4384760298","code":"41","name":"Further education"}],"locations":[{"id":"b9e40e08-f9cb-4193-a530-60eaad1041f4","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"b3681bbc-2e2a-49c3-aa4e-e453a8d0e4a5","code":"G70","name":"University of Greenwich"},"profPost":"PG","degreeGrade":"0","additionalDegreeSubjectRequirements":"false","english":"9","maths":"9","science":"9","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"https://astarequivalency.co.uk/\nhttps://www.equivalencytesting.com/","courseLength":"OneYear","feesUK":9250,"feeDetails":"Disclosure Barring Service\r\n\r\nPlease note that it is not possible to pay for the DBS application fee from your student support and you should therefore make provision for this cost as part of your financial planning prior to the start of your programme.\r\n\r\n(https://getintoteaching.education.gov.uk/funding-and-salary/overview/postgraduate-loans) and further eligibility applies. Make sure you are aware of the level of support you are eligible for before you apply for teacher training.\r\n\r\nYou will also be required to complete an occupational health questionnaire .","financialSupport":"Bursaries and scholarships are available to trainees on a fee-based teacher training course in England that leads to the award of qualified teacher status. Availability is dependent on your highest relevant academic award and the subject in which you are training to teach. \r\n\r\nTo receive a bursery or scholarship, you must be entitled to support under the [Student Finance England](https://www.gov.uk/student-finance/who-qualifies) criteria. Residents of Wales, Scotland and Northern Ireland will need to be entitled for support as set out by your country's student finance body (Student Finance Wales, Student Awards Agency Scotland or Student Finance NI). Both elements will be assessed by your teacher training provider. \r\n\r\nIf you have a degree from outside the UK, you should refer to the [overseas degree equivalency table](https://www.gov.uk/government/publications/overseas-degree-equivalency-table-and-methodology) to see the bursary your degree may attract. You can also contact your training provider for clarification on your degree's equivalency and your eligibility for a bursary and student finance. \r\n\r\nFor more information, please visit our [Teacher Training Bursaries](https://www.gre.ac.uk/study/finance/teacher-training/bursary) page.","aboutCourse":"Our Professional Graduate Certificate in Education (PGCE) will give you the skills to become a teacher in Further Education colleges.\r\n\r\nThis ProfGCE focuses on teaching in a variety of further education settings, including colleges, adult education centres, and community organisations. You will develop your skills and knowledge of pedagogy and gain vital classroom management skills. Full-time students will have access to placement opportunities in various subject areas, including animal care, art and design, beauty, catering, childcare, leisure and tourism, humanities, photography and sport science.\r\n\r\nWe offer endorsements in the following subject areas, which is equivalent to a Level 5 diploma in the teaching of the subject area:\r\n\r\n* Numeracy\r\n\r\n* Literacy\r\n\r\n* ESOL (English for speakers of other languages)\r\n\r\n* ESOL and Literacy.\r\n\r\nYou will complete at least 100 hours of teaching experience (125 hours for ESOL and literacy). For distance learning, you must be in a teaching/training role, and all practice is carried out in your setting.\r\n\r\nWe also offer QTLS in partnership with the Society of Education and Training (SET), making us the first provider to offer this in London.\r\n\r\n* The full-time course is available in September. If you study by distance-learning, you can begin in September or January.\r\n\r\n* Ofsted rated the quality of teacher training as 'Good' in its report on our initial teacher education provision.\r\n\r\n* You can specialise in your chosen subject and gain over 100 hours of experience in a placement college.\r\n\r\n* 96% of our graduates gain employment within six months.\r\n\r\n* If you study full-time, you will be on placement three to four days a week.","interviewProcess":"Candidates must:\r\n\r\n* Attend a Selection day (https://www.gre.ac.uk/study/apply/interviews/fehhs/pgce-secondary\r\n\r\n* Complete diagnostic literacy task for all applicants\r\n\r\n* Complete specialist literacy and numeracy tests for literacy/ESOL and numeracy teaching specialisms.","howSchoolPlacementsWork":"For the full-time mode, you will be placed in a college where you will participate in a range of professional activities. \r\n\r\nIn Phase 1, you will be on placement three days a week to observe and undertake teaching in your subject area. For the remaining two days, you will be based at the university campus.\r\n\r\nIn Phase 2, you will attend your placement college for four days a week, and the university for the last day.\r\n\r\nIn total, you will complete a minimum of 100 hours of teaching experience. \r\n\r\nDuring your placement, you will be supported and assessed by a mentor at the placement and a tutor at the university.\r\n\r\nMeanwhile, your studies at the university will focus on pedagogic skills and knowledge. Here you will explore the theory that underpins teaching and learning. Throughout your assignments, you will focus on your professional development through your teaching specialism. \r\n\r\nWe offer our full-time students placements in a number of subject areas. These include:\r\n\r\n* Animal care/science\r\n* Art and design, and art (3D/2D)\r\n* Beauty\r\n* Catering\r\n* Childcare\r\n* Construction\r\n* English for speakers of other languages (ESOL)\r\n* Hairdressing\r\n* Humanities\r\n* Leisure and tourism\r\n* Literacy\r\n* Numeracy\r\n* Photography\r\n* Sports science\r\n\r\nPlease contact us for other subject areas that may not be listed.\r\n\r\n","personalQualities":"","otherRequirements":"Candidates must undergo a Disclosure and Barring Service check and an occupational health screening.\r\n\r\nStudents are required to obtain an enhanced disclosure certificate through the Disclosure Barring Service (DBS) prior to the start of their programme. If satisfactory clearance is not received during your registration, you may encounter problems in receiving some elements of your student funding. \r\n\r\nStudents must also complete an Occupational Health Check. To avoid any delay, it is important that you respond to all emails and correspondence sent to you concerning the [DBS and Occupational Health processes](http://www2.gre.ac.uk/current-students/reg/dbs).\r\n","status":1,"createdAt":"2021-07-06T10:52:21.520Z","updatedAt":"2021-09-24T12:40:07.652Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
