{"id":"7a3e7a42-aae5-4e7e-b2e4-8f84e33ce839","name":"Further Education and Skills Sector (Level 6)","code":"2MM4","qualification":"pgce","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","subjectLevel":"further_education","isSend":"no","subjects":[{"id":"9de4b2d2-5739-4c34-92d2-9b4384760298","code":"41","name":"Further education"}],"locations":[{"id":"b9e40e08-f9cb-4193-a530-60eaad1041f4","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"b3681bbc-2e2a-49c3-aa4e-e453a8d0e4a5","code":"G70","name":"University of Greenwich"},"profPost":"PF","degreeGrade":"1","english":"9","maths":"9","science":"9","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"(https://www.equivalencytesting.com/)\n(https://astarequivalency.co.uk/)","courseLength":"OneYear","feesUK":9250,"feeDetails":"Disclosure Barring Service\r\n\r\nPlease note that it is not possible to pay for the DBS application fee from your student support and you should therefore make provision for this cost as part of your financial planning prior to the start of your programme.\r\n\r\nThe information above is dependent on your status as a [home, EU/EEA or overseas student](https://getintoteaching.education.gov.uk/funding-and-salary/overview/postgraduate-loans) and further eligibility applies. Make sure you are aware of the level of support you are eligible for before you apply for teacher training.\r\n","financialSupport":"Bursaries and scholarships are available to trainees on a fee-based teacher training course in England that leads to the award of qualified teacher status. Availability is dependent on your highest relevant academic award and the subject in which you are training to teach. \r\n\r\nTo receive a bursery or scholarship, you must be entitled to support under the [Student Finance England](https://www.gov.uk/student-finance/who-qualifies) criteria. Residents of Wales, Scotland and Northern Ireland will need to be entitled for support as set out by your country's student finance body (Student Finance Wales, Student Awards Agency Scotland or Student Finance NI). Both elements will be assessed by your teacher training provider. \r\n\r\nIf you have a degree from outside the UK, you should refer to the [overseas degree equivalency table](https://www.gov.uk/government/publications/overseas-degree-equivalency-table-and-methodology) to see the bursary your degree may attract. You can also contact your training provider for clarification on your degree's equivalency and your eligibility for a bursary and student finance. \r\n\r\nFor more information, please visit our [Teacher Training Bursaries](https://www.gre.ac.uk/study/finance/teacher-training/bursary) page.\r\n","aboutCourse":"Our Postgraduate Certificate in Education (PGCE) will give you the skills to become a teacher in Further Education colleges.\r\n\r\nThis PGCE focuses on teaching in a variety of settings, including colleges, adult education centres, and community organisations. The course helps you build your knowledge of pedagogy and develop vital classroom management skills. Full-time students can access placements in various subject areas, including animal care, art and design, beauty and hairdressing, catering, childcare, construction, leisure and tourism, humanities, photography and sport science.\r\n\r\nWe offer endorsements in the following subject areas, which is equivalent to a Level 5 diploma in the teaching of the subject area:\r\n\r\n* Numeracy\r\n\r\n* Literacy\r\n\r\n* ESOL (English for speakers of other languages)\r\n\r\n* ESOL and Literacy.\r\n\r\nYou will complete at least 100 hours of teaching experience (125 hours for ESOL and literacy). For distance learning, you must be in a teaching/training role, and all practice is carried out in your setting.\r\n\r\nWe also offer QTLS in partnership with the Society of Education and Training (SET), making us the first provider to offer this in London.\r\n\r\n","interviewProcess":"Candidates must:\r\n\r\n* Attend a Selection day (https://www.gre.ac.uk/study/apply/interviews/fehhs/pgce-secondary)\r\n\r\n* Undertake a literacy screening assessment","howSchoolPlacementsWork":"As part of our core course, you will be based in a placement college where you will participate in a range of professional activities.\r\n\r\n80% of the programme is placement.\r\n","personalQualities":"","otherRequirements":"Candidates must undergo a Disclosure and Barring Service check and an occupational health screening.\r\n\r\nStudents are required to obtain an enhanced disclosure certificate through the Disclosure Barring Service (DBS) prior to the start of their programme. If satisfactory clearance is not received during your registration, you may encounter problems in receiving some elements of your student funding. \r\n\r\nStudents must also complete an Occupational Health Check. To avoid any delay, it is important that you respond to all emails and correspondence sent to you concerning the [DBS and Occupational Health processes](http://www2.gre.ac.uk/current-students/reg/dbs).\r\n","status":1,"createdAt":"2021-07-06T10:52:21.550Z","updatedAt":"2021-09-24T12:46:14.912Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
