{"id":"9268d4d3-2386-4c6a-ba58-0fd3fa43e5ac","name":"Primary","code":"X100","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"b9e40e08-f9cb-4193-a530-60eaad1041f4","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"b3681bbc-2e2a-49c3-aa4e-e453a8d0e4a5","code":"G70","name":"University of Greenwich"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"You required to pay an outside agency for this service. We accept Equivalency Testing for Career Development  (https://www.equivalencytesting.com/)\nand  A Star Equivalency testing\n(https://astarequivalency.co.uk/)","courseLength":"OneYear","feesUK":9250,"feeDetails":"Disclosure Barring Service\r\n\r\nPlease note that it is not possible to pay for the DBS application fee from your student support and you should therefore make provision for this cost as part of your financial planning prior to the start of your programme.\r\n\r\nThe information above is dependent on your status as a [home, EU/EEA or overseas student](https://getintoteaching.education.gov.uk/funding-and-salary/overview/postgraduate-loans) and further eligibility applies. Make sure you are aware of the level of support you are eligible for before you apply for teacher training.\r\n\r\nYou will also be required to get a doctors letter to support the occupational health process. This cost will be individual to each doctors surgery.","financialSupport":"\r\nTo receive a bursary or scholarship, you must be entitled to support under the [Student Finance England](https://www.gov.uk/student-finance/who-qualifies) criteria. Residents of Wales, Scotland and Northern Ireland will need to be entitled for support as set out by your country's student finance body (Student Finance Wales, Student Awards Agency Scotland or Student Finance NI). Both elements will be assessed by your teacher training provider. \r\n\r\nIf you have a degree from outside the UK, you should refer to the [overseas degree equivalency table](https://www.gov.uk/government/publications/overseas-degree-equivalency-table-and-methodology) to see the bursary your degree may attract. You can also contact your training provider for clarification on your degree's equivalency and your eligibility for a bursary and student finance. \r\n\r\nFor more information, please visit our [Teacher Training Bursaries](https://www.gre.ac.uk/study/finance/teacher-training/bursary) page.\r\n","aboutCourse":"Are you looking for a rewarding career where no two days are the same and you will help inspire some of the most crucial years of a child's development?\r\n\r\nRated 'Outstanding' in the quality of teacher training in Primary Education by Ofsted (Initial Teacher Education report 2016), \"headteachers unanimously agree that when newly qualified teachers from the University of Greenwich are employed, they 'hit the ground running'. They are very much the first choice for employers in the local and wider London region.\"\r\n\r\nOur PGCE in Primary Education (postgraduate and professional routes) will enable you to develop your knowledge, understanding and skills to teach in primary schools - particularly those in the urban inner-city. Here, you will engage in core practice and learn the professional values of teaching.\r\n\r\nYou will have the opportunity to train in two consecutive age ranges:\r\n\r\n* Foundation/Key Stage 1\r\n* Key Stage 1/Key Stage 2\r\n* Key Stage 2 (which encompasses both ages 7-9 and 9-11)\r\n\r\nIn addition to school-based training, studies also take place at the university's campus and cover all elements of the National Curriculum. \r\n\r\nOur workshops are interactive and encourage you to work collaboratively. These include practical tasks and exploring theoretical perspectives. Opportunities are also provided for you to take an enhancement in an area of personal interest or expertise, e.g. special educational needs.\r\n\r\nOur expert staff are active researchers as well as being trained primary teachers. During the programme, you will be allocated a personal tutor who will support your studies. Your tutor will be on hand to offer both personal career and academic guidance. Individual support and designated workshops are tailored to meet the needs of each of our individual students in order to ensure high quality outcomes. \r\n\r\n\r\n","interviewProcess":"Candidates must:\r\n\r\n* Have clear written and spoken English skills\r\n* Demonstrate a level of competence in Maths and English\r\n* Undergo a Disclosure and Barring Service check and an occupational health screening\r\n\r\n","howSchoolPlacementsWork":"One of the most enriching elements of our programme is our partnership with schools. You will spend a minimum of 24 weeks (120 days) in a primary school with extended experience in two schools.\r\n\r\nThis will be an integral part of your study and provides the context in which you can develop your professional skills, knowledge and understanding. \r\n\r\nThere will also be further opportunities to engage in school-based training in a range of specialist schools and educational contexts.","personalQualities":"We would like candidates to be motivated learners who communicate well with others. To be flexible and enjoy working with children. We want them to engage in their academic studies and research to underpin their development as a teacher.","otherRequirements":"Candidates must undergo a Disclosure and Barring Service check and an occupational health screening.\r\n\r\nStudents are required to obtain an enhanced disclosure certificate through the Disclosure Barring Service (DBS) prior to the start of their programme. If satisfactory clearance is not received during your registration, you may encounter problems in receiving some elements of your student funding. \r\n\r\nStudents must also complete an Occupational Health Check. To avoid any delay, it is important that you respond to all emails and correspondence sent to you concerning the [DBS and Occupational Health processes](http://www2.gre.ac.uk/current-students/reg/dbs).\r\n\r\n\r\n","status":1,"createdAt":"2021-07-06T10:52:21.767Z","updatedAt":"2021-09-16T12:18:41.029Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
