{"id":"9438dc6b-d4b9-4e71-b7f9-7ed7960ba4fd","name":"Mathematics","code":"G1X1","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"72345aa7-096c-488f-8649-085b8178cadb","code":"G1","name":"Mathematics"}],"locations":[{"id":"b9e40e08-f9cb-4193-a530-60eaad1041f4","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"b3681bbc-2e2a-49c3-aa4e-e453a8d0e4a5","code":"G70","name":"University of Greenwich"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"(https://astarequivalency.co.uk/)\n(https://www.equivalencytesting.com/)","courseLength":"OneYear","feesUK":9250,"feeDetails":"Disclosure Barring Service\r\n\r\nPlease note that it is not possible to pay for the DBS application fee from your student support and you should therefore make provision for this cost as part of your financial planning prior to the start of your programme.\r\n(https://getintoteaching.education.gov.uk/funding-and-salary/overview/postgraduate-loans) and further eligibility applies. Make sure you are aware of the level of support you are eligible for before you apply for teacher training.\r\n\r\nYou will be required to fill in an occupational health questionnaire.","financialSupport":"Bursaries and scholarships are available to trainees on a fee-based teacher training course in England that leads to the award of qualified teacher status. Availability is dependent on your highest relevant academic award and the subject in which you are training to teach. \r\n\r\nTo receive a bursery or scholarship, you must be entitled to support under the [Student Finance England](https://www.gov.uk/student-finance/who-qualifies) criteria. Residents of Wales, Scotland and Northern Ireland will need to be entitled for support as set out by your country's student finance body (Student Finance Wales, Student Awards Agency Scotland or Student Finance NI). Both elements will be assessed by your teacher training provider. \r\n\r\nIf you have a degree from outside the UK, you should refer to the [overseas degree equivalency table](https://www.gov.uk/government/publications/overseas-degree-equivalency-table-and-methodology) to see the bursary your degree may attract. You can also contact your training provider for clarification on your degree's equivalency and your eligibility for a bursary and student finance. \r\n\r\nFor more information, please visit our [Teacher Training Bursaries](https://www.gre.ac.uk/study/finance/teacher-training/bursary) page.\r\n","aboutCourse":"If you have an interest and strong background in maths, our teacher training course is for you. In addition to possessing sound mathematical skills, we are looking for applicants who have a genuine passion to communicate and break down this complex subject to young secondary school students. \r\n\r\nThe quality of teacher training in secondary education was rated as 'Good' in Ofsted's report for Initial Teacher Education 2016. The report identified that \"trainees demonstrate a good understanding of the requirements of the teachers' standards. Trainees and newly qualified teachers are reflective and self-motivated.\"\r\n\r\nOur course will prepare you to become a professional, creative, competent and reflective teacher. \r\n\r\nYou will have the opportunity to gain 60 Master's-level credits as part of our PGCE. In addition to university-based workshops, our course includes two school placements plus extensive support in the form of online materials. \r\n\r\nDuring your training, you will be investigating how to address common errors and misconceptions through pedagogy. All the while you will be improving your core subject knowledge of maths and how these skills relate to Maths Mastery.\r\n\r\nThere will be a continuous assessment of classroom skills and teaching effectiveness builds towards a professional development portfolio. There are also written and practical assignments with opportunities for Master's level credits in the postgraduate version.\r\n\r\nOur past trainees have also contributed to a national project run by the Personal Finance Education Group. This supports schools in the teaching and learning of financial mathematics.\r\n\r\nAdditionally, we give you the option of a blended Subject Knowledge Enhancement courses prior to starting your PGCE.\r\n","interviewProcess":"Candidates must:\r\n\r\n* Attend an interview\r\n* At the interview, you will also be required to sit and pass a 30-minute style Higher Tier GCSE Maths non-calculator paper at 70%+. To prepare for this practice, materials can be found at [www.corbettmaths.com](https://corbettmaths.com/), [www.mrbartonmaths.com](http://www.mrbartonmaths.com/index.html), AQA, Edexcel or OCR exam boards websites\r\n*Demonstrate a level of competence in Maths and English\r\n* Some applicants may need to work on the development of their subject knowledge. We offer a Subject Knowledge Enhancement course to develop your mathematics knowledge at higher GCSE and AS level.\r\n","howSchoolPlacementsWork":"Our one-year course comprises two elements:\r\n\r\n*60 days of university-based teaching\r\n* 120 days of school-based experience\r\n\r\nYour practical teaching experience is gained in two main schools. Here you will be allocated subject-specialist mentors who will offer dedicated feedback and guidance. During both placements, you will have the opportunity to develop your science and chemistry teaching with the support of a specialist teacher.\r\n","personalQualities":"Candidates will be required to have a genuine passion for the subject in which you will teach. Candidates will need to be motivated to develop and learn throughout the programme. They will need to be proactive in their learning and engage with both university lectures and placements.","otherRequirements":"Candidates must undergo a Disclosure and Barring Service check and an occupational health screening.\r\n\r\nStudents are required to obtain an enhanced disclosure certificate through the Disclosure Barring Service (DBS) prior to the start of their programme. If satisfactory clearance is not received during your registration, you may encounter problems in receiving some elements of your student funding. Students must also complete an Occupational Health Check. To avoid any delay, it is important that you respond to all emails and correspondence sent to you concerning the [DBS and Occupational Health processes](http://www2.gre.ac.uk/current-students/reg/dbs).\r\n\r\n","status":1,"createdAt":"2021-07-06T10:52:21.677Z","updatedAt":"2021-09-21T14:23:23.548Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
