{"id":"ca094d1a-24d0-4451-80bf-9ce6279a8f6e","name":"Biology","code":"CX11","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"322cfc19-d51d-45db-91e3-bd7b4738470f","code":"C1","name":"Biology"}],"locations":[{"id":"b9e40e08-f9cb-4193-a530-60eaad1041f4","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"b3681bbc-2e2a-49c3-aa4e-e453a8d0e4a5","code":"G70","name":"University of Greenwich"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"(https://www.equivalencytesting.com/)\n(https://astarequivalency.co.uk/)","courseLength":"OneYear","feesUK":9250,"feeDetails":"Disclosure Barring Service\r\n\r\nPlease note that it is not possible to pay for the DBS application fee from your student support and you should therefore make provision for this cost as part of your financial planning prior to the start of your programme.\r\n\r\nThe information above is dependent on your status as a [home, EU/EEA or overseas student](https://getintoteaching.education.gov.uk/funding-and-salary/overview/postgraduate-loans) and further eligibility applies. Make sure you are aware of the level of support you are eligible for before you apply for teacher training.\r\n\r\nYou will also be required to get a letter from you doctor for occupational health which will come with a cost dependant on your individual doctors surgery.","financialSupport":"Bursaries and scholarships are available to trainees on a fee-based teacher training course in England that leads to the award of qualified teacher status. Availability is dependent on your highest relevant academic award and the subject in which you are training to teach. \r\n\r\nTo receive a bursery or scholarship, you must be entitled to support under the [Student Finance England](https://www.gov.uk/student-finance/who-qualifies) criteria. Residents of Wales, Scotland and Northern Ireland will need to be entitled for support as set out by your country's student finance body (Student Finance Wales, Student Awards Agency Scotland or Student Finance NI). Both elements will be assessed by your teacher training provider. \r\n\r\nIf you have a degree from outside the UK, you should refer to the [overseas degree equivalency table](https://www.gov.uk/government/publications/overseas-degree-equivalency-table-and-methodology) to see the bursary your degree may attract. You can also contact your training provider for clarification on your degree's equivalency and your eligibility for a bursary and student finance. \r\n\r\nFor more information, please visit our [Teacher Training Bursaries](https://www.gre.ac.uk/study/finance/teacher-training/bursary) page.","aboutCourse":"As a biology teacher, you will enhance pupils' understanding of themselves and the world around them to succeed in a range of important careers.\r\n\r\nOur Postgraduate/Professional Graduate Certificate in Education (PGCE) is designed to prepare you in becoming a professional, competent and reflective secondary school teacher of science, with biology as a specialist subject. Your studies will focus on addressing the needs of pupils aged eleven to sixteen and beyond. \r\n\r\nThe quality of teacher training in secondary education was rated as 'Good' in the Ofsted report for Initial Teacher Education 2016. The report found that, \"Scientists appreciate the enhancement groups where they further build on their knowledge by sharing each other's expertise. As a consequence, the trainees' and newly qualified teachers' enthusiasm and confidence in the subjects they teach motivate and inspire pupils to learn and make progress.\"\r\n\r\n98% of students indicated that the programme prepared them for teaching learners across a range of abilities and 98% of students indicated that the programme helped them secure employment.\r\n\r\nAs part of your PGCE, you will have the opportunity to gain 60 Masters-level credits and gain Qualified Teacher Status (QTS).\r\n\r\nWe work in collaboration with professionals from specialist science organisations such as the Royal Society of Biology. Additionally, you will receive free resources and ideas on how to plan engaging lessons in plant biology from Science and Plants for Schools.","interviewProcess":"Candidates must:\r\n\r\n* Attend an interview\r\n* Demonstrate a level of competence in Maths and English\r\n Please see [www.education.gov.uk/get-into-teaching](https://getintoteaching.education.gov.uk/) for more information\r\n","howSchoolPlacementsWork":"Our one-year programme comprises of two elements: 60 days of university-based teaching and 120 days of school-based experience. Your practical teaching experience is gained in two main schools. Here you will be allocated subject-specialist mentors who will offer dedicated feedback and guidance. During both placements, you will have the opportunity to develop your science and biology teaching with the support of a specialist teacher.\r\n","personalQualities":"","otherRequirements":"Candidates must undergo a Disclosure and Barring Service check and an occupational health screening.\r\n\r\nStudents are required to obtain an enhanced disclosure certificate through the Disclosure Barring Service (DBS) prior to the start of their programme. If satisfactory clearance is not received during your registration, you may encounter problems in receiving some elements of your student funding. \r\n\r\nStudents must also complete an Occupational Health Check. To avoid any delay, it is important that you respond to all emails and correspondence sent to you concerning the [DBS and Occupational Health processes](http://www2.gre.ac.uk/current-students/reg/dbs).\r\n","status":1,"createdAt":"2021-07-06T10:52:21.581Z","updatedAt":"2021-09-14T13:51:14.970Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
