{"id":"1f719951-6123-463e-8613-108b24c5c7cd","name":"Primary","code":"35MP","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"acab60c4-e745-4f41-a809-bbf5c6a9e29e","name":"Castleford Academy","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"52bf746a-16d6-4399-8a80-b582e71de904","code":"2FW","name":"Five Towns ITT Partnership"},"accreditedBody":{"id":"154509e2-743e-4f0b-9d99-396393aa57ff","code":"L27","name":"Leeds Beckett University"},"profPost":"PG","degreeGrade":"1","english":"1","maths":"1","science":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"We work in partnership with Leeds Beckett University to ensure you have the correct balance of in-school experience and academic support required to achieve a PGCE and QTS. You will have lectures and seminars at the university looking at the National Curriculum and educational policy. Much of your learning will take place in school. You will have two placements in two contrasting schools across the alliance. Each placement will be in a different Key Stage. The course runs from September to June.","interviewProcess":"Your interview will take place at Castleford Academy or one of our partner schools. You will be invited to teach a small group of students using a text as stimulus, complete a series of brief literacy and numeracy tests and participate in a formal interview. The whole process will take approximately two hours. ","howSchoolPlacementsWork":"Trainees follow a primary course and working with the 5 - 11 age range. Trainees are placed in the schools which have capacity to offer an experienced mentor and a range of suitable classes across two key stages. We take note of candidates' transport needs and, where possible, seek to place them in schools which are conveniently located based upon their individual circumstances. All candidates will have two placement schools with a lead school which trainees return to in the summer term.","personalQualities":"We are looking for ambitious and committed individuals with a passion for their subject and a desire to share their enthusiasm and inspire young people. If you have these qualities coupled with a relentless focus on securing the best outcomes for young people, we would encourage you to apply to train with us. ","otherRequirements":"We usually require evidence of experience working with children  within the 5-11 age-range. Preferably this would be across KS1 and KS2 in a UK Primary School / setting and would equate to about 10 days in total. In addition, we value experience of working with children in contexts other than school and will take these into consideration.\r\n","status":1,"createdAt":"2021-07-06T10:51:11.280Z","updatedAt":"2021-09-27T15:04:48.286Z","canSponsorStudentVisa":"yes","cycle":"2024"}
