{"id":"558f1098-088c-4071-85df-9f11036fec59","name":"Physical Education","code":"35NM","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"74d64a54-5e34-4590-b6c7-528dd0cf26fe","code":"C6","name":"Physical education"}],"locations":[{"id":"acab60c4-e745-4f41-a809-bbf5c6a9e29e","name":"Castleford Academy","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"52bf746a-16d6-4399-8a80-b582e71de904","code":"2FW","name":"Five Towns ITT Partnership"},"accreditedBody":{"id":"154509e2-743e-4f0b-9d99-396393aa57ff","code":"L27","name":"Leeds Beckett University"},"profPost":"PG","degreeGrade":"1","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"We work in partnership with Leeds Beckett University to ensure you have the correct balance of in-school experience and academic support required to achieve a PGCE and QTS. Your subject knowledge content will be delivered through training in our partner schools. You will have two placements in two contrasting schools across the alliance. The course runs from September to June.","interviewProcess":"Your interview will take place at Castleford Academy or, in some instances, at one of our partner schools. You will be asked to plan a short teaching episode for a small group of Key Stage 3 students on a topic relating to your subject. You will also have formal interview which addresses wider educational issues. The whole process will take approximately two hours.","howSchoolPlacementsWork":"The majority of our secondary schools are  11 - 16 with some 11 - 18. We also have links to a local 6th form college and often arrange full or partial placements there. Trainees are placed in the schools which have capacity to offer an experienced mentor and a range of suitable classes across key stages. We take note of candidates' transport needs and, where possible, seek to place them in schools which are conveniently located based upon their individual circumstances. All trainees will have a minimum of two placement schools with a lead school which trainees return to in the summer term. We provide a Link Tutor as an additional  point of contact from the partnership. Your Link Tutor will visit you during each placement and assess your progress along with your mentor.","personalQualities":"We are looking for ambitious and committed individuals with a passion for their subject and a desire to share their enthusiasm and inspire young people. If you have these qualities coupled with a relentless focus on securing the best outcomes for young people, we would encourage you to apply to train with us. ","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:51:11.309Z","updatedAt":"2021-09-27T15:04:10.399Z","canSponsorStudentVisa":"yes","cycle":"2024"}
