{"id":"edd59f67-741e-43d9-8fda-2c36c9850705","name":"Modern Languages (French with Spanish)","code":"2WFX","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"ce8523ef-9236-4cd9-b260-d826c7a521b3","code":"ML","name":"Modern Languages"},{"id":"e34fd2a3-a32e-44e9-aea1-666badf3ac03","code":"22","name":"Spanish"},{"id":"9727f674-61ba-4efa-b1f2-21ec7e354442","code":"15","name":"French"}],"locations":[{"id":"a46cb275-6af4-4179-b951-64796d349bc9","name":"St Aidan's School Main Site","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"a782d090-8a18-4519-85a9-a8e6e8598ce5","code":"15X","name":"Yorkshire Schools Alliance"},"accreditedBody":{"id":"3117eaa6-b483-49de-92a2-ee4ead1b0903","code":"Y50","name":"The University of York"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Our partner Universities all work with us to offer GCSE equivalency tests in Maths and English to all appropriate candidates.","courseLength":"OneYear","feesUK":9250,"feesInternational":18700,"feeDetails":"Our School Direct courses are not salaried therefore you will have to pay tuition fees.  \r\n\r\nHowever, bursaries are available for trainees on eligible postgraduate courses in England who are on the non-salaried School Direct route. Bursary amounts will vary depending on teacher training subject and degree class or highest relevant academic qualification.\r\n\r\n[https://getintoteaching.education.gov.uk/funding-and-salary/overview]\r\n\r\nYou may also be eligible for a tuition fee loan to cover the cost of this tuition fee. \r\n","aboutCourse":"Our programmes last for one academic year (September – June), during which time you will undertake two high quality school placements. You will also enjoy a bespoke programme of training developed and delivered by our Alliance schools and university partners.\r\n\r\n[http://yorkshiresa.co.uk/itt/training-programme/]","interviewProcess":"Candidates for any route into teaching must now apply through UCAS directly to the Yorkshire Schools Alliance. \r\n\r\nSelection days take place at our Lead School St Aidan's in Harrogate.  We aim to make these days as friendly as possible as we like our candidates to feel at ease and able to enjoy the process. At the start of the day you will be given the opportunity for a tour around our lead school, St Aidan’s with trainees already on the course. The selection day also provides you with an opportunity to meet all key member’s of staff within the teaching school, including a subject specialist. It is important to meet as many people as possible when you go to interviews in order to help inform your decision if you receive offers.\r\n\r\nYou will be briefed on the overall structure and timetable of the course, the main content strands and assessment procedures. There will be an opportunity for you to ask questions. The selection process, which is expected to last approximately 3 hours. This includes:\r\n•A written subject knowledge task\r\n•An observation of you leading an activity with a group of 6 year 7 pupils\r\n•Formal interview which will be conducted by at least 2 members of our senior teaching staff.\r\n\r\n[http://yorkshiresa.co.uk/itt/application-process/]","howSchoolPlacementsWork":"You will do two placements throughout the training year, the timings of which may vary depending on the University you are working with.  \r\nOur Lead School, St Aidan’s Church of England High School is based in Harrogate, however, as we are in a partnership of 23 schools, depending on your subject choice you may be placed in other schools in the area as part of your course.\r\n\r\nIn all your placements you will be guided an mentored by an allocated member of the department, overseen by the ITT co-ordinator in that school.  All of our partner schools have vast experience in hosting trainees for placements.  \r\n\r\nWe have a variety of schools within our partnership, and we would always try to ensure that you experience a contrast in the two placement schools across the training year. ","personalQualities":"We are looking to recruit high calibre candidates with excellent personal qualities and the drive and motivation to succeed.\r\n\r\nYou must:\r\n•Have a positive outlook, a sense of responsibility and be adaptable\r\n• Demonstrate a passion for working with, and making a difference to, the lives and development of young people, not just a passion for their subject\r\n•Have good interpersonal skills\r\n•Be friendly and approachable\r\n•Be creative and imaginative\r\n•Have good organisational skills and excellent time management\r\n•Have powers of reflection and strive to improve their own practice with openness to new ideas.\r\n•Be aware of current educational issues\r\n","otherRequirements":"\r\nIt is desirable for candidates to demonstrate that they have  experience in a school environment and working with children.  However, this is not a prerequisite to applying for the course.  If we feel more experience is necessary we are likely to make this a condition of any offer we make.\r\nIn addition you should:\r\n\r\nIt is a condition of entry to the course that all candidates obtain an enhanced DBS check (plus overseas police checks fro any countries where 12 months or more have been spent in the last ten years)\r\n","status":1,"createdAt":"2021-07-06T10:49:12.078Z","updatedAt":"2021-09-08T14:24:02.343Z","canSponsorStudentVisa":"yes","cycle":"2024"}
