{"id":"1343fc75-ef8d-40ae-a9d9-3350e7967218","name":"Art and Design","code":"2HJ2","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"d461a678-3335-4ca2-9616-1dc479d31a49","code":"W1","name":"Art and design"}],"locations":[{"id":"fe4d3d17-e16a-461a-b287-47575c47b32c","name":"Lozells Junior & Infant School & Nursery","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"5bbb6845-8e36-4453-aa9a-a6dc751ca59c","code":"139","name":"The Lozells School Direct Programme"},"accreditedBody":{"id":"62d5803b-89ca-4e21-bb6f-5c74944c56ad","code":"B25","name":"Birmingham City University"},"profPost":"BO","degreeGrade":"1","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Yes, we ask candidates to carry out tests provided by our nationally-recognised partners to do the equivalency tests","courseLength":"OneYear","feesUK":9250,"aboutCourse":"This course will enable you to use your degree level skills in the teaching of art and design so that the young people you work with can explore, understand and challenge the visual culture that surrounds them.\r\nWe believe that art and design is a crucial element in the education of all pupils, and will work with you to enable you to become the inspirational secondary school teacher that today’s young people deserve.\r\nOur course provides you with the knowledge and understanding that will enable your current creative skills to grow into exciting and engaging teaching for the classroom. \r\nThe course is a practice-based programme that will fully support you into becoming a confident, dynamic and creative teacher committed to making art and design accessible for all.\r\nCentral to the curriculum is the study of art and design pedagogy and professional practice, which you will access through a synthesis of creative practical workshops, lectures, seminar groups and individual study.\r\nCurriculum workshops are a key element of your course. Dedicated, full-time art and design lecturers and teachers deliver these in our fully equipped specialist art and design studios. The workshops enable you to experience a range of practical work in key specialisms such as digital media, contemporary art including installation, drawing, printmaking, ceramics, mixed media, and craft media. We also work with the Education Curators in leading regional galleries that have included IKON Gallery, New Art Gallery Walsall, BMAG and Eastside Projects.\r\n","interviewProcess":"You will be required to attend one interview at Holte School. The interviewing panel will be made of the Lead School Direct Person at Holte School, The Head of Department and a representative from BCU. Interviews include:\r\n•\texploration of curriculum knowledge\r\n•\tdiscussions about relevant experiences\r\n•\ta presentation or small teaching exercise \r\n•\twritten task\r\nWe also look for: \r\n•\tgood communication skills\r\n•\tpotential / suitability to be a good teacher\r\n•\trobustness to cope with the demands of the course\r\n","howSchoolPlacementsWork":"You will spend two-thirds of your time – at least 120 days – working in the main school with another short placement (5 weeks) on a second placement gaining valuable real-life experience in schools. The 120 days will be split over a minimum of two placements in art and design departments. You will gain direct teaching experience and work with experienced practitioners in the classroom. School placements are predominantly in West Midlands secondary schools in one of our school alliance. You will be assigned a trained mentor and/or a tutor while on placement, who will support and guide your work, as well as provide training and feedback.","personalQualities":"Add anything relevant that relates back to your chosen course and shows how your skills will contribute towards your learning. What extra-curricular activities have you taken part in? What awards have you won? What employment or voluntary experience do you have that has helped you develop transferable skills?","otherRequirements":"Applicants must meet the Department for Education’s Initial Teacher Training criteria, which means being medically fit and successfully completing an enhanced disclosure via the Disclosure and Barring Service (DBS) and satisfying any other safeguarding checks required for this course.\r\nWhile not essential, you may wish to gain some school experience before attending interview.\r\n","status":1,"createdAt":"2021-07-06T10:52:42.459Z","updatedAt":"2021-07-06T14:17:22.505Z","canSponsorStudentVisa":"yes","cycle":"2024"}
