{"id":"1745027d-f47a-4870-9ea5-30da455576fa","name":"Primary","code":"Q731","qualification":"pgce_with_qts","startDate":"2023-05-31T23:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"P","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"3b43b8ac-bd5d-446a-945e-61dc0cf22ffb","name":"Lozells Junior & Infant & Nursery School","isPublished":"Y","status":"R","vacancies":"P"}],"trainingProvider":{"id":"5bbb6845-8e36-4453-aa9a-a6dc751ca59c","code":"139","name":"The Lozells School Direct Programme"},"accreditedBody":{"id":"62d5803b-89ca-4e21-bb6f-5c74944c56ad","code":"B25","name":"Birmingham City University"},"profPost":"PG","degreeGrade":"1","english":"1","maths":"3","science":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"Yes, we will ask candidates to carry out tests with our nationally recognised partners. This will be at a cost to the candidates.","courseLength":"TwoYears","feesUK":9250,"aboutCourse":"PGCE Primary and Early Years Education with QTS\r\nSchool Direct 2 Year Part-time Route\r\nThe PGCE Primary and Early Years Part Time route will be offered as Primary General and will run from September to July, across two years. Trainees will be supported in transition from undergraduate study and in time management strategies so that those who are in employment can manage work and study through an induction process and a carefully planned course with a range of developmental formative and summative assessments.  \r\n\r\nThe part time PGCE route will generally run on two days per week across two years. Teacher education days will be timetabled across the two years.   The days for these will vary for each year of the course to enable the part time trainees to access the module teaching sessions.  The foci for sessions in the first year are the core curriculum and professional studies.  In the second year, the foci will be the foundation curriculum, and, development and leadership of a particular subject area.   The core assignment will be in the first year of the course, and, the foundation and professional studies and leadership assignments will be in the second year of the course. \r\nThe school based training days tend to be on Thursday and Friday of each week but if required can be agreed flexibly between the lead school, the partner school and the trainee teacher.   The trainees will be expected to complete a block placement in each summer term which could be 3 or 4 weeks in length.  They will be expected to be on placement each day of the week during the block placement.  Lead schools will identify partners that would be able to meet the training needs of part time students.\r\n•\tCore  Module - English, Mathematics and Science and/or the prime and specific areas of learning from the Early Years Foundation Stage Curriculum  (20 credits)\r\n\r\n•\tProfessional Studies and Leadership Module – students will identify a specialist subject  (20 credits)\r\n\r\n•\tFoundation Module - all other National curriculum subjects and RE and/or the prime and specific areas of learning from the Early Years Foundation Stage Curriculum  (20 credits)\r\n\r\n•\tSchool Based Training  - school experience in two different schools and in different phases  (0 credit modules).  The first year will be in one school and the second year in a different school\r\n\r\n\r\n","interviewProcess":"","howSchoolPlacementsWork":"Lozells Primary school will be the main school with a view that another 5 week placement will be spent in a contrasting school","personalQualities":"","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:52:42.821Z","updatedAt":"2021-07-06T14:35:55.883Z","canSponsorStudentVisa":"yes","cycle":"2024"}
