{"id":"22874a9c-8b97-4624-8e2f-0a0eb829ad3a","name":"Mathematics","code":"2CL7","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"72345aa7-096c-488f-8649-085b8178cadb","code":"G1","name":"Mathematics"}],"locations":[{"id":"fe4d3d17-e16a-461a-b287-47575c47b32c","name":"Lozells Junior & Infant School & Nursery","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"5bbb6845-8e36-4453-aa9a-a6dc751ca59c","code":"139","name":"The Lozells School Direct Programme"},"accreditedBody":{"id":"62d5803b-89ca-4e21-bb6f-5c74944c56ad","code":"B25","name":"Birmingham City University"},"profPost":"BO","degreeGrade":"1","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Yes, we will ask candidates to carry out tests with our nationally recognised partners. This will be at a cost to the candidates.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Training to be a teacher of mathematics allows you to have a career which supports pupils to master skills that are vital to their success, not just during their education, but for life. If this is a subject you’re knowledgeable and passionate about, our Secondary Mathematics PGCE will allow you to become a highly skilled graduate teacher with an in-depth knowledge and understanding of teaching and learning, enabling you to demonstrate the highest levels of professional practice.\r\nYou will be trained to become a confident and reflective practitioner, and will be able to teach contemporary methods and practices. You’ll learn techniques to inspire students around maths, making it enjoyable and ensuring they’re equipped with skills they’ll need for the future.\r\nYou’ll teach across a range of ages and abilities on a daily basis so we’ll train you to be handle changing effortlessly between number patterns and sequences to calculus, depending on who you’re teaching.\r\nThis is an intensive and demanding course, which offers superb preparation for anyone who is committed to educating young people. Central to the curriculum is the study of education, pedagogy and professional practice from both generic and subject-specific perspectives, which is delivered using a combination of workshops, lectures, seminar groups and individual study.\r\n","interviewProcess":"You will be required to attend one interview at Holte School. The interviewing panel will be made of the Lead School Direct Person at Holte School, The Head of Department and a representative from BCU. Interviews include:\r\n•\texploration of curriculum knowledge\r\n•\tdiscussions about relevant experiences\r\n•\ta presentation or small teaching exercise \r\n•\twritten task\r\nWe also look for: \r\n•\tgood communication skills\r\n•\tpotential / suitability to be a good teacher\r\n•\trobustness to cope with the demands of the course\r\n","howSchoolPlacementsWork":"You will spend two-thirds of your time – at least 120 days – working in the main school with another short placement (5 weeks) on a second placement gaining valuable real-life experience in schools. The 120 days will be split over a minimum of two placements in art and design departments. You will gain direct teaching experience and work with experienced practitioners in the classroom. School placements are predominantly in West Midlands secondary schools in one of our school alliance. You will be assigned a trained mentor and/or a tutor while on placement, who will support and guide your work, as well as provide training and feedback.","personalQualities":"Add anything relevant that relates back to your chosen course and shows how your skills will contribute towards your learning. What extra-curricular activities have you taken part in? What awards have you won? What employment or voluntary experience do you have that has helped you develop transferable skills?","otherRequirements":"Applicants must meet the Department for Education’s Initial Teacher Training criteria, which means being medically fit, successfully completing an enhanced disclosure via the Disclosure and Barring Service (DBS) and satisfying any other safeguarding checks required by this course.\r\nWhile not essential, you may wish to gain some school experience before attending interview.\r\nIf you are a graduate and wish to train as a teacher but your degree did not provide enough subject specific content for you to gain automatic entry, you may be required to complete a Subject Knowledge Enhancement (SKE) course.\r\n","status":1,"createdAt":"2021-07-06T10:52:42.135Z","updatedAt":"2021-07-06T14:30:59.092Z","canSponsorStudentVisa":"yes","cycle":"2024"}
