{"id":"ab8c44f6-6a78-41b3-a46e-7555bfbf83a5","name":"Modern Languages","code":"2CZQ","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"ce8523ef-9236-4cd9-b260-d826c7a521b3","code":"ML","name":"Modern Languages"},{"id":"4608e5e3-2a1a-48a1-8236-56c7af5a139d","code":"24","name":"Modern languages (other)"}],"locations":[{"id":"fe4d3d17-e16a-461a-b287-47575c47b32c","name":"Lozells Junior & Infant School & Nursery","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"5bbb6845-8e36-4453-aa9a-a6dc751ca59c","code":"139","name":"The Lozells School Direct Programme"},"accreditedBody":{"id":"62d5803b-89ca-4e21-bb6f-5c74944c56ad","code":"B25","name":"Birmingham City University"},"profPost":"BO","degreeGrade":"1","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Yes, we will ask candidates to carry out tests with our nationally recognised partners. This will be at a cost to the candidates.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"This course will develop your skills so you can help pupils express themselves, to become critical thinkers and develop the vital skills they need to succeed, not just in Modern Foreign Languages (French or Spanish), but also in other areas of their education and beyond. Our aim is to ensure you are able to deliver the wide-ranging curriculum covered under MFL, \r\n\r\nYou’ll learn the teaching methods and strategies that will help your classes develop their reading, writing, speaking and listening skills so they become effective communicators.\r\n\r\nYou’ll explore, test and develop the links between MFL in education theory and its practice. University workshops and seminars facilitate a space for learners to conduct this, which is then supported by your school placements.\r\n\r\nThis relationship, between theory and practice, alongside a variety of contrasting school experiences, ensures that you are offered a well-rounded teacher education. We believe that we are training MFL teachers to work in any school setting. Your course will feature a range of modules and the opportunity to get plenty of hands-on practice in local schools with support from colleagues in the school partnership and experienced University tutors.\r\n","interviewProcess":"You will be required to attend one interview at Holte School. The interviewing panel will be made of the Lead School Direct Person at Holte School, The Head of Department and a representative from BCU. Interviews include:\r\n•\texploration of curriculum knowledge\r\n•\tdiscussions about relevant experiences\r\n•\ta presentation or small teaching exercise \r\n•\twritten task\r\nWe also look for: \r\n•\tgood communication skills\r\n•\tpotential / suitability to be a good teacher\r\n•\trobustness to cope with the demands of the course\r\n","howSchoolPlacementsWork":"You will spend two-thirds of your time – at least 120 days – working in the main school with another short placement (5 weeks) on a second placement gaining valuable real-life experience in schools. The 120 days will be split over a minimum of two placements in art and design departments. You will gain direct teaching experience and work with experienced practitioners in the classroom. School placements are predominantly in West Midlands secondary schools in one of our school alliance. You will be assigned a trained mentor and/or a tutor while on placement, who will support and guide your work, as well as provide training and feedback.","personalQualities":"Add anything relevant that relates back to your chosen course and shows how your skills will contribute towards your learning. What extra-curricular activities have you taken part in? What awards have you won? What employment or voluntary experience do you have that has helped you develop transferable skills?","otherRequirements":"Applicants must meet the Department for Education’s Initial Teacher Training criteria, which means being medically fit and successfully completing an enhanced disclosure via the Disclosure and Barring Service (DBS) and any other safeguarding checks required for this course.\r\nWhile not essential, you may wish to gain some school experience before attending interview.\r\nIf you are a graduate and wish to train as a teacher but your degree did not provide enough subject specific content for you to gain automatic entry, you may be required to complete a Subject Knowledge Enhancement (SKE) course.\r\n","status":1,"createdAt":"2021-07-06T10:52:42.286Z","updatedAt":"2021-07-06T14:31:41.999Z","canSponsorStudentVisa":"yes","cycle":"2024"}
