{"id":"b5c3245f-7066-4d97-b6db-ae10fe331e16","name":"Physical Education","code":"3FFX","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"74d64a54-5e34-4590-b6c7-528dd0cf26fe","code":"C6","name":"Physical education"}],"locations":[{"id":"fe4d3d17-e16a-461a-b287-47575c47b32c","name":"Lozells Junior & Infant School & Nursery","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"5bbb6845-8e36-4453-aa9a-a6dc751ca59c","code":"139","name":"The Lozells School Direct Programme"},"accreditedBody":{"id":"62d5803b-89ca-4e21-bb6f-5c74944c56ad","code":"B25","name":"Birmingham City University"},"profPost":"BO","degreeGrade":"1","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Yes, we will ask candidates to carry out tests with our nationally recognised partners. This will be at a cost to the candidates.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"If this is a subject you’re knowledgeable and passionate about, our Secondary Physical Education PGCE will allow you to become a highly skilled graduate teacher with an in-depth knowledge and understanding of teaching and learning, enabling you to demonstrate the highest levels of professional practice.\r\nYou will be trained to become a confident and reflective practitioner, and will be able to teach contemporary methods and practices. You’ll learn techniques to inspire students with Physical Education, making it enjoyable for all and ensuring they’re equipped with skills and understanding they’ll need for a positive approach to physical activity in the future.\r\nCentral to the curriculum is the study of PE pedagogy and professional practice, which you will access through a synthesis of practical workshops, lectures, seminar groups and individual study.\r\nCurriculum workshops are a key element of your course. Dedicated PE lecturers and teachers deliver these in our specialist education classrooms and lecture theatres. The workshops enable you to experience and develop your understanding of subject pedagogy through topics such as: Physical literacy, growth mindset through PE, dance in the curriculum, gymnastics, invasion games, net and wall games, target games and athletics, health and safety, as well as Key Stage 3 National Curriculum topics, GCSE and A Level PE topics.\r\n","interviewProcess":"You will be required to attend one interview at Holte School. The interviewing panel will be made of the Lead School Direct Person at Holte School, The Head of Department and a representative from BCU. Interviews include:\r\n•\texploration of curriculum knowledge\r\n•\tdiscussions about relevant experiences\r\n•\ta presentation or small teaching exercise \r\n•\twritten task\r\nWe also look for: \r\n•\tgood communication skills\r\n•\tpotential / suitability to be a good teacher\r\n•\trobustness to cope with the demands of the course\r\n","howSchoolPlacementsWork":"You will spend two-thirds of your time – at least 120 days – working in the main school with another short placement (5 weeks) on a second placement gaining valuable real-life experience in schools. The 120 days will be split over a minimum of two placements in art and design departments. You will gain direct teaching experience and work with experienced practitioners in the classroom. School placements are predominantly in West Midlands secondary schools in one of our school alliance. You will be assigned a trained mentor and/or a tutor while on placement, who will support and guide your work, as well as provide training and feedback.","personalQualities":"Add anything relevant that relates back to your chosen course and shows how your skills will contribute towards your learning. What extra-curricular activities have you taken part in? What awards have you won? What employment or voluntary experience do you have that has helped you develop transferable skills?","otherRequirements":"Applicants must meet the Department for Education’s Initial Teacher Training criteria, which means being medically fit, successfully completing an enhanced disclosure via the Disclosure and Barring Service (DBS) and satisfying all other safeguarding checks required for this course.\r\n\r\nWhile not essential, you may wish to gain some school experience before attending interview.\r\n","status":1,"createdAt":"2021-07-06T10:52:42.787Z","updatedAt":"2021-07-06T14:33:16.420Z","canSponsorStudentVisa":"yes","cycle":"2024"}
