{"id":"d24835bd-2e0a-4bdd-a0ae-966a602caa03","name":"Primary","code":"2ML2","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"fe4d3d17-e16a-461a-b287-47575c47b32c","name":"Lozells Junior & Infant School & Nursery","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"5bbb6845-8e36-4453-aa9a-a6dc751ca59c","code":"139","name":"The Lozells School Direct Programme"},"accreditedBody":{"id":"62d5803b-89ca-4e21-bb6f-5c74944c56ad","code":"B25","name":"Birmingham City University"},"profPost":"PG","degreeGrade":"1","english":"1","maths":"1","science":"9","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"Yes, we will ask candidates to carry out tests with our nationally recognised partners. This will be at a cost to the candidates.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"This course will give you the skills and understanding needed to successfully meet the needs of children in the classroom.\r\nThe setting of this course also provides you with the opportunities to understand the urban context and experience working with children from a wide range of social, economic and cultural backgrounds. While the PGCE is an academic qualification, the emphasis is very much on practical experience, with around two thirds of the course spent in school.\r\nYou’ll also learn by attending workshops and group discussions, but this course is practical and very hands-on in its approach.\r\n","interviewProcess":"You will be required to attend one interview. Interviews include:\r\n•\texploration of curriculum knowledge\r\n•\tdiscussions about relevant experiences\r\n•\ta presentation or small teaching exercise \r\n•\twritten task\r\n\r\nWe also look for: \r\n•\tgood communication skills\r\n•\tpotential / suitability to be a good teacher\r\n•\trobustness to cope with the demands of the course\r\n","howSchoolPlacementsWork":"You will spend two-thirds of your time – at least 120 days – working in schools on block placements gaining valuable real-life experience in schools. The 120 days will be split over a minimum of two placements in different schools. You will gain direct teaching experience and work with experienced practitioners in the classroom. School placements are predominantly in West Midlands primary schools. You will be assigned a trained mentor and/or a tutor while on placement, who will support and guide your work, as well as provide training and feedback.","personalQualities":"Add anything relevant that relates back to your chosen course and shows how your skills will contribute towards your learning. What extra-curricular activities have you taken part in? What awards have you won? What employment or voluntary experience do you have that has helped you develop transferable skills?","otherRequirements":"Applicants must meet the Department for Education’s Initial Teacher Training criteria, which means being medically fit, successfully completing an enhanced disclosure via the Disclosure and Barring Service (DBS) and satisfying any other safeguarding check required for your course.\r\nWhile not essential, you may wish to gain some school experience before attending interview.\r\n","status":1,"createdAt":"2021-07-06T10:52:42.540Z","updatedAt":"2021-07-06T14:35:08.098Z","canSponsorStudentVisa":"yes","cycle":"2024"}
