{"id":"66839ae5-c02e-4c1a-a92b-0aa7a482999e","name":"Modern Languages (German with French)","code":"RX21","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"ce8523ef-9236-4cd9-b260-d826c7a521b3","code":"ML","name":"Modern Languages"},{"id":"fbb00c08-2dbc-4f26-adb3-3b23afba18c1","code":"17","name":"German"},{"id":"9727f674-61ba-4efa-b1f2-21ec7e354442","code":"15","name":"French"}],"locations":[{"id":"b1e78309-45ff-4257-b300-c803621510d7","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"36425fae-da68-4e79-89de-8b41ea733c37","code":"K60","name":"King’s College London (University of London)"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":19800,"aboutCourse":"Located in the heart of London, PGCE courses at King’s are rated Outstanding by Ofsted with excellent tutors on hand to support you through your training. In the last research assessment exercise, the department was rated second in the UK (REF, 2014). \r\n\r\nYou will have the opportunity to work with experienced tutors who are actively engaged in research in their subject and in pedagogy more widely. \r\n\r\n74% graduates of 2021 who sought teaching posts were employed within 6 months of qualifying. \r\n\r\nIn our 2021 student survey, 96% of Modern Foreign Language trainees rated the quality of their training as excellent, very good or good.\r\n\r\nThis is a high-quality course that focuses on developing the subject knowledge that will enable all trainees to teach two Modern Foreign Languages with confidence in secondary schools and to contribute fully to the life of the school. The course is skills-based, research-focused and developmental, aimed at promoting teaching skills based on a soundly reasoned pedagogy that integrates formative assessment practices, class management issues, technology awareness and research findings. \r\n\r\nStudents sometimes work with native speaker linguists from the Strand campus to develop linguistic competence and pedagogical awareness in a unique programme. Hispanists, Germanists and those with main French work with each other, sometimes working in language specific groups. \r\n\r\nThere is a varied programme of tutor inputs, seminars, workshops and student presentations with considerable collaborative learning. Students are also required to undertake research and other independent learning tasks including data-collection from the classroom. \r\n\r\nWhere feasible we offer some trainees the unique opportunity to do a two-month placement in a partner school in another European country to enrich their linguistic and cultural competence of their second foreign language. \r\n\r\n\r\n","interviewProcess":"At interview, applicants will be asked to discuss their observations of time spent in a Secondary School MFL department (where this has taken place) as well as to share their vision of learning. \r\n\r\nApplicants will be asked to consider and then to present their ideas for teaching a grammatical structure or a lexical item selected previously prepared for the interview, in a micro-teaching format.\r\n\r\nOral and written competence will be tested. Applicants whose mother tongue is French, German, or Spanish will need to have an excellent command of spoken and written English. This will also be tested.\r\n\r\nIn your presentation that comprises a 5-minute teaching slot we will be looking for:\r\n\r\n - effective age-appropriate use of the target language:\t\r\n - ability to present concepts at a school level;\r\n - engagement with the audience;\r\n - use of simple culturally rich resources;\r\n - understanding of the subject you wish to teach;\r\n - an effective lesson shape for your 5-minute micro-teaching slot\r\n - confidence.\r\n\r\nIn your writing we will be looking for:\r\n\r\n - ability to express yourself clearly;\r\n - accurate grammar and spelling.\r\n","howSchoolPlacementsWork":"You will have two different school placements during the course. We work with a large number of schools around London and Greater London and we select school placements carefully, taking into account the teachers who act as mentors and the subjects they offer. \r\n\r\nWe try to ensure that all trainees have a reasonable journey to school and to ensure that you have a balanced teaching experience including the full secondary age (11-18) and ability range.","personalQualities":" - conceptual understanding of secondary school-based MFL teaching and learning\r\n - competence and certification in two foreign languages (French, German, Spanish), the main language at degree level and the second language to at least B2 level. Oral and written competence will be tested at interview. Applicants whose mother tongue is French, German, or Spanish will need to have an excellent command of spoken and written English (also tested).\r\n - ability to think and reason clearly\r\n - successful experience with children or clear potential for this \r\n - ability to interact with pupils and colleagues\r\n - strong motivation to teach\r\n\r\n","otherRequirements":"The Department for Education requires the Disclosure and Barring Service (formerly the Criminal Records Bureau) to vet the background of persons working in their schools. Candidates offered a place on a PGCE course will be asked to complete an enhanced check with the DBS to ensure they do not have a criminal background which might prevent them from working as a teacher. This must be completed before you register on the programme.\r\n\r\n","status":1,"createdAt":"2021-07-06T10:53:33.729Z","updatedAt":"2021-10-01T15:17:47.908Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
