{"id":"abe3a9ff-97c4-4b52-b01a-d6b175a50aff","name":"English","code":"Q3X1","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3aed1aa8-ae46-4b68-92bb-a6cc20655c59","code":"Q3","name":"English"}],"locations":[{"id":"b1e78309-45ff-4257-b300-c803621510d7","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"36425fae-da68-4e79-89de-8b41ea733c37","code":"K60","name":"King’s College London (University of London)"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":19800,"aboutCourse":"Located in the heart of London, PGCE courses at King’s are rated Outstanding by Ofsted with excellent tutors on hand to support you through your training. In the last research assessment exercise, the department was rated second in the UK (REF, 2014). You will have the opportunity to work with experienced tutors who are actively engaged in research in their subject and in pedagogy more widely. \r\n\r\n74% graduates of 2021 who sought teaching posts were employed within 6 months of qualifying. \r\n\r\nIn our 2021 student survey, 96% of English trainees rated the quality of their training as excellent or very good.\r\n\r\nWe adopt a variety of teaching and learning strategies during the year. Our aim is to use the sessions not only to give practical and theoretical ideas on the teaching of English but to model ways in which you might teach English in the classroom.\r\n\r\nSessions include:\r\nopportunities to discuss and debate in small groups\r\ninteractive whole class teaching\r\ntrialing materials for use in schools\r\nusing drama, media and technology resources.\r\nlectures\r\nopportunities for students to develop their presentation skills.\r\n\r\nWe also make full use of the university's unique location on the river Thames by providing opportunities throughout the year to visit places like the Globe, Tate Modern and the Poetry Library.\r\n","interviewProcess":"The King's interview process includes a group discussion, a written task and an individual interview. \r\n\r\nIn your writing we will be looking for:\r\n-ability to express yourself clearly;\r\n-accurate grammar and spelling.\r\n","howSchoolPlacementsWork":"You will have two different school placements during the course. We work with a large number of schools around London and Greater London and we select school placements carefully, taking into account the teachers who act as mentors and the subjects they offer. \r\n\r\nWe try to ensure that all trainees have a reasonable journey to school and to ensure that you have a balanced teaching experience including the full secondary age (11-18) and ability range.\r\n","personalQualities":"Personal qualities we look for include:\r\n\r\n-Ability to engage interest and communicate your own enthusiasm for mathematics\r\n-Commitment to working with young people\r\n-Ability to explain ideas clearly and to think on your feet\r\n-Evidence of good interpersonal skills\r\n-Awareness of current educational issues\r\n\r\n","otherRequirements":"The Department for Education requires the Disclosure and Barring Service (formerly the Criminal Records Bureau) to vet the background of persons working in their schools. Candidates offered a place on a PGCE course will be asked to complete an enhanced check with the DBS to ensure they do not have a criminal background which might prevent them from working as a teacher. This must be completed before you register on the programme.\r\n\r\n","status":1,"createdAt":"2021-07-06T10:53:33.579Z","updatedAt":"2021-10-01T15:15:02.176Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
