{"id":"b43089fa-e0b8-4e64-97e9-d07460537a61","name":"Religious Education","code":"V6X1","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"724b5d16-28dd-4431-bc17-ea4be4daedc4","code":"V6","name":"Religious education"}],"locations":[{"id":"b1e78309-45ff-4257-b300-c803621510d7","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"36425fae-da68-4e79-89de-8b41ea733c37","code":"K60","name":"King’s College London (University of London)"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":19800,"aboutCourse":"Located in the heart of London, PGCE courses at King’s are rated Outstanding by Ofsted with excellent tutors on hand to support you through your training. In the last research assessment exercise, the department was rated second in the UK (REF, 2014). You will have the opportunity to work with experienced tutors who are actively engaged in research in their subject and in pedagogy more widely. \r\n\r\n74% graduates of 2021 who sought teaching posts were employed within 6 months of qualifying. \r\n\r\nIn our 2021 student survey, 92% of RE trainees rated the quality of their training as excellent or very good.\r\n\r\n\r\nThe PGCE RE course offers opportunities to investigate the different religious and non-religious worldviews that are taught in schools, but we still assume that you will come onto the course with significant subject knowledge. This is why we require degree level evidence of such knowledge.\r\n\r\nThe course is designed to train you to become a skilful and reflective classroom practitioner. To this end we focus equipping you to meet the professional standards required to attain Qualified Teacher Status and these provide the framework for the course. There are two strands to our course: one focuses on RE subject-specific work, the other encompasses an exploration of generic issues related to professional practice and educational policy.\r\n\r\nThe RE strand is met through subject-specific sessions, in which we explore, debate, and clarify the aims in religious education. We focus on how to translate these aims into effective classroom practice, exploring practically how to devise lesson plans, how to choose or create engaging and appropriate resources, and how to ensure that our planning is shaped by an accurate and responsive understanding of the nature and needs of our pupils. In this way we seek to enable our pupils to become religiously literate.\r\n\r\nThe other strand is met through our 'Policy and Professional Practice' programme, through which we explore and debate the aims, purposes and provision of education in the UK today. This programme is formed of a weekly lecture, followed by seminars in cross-curricular groups, in which you are encouraged to discuss and reflect upon these issues, in light of insights gained from your school placements.\r\n","interviewProcess":"The selection process normally involves an interview, a short presentation by the candidate, a discussion and a short piece of writing.\r\n\r\nWe select our trainees when we have evidence of the following qualities:\r\n\t\r\n - a conceptual understanding of the content of religious education or philosophical thinking\r\n - an ability to think and reason clearly\r\n - an ability to interact effectively with pupils\r\n - an ability to interact with colleagues\r\n - an ability to present ideas clearly and at an appropriate level\r\n - an ability to recognise own shortcomings\r\n - a strong desire to continue to learn\r\n - flexibility of mind and the potential necessary to improve\r\n - successful experience with children or clear potential for this\r\n - clarity and accuracy of written and spoken English\r\n - a successful study record\r\n - perseverance and stamina\r\n - a passion for Religious Education\r\n","howSchoolPlacementsWork":"You will have two different school placements during the course. We work with a large number of schools around London and Greater London and we select school placements carefully, taking into account the teachers who act as mentors and the subjects they offer. \r\n\r\nWe try to ensure that all trainees have a reasonable journey to school and to ensure that you have a balanced teaching experience including the full secondary age (11-18) and ability range.","personalQualities":" - an ability to think and reason clearly\r\n - an ability to interact effectively with pupils\r\n - an ability to interact with colleagues\r\n - an ability to present ideas clearly and at an appropriate level\r\n - an ability to recognise own shortcomings\r\n - a strong desire to continue to learn\r\n - flexibility of mind and the potential necessary to improve\r\n - successful experience with children or clear potential for this\r\n - clarity and accuracy of written and spoken English\r\n - evidence of conceptual understanding\r\n - a successful study record\r\n - perseverance and stamina\r\n - a passion for Religious Education\r\n","otherRequirements":"The Department for Education requires the Disclosure and Barring Service (formerly the Criminal Records Bureau) to vet the background of persons working in their schools. Candidates offered a place on a PGCE course will be asked to complete an enhanced check with the DBS to ensure they do not have a criminal background which might prevent them from working as a teacher. This must be completed before you register on the programme.\r\n","status":1,"createdAt":"2021-07-06T10:53:33.873Z","updatedAt":"2021-10-01T15:19:53.625Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
