{"id":"022f669b-2b61-4365-9ff2-b031e0b263be","name":"Music","code":"W3X1","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"24311bef-8673-41fb-933c-53f887fb6976","code":"W3","name":"Music"}],"locations":[{"id":"f024c53d-e458-4ca3-b3e6-33f5793aa8ac","name":"Institute of Education, University of Reading","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"6439adcc-af64-4d3d-a1da-de045755db06","code":"R12","name":"The University of Reading"},"profPost":"PG","degreeGrade":"0","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"You are normally required to have at least a 2:1 honours degree (or equivalent from a university outside the UK) in a subject that is related to the subject you intend to teach.","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We accept English and Mathematics equivalency tests offered by the University of Reading.  Details will be sent with the offer email.\n\nWe will also accept tests offered by astarequivalency.co.uk, mathsmadeeasy.co.uk or equivalencytesting.com.  \n\nPlease email the university first to check acceptability if you are considering taking a test with another provider.","courseLength":"OneYear","feesUK":9250,"feesInternational":17100,"feeDetails":"On 23 June 2020 the UK government announced that, following the end of the transition period, EU students (with the exception of the Republic of Ireland) commencing a new programme of study will pay fees at the International rate with effect from the 2021/22 academic year.\r\n\r\nStudents starting a course in 2022 may still be entitled to pay fees at the UK student rate if they have settled or pre-settled status under the EU Settlement Scheme.","financialSupport":"Students who have previously graduated from an undergraduate course at the University of Reading will be eligible for an alumni discount amounting to £1500.\r\n\r\nThis discount will also be available to Reading alumnus undertaking a non-salaried School Direct with PGCE course with one of our school partners.","aboutCourse":"This Post Graduate Certificate in Education (PGCE) Secondary Music leads to the award of Qualified Teacher Status (QTS), qualifying you to teach the 11-18 age group in secondary schools in England and Wales.\r\n\r\nThe course focuses on meeting the demands of teaching music in secondary schools in the 21st century. The programme proves a balance of reflective practice, analytic research and study, and current developments in music education. \r\n\r\nThe course allows for engagement with philosophies and pedagogies of music education, the development of approaches to delivering musical learning, and projects and opportunities to put such considerations into practice. \r\n\r\nWe pride ourselves on working closely with our partnership schools, and our team of mentors has the well-being and progression of our students at the heart of their work. \r\n\r\nWe work closely with a local primary school to address issues of transition from KS2-3, and spend time in a local school for pupils with SEND to more fully explore inclusivity in educational provision. We have a close partnership with Berkshire Maestros and work collaboratively to deliver singing, composition and performance workshops.\r\n\r\nAt the heart of our approach is that music teachers must be musicians as well as teachers. They must teach in a way that allows their pupils to develop their own musical understanding and use music as the target language for all that goes on in the music classroom.\r\n\r\nYour tutors are a diverse and incredibly experienced community of academics. You will be taught by experts in the field of music in education, and together you will examine a range of pedagogical approaches to music teaching.\r\n\r\nYou will learn in our purpose-built music and music technology studios with extensive resources of music, instruments and equipment. \r\n\r\nTeaching is through lectures, practical seminars and workshops, where interactive and discussion-based techniques will encourage you to engage, reflect and challenge. \r\n\r\nSessions may include:\r\n\r\n* participating in workshop style sessions with your peers\r\n* attending presentations by subject experts\r\n* working on tasks in groups\r\n* having individual tutorials\r\n* visits to schools or other education settings\r\n* visits to theatres, museums, galleries or sites of educational interest\r\n* writing assignments on aspects of subject teaching and Professional Studies\r\n\r\nThese learning activities will help you to develop a toolkit of knowledge and skills, ensuring you are well prepared to tackle challenges and opportunities throughout your training and your career.\r\n\r\n[More information about this course](http://www.reading.ac.uk/ready-to-study/study/subject-area/education-pg/pgce-secondary-education-music.aspx)","interviewProcess":"You will generally be interviewed by the Course Leader, and depending on the number of interviewees attending on a particular day, the schedule for the day will look something like that outlined below:\t\r\n\r\n1. An introduction to the music component of the course (group discussion, approx. 10 minutes)\r\n\r\n2. Each candidate will perform a 3-5 minute solo on their main instrument or voice to the group. This may be a piece in any style. There is no accompanist provided, so either perform an unaccompanied work, or bring a backing track on CD or other audio file.\r\n\r\n3. Each candidate will teach a song of their own choosing to the group. Choose a song suitable for classroom singing with year 7 students. The song may be in any style, and you may use a backing track or accompaniment, or sing a capella. The song must be a maximum of 3 minutes in performance. You will have 10 minutes to teach your song. \r\n\r\n4. Each candidate will be expected to realise a simple accompaniment to a folksong-like melody on the piano, guitar, ukulele etc. as if accompanying a class singing session.\r\n\r\n5. Individual interviews lasting approx. 20 minutes\r\n\r\n6.\tAt the same time, candidates will complete an individual written musicianship test to assess your staff notation reading and writing, and music analysis skills. \r\n","howSchoolPlacementsWork":"Placements enable you to develop the skills and knowledge valued and desired by employers - you will build your confidence in the classroom and gain practical teaching experience. Placements also provide you with the opportunity to connect with potential employers and build your professional network.\r\n\r\nAt Secondary level we have strong relationships with around 80 schools in the local and surrounding area. It is a testament to the strength of these partnerships and the regard with which our graduates are held, that most schools in Berkshire employ at least one graduate of the Institute of Education.\r\n\r\nOn your Secondary PGCE course you are required to carry out three placements in two different age groups - ensuring you receive a broad range of experiences. Two placements must be undertaken in a school setting but the third can be taken in a different setting - allowing you to sample teaching in an alternative environment.\r\n\r\nWe offer our students an unusually flexible and broad range of settings and educational environments - you will have the opportunity to gain experience in special needs schools, Pupil Referral Units, independent schools, museums, and charities.\r\n\r\nYou will have plenty of opportunities throughout your course to apply your developing skills in real settings. In schools, you will be involved in:\r\n\r\n* observation of other teachers\r\n* planning and teaching parts of lessons/small groups\r\n* planning and teaching lessons and sequences of lessons\r\n* reflecting on and evaluating your teaching\r\n* receiving feedback on your teaching\r\n* gaining experience of the range of responsibilities of classroom teachers.","personalQualities":"If you are passionate about and committed to children's education and would like a career in which you can make a difference, then apply to the University of Reading.  \r\n\r\nWe welcome applications from  prospective students who have an understanding of and insight into the role of the teacher, the classroom environment and the processes involved in learning and teaching.","otherRequirements":"If you accept an offer with us you will also be required to successfully complete Occupational Health and Disclosure Barring Service (DBS) Enhanced Disclosure checks. \r\n\r\nThese checks are required to ensure you meet the Department for Education’s requirements for physical and mental fitness to teach, as well as assessing your suitability for working with children.  ","status":1,"createdAt":"2021-07-06T10:52:56.515Z","updatedAt":"2021-10-04T15:04:20.300Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
