{"id":"2f39456c-0180-4136-8ff9-6a6ac6b32d4e","name":"Primary with Mathematics","code":"2V3Z","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"286cf12f-b3e3-41c5-9f33-2ff7807d2df0","code":"03","name":"Primary with mathematics"}],"locations":[{"id":"f024c53d-e458-4ca3-b3e6-33f5793aa8ac","name":"Institute of Education, University of Reading","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"6439adcc-af64-4d3d-a1da-de045755db06","code":"R12","name":"The University of Reading"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We accept English and Mathematics equivalency tests offered by the University of Reading.  Details will be sent with the offer email.\n\nWe will also accept tests offered by astarequivalency.co.uk, mathsmadeeasy.co.uk or equivalencytesting.com.  \n\nPlease email the university first to check acceptability if you are considering taking a test with another provider.","courseLength":"OneYear","feesUK":9250,"feesInternational":17100,"feeDetails":"On 23 June 2020 the UK government announced that, following the end of the transition period, EU students (with the exception of the Republic of Ireland) commencing a new programme of study will pay fees at the International rate with effect from the 2021/22 academic year.\r\n\r\nStudents starting a course in 2022 may still be entitled to pay fees at the UK student rate if they have settled or pre-settled status under the EU Settlement Scheme.","financialSupport":"Students who have previously graduated from an undergraduate course at the University of Reading will be eligible for an alumni discount amounting to £1500.\r\n\r\nThis discount will also be available to Reading alumnus undertaking a non-salaried School Direct with PGCE course with one of our school partners.","aboutCourse":"Our Post Graduate Certificate in Education (PGCE) Primary Education with Mathematics leads to the award of Qualified Teacher Status (QTS), qualifying you to teach maths to children aged five to 11.\r\n\r\nChoose this specialism pathway if you are interested in championing mathematics in your future school. It will prepare for you for teaching in primary, infant and junior schools, and will enable you to follow a particular interest in mathematics, leading to subject leadership and/or specialist teaching of mathematics within a primary setting.\r\n\r\nYour tutors are internationally or nationally renowned and their research regularly has a direct impact on school curricula and learning techniques, both in the UK and abroad. As experts in their field, their research also directly informs the focus and content of your course.\r\n\r\nLearning takes place through a series of lectures, practical seminars and workshops, where interactive and discussion-based techniques will encourage you to engage, reflect and challenge. \r\n\r\nSessions may include:\r\n\r\n* participating in workshop style sessions with your peers\r\n* attending presentations by subject experts\r\n* working on tasks in groups\r\n* having individual tutorials\r\n* visits to schools or other education settings\r\n* visits to theatres, museums, galleries or sites of educational interest\r\n* writing assignments on aspects of subject teaching and Professional Studies\r\n\r\nAlongside the University tutors, you will be taught and guided by a team of committed and experienced University-trained school mentors.\r\n\r\n[Further information about the course](http://www.reading.ac.uk/ready-to-study/study/subject-area/education-pg/pgce-primary-mathematics.aspx)","interviewProcess":"You will be invited to one interview, conducted by academic members of staff, which will be held online.\r\n\r\nAs part of the interview process you will be asked to watch a short video clip of a primary mathematics lesson and asked to consider a set of questions, which you will discuss in your interview. You will also be given a written task to complete based on a current educational topic.\r\n","howSchoolPlacementsWork":"Placements enable you to develop the skills and knowledge valued and desired by employers - you will build your confidence in the classroom and gain practical teaching experience. Placements also provide you with the opportunity to connect with potential employers and build your professional network.\r\n\r\nYou will have plenty of opportunities throughout your PGCE to apply your developing skills to real-life settings. We have strong partnerships with over 300 local schools and are renowned for our relationships with these partner schools.\r\n\r\nIt is a testament to the strength of our partnerships and the regard in which our graduates are held, that most schools in Berkshire employ at least one graduate of the Institute of Education.","personalQualities":"If you are passionate about and committed to children's education and would like a career in which you can make a difference, then apply to the University of Reading.    \r\n\r\nWe welcome applications from  prospective students who have an understanding of and insight into the role of the teacher, the classroom environment and the processes involved in learning and teaching.","otherRequirements":"If you accept an offer with us you will also be required to successfully complete Occupational Health and Disclosure Barring Service (DBS) Enhanced Disclosure checks. \r\n\r\nThese checks are required to ensure you meet the Department for Education’s requirements for physical and mental fitness to teach, as well as assessing your suitability for working with children.  ","status":1,"createdAt":"2021-07-06T10:52:56.015Z","updatedAt":"2021-10-04T15:08:23.626Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
