{"id":"4914af3a-f435-4e96-86a4-142f93df0d80","name":"Modern Languages (Spanish)","code":"R4X1","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"ce8523ef-9236-4cd9-b260-d826c7a521b3","code":"ML","name":"Modern Languages"},{"id":"e34fd2a3-a32e-44e9-aea1-666badf3ac03","code":"22","name":"Spanish"}],"locations":[{"id":"f024c53d-e458-4ca3-b3e6-33f5793aa8ac","name":"Institute of Education, University of Reading","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"6439adcc-af64-4d3d-a1da-de045755db06","code":"R12","name":"The University of Reading"},"profPost":"PG","degreeGrade":"0","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"You are normally required to have at least a 2:1 honours degree (or equivalent from a university outside the UK) in a subject that is related to the subject you intend to teach.","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We accept English and Mathematics equivalency tests offered by the University of Reading.  Details will be sent with the offer email.\n\nWe will also accept tests offered by astarequivalency.co.uk, mathsmadeeasy.co.uk or equivalencytesting.com.  \n\nPlease email the university first to check acceptability if you are considering taking a test with another provider.","courseLength":"OneYear","feesUK":9250,"feesInternational":17100,"feeDetails":"On 23 June 2020 the UK government announced that, following the end of the transition period, EU students (with the exception of the Republic of Ireland) commencing a new programme of study will pay fees at the International rate with effect from the 2021/22 academic year.\r\n\r\nStudents starting a course in 2022 may still be entitled to pay fees at the UK student rate if they have settled or pre-settled status under the EU Settlement Scheme.","financialSupport":"Students who have previously graduated from an undergraduate course at the University of Reading will be eligible for an alumni discount amounting to £1500.\r\n\r\nThis discount will also be available to Reading alumnus undertaking a non-salaried School Direct with PGCE course with one of our school partners.","aboutCourse":"This Post Graduate Certificate in Education (PGCE) Secondary Modern Foreign Language leads to the award of Qualified Teacher Status (QTS), qualifying you to teach the 11-18 age group in secondary schools in England and Wales.\r\n\r\nThe programme has consistently been judged as excellent in both internal and external reviews, and is widely acknowledged as one of the best modern foreign language courses in the country. \r\n\r\nYou will specialise in one main teaching language (either French, German or Spanish) but we strongly encourage all trainees to teach a second language to at least beginner level.\r\n\r\nYour tutors are a diverse and incredibly experienced community of academics with wide practical experience in schools and international reputations as experts in the field of Modern Foreign Language teaching and learning. The work of tutors is feeding into the [DfE National Centre of Excellence for Language Pedagogy](https://ncelp.org/), and underpins the internationally renowned [Professional Development Consortium in MFL](www.pdcinmfl.com), whose principles form the basis of the  course.  We have strong links to the Association for Language Learning and collaborate with such expert practitioners such as those at [The Language Gym](https://gianfrancoconti.com/2019/08/02/breaking-the-sound-teaching-learners-how-to-listen-why-we-wrote-it-and-what-it-is-about/). Many of the books and articles used on the course have been written by tutors themselves.\r\n\r\nThe PGCE will provide you with a theoretical framework for language teaching closely integrated with practical advice on the preparation and delivery of effective and engaging language lessons. Your assignments are designed to help you to plan your teaching effectively and imaginatively and to evaluate your skills, particularly in terms of the quality of learning achieved by pupils.\r\n\r\nYou will be taught through a series of lectures, practical seminars and workshops, where interactive and discussion-based techniques will encourage you to engage, reflect and challenge. \r\n\r\nSessions may include:\r\n\r\n* participating in workshop style sessions with your peers\r\n* attending presentations by subject experts\r\n* working on tasks in groups\r\n* having individual tutorials\r\n* visits to schools or other education settings\r\n* visits to theatres, museums, galleries or sites of educational interest\r\n* writing assignments on aspects of subject teaching and Professional Studies\r\n\r\nThese learning activities will help you to develop a toolkit of knowledge and skills, ensuring you are well prepared to tackle challenges and opportunities throughout your training and your career.\r\n\r\nAlongside the University tutors, you will be taught and guided by a team of committed and experienced University-trained school mentors.\r\n\r\n[More information about this course](http://www.reading.ac.uk/ready-to-study/study/subject-area/education-pg/pgce-secondary-education-modern-languages-spanish.aspx)","interviewProcess":"You will normally be interviewed by two MFL tutors who will see a group of applicants on the same day.\r\n\r\nYou will be asked to give a short presentation to the group on any aspect of teaching and learning a foreign language that interests you.  The presentation should last no longer than five minutes and be in English (NB no audio-visual equipment will be available for this).\r\n\r\nYou will attend an individual interview. \r\n\r\n* Part of the interview will be in the foreign language\r\n* During the interview, you will be asked about your understanding of the key aspects of effective language teaching and wider educational        issues\r\n\r\n During the day you will also complete the following tasks:\r\n\r\n* Written task in the main teaching language on a general topic, given to you on the day.\r\n* Reading and writing task in English\r\n\r\n*Please note interviews are currently being held online*","howSchoolPlacementsWork":"Placements enable you to develop the skills and knowledge valued and desired by employers - you will build your confidence in the classroom and gain practical teaching experience. Placements also provide you with the opportunity to connect with potential employers and build your professional network.\r\n\r\nAt Secondary level we have strong relationships with around 80 schools in the local and surrounding area. It is a testament to the strength of these partnerships and the regard with which our graduates are held, that most schools in Berkshire employ at least one graduate of the Institute of Education.\r\n\r\nOn your Secondary PGCE course you are required to carry out three placements in two different age groups - ensuring you receive a broad range of experiences. Two placements must be undertaken in a school setting but the third can be taken in a different setting - allowing you to sample teaching in an alternative environment.\r\n\r\nWe offer our students an unusually flexible and broad range of settings and educational environments - you will have the opportunity to gain experience in special needs schools, Pupil Referral Units, independent schools, museums, and charities.\r\n\r\nYou will have plenty of opportunities throughout your course to apply your developing skills in real settings. In schools, you will be involved in:\r\n\r\n* observation of other teachers\r\n* planning and teaching parts of lessons/small groups\r\n* planning and teaching lessons and sequences of lessons\r\n* reflecting on and evaluating your teaching\r\n* receiving feedback on your teaching\r\n* gaining experience of the range of responsibilities of classroom teachers.","personalQualities":"If you are passionate about and committed to children's education and would like a a career in which you can make a difference, then apply to the University of Reading.    \r\n\r\nWe welcome applications from  prospective students who have an understanding of and insight into the role of the teacher, the classroom environment and the processes involved in learning and teaching.","otherRequirements":"If you accept an offer with us you will also be required to successfully complete Occupational Health and Disclosure Barring Service (DBS) Enhanced Disclosure checks. \r\n\r\nThese checks are required to ensure you meet the Department for Education’s requirements for physical and mental fitness to teach, as well as assessing your suitability for working with children.  ","status":1,"createdAt":"2021-07-06T10:52:56.420Z","updatedAt":"2021-10-04T15:03:50.263Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
