{"id":"86285d6f-bce2-4a97-9908-d42081251aa0","name":"Drama","code":"W4X1","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"69052223-ca45-4781-a8d3-cb92447a6d78","code":"13","name":"Drama"}],"locations":[{"id":"f024c53d-e458-4ca3-b3e6-33f5793aa8ac","name":"Institute of Education, University of Reading","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"6439adcc-af64-4d3d-a1da-de045755db06","code":"R12","name":"The University of Reading"},"profPost":"PG","degreeGrade":"0","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"You are normally required to have at least a 2:1 honours degree (or equivalent from a university outside the UK) in a subject that is related to the subject you intend to teach.","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We accept English and Mathematics equivalency tests offered by the University of Reading.  Details will be sent with the offer email.\n\nWe will also accept tests offered by astarequivalency.co.uk, mathsmadeeasy.co.uk or equivalencytesting.com.  \n\nPlease email the university first to check acceptability if you are considering taking a test with another provider.","courseLength":"OneYear","feesUK":9250,"feesInternational":17100,"feeDetails":"On 23 June 2020 the UK government announced that, following the end of the transition period, EU students (with the exception of the Republic of Ireland) commencing a new programme of study will pay fees at the International rate with effect from the 2021/22 academic year.\r\n\r\nStudents starting a course in 2022 may still be entitled to pay fees at the UK student rate if they have settled or pre-settled status under the EU Settlement Scheme.","financialSupport":"Students who have previously graduated from an undergraduate course at the University of Reading will be eligible for an alumni discount amounting to £1500.\r\n\r\nThis discount will also be available to Reading alumnus undertaking a non-salaried School Direct with PGCE course with one of our school partners.","aboutCourse":"This Post Graduate Certificate in Education (PGCE) Secondary Drama leads to the award of Qualified Teacher Status (QTS), qualifying you to teach the 11-18 age group in secondary schools in England and Wales.\r\n\r\nThis course is consistently evaluated as excellent in both internal and external reviews and encompasses a variety of approaches to drama and theatre teaching in relation to a KS3 Drama curriculum and GCSE and A level exam specifications whilst also exploring the role of drama for the individual within the complexities of life in the 21st century. \r\n\r\nThe course provides a theoretical framework for teaching drama within schools and is rooted in embodied practice.\r\n\r\nYou will address all aspects of secondary drama, including specialist expertise in areas such as devising, teaching texts and key practitioners, theatre history and drama as a method of addressing subjects and issues across the curriculum.\r\n\r\nAssignments are designed to help you plan your teaching effectively, imaginatively and to evaluate your skills, particularly in terms of the quality of learning achieved by pupils.\r\n\r\nWe have a strong network of drama mentors, many of whom have taken the course themselves and are managing thriving departments. The course leader remains a practitioner and is supplemented by teaching from experts within the field.\r\n\r\nWe have links with National Drama, the UK’s leading professional association for drama teachers, SCITED (the Standing Committee in the Teaching of Educational Drama), theatre educators, and local and regional professional theatre practitioners.\r\n\r\nWe have dedicated technical studios both within the Institute of Education and the Department of Film, Theatre and Television within the University.\r\n\r\nThere are a range of theatre trips and opportunities to prepare work to perform to student audiences both within schools and in our own studio spaces.\r\n\r\nYou will learn through practical seminars and workshops.\r\n\r\nYour teaching may include:\r\n\r\n* participating in workshop style sessions with your peers\r\n* attending presentations by subject experts\r\n* working on tasks in groups\r\n* having individual tutorials\r\n* visits to schools or other education settings\r\n* visits to theatres, museums, galleries or sites of educational interest\r\n* writing assignments on aspects of subject teaching and Professional Studies\r\n\r\nThese activities will help you develop a toolkit of knowledge and skills, ensuring you are well prepared to tackle challenges and opportunities throughout your training and career. An environment in which to develop as a dynamic and inspirational drama teacher.\r\n\r\n[More information about this course](http://www.reading.ac.uk/ready-to-study/study/subject-area/education-pg/pgce-secondary-education-drama.aspx)","interviewProcess":"Interviews are currently being held online.\r\n\r\n","howSchoolPlacementsWork":"Placements enable you to develop the skills and knowledge valued and desired by employers - you will build your confidence in the classroom and gain practical teaching experience. Placements also provide you with the opportunity to connect with potential employers and build your professional network.\r\n\r\nAt Secondary level we have strong relationships with around 80 schools in the local and surrounding area. It is a testament to the strength of these partnerships and the regard with which our graduates are held, that most schools in Berkshire employ at least one graduate of the Institute of Education.\r\n\r\nOn a Secondary PGCE course you are required to carry out three placements in two different age groups - ensuring you receive a broad range of experiences. Two placements must be undertaken in a school setting but the third can be taken in a different setting - allowing you to sample teaching in an alternative environment.\r\n\r\nWe offer our students an unusually flexible and broad range of settings and educational environments - you will have the opportunity to gain experience in special needs schools, Pupil Referral Units, independent schools, museums, and charities.\r\n\r\nYou will have plenty of opportunities throughout your course to apply your developing skills in real settings. In schools, you will be involved in:\r\n\r\n* observation of other teachers\r\n* planning and teaching parts of lessons/small groups\r\n* planning and teaching lessons and sequences of lessons\r\n* reflecting on and evaluating your teaching\r\n* receiving feedback on your teaching\r\n* gaining experience of the range of responsibilities of classroom teachers.\r\n","personalQualities":"If you are passionate about and committed to children's education and would like a a career in which you can make a difference, then apply to the University of Reading.  \r\n\r\nWe welcome applications from  prospective students who have an understanding of and insight into the role of the teacher, the classroom environment and the processes involved in learning and teaching.","otherRequirements":"If you accept an offer with us you will also be required to successfully complete Occupational Health and Disclosure Barring Service (DBS) Enhanced Disclosure checks. \r\n\r\nThese checks are required to ensure you meet the Department for Education’s requirements for physical and mental fitness to teach, as well as assessing your suitability for working with children.  ","status":1,"createdAt":"2021-07-06T10:52:56.564Z","updatedAt":"2021-10-04T14:58:28.613Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
