{"id":"9ef63a23-e678-4421-b4b1-006670e19d9c","name":"History","code":"V1X1","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"5a3609a0-5bbb-4377-b919-5d89932ab622","code":"V1","name":"History"}],"locations":[{"id":"f024c53d-e458-4ca3-b3e6-33f5793aa8ac","name":"Institute of Education, University of Reading","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"6439adcc-af64-4d3d-a1da-de045755db06","code":"R12","name":"The University of Reading"},"profPost":"PG","degreeGrade":"0","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"You are normally required to have at least a 2:1 honours degree (or equivalent from a university outside the UK) in a subject that is related to the subject you intend to teach.","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We accept English and Mathematics equivalency tests offered by the University of Reading.  Details will be sent with the offer email.\n\nWe will also accept tests offered by astarequivalency.co.uk, mathsmadeeasy.co.uk or equivalencytesting.com.  \n\nPlease email the university first to check acceptability if you are considering taking a test with another provider.","courseLength":"OneYear","feesUK":9250,"feesInternational":17100,"feeDetails":"On 23 June 2020 the UK government announced that, following the end of the transition period, EU students (with the exception of the Republic of Ireland) commencing a new programme of study will pay fees at the International rate with effect from the 2021/22 academic year.\r\n\r\nStudents starting a course in 2022 may still be entitled to pay fees at the UK student rate if they have settled or pre-settled status under the EU Settlement Scheme.","financialSupport":"Students who have previously graduated from an undergraduate course at the University of Reading will be eligible for an alumni discount amounting to £1500.\r\n\r\nThis discount will also be available to Reading alumnus undertaking a non-salaried School Direct with PGCE course with one of our school partners.","aboutCourse":"This Post Graduate Certificate in Education (PGCE) Secondary History leads to the award of Qualified Teacher Status (QTS), qualifying you to teach the 11-18 age group in secondary schools in England and Wales.\r\n\r\nOur History programme is designed to develop practitioners so that they can excel in any teaching context. A passion for history is at the heart of what we do and is evident in all aspects of the training year.\r\n\r\nWe ensure that the right space and guidance is there for trainees who arrive with differing experiences of history and education so that everyone can develop the right subject knowledge and pedagogical content knowledge.\r\n\r\nSessions include:\r\n\r\n* how to teach pupils about causation, change and continuity, similarity and difference, and difficult concepts\r\n* how to develop pupils’ evidential thinking and chronological understanding\r\n* making big decisions about the curriculum, e.g. what history and whose history to teach and when to teach it. In order to do this, the history team work closely with mentors in schools, including school visits and training to ensure our high professional standards are maintained. \r\n\r\nThe tutor team are passionate about what they do, have a vast range of experience and have strong national and international reputations for their work, both as classroom history teachers and teacher trainers. During the year we draw on our numerous contacts and their expertise; we have leading history teachers contribute to sessions, and work with organisations such as the UCL Centre for Holocaust Education, the National Archives, and the Citizens Project at Royal Holloway. This ensures that your thinking and practice is informed by those at the leading edge of the profession.\r\n\r\nFurthermore we organise trips to consider history learning in different contexts, as well as the value of local history and leading effective trips. In 2020 our cohort spent days at Windsor Castle, where they drew upon the Royal Archives and an exclusive tour, and the Museum of English Rural Life.\r\n\r\nOur course combines research and practice from the very beginning, developed through a huge amount of classroom-based teaching and subsequent reflection, which has led to it receiving exceptional student evaluations and exemplary praise from external examiners.\r\n\r\n[More information about this course](http://www.reading.ac.uk/ready-to-study/study/subject-area/education-pg/pgce-secondary-education-history.aspx)","interviewProcess":"Interviews are currently being held online.","howSchoolPlacementsWork":"Placements enable you to develop the knowledge and skills valued and desired by employers - you will build your confidence in the classroom and gain practical teaching experience. Placements also provide you with the opportunity to connect with potential employers and build your professional network.\r\n\r\nAt Secondary level we have strong relationships with around 80 schools in the local and surrounding area. It is a testament to the strength of these partnerships and the regard with which our graduates are held, that most schools in Berkshire employ at least one graduate of the Institute of Education, with many employing significantly more.\r\n\r\nOn your Secondary PGCE course you are required to carry out three placements in two different age groups - ensuring you receive a broad range of experiences. Two placements must be undertaken in a school setting but the third can be taken in a different setting - allowing you to sample teaching in an alternative environment.\r\n\r\nWe offer our students an unusually flexible and broad range of settings and educational environments - you will have the opportunity to gain experience in special needs schools, Pupil Referral Units, independent schools, museums, and charities.\r\n\r\nYou will have plenty of opportunities throughout your course to apply your developing skills in real settings. In schools, you will be involved in:\r\n\r\n* observation of other teachers\r\n* planning and teaching parts of lessons/small groups\r\n* planning and teaching lessons and sequences of lessons\r\n* reflecting on and evaluating your teaching\r\n* receiving feedback on your teaching\r\n* gaining experience of the range of responsibilities of classroom teachers.","personalQualities":"If you are passionate about and committed to children's education and would like a career in which you can make a difference, then apply to the University of Reading.  \r\n\r\nWe welcome applications from  prospective students who have an understanding of and insight into the role of the teacher, the classroom environment and the processes involved in learning and teaching.","otherRequirements":"If you accept an offer with us you will also be required to successfully complete Occupational Health and Disclosure Barring Service (DBS) Enhanced Disclosure checks. \r\n\r\nThese checks are required to ensure you meet the Department for Education’s requirements for physical and mental fitness to teach, as well as assessing your suitability for working with children.  ","status":1,"createdAt":"2021-07-06T10:52:56.452Z","updatedAt":"2021-10-04T15:00:26.867Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
