{"id":"a0f613f4-9237-4481-b2cc-8c091e28fcf2","name":"Computing","code":"39QX","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"e6be6a9c-8696-4b88-8fbd-1ba1bef1b6fc","code":"11","name":"Computing"}],"locations":[{"id":"3b802701-cadd-4503-91d8-76fbe22f953b","name":"Tavistock College","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"c9b7962a-9ed3-447e-9ca5-7d06b9d50760","code":"2HG","name":"Devon and Cornwall Cooperative Alliance"},"accreditedBody":{"id":"a4e84530-e1f1-47c6-b57e-ec693d629637","code":"P63","name":"Plymouth Marjon University"},"profPost":"PG","degreeGrade":"1","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"The Devon and Cornwall Co-operative Alliance offer a school direct programme which combines high quality, taught PGCE input at Marjon University, Plymouth, with extended placement opportunities to develop you as a teacher and skilled practitioner at two different placement schools. The Co-operative values lie at the heart of our training programme which is tailored to meet individual needs and best prepare trainees for their journey to becoming an early career teacher. Being part of our School Direct programme means you are truly part of the culture and shared values of the schools within the Dartmoor Multi-Academy Trust and are treated as members of staff from day one in the academic year. ","interviewProcess":"Tavistock College is the lead school in the partnership and will be co-ordinating the recruitment process. This will usually involve an interview day spent at Tavistock College which includes the formal interview, a student panel exercise and the opportunity to talk to staff and pupils. This may be under-taken remotely due to the current implications of the Covid-19 pandemic.\r\nOur university partner, Marjon University, Plymouth, will be involved throughout the day. If the placement is at another school in the partnership, staff from that school may also be involved. It is a rigorous and thorough process, designed to get the best match of applicant to the places available within our Trust schools.\r\n","howSchoolPlacementsWork":"Trainees are based in their main placement school from the first day in September. You are treated like a full member of staff and with that comes the same expectations of professional standards and behaviour. Your main placement lasts for the whole of the Autumn term and the summer term, whilst a minimum 6 week block in the Spring term is spent at a second, complementary placement school.\r\nOver the course of the academic year you will be given the maximum exposure possible to teaching across different year groups, key stages and topics within your subject. Opportunities to look at whole school provision in areas such as SEND and provision for disadvantaged students will also be encouraged. \r\nDuring the academic year there are regular University days for the taught PGCE element, subject knowledge days and a range of conferences on topics including behaviour management and diversity issues. \r\n","personalQualities":"We advise applicants to gain some school-based experience prior to application. Although this is not essential it would be an advantage to be able to reflect on any school-based experience at interview.\r\nSuccessful applicants will have a strong academic track record and will be able to demonstrate a passion for teaching your chosen subject and working with young people. They will possess a high level of drive, independence and initiative alongside a commitment to developing learners who are creative and critical students. In addition, they will be able to build strong and effective relationships with both students and colleagues.\r\n","otherRequirements":"Selection based on the information provided on the UCAS Teacher Training application\r\nSelection based on a successful interview\r\nA medical report which is deemed satisfactory\r\nA completed Disclosure & Barring Service (DBS) enhanced check which is deemed satisfactory by the University.\r\n","status":1,"createdAt":"2021-07-06T10:56:58.236Z","updatedAt":"2021-07-20T13:40:29.432Z","canSponsorStudentVisa":"yes","cycle":"2024"}
