{"id":"4ede8891-7260-45d2-8a34-5dca2c867708","name":"Primary","code":"348S","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"7129ae9a-10bc-4043-8d81-b887d4c87144","name":"St Andrews C of E (Aided) Primary School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"b078ae49-5184-4104-9a4f-b61bd5a591be","code":"28A","name":"Devon Moorland Schools Partnership"},"accreditedBody":{"id":"a4e84530-e1f1-47c6-b57e-ec693d629637","code":"P63","name":"Plymouth Marjon University"},"profPost":"PG","degreeGrade":"1","english":"1","maths":"1","science":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feeDetails":"Your tuition fees are paid to our link HEI. The current tuition fees for this programme are £9,250, however funding and bursaries may be available.","aboutCourse":"The Moorland School Partnership (MSP) provides a unique opportunity to learn from a wide range of schools with excellent practice and expertise. \r\nWhat we can offer you\r\n\r\n * Outstanding training for trainee teachers in a range of contexts.\r\n\r\n* Shared exceptional practice and specific expertise across the schools.\r\n\r\n* Outstanding teachers as experienced trained mentors with rigorous training.\r\n\r\n* Contrasting settings to ensure breadth of experience for trainees.\r\n\r\n* A wealth of experience in coaching and deep mentoring available within the partnership.\r\n\r\n* Working in partnership with University of St. Mark and St. John to support trainee teachers for excellence.\r\n\r\n* Ensuring that trainees reach their full potential in aspiring to become outstanding teachers. \r\n\r\n* Moorland School Partnership is committed to innovative, systematic collaboration where best practice can be shared and benefit all. \r\n\r\n* Plymouth Marjon University is celebrating 180  years of teacher training and is still dedicated to preparing the next generation of teachers for the best profession in the world.\r\n\r\nOur University led and school led programmes are designed to train trainee teachers to become highly reflective teachers. The Guardian ranks us 6th best university in the UK for education courses, out of 80 universities, and 1st in Devon and Cornwall. At Plymouth Marjon learning and teaching is underpinned by research, policy and practice. The Complete University Guide 2021 No. 1 in England for student satisfaction. and the National student survey 2021 ranks us as number 1 in England for Learning Community\r\n\r\n Vision of Excellence: We will build on a unique and long standing heritage through the development of a values-based collaborative partnership that ensures excellent outcomes for pupils, trainees and teachers.\r\n\r\n Plymouth Marjon is a small university with a green and spacious campus, and world-class facilities in a spectacular part of the world. With strong support and an ambitious community, its students achieve more than they ever thought possible.\r\n\r\n Complete University guide 2019 stated 'Plymouth Marjon University has long-established expertise in teacher training reflected in the numbers of postgraduate students choosing to study at the university.'\r\n\r\n The University's aim is to support you during your NQT period and beyond. Leo Data 2018 shows Marjon teachers are 6th highest earners in England and Wales 5 years after qualifying, showing they are not just job ready but also promotion ready.\r\n","interviewProcess":"If you are invited for interview you will receive full details of what will be expected of you in a letter of invitation. We work closely with our HEI link partner in the selection process. You will be expected to be familiar with key issues and developments in primary schools - especially those in your subject area. It will help you to read the educational press and to talk to teachers and those currently undertaking teacher training. Our interview procedure is a rigorous and thorough process, designed to get the best match of applicant to the School Direct places available.\r\n\r\nYou will have the opportunity to spend time in one of our schools during the interview day to get a flavour of our partnership and the ethos of the school","howSchoolPlacementsWork":"Our training programme is supported in schools by experienced and expert staff, who are also outstanding practitioners. \r\n\r\nAims of the course: To provide outstanding training for a Post Graduation Certificate of Education with Qualified Teacher Status. To prepare teachers of tomorrow with the skills and knowledge needed to provide challenging and engaging learners.\r\nEach School Direct trainee will undertake two placements, a longer placement starting in their 'home school' and a second shorter placement usually taking place in one of our other partner schools.\r\n\r\nPartnership Schools:\r\nSt. Andrew's C.E. (Aided) Primary School (Lead School) \r\nGulworthy Primary School\r\nMary Tavy and Brentor Primary School\r\nMilton Abbot Primary School Lamerton Primary School \r\n\r\n\r\nFor further details of the scheme please contact admin@standrewscofe.co.uk\r\n","personalQualities":"\r\n\r\nEnthusiastic, independent, resilient and motivated graduates who will:\r\n\r\n Have a demonstrable rapport with children and an enthusiasm to make a difference in the lives of our children.\r\n\r\nFully endorse the ethos and values of the partnership and individual schools in developing the 'whole child'.\r\n\r\nBe committed to becoming an outstanding teacher by responding to the opportunities available.\r\n\r\nBe responsible for your own learning and deepening of knowledge to develop understanding of how children learn, from national and international research.\r\n\r\nFully embrace professional standards, including becoming a key member of our team to embrace the wider life of the school. \r\n","otherRequirements":"All applicants will be subject to suitability checks. This includes a full enhanced disclosure and barring check for child and adult workforce, as well as clearance by your HEI Link Occupational Health department.","status":1,"createdAt":"2021-07-06T10:52:31.867Z","updatedAt":"2021-11-05T12:09:05.181Z","canSponsorStudentVisa":"yes","cycle":"2024"}
