{"id":"d83f9d01-e8ab-48d5-b572-d539ce9ce0f5","name":"Primary with Mathematics","code":"2L26","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"286cf12f-b3e3-41c5-9f33-2ff7807d2df0","code":"03","name":"Primary with mathematics"}],"locations":[{"id":"59d57567-9085-4680-ac79-9d7cf3fc476b","name":"Main Site - Southwark Campus","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"3c17f1f1-e695-473f-8836-57997d910e5b","code":"L75","name":"London South Bank University"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"Applicants who do not offer a GCSE in English Language, Science or Mathematics can demonstrate an equivalent standard by completing a test with Equivalency Testing (https://www.equivalencytesting.com) or A* Equivalency (https://www.astarequivalency.co.uk/).","courseLength":"OneYear","feesUK":9250,"feesInternational":13125,"feeDetails":"These fees apply to courses running in 2018/19.  The University reserves the right to increase its fees in line with changes to legislation, regulation and any governmental guidance or decisions.","financialSupport":"If you have a first, 2:1, 2:2, Master’s or PhD a [£6,000 bursary](https://getintoteaching.education.gov.uk/funding-and-salary/overview/funding-by-subject/funding-for-training-to-teach-primary-maths) is available for students on the Primary with mathematics course. To receive the bursary, you'll need an A level in maths at grade B or above (or equivalent).\r\n\r\nIf the above does not apply, you may be eligible for [financial support while you study, including bursaries, scholarships and loans](https://www.gov.uk/teacher-training-funding).  \r\n\r\nIf you are an overseas graduate, you'll find [further information on funding and visa requirements here](https://getintoteaching.education.gov.uk/explore-my-options/overseas-graduates).","aboutCourse":"[This course](https://www.lsbu.ac.uk/study/course-finder/primary-pgce) leads to Qualified Teacher Status (QTS) and a Postgraduate Certificate in Education. The course equips you to teach primary-aged pupils and covers all areas of the Key Stage 1 and 2 curriculum, through lectures, seminars, workshops and tutorials.  You'll also develop expertise in all areas of primary mathematics teaching and learning.\r\n\r\nYou'll spend a minimum of 120 days (24 weeks) training in school. We'll organise these placements, ensuring that you are placed in at least two contrasting schools.  You'll study the Raising Achievement in Mathematics module at Master's level and for your alternative educational setting placement will spend time working and teaching in a secondary school mathematics department.\r\n\r\nYou'll study two modules at Master's level  and on completion of the course we will award you with a Postgraduate Certificate in Education.  The Master's level assignments are broken up into manageable chunks, with clear links to your school-based training and submission dates set after self-study breaks.\r\n\r\nThe vast majority of the university content is delivered at our Elephant and Castle campus. \r\n\r\nOur course is rated 'good' by Ofsted (June, 2014).\r\n\r\n","interviewProcess":"If we think your application shows that you have the potential to be a great teacher, we'll invite you to interview, even if you haven't yet met all of the required entry criteria.  On the interview day, we'll find out about your subject knowledge and you'll be asked to deliver a short lesson to a group of fellow applicants.  You'll complete a short writing task and you'll also be interviewed by a member of the PGCE teaching team.  You'll have plenty of opportunities to ask questions and we'll take you on a tour of our campus.\r\n\r\n","howSchoolPlacementsWork":"We have strong and long standing partnerships with 90 schools across London.  Working with you and our partnership schools, we'll  find the placements that best match your needs and interests, your home location, and the requirements of the course.  The average distance students have to travel from home to school is three miles.\r\n\r\nDuring the course you'll have four placements.  The first, a mentor placement, focuses on developing your skills in supporting individual pupils and small groups of pupils.  The alternative educational setting placement is an opportunity to work with learners in a secondary school mathematics department.  You'll complete two further substantial placements during which you'll take on the full role of the class teacher. \r\nWhile on placement you'll get support and guidance from a supervising tutor from the university and from the class teacher in whose class you're placed.","personalQualities":"We're looking for applicants with genuine enthusiasm for working with young learners and a commitment to the principles of social justice.\r\n\r\nYour reference will be positive and will highlight your suitability to train to be a teacher.  \r\n\r\nYour personal written statement should be coherent, written in clear standard English, and include evidence of:\r\n*your commitment to value and respect diversity;\r\n*your experience of or commitment to working with young or adult learners in a formal and/or informal setting;\r\n*your awareness of current issues in education.","otherRequirements":"For information about all LSBU's statutory requirements linked to Teacher Training programmes please visit our [website](http://www.lsbu.ac.uk/courses/course-finder/primary-pgce#course_tab_entry_requirements). ","status":1,"createdAt":"2021-07-06T10:52:24.770Z","updatedAt":"2021-09-29T12:28:53.358Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
