{"id":"220a86f6-6b0c-404d-8134-83156fbb713e","name":"English","code":"N163","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3aed1aa8-ae46-4b68-92bb-a6cc20655c59","code":"Q3","name":"English"}],"locations":[{"id":"7877adde-f9b3-4ccd-8189-ff86687ad864","name":"Tupton School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"fc26ec9d-7ec8-4820-91a6-90655a8140b5","name":"Netherthorpe School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"9b6f9c1f-a8cb-4a33-b406-333dfc0d6915","name":"Tibshelf School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"6b7e7403-5558-4597-ae26-a31942a01112","name":"St Mary's Catholic High School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"78838614-9a02-4a90-a175-d72f45a71d99","name":"Swanwick School and Sports College","isPublished":"Y","status":"R","vacancies":"F"},{"id":"d48592c9-d403-4cbf-a05d-f9439cca4de0","name":"Highfields School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"d791d177-2696-4fdf-9457-60723323183e","code":"2D2","name":"Matrix ITT"},"accreditedBody":{"id":"899178cc-20a7-4df5-951a-ee83c1b3d4d1","code":"S21","name":"Sheffield Hallam University"},"profPost":"PG","degreeGrade":"2","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feeDetails":"The course fees for UK students in 2021 to 2022 are £9,250\r\n\r\nThere are Student Loans available to pay the fees.\r\n\r\nIf you decide to pay privately then the payment schedule is\r\n\r\nTerm 1 : £2,625\r\nTerm 2 : £2,625\r\nTerm 3 : £4,000\r\nWith each amount being due on the first day of each term.\r\n\r\nYou will have to pay the cost of the Enhanced Criminal Record Check in advance of starting the course.","financialSupport":"We also provide free membership of the Westfield Healthy Extras emotional wellness support package to support you during your ITT year.\r\n\r\n","aboutCourse":"Prepare for a rewarding teaching career on a course rated 'Outstanding' by OFSTED.\r\n\r\n•\tBoost your career on a course with a 96% employment rate.\r\n•\tUndertake 120 days of placement in Key Stage 3 and 4 settings, with Post 16 experience ensuring a rounded skillset.\r\n•\tGain a base for further studies; you obtain 60 credits towards a masters.\r\n•\tBenefit from government bursaries and initiatives that make full-time teaching easily attainable.\r\n\r\nThis course allows you to meet the demands of Secondary education. You'll gain a thorough understanding of teaching pedagogy and your subject specialism, as well as spend 120 days in local schools to cement your knowledge.\r\n\r\nOn this course, you'll spend 120 days in local and regional partner schools, applying the skills that you have learned on Hallam's City Campus. You'll study Key Stage 3 and 4 curriculum and teaching methods, so you're ready to work in any Secondary oschool - over 96 per cent of our PGCE graduates are teaching or in further study within six months of graduating. Completing the PGCE course gives you 60 credits towards a masters, giving you a chance to study and specialise further.\r\n\r\nYou learn through\r\n•\tplacement work\r\n•\tlectures and seminars\r\n•\treflective writing\r\n•\tpractical assessments\r\n","interviewProcess":"If you are shortlisted, we will invite you to a selection event, and you should bring a passport or photo driving license with you. You can bring other forms of photo ID for the selection event, but if you do, you will still need to present valid identity documents required by the Disclosure and Barring Service (DBS) at your pre-course day.\r\n\r\nThe selection event is a process which assesses if you're suitable for a place on the course. It's a chance to show us your knowledge about the subject and your enthusiasm for the career. Being invited to a selection event doesn't mean you're guaranteed a place on the course - the point of the day is to help us come to a mutual decision. We need to decide whether to make you an offer and you need to decide whether you like the course and the university.\r\n\r\nWe aim to make the interview process as rigorous and informative as possible. It's very much a two-way process, where you can evaluate what we offer while we find out more about you. In order to help us explore your thinking and subject knowledge, and for you to decide if this is the right course for you, we have a number of activities we usually use as part of the interview process.\r\n","howSchoolPlacementsWork":"School-based training is an integral part of the course, and you will work with pupils in key stages 3 and 4 and also have Post-16 experience. \r\n\r\nWe offer the course in partnership with local and regional Secondary schools, which play a key role in the teaching and assessment of your professional competence against the teachers' standards.\r\n\r\nIn total you spend 120 days in school over the year.\r\n\r\nYou will be assigned a school-based mentor for your placement.","personalQualities":"We are looking for the next generation of outstanding teachers and future school leaders. They will be passionate about children and education but also care about our schools and the communities they serve and the special ethos each of those schools have.\r\n\r\nThey will have experience of working with young people - ideally some of this will be school based giving them a good awareness of how schools operate and teachers work. Whatever their experience our applicants need to demonstrate how they have engaged, communicated with and inspired the young people they have worked with.","otherRequirements":"You will need to pass an Enhanced Criminal Record Check. Ideally you will have some experience working with children in a school or another organisation e.g. nursery, playgroups, scouts etc. \r\nAs we are not allowed to hold a licence to sponsor visa applications you will need to be a UK citizen. Citizen’s of the European Economic Area or Switzerland will need to check their residency status at the time of application. You will be asked to provide official confirmation of your residency status on application","status":1,"createdAt":"2021-07-06T10:49:17.415Z","updatedAt":"2021-10-15T09:50:18.605Z","canSponsorStudentVisa":"no","cycle":"2024"}
