{"id":"5917e610-9c7d-43c8-82b1-a956c24fc239","name":"Primary (SEND)","code":"3X4A","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"TA","fundingType":"apprenticeship","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"yes","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"78838614-9a02-4a90-a175-d72f45a71d99","name":"Swanwick School and Sports College","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"d791d177-2696-4fdf-9457-60723323183e","code":"2D2","name":"Matrix ITT"},"accreditedBody":{"id":"aa023df3-b71e-4249-b9c4-41fca8bd135e","code":"D39","name":"University of Derby"},"english":"2","maths":"2","science":"2","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":null,"aboutCourse":"This course is a primary teaching apprenticeship with QTS. This means that candidates will follow a primary qualification with and additional pathway of SEND. Upon completion trainees are presented with QTS.\r\n\r\nOur course is unique in the fact that you will complete placements in both the primary and special sector. By doing so, we believe that you will become a much more well rounded practitioner that is employable in both sectors.\r\n\r\nOur course runs in partnership with the University of Derby who are recognised as an outstanding HEI provider.\r\n\r\nLink tutor visits, key assessment points and level 6 studies are required to be completed throughout the course of the year. All of these elements are designed to ensure trainees are aware of current pedagogical and theoretical approaches to learning.\r\n\r\nIn addition to the university lectures, trainees are provided with in school 'Hub' days that further deepen the knowledge of classroom pedagogy which are facilitated by current school practitioners in a range of areas. ","interviewProcess":"All candidates attend an interview morning at Swanwick School and Sports College. \r\n\r\nDuring this process candidates are expected to facilitate a learning activity with a group of KS2 pupils. There is also an opportunity for candidates to be part of a group discussion around an educational topic. \r\n\r\nOnce both of these are complete, a formal interview is conducted with the Director of Matrix TSA, a Headteacher from within the alliance and the Head of Primary at SSSC.","howSchoolPlacementsWork":"Placements are conducted in contrasting key stages and sectors. \r\n\r\nThere are 3 placements in total. Placements 1 and 3 will be conducted at the candidates host school in their preferred key stage. Placement 2 is conducted at a partner school and will be in the candidates opposite key stage. For example, if your placements 1 and 3 were in KS1, then placement 2 would be in KS2 and vice versa.\r\n\r\nOn our course and SEND pathway you will be placed you in both primary and special schools working with pupils from 5-11. This approach enables candidates to become fully rounded  primary educationalists who can be employed in both the primary and special sector.\r\n\r\nAs an alliance we have 11 schools that are based in Derbyshire and Staffordshire. Where possible we aim to place our trainees in an outstanding school that is close by in order to reduce travel time and to ensure support is provided by experienced mentors and practitioners.","personalQualities":"We are looking for motivated students with a passion for teaching, with the ability to build caring relationships with students. You must be friendly and approachable and demonstrate a strong work ethic and resilience.","otherRequirements":"","status":2,"createdAt":"2021-07-06T10:49:17.114Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024"}
