{"id":"7e726d13-28bb-4789-b8c4-20a7f38f3bd5","name":"Primary 3-7","code":"K808","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SC","studyMode":"P","ageRange":"3_to_7","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"8043dc00-91be-4902-9ae7-1651b22efd0d","name":"Burley Oaks Primary School","isPublished":"Y","status":"R","vacancies":"P"},{"id":"16442006-e5b0-4329-b5f7-c7b39811fc5b","name":"Moor Allerton Hall Primary School","isPublished":"Y","status":"R","vacancies":"P"},{"id":"983853d3-8060-43cc-b471-c6d86f0144d2","name":"Harehills Primary School","isPublished":"Y","status":"R","vacancies":"P"},{"id":"600c79e0-2903-4d63-8581-9076eb3bcd0d","name":"Blenheim Primary School","isPublished":"Y","status":"R","vacancies":"P"},{"id":"10d4c9c6-8ec8-4158-abfc-6b664bc325f6","name":"Tranmere Park Primary School","isPublished":"Y","status":"R","vacancies":"P"},{"id":"98de9941-d48b-4b05-b7d2-88183f1fd1c5","name":"Moorside Primary School & Nursery","isPublished":"Y","status":"R","vacancies":"P"},{"id":"7208f4a3-0d27-486c-b067-e2cd0b642a93","name":"Hawes Primary School","isPublished":"Y","status":"R","vacancies":"P"},{"id":"119c96ad-3741-4aba-89e5-f05396eda76d","name":"Lothersdale Primary School","isPublished":"Y","status":"R","vacancies":"P"},{"id":"88afb524-c1e2-4c53-9373-c4ca06c739f8","name":"Scotton Lingerfield Primary School","isPublished":"Y","status":"R","vacancies":"P"},{"id":"989b1bb7-627e-4780-893d-63142e784133","name":"Leyburn Primary School","isPublished":"Y","status":"R","vacancies":"P"},{"id":"81745d34-f4fc-460c-8ed1-0ec1e46628d6","name":"Gomersal Primary School","isPublished":"Y","status":"R","vacancies":"P"},{"id":"7f1b4981-de22-4bee-964a-919dc4c1fb55","name":"Alwoodley Primary School","isPublished":"Y","status":"R","vacancies":"P"},{"id":"7963d8e8-9d7d-4e7b-a780-91bf0527fa9b","name":"Lighthouse School Leeds","isPublished":"N","status":"S","vacancies":"P"},{"id":"752d257f-9ccc-4d8c-bf34-2bb6be06d8b8","name":"Shire Oak VC Primary School","isPublished":"Y","status":"R","vacancies":"P"},{"id":"2d29e161-27e4-44f1-8251-22edfdc88ede","name":"University of Leeds","isPublished":"Y","status":"R","vacancies":"P"},{"id":"b884365b-ccb0-4534-8ebe-92dab11ae16c","name":"Harrogate Grammar School","isPublished":"Y","status":"R","vacancies":"P"},{"id":"5caef16b-8757-4273-84c3-0dad98a1a974","name":"Temple Learning Academy","isPublished":"Y","status":"R","vacancies":"P"},{"id":"039134fe-2604-447a-84e3-547e91f536c6","name":"Colton Primary School","isPublished":"Y","status":"R","vacancies":"P"},{"id":"f7c70eed-796c-407f-91bf-2327ea8d5c11","name":"Highfield School","isPublished":"Y","status":"R","vacancies":"P"},{"id":"cc2aad09-c2f6-4eba-b1a3-32827e3efcce","name":"Farsley Springbank School","isPublished":"Y","status":"R","vacancies":"P"},{"id":"fbef3030-65e1-42e7-a609-f8077554513c","name":"Kippax Ash Tree Primary School","isPublished":"Y","status":"R","vacancies":"P"},{"id":"324b80d9-125d-49e4-a499-49673e1c3c24","name":"Roundhay School","isPublished":"Y","status":"R","vacancies":"P"},{"id":"7949ef63-5d2a-4429-866c-17a684946b84","name":"Westbrook Lane Primary School","isPublished":"Y","status":"R","vacancies":"P"},{"id":"8a9a22dd-f86b-4df1-b6de-30fff63b5647","name":"Bracken Edge Primary School","isPublished":"Y","status":"R","vacancies":"P"},{"id":"6c54b62f-ff29-495e-aa83-db182f4de17a","name":"Meadowfield Primary School","isPublished":"Y","status":"R","vacancies":"P"},{"id":"1eccce71-8adc-43fb-a7b2-1039142cb9cc","name":"Clapgate Primary School","isPublished":"Y","status":"R","vacancies":"P"},{"id":"64524679-0fe2-4d51-9125-5b472af98977","name":"Meanwood Church of England Primary School","isPublished":"Y","status":"R","vacancies":"P"},{"id":"01e6b032-6d9f-4b5b-b9db-02902a9a6822","name":"Silsden Primary School","isPublished":"Y","status":"R","vacancies":"P"},{"id":"e1eaae49-c36c-47bb-8df6-af4a18146d07","name":"Western Primary School","isPublished":"Y","status":"R","vacancies":"P"}],"trainingProvider":{"id":"4b15c2df-7f1b-4210-ba42-b1f14381e87b","code":"2B9","name":"Red Kite Teacher Training"},"profPost":"PG","degreeGrade":"1","english":"1","maths":"1","science":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We accept equivalency tests for Science. Please contact us directly to discuss.","courseLength":"TwoYears","feesUK":11000,"feeDetails":"Trainees are responsible for their own travel costs throughout the course.","financialSupport":"Many Trainees apply for student finance in order to pay their fees with a Tuition Fee Loan and have access to Maintenance Loan. Additional financial support may be available if you’re a parent or have a disability.\r\n\r\nRed Kite offers a monthly payment schedule for those planning to self-finance. For full time courses, this is £1,250 in October followed by 8 further monthly instalments of £1,000. For part time courses, for each year, an initial payment of £700 in October is due followed by 8 monthly instalments of £600.\r\n","aboutCourse":"Our Part-Time Primary course is a flexible, two-year training programme designed especially for people who have family commitments or need to work while training.\r\n\r\nAltogether, over the two years, Trainees will have more than 120 days in school for each option. In addition to the days in school, Trainees will have 8 days of input over the two years with the University of Leeds (this will be completed through blended online tutorials, remote learning and face-to-face lectures). There are 4 PGCE academic modules across the 2 years and Trainees will gain 60 masters credits; 2 assignments in Year 1 (30 credits) and 2 assignments in Year 2 (30 credits).\r\n\r\nProfessional learning days are included in the training days, although there may be an occasional requirement to attend an event such as an employment conference with peers across all programmes.\r\n\r\nThere are a number of training venues across the region to make this as convenient as possible.\r\n\r\nOur hybrid approach to learning combines traditional classroom experiences and digital course delivery.\r\n\r\nAdvantages:\r\n\r\n* Trainees manage their time to meet course deadlines.\r\n* Trainees get the flexibility of online learning with the stability of in-class instruction.\r\n* Trainees save time travelling to training venues.\r\n* Trainees benefit from a personalised training programme designed to fit around the demands of their everyday life.\r\n\r\nTrainees follow a carefully designed plan to support their learning. The course is structured to make sure that Trainees take on classroom responsibility in a systematic manner. The programme will build your confidence, pedagogy and subject knowledge to give you the necessary skills to become an effective classroom practitioner.\r\n\r\nA detailed calendar and handbook provide Trainees with all the information that they need to plan ahead. Over the two years, you will have taught in at least two schools and in two key stages. We recommend that you stay in one school for each year of the programme.","interviewProcess":"Interviews are conducted on MS Teams by representatives from Red Kite Teacher Training and senior leaders from partnership schools. \r\n \r\nA plan for a pupil activity and a workload prioritisation activity will need to be prepared for the interview.\r\n\r\nYou will be given the opportunity to meet current trainees, course leaders and be offered a school experience day before or after your interview. \r\n","howSchoolPlacementsWork":"Red Kite Teacher Training is one of the largest school-based providers of teacher training in North and West Yorkshire, with a partner network featuring urban and inner-city schools in places such as Harrogate, Bradford and Leeds, as well as schools in more rural parts of Yorkshire.\r\n\r\nThis ensures that travel needs can be accommodated and also that trainees can explore how their own personal skills and attributes suit different educational settings and challenges.\r\n\r\nAll trainees undertake two main placements – the first running from the Autumn term until December and the second, in a contrasting school environment, running from January until late June. These are supported by specially trained mentors and designated Early Career Leaders.\r\n\r\nThere is a comprehensive programme of professional development days, hosted by practicing teachers, that take place in local training venues across North, South, East and West Leeds, Harrogate, Skipton, Richmond and Northallerton. There are also mini placements spread across the year, which give trainees the opportunity to broaden their experience in a range of schools and contexts. \r\n\r\nThe main focus of the course is the in-school placement, which is where trainees spend the majority of their training year. Subject knowledge is supported by expert colleagues from across the partnership of schools as well as sessions delivered by the University and curriculum hubs in the region. These include the Computing hub, STEM learning hub, the English hub and the Maths Hub.\r\n","personalQualities":"\r\n* Passionate about making a difference to the lives and development of young people\r\n* Independent, resilient and adaptable\r\n* Friendly and approachable, with the ability to engage young people\r\n* Enthusiastic about their subject and are continuing to develop their subject knowledge\r\n* Creative and imaginative\r\n* Good organisational skills and excellent time management skills\r\n* Reflective and strive to improve their own practice\r\n* High standards of spoken and written English\r\n* Demonstrate a professional attitude\r\n* Have made a considered and informed decision to train to teach\r\n","otherRequirements":"Experience of being in a school and/or working with young people is not essential, however, it will be beneficial during the application process. You can contact us to arrange experience within a school.\r\n \r\nAdmission is dependent upon satisfactory medical examination conducted by Red Kite's preferred supplier. \r\n \r\nCandidates who are offered a place on the course are required to complete a declaration regarding any criminal convictions. \r\n \r\nCandidates are required to obtain clearance from the Disclosure and Barring Service (DBS) regarding their suitability for work involving children. Successful candidates will have these checks conducted at the expense of Red Kite.\r\n","status":1,"createdAt":"2021-07-06T10:55:11.270Z","updatedAt":"2021-09-30T13:11:19.430Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
