{"id":"163f4429-2b90-4bb5-8320-bd9546470b05","name":"Physics","code":"E955","qualification":"pgce_with_qts","startDate":"2024-07-31T23:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"bf97cd0a-224c-43d3-a021-84143df13e8d","code":"F3","name":"Physics"}],"locations":[{"id":"ab192ffe-3893-4f86-9f77-625366a34b1f","name":"Wigston  Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"cf427f46-c3db-480e-b18d-f1d73a704ec9","name":"Redmoor Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"402085ec-9b64-4d0b-84a4-66f1d82b527e","name":"Thomas Estley Community College","isPublished":"Y","status":"R","vacancies":"F"},{"id":"86df2e88-8193-4de4-815f-912851495f90","name":"Countesthorpe Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"535349d6-f9dc-45b4-90a2-6b040bb5488c","name":"Brockington College","isPublished":"Y","status":"R","vacancies":"F"},{"id":"afc62caa-9d17-4a0d-b7d2-b40103f2bd53","name":"Thomas Estley Learning Alliance","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"bf8e02bc-30d4-4795-89cc-81414fafc908","code":"1R3","name":"Achieve with TELA"},"accreditedBody":{"id":"554ca5b2-7f5a-4a4a-b9a4-956bc1e880de","code":"L33","name":"Leicestershire Secondary SCITT"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"financialSupport":"Bursaries, scholarships and financial support - please check for the most up to date information on 'Get into Teaching' ","aboutCourse":"The Achieve with TELA an established school based programme with a successful track record in teacher training working in partnership with Leicestershire Secondary SCITT.\r\n \r\nYou will learn from current practising teachers, see how every lesson has the potential to change a life and start to develop skills required to start doing so yourself, in your community.\r\n\r\nOur course structure covers the areas you need to feel completely prepared to enter your early career teacher (ECT) classroom. \r\n\r\nYou will cover keys stages 2 to 5 and have an in-depth knowledge of how the practice develops through these age ranges.  \r\n\r\nDuring your training year you will earn both your Qualified Teaching Status (QTS) and Post Graduate Certificate in Education(PGCE) and develop your knowledge of how academic theory underpins your classroom practice. \r\n\r\nThe course is tailored to your needs, while on your two main teaching placements you will have an experienced, supportive subject mentor in school. This approach allows you the time required to embed the theory learned into your practice and explore how an effective teacher utilises cognitive science, pedagogical teaching strategies and experience to refine their teaching.\r\n\r\nAs a school-based provider, you are working with practising teachers modelling the latest effective teaching methods. You are supported, every step of the way. \r\n\r\nIn school, you will be working with your subject mentor and initial teacher training (ITT) coordinator, who ensure you have the exposure required to gain a broad understanding. \r\n\r\nA key feature of our course is the lead subject tutor (LST) role. These are experts within your subject, who work with you to build upon the introductory theory and deliver advanced sessions, really focusing your training on what excellence means, within your subject specialism. In addition to these features, you will also become a full member of the University of Leicester and have access to the full support of this establishment.\r\n\r\nOur core learning programme is delivered by current practising teachers who are experts in their field. The sessions will be delivered in a school from across the TELA Alliance that exemplifies this best practice, meaning that you experience a range of environments, ultimately shaping you into a powerful, impactful and effective teacher.\r\n\r\nTeachers training teachers to change children’s lives in the local community…\r\n\r\n\r\n\r\n","interviewProcess":"Thomas Estley is the lead school and will co-ordinate the recruitment and placement process.\r\nOn receipt of your application, it will be screened to ensure that you met our criteria. \r\nWe are looking for evidence across the following areas:\r\n\r\n* Suitable academic qualifications (refer to entry requirements)\r\n* Experience (paid or voluntary) in an educational-related setting, wider working with children or young people or tell us about your transferable skills.\r\n* A personal statement which shows an ability to reflect on your experiences. Consider how your experiences, skills and achievements provide evidence that you have the potential to be a great teacher. Pay particular attention to reflecting on relevant experience in a way that indicates a capacity for critical reflection and an awareness of key issues in education.\r\n* References, you will require an academic and non-academic reference. (Please refer to the Get into teaching website for more guidance on referees). \r\n\r\nIf your application is successfully you will be invited to a 1/2-day assessment at Thomas Estley Community College. It is a rigorous and thorough process, designed to get the best match of applicant to the places available.\r\nThe day will include:\r\n\r\n* Subject knowledge test\r\n* Classroom observation task\r\n* Group discussion task\r\n* Ten-minute presentation\r\n* Meeting our pupils  \r\n* Staff/ subject panel interview\r\n(Subject to government restrictions - interviews may be held remotely).  \r\n\r\nWe aim to notify you the outcome of your application  within 48 working hrs, providing feedback if you have been unsuccessful. \r\n","howSchoolPlacementsWork":"You complete 5 placements across the year, providing a broad overview of teaching in primary, secondary, sixth form and special educational needs (SEN). Your main two teaching experiences will be in two complementary secondary schools (ages 11 to 16/ 18) from across our alliance. \r\n\r\nEach placement is tailored to meet your needs and you begin teaching when you are ready. Initially, you observe a range of teachers and identify how they deliver effective lessons to a diverse range of students. Following this, you will begin completing some group work and deliver some starters and plenaries with your mentor. When you are ready, you begin team-teaching or delivering your lessons. The build-up is gradual with you teaching 7 lessons by Christmas. By the end of the course, you are delivering 12 lessons. As the course is school-based, you spend much longer in the classroom and develop at a pace that suits you. Our lead subject mentors are also on hand to provide additional support, to help you develop into the teacher you aspire to be.\r\n\r\nThe theory is drip-fed, throughout the year, with you spending 4 days in schools and 1-day learning academic theory. This allows you time to apply and embed your learning before moving on. \r\n\r\nYour subject mentor will guide and support you, as you try new ideas and see what teaching strategies work for both you and your classes. The breadth of placements provides you the opportunities, skills and experience required to become an effective practitioner who changes children’s lives.\r\n","personalQualities":"The Achieve School Direct programme is a challenging course and we aim to recruit the best. We are looking for applicants with a wide range of skills, knowledge and relevant experience as well as a passion for working with young people.\r\n\r\nThis will be demonstrated by meaningful experience of working with young people, being able to develop positive relationships with young people and adults. An ability to listen, be sensitive, work collaboratively and respond to the needs of others are all crucial.  You will need to be able to express your ideas confidently both orally and in writing.\r\n","otherRequirements":"All trainee students will be subject to enhanced disclosure from the Criminal Records Bureau","status":1,"createdAt":"2021-07-12T13:48:17.726Z","updatedAt":"2021-09-14T08:12:54.606Z","canSponsorStudentVisa":"no","cycle":"2024"}
