{"id":"61e369cc-de6a-4b8d-a209-ac44dabfd357","name":"Primary","code":"2NYH","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"afc62caa-9d17-4a0d-b7d2-b40103f2bd53","name":"Thomas Estley Learning Alliance","isPublished":"Y","status":"R","vacancies":"F"},{"id":"9d07996c-a75e-4abd-b862-2d34a2a09364","name":"Arnesby School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"5c40ef7b-4403-4267-8976-f867313aca03","name":"St Simon & St Jude Church of England Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"cd10bd51-b022-49d6-b3d2-a25442f4a672","name":"St Peters Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"4e636042-b195-4b52-9761-09237d9dc9a6","name":"Townlands C of E Primary Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"43d24794-4fc0-410b-877c-1b17fea23ea0","name":"Richmond Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"d200901c-3078-4242-b6d3-2373a85dc1c8","name":"Hallbrook Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"fd637b33-fc7c-4608-883a-ba40e7f1bf3d","name":"Ullesthorpe Church of England Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"d77737d4-6d87-497c-b224-fdbb4f51808e","name":"Badgerbrook Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"346100f1-8127-48a6-9ff5-5f5fd174c31a","name":"Cosby Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"64f13d27-96e7-4c9c-969b-8e9a1518c788","name":"Sketchley Hill Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"281fe5d6-7c29-41db-a1cd-5b45a0c0b259","name":"Westfield Junior School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"d875084c-865d-4648-be0f-745715dd798d","name":"Thythorn Field Community Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"1ece8d24-527c-4eaa-9d8c-08bb32f2e7cb","name":"Barwell Church of England Academy","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"bf8e02bc-30d4-4795-89cc-81414fafc908","code":"1R3","name":"Achieve with TELA"},"accreditedBody":{"id":"3e6c62a3-5d34-4a91-9c23-01c7409fd909","code":"L34","name":"University of Leicester"},"profPost":"BO","degreeGrade":"0","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"financialSupport":"You'll pay the University tuition fees but you might be eligible for funding through tuition fee loans, bursaries or scholarships.\r\n\r\nPlease check the University website for confirmation on their tuition fees and support available. The Get into Teaching website will contain the most up to date information on bursaries or scholarships that are available.\r\n","aboutCourse":"The Achieve with TELA school direct programme is an established programme with a successful track record working in partnership with University of Leicester and other School Direct partners. \r\n\r\nThe course structure during your training year is split between time at university, with school direct delivery partners and three high quality teaching placements over two schools. During your school placement you will have an experienced, supportive mentor in school and cover teaching practice across the varied age ranges. \r\n\r\nYou will also be part of the Achieve Primary Network sessions that run during your school placements and are led by a primary Head Teacher from TELA alliance. \r\n\r\nTaught sessions are with school direct partners for the Maths and English strands and are delivered at the university by current practising  subject specialist teachers from our schools, they will  link theory  with practice. University specialist deliver the other primary stands and prepare you for completion of your assignments. All these sessions introduce you to the principles and theory of good teaching practice in preparation for your teaching placements.\r\n\r\nYou will be required to select a specialism at the beginning of your course. In addition to maths and lower primary, other options may include inclusion, science, and English (subject to availability) \r\n\r\nThroughout the course you’ll be supported by a personal tutor who’ll meet with you regularly to provide guidance, as well as monitoring your progress. On each of your teaching placements, you’ll also be supported by a visiting university tutor whose role is to ensure things run smoothly and that you have the best possible experience.\r\n\r\nYour progress will be assessed throughout the course by your personal tutor, school-based mentors and other University tutors.\r\n\r\nYou’ll also be required to complete two, 5,000 word written assignments. These are closely linked to the time you’ll spend in school and require you to reflect critically on your experience and learning during your placements.\r\n\r\nAll students on our PGCE course begin on the Masters-level route. Depending on your attainment in the written assignments, you’ll graduate with one of two awards:\r\n\r\n* Postgraduate Certificate in Education, which provides 90 Level 7 Masters credits.\r\n\r\n* Professional Graduate Certificate in Education, which does not carry Masters level credits.\r\n\r\nFor students who meet the assessment criteria, both qualifications lead to recommendation for Qualified Teaching Status (QTS).\r\n\r\nTraining teachers to change children’s lives in the local community…\r\n","interviewProcess":"Interviews will be held in one of the alliance primary school. Thomas Estley Community College is the administrative hub for primary and secondary School Direct  and will co-ordinate the recruitment process.\r\n\r\nOn receipt of your UCAS application, it will be screened to ensure that you met our criteria. We are looking for evidence across the following areas:\r\n\r\n* Suitable academic qualifications (refer to entry requirements)\r\n* Experience (paid or voluntary) in UK schools or educational-related settings, or in wider working with children or young people environment or how your skills are transferable to working with young people.\r\n* A personal statement which shows an ability to reflect on your experiences. Consider how your experiences, skills and achievements provide evidence that you have the potential to be a great teacher. Pay particular attention to reflecting on relevant experience in a way that indicates a capacity for critical reflection and an awareness of key issues in education. \r\n* References, you will require an academic and non-academic reference. Please refer to the see the Get into teaching  website for more guidance on suitable referees. \r\n\r\nIf your application is successfully you will be invited to an assessment at an Alliance primary school. It is a rigorous and thorough process, designed to get the best match of applicant to the places available.\r\nThe day will include:\r\n\r\n* Classroom observation task\r\n* Fifteen -minute presentation\r\n* Staff panel interview\r\n\r\nIf successful at the school assessment we will recommend you for a further interview at the University.  \r\n","howSchoolPlacementsWork":"School placements are three high quality teaching placements over two schools covering the primary age range. Your teaching experience in the autumn, spring and summer terms will be preceded by blocks of time at the university.  \r\n \r\nDuring your school placements you will have an experienced, supportive mentor in school along with the support from Achieve and the University.\r\n\r\nWere possible we will tell you which schools your placements are in prior to you starting the course. This gives you the opportunity to visit your placement schools and meet the teams you will be training with before you start your placement. If you have a preference for a placement in one of our alliance schools, please do let us know and if we can we will try to accommodate your request, subject to availability. \r\n\r\n","personalQualities":"The Achieve School Direct programme is a challenging course and we aim to recruit the best. We are looking for applicants with a wide range of skills, knowledge and relevant experience as well as a passion for working with young people.\r\n\r\nThis will be demonstrated by meaningful experience of working with young people, being able to develop positive relationships with young people and adults. An ability to listen, be sensitive, work collaboratively and respond to the needs of others are all crucial.  You will need to be able to express your ideas confidently both orally and in writing.\r\n","otherRequirements":"All trainee students will be subject to enhanced disclosure from the Criminal Records Bureau","status":1,"createdAt":"2021-07-06T10:48:20.244Z","updatedAt":"2021-09-14T08:14:49.306Z","canSponsorStudentVisa":"yes","cycle":"2024"}
