{"id":"f514b1bd-667e-4c5c-96f4-1be0ec52022b","name":"Primary","code":"2YX2","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"f0f0507f-69bd-4c83-a321-889a47d5951a","name":"Main Site - Engayne Primary School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"4ec36a25-573c-4b65-a56c-137da4d16558","code":"178","name":"Havering Train2Teach"},"accreditedBody":{"id":"de0e702b-b19b-4594-b433-aa49be29f4d9","code":"H40","name":"Tes Institute"},"profPost":"PG","degreeGrade":"1","english":"2","maths":"2","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We offer equivalency tests in English, Maths and Science.  The cost is approximately £75.00, this will have to be paid before taking the equivalency test.","courseLength":"OneYear","feesUK":8625,"feeDetails":"Course Fees\r\n\r\n£8,625 ITT - QTS only\r\n£9,250 ITT - PGCE and QTS\r\n\r\n\r\n","financialSupport":"Payment options may also be available on request but an additional administration fee may apply.\r\n\r\nStudent Loans \r\nYou may be able to apply for a tuition fee loan and/or a living cost loan or grant through the Student Loans Company to help with costs associated with the programme.\r\nTo find out more about these loans and grants visit: getintoteaching.education.gov.uk/funding-and-salary/overview/postgraduate-loans","aboutCourse":"Our teacher training programme is run over a one-year period within schools in partnership with the TES Institute. The one year course is delivered with a mix of in-school experience, online learning, tutor support and in-school mentor support.\r\n\r\nWhy chose our TES institute course?\r\n\r\nThe TES institute programme is a unique opportunity to work as a member of a school team and learn about teaching from dedicated, experienced professionals in schools. Your practical teacher training will be supplemented by high quality online learning sessions written by practising teachers and academics from the world of education.\r\n\r\nTES Institute’s School Direct ITT programme will allow you to:\r\n\r\nWork in a school alongside teaching professionals, learning from experienced practitioners as part of a team\r\nTrain to prepare and deliver your own lessons and in time, take shared responsibility for your own classes\r\nGain contrasting experience in a second partnership school\r\nAccess supporting online study sessions 24/7 that focus on the theory and practice of teaching and learning\r\nBenefit from the support of an in-school mentor and a TES Institute pathway tutor to guide and facilitate effective progress towards QTS\r\nBe part of a network of School Direct partnership schools\r\nGain QTS with an option to add PGCE\r\nIncrease your subject knowledge with online Subject Knowledge Enhancement (SKE)","interviewProcess":"Once your application is received on UCAS and references received,  we will contact you to invite you to a selection/interview morning or afternoon.  This will consist of a mixture of a 5 minute presentation (the topic of which will be given to you prior to the day) followed by an interview, some time in the classroom and a 30 minute written test. ","howSchoolPlacementsWork":"If selected, a primary school (your home school) within Havering  will be chosen based on your skill set and preferences you give at the interview stage.  During term 2, you will have a second placement at a different primary school in the opposite key stage to which you have chosen.  This ensures that by the end of the course you are confident and capable of teaching all ranges within a primary school setting. You also have a one day placement at a special needs school and a two day placement at a secondary school, again all within Havering.","personalQualities":"Have the appropriate qualities, attitudes and values expected of a teacher.\r\nHave the ability to demonstrate English language proficiency (reading, writing and speaking)\r\nHave sufficient knowledge to pass the Professional Skills Tests by the time you enrol on a programme – Information on the professional skills test required for all prospective teachers – http://sta.education.gov.uk/\r\n\r\n\r\n","otherRequirements":null,"status":1,"createdAt":"2021-07-06T10:47:09.885Z","updatedAt":"2021-07-22T08:18:32.945Z","canSponsorStudentVisa":"no","cycle":"2024"}
