{"id":"2be355a3-cebd-4397-8f84-78109aa818fc","name":"Physics","code":"2FRM","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"bf97cd0a-224c-43d3-a021-84143df13e8d","code":"F3","name":"Physics"}],"locations":[{"id":"c8a72766-be08-470f-8000-9174f7d1e120","name":"Meopham School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"875a069c-6268-4647-8779-8c57c967ed0c","name":"Westlands School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"cc44675b-905c-4bfd-bdb1-0eb47678103e","name":"The Holmesdale School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"96d04bd6-9826-4863-8996-b4a213d03e56","code":"14H","name":"Swale Academies Trust"},"accreditedBody":{"id":"1165d5fd-11f4-4dab-99c9-47b309481463","code":"C10","name":"Canterbury Christ Church University"},"degreeGrade":"1","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Arrangements and funding for any equivalence test are the responsibility of the candidate.","courseLength":"OneYear","feesUK":null,"aboutCourse":"Professional Learning Days\r\n\r\nThese are whole day sessions where the basics of teaching and learning are presented and good practice shared.  You will be trained at our dedicated training facility and the training will be delivered by our own expert staff who have been accredited by Christ Church University.  These sessions cover topics such as Lesson Planning, Behaviour Management, AEN and Inclusion and Theories of Learning.\r\n\r\nTrainees will also attend approximately fifteen additional Subject Days, delivered at Canterbury Christ Church University.\r\n\r\n\r\nPedagogy in Practice\r\n\r\nThese are weekly half day Professional Studies sessions where the theories presented during the Professional Learning Days are put into practice.\r\n\r\n","interviewProcess":"Westlands School is the lead school within the Trust and will be co-ordinating the recruitment process.  Applicants for positions at other schools within the Trust will be given the opportunity to visit the relevant school.\r\n\r\nA rigorous selection procedure is in place.  This will involve a day spent at the school.  Applicants are required to undertake a number of tasks during the day including:\r\n\r\n* an introduction to School Direct within the Trust\r\n* tour of the school(s)\r\n* a meet the pupils session\r\n* brief literacy and numeracy tests if Skills Tests have not already  been successfully completed\r\n* a delivery of short subject based task to a group of pupils\r\n* formal interview\r\n\r\nAll offers will be ratified by and made through Canterbury Christ Church University.","howSchoolPlacementsWork":"Wider Professional Practice\r\n\r\nA four week contrasting placement will be arranged for each trainee.  In addition, an alternative stage placement of one week's duration is arranged. \r\n\r\nVisits to other schools can be set up to provide wider experience.\r\n","personalQualities":"Our trainees will: \r\n\r\n*have a real desire to work with young people and help them realise their potential\r\n*be enthusiastic about their subject\r\n*have high expectations\r\n*have effective written and oral communication skills\r\n*be dedicated and prepared to work hard\r\n*be resilient\r\n*be a team player\r\n*be able to work independently\r\n*realise the importance of meeting deadlines\r\n*be open to new ideas\r\n*be willing to review personal progress\r\n*be able to reflect on strengths and areas for development\r\n*have excellent organisational skills\r\n*have a sense of professionalism.\r\n","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:53:56.050Z","updatedAt":"2021-09-21T14:34:39.878Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"Trainees will be paid on Unqualified Teachers' Pay Scale, Point 1.  \r\n\r\nAll trainees will work towards Qualified Teacher Status (QTS) which is funded by the employing school.\r\n\r\nThere is further opportunity to undertake Post Graduate Certificate in Education (PGCE) with Masters Credits.  This will be funded by the trainee.\r\n\r\nAll of our pathways are accredited by Canterbury Christ Church University.\r\n\r\n"}
