{"id":"92b55fb5-5b10-47a1-b13c-26720bc52f0a","name":"Biology","code":"3BPZ","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"322cfc19-d51d-45db-91e3-bd7b4738470f","code":"C1","name":"Biology"}],"locations":[{"id":"773b7a88-a8b1-461e-bb60-def95ef33a56","name":"The Eastbourne Academy","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"96d04bd6-9826-4863-8996-b4a213d03e56","code":"14H","name":"Swale Academies Trust"},"accreditedBody":{"id":"d2ba71f2-c125-4d86-bb22-736e67043120","code":"B72","name":"University of Brighton"},"degreeGrade":"1","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Arrangements and funding for any equivalence test are the responsibility of the candidate.","courseLength":"OneYear","aboutCourse":"Trainees will work as unqualified teachers in one of the schools within our teaching school alliance.  We work in partnership with University of Brighton and University of Sussex and both QTS and PGCE pathways are accredited by the Universities.\r\n\r\nWe recognise that trainees come with varying levels of previous school experience and our training is therefore tailored to the individual.  For example, those who have plenty of relevant classroom experience will have the opportunity to begin teaching whole classes early on in the programme.  Those with less relevant experience will receive more guidance at the start of the course, to build a firm foundation on which to base their classroom practice.  We believe that it is important for trainees to have sufficient time to work with more experienced staff and mentors, in order to develop high-level skills before being given full responsibility for classes. \r\n \r\nHow it works\r\n\r\nTrainees will receive at least 60 days (or equivalent) training during the year provided by either University of Brighton or University of Sussex. In addition, we provide a variety of school-based training activities, which include lesson observations in both the chosen subject area and other areas of the curriculum. Trainees are expected to attend staff meetings and INSET training days hosted by their school, and to engage with additional training or professional development as identifed by their mentor.\r\n\r\nCourse Training Content\r\n\r\nInduction Day\r\nThis is a valuable opportunity for trainees to meet the School Direct Team, fellow trainees and to learn about the training in detail.\r\n\r\nTrainees will be given detailed information regarding the training schedule for the year.\r\n\r\nSubject Days\r\nTrainees are released to attend Curriculum Days delivered at your chosen University. For further information please contact the universities directly. \r\n\r\nPedagogy in Practice\r\nThese sessions where the practical implications of theories presented during the Professional Learning Days are further explored\r\n\r\nWider Developing Practice\r\nThese are specific tasks that are completed at set times to reinforce and practise what is taught during the Professional Learning Days and the Pedagogy in Practice sessions.\r\n\r\nWider Professional Practice\r\nA four-week contrasting placement will be arranged for each trainee.  In addition, an alternative stage placement of one week's duration is arranged.  Visits to other schools can be set up to provide wider experience","interviewProcess":"If your application submitted is successful, we will invite you for an interview and assessment day at your chosen school.\r\n\r\nProgramme of the day:\r\n\r\nIntroduction presentation\r\nTour of the School\r\nDelivery of teaching task (you will be provided with time to prepare this task prior to the lesson)\r\nSubject-based discussion to identify subject knowledge\r\nFormal Interview\r\n\r\nThis is subject to change according to school/position applied.","howSchoolPlacementsWork":"Trainees will be part of a whole school community where they will be immersed in everyday school life.  Each trainee will be supported by a subject mentor. This will be an experienced teacher, who will guide and support them in their development to become a successful teacher.  \r\n\r\nThere will also be a professional mentor who will oversee the training of all trainees within their school and can provide additional support.   \r\n\r\nTrainees will be based in the same school for the duration of their training, but there will be a second contrasting placement arranged in January so that all trainees are able to teach in a different school environment and broaden their experience further. There will also be additional contrasting experience days in the opposite phase so that each trainee gains an overview of both Primary and Secondary school life.\r\n\r\nBeing a trainee with Swale Academies Trust - East Sussex ITE will provide a network of fellow trainees across our East Sussex Schools. This means an instant connection with 5 other schools in the area, plus a connection with trainees in our Kent Hub, a group of 10 schools. The Trust uses a common platform to host email and to work collaboratively on. Trainees will gain access to this incredibly useful resource.\r\n","personalQualities":"We are seeking people who are passionate and highly motivated. We need people who are ambitious for children and are ready to help them reach their true potential, who will believe in them and will help to challenge and support so that all children, no matter their starting point, can achieve. In addition, the most effective teachers will also have an empathetic relationship with their class, and will provide care and nurturing where required.\r\n\r\nWell organised, self driven and creative individuals, with excellent computing skills including the use of virtual learning platforms such as Google Classroom are highly sought after.","otherRequirements":"We are committed to safeguarding and promoting the welfare of children and young people and expects all staff to share this commitment. School Direct positions are subject to an enhanced DBS check.\r\n\r\nSchool Direct Salaried Positions\r\nApplicants for a salaried position should have a minimum of three years full time work experience, which may be in any career, and does not have to be in an educational setting.\r\n","status":1,"createdAt":"2021-07-06T10:53:56.921Z","updatedAt":"2021-09-23T11:06:04.666Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"Salaries will be paid to salaried trainees on the Unqualifed Teacher Pay Scale.\r\n\r\nFees?????"}
