{"id":"72af78a0-04b5-4285-a8d5-74d510502513","name":"Primary","code":"267W","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"66faa0d9-ff96-4045-86c0-13ca7becc0b2","name":"Kelsall Primary School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"1751c254-9181-4287-80bb-eada4bf05068","code":"144","name":"Cheshire Leadership & Teaching Alliance"},"accreditedBody":{"id":"e843cb68-d310-478c-8dba-cf9633fea086","code":"C55","name":"University of Chester"},"profPost":"BO","degreeGrade":"1","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"Candidates must organise and pay for equivalent tests themselves.","courseLength":"OneYear","feesUK":9250,"feesInternational":9250,"feeDetails":"Candidates can apply to Student Finance England for a tuition fee loan to be paid on their behalf. Candidates may be eligible for a maintenance loan and/or grant dependent upon their circumstances. \r\n\r\nPlease check DFE and University of Chester websites for details on loans and bursaries.","financialSupport":"The course is non-salaried.","aboutCourse":"Our School Direct Programme is an exciting school based training route for graduates interested in primary school teaching.\r\n\r\nWorking in partnership with the University of Chester we deliver Initial Teacher Training (ITT), leading to accreditation for the Post Graduate Certificate of Education (PGCE) with Qualified Teacher Status (QTS).This course is designed to provide you with the knowledge, understanding and skills that you need to be an outstanding primary teacher.\r\n\r\nThe programme consists of 130 school based learning days across 2 schools,40 training days to improve subject knowledge across the curriculum/professional skills and 15 academic learning days led by The University of Chester. \r\n\r\nEach Associate Teacher will be allocated an experienced Professional Mentor to guide and support them through the programme, ensuring they set high standards for themselves and the children they teach.\r\n\r\nThe CLTA QA Mentor Lead will also meet and observe ATs each half term. \r\n\r\nFinally, the University of Chester will appoint a University Link Tutor/Personal Academic Tutor for further support and guidance.\r\n\r\nLater in the year, we help with the NQT job application  process and interview techniques. Many of our ATs secure jobs before the completion of the programme in the summer term. \r\n\r\n\r\n","interviewProcess":"Interviews take place at Kelsall Primary School.\r\n\r\nA typical interview involves:\r\n\r\n* A learning activity with a group of children\r\n* A five minute presentation\r\n* A formal interview\r\n\r\nIf you are successful, an offer will be made. This offer will be conditional on successful completion of any qualifications, DBS and medical checks.","howSchoolPlacementsWork":"Associate Teachers are allocated a \"home\" school where they will be placed for the autumn and summer term. For the spring term they will move to a contrasting placement school to gain experience in another setting and key stage.\r\n\r\nBy the end of the academic year ATs will have experience in both KS1 and KS2 classes. \r\n\r\nATs are also required to spend 5 days in a EYFS and KS3 setting.  \r\n\r\nWe always consider travel time from home to school and ensure placement schools are within a reasonable travel distance. ","personalQualities":"*Friendly, approachable and have a positive outlook\r\n*Excellent organisation and time management skills\r\n*A passion for teaching and learning   \r\n*A creative and innovative approach\r\n*The ability to reflect on and develop good practice\r\n\r\nTeaching is a challenging career so dedication and resilience is of upmost importance.  \r\n","otherRequirements":"Experience working in a primary school setting or with children is desirable but not essential.\r\n","status":1,"createdAt":"2021-07-06T10:53:53.406Z","updatedAt":"2021-10-05T13:05:09.130Z","canSponsorStudentVisa":"yes","cycle":"2024"}
