{"id":"8ae7d759-7490-4e30-95b8-a62094e22cd1","name":"Physical Education","code":"27FH","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"74d64a54-5e34-4590-b6c7-528dd0cf26fe","code":"C6","name":"Physical education"}],"locations":[{"id":"fce6b46d-f048-4d6c-9882-76525572c8f3","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"078ba230-ae52-47e5-a049-49061f3cdb48","code":"1UU","name":"Liverpool College Teaching Partnership"},"accreditedBody":{"id":"e328aab3-a535-4921-8ded-5e37133c76dd","code":"L46","name":"Liverpool Hope University"},"profPost":"BO","degreeGrade":"0","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Use a third party to complete.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Our trainees will have two placement schools - Liverpool College or Birkdale High School. You will spend September - February half term in one school and then the rest of the year in the contrasting school. This gives you the chance to form strong links with both staff and pupils in both placements, so that you are genuinely part of the school community. \r\n\r\nLiverpool College is a state funded academy which educates boys and girls  aged 4-19 on a 28 acre campus in South Liverpool. Since 1840, the schools intent is to empower the young people of Liverpool and beyond to fulfil their dreams by delivering a transformational and exceptional education.\r\n\r\nBirkdale High is the only 11-16 all-boys academy in Sefton and aims to be a beacon for outstanding practice in the education of boys. Birkdale High are specialists in the education of boys and firmly believe that this gives them the opportunity to create a unique environment that enables students to develop their full potential both academically and personally, free from many of the gender based prejudices that so often put pressure on young men.","interviewProcess":"Either Liverpool College or Birkdale High will lead the interview. Trainees will be invited to interview at one of the schools where you will undertake a 20 minute observation, an interview with subject specialists, a tour of the school and an opportunity to speak to current trainees and mentors and finally a literacy assessment. \r\n\r\nFor more information, please contact Mrs S Lines (Assistant Principal Liverpool College):slines@liverpoolcollege.org.uk","howSchoolPlacementsWork":"There are several schools within the alliance from around Liverpool. The main two schools are Liverpool College and Birkdale High School. We aim for all trainee's to experience two contrasting schools such as a mixed school and a all boys or girls school. ","personalQualities":null,"otherRequirements":null,"status":1,"createdAt":"2021-07-12T13:48:12.326Z","updatedAt":"2021-09-16T11:33:42.633Z","canSponsorStudentVisa":"no","cycle":"2024"}
