{"id":"0a065509-3301-45f0-aab2-7fb3555ca034","name":"Biology","code":"2T42","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"322cfc19-d51d-45db-91e3-bd7b4738470f","code":"C1","name":"Biology"}],"locations":[{"id":"a5f9a4c9-36c6-4519-8cf5-af8073f121a2","name":"South Birmingham SCITT","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"dada1360-37b9-4343-832c-cbad314dfe77","code":"19Q","name":"Colmore Partnership Training School Alliance"},"accreditedBody":{"id":"604f32f0-887f-4243-9e5d-addaec552b5e","code":"N32","name":"South Birmingham SCITT"},"profPost":"PG","degreeGrade":"2","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"As a guide we would expect to see 50% of your degree and/or A Levels that you took to be relevant to the subject in which you're applying\nPlease note that all applications are individually assessed","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"financialSupport":"Funding is available to help you train to teach \r\n(https://getintoteaching.education.gov.uk/funding-your-training)\r\n\r\nYou can apply for the following:\r\n\r\ntuition fee loan of up to £9,250 (you do not need to pay course fees upfront)\r\nmaintenance loan of up to £12,382 (help with living costs)\r\nYou can still apply for a tuition fee and a maintenance loan if you already have a student loan.\r\n\r\nYou will only have to make loan repayments once you’re earning.","aboutCourse":"Please visit our website www.cptsa.co.uk for further information. \r\nFor a map of the whole partnership, please visit www.southbirminghamscitt.org.uk\r\n\r\n* Full time course running from September 2022 to July 2023\r\n\r\n* 1 day a week in Professional Studies training at our Solihull campus\r\n\r\n*  4 days a week on placement in school starting in early September. Autumn, Spring and Summer Placements\r\n\r\n*Placement schools are carefully selected allocated primarily upon the location of the trainee\r\n\r\n* Professional Studies includes subject pedagogy, research and reflective practice, routines and behaviour, teaching and learning strategies, meeting all childrens' needs, the importance of assessment, understanding of the wider educational context\r\n\r\n* Trainees become reflective practitioners with specific targets to move their practice forward\r\n\r\n* Weekly reflection of teaching practice collates evidence against the Teacher Standards to be awarded Qualified Teacher Status (QTS)\r\n\r\n* 4 research assignments (3000 words each) - Nov, Feb, May and Oct submissions\r\n\r\n* 80 Level 7 Credits towards a Masters in Teaching and Learning (this is more than a PGCertEd)\r\n\r\n* Ongoing early career development including the opportunity to complete the PGDip Ed at the end of the NQT year and the full Masters in subsequent year (s)\r\n\r\n* Career support from day one. We offer mock interviews, support with application forms and job opportunities\r\n\r\n * Expert support via School Based Trainers, Professional Tutors, Subject Tutors, Ex Trainees and BCU tutors - and cohort peers !\r\n\r\nOur programmes are all the same whether they are through the Colmore Partnership Training School Alliance or the South Birmingham SCITT\r\n\r\nCourse Fees\r\n\r\n* £9250 tuition fee - you may be eligible for a student loan\r\n\r\n * Subject dependent training bursaries may be available","interviewProcess":"Apply to us through www.gov.uk/apply-for-teacher-training. We aim to respond to you within 48 hours\r\n\r\nInterview and Assessment Process\r\n\r\n*Delivery of a  20 minute pre planned learning activity showing the intended impact on students followed by a written reflection\r\n\r\n*Formal panel interview\r\n\r\n*Subject Knowledge Baseline (to enable us to identify any specific gaps in knowledge)\r\n\r\n*Baseline  Numeracy and Literacy assessment. (To inform us of support needed to ensure fundamental skills are in place) These will be carried out during the course as well\r\n \r\n*  5 minute presentation about yourself and something you are passionate about\r\n\r\nYour interview will take place in one of our Partnership Schools (but not necessarily the school you will be placed in) or on Microsoft Teams\r\n\r\nYou will have the opportunity to meet School Direct Leads, the SCITT Course Manager/Director and colleagues from within the partnership. \r\n\r\n* You will be informed of our decision within 48 hours\r\n\r\n* Verbal feedback will be given, even if you are not successful","howSchoolPlacementsWork":"School placements are based on two factors. The first is the home address of the trainee. We want to ensure that your travel time is accessible and not too time constraining. The second is the availability of a partner school in your location. Travel time will be no more than 1 hour from your home\r\n\r\nA map of all the Partnership Schools can be found on our website\r\nwww.southbirminghamscitt.org.uk. We have Primary Schools and Secondary Schools to choose placements from.\r\n\r\nYour journey time would once again be our top consideration\r\n\r\n","personalQualities":"We look for a whole range of personal qualities in our trainees including\r\n* Resilience\r\n* Enthusiasm\r\n* Passion\r\n* Dedication\r\n* Reflective practice\r\n* Organised\r\n*Professional\r\n*Patience\r\n*Sense of humour","otherRequirements":"If you studied outside of the UK, you will need to visit NARIC (www.naric.com) as a certificate of proof for equivalence will need to be attained\r\n\r\nWe do not expect you to have school experience upon application. If you would like to gain some experience in school, please get in touch\r\n\r\nMore details can be found on our website (www.cptsa.co.uk)\r\n\r\nA condition of your offer will be the successful completion of all Safeguarding procedures\r\n\r\nYou will be asked to complete an Occupational Health Questionnaire","status":1,"createdAt":"2021-07-12T13:49:44.869Z","updatedAt":"2021-09-30T10:18:45.667Z","canSponsorStudentVisa":"no","cycle":"2024"}
