{"id":"8aa81350-b95c-4f3c-b19e-5968dab6d8b8","name":"Primary","code":"K759","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"3_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"86a70d2f-3ff8-45d9-80f7-6bfcb274a3d0","name":"Tollgate Primary School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"fce142fe-a2a1-4f4d-b2db-2e508280e68f","code":"24M","name":"London District East SCITT"},"accreditedBody":{"id":"fce142fe-a2a1-4f4d-b2db-2e508280e68f","code":"24M","name":"London District East SCITT"},"degreeGrade":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Please see our website for details. \nwww.londondistricteast.org","courseLength":"OneYear","aboutCourse":"This course is a Primary course for EYFS/ Key Stage One (3-7)   Key Stage One and Key Stage Two (5-11)  Our vision is 'Making a real difference to children's life chances.' This salaried course has limited places.\r\n\r\nAs a partnership of schools in East London, we work together to recruit and train excellent teachers, who are inspired and equipped to continue to develop their teaching and leadership skills throughout their careers.\r\n\r\nThe course aims to:\r\n-To train excellent teachers who ensure that all pupils in their classrooms make rapid and sustained progress\r\n-To develop a strong workforce for our local schools\r\n-To employ and retain qualified teachers in the local area through outstanding training and tracking of provision through their Initial Teacher Training (ITT) year and their Early Career Teacher (ECT)  year.\r\n-Proved access to outstanding quality and professional development for potential teachers\r\n\r\nThe course ensures that the trainee develops an understanding of the 5 areas of the Initial Teacher Training (ITT) Core Content Framework: Behaviour Management, Pedagogy, Curriculum, Assessment and Professional Behaviours.  The training includes a critical evaluation of theory, research and practice delivered by current practitioners who ensure the course reflects on implications in the classroom at all times. \r\n\r\nThe course covers all subjects in the curriculum and builds up to teacher 3 days a week with the equivalent of a day out for planning and preparation and self study. There will also be a day for training to support practice in the classroom. ","interviewProcess":"All applicants who submit an application that meets the London District East requirements, as set out in the application scrutiny process, will be invited to interview day 1. On receipt, applications are viewed within a week. You will be interviewed by a panel of senior leaders and all details of the interview will be sent to you in advance. \r\n\r\n Candidates are encouraged to advise us of any Special Needs prior to the Interview days.\r\n\r\nIf you are successful at day 1, you will be asked to go to another informal interview at a school that would like to sponsor a trainee teacher.  You will have to be successful at both stages in order to get onto the course. ","howSchoolPlacementsWork":"As a partnership of schools, we work together to recruit and train excellent teachers, who are inspired and equipped to continue to develop their teaching and leadership skills throughout their careers.We work with outstanding schools to develop a school led programme to meet the requirements of the Teacher’s Standards. These schools are usually within our Trust and London District East Teaching School Hub,  but we welcome all schools who would like to work with us. \r\n\r\nYou will have a main placement school and then in the Spring Term (6 weeks) complete a contrast placement in another school, in a different key stage.  You will also get opportunities to experience, a specialist provision and a Secondary School to look at how pupils progress from KS2 to KS3. \r\n\r\nWe will select the schools for you based on your experience,   interview and commuting distance. Many of our schools have worked with us previously and we have excellent partnerships with them. You may come with a school that may be interested in sponsoring you and this will be asked at interview. The commute is usually between 30 minutes and an hour, sometimes shorter. ","personalQualities":"We are looking for applicants who have the passion to become a Primary School Teacher. Applicants who are confident,  resilient and willing to learn and work hard. We will support you to develop these skills and learn more. \r\n\r\n","otherRequirements":"We recognise that not all applicants will have worked in schools before, we can support you to gain some experience before you make your big decision. Presently we are unable to do this due to risk assessments. However, we would still encourage you to apply. ","status":1,"createdAt":"2021-10-08T13:24:33.120Z","updatedAt":"2021-10-13T14:56:46.398Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"Salaried trainees applying for the QTS will be employed and paid for by their sponsor school. This is usually as an unqualified teacher.  As such it is expected that you will stay with the school during your ECT induction of 2 years. "}
