{"id":"9c7c5ef2-10c4-4b14-84d2-d75b765435a5","name":"Primary","code":"393L","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_7","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"056f9c0f-dcbb-4fb4-b8fe-3aca47b895bf","name":"The West Park Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"fd0eb7c8-68cb-4d5c-aacc-0bd33906143f","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"},{"id":"55f98927-a192-4b82-ad8f-8e2874b6f363","name":"The Parkgate Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"bf20155a-25d7-42b6-87aa-0262bfbc27ae","name":"The Marton Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"bf2b318e-cf82-4393-abca-f53741ca73fb","name":"The Python Hill Academy","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"fb861907-5da9-4a29-9187-711d5d700bf8","code":"2GK","name":"The Forge Trust"},"accreditedBody":{"id":"1d95b6cb-0e08-4485-848a-0e304d71102a","code":"B38","name":"Bishop Grosseteste University"},"profPost":"BO","degreeGrade":"1","english":"1","maths":"1","science":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feesInternational":12500,"feeDetails":"Not Applicable","financialSupport":"The Forge Trust currently only offers non salaried places.\r\n\r\nFor further information on Financial Support that is available please follow the link  https://www.bishopg.ac.uk/fees-funding/ \r\n\r\n","aboutCourse":"School Direct with the Forge Trust leads to a Post Graduate Certificate in Education (PGCE).  The course prepares you to teach children in the 3 to 7 age range as a general primary teacher.   The course is a very practical one with the majority of time spent in one of our academies.  Each student will spend the majority of the autumn term in their \"base\" academy\" initially observing high quality teaching, supporting groups and individuals before progressing to teaching the whole class.  \r\n\r\nIn the spring term, students are given an alternative placement in a different academy in the trust.  As a small trust we are able to involve potential students in the selection of placement academies to try to ensure we achieve a successful match for the candidate.  For the final placement our students usually return to the base academy, to teach the class they started out with.\r\n\r\nIn the autumn and spring terms students spend four days in school and one day at university.  In addition to this we offer a  bespoke training programme, and release time for half a day per week for directed study.  Our students routinely report that our training offer is a huge positive for our trust with a range of outstanding teachers delivering tailored teaching on the issues that really matter!  A further benefit of School Direct with the Forge Trust is the programme of enrichment that we offer with opportunities to spend time in academies across the trust includeing pre-school units.  We also have also previously been able to arrange enrichment in a special school we have links with. During the summer term students teach for 80% of the time and their time is entirely focused on their placement academy.  Throughout the programme we offer sensitive support and development through our experienced mentors who have a thorough understanding of the challenges of Initial Teacher Training and a willingness to provide practical tips and advice.","interviewProcess":"The interview includes a writing task, maths test and interview. Ahead of the interview you will be given the opportunity to research areas for an informal presentation and question and answer session.  Interviews are usually conducted by Carl Braithwaite and Jamie Macintyre who both work across the trust.  \r\n\r\nThere is just one interview for this course and it will take place in one of our academies.  We endeavour to inform all candidates of the outcome on the day of the interview.  Our academies are all very accessible and we work flexibly to meet the needs of all applicants.  \r\n\r\nThe interview includes a writing task, maths test and interview. Ahead of the interview you will be given the opportunity to research areas for an informal presentation and question and answer session.  Interviews are usually conducted by Carl Braithwaite and Jamie Macintyre who both work across the trust.  \r\n\r\nThere is just one interview for this course and it will take place in one of our academies.  We endeavour to inform all candidates of the outcome on the day of the interview.  Our academies are all very accessible and we work flexibly to meet the needs of all applicants.  \r\n\r\nOur interview will also include an informal element with opportunties to learn about the trust and our academies as well as to ask questions.  Opportunties to visit our academies are available subject to the covid guidance current at the time.  \r\n","howSchoolPlacementsWork":"The Forge Trust is a partnership of six schools in the East Midlands with schools in the Mansfield, Newark, Worksop and Gainsborough areas.  As a student with the Forge Trust you will enjoy two main placements working with contrasting aged pupils in selected academies.  In addition to the main placements we also offer enrichment placements in academies across the trust including pre-school units.  We have also previously been able to arrange enrichment placements with a local special school and would willingly explore this again.  \r\n\r\nPlacements are selected based on the interests and geographical location of candidates.  We are aware that travel can impact on work life balance and will always seek to place students in academies that they can comfortably reach.  A further factor will also be the capacity of the academy and in the event of over-subscription in one academy, we will always seek to offer a suitable alternative. \r\n\r\nThe Forge Trust specialises in the primay sector and can offer placements working within the age range of 3-11.  \r\n","personalQualities":"We are primarily looking for candidates who are genuinely motivated to make a positive difference to the lives and life chances of pupils.  Candidates must be able to reflect and learn from their experiences be resilient and have the ability to communicate effectively.   A further vital requirement is that candidates are able to form positive relationships with pupils as well as being able to empathise with pupils and parents alike.  Finally, we expect our candidates to be \"team players\" able to collaborate in the best interests of pupils.  \r\n\r\n","otherRequirements":"•\tDBS (formerly the CRB) Enhanced Disclosure\r\n•\tDeclaration of Health","status":1,"createdAt":"2021-07-06T10:54:17.594Z","updatedAt":"2021-09-30T15:52:32.163Z","canSponsorStudentVisa":"yes","cycle":"2024"}
