{"id":"80fc4e29-ec7a-4140-a94b-f402766efd92","name":"Primary","code":"X582","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"fca358db-87ef-42a2-bbe8-c0d0d22f9096","name":"Yewdale School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"4d8d69ab-6df9-4a3f-8ee0-5c7f08bf136c","code":"3Q2","name":"Cumbria Education Trust"},"accreditedBody":{"id":"9be9f611-2d36-431a-9109-7fcbbfc88fc8","code":"C99","name":"University of Cumbria"},"profPost":"PG","degreeGrade":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We ask candidates to use a third party  - A* Equivalency and Equivalency testing","courseLength":"OneYear","feesUK":9250,"feeDetails":"The stated fees are subject to government guidance","aboutCourse":"The award of PGCE with Qualified Teacher Status (QTS)  is widely recognised within the teaching profession and it is a qualification that carries a high status. By studying for a PGCE with QTS with Cumbria Education Trust in conjunction with the University of Cumbria, you will be getting the best of all worlds. Links with a University that traces its teacher training routes back to 1891 and direct involvement with the most established Multi Academy Trust in Cumbria employing more than 700 staff across our schools.\r\n\r\nYour programme will enable you to learn through a structured interplay of theory and practice. More than half of your time will be spent in school, observing experienced, expert teachers, supporting learning in the classroom and planning and teaching ever-growing sequences of lessons – learning how to apply skills and concepts to the classroom context.\r\n\r\nYou will study a range of modules including 2 at Masters level and these will help you reflect and analyse children as learners, cross-curricular learning and teaching and innovative teaching approaches. The academic part of the course allows you to study curriculum, pedagogy and aspects of professional life (including leadership) well beyond the statutory requirements","interviewProcess":"We interview in conjunction with the University of Cumbria throughout the year increasing the number of interview slots available.\r\nThere will be a mini teach task, a group discussion and a one to one interview.","howSchoolPlacementsWork":"You will have three placements at Cumbria Education Trust schools across the Primary age range.\r\nEach school has a designated mentor to support you in your placement.\r\nBecause of our wide geographical spread we can support you with a placement that is in the right place and has the right travel time for you.\r\nThe school have the same base curriculum, the same ethos and linked policies making it easy for you to settle into your placements.","personalQualities":"In CET we look for people who are keen and willing to learn. We expect children to always come first.\r\nOur core values are Respect, Responsibility and Resilience - staff lead by example and demonstrate these values to pupils every day.\r\nWe aim to use research to inform our practice and to ensure that we are always the best that we can be.","otherRequirements":"Ideally applicants will have undertaken, or  are willing to  commit to undertake 2 weeks of school based experience. We are happy to talk about this with candidates.","status":1,"createdAt":"2021-09-28T09:34:03.851Z","updatedAt":"2021-10-05T06:16:33.737Z","canSponsorStudentVisa":"yes","cycle":"2024"}
