{"id":"0f0a17f4-5776-49a2-aee8-5a6caacceaf0","name":"Mathematics","code":"2V5F","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"72345aa7-096c-488f-8649-085b8178cadb","code":"G1","name":"Mathematics"}],"locations":[{"id":"7c5500f5-f90f-4a5f-9a64-37721061a934","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"5a534974-57fd-41a0-b900-b059d4bef86f","code":"1OU","name":"Thamesmead School"},"accreditedBody":{"id":"c736dbbe-5eea-4cd5-9217-b23c3c586e77","code":"T26","name":"Thamesmead SCITT"},"degreeGrade":"9","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Candidates to use a third party provider and incur any necessary charges associated with these equivalency tests.","courseLength":"OneYear","feesUK":9250,"feeDetails":"We offer all our trainees the option of undertaking a PGCE; this is in conjunction with the University of Roehampton.\r\n\r\nIf you wished to undertake the PGCE element of the course then the course fees will be £9250.\r\n","financialSupport":"Training bursaries are intended to provide a financial incentive for high quality graduates to enter and complete initial teacher training.\r\n\r\nBursary rates are determined by the DfE and are subject to course subject and degree classification.\r\n\r\nMaintenance loans are dependent on household incomes.  Further funding may also be available such as Parents Learning Allowance, Child Care Grant or Child Tax Credits.  Further information on financial support is available from the Student Loan Company [www.slc.co.uk]\r\n","aboutCourse":"Throughout this Teacher Training Programme leading to QTS with optional PGCE, you will learn how to navigate the complex and interesting craft of teaching maths in secondary schools. You will understand the importance of maths beyond the curriculum to enable learners to make connections to the everyday lives in order for them to understand the relevance and importance of being effective at numeracy and problem solving skills. You will be guided through the course by subject specialists who will develop your subject knowledge and your understanding of teaching as a craft through a robust training programme which will prepare you fully for the start of your teaching career. \r\n\r\nOn any teacher training course, there is no substitute for being in the classroom as this is where you will develop the skills and competencies to become an excellent teacher.\r\n\r\nOn a SCITT route, graduates such as yourself will quickly become immersed into the fabric and day-to-day working of the school.  It will also provide you with high calibre weekly Professional Studies sessions, which equip you with up- to-date theoretical and practical knowledge of the underpinnings of education.  You will meet with your fellow trainees on a weekly basis to give you the chance to share your experiences and reflect on your emerging teaching practice.  Alongside this, the SCITT route will allow you to spend the majority of your time in the classroom.\r\n\r\nThe key elements of this course are:-\r\n* Placed in a main school from September to July with a shorter second placement for 5 weeks in January\r\n* Assessment of teaching practice through weekly formal observations from your either your mentor, other experienced  colleagues, external consultant or SCITT Director\r\n* Three formal assessment points through the year based on teaching practice and your quality of evidence against the Teachers' Standards\r\n* Three written assignments throughout the year and support will be given on academic writing and evidence based research\r\n* All professional studies training will take place in a Partner School in Surrey\r\n*Opportunity for an optional PGCE with The University of Roehampton, which carries Master's level credits\r\n","interviewProcess":"We interview all shortlisted candidates by invitation.  The interview will be conducted by the SCITT Director and a senior colleague from one of our partner schools.\r\n\r\nThe interview process is conducted over half a day and comprises the following elements:-\r\n* 20 minute lesson observation\r\n* Learner feedback from your lesson\r\n* Internal literacy and numeracy tests\r\n* Subject Knowledge audit\r\n* Interview\r\n* Overview of the programme\r\n\r\nSome of the key things that we will be judging include:\r\n* The way in which you engage with young people in the classroom\r\n* Communication skills\r\n* Passion for your chosen subject\r\n* Clear understanding of wider educational issues\r\n* Resilience\r\n* Awareness of subject knowledge that would need development\r\n\r\nWe are looking at your potential as a classroom practitioner.\r\n","howSchoolPlacementsWork":"Our partner schools are selected on the basis of their commitment to working with the partnership to train and support teachers through a school-based programme.  Thamesmead SCITT is a partnership that is based on four principles of excellence that underpin all of the work that we do.  Each of our partner schools has a Professional Tutor who oversees the quality of provision in each of their schools and who is also a member of the SCITT management board who lead the strategic vision of the SCITT.\r\n\r\nAll of our mentors are selected based on the quality of their teaching and by recommendation from their Professional Tutor.\r\n\r\nKey information:-\r\n* All partner schools are located within 20 miles of Thamesmead School\r\n* Partnership consists of 14 partner schools\r\n* All trainees will have two placements in contrasting settings; main placement from September to July with a second placement for five weeks in January\r\n* Secondary programme covers 11-16 age range\r\n","personalQualities":"You will be required to process and continue to develop a range of inter and intra personal skills to enable you to work effectively within educational settings.  You will need to be an effective team member, you must possess excellent communication skills both written and verbal and you must be resilient in order to meet the demands of the course.\r\n\r\nYou need to be organised and be able to meet deadlines both as part of the course and as part of your work as a teacher in school.  Most importantly, you must demonstrate the highest possible level of professionalism throughout.\r\n","otherRequirements":"* Disclosure and Barring Service (DBS) Certificate\r\n* Occupational Health Assessment \r\n","status":1,"createdAt":"2021-07-06T10:56:22.915Z","updatedAt":"2021-09-10T11:18:03.665Z","canSponsorStudentVisa":"no","cycle":"2024"}
