{"id":"d520590f-ca71-4796-ac6f-8b94f6af5315","name":"Primary","code":"3CPC","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"37f19bde-1067-4f4a-9984-6da9831309dd","name":"Main Site - Lydney CofE Primary but other schools also host students","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"13a37d5e-61a5-4fb2-aa03-54eebf8d41e5","code":"2C1","name":"Forest of Dean Schools Direct (Formerly WGSP Schools Direct)"},"accreditedBody":{"id":"9aa67012-b776-4027-89f4-5531efb3a9d2","code":"G50","name":"The University of Gloucestershire"},"profPost":"BO","degreeGrade":"1","english":"1","maths":"1","science":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"If you need to take an equivalency test in English, maths or science, please get in contact for advice on which route to take.\n\nEvidence of grade C/4 or above in English, maths and science GCSE qualifications or equivalency tests will be required.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"\r\nForest of Dean Schools Direct is an exciting one-year primary teacher training programme delivered in partnership with the West Gloucestershire Schools’ Partnership and the University of Gloucestershire (UofG). \r\n\r\nChoosing our programme means you will be in the classroom from the beginning, enabling you to feel part of the team and a member of staff. You will have two substantial teaching placements in different key stages plus an enhanced placement in a different setting or in one of your previous schools. You will spend most of your time in school but will also attend regular Continuous Professional Development (CPD) sessions delivered by our teachers and specialist experts plus some sessions at the University of Gloucestershire campus in Cheltenham.\r\n\r\nOur CPD programme equips you with the tools, subject knowledge and understanding to teach every aspect of the curriculum from Maths to History!  This, coupled with our school-based approach, enables you to develop your professional skills in diverse and supportive settings, allowing you to put theory into practice in the classroom. \r\n\r\nYou will work alongside and learn from expert teachers in the different placements which include:\r\n* single / mixed age classes\r\n* town / rural schools\r\n* church / non-denominational schools\r\n* mainstream, pre-school, secondary, special and alternative provision schools\r\n\r\nYou will have a school-based mentor in each placement who will meet you on a weekly basis to monitor and review your progress, regularly observe your teaching and provide written/verbal feedback. In addition, you will meet with our programme lead mentor (who oversees the training programme) and our other students on a weekly basis to share your experiences and participate in CPD. You will also have a UofG link tutor who will visit you in school to observe your teaching and assess your progress. This approach enables your subject knowledge, pedagogy and development as a reflective and professional practitioner to be assessed.\r\n\r\nFormal assessment takes place throughout the year - there is no final written examination. Assessment is by assessed practical teaching against the Teachers’ Standards, (you will be required to maintain a portfolio of evidence to support this) and two assignments set and marked by the UofG. This will lead to the award of Qualified Teacher Status and a PGCE. In addition, you will have gained a wealth of knowledge and skills to use in your future teaching career!\r\n\r\nSo – what are you waiting for? Come and join us!\r\n\r\n\r\n\r\n","interviewProcess":"\r\nOnce you have submitted your application, a panel of headteachers / senior leaders will assess your application looking for, amongst other things, evidence of a passion for teaching, professionalism, ability to engage with children and a good standard of written English. We will also consider the references provided by your referees - if you currently work in a school, one of these should be your headteacher.\r\n\r\nSuitable candidates will be invited to attend a selection process in one of our host schools or online if the COVID situation dictates. The selection process will include interaction with children (or if online, a presentation and discussion of a practical activity), written tasks in Mathematics and English, and a discussion with an interview panel of headteachers / senior leaders from our schools. We have designed our recruitment process to obtain as much information as possible about our potential students to ensure that successful applicants and placements can be suitably matched, enabling our students to develop into future teachers.\r\n\r\nOnce you have been offered a place on our School Direct Programme, depending upon your previous experience and development needs, you may be expected to undertake a school experience placement in one of our schools before starting the programme. During this experience, you will be expected to use the professional teaching standards to shape how you work with the children. This will help you in starting to develop self-reflective skills (essential in teaching) and to be clear in understanding your professional responsibilities as a teacher.\r\n","howSchoolPlacementsWork":"\r\nAll our placements/phases take place in the beautiful Forest of Dean - a rural area between the Rivers Severn and Wye.  31% of the population live in four market towns, the remainder in smaller, rural and widely scattered settlements.\r\n\r\nYou will be teaching children aged from 5-11 years and placements are provided across many of our partnership schools.  When placing students, we consider individual requests for placements alongside the strengths and previous experience of our students to ensure you are in placements which provide the best learning environments for your needs. \r\n\r\nUnlike PGCEs, School Direct students are based in school from the start. Our programme comprises three school placements enabling you to spend most of your training in the classroom. The placements/phases will cover Key Stage 1 and Key Stage 2 in at least two separate schools.  We also ensure that you gain experience of teaching in mixed-age classes as well as working in different types of schools such as Church and academy /grant-maintained schools.  Each placement has an assessed period where your teaching will be observed and assessed by your school mentor, our lead mentor and the UofG's link tutor.\r\n\r\n* Developing Phase / Placement 1 (September – December 2022):\r\nYou will observe and reflect on your practice and with support, plan, teach and assess groups and whole class, with 60% teaching by the end of term.\r\n\r\n* Broadening Phase / Main Placement (January – Easter 2023):\r\nPlanning, teaching and assessing the whole class with increasing independence with 80% teaching responsibility for final 4 weeks.\r\n\r\n* Enhancing Phase / Enhanced Placement (April – June 2023):\r\nAn opportunity for you to pursue personal targets and develop the range of your experience whilst continuing to undertake an 80% teaching commitment.\r\n\r\nVisits will also take place to other settings during the year including a secondary school, an alternative provision school, a pre-school and a special school.\r\n\r\nThese placements along with the comprehensive CPD programme covering every area of pedagogy and the curriculum, will ensure once you qualify, you can hit the ground running as a teacher!\r\n","personalQualities":"\r\nWe are looking for the next generation of stand-out teachers - students who are passionate and excited about making a difference to our children and our schools.   We want people who:\r\n\r\n* Are confident and able to engage with children\r\n* Have excellent communication and organisational skills\r\n* Are committed to working hard and being professional\r\n* Can establish good working relationships\r\n* Have a commitment to a professional team and to excellence in education\r\n* Are flexible – crucial in an active and constantly changing educational environment\r\n\r\nIs this you? If so, come and join us!\r\n","otherRequirements":"\r\nIt is the duty of all schools to protect vulnerable children and adults. If you are offered a place on the programme, we will arrange for you to have a DBS check, as it is a vital entry requirement for this training programme.  \r\n\r\nThis check will contain details of any cautions, convictions, reprimands, or any warnings recorded against your name (even where they would generally be considered spent) or will confirm that you have none.\r\n\r\nIt will allow both our schools and the University of Gloucestershire to assess of your suitability for access to these vulnerable groups.  ","status":1,"createdAt":"2021-07-06T10:51:51.613Z","updatedAt":"2021-10-01T13:27:14.110Z","canSponsorStudentVisa":"no","cycle":"2024"}
