{"id":"9865456e-62e9-47d9-8e09-93654b3cb01b","name":"History","code":"26TM","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"B","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"5a3609a0-5bbb-4377-b919-5d89932ab622","code":"V1","name":"History"}],"locations":[{"id":"f8f86756-05fb-4a25-b5cf-85929bff0d3f","name":"Lead School: Bennett Memorial Diocesan school","isPublished":"Y","status":"R","vacancies":"B"}],"trainingProvider":{"id":"87016e8d-d70d-4c8d-b412-522cd7002af7","code":"1KU","name":"Bennett Memorial Diocesan School"},"accreditedBody":{"id":"2b8fac2f-ed98-4278-a7fc-fa3f418dfbef","code":"2EZ","name":"Teach Kent & Sussex"},"profPost":"PG","degreeGrade":"0","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Equivalency tests are provided by Teach Kent & Sussex and assessed by one of our tutors. Each GCSE paper taken incurs a fee of £30/paper.","courseLength":"OneYear","feesUK":9250,"feeDetails":"Our full time course fees (1 academic year) are £9250.\r\n\r\nOur part time course fee are £4875. The part time course is spread over two academic years. \r\n\r\nMost of our trainees use a student loan to pay for their fees. However, some pay privately.\r\n\r\nFees are paid in two installments during the course of the year; September and April. ","aboutCourse":"From the moment you start the course and walk into a classroom we will be equipping you with the professional knowledge you need to help your students to flourish and fulfil their potential.  \r\n\r\nThis course will equip you with the knowledge of what the best and most rigorous research tells us about effective teaching. You will begin to understand and be equipped to use in the classroom teaching methods that are practical, effective and informed by the best evidence based research. This will include:\r\n\r\n* how teachers structure explanations effectively so that students understand,  \r\n* how effective teachers question students and offer feedback and \r\n* how the best teachers get students to practice until they have mastered a topic.\r\n\r\nFrom the beginning of the school year you are placed in a school so you are soon immersed in to how to apply this knowledge to the practice of teaching.\r\n\r\nWe believe in the importance of a 'knowledge rich' curriculum in which students are taught the key content they need to have in order to succeed.  You will therefore be tutored and mentored by a subject specialist who knows the most effective ways of, for example:\r\n\r\n* how to plan specific content, \r\n* how to avoid the misconceptions students may have\r\n* ensuring students make strong progress. \r\n\r\nThis means that we will be able to equip you with a deep knowledge of your subject area and how best to teach it.\r\n\r\nWe also consider it important that every trainee teacher understands what cognitive science tells us about how learning takes place in the human mind. We therefore place great emphasis on teaching our trainees on how children remember and how this can be used to help students retain knowledge in their long term memory. This allows you as a teacher to help your students to learn more and succeed further at school and beyond. \r\n\r\nThe course should provide you with the strongest of foundations so that you have the best possible start to your teaching career. Trainees are able to complete our course confident with a strong body of professional knowledge. Through their training they have learnt to apply and refine this through their teaching practice throughout the training year. \r\n\r\nOur trainees have a very high success rate in securing teaching jobs on completion of their training. ","interviewProcess":"As part of our selection process we provide you with:\r\n\r\n* An opportunity to meet one of our admin or leadership team to discuss expectations and practicalities of our course.\r\n\r\nYou will need to:\r\n\r\n* Give a short presentation about how you have helped someone or a small group learn something \r\n\r\n* Read aloud from a self chosen piece of text linked to your subject interest.\r\n\r\n* Prepare for a formal interview in which you will be asked about why you wish to teach and how you can show you have the capacity, personal characteristics and qualifications to do so. \r\n\r\n* You will also have a more informal interview with a subject specialist (normally a head of department) who will discuss with you your subject specific qualifications and identify any particular areas of subject knowledge that may need further development before the course begins. \r\n\r\n* Complete a written task for which no preparation is required.\r\n\r\n* Complete our safe recruitment checklist and provide appropriate certificates (e.g. your degree certificate). \r\n\r\n","howSchoolPlacementsWork":"During your training year we ensure that you teach across the full secondary age range from 11-18. You will therefore be trained to teach years 7-9, GCSE and A level. We consider that this will give you the strongest start to your teaching career.\r\n\r\nYou will spend most of your training year in one school. In doing so you become an integral part of that school community. You will therefore be able to build a strong relationship with your mentor and other colleagues in the school as well as the students. As your mentor comes to know you they will be able to more effectively support you throughout the course. \r\n\r\nYou will have a short contrasting placement during January-February in another school before returning to your main placement school from February to July. \r\n\r\nIn placing a trainee in a school we consider the individual strengths of each trainee and how they can best match the profiles of the schools, mentor and subject heads of department we work with. We also consider the distance a trainee would have to travel and any preference they express at interview about where they would like to train to teach.  ","personalQualities":"We are looking for candidates who are willing to work hard to help ensure that children get the best possible education. Candidates need to believe that they can, as teachers, make a difference and help children flourish. They will need to be ambitious for the children they teach and be able to show tenacity at times of challenge. They should be able to demonstrate a strong subject knowledge and be open to learning and reflecting upon how they can develop as a teacher.","otherRequirements":"Candidates will need to be suitable to work with children and young people. They will be asked questions regarding safeguarding at interview.\r\n\r\nOffers to train to teach with us are made on condition of:\r\n\r\n•\tSatisfactory Enhanced Disclosure and Barring Service (DBS) or Disclosure Scotland or overseas equivalent.  \r\n•\tSatisfactory clearance of Prohibited teachers checks.\r\n•\tSatisfactory clearance of Children’s Barred checklist.\r\n•\tSatisfactory pre-employment health clearance.\r\n•\tIdentify check and verification of entitlement to work in the UK; \r\n•\tReceipt of 2 satisfactory references.\r\n•\tSatisfactory qualifications certification including NARIC or equivalent.","status":1,"createdAt":"2021-07-06T10:51:50.551Z","updatedAt":"2021-10-04T22:25:19.478Z","canSponsorStudentVisa":"no","cycle":"2024"}
