{"id":"ec912fc2-cd51-4e2c-853b-01de5de8ce93","name":"Primary (5-11)","code":"2P7X","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"9a4d6ef3-51b4-409a-9f8d-66d10bf7cb92","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"e7ff38ed-7cdd-4acd-b74d-20f00aa73b2a","code":"1QD","name":"Bishop Wheeler Catholic Academy Trust Professional Development Partnership (BWCAT Partnership)"},"accreditedBody":{"id":"19a3446e-382d-4c14-83bb-a76563cef3c1","code":"L24","name":"Leeds Trinity University"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We do not offer the tests, please use a third party provider to complete the tests.","courseLength":"OneYear","feesUK":9250,"feeDetails":"Leeds Trinity postgraduate Initial Teacher Training (ITT) tuition fees are £9,250 in 2017–18. Tuition fees may rise with inflation in future years. ​\r\n\r\nYou will not have to pay these fees upfront. Eligible UK and EU students can apply for a tuition fee loan to cover the cost of tuition fees from the government.\r\n\r\nUK students on non-salaried places studying full-time can apply for a package of maintenance funding from the government to help with general living costs and additional funding if you have children and/or a disability.   \r\n","aboutCourse":"Our General PGCE Primary (5–11 years) course is designed to develop teaching and learning through immersive school-based experience and reflective practice, organised into three stages: you will receive teaching from university academic staff at Leeds Trinity campus for 2 days per week as well as training under the direction of St. Mary’s Teaching School. Trainees must complete placements in both Key Stage One and Key Stage 2 for this training program.\r\n\r\nWe have a number of Specialist Leaders in Education who will support and contribute to the School Direct programme, thus enabling a bespoke programme tailored to student’s needs. In addition to this, students are supported by a Lead Mentor and outstanding practitioners.\r\n\r\nThe school-centred nature of the training programme means you will be based in two different primary schools for the majority of the academic year. Your school placements will provide a variety of training experiences, building your confidence and classroom excellence and equipping you for the reality of your NQT year.","interviewProcess":"The selection process is led by Senior Leaders across our partnership with a real investment and focus on 'growing our own' teachers of the future. \r\n\r\nIf you are called to interview you will be asked to  plan and deliver a short teaching task to the age phase you have applied to. \r\n\r\nYou will also complete a 20 minute intervew process assessing your understanding of the Primary Curriculum and working with children.\r\n\r\nIf you are offered a place you will also be required to complete the relevant National Skills Tests before the course commences.","howSchoolPlacementsWork":"We currently have  15 partner schools that are listed on our website, all of which are Outstanding or Good. \r\n\r\nTrainees complete 3 placements across 2 schools. Stage 1 is completed in a 'Host School' where trainees are fully supported in teaching Maths and English over a period of 7 weeks.  Serial visits to the school  are made in the build up in preparation of this.\r\n\r\nStage 2 and 3 are completed at a 'Home School'.  Stage 2 is 10 weeks long  where trainees  progressively begin to teach a broader primary curriculum beyond English and Maths. \r\nStage 3 is 10 weeks long, where trainees develop independence and confidence across all of the Teaching Standards, showcasing school readiness for their ECT year. Stage 3 is completed in a trainees preferred year group, where possible, in order to build upon existing strengths. \r\n\r\nConsideration of individual and geographical needs are always taken into account when allocating placement schools. We pride ourselves on this and consider it one of the  contributing factors to the excellent outcomes and successes of the training program.","personalQualities":"BWCAT PDP are committed to creating teachers of the future. We are seeking individuals who are genuinely passionate about shaping and making a difference to young lives and have:\r\n\r\nExpert communication skills\r\nSuperior listening skills\r\nDeep knowledge and a creative mind\r\nThe ability to build caring relationships with children\r\nFriendliness, compassion  and understanding\r\nExcellent preparation and organisation skills\r\nStrong work ethic\r\nHigh expectations for all","otherRequirements":"Meet the ‘national requirements’ (degree, GCSEs, DBS check, health clearance)\r\nHave good subject knowledge at degree level\r\nHave some subject curriculum knowledge\r\nHave a good understanding of what teachers do\r\nUsually some experience in a school or schools\r\nOften have (other) experience with children\r\n","status":1,"createdAt":"2021-07-12T13:49:38.582Z","updatedAt":"2021-09-27T10:51:11.543Z","canSponsorStudentVisa":"yes","cycle":"2024"}
