{"id":"feba7a86-e9b4-477f-9cd6-efceb420fab2","name":"Primary","code":"286X","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"cdb3a494-f134-40da-8366-56a1a0609ac1","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"5cede3b6-4485-4e0a-9469-0c43a13d38d8","code":"1F9","name":"Wyvil Primary School"},"accreditedBody":{"id":"33037eab-f75d-4350-b1e2-967c41e9d4c6","code":"R48","name":"Roehampton University"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"financialSupport":"We offer unsalaried trainees accommodation in our renovated Victorian School houses in Zone 1 (Vauxhall) for £300pcm including bills, to help support you with living costs whilst on the programme. The accommodation is also available to NQT's in our alliance.","aboutCourse":"This postgraduate qualification gives you the tools to build a successful career in teaching while providing a holistic view of the profession; you will look at the child, curriculum and teacher. The course will build your confidence in the classroom, your understanding of the wider role a teacher plays and provide you with all the subject knowledge to effectively teach all age groups of primary school children.\r\nYou will be based in a host school for 32 weeks of the year, which will enable you to develop strong relationships with your school mentor who will oversee your training. You will undertake a short placement in a contrasting school in term 2, and attend lectures and seminars at Roehampton throughout terms 1 and 3. You will be assigned a tutor from Roehampton who will support you with both the practical and academic elements of the course.\r\nYou will also be part of a large cohort of trainee teachers in Lambeth and will attend an innovative training programme in local schools led by leading Lambeth teachers.\r\nWe offer trainees on this programme subsidised Zone 1 accommodation in a shared house for £300pcm including utility bills, to help offset living costs whilst on the course. Please contact us to find out more on schooldirect@ltsa.org.uk.\r\n","interviewProcess":"If you are shortlisted for interview we will ask you to complete a short interview with the senior leadership at the host school, undertake a pupil interaction task, and complete an English written test. We will then notify you within 24 hours to confirm your offer of a place.","howSchoolPlacementsWork":"Candidates are invited to visit schools in the partnership prior to starting the course and are welcome to express a preference for where they will be placed. In most cases we are able to accommodate these requests. Our schools are all easily accessible by public transport and we will take into account travel times when placing trainees. You will gain teaching experience across at least two key stages during the course in two contrasting school settings.","personalQualities":"We are looking for candidates who are passionate and knowledgeable about their specialist subject and keen to have a positive impact on the lives of young people in the capital.","otherRequirements":"You will need to complete a DBS check prior to taking up the offer of a place.","status":1,"createdAt":"2021-07-06T10:47:50.201Z","updatedAt":"2021-07-13T15:30:20.458Z","canSponsorStudentVisa":"yes","cycle":"2024"}
