{"id":"be85479e-e0f1-4a67-a480-dfa401b8f18f","name":"Primary","code":"39QC","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"3ace6cd3-c691-4ac9-af4f-21a7b1954f30","name":"Bretforton Village School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"2ad04e95-ba61-40eb-baec-caa100d56cb8","name":"St Richards C of E First School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"85c0ae66-d443-438e-9c89-ea35b017185f","name":"Swan Lane First School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"b012b7fb-86d1-464c-abc1-75153cca4081","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"},{"id":"09d3f5af-e286-4aed-8937-3482ac598104","name":"Harvington C E First and Nursery School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"2b72c9a7-eddf-4eba-bc4c-744e7645b0b5","code":"2JC","name":"Bengeworth Multi-Academy Trust"},"accreditedBody":{"id":"6019b3ce-f2f6-4b0e-b2a9-5813d74c4d54","code":"W80","name":"University of Worcester"},"profPost":"PG","degreeGrade":"1","english":"2","maths":"2","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":14100,"aboutCourse":"Overview\r\nAll schools in the alliance are highly committed to the training of teachers in a school based environment with access to high quality support from outstanding Higher Education Institutions. All schools in the alliance will have trained mentors who are involved in the planning and development of the School Direct courses with The University of Worcester. \r\n\r\nProfessional Studies\r\nThe professional studies element of the course will be coordinated by the outstanding Bengeworth CE Academy and held on a particular day each week, focusing on developing teaching and learning within the classroom.  The professional studies programme with be delivered and shared across schools in a wider alliance, who have specific areas of expertise with much of the Professional Studies element involving linking theory to classroom practice. \r\n \r\nAbout The Course\r\nTeaching placements for the Autumn and Summer terms will be in the same school in our alliance. Half of the Spring term will be spent in another of our partner schools, gaining experience in a different key stage and a different context. \r\n \r\nYou will attend the University of Worcester for 27 days of professional studies during the year, which will enable you to gain QTS plus a PGCE with 60 credits at Masters level. \r\n \r\nMentoring\r\nEach Trainee will be assigned a Professional and School Mentor who will be experienced in mentoring, coaching and giving feedback. There will be a high entitlement of lesson observations by mentors and other colleagues and the opportunity to observe and team teach with outstanding practitioners across the alliance. Regular meetings with you mentor will enable to you review and set targets related to the Teaching Standards.\r\n \r\nSpecialist Leaders In Education\r\nWithin the programme there will also be opportunities to have personalised support from  Specialist Leaders in Education based at Bengeworth CE Academy and access high quality training programmes linked to teaching and learning innovations across the alliance.\r\n \r\nWhen will you start ?\r\nYou will be in school from the start of the year and will gain access to all the training and extra-curricular opportunities available in this vibrant alliance. All training will be made available to with a course overview at the start of the year.\r\n \r\nQualifications\r\nThis School Direct route allows you to achieve QTS and a PGCE qualification as well as credits towards Masters Accreditation. \r\n","interviewProcess":"Due to the intensive, school-based nature of the School Direct Course, that demands a full-time commitment, our selection process is rigorous and thorough and designed to help us decide whether this is the right training programme for you.  Interviews, including a school based task with children will be held at Bengeworth CE Academy in collaboration with our partner schools and the University of Worcester and a separate interview will also be held by the University of Worcester.  ","howSchoolPlacementsWork":"During your training schools are selected based on your strengths and areas of development. During the interview and selection process the Lead School will discuss with schools within the alliance how they could  best meet your needs to support you in your develop as a teacher.\r\n\r\nWithin the alliance there are five schools, with age ranges from 5-11, within the Evesham local area, which is within travelling distance of cities such as Cheltenham and Worcester. There are frequent train and bus services within walking distance of each of the schools.\r\n\r\nDuring the course of the year you will have a total of three placements spread across two different settings. Your initial and final placement will be within the same school, with your second placement being held in a different school within the alliance and within a contrasting key stage. The majority of your course is spent in school-based training, with 27 days spent at University throughout the course. \r\n","personalQualities":"Enthusiasm towards working with children and a commitment to enhancing the learning experiences of those you teach are fundamental to ensuring you get the most out of this course. You will also need to be able to relate to the pupils you are working with and will be supported in developing good working relationships with teachers, pupils and families throughout the School Direct programme.","otherRequirements":"School experience is desirable, but not essential prior to an interview. At interview we will discuss relevant prior school experience or opportunities applicants have had to work with school aged children. It is at this point that we would discuss with a candidate whether additional school experience would support an individual in their decision that teaching is right for them. ","status":1,"createdAt":"2021-07-06T10:52:52.293Z","updatedAt":"2021-09-21T19:12:00.939Z","canSponsorStudentVisa":"yes","cycle":"2024"}
