{"id":"1506d528-d5c5-4de6-9073-72fbae9a5466","name":"Primary","code":"E267","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"6671003d-09a5-43fe-92e8-6eddd51e2c11","name":"Suffolk and Norfolk Primary SCITT","isPublished":"Y","status":"R"},{"id":"4b7e121b-38a9-4af5-bac5-ab59bb6d3c0f","name":"Main Site","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"7c856436-9fca-4528-9be6-a5038d315858","code":"1MH","name":"White Woman Lane Junior School"},"accreditedBody":{"id":"89831af6-535f-471b-aa97-098bd1a93291","code":"S13","name":"Suffolk and Norfolk Primary SCITT"},"profPost":"PG","degreeGrade":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Please note - We do not accept Level 2 Qualifications in Numeracy and Literacy as equivalencies.","courseLength":"OneYear","aboutCourse":"We offer specialisms in General Primary and Early Years. We provide a unique opportunity across Norfolk and Suffolk for trainees to immerse themselves in a diverse range of teaching and training experiences which by the final term are highly personalised.\r\n\r\nThe training comprises of 3 placements in 2 contrasting schools over the course of the year combined with approximately 48 days in centre training.\r\n \r\nThe centre based training is provided by expert trainers, many of whom are still serving teachers. It covers all National Curriculum subjects and key aspects of primary education such as behaviour management, SEND and assessment. Trainees also have sessions focused on the two assignments and one presentation which contribute to their PGCE qualification (including 60 credits at M Level).\r\n\r\nAll trainees have a tutor who is committed to supporting each trainee over their training year.  This includes visits to observe teaching and end of term progress interviews.","interviewProcess":"The Primary Salaried SCITT team will be co-ordinating the recruitment process with their partnership school head teachers.\r\n\r\nYou will be invited to a task day where you will undertake a short written activity to gauge your fundamental English skills and a group task focused on interpersonal skills.  \r\n\r\nThis will be followed by an interview that will begin with you giving a short presentation.","howSchoolPlacementsWork":"When applying for the salaried route, it is very advisable to have the support of a school that can offer you a placement, including meeting the necessary contribution to your salary.  There may be a very small number of salaried places available through lead schools, however competition for these is likely to be very high.\r\n\r\nTrainees spend approximately 29 weeks on school placement. Most of this is in the main placement school in the autumn and summer terms, with at least 6 weeks in the spring term in a contrasting school.","personalQualities":"We are looking for committed, resilient individuals who are ready to undertake an exciting but rigorous training year. We are interested in people who are passionate and enthusiastic about children's learning and have a desire to promote the best outcomes for all children. You need to be open to constructive feedback and see it as a tool to help you to achieve your potential by the end of the year.  You must be organised and self-motivated as although you will be well supported, you also need to be focused on the commitment involved within this training year.  ","otherRequirements":"- Confirmation of clear enhanced DBS check before you start the course. This check is carried out by your placement school but Primary SCITT do need to check your identity before starting the course. \r\n \r\n- Meet the 'Fit to Teach' criteria. This is organised by your placement school as part of their pre-employment checks\r\n\r\n- If an applicant has lived overseas for more than three months in the past five years in line with safer recruitment practice they will be required to provide a certificate of good conduct from that country.","status":1,"createdAt":"2021-12-08T12:06:12.189Z","updatedAt":"2021-12-08T12:09:39.517Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"To be eligible for a place on the salaried course you must have the support of a school who is willing to pay your salary. The minimum this can be is full-time on point 1 of the unqualified teacher or instructor scale. The school will also need to pay Suffolk and Norfolk SCITT a training fee of £4550."}
