{"id":"9be68879-46e7-44fc-baac-de712487a3a1","name":"Primary","code":"2KNQ","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"66358024-a2f8-4cae-bffa-693a74c9e306","name":"Wimborne Academy Trust Schools","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"cdcd3d62-fd73-45fb-92c2-41c54a4828da","code":"225","name":"St John’s Church of England First School, Wimborne"},"accreditedBody":{"id":"3700fb02-7007-40c8-9127-b070e146d6cb","code":"W76","name":"University of Winchester"},"profPost":"PG","degreeGrade":"1","english":"1","maths":"1","science":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":14100,"financialSupport":"Intending trainees should contact Student Finance England for details of eligibility for financial support and the Student Loan Scheme.\r\nIn certain circumstances the following grants are also available: Parents' Learning Allowance, Adult Dependant's Grant, Disabled Students' Allowances, Childcare Grant\r\nFurther information is available from the Government website: www.direct.gov.uk\r\n","aboutCourse":"The course prepares you to teach across the age ranges 5-11 and is structured around six modules - a combination of taught modules based at the University and placement modules based in schools or educational settings.\r\nYou will undertake studies in all elements of primary education;  extend your knowledge of learning and teaching, of the breadth and scope of the curriculum and the professional skills associated with high-quality teaching. You will then apply these areas of understanding and skill to classroom practice throughout the year, including during two assessed placements in schools or educational settings. \r\nUpon successful completion of the course you will be awarded a PGCE with recommendations for the award of Qualified Teacher Status (QTS).\r\n","interviewProcess":"The interviews are designed to probe candidates' understanding of their school-based experiences. Interviews are held in a Trust school and candidates are given the opportunity to:\r\nTalk about their understanding of the role of a primary classroom teacher;\r\nShare and explore a text with a class or group of children;\r\nUndertake a short written English exercise and a Maths task;\r\nTake part in a short interview process.\r\n\r\nSuccessful candidates will also be required to: \r\nUndertake a pre-course placement (10 days minimum) working as a volunteer in school with children in Key Stage 1 and/or Key Stage 2; \r\nUndertake an Enhanced Disclosure from the Disclosure Barring Service. \r\nUndertake a health check to demonstrate that s/he is physically and mentally fit to teach.\r\n","howSchoolPlacementsWork":"There are three main teaching placements, with trainees generally based in one school for the Autumn, the late Spring and Summer terms, and a second school for the early Spring term. All trainees gain experience in Key Stage 1 and Key Stage 2 and there are also opportunities for observation in Foundation Stage and Key Stage 3.\r\nWhilst in school our trainees are encouraged by school based tutors who are experienced, practising teachers. They play a crucial role in the co-ordination of the trainees’ learning and teaching programme within the school. Training is provided for class teachers as they support the trainees in planning, teaching, assessing and evaluating.\r\nCentre based study anticipates and consolidates the school based experiences and is organised through a series of modules which reflect the National Curriculum subjects and professional issues. These centre based sessions are led by our own core tutors, education consultants, headteachers and practising teachers.","personalQualities":"In addition to the academic qualifications we are looking for: \r\nEvidence of a commitment to the teaching profession, an understanding of professional requirements, and an awareness of current educational issues in an application. Prior experience in a school is not required, however prospective students may find experience in a school useful for obtaining insights into the primary education classroom. Experience in a school or similar setting may also provide reassurance to prospective students that teaching is the right choice for their career. \r\n","otherRequirements":"Provide two referees; at least one from an environment where the referee has seen you working with children. \r\nIf you accept an offer of a place you will be required to complete a Disclosure and Barring Service (DBS) criminal records check and Prohibition Order check. If you have spent time overseas in the last 5 years you may also be required to obtain criminal records checks from each of the countries you visited. You will also be required to complete an occupational health check to confirm that you are fit to teach. More details will be sent from the University.","status":1,"createdAt":"2021-07-06T10:49:45.251Z","updatedAt":"2021-10-01T15:05:10.786Z","canSponsorStudentVisa":"yes","cycle":"2024"}
