{"id":"0dd1aa80-e32f-4c2b-8188-beaa5c6e666f","name":"Primary","code":"2TD9","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"3_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"594161f9-cc99-4ee5-80ce-bb30a1ac40e1","name":"Roby Park Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"a90ca7c5-b539-4e04-9d21-273d564e9e9b","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"},{"id":"4f0aa7b6-8fdf-4bf7-a9b6-f9f4c14de542","name":"Waterloo Primary School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"34d47785-c149-4b1c-94ad-4a3bf8ce18d2","code":"2AS","name":"Prestolee SCITT"},"profPost":"BO","degreeGrade":"9","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We offer our own equivalency programme at Prestolee SCITT. Our full support package offers 1.5 hour long online tutor-led revision sessions for each subject. These are held over four consecutive weeks in preparation for your Equivalency Test. These sessions are held remotely via Zoom and cover both subject content and question practise. Our full support package costs £180 per subject. If you are not able to join our online revision sessions or feel that, with some self-revision, your subject knowledge is already sufficient, we offer standalone GCSE Equivalency Tests in English, Mathematics and Science. The standalone exams cost £95 per subject.","courseLength":"OneYear","feesUK":9250,"feeDetails":"Trainees have 2 options for payment, either via a loan from Student Finance or via self-funding. If you fund via Student Finance, once your loan application is approved the payments will be made directly to us and you do not need to take any further action. If you self-fund, payments can be made either by BACS or cheque.","aboutCourse":"The programmes have a comprehensive schedule of subject and theoretical training, which is delivered by outstanding practitioners and experts from across our partnership and wider alliance of schools.\r\n\r\nYou can choose to specialise in either Early Primary (3-7 years) or General Primary (5-11 years). Early Primary trainees will complete their training in Early Years and KS1, whilst General Primary trainees will complete their training in KS1 and KS2","interviewProcess":"Once applications are received through UCAS, they undergo a careful screening process to ascertain suitability for interview.\r\n Consideration is given to how much experience applicants have had in primary schools; academic qualifications (or predictions for pending degrees); suitability to teach & personal qualities and the quality of the personal statement in terms of grammar and spelling. Those selected will be invited to attend an interview day which will involve a mini teach.","howSchoolPlacementsWork":"All trainees will be allocated to a Home School. You will start the academic year in your Home School and spend the majority of your school-based experience time there. All trainees will spend a placement in an Away School during term 2 of the academic year.\r\n\r\nThe course combines practical classroom experience with academic study to give you the knowledge and understanding to teach successfully. ","personalQualities":"Put simply, we are looking for potential. More specifically, we are looking for candidates who have the qualities required for a career in teaching, the potential to turn these qualities into a journey towards becoming a great teacher, and the work ethic and determination required to make this a reality. We want to hear from people who are personable, friendly and engaging; have a strong work ethic and a positive outlook; who understand the importance of teaching and want to make a difference.","otherRequirements":"School experience is not essential in order to apply for one of our courses. However, you may find it beneficial to have some school experience for the interview process where you will be asked to deliver a ‘mini-teach’ – a short lesson to a small group of pupils. You may also be asked questions which relate to the classroom. All offers will be conditional of DBS and Fitness to Teach checks.","status":1,"createdAt":"2021-07-12T13:48:26.243Z","updatedAt":"2021-07-23T11:31:56.762Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
