{"id":"6b3464c8-890f-4088-b80d-e030f24547a0","name":"Primary","code":"Q254","qualification":"qts","startDate":"2024-01-01T00:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"P","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"a90ca7c5-b539-4e04-9d21-273d564e9e9b","name":"Main Site","isPublished":"Y","status":"R","vacancies":"P"}],"trainingProvider":{"id":"34d47785-c149-4b1c-94ad-4a3bf8ce18d2","code":"2AS","name":"Prestolee SCITT"},"degreeGrade":"9","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We offer our own equivalency programme at Prestolee SCITT. Our full support package offers 1.5 hour long online tutor-led revision sessions for each subject. These are held over four consecutive weeks in preparation for your Equivalency Test. These sessions are held remotely via Zoom and cover both subject content and question practise. Our full support package costs £180 per subject. If you are not able to join our online revision sessions or feel that, with some self-revision, your subject knowledge is already sufficient, we offer standalone GCSE Equivalency Tests in English, Mathematics and Science. The standalone exams cost £95 per subject.","courseLength":"18 months","feesUK":9500,"feeDetails":"The fees are split over the two calendar years that the course spans. \r\n\r\nYear 1: January 2021 - December 2021: £6,000\r\nYear 2: January 2022 - July 2022: £3,500\r\n\r\nTrainees have 2 options for payment, either via a loan from Student Finance or via self-funding. If you fund via Student Finance, once your loan application is approved the payments will be made directly to us and you do not need to take any further action. If you self-fund, payments can be made by BACS.","aboutCourse":"Why study this course?\r\n\r\nBy choosing to train as a primary teacher at Prestolee School-Centred Initial Teacher Training through our part time route, you’ll be joining a powerful partnership of diverse teachers and schools. We focus on innovative learning within the classroom and give you hands-on practical experience alongside relevant theory and up-to-date research developments. \r\n\r\nOur trainees attain highly, with 95% achieving an Ofsted good or outstanding grade by the end of the course, and 96% obtaining employment, many in their placement schools.\r\n\r\nMore about this course\r\n\r\nThis exciting QTS only course leads to Qualified Teacher Status and prepares you to teach across the primary phases. \r\n\r\nOur course gives you room to develop your classroom practice as well as examine the underlying principles and values around educational issues.\r\nWith its educational links and high-quality teaching, this provider is rated ‘outstanding’ by Ofsted:\r\n\r\n'Excellent training provides trainees with high levels of subject knowledge, an impressive range of teaching skills and highly effective strategies to manage behaviour very successfully across a range of schools. Consequently, by the time they complete the programme, the majority of trainees demonstrate outstanding practice in their teaching.'\r\n\r\n'The partnership provides trainees with excellent, individualised mentor support which encourages them to become highly reflective and thoughtful. This high-quality support also extends to exemplary pastoral care for trainees.'\r\n\r\nCourse structure\r\n\r\nOur part-time SCITT curriculum begins in January 2022 and finishes in July 2023. It involves teaching two days in school and one day of training per week. The training day will be hosted and delivered by outstanding classroom practitioners who currently teach in our partner schools. \r\n\r\nAssessment\r\n\r\nYour assessment will consist of four elements:\r\n\r\n•\tSchool placement A\r\n\r\n•\tSchool placement B, where your teaching ability will be assessed in relation to the standard for Qualified Teacher Status\r\n\r\n•\tA Professional Practice Portfolio which is compiled across the programme, detailing personal experiences and reflections on your development as a teacher, largely in relation to your practical teaching experience\r\n\r\n•\tEducational Research, which allows you to explore current educational approaches \r\n\r\n","interviewProcess":"Interviews will be conducted via Zoom by two members of the SCITT leadership team. Full details and requirements of the interview will be provided after the application and selection process.","howSchoolPlacementsWork":"The part time route will follow this pattern:\r\n\r\n\tJanuary 2022-July 2022: 2 days a week in school placement A in one school, 1 day of training per week\r\n\r\n\tSept 2022-December 2022: 2 days a week in a contrasting placement B, 1 day of training per week \r\n\r\n\tJanuary 2023-July 2023- : 2 days a week in school placement in school A, 1 day of training per week, with a 3 week flexible (full-time) block in this term. \r\n\r\nPlacement schools are arranged as close to home as possible.","personalQualities":"Put simply, we are looking for potential. More specifically, we are looking for candidates who have the qualities required for a career in teaching, the potential to turn these qualities into a journey towards becoming a great teacher, and the work ethic and determination required to make this a reality. We want to hear from people who are personable, friendly and engaging; have a strong work ethic and a positive outlook; who understand the importance of teaching and want to make a difference.","otherRequirements":"School experience is not essential in order to apply for one of our courses. However, you may find it beneficial to have some school experience for the interview process where you will be asked to plan a ‘mini-teach’ – a short lesson to a small group of pupils. You may also be asked questions which relate to the classroom. All offers will be conditional of DBS and Fitness to Teach checks.","status":1,"createdAt":"2021-07-12T13:48:26.287Z","updatedAt":"2021-07-23T11:32:48.730Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
