{"id":"8ed3507e-63ad-4b27-9acb-155ac8baec61","name":"Primary","code":"3D6D","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"eae7e889-842c-44c1-8a2d-1a246648d05f","name":"Whitchurch CE Primary School","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"10a0d5b3-b953-40ac-ad6b-ee4fa3f4a087","code":"2JP","name":"River Wye Federation"},"accreditedBody":{"id":"6019b3ce-f2f6-4b0e-b2a9-5813d74c4d54","code":"W80","name":"University of Worcester"},"profPost":"BO","degreeGrade":"0","english":"2","maths":"2","science":"2","acceptPendingGcse":"no","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":13700,"aboutCourse":"On our School Direct teacher training programme, you’ll be given in-depth experience in the classroom. By the end of the course trainees are assessed to achieve QTS (Qualified Teacher Status) and a PGCE (Post Graduate Certificate in Education) awarded by the University of Worcester. You will complete a main placement in a key stage of your choice and a second placement in a contrasting school and key stage (minimum 120 days). Your main placement will be on either our site at Whitchurch or Weston-under-Penyard with your second placement at one of the other schools in the Wye Valley Learning Network. You will also have the opportunity to complete enhanced placements e.g. SEND, Early Years.\r\n\r\nIn addition, away from the classroom, you’ll receive practical training sessions from SLEs, experienced teachers and the team at the River Wye Federation. The University of Worcester will also lead sessions to support your academic development. Training takes place mainly at Whitchurch CE Primary (HR9 6DA) and occasionally at other locations suited to the professional study sessions.\r\n\r\nFor further information please go to [The University of Worcester](https://www.worcester.ac.uk/courses/pgce-school-direct-primary)","interviewProcess":"Whitchurch CE Primary is the lead school and we will be involved in the recruitment process.\r\n\r\nThe interview for the River Wye Federation will include:\r\n\r\n* A short task with a small group of pupils.\r\n* An individual interview\r\n\r\nSuccessful applicants will require DBS clearance and suitable references.","howSchoolPlacementsWork":"The School Direct training is school-led training, it will last for 1 year and involve 3 placements. You will select your preferred school when you complete your application online:\r\n\r\nPlacement 1 - September until December (either key stage 1 or 2)\r\n\r\nPlacement 2 - January until March (opposite key stage to the one completed in the autumn term)\r\n\r\nPlacement 3 - April until July (return to the same key stage as the autumn)\r\n\r\nYou will have opportunity to observe and work with other year groups throughout your practice. You will receive high quality support and training opportunities at the River Wye Federation.\r\n\r\nStudents will need to attend the University of Worcester for approximately 27 days a year. You will experience a dynamic taught programme, ensuring depth and breadth across the primary subjects. This will include assignments and tasks. You will be assigned a University tutor that will work closely with your mentor at your school placements.","personalQualities":"We are looking for ambitious individuals who can demonstrate potential and show strong commitment. Our School Direct programme is for people who are willing to work hard and are passionate about training to teach. Interested?\r\n\r\nFor more information please contact our School Direct Lead, Vicky Tansley (vtansley@whitchurch.hereford.sch.uk)","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:51:28.267Z","updatedAt":"2021-09-25T15:44:50.762Z","canSponsorStudentVisa":"yes","cycle":"2024"}
