{"id":"7ba06ca1-abeb-4f56-9191-3cfe9979a9e6","name":"Primary (3-7)","code":"33GY","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_7","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"9022c205-48b9-4eab-b75c-5bd708baa320","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"0fb2b8f2-25f4-45f0-a50a-62ca25f4e8db","code":"2DW","name":"Nicholas Postgate Catholic Academy Trust"},"accreditedBody":{"id":"19a3446e-382d-4c14-83bb-a76563cef3c1","code":"L24","name":"Leeds Trinity University"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"Candidates will need to arrange through a third party","courseLength":"OneYear","feesUK":9250,"feesInternational":12500,"feeDetails":"Students:\r\nLeeds Trinity postgraduate Initial Teacher Training (ITT) tuition fees are £9,250 for home students and £12,500 for EU/International applicants. Tuition fees may rise with inflation in future years. \r\nFurther information can be found : (https://www.leedstrinity.ac.uk/study/fees-and-finance/teacher-training-pgce-fees-and-funding/)\r\n\r\nYou will not have to pay these fees upfront. Eligible UK and EU students can apply for a tuition fee loan to cover the cost of tuition fees from the government.\r\n\r\nUK students on non-salaried places studying full-time can apply for a package of maintenance funding from the government to help with general living costs and additional funding if you have children and/or a disability.   \r\nStudents can apply and find out more information at www.gov.uk/studentfinance. This website also has a calculator which gives you an estimate of what you will receive.\r\n","aboutCourse":"This course is for those wanting to teach from ages 3-7 year olds. \r\nWe believe that the most effective path to becoming an outstanding teacher is a gradual one working alongside experienced classroom practitioners. The course is filled with support and opportunities to put what you’ve learnt into practice in stages. That’s why we’ve designed our course to give you as much class and school based experience as possible.\r\n\r\nYou will be based in two of our partner schools over the year. All of the schools within the partnership are based in Teesside and are Good and Outstanding.\r\n\r\nStage one – Introduction to teaching\r\nYou’ll spend your first few months in a Good or Outstanding Primary school. Each Friday you will receive professional development : delivered by expert teachers, currently teaching, and also by experienced professionals from Leeds Trinity University.\r\nAll of the training and professional development is delivered in school so you can see theory into practice. \r\n\r\nStages 2 and 3  - Developing Your Classroom teaching and Learning Skills\r\n\r\nLate in the autumn term you will then move to your main school where you will spend the remainder of the year - working in contrasting key stages and contrasting year groups to give you as much experience as possible.\r\n\r\nThis professional support  will help develop your understanding of teaching and learning, the  curriculum and good practice and pedagogy.\r\n\r\nSubject knowledge and applied pedagogy:\r\nIn these sessions, our subject teacher experts will give you a good understanding of what it means to teach across the curriculum. You’ll study the school curriculum, and understand how other expert teachers have taught it successfully. You will learn directly from them.You’ll also learn how to plan sequences of learning that address your pupils’ needs so that you can develop your practice and have a positive impact on their learning.\r\n\r\nThroughout the course your experience and confidence will grow. Your school based mentors are always available for support and guidance.\r\n\r\nTeaching is a challenging profession. Our aim is for you to be prepared for the challenges ahead so you will flourish in your careers.","interviewProcess":"You will be notified through UCAS Track or directly from the lead school, St Patrick's, if you’ve been invited to an interview.\r\n\r\nYou’ll have an individual interview with senior members of staff, which will vary depending on the course you’ve applied for. \r\n\r\nYou will be notified of  the date, time and the location, as well as what to prepare beforehand and what will happen on the day, so it’s really important to read this email very carefully.","howSchoolPlacementsWork":"‘If there is any impact on school placements as a result of Covid 19, we will inform you before the course starts.\r\nOur lead school will source your placements, taking into account your passions, preferences and personal circumstances. \r\n\r\nYou will start your first school placement immediately in September, giving you direct and relevant experience.  You’ll work closely with your school-based subject mentor. you will be based in one class with an experienced, supportive teacher. every Friday you will receive Professional Development within school.\r\n\r\nIn November , you’ll complete a second placement in a different school. This will help you deepen your knowledge of how students learn, and extend your practice in helping that learning, in a new context. This long placement  gives you the chance to develop your practice in a school and with pupils you will get to know really well. This offers an opportunity to make a positive impact on progress in that school.\r\n\r\nDuring your second placement, you’ll spend at least ten weeks in a new school teaching more lessons with support from your mentor. You’ll become a more independent practitioner.\r\n\r\nYou’ll stay in the same school until the summer term. You will move classes in the same school at the beginning of the summer term. You will therefore have experience in teaching in two separate key stages and with three different year groups. Having extended experience in the same placement means you’ll be able to develop your practice well, build relationships and show that you’re having a positive impact on your pupils. \r\n\r\nThroughout your placements, you’ll have the support of a school-based mentor. These mentors are trained by Leeds Trinity to support you as you complete your training and assess your progress against the Teachers’ standards. You’ll also have a subject and link tutor at Leeds Trinity, who will visit you at school. They will provide quality assurance for your training and offer any support and advice you may need\r\n","personalQualities":"We’re committed to training outstanding teachers that will make a huge difference to the lives of those they teach. As such, we are looking for candidates that have:\r\n\r\n- The personal and intellectual qualities required for teaching in schools. \r\n- The commitment, attitudes and values appropriate to those of a secondary teacher\r\n- The ability to read effectively and communicate clearly and accurately in spoken and written standard English.\r\nWe treat every applicant on their own merits and value highly the experience you illustrate in your personal statement. ","otherRequirements":"Applications are enhanced by evidence of some experience in a school but it is not a condition for application.\r\nSuccessful applicants will be required to undertake an enhanced Disclosure and Barring check, sign a declaration that they have not previously been excluded from teaching or working with children.","status":1,"createdAt":"2021-07-06T10:54:19.197Z","updatedAt":"2021-08-23T16:56:35.873Z","canSponsorStudentVisa":"yes","cycle":"2024"}
