{"id":"84446e7e-f2bf-48a8-acdf-ae69b60a7be1","name":"Religious Education","code":"33QR","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"B","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"724b5d16-28dd-4431-bc17-ea4be4daedc4","code":"V6","name":"Religious education"}],"locations":[{"id":"0a87e70b-2ff6-41d9-825a-a1acc7b8543f","name":"London area","isPublished":"N","status":"N","vacancies":"B"}],"trainingProvider":{"id":"252d7e03-741e-4453-b6a8-3d361e6c9d1b","code":"E69","name":"e-Qualitas"},"degreeGrade":"1","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":6000,"feeDetails":"The tuition fee has to have VAT added at 20% (£1,200). e-Qualitas's student teachers are able to get a student loan to cover the whole amount.\r\n\r\nIf the school wishes to receive a payment to contribute to its costs in providing the in-school training, the student teacher pays a further £2,000 as a disbursement (in three instalments). This can also be covered by the student loan.\r\n\r\nWe do not have an integral PGCE. So the course fee does not include a PGCE. Trainees who wish to gain a PGCE as well as QTS can add the academic award through our higher education partner at an additional cost. The PGCE can be undertaken alongside the ITT training programme. ","aboutCourse":"This ITT course is school-based, a blend of school-led training, independent study and training provided by e-Qualitas.\r\n\r\nThe training modules cover: planning learning; managing pupils' behaviour; assessing learning; learning for all including high-attainers, EAL, those with special educational needs; overcoming barriers to learning; the organisation of the curriculum and cross-curricular issues; effective teaching of the subject. There are two assignments: one on learning for all, one on effective subject teaching. \r\n\r\nOur trainees spend most of their time in school. They move from co-teaching with experienced staff to independent teaching (with support and advice from other teachers). Most trainees are teaching about a 50% timetable by a third of the way through their course, rising to 60% in the middle term, and rising again in the final term. A 6-week placement in a contrasting school usually takes place in the middle of the training period. Trainees attend about 10 training days in central London (near Fenchurch Street). There is a comprehensive on-line library to support independent study, and pro-forma that can be used for lesson planning, observations, structure evaluative writing etc. A tutor from e-Qualitas visits for a whole day each half term. \r\n\r\nAssessment is on-going, with self-assessment, 5-weekly assessment points for the in-school trainers' assessments and feedback, and tutor assessments. The final assessment for QTS is verified by an eQ tutor who has not been previously involved in the trainee's training. \r\n\r\nThe course adapts flexibly to trainees' circumstances because we have rolling recruitment: a cycle of training days starts each term for the group of full-time trainees starting then. This enables part-time trainees and any trainees who have to take time out of the course (eg because of illness) to attend the days that they need each term.\r\n","interviewProcess":"The first interview is by the school that is interested in having the applicant as a trainee teacher. If the applicant is successful, the school's feedback enables e-Qualitas to make a conditional offer of a place. This is confirmed after the necessary conditions have been met, and an e-Qualitas tutor has visited the school. The tutor checks that the applicant is indeed suitable for entry to initial teacher training, checks that the school will make appropriate arrangements for the in-school training, and works out the individualised training plan.","howSchoolPlacementsWork":" Schools that e-Qualitas has worked with are in London and the surrounding area as well as further afield. As each trainee is based in one school for the majority of the training period, it is vital that the trainee and the school are a good 'fit'. Applicants should bear this in mind when being interviewed for a place with e-Qualitas. \r\n\r\nWe are happy to consider working with schools that are new to our partnership ie applicants can find a school that's local to them. Applicants who identify the school in which they hope to train must ask the school to contact e-Qualitas for a discussion about what their responsibilities will be and to explore their capacity to train the applicant well. \r\n\r\nMost secondary trainees focus on teaching the 11-16 age range for QTS assessment, though they should have some sixth form experience eg in the second school placement. A few trainees focus on the 14-19 age range, though they should have some Key Stage 3 experience too. \r\n","personalQualities":"The e-Qualitas course suits trainees who are independent learners who are self-motivated and able to manage their time well. You must be reflective and analytical, and have really good inter-personal skills. You must want to become an excellent teacher so that the pupils you teach do really well at school. \r\n\r\nWe also look for the attributes that make for success in the classroom eg strong subject expertise, flexibility, purposefulness, creativity, the capacity to learn from experience.\r\n","otherRequirements":"Relevant work experience is helpful because it puts the applicant into a stronger position at the start of the training period. \r\n\r\nDBS checks have to be passed, obviously, and referees should endorse the applicant's capacity to become a successful teacher. \r\n\r\nCopies of the originals of all the applicant's qualifications certificates are held by e-Qualitas, together with ID documents (passport; photo driving licence or two utility bills or similar from within the last 3 months, showing the applicant's name and address). ","status":0,"createdAt":"2021-07-06T10:51:08.667Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
