{"id":"428b1f10-0c32-4ff0-9a03-4e807095c62d","name":"Mathematics","code":"28GL","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"72345aa7-096c-488f-8649-085b8178cadb","code":"G1","name":"Mathematics"}],"locations":[{"id":"15bc63d9-356b-4784-a47c-88147ef977b9","name":"Wolsingham School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"ef7d78db-0dda-435a-931a-6a71658ce68a","name":"Tanfield School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"e8004f06-bdbf-4e82-b629-3077e8ad9de8","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"8197a07f-5718-4fc9-be40-1dd29bae338e","code":"1QB","name":"St Bede’s Catholic Comprehensive School and Sixth Form College, Lanchester"},"accreditedBody":{"id":"99d7311e-6bc7-4ef3-a36b-72a3ff429155","code":"D87","name":"Durham SCITT"},"profPost":"PG","degreeGrade":"1","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"The course is full time and runs from September until the beginning of July. The Subject Specialist will provide a week by week guide which will be followed throughout the year.\r\n\r\nThe course is made up of General Professional Studies sessions, the Subject Specialism Programme and PGCE modules. It will also involve 2 teaching placements; the first runs from the beginning of October until the first week of December. The second placement runs from the middle of January until June. There will be an enhancement carousel week after your first placement where you will gain experience in Primary, UTC and EAL. \r\n\r\nAll trainees must demonstrate that they can fully meet each of the Standards for Qualified Teacher Status by the end of the course. Trainees will be continually assessed through lesson observations and placement reports whilst on teaching placements, and through a series of 3 short assignments. Detailed portfolios of evidence are submitted 3 times during the year to demonstrate how trainees are meeting the Standards for Qualified Teacher Status. Following the first 2 submissions, trainees receive feedback on their progress. \r\n\r\nThe PGCE is accredited by University of Sunderland and assessed through 2 written assignments. The 2 PGCE training modules will be held at The Work Place in Newton Aycliffe. \r\n\r\nIf a trainee does not meet the Standards for Qualified Teacher Status, but has passed the 2 PGCE modules, the credits can still be used towards a MA programme.\r\n","interviewProcess":"The first thing we look at is your application form and your references to decide whether or not we should invite you for interview. It is, therefore, important to include all the relevant information on the form to help us make this decision.\r\n\r\nIf you are invited to interview and have a disability, please let the Course Administrator know in advance if there are any special arrangements that should be made for the interview process, for example large print copies of documentation, additional time for reading or wheelchair access to the interview rooms.\r\n\r\nYou will be sent information about a 30 minute subject specific teaching task and we will advise which year group and how many students. The interview panel will then ask you several questions to establish your motivation for wanting to teach in your chosen subject area and some administration questions. There will also be an opportunity for you to ask questions about the course. After the teaching task and formal interview, you will have a timed written and numeracy activity to complete.   \r\n\r\nThe formal interview panel will be made up of the HT and Subject Leader. A representative from Durham SCITT may also be present.","howSchoolPlacementsWork":"You can select your placement school on application however we do reserve the right at St Bede's to place you on site here or with one of our partner schools, depending on how many places are available at the time you apply.\r\n\r\n","personalQualities":"","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:49:35.539Z","updatedAt":"2021-09-30T14:02:15.253Z","canSponsorStudentVisa":"no","cycle":"2024"}
