{"id":"e7a57405-51e1-434a-a51b-62ff1b04cf53","name":"Primary (5-11)","code":"H480","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"d14ad99e-b7a6-44a7-87a0-e886b798c0de","name":"Co-op Academy Woodlands","isPublished":"Y","status":"R","vacancies":"F"},{"id":"aecbb8bc-d611-4a14-967a-574d53f3d191","name":"Co-op Academy Parkland","isPublished":"Y","status":"R","vacancies":"F"},{"id":"1e7168a4-c642-4aa2-a839-e6a44d674821","name":"Co-op Academy Beckfield","isPublished":"Y","status":"R","vacancies":"F"},{"id":"02467856-b9cf-4ad6-85fe-05b621956f9d","name":"Co-op Academy Princeville","isPublished":"Y","status":"R","vacancies":"F"},{"id":"a5d20de0-07b7-4608-89f7-be0a8c2baf54","name":"Co-op Academy Friarswood","isPublished":"Y","status":"R","vacancies":"F"},{"id":"cb464484-3e8d-4559-bd48-3c1b1b5dcf08","name":"Co-op Academy Woodslee","isPublished":"Y","status":"R","vacancies":"F"},{"id":"64493e0f-e691-477f-9576-aa164cb972ad","name":"Co-op Academy Oakwood","isPublished":"Y","status":"R","vacancies":"F"},{"id":"14fcc5c6-05a0-4a84-af71-95bcdc1904b0","name":"Co-op Academy Clarice Cliff","isPublished":"Y","status":"R","vacancies":"F"},{"id":"9e19d90a-0d20-4504-a663-2cf86ceabe9d","name":"Co-op Academy Smithies Moor","isPublished":"Y","status":"R","vacancies":"F"},{"id":"f10ed615-d497-4995-9e47-d37f2221ab07","name":"Co-op Academy Brownhill","isPublished":"Y","status":"R","vacancies":"F"},{"id":"498deadb-ce99-4308-988f-4da074743fd4","name":"Co-op Academy Portland","isPublished":"Y","status":"R","vacancies":"F"},{"id":"1876db04-861d-4a0b-8ccd-0fbc0a62cab8","name":"Co-op Academy Nightingale","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"8d43a74c-fad7-484d-b0c0-3a00f9387899","code":"2X4","name":"Co-op Academies Trust"},"accreditedBody":{"id":"cb360fcd-0c3a-4fc2-a4df-521e9475cd1c","code":"G65","name":"Bright Futures SCITT"},"profPost":"PG","degreeGrade":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":9250,"feeDetails":"Applicants who are not British citizens or a citizen of one of the EEA (European Economic Area) countries will need a visa to study in the UK. More details can be found from the [Home Office](https://www.gov.uk/government/organisations/uk-visas-and-immigration)","aboutCourse":"The Primary Schools in our trust are an excellent base to begin your training and teaching career. This course is designed to enable you to become a successful teacher of primary pupils aged 5 - 11 (Key Stage 1 & Key Stage 2).\r\n\r\nOver 125 days of the course will be spent in schools working alongside highly professional and well-qualified colleagues. Specific subject knowledge training will enable you to build up a strong knowledge of the full primary curriculum for Key Stage 1 & Key Stage 2.\r\n\r\nTrainee timetables are progressive in design, however, trainees are supported at all times to ensure a balance between challenge and support. \r\n\r\nAll trainees gain experience of both the early years framework (reception classes) and Key stage 3 (mainly year 7).\r\n\r\nProgress is monitored with your planing, teaching and assessment being observed weekly by your school-based mentor. During each placement you will also have at least one joint observation with your professional mentor. Trainees reflect on progress on a weekly basis, culminating in termly written reports produced jointly with mentors. Trainees are supported on this journey through a series of school based tasks to enable a thorough understanding of the Core Content Framework and  Teachers’ Standards.\r\n\r\nThroughout the course, trainees engage with professional development training. This training takes an evidence-informed approach to teaching and learning and is delivered by lead practitioners and specialist leaders of education. \r\n\r\nCan I refresh my subject knowledge?\r\n\r\nNot everyone feels confident in teaching every subject from the outset. As a Trainee Teacher, you should identify parts of your subject knowledge you need to refresh or deepen. \r\n* We will provide free access to our online learning platform which will tailor learning around your needs.\r\n\r\nHow do I become a qualified teacher?\r\n\r\nThe award of Qualified Teacher Status (QTS) is given based on how well you have met each of the Teacher Standards. Evidence gathered to substantiate each of the standards comes from all assignments, teaching files, reflections and observations completed during your training. A PGCE is awarded from the University of Manchester.","interviewProcess":"Following a successful application that meets our entry criteria, an interview will be arranged by Co-op Academies Trust which could be in person within a trust setting, or via an on-line platform.\r\n\r\nThe interview will include the following elements:\r\n -  A short pupil-based activity where we ask you to prepare a lesson walk through to discuss with the interview panel.\r\n\r\n - A hidden task revealed during the interview\r\n\r\n - A written task to assess your written communication skills\r\n\r\n - A formal interview with staff from Co-op Academies Trust","howSchoolPlacementsWork":"This course leads to qualified teacher status- QTS (5 - 11 years).\r\n\r\nAll trainees will undertake a short Nursery placement, as well as undertaking a Reception and Key Stage 1 placement. The timing for each placement is bespoke for each trainee.\r\n\r\nPlacement schools are chosen considering a number of factors, including trainee prior experience, training needs and location.","personalQualities":" - A passion to work and teach within the primary years\r\n - The potential to train to teach\r\n - Excellent subject knowledge\r\n - Resilience\r\n - Dedication\r\n - Enthusiasm\r\n\r\nThe Co-op Academies Trust is committed to ensuring staff at all levels develop:\r\n - Self-help \r\n - Self-responsibility\r\n - Democracy\r\n - Equality\r\n - Equity\r\n - Solidarity \r\n\r\nWe uphold our key ethical values of:\r\n - Openness \r\n - Honesty \r\n - Social responsibility \r\n - Caring for others ","otherRequirements":"All applicants must undergo a suitability to teach check: this included a disclosure and barring service check and a fitness to teach check.\r\n\r\nSome applicants may be required to complete a subject knowledge enhancement course.","status":1,"createdAt":"2022-01-05T12:43:48.967Z","updatedAt":"2022-01-19T18:21:30.310Z","canSponsorStudentVisa":"no","cycle":"2024"}
