{"id":"0e7bfe01-db3f-420c-9454-01bf29ee147f","name":"Primary","code":"24B7","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"47e51806-68e9-4ebe-a8f2-96d76ddb3f89","name":"Main Site","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"d1392666-2454-4973-8848-d743beecfc33","code":"B31","name":"The Bedfordshire Schools Training Partnership"},"profPost":"PG","english":"1","maths":"1","science":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9000,"aboutCourse":"The PGCE Primary training course operates over one school academic year and is a full time programme. All PGCE tuition fee trainees will be in school for the equivalent of  four days per week increasing to five days per week in the final term. This course is offered by The Bedfordshire Schools Training Partnership in conjunction with our Partnership schools throughout the Bedfordshire area.\r\n\r\nDuring the training year, applicants will be allocated a  trained mentor within the appropriate age phase  to oversee their training and development in both their main school placement and also in their six week complementary placement.\r\n\r\n Applicants will also be required to attend the twice weekly taught course sessions which underpin the practical, school based element of the training. These are the Professional Studies course which aims to connect theory and practice and addresses the Standards for QTS and will involve assessment via the successful of completion of  assignments & Reflective Journals. Additionally, all trainees will attend the Subject Application course which will be delivered by specialists in the relevant Primary age group and will address subject knowledge and appropriate pedagogical approaches and which will cover the curriculum requirements for the Core and Foundation subjects. ","interviewProcess":"Applications received by The Bedfordshire Schools' Training Partnership are subject to initial shortlisting by the Programme Manager. Shortlisted candidates are then invited to attend an interview which consists of a written task, a practical classroom focussed exercise as well as basic literacy & numeracy testing. Successful candidates are then informed of the outcome within two working days of the interview date.\r\n\r\nWhere the application is for a Schools Direct Salaried training place - applicants may be required to attend a second interview with their placement school\r\n","howSchoolPlacementsWork":"As a Secondary School training provider, trainees will be allocated a base school placement within a Secondary School as well as a shorter complementary placement during which time they will be allocated a subject specific mentor to oversee their training and development.\r\nThese placements will be located across Bedfordshire within our Partnership schools. We will endeavour where possible, to  place trainees within a reasonable travelling distance of their home (typically half an hour by car)","personalQualities":"We welcome applications from all suitably qualified applicants. We would encourage applicants to familarise themselves with the Teacher Standards and the Primary National Curriculum - as well as the current issues effecting education and schools.\r\nAdditionally, we are looking for applicants with excellent communication skills and who can demonstrate  commitment, enthusiasm and a genuine interest in working with young people.","otherRequirements":"In line with current safeguarding practice,  we (or the employing school) will carry out a number of pre-employment checks, including taking up references and a DBS Clearance check for all trainees prior to the start of the course.\r\n","status":2,"createdAt":"2021-07-06T10:51:31.520Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
