{"id":"e1abe333-fbd4-448d-abec-fc5f6459d8b2","name":"Design and technology","code":"D763","qualification":"qts","startDate":"2024-06-30T23:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"TA","fundingType":"apprenticeship","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"118fabd7-86d0-4a40-9e9a-e5c302abe59b","code":"DT","name":"Design and technology"}],"locations":[{"id":"c1a62480-8f3e-4b74-b81a-57de872bc7b9","name":"The Knights Templar School","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"7e52754c-f01a-41c8-8716-69aa0e201986","code":"1U4","name":"Springwood High School"},"accreditedBody":{"id":"828d1c59-36a8-4678-9a60-662565ae7172","code":"C03","name":"The Cambridge Partnership"},"english":"3","maths":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","aboutCourse":"The Apprenticeship programme is Year 2 of the internship programme. In order to be eligible for this course, ideally you will have completed Year 1 of the internship programme, be employed as an Unqualified Teacher and have the support of your employing school, who will be paying the tuition fees via the Apprenticeship Levy.\r\n\r\nThe course commences on 1 July, after which there will be 2 training days before the end of term, with readings to be completed prior to the professional training days which commence in August. \r\n\r\nOn the course you will be in school four days a week and follow a central training programme on Fridays, which augments your subject knowledge for teaching and your general professional development.\r\n\r\nDuring the course you will receive strong support from TCP in the form of a Subject Specialist Tutor (secondary) or a Phase Manager (Primary).  Well-being of trainees is crucial and we have developed a strong mechanism to support trainees in this respect.  A qualified counsellor is available at no cost to you.\r\n\r\nOver the course you will produce an e-portfolio of evidence, monitored by TCP and your school(s).  You will also have assignments to complete and your teaching will be observed regularly, with feedback to ensure strong classroom practice.","interviewProcess":"","howSchoolPlacementsWork":"Your main school placement is in your employing school Mon-Thurs for the duration of the course. You will also undertake a Contrasting School Placement for 15 consecutive Fridays from mid January until the end of the course.","personalQualities":"","otherRequirements":"To be eligible for application, candidates must have the support of the employing school and have completed an eligibility application via the Local Authority.","status":2,"createdAt":"2021-07-06T10:47:16.485Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024"}
