{"id":"67af6a53-6168-42a3-9306-215049d32cd0","name":"Business studies","code":"Z486","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"14_to_19","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"de6477b2-6027-48e6-b9f7-3206774705c2","code":"08","name":"Business studies"}],"locations":[{"id":"95a4d011-c8bd-4613-9bd6-dee444868116","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"72942f57-0ea8-4426-86fd-fa260f055e9d","code":"2HM","name":"Valley Trust (formerly TRISIS)"},"accreditedBody":{"id":"791f82c8-19fd-4339-9c7b-301dee8067ce","code":"H60","name":"University of Huddersfield"},"profPost":"PG","degreeGrade":"1","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feeDetails":"The University of Huddersfield determine the fees.  \r\n\r\nYou can apply for a tuition fee loan as part of your application to Student Finance England for loans and grants. Student Finance England will pay your fees direct to the University.\r\n\r\nYou don’t have to pay the loan back while you study. It will only be repayable when you have left the course and earn over £25,000 a year.\r\n\r\nWhen you enrol at the university they will ask you who will be paying for your fees and whether you have requested a loan. If you have not taken the loan, they will send you an invoice for the fees, which will require payment in full during the relevant academic year.\r\n\r\nIf you are an international student coming to study at the University of Huddersfield, please visit the International Fees and Finance (https://www.hud.ac.uk/international/tuition-fees/) pages for full details of tuition fees and support available.\r\n","financialSupport":"We will endeavour, where possible, to take geography and personal circumstances into account when organising school placements.  Trainees are expected to travel to the placement school and may be required to travel up to 60 minutes (public transport) from their residence.  Please be aware of potential associated travelling costs. \r\n\r\n\r\n\r\n ","aboutCourse":"Our one-year PGCE Secondary Education with QTS (Business Studies) course will prepare you to teach the 14-18 age range.  You will develop your subject specialist knowledge and gain hands-on classroom experience.  On successful completion of the course you will be ready to start your teaching career within the secondary school sector.  \r\n\r\nThe course programme is divided into two main themes:\r\n\r\n1:  Developing Specialist Subject Knowledge - \r\nYou’ll have the opportunity to develop your subject teaching in a stimulating way, using different methodologies and new technologies to inspire and engage young people. We’ll help develop your understanding of the Business Studies curriculum; how learners make progress in Business Studies; planning and curriculum development in Business Studies; examination requirements and inclusion issues in Business Studies.  \r\n\r\n2:  Supporting Learning and Progress in the Secondary School - \r\nWe’ll prepare you for the classroom, allowing you to develop your teaching skills and understanding of how to meet the needs of all learners. Themes include how young people learn, teaching and learning techniques to support pupils’ progress; behaviour management, assessment, inclusive, creative and innovative teaching methods and how to plan lessons and sequences of lessons. You will research evidence based learning theories, gain a greater understanding of current professional issues in secondary schools and begin to develop your own educational philosophy.\r\n\r\nIn school you will receive in-house training on a variety of topics including literacy and numeracy, behaviour management and the examination process etc.  You will gain experience in both the curriculum and pastoral care of pupils and have access to a range of professionals to support you with your classroom practice.\r\n\r\nIn University, you will learn in small, friendly and supportive groups, designed to give you the confidence to succeed in addition to your course tutor. Teaching is through workshops, tutorials and lectures, some with guest speakers, and through group work.  Two of the PGCE modules are at Master’s level.\r\n\r\nAssessment is typically through the completion of a range of classroom activities, written assignments, reports, personal subject audits and the development of portfolios of evidence. There are no formal examinations and the assignments are carefully designed to help you to develop your teaching practice further. Upon successful completion of the programme you will be recommended for Qualified Teaching Status, awarded by the Department for Education.","interviewProcess":"You will be shortlisted for interview based on your application. The interview process typically lasts for half a day. The following selection procedures are designed to assess your suitability to train to teach:\r\n\r\n*  You will be asked to teach a concept from your subject area \r\n*  You will participate in a group task which is designed to investigate your understanding of teaching and learning and the role of a secondary school teacher\r\n*  You will complete tasks designed to evaluate your fundamental English and mathematical skills\r\n*  You will also have an individual interview with a member of the course team which will include a discussion about your subject knowledge. \r\n","howSchoolPlacementsWork":"School based training is a fundamental part of your initial teacher training.  You will undertake at least two placements as part of the course and will spend at least 120 days in school.  You will observe experienced teachers, gain practical hands-on experience and receive supportive mentoring to help you develop into an outstanding and confident teacher practitioner.   Your in-school experience will introduce you to the wider role of the teacher in secondary education.\r\n\r\nYour Subject Mentor and Professional Mentor will support you throughout your placements and will give you access to observations, planning meetings, resource development, weekly mentor meetings and extended professional studies sessions.  \r\n\r\nYour university Link Tutor and The Valley Partnership Director of ITT will visit you also in school to guide, support and evaluate your progress.  There is an emphasis on practical engagement with the curriculum whilst developing your understanding of the theoretical perspectives which underpin the best models of practice.\r\n\r\nAs part of the course you will spend a period of time observing the Primary, Key Stage 2 provision and the Key Stage 3 provision.\r\n","personalQualities":"What we look for in our applicants:\r\n* A positive approach to life and ‘can-do’ attitude\r\n* A genuine enthusiasm for securing and safeguarding  the best opportunities for young people\r\n* A commitment to life-long learning and a reflective approach to problems\r\n* Mental strength and resilience\r\n* Strength in the ability to communicate effectively and build strong relationships\r\n* High level of personal organisation \r\n","otherRequirements":"* The ability to communicate effectively, and the intellectual and academic potential to meet the required Teachers’ Standards.\r\n* Two references. Where applicants have current / recent experience working with children or young people, one of the referees should be a member of staff who can comment on your potential to train to teach.\r\n* Offers are subject to satisfactory Disclosure and Barring Service enhanced disclosure check and trainees must not previously have been barred from teaching or working with children. You need to complete a health declaration to ensure that you have the health and physical capacity to teach. ","status":1,"createdAt":"2021-07-06T10:56:31.552Z","updatedAt":"2021-08-23T12:57:08.656Z","canSponsorStudentVisa":"no","cycle":"2024"}
