{"id":"90f3afee-d1bc-4258-acbe-96f7b3c0e589","name":"Primary","code":"B167","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"B","ageRange":"3_to_7","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"0c77ce15-8349-4bfd-be43-e26ca50f1b9e","name":"Main Site","isPublished":"Y","status":"R","vacancies":"B"}],"trainingProvider":{"id":"d14be96c-fe6c-4962-a0b9-6717cf4f9d5b","code":"R23","name":"Ripley ITT"},"profPost":"PG","degreeGrade":"9","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feeDetails":"£9250 PGCE and QTS\r\n£7000 QTS only","aboutCourse":"This primary programme focuses on the 3-7 age group. Our SCITT curriculum begins early in September and involves teaching practice in school four days a week and one training day per week. These training days will be hosted and delivered by outstanding classroom practitioners who currently teach in our partner schools and they will be held in several of our school venues according to the best expertise available for each topic.\r\n\r\nYou will have training and experience in important primary education topics, including phonics and early reading, assessment, special needs and inclusion, working with support staff and parents and leadership. There are many different subjects taught in primary education and you will audit your subject knowledge for the topics you will need to teach at KS1 and 2. Some of the training days will focus specifically on these subjects. A shared drive enables you to share resources with each other and school mentors. We will be including Sing for Pleasure Vocal Leadership in our curriculum in order to fill a skills gap identified by our school leaders.\r\n\r\nLeeds Beckett University provide the PGCE for our SCITT and this is all online. The modules perfectly compliment the training we deliver and you will gain 60 Master's level credits (https://courses.leedsbeckett.ac.uk/PGCE_distancelearning/)\r\n\r\nOur programme documentation has been described by Ofsted: \"Documentation is very well designed and contributes significantly to trainees' success on the course\" \r\n\r\nAssessment of trainees for QTS is based on all of the following:\r\n- Regular observations of practice with development discussion and action step setting\r\n- Progress towards meeting the expectations of the curriculum\r\n- A final assessment against the requirements of the Teachers Standards at the end of the programme.\r\n\r\n\r\nWe have been highly praised by Ofsted for our approach to trainee workload, keeping our requirements concise yet effective.","interviewProcess":"We currently have a blended approach to conducting interviews. Typically, the interview will take place via remote access with assessment tasks completed at a training centre. You will be asked to prepare a lesson plan beforehand and we will ask you about your ideas in the interview. There will also be a subject task and a written task which are normally completed at a named venue.\r\n\r\nWe are looking for the potential to be an excellent trainee, someone who is ready to start training in a school setting from early September. We are also looking for potential employees in our schools.\r\n\r\nThe admissions team are Safer Recruitment trained and we are committed to safeguarding children","howSchoolPlacementsWork":"You will complete placements in two  partner schools. The first placement will begin in September, an excellent time to see how rules and routines are established at the start of the academic year. You will start with focused lesson observations before you begin to plan and teach parts of lessons. After a few weeks you will be planning and delivering whole lessons, building up to approximately 7 hours per week by Christmas. \r\n\r\nThe second placement will be in a different school which will give you a contrasting experience and broaden your professional development. Again, you will gradually increase your teaching timetable and for the last few weeks will be full time in school, teaching up to 12 hours per week at that point in May and June. \r\n\r\nPlacements are selected for you on the basis of high quality mentoring, your individual training needs, the opportunity to experience the full primary age range, contrasting schools and reasonable commuting distance. We have several partner primary schools in Lancashire.\r\n\r\nOn both placements you will teach the 3-7 age range in your subject. \r\nThere may also be opportunities to spend some time in other partner schools and settings as training needs arise. There will be additional opportunities to experience pre-school and KS2 on the programme. ","status":1,"createdAt":"2022-01-12T11:37:34.700Z","updatedAt":"2022-01-12T11:39:39.129Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
