{"id":"c1444e15-40e4-46c6-b435-9e5f817cc71c","name":"Economics","code":"C885","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"14_to_19","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"cd9159fc-869f-4188-8435-3374676d6e92","code":"L1","name":"Economics"}],"locations":[{"id":"0c77ce15-8349-4bfd-be43-e26ca50f1b9e","name":"Main Site","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"d14be96c-fe6c-4962-a0b9-6717cf4f9d5b","code":"R23","name":"Ripley ITT"},"profPost":"PG","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feeDetails":"PGCE and QTS £9250\r\nQTS only £7000","aboutCourse":"We are looking for Economics graduates who are keen to teach their subject up to A level in a school and sixth form setting. This salaried school direct route involves teaching practice in school each week from Monday to Thursday, with Friday as a training day. The Friday conferences will be hosted and delivered by outstanding classroom practitioners who currently teach in our partner schools. Curriculum conferences will be held in several of our school venues according to the best expertise available for each topic. In addition, there will be subject pedagogy days during the year which will be delivered by  experienced curriculum leaders in the 14-19 age phase. \r\n\r\nLeeds Beckett University provide the PGCE for our SCITT and this is all online. The modules perfectly compliment the training we deliver and you will gain 60 Master's level credits (https://courses.leedsbeckett.ac.uk/PGCE_distancelearning/)\r\n\r\nOur programme documentation has been described by Ofsted: \"Documentation is very well designed and contributes significantly to trainees' success on the course\" \r\n\r\nAssessment of trainees for QTS is based on all of the following:\r\n- Regular observations of lessons with feedback and target setting\r\n- Progress towards meeting the Teacher Standards at Key Assessment Points\r\n- Assessment of a Best Evidence Portfolio at the end of the programme.\r\n\r\nWe have been highly praised by Ofsted for our approach to trainee workload, keeping our requirements concise yet effective.\r\n","interviewProcess":"Due to coronavirus we are currently conducting interviews via Zoom. You will be asked to submit a lesson plan beforehand and we will ask you about your ideas in the interview. There will also be a subject task and a written task which are normally completed at a named venue.\r\n\r\nWe are looking for the potential to be an excellent trainee, someone who is ready to start training in a school setting from early September. We are also looking for potential employees in our schools.\r\n\r\nThe admissions team are Safer Recruitment trained and we are committed to safeguarding children","howSchoolPlacementsWork":"On this salaried school direct programme you will be employed by the school and will have a teaching timetable Monday to Thursday with training days on Fridays. You will need to gain some experience in a second setting during your training and this will be arranged during the programme.\r\n","personalQualities":"We are looking for people who are keen to learn in a school setting and this model suits trainees who are able to learn as they go along and incorporate their own experience into this learning process. Successful applicants will have an understanding of the professionalism and resilience needed to become a teacher and to be reflective learners. A real commitment to a career in teaching, a love of their subject and positive attitude towards young people are essential qualities.\r\n","otherRequirements":"Applicants who are successful at interview will need the following before they can start the programme:\r\n-\tDBS and barred list check\r\n-\tMedical check\r\n\r\nIt is important that you have a good awareness of what the role of a teacher involves so that you can be sure it is the right career choice for you. We offer school experience for people at all stages of this career decision, including after interview, in order to support you with this.\r\n\r\nWe welcome applicants of all ages, from university graduation to mature career changers.","status":0,"createdAt":"2021-07-06T10:47:29.277Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"On salaried school direct programmes trainees are paid by the employing school on the unqualified teacher scale. They do not pay tuition fees to the SCITT, which awards QTS. The PGCE is available as a distance learning course with its own fees. "}
