{"id":"a82fe754-3248-49a1-874a-04e087a3c72b","name":"Primary","code":"2J8C","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"311e67d2-0b70-467e-9b85-105fec937499","name":"St Francis Church of England Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"21f1aacd-067b-43d8-94bb-1d9b51023988","name":"Bournville Village Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"f45922ca-74de-45c6-8fb8-2f5f432da262","name":"Kings Norton Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"a22ed643-8de4-496b-ae84-17013c9bd1ce","name":"Al-Furqan Primary School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"f2b7cf88-1ee5-4230-a382-9a874f85a675","code":"22T","name":"Bournville Village Primary School"},"accreditedBody":{"id":"4aa8177a-27b8-4566-b77a-c45515e46739","code":"N36","name":"Newman University"},"profPost":"BO","degreeGrade":"1","english":"2","maths":"1","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"Equivalency tests for GCSE English language, mathematics and science are available.  Please contact admissions@newman.ac.uk for details","courseLength":"OneYear","feesUK":9250,"aboutCourse":"The programme is one-year, full-time course from September until July and is delivered within the term dates of the schools within the Alliance. The majority of the programme is delivered in school, through school-based placements in our alliance schools. The academic elements of the programme are delivered by Newman University, from whom we purchase the most extensive School Direct programme that they offer. Additional, relevant training is provided by current, experienced practitioners during the placements by our alliance schools. \r\n\r\nYou will learn the principles of curriculum design and delivery, and theories of learning and teaching, alongside developing practical insights and skills in the effective teaching and assessment of children. Trainees are encouraged to develop into reflective teachers who can respond effectively to the learning needs of children of all abilities and needs. You will be assessed against the Teacher Standards through regular lesson observation with supportive feedback and ongoing self-reflection on your progress. Our course maximises your experience in classrooms, but also takes advantage of the depth and breadth of experience of Newman University tutors.\r\n\r\nYou will benefit from regular University tutor visits and training at Newman University, focused on pedagogy, professional studies and support with academic writing.  Our partnership with Newman University will support you in completing Masters Level assignments leading to the award of Post Graduate Certificate in Education (PGCE) alongside Qualified Teacher Status (QTS)  These assignments show how practice and research combine to provide a framework within which you teach, refer to practical pedagogy in the classroom, research of academic literature and both reflection and evaluation.  You will also be invited to undertake subject audits in English, Maths and Science. Assessment of the PGCE programme combines course assignments and professional practice in school, aimed at enhancing your early career prospects and enabling you to be the best teacher you can be.\r\n\r\nIt is desirable that you have undertaken some school experience, or plan to do so before the course commences. \r\n\r\nKey Features:\r\n\r\n- Placements in two wonderful schools within Bournville Alliance\r\n\r\n- Trainees are supported to teach an increasing percentage of the curriculum over the year \r\n\r\n- Full postgraduate PGCE award including 60 credits at Master's level\r\n\r\n- Extensive support provided by high-quality tutors, school colleagues and staff\r\n\r\n- Regular university tutor observations/visits to support schools and trainees’ development\r\n\r\n","interviewProcess":"Should you be invited for interview, it will be held at a school within  Bournville Alliance (not necessarily the school you will be placed in). Covid restrictions may mean that the interview is held virtually.\r\n\r\n- You will be asked to deliver (or present virtually) a 10-minute learning activity with a small group of children . You will be briefed ahead on this e.g. A reading-based task to six year three children.\r\n\r\n- A panel consisting of representatives from Bournville Alliance Schools and from Newman University will interview you. Amongst others, questions will be about your views on education, why you want to train to be a teacher and your expectations about the course.\r\n\r\n- You will have the opportunity to ask any questions you may have about the course.\r\n\r\n- If you are successful and accept a place, you will have the chance to meet other Schools Direct trainees to gain a greater understanding of becoming a trainee.","howSchoolPlacementsWork":"Across three terms, you will be placed at two different schools. The autumn term will be spent at your first placement school, returning there for the second half of the spring term and the whole of the summer term. The first half of the spring term is where you will spend your second  placement and this will be in a different year group - in most cases a different key stage, too. This will give you a more rounded experience and increase your chances of employment.\r\n\r\nPartner schools are selected because we work closely with them on various matters aside from teacher training and we know the standard of teaching is high. In school, you will be based with an experienced class teacher and will benefit from a school-based tutor who, in most cases, is a member of the school's senior leadership team.\r\n\r\n","personalQualities":"Hallmarks of Bournville Village Primary School trainees who have gone on to become successful teachers are:\r\n\r\n- Coachable (you are willing to act on advice)\r\n\r\n- Resilient\r\n\r\n- Enthusiastic\r\n\r\n- Professional","otherRequirements":"If you studied outside of the UK, you will need to visit NARIC www.naric.com as you will need a certificate of proof for equivalence\r\n\r\nAlthough it will not affect your application, we would recommend spending some time in a school. ","status":1,"createdAt":"2021-07-06T10:51:18.377Z","updatedAt":"2021-10-06T08:36:34.133Z","canSponsorStudentVisa":"no","cycle":"2024"}
