{"id":"3161eb87-a0ac-448b-b37a-0b389cb6f2fa","name":"Modern Languages","code":"2BY8","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"4608e5e3-2a1a-48a1-8236-56c7af5a139d","code":"24","name":"Modern languages (other)"},{"id":"ce8523ef-9236-4cd9-b260-d826c7a521b3","code":"ML","name":"Modern Languages"}],"locations":[{"id":"71a01667-a413-4ae5-bd0b-628d0f8ce993","name":"Prendergast School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"33037363-9ed9-4cfd-8172-549aa9b81953","code":"1H3","name":"Prendergast School"},"accreditedBody":{"id":"36425fae-da68-4e79-89de-8b41ea733c37","code":"K60","name":"King’s College London (University of London)"},"profPost":"BO","degreeGrade":"9","additionalDegreeSubjectRequirements":"false","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":21000,"feeDetails":"\r\n","financialSupport":" King’s will automatically assess your eligibility for a bursary when a place on a PGCE course is offered. King’s will apply for the funding on your behalf once the terms of your offer have been met and you have enrolled on the course","aboutCourse":"\r\nOur PGCE MFL course offers two language combinations:\r\nSpanish major with French as a minor\r\nFrench major with Spanish as a minor\r\n\r\nThe course provides practical and theoretical ideas about language teaching from tutors and practising teachers. You will be able to participate in the research projects of the course tutors and develop as classroom researchers over the course. In the last research assessment exercise, the department was rated second in the UK (REF, 2014).\r\n\r\nKey benefits\r\nAn Ofsted Outstanding rated course that is designed around a strong research base to provide you with the knowledge and essential skills for a successful teaching career.\r\nA sociable course where you will be expected to work with others, discussing issues and problems about teaching.\r\nTrainees benefit from our central London location and participate in specially organised events such as a workshop at the BFI, visits to the French, German and Spanish Institutes, and other regular conference events.\r\nAt the conclusion of their PGCE course in July 2021 74% of our trainees had been employed as NQTs at schools in the UK and abroad.\r\nTwo assessed pieces of coursework give you 60 Master's-level credits - a third of an MA - which puts you well on the way to a Master's degree in your chosen profession\r\n\r\nPGCE courses at King’s are rated Outstanding by Ofsted. One reason is the strong research base which informs the course. In the last research assessment exercise, the department was rated second in the UK (REF, 2014\r\n\r\nFor  further details about assessment, go to: \r\n[KCL.ac.uk](https://www.kcl.ac.uk/study/postgraduate/taught-courses/pgce-modern-foreign-languages)\r\n","interviewProcess":"Before you can be offered a place on a the School Direct PGCE programme, you will need to attend an in-person interview at King's College, usually within 40 days of your application submission date. You will also be invited to attend an interview at Prendergast School with the Head of ITT and the Head of Faculty. \r\n\r\nPlease ensure that you will be able to attend an interview during this time and are able to keep a full day free. Further information on PGCE interviews can be found on the UCAS website.\r\n\r\n","howSchoolPlacementsWork":"You will complete two blocks of teaching experience.  The first is for 4 days a week and lasts for 15 weeks (October - January) and the second is for 5 days a week and lasts for 13 weeks (February  - June).  One placement will be based at Prendergast School and the other will be based in another secondary school in Lewisham.\r\n\r\nIn each of your placements you will be supported by an experienced trained mentor and have the opportunity to attend in school professional study sessions.\r\n\r\nPrendergast school is an 11-18 school so you may have the opportunity to teach post 16 students during your placement there.\r\n\r\nOur partner schools are  Prendergast Ladywell School, Prendergast Vale School and Addey and Stanhope School,  Your second placement will be selected according to your individual training needs. ","personalQualities":"We will be looking for evidence that your English knowledge is both broad and deep as well as being up to date.  Some evidence of working with young people, as a Teaching Assistant, Student Ambassador, youth worker, etc will help your application. We are looking for applicants who are able to work closely and effectively with other teachers and who can inspire young people to bring out the best in themselves. As such, good communication skills and a confident and caring personality are an advantage.","otherRequirements":"An Enhanced Disclosure and Barring Service (criminal conviction check) and Occupational Health check are required for the teacher training programmes. There is a fee of £46.55 for the DBS check","status":1,"createdAt":"2021-07-06T10:57:25.001Z","updatedAt":"2022-01-11T15:18:07.223Z","canSponsorStudentVisa":"no","cycle":"2024"}
