{"id":"cd67efea-3b61-4d5d-8d3a-319ae661c623","name":"English","code":"2J7L","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3aed1aa8-ae46-4b68-92bb-a6cc20655c59","code":"Q3","name":"English"}],"locations":[{"id":"71a01667-a413-4ae5-bd0b-628d0f8ce993","name":"Prendergast School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"33037363-9ed9-4cfd-8172-549aa9b81953","code":"1H3","name":"Prendergast School"},"accreditedBody":{"id":"36425fae-da68-4e79-89de-8b41ea733c37","code":"K60","name":"King’s College London (University of London)"},"profPost":"BO","degreeGrade":"9","additionalDegreeSubjectRequirements":"false","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":21000,"feeDetails":"\r\n\r\n","financialSupport":" King’s will automatically assess your eligibility for a bursary when a place on a PGCE course is offered. King’s will apply for the funding on your behalf once the terms of your offer have been met and you have enrolled on the course","aboutCourse":"The PGCE English at King's gives trainees practical and theoretical ideas on the teaching of English as well as modelling ways in which English can be taught in the classroom. Trainees benefit from the college’s unique location on the South Bank and are encouraged to visit the nearby Globe Theatre, Tate Modern and the Saison Poetry Library. The course is led by an experienced team of English educators with a reputation for excellence in their training methods\r\n\r\nThis is a full-time course that consists of four required modules and two blocks of teaching experience.  One will be based at Prendergast school and the other will be based in another secondary schools in Lewisham. You will complete the course within ten months, studying September to June. You must take modules totalling 120 credits to meet the requirements of the qualification.\r\n\r\nYou’ll engage in education, pedagogy and professional studies sessions and curriculum workshops. These will take place in both university and school settings and will develop your expertise in general educational and professional issues, as well as subject pedagogy. The course also prepares students to teach outside the classroom. \r\n\r\nYou’ll gain the skills and understanding to take up positions in schools as a teacher of your subject with the potential to contribute fully to the life of the school.\r\n\r\nPGCE courses at King’s are rated Outstanding by Ofsted. One reason is the strong research base which informs the course. \r\n\r\nFor  further details about assessment, go to: \r\n[KCL.ac.uk](https://www.kcl.ac.uk/study/postgraduate/taught-courses/pgce-English)\r\n","interviewProcess":"Before you can be offered a place on a the School Direct PGCE programme, you will need to attend an in-person interview at King's College, usually within 40 days of your application submission date. You will also be invited to attend an interview at Prendergast School with the Head of ITT and the Head of Faculty. \r\n\r\nPlease ensure that you will be able to attend an interview during this time and are able to keep a full day free. Further information on PGCE interviews can be found on the UCAS website.\r\n\r\n","howSchoolPlacementsWork":"You will complete two blocks of teaching experience.  The first is for 4 days a week and lasts for 15 weeks (October - January) and the second is for 5 days a week and lasts for 13 weeks (February  - June).  One placement will be based at Prendergast School and the other will be based in another secondary school in Lewisham.\r\n\r\nIn each of your placements you will be supported by an experienced trained mentor and have the opportunity to attend in school professional study sessions.\r\n\r\nPrendergast school is an 11-18 school so you may have the opportunity to teach post 16 students during your placement there.\r\n\r\nOur partner schools are  Prendergast Ladywell School, Prendergast Vale School and Addey and Stanhope School,  Your second placement will be selected according to your individual training needs. ","personalQualities":"We will be looking for evidence that your English knowledge is both broad and deep as well as being up to date.  Some evidence of working with young people, as a Teaching Assistant, Student Ambassador, youth worker, etc will help your application. We are looking for applicants who are able to work closely and effectively with other teachers and who can inspire young people to bring out the best in themselves. As such, good communication skills and a confident and caring personality are an advantage.","otherRequirements":"An Enhanced Disclosure and Barring Service (criminal conviction check) and Occupational Health check are required for the teacher training programmes. There is a fee of £46.55 for the DBS check","status":1,"createdAt":"2021-07-06T10:57:25.105Z","updatedAt":"2022-01-11T15:06:43.843Z","canSponsorStudentVisa":"no","cycle":"2024"}
