{"id":"c423c5cd-32c8-4087-99bd-64fb906f7a94","name":"Chemistry","code":"39PB","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"912d4fb4-761b-42e9-8dc6-e968b791ea4e","code":"F1","name":"Chemistry"}],"locations":[{"id":"9b30d00c-9343-4ba7-ad72-7fe65816970d","name":"Fernhill School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"0e3f412d-999c-4e3d-be17-209c8948b977","name":"Court Moor School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"49b3d4a1-7001-45e1-9266-91f835a3ce85","name":"Wavell School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"850c9f18-1a49-4050-aa17-349815ec9857","name":"Ash Manor School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"ad06cb1f-1e35-4952-8cf8-4d543cc188af","name":"Tomlinscote School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"9e2d1b5a-f98d-4691-acd4-4eba562fd1ac","name":"Rodborough","isPublished":"Y","status":"R","vacancies":"F"},{"id":"100258cb-2e4e-4705-bc99-df603bbb5eb6","name":"Aldworth School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"397bec91-96d9-4560-b795-db05bbb17a4c","code":"2J8","name":"Court Moor Partnership"},"accreditedBody":{"id":"6439adcc-af64-4d3d-a1da-de045755db06","code":"R12","name":"The University of Reading"},"profPost":"BO","degreeGrade":"9","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"This course will offer trainees an excellent route into teaching. You will be supported by a very experienced mentor at both of your training schools. The course is offered in collaboration with the University of Reading, which has an outstanding record in teacher training.\r\n\r\nThe Court Moor Partnership is led by Court Moor School, one of the highest performing schools in Hampshire. Most of the weekly Professional Studies sessions will be held at the main site. All of our partner schools (all within easy commute of each other - in Fleet, Farnborough, Frimley and Godalming) are welcoming and supportive of trainees, and open to visitors who would like to observe some lessons and meet staff prior to applying.\r\n\r\nThe course has a good balance of time spent in university and at school, allowing trainees to spend their early phase at school observing lessons and learning how the school operates, before beginning to teach your first lessons. You will be assessed at the end of each term by your university tutor. QTS is awarded in June 2021, provided evidence has been met across the teaching standards.\r\n","interviewProcess":"Interviews are conducted by senior teachers. We usually ask candidates to teach a 'mini lesson' on an accessible topic with carefully selected students, followed by an interview with the head of department and an assistant headteacher.","howSchoolPlacementsWork":"Trainees spend the first two weeks of their course at university. The main placement begins in mid-September, at which point you will spend two days at university and three days at your school each week. At this stage, you will mainly be observing colleagues and gaining an understanding of the school. \r\n\r\nAfter October half-term, this increases to four days each week at school, and you will begin teaching your first lessons.\r\n\r\nIn January, you will begin your second placement, which will be roughly six weeks. This will always be at one of our partnership colleges, e.g. Farnborough Sixth Form College or HSDC Alton.\r\n\r\nFrom March, you will return to your main placement school, until June.\r\n\r\nPlease visit https://www.court-moor.hants.sch.uk/ to find out more about the school and our ITT partnership.\r\n","personalQualities":"Candidates must demonstrate an enthusiasm for their subject and a passion for working with young people to help them to fulfil their potential. Teachers must be innovative, committed and conscientious. Confidence is crucial, too, but it is something which can be developed during training.","otherRequirements":"All applicants will be required to successfully complete a DBS (Disclosure and Barring Service) check before appointment.","status":1,"createdAt":"2021-07-06T10:55:07.737Z","updatedAt":"2021-10-11T17:41:00.524Z","canSponsorStudentVisa":"yes","cycle":"2024"}
