{"id":"d867061f-9085-4047-b7c9-ccee7c746ad8","name":"Primary with mathematics","code":"N925","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"286cf12f-b3e3-41c5-9f33-2ff7807d2df0","code":"03","name":"Primary with mathematics"}],"locations":[{"id":"1f84735b-2003-4d07-99cc-07b8721cb16a","name":"Sneinton St Stephen's C of E Primary School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"ffd5b0ec-5fdf-4981-81e5-4938ca5f265a","code":"5W1","name":"Transform SCITT – Inspiring Leaders Teacher Training"},"accreditedBody":{"id":"cf792652-386e-43cc-ad12-ffd24d652894","code":"1BJ","name":"Discovery SCITT – Inspiring Leaders Teacher Training"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"Equivalencies are offerred to candidates that accept their places with ILTT.","courseLength":"OneYear","feesUK":9250,"feesInternational":9250,"feeDetails":"Financial Support\r\n\r\nOn our course, trainees are entitled to the same financial support as other teacher training courses. Those from the UK or EU are eligible for student loans in order to help cover tuition fees and maintenance.\r\n\r\nTo find out more about your a student finance loan please see our website. \r\n\r\n\r\n[Click here](https://www.inspiringleadersscitt.com)\r\n\r\n\r\n0116 3184066 or email us at info@iltt.org.uk","financialSupport":"\r\n\r\n\r\n \r\n[Click here:](https://www.inspiringleadersscitt.com)\r\n\r\n\r\n0116 3184066 or email us at info@iltt.org.uk","aboutCourse":"Our General Primary with Maths course will require you working in two contrasting schools across our partnership, depending on the location selected. We call these placements your host and your alternative school. You will complete your placement at your host school in the Autumn and Summer term, whilst your alternative placement will be completed in the Spring term. With each placement, you will change year group to cover these 3 age phases: Year 1 and 2; Year 3 and 4; Year 5 and 6, ensuring you gain a variety of experience so you can work out where you would like to be when you qualify as a teacher.","interviewProcess":"\r\n\r\n“Leaders are constantly evaluating the recruitment and selection processes to make sure they attract high-quality candidates with the skills, the moral purpose and the ‘staying power’ to be a successful teacher” – Ofsted 2017\r\n\r\n\r\nSelecting the right people to train with us in our schools is of utmost importance.\r\nOur interviews are now virtual using MS Teams/Zoom and  we aim to make you feel relaxed enough to show us who you really are.\r\nThe interview includes includes: \r\n•\tan opportunity to find out more about us;\r\n•\tan formal interview in which we find out more about you and establish whether you are suitable to train with us and in our schools;\r\n•\tA lesson talk through that you will pre-plan which the interviewer will then ask you to expand on during the interview. (Full details are provided prior to the interview)\r\n•\tsafeguarding & identity checks.\r\n\r\n[Applying to our course] (https://www.inspiringleadersscitt.com/applying)","howSchoolPlacementsWork":"General Primary\r\nOur General Primary course will require you working in two contrasting schools across our partnership, depending on the location selected (Don't worry, if you apply to a Leicestershire course, we won't be sending you to Nottingham and visa versa). We call these placements your host and your alternative school. You will complete your placement at your host school in the Autumn and Summer term, whilst your alternative placement will be completed in the Spring term. With each placement, you will change year group to cover these 3 age phases: Year 1 and 2; Year 3 and 4; Year 5 and 6, ensuring you gain a variety of experience so you can work out where you would like to be when you qualify as a teacher.\r\n\r\n[Click here](https://www.inspiringleadersscitt.com/the-course)","personalQualities":"At Inspiring Leaders Teacher Training we are looking for 5 key qualities in our trainee teachers. These key qualities are what we think you will need in order to help you become a Qualified Teacher.\r\n*Emotional Intelligence and Resilience\r\n*Knowledge and Professionalism\r\n*Creativity\r\n*Good Communication Skills\r\n*A Capable Reflector\r\n\r\nWe are looking for candidates that have a good awareness of current educational issues and have a deep understanding and open mind about how they affect children and schools. As well as an ability to act with professionalism and integrity. ","otherRequirements":"[Call us on 0116 318 4066 or email info@iltt.org.uk. Click here for more info](https://www.inspiringleadersscitt.com)","status":1,"createdAt":"2021-07-06T10:55:15.576Z","updatedAt":"2021-10-05T08:55:56.038Z","canSponsorStudentVisa":"no","cycle":"2024"}
