{"id":"003123bb-d64e-4faf-803e-f84a83c629f4","name":"Belle Vue Girls’ Academy","code":"2G4","type":"lead_school","isAccreditedBody":false,"urn":"138087","ukprn":"10037038","address":{"addressLine1":"Belle Vue Girls’ Academy","addressLine2":"Thorn Lane, Bingley Road","town":"Bradford","county":"West Yorkshire","postcode":"BD9 6NA"},"contact":{"website":"https://www.bvgacademy.co.uk/Initial-Teacher-Training/","email":"vwa@bvg.ngfl.ac.uk","telephone":"1274492341","fullName":"Teacher Training Belle Vue Girls'"},"location":{"latitude":53.8200767,"longitude":-1.8132765},"trainWithUs":"Belle Vue Girls' Academy is the lead academy for the School Direct programme of the Bradford Diocesan Academies Trust (BDAT). The trust secondary schools are: Belle Vue Girls’ Academy, Immanuel College, Buttershaw Business and Enterprise College and Bradford Forster Academy. All schools within the trust are driven by a set of shared values which guide how we operate, teach and support each other. Our values are aspiration, inclusion, excellence, compassion and resilience. Two of the schools are of Church of England schools and two are of no faith. However all follow traditional values of respect and trust. Working with Birth to 19 SCITT, Teaching School Alliance and Multi Academy Trust, we are able to offer a unique and exciting opportunity to train as a teacher within a diverse range of academies. Working with such partners is an exciting way of training to become a teacher. Your training involves practising your teaching skills with groups of students with effective support from a school mentors; you are treated just like you're a member of the school staff, someone who the trust schools are often looking to employ at the end of the year.\nOur academies are committed to providing the highest standard of education for the young people in the Bradford District. We are keen to recruit student teachers who share the same commitment. If you share our vision for education, we want to hear from you.","trainWithDisability":"We believe that teachers with disabilities make an important contribution to schools both in the classroom and in shaping the wider culture and ethos of the schools they work in.\nWe adhere to The Equality Act 2010 and Special Educational Needs and Disability Act 2001, which require teacher training providers to ensure they are not discriminating against applicants with disabilities or special educational needs.\nAll our partner Schools value diversity and the unique contribution that all their staff and trainees bring.","accreditedBodies":[{"id":"58e814cb-bf42-4d3d-9486-b3ea827fd9e2","code":"259","name":"Bradford Birth to 19 SCITT","description":"Bradford Birth to 19 SCITT is an accredited provider with a proven Ofsted record of training the next generation of teachers. All school in the partnership are committed to providing the highest standard of education. We are keen to recruit student teachers who share the same commitment. If you share our vision for education, we want to hear from you. We will provide training of the highest quality, delivered by outstanding practitioners through a bespoke training package, which will make the most of your knowledge and skills. After a year’s successful training, you will achieve Qualified Teacher Status (QTS)."}],"createdAt":"2021-07-06T17:55:40.451Z","updatedAt":"2021-07-06T17:55:40.451Z"}