{"id":"00782614-9301-40e4-8832-9a74cc1bbb07","name":"Essex Teacher Training","code":"E75","type":"scitt","isAccreditedBody":true,"ukprn":"10002327","address":{"addressLine1":"ACL Harlow","addressLine2":"Partridge Road","town":"Harlow","county":"Essex","postcode":"CM18 6TE"},"contact":{"website":"https://essexteachertraining.co.uk/","email":"info@essexteachertraining.co.uk","telephone":"3330139982","fullName":"Admin"},"location":{"latitude":51.757474,"longitude":0.097486},"trainWithUs":"Essex Teacher Training is a large provider, offering a variety of different school-based routes to QTS. We train around 150 trainees a year in partnership with schools across Essex and its adjoining counties. Working with so many schools we can offer you training in your local area, which is tailored to suit your individual requirements. We offer training in both primary and secondary schools, both full time and part-time (over 2 years) and we also offer the primary programme in special schools too. We have a great partnership with our schools and headteachers value the contribution trainee teachers can make to their schools. As a result, trainees enjoy their training and the vast majority gain employment in one of our partner schools, once qualified. All of our tutors are experts in their field and many are still teaching, so you benefit from their knowledge and experience, helping you develop your own teaching as you progress through the course. We pride ourselves on the support we offer our trainees and put trainee wellbeing at the heart of what we do. You will be supported by an in-school mentor as well as an external tutor from us. Our programme leaders are both mental health first aid instructors and all our core staff have completed mental health training with MHFA England. We are committed to providing a supportive environment for you to complete your training. There are 3 areas of Essex in our locations section for SCITT but SD programmes available across Essex.","trainWithDisability":"Here at Essex Teacher Training we are committed to offering all prospective trainees the opportunity to gain QTS. Please let us know if you have a specific need and/or require any adjustments at the interview stage or throughout the ITT programme.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:49:43.095Z","updatedAt":"2021-10-12T22:40:22.790Z"}
