{"id":"010f4997-79c0-45f4-9e74-6ba418c0d2a5","name":"Oakthorpe Primary School","code":"151","type":"lead_school","isAccreditedBody":false,"urn":"131407","ukprn":"10045988","address":{"addressLine1":"Tile Kiln Lane","county":"London","postcode":"N13 6BY"},"contact":{"website":"http://www.2schools.org/","email":"training@oakthorpe.enfield.sch.uk","telephone":"0208 807 6906","fullName":"Isabella Meraviglia-Mora"},"location":{"latitude":51.6139314,"longitude":-0.0935379},"trainWithUs":"2Schools Consortium has been an accredited provider since 2002 and has a wealth of experience in mentoring trainees and in delivering training.\nThe 2Schools Consortium (Ofsted Outstanding, May 2014) consists of a lead school, Oakthorpe Primary School, in Enfield, and approximately 40 partnership schools where trainees are placed.\nAll trainees on the Postgraduate Teaching Apprenticeship (PgTA) Programme have the opportunity to work towards a PGCE award which will be validated by the University of Brighton.\nQuotes:\n\"I think this is the best way to get into teaching having had friends who have done other routes. I feel so prepared and feel as though I know what I am doing from the way the training is structured and the amount of support it ensures.\"- ECT July 2021\n\"Fantastic course! I feel very prepared for the year ahead and was very happy with how helpful and caring the staff were. They were always there to help you overcome difficulties! 1000% would recommend this course to others considering teaching.\" -ECT July 2021","trainWithDisability":"At 2Schools we want to enable everyone to reach their full potential. After all teaching is the profession that unlocks potential in children. If you do have and declare a disability we will do everything we reasonably can to make special arrangements. Please provide details on your application form so that we can ensure this happens. This will not affect your application.\nWe are committed to provide equality and fairness for all in our recruitment and employment practices and not to discriminate on grounds of age, disability, gender reassignment, marriage/civil partnership status, pregnancy and maternity, race, religion or belief, sex, or sexual orientation. We oppose all forms of unlawful and unfair discrimination.\nWe have regularly successfully supported a number of trainees with dyslexia, mental health conditions and learning difficulties and will continue to provide high level of support for any disability.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"82fd3a3b-6bfd-40d1-8343-0c19e34a847a","code":"T92","name":"2Schools Consortium","description":""}],"createdAt":"2021-07-06T17:48:48.789Z","updatedAt":"2021-07-07T15:22:59.281Z"}
