{"id":"018e46de-f2a3-4792-997f-9a7b3ddde268","name":"Chiltern Training Group part of the Chiltern Learning trust","code":"15N","type":"lead_school","isAccreditedBody":false,"ukprn":"10055370","address":{"addressLine1":"Alexandra Avenue","county":"Luton","postcode":"LU3 1HE"},"contact":{"email":"recruitment@ctg.ac.uk","telephone":"01582 493 680","fullName":"Chris Gill, Director of Teaching School"},"location":{"latitude":51.8913483,"longitude":-0.4240396},"trainWithUs":"We are a multi-academy trust currently comprising Cedars Upper School, Dallow Primary School, Denbigh High School, Challney High School for Boys, Challney High School for Girls, Lark Rise Academy, Linslade School, Marston Vale Middle School and Putteridge High School. We are also opening a new secondary school in Luton in September 2018 called the Chiltern Academy.\n\nWe are committed to excellent standards of teaching and also work in partnership with a variety of local and national organisations to help raise the attainment of all learners whilst contributing towards system-wide improvement and the development of high-quality teachers entering the profession.","trainWithDisability":"We welcome applicants with disabilities and other needs and where possible reasonable adjustments will be made to carry out your duties and meet the standards of teaching effectively.\nWe pride ourselves in supporting trainees however small or large your concerns may be. Your teacher training programme will be personalised for you to reach your full potential. This includes a range of academic and professional support from the central team and your placement school as well as your mentor.","accreditedBodies":[{"id":"d4a93000-8658-4679-8125-92f6e35835f9","code":"C59","name":"Chiltern Training Group","description":"We also provide School Centred Initial Teacher Training (SCITT) through the Chiltern Training Group (CTG), an ‘outstanding’ Initial Teacher Training provider, and professional development and support through the Chiltern Teaching School Alliance (CTSA)."}],"createdAt":"2021-07-06T17:56:04.650Z","updatedAt":"2021-07-06T17:56:04.650Z"}