{"id":"01d80a6c-df73-444e-93d8-661684d1eab8","name":"Exeter Consortium","code":"1QX","type":"lead_school","isAccreditedBody":false,"urn":"144072","ukprn":"10063074","address":{"addressLine1":"Exwick Heights Primary School","addressLine2":"Exwick Lane","town":"Exeter","county":"Devon","postcode":"EX4 2FB"},"contact":{"website":"http://www.exeterconsortium.com","email":"louise@exeterconsortium.com","telephone":"01392 927171","fullName":"Louise Honan"},"location":{"latitude":50.7293377,"longitude":-3.5575769},"trainWithUs":"We are a successful partnership of schools around Exeter, created by the schools themselves. We deliver high quality, school-based programmes, devised in collaboration with our headteachers. One of our great strengths is our ability to personalise training with a strong emphasis on work-life balance and 1:1 support. We offer a rich experience, having a contrasting mixture of schools for placements, consisting of secondaries, around 70 primaries, a hospital school, special schools and an FE College. The primaries offer great diversity, from schools of less than 100 pupils to more than 600, from urban sites to small villages. We demonstrate high employment rates and are recognised as providing well-trained, sought after ECTs. We pride ourselves on training top quality teachers who:\n* put pupil progress at the heart of everything they do\n* continuously develop themselves using the principles of deliberate practice\n* root their classroom practice in up-to-date and relevant research.\nThe major benefit of this route is that Trainees have the opportunity, right from the start, to join an effective school and build practical experience. Trainees come together for the taught elements of the course each week, which is delivered by highly skilled current teachers who work in our excellent schools. A strong and supportive peer group develops, and life-long friendships are forged. The Primary (3-7 and 5-11) programmes are offered in partnership with SWTT and Bath Spa University, an Ofsted rated Outstanding provider for ITT, who deliver the PGCE aspect of the course on site, here in Exeter.","trainWithDisability":"We believe in creating a supportive and inclusive environment for all. We provide confidential information, guidance and support to students who have additional educational needs or disability, or a medical condition. Support for trainees was recognised as a strength of our partnership in our recent Ofsted inspection: 'The personalised support that trainees receive means that trainees’ needs are met exceptionally well.' All successful applicants to the programme will be taken through an occupational health check, so that we can create an access plan to best support them. We will work with all applicants to make adaptations to support their access to the programme. For example, this can include using online resources, coloured paper and slides for students with dyslexia, offering additional planning support and considering the best placement schools to support students with accessibility issues and other disabilities. We offer additional coaching support for some trainees, nurture sessions to support in identified areas and will support schools in different ways in order to ensure that trainees have the best opportunities for success. We have built wellbeing training into our programme as we believe this is important for all our trainees. We have several layers of tutor support to ensure trainees have a comprehensive support package. Trainees also have access to a confidential counselling service which also offers 24hr mental health support, legal, financial and other kinds of advice to assist trainees, whatever their needs. Our trainees and ECTs consistently rate our pastoral support as excellent.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"ff5e78c6-2928-44d6-b4e6-8fa2fed5feb7","code":"S66","name":"South West Teacher Training","description":"SWTT SCITT was formed in 1993 with the remit of providing high calibre teachers for Exeter and South West Schools. We pride ourselves in continuing with this challenge, and also with producing teachers who teach across the country. One of the great strengths of SWTT is our ability to personalise the QTS programmes and provide one to one support and challenge for each of our trainees. SWTT is based along with Exeter Consortium at West Exe School in Exeter, part of the Ted Wragg Trust, where some of our training sessions are held."}],"createdAt":"2021-07-06T17:54:04.126Z","updatedAt":"2021-09-21T17:39:24.913Z"}
