{"id":"01f3b706-367e-42f5-ac24-06d97b5fdd7e","name":"St John Vianney RC Primary School","code":"1GQ","type":"lead_school","isAccreditedBody":false,"urn":"111698","ukprn":"10078155","address":{"addressLine1":"King Oswy Drive","town":"Hartlepool","county":"Durham","postcode":"TS24 9PA"},"contact":{"website":"http://www.sjvschool.co.uk","email":"lrowsthorn@sjvschool.co.uk","telephone":"1429273273","fullName":"Teaching School Manager"},"location":{"latitude":54.7106202,"longitude":-1.2294909},"trainWithUs":"We offer bespoke professional and academic training to become an outstanding primary school teacher. The responsibility for your training is shared between you, ourselves and Durham University. With us, you are entering a supportive, professional partnership: Durham University provide an extensive academic background introducing you to all national curriculum subjects as well as various approaches to teaching and learning and different patterns of school and classroom organisation. As Lead School we will deliver a detailed programme addressing professional values and practice and provide personal mentoring support and individual tutorials. We coordinate all placements in the Together to Succeed Teaching School Alliance, which includes all 30 primary schools in Hartlepool. Our alliance also includes the Secondary Schools of Hartlepool and two Special Schools which provide additional opportunities to extend practice. But essentially, you bring the most important ingredient to this mix. Your enthusiasm, passion and commitment are the building blocks which we in the Teaching School Alliance and Durham University help you to construct into a successful practitioner in the world's best profession - the teaching of young children.","trainWithDisability":"Durham University Disability Support offers advice and guidance to both prospective and current students within the University. They also arrange appropriate provision for disabled students, as well as offering support to those who think they may have a disability.\n\nFor further information\n https://www.dur.ac.uk/disability.support/","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"f3a93938-0208-4680-ac22-b564b18ff02b","code":"D86","name":"Durham University","description":"Durham are proud to be one of the leading departments for education, regularly featuring in the top five in national university league tables such as 3rd in the Guardian University Guide 2019 and 3rd in The Times Good University Guide 2018. \\r\\n\\r\\nDurham lead the way in high quality research- 5th in education nationally and joint 1st in the UK for world-leading research impact. With their OFSTED outstanding rated ITE provision, they are a major contributor in the field of education. You can be assured of high quality teaching having been awarded, Gold, in the Teaching Excellent and Student Outcomes Framework."}],"createdAt":"2021-07-06T17:48:47.767Z","updatedAt":"2021-07-22T20:20:51.852Z"}
