{"id":"02476fa8-d23f-4d70-8b5c-11dfc04b0c00","name":"The Arnewood School Academy","code":"1ZM","type":"lead_school","isAccreditedBody":false,"urn":"136652","ukprn":"10033369","address":{"addressLine1":"Gore Road","town":"New Milton","postcode":"BH25 6RS"},"contact":{"email":"c.chaloner@arnewood.hants.sch.uk","telephone":"1425625400","fullName":"Christine Chaloner"},"location":{"latitude":50.750768,"longitude":-1.663309},"trainWithUs":"The Arnewood School offers the opportunity to train to teach with the support of experienced mentors and subject specialist in the heart of the New forest. As a small provider, we are able to offer a highly personalised experience that can be adapted to suit a variety of needs. Working in partnership with other local teaching alliances we are able to also offer a broad and high quality provision of pedagogical training.\nFor the primary route we work with our feeder schools who are passionate about teacher training and education to support trainees as they enter the profession. The school is committed to professional development with a keen focus on the development of teaching and learning across all subject areas. We offer both primary and secondary training opportunities. For both routes we work with The University of Winchester, which is recognised by OfSted as an ‘Outstanding’ provider of teacher education at both primary and secondary level and has a long history of training teachers.","trainWithDisability":"Your wellbeing is a top priority and we will do all we can to give you the chance to flourish and maximise your potential. In partnership with the University of Winchester there is a dedicated student support team to help with any questions or challenges you might experience during your studies. We work with you to support your wellbeing and mental health, provide confidential advice and offer workshops to boost your academic skills. If you have a disability or learning difference, we encourage you to get in touch before you apply so we can discuss tailored support for your individual needs.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"964657c0-043a-4280-8e2a-df4210748a8a","code":"B52","name":"Bournemouth Poole & Dorset Teacher Training Partnership","description":"For the secondary route we work within the Bournemouth, Poole and Dorset Teacher Training Partnership to offer trainees a varied and balanced experience to prepare them for becoming excellent practitioners. This allows our trainees to experience a diversity of school placements including upper schools, selective schools and special educational school settings. The partnership delivers high quality central training and subject specific tutors to support your development as a teacher. \\r\\n\\r\\nFor the primary route we work with Halterworth Teaching school to give trainees a high level of central training and support."},{"id":"3700fb02-7007-40c8-9127-b070e146d6cb","code":"W76","name":"University of Winchester","description":"We are accredited by The University of Winchester, which is recognised by OfSted as an ‘Outstanding’ provider of teacher education at both primary and secondary level and has a long history of training teachers. The university offers a stimulating and supportive learning environment that challenges and inspires, in a beautiful, historic cathedral city, within easy distance of Bournemouth, Christchurch and the New forest."}],"createdAt":"2021-07-06T17:56:48.405Z","updatedAt":"2021-09-09T22:04:47.400Z"}
