{"id":"02b48e4e-8876-4fa8-ac9b-4dbad608a9e3","name":"Cranford Community College","code":"265","type":"lead_school","isAccreditedBody":false,"urn":"136522","ukprn":"10033241","address":{"addressLine1":"Cranford Community College","addressLine2":"High Street","town":"Hounslow","county":"London","postcode":"TW5 9PD"},"contact":{"website":"http://cranford.hounslow.sch.uk","email":"use-cc@cranford.hounslow.sch.uk","telephone":"0208 897 2001","fullName":"Peter Stumpf"},"location":{"latitude":51.4867547,"longitude":-0.4061468},"trainWithUs":"Ofsted judges Cranford Community College to be 'Outstanding' – we want you to be part of this success if you are of the right calibre and have potential to grow further. Cranford Community College is located in West London with excellent transport routes and is the lead school in the Cranford Teaching School Alliance. As a trainee, you will be placed either at Cranford or at one of our high quality partner schools.\nOur mission is that we are all successful and happy. We have a curriculum that provides ‘additionality’ and develops the full range of skills, preparing young people for success in an increasingly competitive and changing world. We are aspirational and encourage and guide pupils to take practical steps now, whilst at school, to secure a better long term future. We aim to foster a strong moral dimension and ethos throughout the school and its teaching. Cranford is innovative and has developed a diverse curriculum which is adaptable, exciting and embraces positive change and ideas for improvement. The Cranford Teaching School Alliance has an excellent track record of success in Initial Teacher Training with outstanding employment rates, professional development and career progression.","trainWithDisability":"All schools within the Cranford Teaching School Alliance will make suitable adaptations for trainees with disabilities. These include lift access for example and other reasonable adaptations as required.\nCandidates who have disabilities or other needs should contact Cranford TSA prior to their application to discussion their needs and the bespoke support that we can provide for them during their initial training year.\nThe individual Partner Schools and SCITTs which we work with have differing disabled access provisions, so if in doubt please contact Cranfod TSA for more information.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"4b833e5f-01f5-4306-aed0-cdf0c8db9fa3","code":"2B5","name":"Hillingdon SCITT","description":"Hillingdon SCITT, an Ofsted recognised Outstanding ITT Provider, located in North-West London, is one of the two accrediting providers for QTS with which the Cranford Teaching School Alliance works. Hillingdon SCITT is based in Ruislip. \\r\\n\\r\\nHillingdon SCITT has successfully trained 3 cohorts of Primary and Secondary teachers. Upon completion of the course Hillingdon SCITT trainees have been graded as Good or Outstanding towards the Teachers’ Standards. As a result, our trainees a highly employable and we have had 100% employment rate upon course completion."},{"id":"720894da-360a-4f7a-9835-7ce7beb3c6de","code":"L59","name":"Teaching London: LDBS SCITT","description":"Teaching London: LDBS SCITT was judged by Ofsted in 2017 to be Outstanding and is one of the two accrediting providers with which the Cranford Teaching School Alliance works. Teaching London: LDBS SCITT is based in Kilburn. \\r\\n\\r\\nTeaching London has been training teachers for over 20 years and we are highly effective in our role, with 76% of trainees graded as Outstanding at the end of their training in 2017-18. We are committed to your wellbeing during your training and support your future, with 100% of trainees gaining employment in the profession over the past 6 years."}],"createdAt":"2021-07-06T17:51:12.025Z","updatedAt":"2021-07-21T19:18:36.194Z"}
