{"id":"0325ceb1-cdd1-4ee3-ac60-c006483cede7","name":"Bluecoat Academy","code":"12W","type":"lead_school","isAccreditedBody":false,"urn":"70305","ukprn":"10052837","address":{"addressLine1":"Bluecoat SCITT Alliance Nottingham","addressLine2":"Aspley Lane","town":"Nottingham","county":"Nottingham","postcode":"NG8 5GY"},"contact":{"website":"http://www.bluecoatscittalliance.uk.com","email":"itt@bluecoat.uk.com","telephone":"0115 9007230","fullName":"Mrs Rebecca Underhill, Head of SCITT"},"location":{"latitude":52.9694319,"longitude":-1.1938616},"trainWithUs":"Bluecoat SCITT Alliance is passionate about education and the role education plays in transforming pupils’ future opportunities. Forming part of Archway Learning Trust we proudly share values of “Educational Excellence” for all pupils. We strive to ensure that all trainees are fully equipped for a career in teaching, ensuring the dedication and skill-set to remove any barriers to learning pupils in their classes may face. We are unapologetic in our drive to provide high quality trainees to work with pupils of all backgrounds from a wide spectrum of educational beginnings.\nThe advantage of school based training is the significant amount of time spent in schools, who are selected because they want to train new entrants to the profession to become outstanding practitioners. You are in school Monday – Thursday learning first-hand from practising teachers with a proven track record for excellence. We work with a range of different schools across Nottinghamshire and organise a tailored placement for you, to fit your individual needs, allowing you to become fully immersed in school life and wider community. This is underpinned by high quality training each Friday, covering an extensive range of different teaching skills delivered by experts in their field. We pride ourselves on the layers of support our trainees receive. You will be assigned a Subject/Phase Lead who will help you with specific subject issues and lead subject/phase sessions. You will be supported by an experienced subject teacher mentor on each placement offering 1:1 support each week.","trainWithDisability":"Bluecoat SCITT Alliance Nottingham is committed to developing, maintaining and supporting a culture of equality and diversity across all aspects of the partnership. We aim to ensure equality of opportunity for all trainee teachers and staff, in an environment in which all individuals are recognised as being of equal value and are able to make best use of their skills through equality of opportunity. Our commitment to equality is, in part, achieved through the eradication of discrimination including disability (physical or mental impairment). We support the ethos of the social model of disability which attempts to remove barriers that restrict life choices for disabled people. We encourage all trainee teachers, or stakeholders to alert a relevant member of staff if they are disabled or become disabled in order that the SCITT can support them as appropriate.\nIf you require any special access arrangements, or disability support, we will ensure your placement school is suited to your needs and able to provide the support you require.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"e7ca18a3-f1b7-4efd-82be-88a3c6a272d5","code":"1YH","name":"Bluecoat SCITT Alliance Nottingham","description":"At Bluecoat SCITT Alliance, we celebrate INCLUSION and DIVERSITY and we encourage our trainees to be committed, reflective professionals with high levels of pedagogical skill and subject knowledge. Our education and training are designed to prepare new teachers to be AMBITIOUS for all of their learners, founded in a culture of HIGH ASPIRATIONS. \\r\\n\\r\\nThrough COLLABORATIVE PARTNERSHIP, we aim to provide a high-quality, coherent, rich and inclusive curriculum which ensures that novice teachers are well-equipped to meet the needs of all learners, providing the East Midlands with teachers CONFIDENT in meeting the needs of our diverse schools."}],"createdAt":"2021-07-06T17:47:03.429Z","updatedAt":"2021-12-02T20:50:41.631Z"}
