{"id":"032afe13-53d6-47d3-9901-8478b3da1638","name":"EAST SCITT","code":"3C6","type":"scitt","isAccreditedBody":true,"ukprn":"10058884","address":{"addressLine1":"EAST SCITT","addressLine2":"C/O Farlingaye High School","town":"Woodbridge","county":"Suffolk","postcode":"IP12 4JX"},"contact":{"website":"https://www.eastscitt.co.uk/","email":"jennyellis@eastscitt.co.uk","telephone":"01394389178 07709138257","fullName":"Jenny Ellis"},"location":{"latitude":52.1005596,"longitude":1.3038389},"trainWithUs":"EAST SCITT is a recently accredited School Centred Initial Teacher Training Provider offering primary and secondary school-based initial teacher training awarding Qualified Teacher Status (QTS), with the additional option of gaining Post-Graduate Certificate in Education accredited by the University of Buckingham. EAST SCITT has been formed and is run by a team of expert current professionals in the world of initial teacher training and teaching. As past teaching school alliances, we have a long-term proven track record of delivering high quality training and have the skills and expertise required to facilitate all aspects of our programmes. Our excellent reputation for supporting potential trainee teachers from the point of considering a career as a teacher, to developing in to a leadership role within schools in Suffolk is second to none.\nFormed and driven by a team of expert current professionals from Farlingaye & Kesgrave High Schools and Springfield Junior School, we are proud to work with a number of Ofsted good and outstanding schools in Suffolk.Our core trainers are excellent practising teachers selected carefully from our wealth of partnership schools. The number and geographical area of schools which we work with is constantly growing and expanding We have one goal to train outstanding teachers, committed to the excellence of all in the classroom.","trainWithDisability":"EAST SCITT and its partnership schools are committed to supporting each and every one of our trainees. We aim to promote and implement an inclusive learning and teaching environment, allowing you to study independently. We are here to support you and would encourage you to contact us so we can help identify any appropriate adjustments to meet your individual needs. Once you have applied for our course, we are available for you to contact to discuss your particular needs and will work closely with you to ascertain the impact of your condition on your studies. It maybe you need: * deadlines to be extended; * workshops to be recorded; * powerpoint presentations in advance of workshops * photocopying on coloured paper * wheelchair access With your permission, we will ask your SCITT tutor to work with you providing support and guidance. We need to ensure that all elements of your training period make ‘reasonable adjustments’ to provide every opportunity for you to succeed.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:52:31.972Z","updatedAt":"2021-10-05T15:40:37.825Z"}
