{"id":"034b57f5-d231-41d7-aa08-475cd841b5e9","name":"Titan Partnership Ltd","code":"T30","type":"scitt","isAccreditedBody":true,"ukprn":"10039377","address":{"addressLine1":"Titan Partnership","addressLine2":"75 Harborne Road","town":"Birmingham","county":"West Midlands","postcode":"B15 3DH"},"contact":{"website":"www.titanteachertraining.co.uk","email":"jack.small@titan.org.uk","telephone":"0121 607 1930","fullName":"Sean Bates"},"location":{"latitude":52.4708263,"longitude":-1.9245948},"trainWithUs":"Titan Teacher Training has successfully trained teachers for over 20 years. We work in partnership with Primary and Secondary schools across Birmingham's inner city to deliver outstanding and supportive school-based Teacher Training.\nOur course offers Qualified Teacher Status (QTS) and a Post Graduate Certificate in Education (PGCE) with Master's credits. Birmingham City University validates the PGCE qualification. To support your academic work, you have access to the university's facilities and services.\nYou will have the chance to train in a variety of settings: comprehensive, selective and single-sex. You will also be able to follow specialist training pathways in SEND, STEM and alternative provision. Titan is a small but highly successful provider. Our size enables us to deliver personalised training in a very supportive environment.\nAs a trainee, you will attend cross-phased taught sessions designed to complement your school placements as well as bespoke subject specific sessions.\nMany of our trainees choose to remain within our partnership schools and go onto become strong middle and senior leaders. We offer a comprehensive programme to support you through your initial ECT year as part of our ongoing commitment to you.\nAs a trainee, you will also have access to events & activities from our wider partnership network of over 50 educational institutions across Birmingham.\nWe provide all our trainees with the best possible support to ensure success at every level. We look forward to supporting you into teaching!","trainWithDisability":"Titan is an inclusive provider. We will support you during your training year and make any reasonable adjustments to ensure we meet your specific needs.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:56:04.144Z","updatedAt":"2021-09-22T17:06:17.015Z"}
