{"id":"036f1406-83fc-4014-9b34-502c0e9f5d25","name":"London East Teacher Training Alliance","code":"133","type":"scitt","isAccreditedBody":true,"urn":"144236","ukprn":"10064599","address":{"addressLine1":"Bygrove Primary School","addressLine2":"Bygrove Street","town":"Poplar","county":"London","postcode":"E14 6DN"},"contact":{"website":"www.letta.org.uk","email":"train@letta.org.uk","telephone":"020 7538 4925","fullName":"Brigitte Boylan"},"location":{"latitude":51.5129229,"longitude":-0.0184018},"trainWithUs":"LETTA is an outstanding provider. See Ofsted report, Jan 2018\n(https://files.api.beta.ofsted.gov.uk/v1/file/2749581). We offer up to 55 places. All aspects of the inspection were outstanding ie: * Overall effectiveness\n* Trainee outcomes\n* Quality of training\n* Quality of leadership and management\nThe following points were highlighted by Ofsted in a rigorous inspection. LETTA\n* has a collaborative and personalised approach to supporting and developing trainees, building upon prior knowledge and expertise.\n* provides outstanding centre-based training every week of the school year. Trainees benefit from the expertise of school-based trainers, LETTA tutors and a wide range of highly knowledgeable external facilitators. Several have international reputations. eg., Dr. Bill Rogers, Jenny Mosley, Prof. Barry Hymer, Shirley Clarke, Pie Corbett.\n* provides an opportunity to visit other local schools, visit schools outside our local area and attend an outdoor science weekend in Oxford. * provides high-quality, bespoke training for mentors to ensure they are well prepared for their role in supporting trainees to be successful teachers. * provides continuing support for mentors via lead mentors and LETTA tutors.\n* provides placements in contrasting schools within the partnership and across the age-range of the course. * placements in a Special Educational Needs & Disability setting (SEND) are also possible.\n* arranges a week long collaborative creativity placement where trainees work together in small teams in classes across the partnership.\n* provides excellent pastoral support\n* provides a PGCE with 60 masters credits for all trainees\nSee LETTA prospectus, newsletters and tweets on (www.letta.org.uk)","trainWithDisability":"Ofsted recognised the importance that LETTA gives to inclusion and recognising individual needs. 'Since the SCITT opened, 99.5% trainees have been graded at least good by the end of the course and a high proportion of them have achieved an outstanding grade. There are no significant differences between the attainment of different groups because leaders’ promotion of equality and diversity lies at the heart of the SCITT’s work.' (Ofsted report, 2018, p.5)\nDyslexic trainees have achieved the same high standards as their peers. This includes achieving distinctions in the two PGCE module assignments.\nOur partner university, Sheffield Hallam, provides access to all specialist equipment, counsellors and other student services that are provided for students at the university itself.\nSee\n(https://students.shu.ac.uk/regulations/\nequality_and_diversity/index.html)\nLETTA subscribes to the Employee Assistance Programme, part of the Education Support Partnership. This programme offers free, confidential support and guidance by qualified counsellors - 24/7, 365 days a year.\nSome schools have lifts. There is good access to all LETTA schools. LETTA will discuss individual needs with applicants, in order to ensure the right schools are selected for training and needs are communicated. Please note: LETTA will adjust the interview process for those with particular disabilities, on request.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:53:54.098Z","updatedAt":"2021-12-03T16:42:29.965Z"}
