{"id":"049fe65f-08dc-4686-9ac8-606dce490128","name":"Goldsmiths, University of London","code":"G56","type":"hei","isAccreditedBody":true,"ukprn":"10002718","address":{"addressLine1":"New Cross","town":"Lewisham","county":"London","postcode":"SE14 6NW"},"contact":{"website":"https://www.gold.ac.uk/pgce/","email":"course-info@gold.ac.uk","telephone":"020 7078 5300","fullName":"Goldsmiths, University of London"},"location":{"latitude":51.474271,"longitude":-0.035408},"trainWithUs":"Goldsmiths has been educating teachers since 1904, and is renowned as a leader in the field of teacher education. The partnership you will be joining as you become a student teacher at Goldsmiths has a reputation for supporting the development of exceptional teachers for world class schools. In the most recent Ofsted report it recognised the contribution we make stating: “Goldsmiths, University of London has worked in close partnership with schools over many years to help meet a local need for high-quality teachers able to contribute quickly to the education of pupils in a predominantly urban setting. Head teachers say that trainees and newly qualified teachers (NQTs) need to be able to ‘hit the ground running’. This is an attribute that Goldsmiths' NQTs have in abundance.\"\nThe PGCE (QTS) programme at Goldsmiths has been designed to: * Promote Reflection: to develop a strong sense of identity that is built upon a close connection between research and experience. * Recognise Inclusivity and Diversity: to be rights respecting and recognise and challenge the political, social, economic and cultural dimensions of practice. * Celebrate Creativity: to take informed risks and use imaginative and innovative strategies to support learning.\n* Develop Confidence and Engagement: to participate fully in steering the course of the profession both locally, nationally and globally.","trainWithDisability":"The Disability Service can help you to arrange any reasonable adjustments, equipment or support you need to study effectively at Goldsmiths. See the Disability Service web pages for more information.\n[Disability Service](https://www.gold.ac.uk/students/disability-support/)","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"yes","canSponsorStudentVisa":"yes"},"createdAt":"2021-07-06T17:56:01.718Z","updatedAt":"2021-07-27T19:35:42.615Z"}
