{"id":"04aaf16f-3949-4496-a9a6-73581e3dca79","name":"Stafford Hub","code":"1WB","type":"lead_school","isAccreditedBody":false,"urn":"142983","ukprn":"10057181","address":{"addressLine1":"North Avenue","town":"Stafford","county":"Staffordshire","postcode":"ST16 1NR"},"contact":{"website":"http://www.sirgrahambalfour.co.uk/","email":"c.j.brown@keele.ac.uk","telephone":"01785 223490","fullName":"Matt Mason"},"location":{"latitude":52.8238341,"longitude":-2.126964},"trainWithUs":"Sir Graham Balfour School is judged to be a ‘good’ school and we are committed to teaching future professionals. We work within a Hub of schools, within the Stafford region, these are:\nAlleynes Academy, Blessed William Howard Catholic High School, The Hart School, King Edward VI School, Kingsmead School, Walton High School and Weston Road Academy.\nProgramme Data from last year\n94% successfully completed the programme;\n90% gained employment;\n100% achieved ‘outstanding’ or’ good’;\n96% rated our teacher training programme as ‘outstanding’ or ‘good’ We work closely with The OAKS as our accredited provider this is a genuine partnership between our hub of schools, The OAKS and Keele University, which ensures relevant and up to date training. We believe that we are an extremely caring and friendly organisation and will, at all times, provide help, encouragement and support, whenever it is needed. At the end of the programme you will obtain QTS from The OAKS and a PGCE Academic Award from Keele.\nYou are important to us and many support structures are in place for this challenging, but very rewarding course. It is our aim to produce highly motivated, creative, successful and reflective teachers. Such teachers, we know, will be in great demand both in the local region and nationally.\nYou will be placed in two placements, where you will put theory into practice. In addition, The OAKS also gives you the opportunity to observe teaching in alternative educational settings such as EAL, PRU, Special and Independent Schools.","trainWithDisability":"We have a dedicated support tutor, who supports our trainees with disability or any other need. It is important to state that they do not assess your teaching performance, this gives you the opportunity to speak honestly about your needs, but also enables the support tutor to have the freedom to help you and visit you; whether you are in placement school or here at The OAKS. This includes signposting through to developing individualised learning plans which may extend beyond the course date to enable you to successfully complete the programme.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:53:17.340Z","updatedAt":"2021-09-28T18:16:12.108Z"}
