{"id":"04adc47a-e3a7-4281-972c-d7b63335a29a","name":"Westerton Partnership","code":"2ER","type":"lead_school","isAccreditedBody":false,"urn":"142452","ukprn":"10054666","address":{"addressLine1":"Westerton Primary Academy","addressLine2":"Hesketh Lane","town":"Tingley","county":"Wakefield","postcode":"WF3 1AR"},"contact":{"website":"https://www.westerton.leeds.sch.uk/teacher-training","email":"teachertraining@westerton.org.uk","telephone":"1132533504","fullName":"Angela Booth"},"location":{"latitude":53.7247818,"longitude":-1.5780724},"trainWithUs":"Thank you for considering Westerton Partnership to train to teach in Leeds. Westerton Partnership, a partnership of 13 primary schools mainly in the Morley area of Leeds, provides great places to train to teach and is a fully school-led route into teaching. The schools within the partnership offer diversity and the trainees will engage in more than one school within the partnership. The schools within the partnership are committed to joint collaborative working and have a long history of delivering successful school-based teacher training. We have a proven track record of trainees that successfully complete the course and recruited to the profession, many within partnership schools. Our programme is innovative and forward thinking, with 3 clear strands: The National Curriculum for strong subject knowledge and teaching strategies; Professional Practice, such as inclusion and effective behaviours for learning; Your personal well-being including mindfulness, positive psychology and managing workload. Our partnership is an amazing place to train and all the schools are committed to their trainees' progress. The schools will invest in you as an integral and important member of their staff team. As a partnership, we have a clear commitment to growing our own teachers of the future. Our teachers are excellent practitioners and they are keen to share professional skills, knowledge and practice with teachers of the future. All trainees who successfully complete the course with us will be recommended for Qualified Teacher Status and have the opportunity to gain a PGCE. This is an excellent springboard into the profession.","trainWithDisability":"As a partnership of schools committed to inclusive education and challenging discrimination, we welcome applications from trainees with disabilities.\nExceed SCITT places trainee welfare at the heart of its vision and values.\n“Putting the pupil at the heart of teacher training and Exceed Teachers at the core of our care.”\nYou will have regular progress meetings that include trainee wellbeing and support to ensure you can access all aspects of the training programme. For example, additional time for tasks, contact with expert tutors on the programme who can provide guidance and strategies for any individual needs.\nThe Postgraduate Certificate in Primary Education is an academic award with 60 Masters Level credits and is awarded by a University. As a student of a University you are able to access the support services offered by the institution.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:47:14.489Z","updatedAt":"2021-09-28T16:50:50.135Z"}
