{"id":"06506b9e-dacf-497d-aaf6-e7ea7f125471","name":"Exning Primary School","code":"1JM","type":"lead_school","isAccreditedBody":false,"urn":"124544","ukprn":"10072937","address":{"addressLine1":"Exning Primary School","addressLine2":"Oxford St","town":"Exning","postcode":"CB8 7EW"},"contact":{"website":"https://www.exning.suffolk.sch.uk","email":"head@exning.suffolk.sch.uk","telephone":"01638 600123","fullName":"James Clark"},"location":{"latitude":52.2657368,"longitude":0.3690021},"trainWithUs":"Exning Primary School is the Lead School of a partnership of six schools in west Suffolk. The partnership works with Primary SCITT provided by Suffolk and Norfolk School Centred Initial Teacher Training . Suffolk and Norfolk Primary SCITT Tuition has an excellent reputation for providing high quality training and support for all trainees.\nOur partnership of schools comprises a mixture of large and small, urban and rural, infant and junior. They are conveniently located in west Suffolk, which means trainees can engage with more than one school in the partnership. We provide a unique opportunity to experience a diverse and contrasting range of teaching and training experiences. Our staff are our most valuable resource and have a proven track record in training and professional development. Our teachers are excellent practitioners with exemplary behaviour management skills and are eager to share their skills, knowledge and practice with the next generation of teachers.","trainWithDisability":"Suffolk and Norfolk SCITT supports all trainees based on their individual needs. Recently this has included those with dyslexia, physical, hearing and visual impairments and mental health conditions. Plans are developed with trainees to ensure that they can fully access in centre training, operate effectively on school placement and complete written assignments.\nSuffolk & Norfolk Primary SCITT training venues in Ipswich and Norwich have full disabled access as do partnership schools. However, applicants who would benefit from disabled access should let us know on their application so that they can be considered for placements at the most appropriate schools","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"89831af6-535f-471b-aa97-098bd1a93291","code":"S13","name":"Suffolk and Norfolk Primary SCITT","description":"The Suffolk \\u0026 Norfolk Primary SCITT programme is a personalised, relational and ethical training provider. Primary SCITT has very high attainment and employment outcomes for trainees. On average, 95% of trainees are employed in local schools by the end of their training.\\r\\n\\r\\n Trainees are supported by school mentors and SCITT Tutors who have a range of experience as classroom practitioners and often headteachers or members of senior leadership, so have a wealth of experience to share with trainees. \\r\\n\\r\\nPrimary SCITT is a highly personalised course which offers a wide range of opportunities to trainees."}],"createdAt":"2021-07-06T17:55:27.405Z","updatedAt":"2021-09-23T16:50:49.836Z"}
