{"id":"06a23706-f5f5-4a05-96cf-569c27f24613","name":"Esk Valley Alliance","code":"1XT","type":"lead_school","isAccreditedBody":false,"urn":"121610","ukprn":"12345678","address":{"addressLine1":"Egton","town":"Whitby","county":"North Yorkshire","postcode":"YO21 1UT"},"contact":{"website":"http://www.eskvalleyteachingalliance.co.uk/","email":"headteacher@egton.n-yorks.sch.uk","telephone":"01947 895369","fullName":"Liz Orland"},"location":{"latitude":54.4414441,"longitude":-0.7537568},"trainWithUs":"Training with the Esk Valley Alliance will enable you to access 'on the job' training with a variety of experienced staff ranging from practicing class teachers and SLEs to serving headteachers, all of whom are committed to the ITT training program and believe that the best way for a teacher to learn is to be taught by the best.\nDuring the programme you will have opportunities galore to experience a range of our schools, of which we have over 40, in the the beautiful North Yorkshire Moors and surrounding areas.\nWe are able to offer rural school placements as well as the larger primary school placements enabling your skills to cover the full span of primary ages including your chosen route.\nYou will be supported throughout your learning journey by an experienced ITT team and your appointed mentor. We are fully committed to enabling your successful launch into your teaching career.","trainWithDisability":"The Esk Valley Alliance is a fully inclusive alliance and extends a warm welcome to all students.\nCandidates are encouraged to discuss any specific disabilities and needs with the team to enable us to facilitate any necessary adjustments and to be able to include you in our course.\nOur schools range in physical size and age, this sometimes may impact on accessibility. However, every attempt will be made to accommodate suitable candidates and any specific requirements.\nThe Alliance works closely with York St John university and our students have full access to appropriate resources. The Well-being Team, based in Student Services, provides emotional and psychological support to students at York St John University including those working with the Esk Valley Alliance.\nThe Alliance in conjunction with the University take a team approach to support students to improve their resilience and ability to cope with life stressors and because of this we may refer to a variety of support options ranging from 1-2-1 sessions through to workshops, exercise classes, self-help materials or specialist external agencies.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"b011427a-6dff-4a77-9df3-c85a54be605a","code":"Y75","name":"York St John University","description":"York St John University is a high quality, friendly university with a campus based in the historic City of York. It achieved university status in 2006. It is one of several higher education institutions which have religious foundations. Esk Valley and York St John University have a long history of working in partnership to deliver high quality teacher education and training, leading to the award of PGCE with QTS. We work with York St John University because they have been involved in training and educating teachers since 1841 and are committed to working in partnership and collaboration with schools."}],"createdAt":"2021-07-06T17:54:07.777Z","updatedAt":"2021-09-23T16:55:57.140Z"}
