{"id":"06d4c60d-e03c-4447-b21f-6370f3a7b24b","name":"Sponne School","code":"1PJ","type":"lead_school","isAccreditedBody":false,"urn":"136488","ukprn":"10033021","address":{"addressLine1":"Brackley Road","addressLine2":"Towcester","town":"Northampton","county":"Northants","postcode":"NN12 6DJ"},"contact":{"website":"http://www.gutp.co.uk","email":"gutprecruitment@sponne.org.uk","telephone":"1327350284","fullName":"Ruth Scott"},"location":{"latitude":52.1321304,"longitude":-0.9936731},"trainWithUs":"The Grand Union Training Partnership is a school-centred initial teacher training (SCITT) consortium centred on a number of 11-18 comprehensive schools situated in villages and small towns West of Northampton and in Milton Keynes. We provide Secondary PGCE courses in Business Studies, DT, English, History, Modern Foreign Languages, Physical Education, Maths, Geography, Computer Science, Physics, Chemistry and Biology. We aim to give trainees, whom we refer to as Associate Teachers, as much practical experience of working in the Partnership schools as possible. Each Associate Teacher's work and programme of study is supervised by a Mentor (School Based Tutor) who will take a close interest in their development as a subject teacher and colleague. This part of the course is complemented by general professional studies. Our overall aim is to produce reflective professionals confident in applying for and starting their first jobs as secondary school teachers. Over half of our Associate Teachers take up their first teaching posts in the scheme's Partnership schools.","trainWithDisability":"In addition to supporting our Associate Teachers in any way we can, we are committed to providing additional support where possible and necessary.\nPrior to the start of our course, we ask all Associate Teachers to consider whether or not they have a disability within the statutory definition. It is important that we gather this information because The GUTP is committed to ensuring that all of our Associate Teachers are treated fairly and that we do not inadvertently make decisions or have processes that may treat any one less well on the basis of any disability. We also wish to offer appropriate support to all our trainees, whatever their circumstances. All information given to us is treated with sensitivity and held in confidence.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"31c7cd62-54ee-4a79-9de0-c1caa6890a60","code":"G60","name":"The Grand Union Training Partnership","description":"The Grand Union Training Partnership is an experienced school-centred initial teacher training consortium with nearly 20 years’ experience training secondary school teachers. More recently they started to offer the same high quality of training the primary sector. \\r\\n\\r\\nThe Scheme is very conscious of its role in training local people for employment in their home area.\\r\\n\\r\\nTheir overall aim is to produce reflective professionals confident in applying for, and starting, their first jobs as school teachers. Traditionally, over half of their Associate Teachers take up their first teaching posts in the Scheme’s Partnership Schools."}],"createdAt":"2021-07-06T17:51:22.817Z","updatedAt":"2021-07-09T15:09:11.892Z"}
