{"id":"07eb5989-a79a-4356-991f-bbd06706c939","name":"Ryders Hayes Teaching School","code":"131","type":"lead_school","isAccreditedBody":false,"address":{"addressLine1":"Gilpin Crescent","addressLine2":"Pelsall","town":"Walsall","county":"West Midlands","postcode":"WS3 4HX"},"contact":{"website":"http://www.ryders-hayes.co.uk","email":"c.heaton@ryders-hayes.co.uk","telephone":"1922683008","fullName":"Cheryl Heaton ITT Leader"},"location":{"latitude":52.6346885,"longitude":-1.9651978},"trainWithUs":"Ryders Hayes School was one of the first Teaching Schools in the country, gaining the status in 2011. We are a National Teaching School with a strong culture of staff development and have joined forces with other local good and outstanding schools to create a strong and diverse Teaching School Alliance offering added value to the training experience.\n\nThe Ryders Hayes Partnership strongly believes in creating a ‘best fit’ between the host school and the School Direct trainee, in the belief that they are one of the staff team and a potential employee. Carefully planned induction and expert mentoring are key to our trainees success.\n\nTraining will be delivered by the lead school from expert facilitators, providing an outstanding ‘hands-on’ school-based experience. A bespoke training package for each trainee, including additional support in specialist subjects, promotes access to all aspects of school life.\n\nWhere suitable vacancies arise, an offer of employment at the end of the training will be made by the host school, or assistance given with gainful employment within its alliance of schools. We have extremely high employment rate for our trainees.\n\nOur School Direct trainees feel like members of staff; with support from their peers; the staff and University team; have weekly school practice in their school; and find themselves positioned at the forefront of education, well prepared as much sought after and highly employable teachers.","trainWithDisability":"We are fully accessible to all and will make reasonable adjustments where required.","accreditedBodies":[{"id":"62d5803b-89ca-4e21-bb6f-5c74944c56ad","code":"B25","name":"Birmingham City University","description":"We at Ryders Hayes, as lead school, are in our seventh year of School Direct, working alongside Birmingham City University (BCU) as our chosen accredited ITT provider. We have over fifteen schools, including Ryders Hayes, in our Partnership.\\r\\n\\r\\nThe Routes\\r\\n\\r\\nThere are two School Direct (SD) routes –\\r\\n1.School Direct Training Programme (tuition fees/training route) – funded by tuition fees paid by the trainee, (either directly or with a Student Loan Company (SLC) loan). \\r\\n2.School Direct Training Programme (salaried). THIS IS NOT AVAILABLE WITHIN THE RYDERS HAYES PARTNERSHIP."}],"createdAt":"2021-07-06T17:55:56.557Z","updatedAt":"2021-11-04T22:34:05.322Z"}