{"id":"086451b8-c0c2-45b7-94eb-c79c1c4fd637","name":"Services for Education","code":"1WE","type":"scitt","isAccreditedBody":true,"ukprn":"10046628","address":{"addressLine1":"Unit 3 Holt Court","addressLine2":"Holt Street","town":"Birmingham","postcode":"B7 4AX"},"contact":{"website":"https://www.servicesforeducation.co.uk/scitt/?utm_source=gov&utm_medium=2021&utm_campaign=scitt","email":"tricia.bunn@servicesforeducation.co.uk","telephone":"7776599087","fullName":"Niall Crawford"},"location":{"latitude":52.4866068,"longitude":-1.8850956},"trainWithUs":"“SFE leaders and partnership schools share an ambition for excellence and demonstrate high levels of commitment and dedication to ensuring that trainees are thoroughly prepared for their careers in teaching.”\n Ofsted (2018)\n\nServices For Education is an accredited provider of initial teacher training (ITT) working with a partnership of primary schools across the West Midlands providing high-quality Primary teacher training, leading to qualified teacher status (QTS). \n\nFees are set at £7500 for the 12 month training period.\n\nOur programme was judged as ‘Good’ in our 2018 Ofsted inspection, with inspectors commenting: ‘The partnership ensures that trainees are superbly prepared for their careers in teaching’.","trainWithDisability":"It is against the law for teacher training providers to discriminate against you because you’re disabled or have special educational needs.\nUnder the Equality Act 2010, providers must make adjustments to help you do a course or go to an interview, providing your requests are reasonable. If the help you need is not covered by your provider making reasonable adjustments, you may also be able to get support from Access to Work. This could include a grant to help cover the costs of practical support in the workplace.\nIt’s up to you if you want to tell your school or training provider about your disability. The main advantage of doing this is to let them put support in place.Any information you give about your disability is protected under the Data Protection Act 2018. If you’re offered a place on a teacher training course, you may have to complete a fitness questionnaire before starting. We ask relevant questions to make sure you’re able to teach.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:55:29.798Z","updatedAt":"2021-08-24T15:24:28.726Z"}
