{"id":"08c1836b-f0d2-432a-b182-0365a728c7a4","name":"Parmiter’s School","code":"1D5","type":"lead_school","isAccreditedBody":false,"urn":"136899","ukprn":"10034176","address":{"addressLine1":"Parmiter’s School","addressLine2":"High Elms Lane","town":"Garston","county":"Watford","postcode":"WD25 0UU"},"contact":{"website":"http://www.parmiters.herts.sch.uk","email":"schooldirect@parmiters.herts.sch.uk","telephone":"1923671424","fullName":"Jan Stevens"},"location":{"latitude":51.7034045,"longitude":-0.3903079},"trainWithUs":"The Watford Partnership for Teacher Training has considerable experience of training teachers and recognises and values the enthusiastic contribution that they make to our school communities. The lead school, Parmiter's School, Watford, is the first point of contact for School Direct salaried and unsalaried teacher training routes across the full range of curriculum subjects. The training programme is structured to allow trainees to develop the skills required by teachers to teach the subject that they are training in and to develop specific expertise for making a distinctive contribution to practise in their settings. A subject mentor directs the development of subject knowledge for teaching in school settings. All schools within the Watford Partnership employ a Professional Mentor to oversee and quality assure the provision of training within the school. The programme enables trainees to have a clear understanding of learning theories and child development and how this impacts on student learning and informs their own development as a teacher. Trainees will have the opportunity to spend time in one of the other partnership schools to ensure a contrasting and comprehensive experience. As well as first class mentoring in school, trainees will participate in shared professional studies sessions, remote and in-person, and an annual conference. Bespoke training in behaviour management is provided.These will enhance learning and professional development as well as providing a valuable opportunity to forge relationships beyond their immediate context. Feedback from trainees is extremely positive with all trainees securing Early Career Teaching roles for the following academic year.","trainWithDisability":"Training to be a teacher can be very rewarding, but also tiring and, at times, frustrating. We are here to assist trainees through both the \"peaks and troughs\" of their school placements and hope that the experience is enjoyable, professionally satisfying and personally fulfilling. Schools within The Watford Partnership for Teacher Training are committed to making reasonable adjustments for disabled staff and to ensure that the needs of disabled staff are accommodated in the school environment, as far as is reasonably practical. Throughout the trainee’s time at school the subject mentor will provide professional support and guidance and will have weekly scheduled meetings with the trainee. This process will be overseen by the professional mentor. In addition to the more formal aspects of the training, however, it is hoped that the trainee will regard both the mentor and the professional mentor as confidantes and that he or she will be able to turn to both should difficulties arise. Please contact Parmiter's School for further advice and guidance on an individual basis.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"feecdec5-259c-45e3-b1cf-4e391936ee90","code":"H36","name":"University of Hertfordshire","description":"We are committed to the concept that the most effective teacher training takes place through close co-operation between the training institution and the school, whereby the student benefits from the expertise of practising teachers and at the same time receives the necessary theoretical training. Close links have been forged with our accredited training provider, The University of Hertfordshire. The university is a leading regional provider of Initial Teacher Education (ITE) and consistently high achieving in it’s Ofsted inspections and in the Guardian and Times League tables."}],"createdAt":"2021-07-06T17:53:18.476Z","updatedAt":"2021-10-04T18:53:24.639Z"}
