{"id":"08ee3cae-c85e-492c-b697-dd5e8ef678f2","name":"Wood Green ITT Alliance","code":"1O7","type":"lead_school","isAccreditedBody":false,"urn":"136616","ukprn":"10033330","address":{"addressLine1":"Wood Green Road","town":"WEDNESBURY","county":"WEST-MIDLANDS","postcode":"WS10 9QU"},"contact":{"website":"https://www.woodgreenacademy.co.uk/train-to-teach/","email":"Sylvaine.Valmalette@woodgreenacademy.co.uk","telephone":"1215564131","fullName":"Mrs Sylvaine VALMALETTE-WRIGHT"},"location":{"latitude":52.563505,"longitude":-2.004318},"trainWithUs":"Wood Green Academy is the Lead School of the Wood Green ITT Alliance. We have an extensive proven track record in training students to become outstanding teachers. Our main ITT pathway is the School Direct with QTS & PGCE route with in excess of 80 places advertised in 15 different curriculum areas across the Wood Green ITT Alliance for 2022-23. It has always been our philosophy as a Lead School to give teacher training applicants the opportunity to specifically apply for the training school/campus of their choice; you are therefore able, from the start, to select your preferred training school. It is our belief that the opportunity to mutually assess both enhances the training experience and produces the best outcomes. Wood Green Academy has a long-standing reputation for achieving some of the best GCSE and Post 16 results in the local area, and in February 2020, under the new Ofsted framework, achieved an overall effectiveness rating of good. Furthermore, it is only one of few secondary schools nationally that achieved the grade of outstanding for behaviour and attitudes, something we are extremely proud of.\nOur subject mentors are extremely committed to your development and their vast experience will guide you to success. Wood Green ITT Alliance school direct trainees will benefit from a precious extra layer of support compared to core PGCE trainees. Our Alliance of schools enables more convenient arrangements for second school placements and greater opportunities for employment after the completion of your training.","trainWithDisability":"Wood Green ITT Alliance is committed to supporting applicants with disabilities and special needs. In partnership with the Universities of Wolverhampton and Birmingham, we endeavour to break down any barrier that may stand in an individual's way of training as a teacher. Furthermore, our trainees' mental health is at the heart of our mentoring and professional learning and development programmes.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"c357e0fa-802e-471b-818a-d0cd1434f9cd","code":"B32","name":"University of Birmingham","description":"Our partnership with the University of Birmingham is long standing and we have trained many outstanding teachers through the PGDipEd route together. The School Direct PGDE offer for 2022-23 is an exciting enhancement of our collaboration. Being able to train with the University of Birmingham, Queen Mary’s Grammar School and Wood Green Academy is an ideal opportunity for an ambitious trainee teacher who wishes to develop the qualities and skills required for a highly successful career in Education. \\r\\nWeblink: https://www.birmingham.ac.uk/schools/education/teacher-education/index.aspx"},{"id":"4da5abb2-b287-451e-8d75-c5b79e11c2bb","code":"W75","name":"University of Wolverhampton","description":"Our partnership with the University of Wolverhampton is very well established and we are their flag ship Lead school for the School Direct Secondary Route. As such, we play a very important part in many aspects of their ITE programme. Our close geographical proximity facilitates a well-balanced training experience. Our teaching staff also work with the university to provide teacher subject specialism training. In addition, our partnership provides opportunities for early career development. \\r\\nWeb link: https://www.publish-teacher-training-courses.service.gov.uk/organisations/1O7/2022/about#train-with-us"}],"createdAt":"2021-07-06T17:48:04.708Z","updatedAt":"2021-10-04T23:11:20.863Z"}
