{"id":"09175428-814d-451e-9f84-3c08b89bc8a1","name":"The Three Rivers Teaching School Hub","code":"19E","type":"lead_school","isAccreditedBody":false,"urn":"137746","ukprn":"10035957","address":{"addressLine1":"The Three Rivers Teaching School Hub","addressLine2":"The King Edward VI School","town":"Cottingwood Lane","county":"Morpeth, Northumberland","postcode":"NE61 1DN"},"contact":{"website":"http://www.3rtsh.co.uk","email":"Teachingschool.hub@the3rivers.net","telephone":"01670 501537","fullName":"Teaching School Administrator"},"location":{"latitude":55.1743176,"longitude":-1.6926285},"trainWithUs":"“Teachers are highly skilled and enthusiastic; they are relentless in their drive to help students to achieve their very best.” OFSTED 2014\n\nThe Three Rivers Teaching School Hub has developed a strong network of schools to deliver a dynamic School Direct teacher training programme. We work in partnership with Newcastle and Northumbria Universities offering one year full time School Direct tuition placements in primary and secondary settings leading to a full Postgraduate Certificate in Education (PGCE).\n\nYou would become part of this long established partnership of schools that work closely together to share good practice and learn from each other. We believe passionately in the school based route into teaching and are dedicated to using our knowledge, skills and expertise to train the next generation of teachers. We are fortunate to be able to offer a wide variety of host schools including first, middle schools and high schools. In our schools trainees feel valued and supported. They have access to a high quality training programme and engage in a wide variety of experiences. Each trainee is assigned a mentor, carefully selected for their ability to develop the practice of new entrants to the profession, allowing them to fulfil their potential to become outstanding practitioners.","trainWithDisability":"We will make any reasonable adjustments to accommodate and support all candidates, including those with additional needs.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"accreditedBodies":[],"createdAt":"2021-07-06T17:52:59.490Z","updatedAt":"2021-10-07T15:44:33.513Z"}
