{"id":"0a682589-92ed-447b-b564-6958b3b02b41","name":"Staffordshire University","code":"S72","type":"hei","isAccreditedBody":true,"ukprn":"10006299","address":{"addressLine1":"Recruitment and Admissions, E200 Blackstone Building","addressLine2":"College Road","town":"Stoke-on-Trent","county":"Staffordshire","postcode":"ST4 2DE"},"contact":{"website":"https://www.staffs.ac.uk/courses/subjects/education","email":"enquiries@staffs.ac.uk","telephone":"1782294400","fullName":"Admissions Office"},"location":{"latitude":53.0090658,"longitude":-2.1761383},"trainWithUs":"The structure of our PGCE courses reflects our vision of excellent teachers as being both excellent thinkers about teaching and outstanding practitioners in the classroom. We believe in developing thoughtful, self-confident teachers who are comfortable questioning everything around them whilst simultaneously having confidence in everything they do. We focus on school student learning right from the start of the PGCE and this encourages our trainees to develop very quickly as teachers. You will be well supported by subject experts in both school and University and welcomed into a warm and friendly PGCE team who will challenge you to become the best teacher that you can be. In our latest Ofsted Inspection (2017), the inspectors found that we:\n•\tAre passionate about, and committed to, ensuring that pupils in the local area and beyond are taught by highly skilled and knowledgeable teachers so that pupils’ outcomes improve quickly. •\tHave extremely strong relationships between school mentors, trainees and the University based tutors, which is underpinned by effective communication and ongoing support. •\tHelp trainees understand how pupils learn, which has a positive impact on pupil progress over time. Staffordshire University has been shortlisted for University of the year in the 2020 Times Higher Education Awards. The University received a gold award in the 2019 Teaching Excellence Framework, recognising excellent standards of learning and teaching, and was named winner in the Most Improved Student Experience category in the 2017 Times Higher Education Awards.","trainWithDisability":"Staffordshire University's [Student Inclusion Services](https://www.staffs.ac.uk/students/support/student-inclusion-team/home) are a team of Disability Support Coordinators, Disability Administrators and Sessional Assessors. The team support and assist anyone with a disability, including specific learning difficulties, mental health needs and with physical and unseen disabilities. The team can advise on Disabled Student Allowances, accessibility issues and a wide range of support and adjustments to meet the individual needs of students. They can also offer a diagnostic service for students who think they may have a specific learning difficulty. Students who have disclosed a disability will receive a welcome from the team and advice on how to access further support. The [Student Connect Team] (https://www.staffs.ac.uk/students/support/student-connect-team) offer help and support throughout the day, online and in person. There are lots of on campus support options including drop-in clinics as well as workshops specifically in relation to mental health and wellbeing.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"createdAt":"2021-07-06T17:54:28.801Z","updatedAt":"2021-09-08T13:36:17.701Z"}
