{"id":"0a8690b0-5bc4-4236-8b26-3a122ac94d6d","name":"Woodside Academy","code":"26V","type":"lead_school","isAccreditedBody":false,"urn":"139106","ukprn":"10039494","address":{"addressLine1":"Grangewood Avenue","addressLine2":"Little Thurrock","town":"Grays","county":"Essex","postcode":"RM16 2GJ"},"contact":{"website":"http://www.woodsideacademy.org","email":"senco@woodsideacademy.org","telephone":"01375 372513","fullName":"Jennifer Ryder"},"location":{"latitude":51.4880533,"longitude":0.3560475},"trainWithUs":"Woodside Academy is the lead training school in partnership with Essex Teacher Training, Robert Drake in Benfleet, East Tilbury and Grays Convent schools as well as other schools in Thurrock and Essex. Graduates can train at Woodside or in one of our partner schools to gain a qualified teacher status. We have three trainee teachers working at Woodside this year and other trainees in our partner schools. Trainees are all graduates and start with a small teaching commitment, building this through the year. They will also work for half a term with a different age group in another school in the partnership. Being a training school helps us to recruit good quality staff who can already teach according to the school's expectations and quickly develop their commitment to the school. A number of trainees have been given permanent teaching posts at Woodside. We offer non salaried places, although would consider a salaried place for certain degrees.","trainWithDisability":"Here at Woodside Academy we are committed to offering all prospective trainees the opportunity to gain QTS. Please let us know if you have a specific need and/or require any adjustments at the interview stage or throughout the ITT programme.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"00782614-9301-40e4-8832-9a74cc1bbb07","code":"E75","name":"Essex Teacher Training","description":"Essex Teacher Training is a large provider, offering a variety of different school-based routes to QTS in schools across Essex and its adjoining counties. \\r\\n\\r\\nHeadteachers value the contribution trainee teachers can make to their schools. As a result, trainees enjoy their training and the vast majority gain employment in one of our partner schools, once qualified. \\r\\nAll of our tutors are experts in their field and many are still teaching, so you benefit from their knowledge and experience. We pride ourselves on the support we offer our trainees and put trainee wellbeing at the heart of what we do."}],"createdAt":"2021-07-06T17:52:12.661Z","updatedAt":"2021-10-04T01:40:51.225Z"}
