{"id":"0ab5238e-606a-4f42-9aea-90d321ad7dc8","name":"Haybridge Alliance SCITT","code":"2B3","type":"scitt","isAccreditedBody":true,"ukprn":"10034167","address":{"addressLine1":"Haybridge High School & Sixth Form","addressLine2":"Brake Lane","town":"Hagley","postcode":"DY8 2XS"},"contact":{"website":"http://www.teachwithhaybridge.co.uk","email":"abarker@haybridge.worcs.sch.uk","telephone":"01562 881110","fullName":"Sally Koyuncu"},"location":{"latitude":52.4234721,"longitude":-2.1488906},"trainWithUs":"Haybridge Alliance School Centred Initial Teacher Training (SCITT) is based at Haybridge High School and Sixth Form and is recognised as providing exceptional teaching and learning with vast experience in delivering and supporting Initial Teacher training (ITT) courses and placements.\nHaybridge High School is a well-regarded 11-18 comprehensive school with a track record for excellence including four consecutive Ofsted ratings of ‘Outstanding’. Our Alliance schools are from a range of phases operating within diverse catchment areas with different challenges.\nHaybridge Alliance SCITT is the lead provider coordinating the SCITT programme and overall training experience. All secondary and primary schools in the Alliance will provide school-based placements for the training year recruited.\nThe quality of the programmes together with the support received by our trainees ensures that a high calibre of newly qualified teachers enter the profession.\nThroughout the duration of the course a weekly programme of professional studies workshops are delivered by practising teachers from across the schools in the partnership. The focus of the programme is to address the development needs of the next cohort of teachers who will teach in our schools. A programme of subject studies is provided by local Specialist Leaders in Education. These sessions are designed to develop the understanding and delivery of a subject pedagogy, reviewing topics such as lesson planning and assessment. This stimulating programme of professional and subject studies explores the philosophy of education and the pedagogy associated with the teaching of a subject.","trainWithDisability":"We strive to promote equal opportunities within Haybridge Alliance SCITT and Haybridge High School and Sixth Form has full access for people with all types of disabilities. We offer bespoke support to cater for any physical, mental or learning disabilities dependent upon the needs of each trainee.\nAccommodation is not available through the Haybridge Alliance SCITT and trainees will be expected to find their own accommodation for the duration of the course. The Haybridge Alliance SCITT does not have child care facilities.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:50:52.983Z","updatedAt":"2021-10-18T18:16:09.250Z"}
