{"id":"0b306029-1059-4a4a-950a-4e45c3a2a531","name":"Blue Sky","code":"21L","type":"lead_school","isAccreditedBody":false,"urn":"142205","ukprn":"10007832","address":{"addressLine1":"Sacred Heart Primary School","addressLine2":"Brays Lane","town":"Coventry","postcode":"CV2 4DW"},"contact":{"website":"blueskytsa.org","email":"l.stevenson@romeromac.com","telephone":"2476453314","fullName":"Laura Stevenson"},"location":{"latitude":52.4089477,"longitude":-1.4805904},"trainWithUs":"Blue Sky is based in the centre of Coventry with links to primary and secondary schools in Coventry and the surrounding areas. The lead school, Sacred Heart Catholic Primary School, Coventry, was judged by OFSTED as Outstanding in 2013 and again in 2018. With our strategic and professional partners, we are committed to offering high standards of training for the teachers of the future. Our accrediting provider is Newman University, Birmingham. Our previous trainees have been extremely happy with Blue Sky as their provider, saying: * 'Training with Blue Sky is highly tailored to your needs as a new teacher, adapted as the school year advances and your developmental needs arise.'\n* ‘It was a fantastic experience training with Blue Sky. There were many opportunities to observe excellent practitioners.’\n* ‘Completing my teacher training with Blue Sky not only set me up for my NQT year but my whole teaching career.’\n* ‘The support and advice given by Blue Sky was irreplaceable so I’m glad I choose to start my career with them.’\n* ‘Blue Sky really ensured my development from a trainee into a Newly Qualified Teacher. The support received was outstanding from the outset and there was always someone to speak to with concerns or worries.’","trainWithDisability":"Blue Sky will endeavour to support any potential trainee with accessibility needs. We would be happy to discuss how we can support anyone to become a qualified teacher.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:53:24.924Z","updatedAt":"2021-11-02T15:28:07.754Z"}
