{"id":"0ba05412-60ea-4e5e-976e-5f03443cb233","name":"REAch Teach Primary Partnership","code":"1QU","type":"lead_school","isAccreditedBody":false,"urn":"100706","ukprn":"10060390","address":{"addressLine1":"Tidemill Academy","addressLine2":"11 Giffin Street","town":"Deptford","county":"London","postcode":"SE8 4RJ"},"contact":{"website":"http://www.reachteach.org","email":"reachteach@reach2.org","telephone":"01283 246433","fullName":"Andrea Wright"},"location":{"latitude":51.4778929,"longitude":-0.0253429},"trainWithUs":"School Direct is a school-led initial teacher training pathway that offers practical, ‘on-the-job’ training and teacher education. Our unique and blended REAch Teach programme aims to create highly skilled teachers who are an integral part of a school community.\n\nWith more than 60 partner primary schools across the country, we enable you to train locally and grow nationally. The majority of schools we work with are academies within the REAch2 Academy Trust. Starting your teacher training within the REAch2 family of schools enables you to benefit from the wealth of opportunities that come with belonging to a national community of professionals, and a wide range of networks and development opportunities once qualified.\n\nWhichever school you train in, you will be part of the community from the very start of the academic year. Effective mentoring is at the heart of our programme and you will be supported by expert colleagues who will guide your introduction to the core body of knowledge, skills and behaviours that define great teaching. We invest in the training and development of your mentors, so that they can invest effectively in you. \n\n Our Lead School Tidemill Academy is a former National Teaching School which is amongst the top 3% of schools nationally for progress. We have supported over 120 trainees through their School Direct teacher training, with all trainees who completed the programme receiving a Good or Outstanding grading. An average of 80% of our trainees stay with us as early career teachers.","trainWithDisability":"We have a strong commitment to equality and inclusion and we seek to offer a first class education to all students, including students with disabilities. All of our sites are wheelchair accessible and we undertake all reasonable adjustments necessary to ensure inclusion of all disabilities.\nWe are committed to our Equality Policy in respect of serving students and employing staff. Within this policy we will endeavour to ensure that disabled students and staff receive the same standards of service as others. We will not tolerate discrimination on the grounds of disability.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"aa023df3-b71e-4249-b9c4-41fca8bd135e","code":"D39","name":"University of Derby","description":"The University of Derby is an Outstanding provider of Primary ITT. \\r\\nWith a rich heritage in teacher training dating back over 150 years, The University of Derby have a strong reputation for nurturing successful, confident and forward-thinking primary teachers.\\r\\n\\r\\nIn their 2015 Ofsted inspection, they received an ‘outstanding’ rating for the quality of their work with the Primary Leadership Team praised for putting students at the heart of all they do and ensuring excellent career outcomes.\\r\\n\\r\\nOur students were described as “highly motivated and passionate about working with children,” keen to be fully involved in the everyday life of schools."}],"createdAt":"2021-07-06T17:48:16.056Z","updatedAt":"2021-09-03T19:00:14.833Z"}
