{"id":"0bc173b7-6163-493a-968f-62c5301d1611","name":"Primary Advantage","code":"1XW","type":"lead_school","isAccreditedBody":false,"urn":"100263","ukprn":"10079309","address":{"addressLine1":"Holy Trinity Primary School","addressLine2":"Beechwood Road","town":"Hackney","county":"London","postcode":"E8 3DY"},"contact":{"website":"http://www.primaryadvantage.co.uk/train-to-teach","email":"palearning@primaryadvantage.hackney.sch.uk","telephone":"0207 254 1010","fullName":"Sandra Gaudan"},"location":{"latitude":51.5444777,"longitude":-0.0737478},"trainWithUs":"Be part of our success story.\nEducation in Hackney has been completely transformed: a revolution in a decade. Our eight primary schools in the borough continue to move from strength to strength. We are proud of our success across Primary Advantage and want you to be part of it.\nWe have 150 teachers across our 8 primary schools with almost a third of them having trained as student teachers with us. You will find many of our excellent class teacher mentors keen to share their own training experience with you. We train our teachers for the profession, not just for our schools, but are proud that many stay with us growing as both excellent practitioners and leaders. We offer a clear professional development pathway to all student teachers allowing them to specialise in their practice and grow into both subject specialists, excellent classroom practitioners and school leaders. There is a strong support network for students and we have been recognised nationally for the CPD programme we offer. Our strength as schools is the diversity of our children and our community. We are committed to this being even further reflected in our workforce across our schools. Our schools are built on love and trust and underpinned by extremely high expectations for all. Let your experience working with us in Hackney be the start of your journey to becoming the best teacher you can be.","trainWithDisability":"Primary Advantage Federation is fully committed to admitting and supporting students with disabilities. \n\nIn addition all our trainees can access the wide range of support services provided by our university partners.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"accreditedBodies":[],"createdAt":"2021-07-06T17:53:16.602Z","updatedAt":"2021-09-10T20:59:46.482Z"}
