{"id":"0bc933b8-dad9-4149-8bb2-fd2041d567c2","name":"University of Hull","code":"H72","type":"hei","isAccreditedBody":true,"ukprn":"10007149","address":{"addressLine1":"Admissions & Applicant Services","addressLine2":"The University of Hull, Venn Building","town":"Cottingham Road, Hull","county":"Yorkshire","postcode":"HU6 7RX"},"contact":{"website":"http://www.hull.ac.uk","email":"admissions@hull.ac.uk","telephone":"01482 466100","fullName":"FACE Admissions Team"},"location":{"latitude":53.7696607,"longitude":-0.3671708},"trainWithUs":"Teacher training you’ll grab with both hands\nWhen you choose a PGCE at Hull, you’ll get real, hands-on, on-the-job teacher training. You’ll learn how to fuse tradition with brand-new approaches. And you’ll discover the most natural way to teach… Learn how to teach with new technology You’ll join a university steeped in tradition, but one that also believes strongly in Technology-Enhanced Learning. So much so that we helped spark a European Commission project to improve the use of digital technologies in schools. To give you a taste of the modern classroom, you’ll have access to specialist teaching facilities. You’ll also be encouraged to use mobile devices like iPads on campus and in schools. Gain hands-on experience You’ll have plenty of opportunities to gain classroom experience and the new perspectives that come with it. We have a productive network of more than 600 early years settings, schools and academies around the region. With many Hull graduates among their teaching staff, these partner institutions span the spectrum of settings: large, small, urban and rural..","trainWithDisability":"World-class library\nFollowing its £28-million redevelopment, the Brynmor Jones Library is one of the finest institutions of its kind in the country. A stylish, state-of-the-art place of learning for generations to come.Boasting more than a million books, journals and periodicals, plus a vast collection of digital information, it’s open whenever you need it – 24/7 during semesters. The modern and flexible work spaces are suitable for all your needs. However you like to work, there’s a space for you – with access to all our print and digital collections. There are 30 bookable study rooms, 14 with full audiovisual facilities, as well as 350 open access PCs, 48 borrowable laptops, multifunction printers, scanners and photocopiers, plus self-service issuing facilities in all areas. Or bring your digital life with you – our high-speed wireless network means you can use your own laptops and tablets wherever you go. FREE WiFi and computer access High-speed WiFi turns our entire campus into a virtual classroom. We’ve got more than 1,100 open-access computers and 1,600 study spaces for you to use.\nAcademic support tuition\nIf you need advice or supervision on your research, we have staff who are experts in their field that offer personal tuition. Disability support\nWe have a team of professionals to support you, whether you have a physical, medical or learning disability such as dyslexia or dyspraxia.\nPastoral and wellbeing support\nWhether it’s a personal or practical matter, you can count on our friendly and informal support whenever you need it.","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"createdAt":"2021-07-06T17:51:28.375Z","updatedAt":"2021-09-23T16:08:45.629Z"}
