{"id":"0c380b9d-1362-43b8-9483-de84f284cc03","name":"Island Teaching Alliance","code":"2HQ","type":"lead_school","isAccreditedBody":false,"urn":"141305","ukprn":"10047190","address":{"addressLine1":"Lanesend Primary","addressLine2":"Love Lane","town":"Cowes","county":"Isle of Wight","postcode":"PO31 7ES"},"contact":{"website":"https://islandteachingalliance.weebly.com","email":"admin@islandteachingalliance.co.uk","telephone":"1983293233","fullName":"Caroline Sice"},"location":{"latitude":50.7513992,"longitude":-1.3045164},"trainWithUs":"The Island Teaching Alliance is very excited to offer its pathway to training teachers on the Isle of Wight. In partnership with the University of Southampton’s School of Education, we are creating a new pathway for stand out teachers of the future. The Island Teaching Alliance is formed of a range of good Isle of Wight schools that bring together excellence, experience and enthusiasm for supporting and training future teachers for our children.\n\nAll of the schools within the Island Teaching Alliance offer unique and contrasting experiences within the Primary phase. We have a 21st Century vision of developing teachers who can look beyond their own experiences to current and new learning opportunities. We are looking for teachers who want the very best for the children and in return, we will give you the very best of our schools. Your pathway to the best job in the world starts with us.","trainWithDisability":"We recognise that students who have disabilities may have additional needs and require assistance and adaptations to fulfil the requirements of the course. We will work closely with these students to personalise their in school training to meet and support their needs wherever possible.\n\nThe University of Southampton are experienced in supporting a wide range of disability and health conditions including:\n•Sensory (visual / hearing) impairment\n•Mental health problems\n•Mobility impairment\n•Dexterity impairment\n•Physical disability\n•Asperger’s syndrome and other autism spectrum disorders\n•Health conditions (e.g. diabetes, epilepsy, asthma)\n•Chronic pain / chronic fatigue\n•Any other condition which has a long-term and adverse effect on studying\n\nTheir support, information and advice are tailored to meet individual needs. They may ask to see medical evidence if you wish to apply for Disabled Students’ Allowances (DSA). The University of Southampton has a campus accessibility map and we would ensure that any placement offered is accessible to students with disabilities.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"2b84ae64-ebca-4e4d-88b1-13effff3a411","code":"S27","name":"University of Southampton","description":"The University of Southampton Education School was ranked 2nd in the Guardian University League Table in AY2017-2018. Ofsted have commented on the strong support given to trainees on the course and our close partnership with schools. Trainees spend 24 of the 36 weeks of the course on school placements which are carefully selected to ensure they see best practice and have contrasting experiences. A range of optional additional opportunities is offered to help you personalise your course, most notably the annual trip to Kenya. As part of the Southampton PGCE you can gain credits towards a Master’s degree."}],"createdAt":"2021-07-06T17:50:34.743Z","updatedAt":"2021-10-06T22:05:06.453Z"}
