{"id":"0c4d1da7-8ead-4652-8b60-553424fbbcc2","name":"Consilium SCITT","code":"1MS","type":"lead_school","isAccreditedBody":true,"urn":"143059","ukprn":"10061209","address":{"addressLine1":"Eccles Old Road","town":"Salford","county":"Greater Manchester","postcode":"M6 8RD"},"contact":{"website":"http://consiliumscitt.co.uk/","email":"debra.gregory@builehillschool.org.uk","telephone":"1619211319","fullName":"Richard Simcox"},"location":{"latitude":53.4923344,"longitude":-2.3043113},"trainWithUs":"We are Ofsted graded OUTSTANDING. We have a hub in Salford, Greater Manchester and one in the North East. Details of our report can be found here https://reports.ofsted.gov.uk/inspection-reports/find-inspection-report/provider/ELS/70280 Outstanding pupil progress is held at the core of the Consilium SCITT. Our trainees are skilled at observing learning, have an acute understanding of what makes people learn best, and teach intuitively, enabling all pupils to progress 'beyond expectations'. Our aim is that the trainees, as well as their pupils, will go 'beyond expectations' in terms of the progress that they make. Outstanding teaching leads to outstanding progress. Consilium SCITT aims towards the following outcomes: To provide outstanding training opportunities for trainees in a range of secondary subjects. To mentor and coach trainees effectively, guiding their development towards becoming outstanding teachers, experts in their specialist subject. To develop the future generation of outstanding teachers that will continue on to provide an exceptional level of education to learners, both in and out of Salford. To ensure all trainees make outstanding progress towards meeting all of the Teachers' Standards and achieving QTS. Throughout the year there are four review points as well as two assignments based on a range of themes around teaching and learning to complete.\nFor our Salford trainees, we offer a Post Graduate Certificate in Education (PGCE SCITT) awarded by Manchester Metropolitan University .\nFor our North East trainees we offer a Post Graduate Certificate in education awarded by Cumbria University.","trainWithDisability":"Our Schools have disabled access. Applicants who would benefit from disabled access should let us know on their application so that we can consider suitable placements.\nAs well as supporting our trainees with any disabilities and other needs, Manchester Metropolitan University and Cumbria University offers a variety of services which our trainees have access to. These include counselling, health & well being. There is also a Disability Service available if required.","createdAt":"2021-07-06T17:49:52.018Z","updatedAt":"2021-10-21T16:52:12.216Z"}