{"id":"0c5cf5ed-f43c-4746-868d-7dc776870fb0","name":"Saltaire Primary School Direct","code":"2X8","type":"lead_school","isAccreditedBody":false,"urn":"107270","ukprn":"10078397","address":{"addressLine1":"Albert Rd","town":"Saltaire, Shipley","county":"West Yorkshire","postcode":"BD18 4NR"},"contact":{"website":"www.saltaireprimaryschool.co.uk","email":"chrisevans@saltaire.bradford.sch.uk","telephone":"1274584093","fullName":"Chris Evans"},"location":{"latitude":53.8363128,"longitude":-1.7945582},"trainWithUs":"Saltaire Primary School is proud to be a diverse and inclusive community school, committed to ensuring every child receives the best possible education. At Saltaire Primary School, every child’s learning journey is rooted in exciting contexts and enriched by first hand experiences, ensuring that our children develop mastery and depth of understanding through a fun and interesting school curriculum. Our ethos ensures that we develop independent and resilient learners, curious about the world around them and confident to make informed decisions.\nOur teaching staff are the essential ingredients in our success as a vibrant and purposeful learning environment; we have a long history of supporting teachers, at every stage of their careers, to develop their expertise as teachers and leaders. This includes those who are new to teaching and we actively encourage trainees to engage with the wealth of learning opportunities provided. We are keen to recruit trainee teachers who share our passion for working with children and the provision of high-quality learning experiences. In return, our school can provide trainees with a bespoke package of continuing professional development and expert support. Do you have the energy and enthusiasm to join our learning journey? If so, we’d be interested to receive your application.","trainWithDisability":"We believe that teachers with disabilities make an important contribution to schools both in the classroom and in shaping the wider culture and ethos of the schools they work in, indeed we have 100% pass rate for trainees who have declared a disability. We adhere to The Equality Act 2010 and Special Educational Needs and Disability Act 2001, which require teacher training providers to ensure they are not discriminating against applicants with disabilities or special educational needs (SEN).\nAll our partner Schools value diversity and the unique contribution that all their staff and trainees bring.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"58e814cb-bf42-4d3d-9486-b3ea827fd9e2","code":"259","name":"Bradford Birth to 19 SCITT","description":"Bradford Birth to 19 School Centered Initial Teacher Training (SCITT) offers a different way of training to become a teacher. Learn by listening to and observing good and outstanding teachers. Training involves practicing your teaching skills with groups of students. Supported effectively by a school mentor, you are treated as a member of the school staff, someone the school is often looking to potentially employ. This route ensures you are working in your class from day one of the course.\\r\\nWe aim to train the next generation of outstanding teachers."}],"createdAt":"2021-07-06T17:52:29.662Z","updatedAt":"2021-10-04T16:50:14.183Z"}
