{"id":"0d17beaf-8499-4efa-ad9f-74909acb947f","name":"West Yorkshire Teaching Alliance","code":"1JJ","type":"lead_school","isAccreditedBody":false,"urn":"143793","ukprn":"10061987","address":{"addressLine1":"School Terrace, Far Bank","addressLine2":"Shelley","town":"Huddersfield","county":"West Yorkshire","postcode":"HD8 8HU"},"contact":{"website":"http://www.wyta.co.uk/get-into-teaching-in-kirklees/","email":"manager@wyta.co.uk","telephone":"07521 668300","fullName":"Clare Taylor"},"location":{"latitude":53.5958109,"longitude":-1.6985202},"trainWithUs":"*Despite the current uncertainties regarding Covid-19 we are accepting applications for teacher training for 2021/22 and are conducting online interviews. Please contact Clare - manager@wyta.co.uk further information*\nThe West Yorkshire Teaching Alliance (WYTA), established in 2014, has a strong and diverse network of partners based mainly around Huddersfield. We have earned a reputation for recruiting high quality trainees.\nOur mission is to prepare trainee teachers to become confident, resilient, innovative, independent professionals who strive to achieve the best for themselves and for the children they teach. We want aspiring teachers who are relentless in their wish to be outstanding practitioners and who, in turn, produce outstanding learners.\nWorking with all age groups, WYTA is led by two outstanding primary schools: * Shelley First School\n* Spring Grove Junior Infant and Nursery School\nWe are closely supported by a number of very strong secondary partner schools. As a relatively small provider, we really get to know you. Our focused, in-depth and supportive yet challenging programme builds your confidence and subject knowledge and gives you the necessary skills to become a highly effective classroom practitioner. Our offer includes:\n* school-based specialists * academic experts * comprehensive mentoring\n* a successful, high quality programme (97% of all of our trainees achieved good/outstanding)\n* strong employment opportunities Our trainees agree: “With WYTA, I have always had the impression that everyone is rooting for you to succeed.” (2015-16 Primary trainee).“Support from WYTA has been outstanding.” (2016-17 Secondary trainee).","trainWithDisability":"Whatever your circumstances, we take each application on its own merits and we actively and genuinely welcome applications from suitably qualified persons from all backgrounds regardless of race, disability, religion, belief or sexual orientation.\nWe have significant experience of supporting trainee teachers with a range of needs, including:\n* physical disability\n* mental health conditions\n* dyslexia\nAlthough each of our partner schools has differing access arrangements, all schools are Disability Discrimination Act (DDA) compliant. Schools and Initial Teacher Training providers are required by law to make reasonable adjustments in order to remove barriers to participation and achievement. We value the fact that we are all different whilst recognising that fairness and equity are principles that underpin all our work.\nIn addition, the University of Huddersfield’s Wellbeing and Disability Service works with a wide range of additional needs, disabilities and long-term conditions that can have a significant impact on a person’s ability to study. You would be able to access support from either or both of us. The University is set in multicultural Huddersfield, a context that supports and facilitates our desire to prepare trainees to teach in a diverse society.\nWe encourage you to talk to us; we always try to offer you a placement in a school that best meets your needs and we will do all that we can to provide you with all the support you need to become a successful teacher, delivering subjects you love and having a major impact on your students.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:52:24.294Z","updatedAt":"2021-09-27T15:21:34.144Z"}
