{"id":"0d85c2ae-4b8a-4210-ae8c-d7f8d6a5d3af","name":"St Ninian Catholic Federation","code":"2DL","type":"lead_school","isAccreditedBody":false,"urn":"148701","ukprn":"10088887","address":{"addressLine1":"Kirklands Road","town":"Carlisle","county":"Cumbria","postcode":"CA2 4JD"},"contact":{"website":"https://www.smmcatholicprimary.co.uk/","email":"head@stmmary.cumbria.sch.uk","telephone":"1228401800","fullName":"Chris Wilkins"},"location":{"latitude":54.8768936,"longitude":-2.9242514},"trainWithUs":"The St Ninian Teacher Training route is one that guarantees at least two placements in Catholic Primary schools in Cumbria. The course runs in partnership with the Catholic\nDiocese of Lancaster and the newly formed Mater Christi Multi Academy Trust that ensures a working partnership between a selection of Catholic schools in the county whilst allowing access to the the first 2 units of the CCRS.\nOur core principles are: Prayer, Service, Knowledge and Aspiration; therefore our PGCE students work hard to ensure the best for all our children whilst\ngaining valuable experience in a variety of settings enabling themselves to develop professionally. We are always trying to find smarter ways to do our work with much of our practice being research driven.\nWe only recruit people who are passionate about making a difference to children’s lives; people who challenge themselves to keep on improving and people whom hold high expectations whilst seeing the importance of developing the whole child.\nIf you want to train in a forward thinking environment then this may well be the course for you.","trainWithDisability":"All sites are DDA compliant and have good accessibility.\n\nAll our students have access to University of Cumbria support as well as that offered within our school direct alliance. Much of this university-based support is available online and electronically and so accessible at a distance.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:56:26.914Z","updatedAt":"2021-10-20T18:11:21.895Z"}
