{"id":"0db6ef43-98e7-4e61-ae6d-cb2bbd38a5dd","name":"Sunningdale School","code":"23M","type":"lead_school","isAccreditedBody":false,"urn":"108882","ukprn":"10018663","address":{"addressLine1":"Shaftoe Road","addressLine2":"Springwell","town":"Sunderland","county":"Tyne & Wear","postcode":"SR3 4HA"},"contact":{"website":"http://www.senhub.org.uk","email":"jane.shaw@sunningdaleschool.com","telephone":"1915280440","fullName":"Glenis Wallace"},"location":{"latitude":54.8878465,"longitude":-1.422923},"trainWithUs":"Sunningdale Teaching School Alliance is a partnership of high performing schools (including other teaching schools), academic institutions and organisations that support children with special educational needs. Our alliance is based in the North East and North Yorkshire and we work together to make the most of our collective experience for the benefit of our children. We create opportunities for postgraduates to train as primary teachers within our schools as either salaried or fee-paying trainees depending on the availability of places. Our programmes are specifically designed for postgraduates who would like to develop expertise in teaching children with special educational needs. Our vision is 'to equip all teachers working with special needs pupils with high quality expertise and to ensure that all children receive the education they deserve'.\nRoughly one in six children have recognised special educational needs. These include emotional and social difficulties, multi-sensory impairment and physical disabilities. Working with an extensive range of professionals, and through programmes of research and development, we have devised a range of workshops which demonstrate how strategies and therapies which will be unfamiliar to many mainstream schools are used to support the learning of children with special needs. The skills you will develop with us will consequently be valuable in a wide variety of educational contexts. Previous students completing our training have left us with the knowledge and expertise to confidently enter the profession – all have qualified and immediately secured teaching positions.","trainWithDisability":"Sunningdale Teaching School is mindful that there will always be a broad range of applicants to our teacher training programme which may include applicants who have a disability or additional needs.\nThe Equality Act 2010 underpins practice at Sunningdale and is intrinsically linked to a set of policies that provide the guidance for daily support. Our school has developed systems and procedures for supporting disabled students and making sure they progress in their studies. As a provider working closely with Northumbria University we are able to signpost students requiring support for dyslexia/mental health issues and those requiring physical adjustments. We also have access to a mini-bus with a lift for those requiring transportation.\nIt would be important in the first instance to understand the additional support a prospective student may require, and as part of that process we would work closely with each student to gain information about any disability, health condition, or learning support needs they may have. This would include undertaking a joint risk assessment. By having as much detailed information as possible the right kind of support can be put in place.\nIt would be unlawful for Sunningdale to refuse an applicant a place on their teacher training programme or treat them less favourably because of a disability (Disability Discrimination Act since 2001, Equality Act 2010). We welcome all applicants whatever their ‘need’.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:53:32.910Z","updatedAt":"2021-08-06T15:25:04.509Z"}
