{"id":"0e0389ae-aa3b-4d13-be01-8eeb89907fb6","name":"Halstow Primary School","code":"1V5","type":"lead_school","isAccreditedBody":false,"urn":"143597","ukprn":"10063110","address":{"addressLine1":"Halstow Primary School","addressLine2":"Halstow Road","town":"Greenwich","county":"London","postcode":"SE10 0LD"},"contact":{"website":"http://www.halstow.greenwich.sch.uk/node/288","email":"rsilcock@wingfield.compassps.uk","telephone":"2088561167","fullName":"John Camp"},"location":{"latitude":51.4849304,"longitude":0.0156082},"trainWithUs":"Halstow Primary School is one of the lead teaching schools in the Royal Greenwich Teaching School Alliance, orchestrating initial teacher training across a hub of local primary schools. We work in partnership with the wider group of alliance schools to ensure we provide students with the best possible learning experiences for life in the classroom. Halstow Primary is also a member of The Compass Partnership of Schools; a multi-academy trust of five primary schools and one special school, with a\nreputation for research-led, innovative practice, and expertise in school improvement. By having a special school in the group, with both a primary and secondary phase, we offer students unique access to the\nbest practice in special educational needs. Our schools are vibrant, happy and dynamic places to learn in and our school based training programme enables all trainees to take part in development sessions across the schools.\nThe Halstow teaching school works in partnership with Goldsmiths University to host a growing number of School Direct places each year. We are delighted to be part of the School Direct programme and look forward to working with trainees who are interested in a career in the classroom. We firmly believe that it is an excellent way to learn and\nqualify to become a teacher giving candidates the opportunity to gain practical experience that is personalised to the needs of the individual trainee, supported by the very best that universities have to offer.","trainWithDisability":"Goldsmiths welcome applications from students with additional needs. For further details of support you can expect to receive please refer to: https://www.gold.ac.uk/students/disability-support/ \n\nHalstow hub schools are fully inclusive schools and fully accessible. Please contact us should you require any further information or details.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"049fe65f-08dc-4686-9ac8-606dce490128","code":"G56","name":"Goldsmiths, University of London","description":"Goldsmiths is renowned as a leader in the field of teacher education.\\r\\nThe PGCE (QTS) programme at Goldsmiths aims to: \\r\\n•\\tPromote Reflection: to develop a strong sense of identity that is built upon a close connection between research and experience. \\r\\n•\\tRecognise Inclusivity and Diversity: to be rights respecting and recognise and challenge the political, social, economic and cultural dimensions of practice. \\r\\n•\\tCelebrate Creativity: to take informed risks and use imaginative and innovative strategies to support learning.\\r\\n•\\tDevelop Confidence and Engagement: to participate fully in steering the course of the profession both locally, nationally and globally."}],"createdAt":"2021-07-06T17:48:21.173Z","updatedAt":"2021-07-08T15:47:51.141Z"}
