{"id":"0e2b0f11-3ca8-4332-b37c-ccbb093db5a1","name":"Valley Invicta Teacher Training (VITT)","code":"1CU","type":"lead_school","isAccreditedBody":false,"urn":"136582","ukprn":"10033423","address":{"addressLine1":"VITT","addressLine2":"Invicta Grammar School","town":"Huntsman Lane, Maidstone","county":"Kent","postcode":"ME14 5DS"},"contact":{"website":"http://www.VITT.org.uk","email":"a.donovan@viat.org.uk","telephone":"01622 357028","fullName":"Alison Donovan"},"location":{"latitude":51.2747336,"longitude":0.5367746},"trainWithUs":"Welcome to Valley Invicta Teacher Training (VITT).\n\nVITT is part of Valley Invicta Academies Trust (VIAT), which is made up of Ofsted-rated outstanding and good schools, and offers a wealth of experience and diversity.\n\nThe decision to train with VITT is one of the most important choices that you will make. We have a strong teaching and learning ethos where every student encounters stimulating and intellectual challenges, but equally every trainee is supported and challenged by their mentors to craft their teaching skills and develop practice. This ensures that every member of a VITT school can focus on their individual needs; building self-confidence, self-esteem and preparing for future opportunities.\n\nEvery member of staff is unique and we recognise that what suits one might not suit another, therefore, we provide a structured training and development programme designed to support you at each stage of your career, combined with bespoke development opportunities and a range of benefits.","trainWithDisability":"VITT recruits our trainees on their individual merit.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"1165d5fd-11f4-4dab-99c9-47b309481463","code":"C10","name":"Canterbury Christ Church University","description":"Valley Invicta Teacher Training (VITT) works with Canterbury Christ Church University as the registered training provider for the School Direct programme. Training is delivered by highly effective teachers from both the Trust and also from the university. \\r\\n\\r\\nCanterbury Christ Church University is an outstanding provider of teacher training which offers both School Direct Salaried and School Direct Tuition Fee programmes in both Primary and Secondary age phases.\\r\\n\\r\\nWe are working with Canterbury Christ Church University as an accredited teacher training provider. There will be opportunities to have pedagogical and professional training sessions at the University."},{"id":"d2ba71f2-c125-4d86-bb22-736e67043120","code":"B72","name":"University of Brighton","description":"Valley Invicta Teacher Training (VITT) works with the University of Brighton as the registered training provider for the School Direct programme. Training is delivered by highly effective teachers from both the Trust and also from the university. \\r\\n\\r\\nThe University of Brighton is an outstanding provider of teacher training which offers both School Direct Tuition and School Direct Salaried programmes in secondary age phases.\\r\\n\\r\\nWorking with the University of Brighton as an accredited teacher training provider. There will be opportunities to have pedagogical and professional training sessions at University. The University will support the school in the application and interview process."},{"id":"b3681bbc-2e2a-49c3-aa4e-e453a8d0e4a5","code":"G70","name":"University of Greenwich","description":""},{"id":"4d4cceab-1516-4a6c-a9ab-5de0e32e1fe1","code":"S90","name":"University of Sussex","description":"Valley Invicta Teacher Training (VITT) works with the University of Sussex as the registered training provider for the School Direct programme. Training is delivered by highly effective teachers from both the Trust and also from the university. \\r\\n\\r\\nUniversity of Sussex tutors work with us to provide high quality inputs on how to teach and assess your chosen secondary subject or across the curriculum in primary schools. The University also provides a comprehensive programme of Professional Studies which complements the school-based training offered across our partnership."}],"createdAt":"2021-07-06T17:50:18.261Z","updatedAt":"2021-09-15T16:59:59.598Z"}
