{"id":"0e64ff81-c28a-46fa-96fd-0fa735e9c357","name":"Endeavour Learning SCITT","code":"M70","type":"scitt","isAccreditedBody":true,"ukprn":"10059445","address":{"addressLine1":"Tarleton Academy","addressLine2":"Hesketh Lane, Tarleton","town":"Preston","county":"Lancashire","postcode":"PR4 6AQ"},"contact":{"website":"https://endeavourlearning.org/teacher-training","email":"scitt@endeavourlearning.org","telephone":"01772 812 644","fullName":"Endeavour Learning SCITT"},"location":{"latitude":53.685344,"longitude":-2.8311858},"trainWithUs":"Endeavour Learning SCITT was rated as an Outstanding provider by Ofsted (2015-2016). It is a group of North-West schools who are responsible for the design and delivery of a high quality Secondary School Centred Initial Teacher Training programme. The partnership of schools who contribute to this include Tarleton Academy, Burscough Priory Academy, Wellfield High School, Lostock Hall Academy, Penwortham Priory Academy and Lathom High School. In addition we work with All Saints CE Primary School, Hesketh with Becconsall, Churchtown Primary, Southport and New Horizons Alternative Provision.\nThe Endeavour Learning SCITT ensures that we prepare trainees to become the very best teachers they can be. We provide inspiring and high-quality training in a range of schools. The Endeavour Learning SCITT programme leads to qualified teacher status (QTS) and the award of Postgraduate Certificate of Education through Liverpool John Moores University.\nIn addition, you will have access to:\n•\tA dedicated Professional Mentor and a dedicated Curriculum Mentor who will provide both personal and professional support;\n•\tA range of opportunities and experiences in schools – SEND, Secondary/Primary and Sixth Form/Early Years enhancements;\n•\tExtended placements in two schools from week 2; •\tSupport with your growing subject knowledge development; •\tAn NQT support programme, supporting your through your first year of teaching and beyond;\n•\tAn induction programme starting in July and continuing in September;\nWe have achieved 100% good or outstanding outcomes in the past five years and every one of our trainees achieves the academic award along with QTS.","trainWithDisability":"Every member of staff is treated as an individual and we try to accommodate every applicant that applies to train with us.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:48:32.179Z","updatedAt":"2021-08-17T21:31:53.677Z"}
