{
  "id": "0e85d3fa-f430-403e-9cbb-1bd6ca2efafc",
  "name": "NIoT@Harris Initial Teacher Education",
  "code": "1TZ",
  "type": "lead_school",
  "isAccreditedBody": false,
  "urn": 135311,
  "ukprn": 10090839,
  "address": {
    "addressLine1": "National Institute of Teaching@Harris Initial Teacher Education",
    "addressLine2": "55 Southwark Park Road",
    "town": "London",
    "county": "London",
    "postcode": "SE16 3TZ"
  },
  "contact": {
    "website": "www.niot.org.uk",
    "email": "ITT@niot.org.uk",
    "telephone": "03301336300"
  },
  "trainWithUs": "Our vision is a school system that nurtures the talents of teachers and leaders at all stages of their careers, so they can provide children with the world-class education they deserve.\n\nTogether with three other leading multi-academy trusts, Star Academies, Outwood Grange Academies Trust and Oasis Community Learning, we have formed a national school-led organisation called the National Institute of Teaching (NIoT). \n\nWe offer year-long primary and secondary teacher training programmes to graduates and career changers joining the teaching profession through our school centred programme. We offer a strong support network and exciting environment in which to train, ensuring that our trainee teachers complete the course feeling supported, confident and well-prepared. \n\nAll our teacher training courses lead to QTS (Qualified Teacher Status), a PGCE (Post Graduate Certificate in Education) and 60 Master’s Level credits. We give you access to first class training, invaluable school and classroom practice and opportunities to learn on-the-job at one of our placement schools within Harris Initial Teacher Education partner schools. We work in partnership with the University of Birmingham to deliver the PGCE element of our programme.\n\nYou will benefit from bespoke weekly Core Training with your fellow trainees; additional tailored subject-specific training days; personalised mentor and the NIoT team support and a second placement in a contrasting school environment. You could earn a salary or receive a bursary, subject to eligibility, while you train.",
  "trainWithDisability": "Our training programme is open to everyone who meets the eligibility criteria. If you have a disability, we will make every reasonable adjustment to accommodate you throughout the recruitment process, as well as during the training programme, if you are offered a place.\n\nAll candidates who have accepted a place must complete a pre-commencement medical questionnaire. If this reveals you have a support need, the NIoT provides appropriate school placements, support and monitoring for you during the course. If you have any questions about health, disability, or the support provided, please do not hesitate to contact us.  We offer an Employee Assistance Programme (EAP) service to all National of Institute of Teaching trainees.\n\nTo support those with a physical disability, we ensure they are placed in an accessible school setting. Our placement schools and core training facilities make full use of a range of technologies and specialist equipment.\n\nThe physical and mental health and wellbeing of our trainees is important to us. Many of our team are trained as Mental Health first aiders. We incorporate wellbeing sessions throughout our Core Training and offer regular, additional academic writing support as required.",
  "accreditedBodies": [{"id":"b1e31bc9-515a-460b-8301-b3011e4adf37","code":"2N2","name":"NIoT: National Institute of Teaching, founded by the School-Led Development Trust","description":"The National Institute of Teaching (NIoT) is the accredited body and has responsibility for recommending trainees who successfully complete the programme for Qualified Teacher Status (QTS). \\r\\n\\r\\nInspiration Trust delivers the course through the partner providers Star Academies, Harris Initial Teacher Education, Outwood Grange Academies Trust and Oasis Community Learning. \\r\\n\\r\\nThe National Institute of Teaching works in partnership with the University of Birmingham.  The University of Birmingham is the validating university and has responsibility for awarding the Postgraduate Certificate in Education (PGCE) element of the programme."}],
  "location": {
    "latitude": 51.4932348,
    "longitude": -0.0717116
  },
  "canSponsorSkilledWorkerVisa": "no",
  "canSponsorStudentVisa": "no",
  "createdAt": "2022-07-06T11:04:51.653Z",
  "updatedAt": "2022-10-05T10:26:38.079Z"
}
