{"id":"0ea19130-8c43-45a3-893d-0366dfef5236","name":"Elizabeth Garrett Anderson School","code":"2BZ","type":"lead_school","isAccreditedBody":false,"urn":"100457","ukprn":"10015261","address":{"addressLine1":"Donegal Street","addressLine2":"Islington","town":"London","county":"London","postcode":"N1 9QG"},"contact":{"website":"http://www.egaschool.co.uk","email":"tina.southall@egas.islington.sch.uk","telephone":"2078370739","fullName":"Tina Southall"},"location":{"latitude":51.5330429,"longitude":-0.1134607},"trainWithUs":"Elizabeth Garrett Anderson School is an outstanding inner city 11-16 girls community school. We have been judged as ‘outstanding’ by Ofsted since 2005 and our progress 8 scores are significantly positive. We are committed to supporting the well-being of staff and students. Everything we do is based on our core belief that every student can achieve in whatever field they chose, regardless of their starting point or background. Train with us and make a difference to the lives of young people, many of whom are disadvantaged. You will be part of a peer group of trainees across our alliance that receives high quality training and support. Our trainees undertake professional studies across the alliance, and at times, across phases, to maximise learning. We hope our trainees will go on to work locally and take advantage of our career long training opportunities. We are located close to good transport hubs (Angel Islington and Kings Cross). Islington is a thriving borough with many opportunities for social activities. We are close to central London and all that offers.\nhttps://www.egaschool.co.uk/244/teacher-training","trainWithDisability":"Candidates with disabilities and other needs are supported by DDA compliance and personal evacuation plans, with adaptations made to accommodate needs. Some sites are fully accessible while others (in older buildings) are not. We will interview candidates at accessible sites and ensure placements take place at suitable sites and with appropriate adjustments.\nAll placements offer mentor support. Trainees who are employed in Islington schools (apprentices) can access Islington staff support. Apprentices can also access support through their university.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:56:03.574Z","updatedAt":"2021-09-29T17:08:45.617Z"}
