{"id":"0eb887d9-72a1-4bab-a998-0f87c3f0619b","name":"Hackney Teaching Schools’ Alliance","code":"1V9","type":"lead_school","isAccreditedBody":false,"urn":"100250","ukprn":"10078024","address":{"addressLine1":"c/o Clapton Girls’ Academy","addressLine2":"Laura Place","town":"Clapton","county":"London","postcode":"E5 0RB"},"contact":{"website":"https://www.hackneytsa.org.uk/learn","email":"htsa@clapton.hackney.sch.uk","telephone":"020 8985 6641","fullName":"Natalie Prudhoe"},"location":{"latitude":51.5540593,"longitude":-0.0512805},"trainWithUs":"The Hackney Teaching Schools' Alliance (HTSA) is a long standing, supportive partnership of 14 schools incorporating primary, secondary and specialist provision. The alliance is steered by our executive board, which is comprised of two outstanding National Teaching Schools, Kingsmead Primary School and Clapton Girls' Academy, and an outstanding National Support School, Stormont House School. Along with our network of partnership schools we work to improve the quality of teaching and leadership in our borough through effective collaboration and personalised support.","trainWithDisability":"At the HTSA we aim to be as inclusive in our practice as possible, and welcome applicants from all backgrounds. Additional support is available as necessary. If you have a special need or disability, we urge you to discuss this with us as early as possible so that we can make any necessary adjustments and provide the support that you need.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"30bda414-7b00-426c-956b-18a187efe967","code":"L68","name":"London Metropolitan University","description":"London Met provides an excellent platform to develop your career as a teacher. We offer innovative, inspiring courses delivered by knowledgeable industry professionals, with completion rates and grades well above the national average. \\r\\nEmployment prospects for our trainees are excellent with a great many students offered employment in their placement schools.\\r\\nOur most recent Ofsted report (2016) acknowledged the inclusive, welcoming and open ethos, saying that the culture created by leaders combined with the tailored and personalised, pastoral support that trainees receive enables them to successfully complete their training and confidently go on to gain employment.Ofsted 2016"},{"id":"9be9f611-2d36-431a-9109-7fcbbfc88fc8","code":"C99","name":"University of Cumbria","description":"The University of Cumbria is one of the largest providers of teacher training in the UK, and joint first in the UK for students completing their PGCE Secondary programme. In the last 10 years, we have trained over 10,000 new teachers. 9 in 10 of our graduates are in work or further study within 15 months of graduating (HESA Graduates Outcome Survey 2020. Our graduate employment rate is 96% (HESA Graduates Outcome Survey 2020) and our graduates earn more than the average graduate within five years of graduating (LEO Report 2018)"}],"createdAt":"2021-07-06T17:53:27.194Z","updatedAt":"2021-10-06T18:12:44.142Z"}
