{"id":"0ee329d0-d333-4dac-be3e-80773559a8e6","name":"Essex School Direct","code":"1OS","type":"lead_school","isAccreditedBody":false,"urn":"70275","ukprn":"10035578","address":{"addressLine1":"Essex School Direct","addressLine2":"Chester Road","town":"Loughton","county":"Essex","postcode":"IG10 2LD"},"contact":{"website":"http://www.essexschooldirect.com","email":"teach@essexschooldirect.com","telephone":"020 8498 6718","fullName":"ITT Coordinator"},"location":{"latitude":51.6623392,"longitude":0.084484},"trainWithUs":"At Essex School Direct, we believe that teaching is an exciting and rewarding profession. Our Partnership is based at and managed by the Lead School, Davenant Foundation School, in Loughton, Essex, and recruits for 23 secondary and 8 primary schools in the West Essex, Harlow, Havering and Chelmsford areas. All of our Partner schools are judged ‘Outstanding’ or ‘Good’ by Ofsted. Our unique blended learning programme combines school based training, on-line learning materials, a network of experienced subject specialists to deliver pedagogy, subject knowledge and off-site visits to special schools, primary schools and Leading Teacher days. All schools in our Partnership have a successful track record of working with trainee teachers and university PGCE providers. Each school provides trainees with a fully trained mentor, supported by a Pathway Tutor (subject specialist) from TES Institute who visits each half-term to monitor progress and to “Quality Assure” our programme. Our route has provided consistent employment for trainees within the Partnership on completion of their training. In the last 3 years, the vast majority of our trainees had been employed before the end of the course, almost all of these in the schools where they had trained.\nSuccessful applicants gain Qualified Teacher Status (QTS) and most choose to complete a PGCE.\nWe provide excellent role models from within the teaching staff and opportunities to observe ‘outstanding teaching’. Each school aspires to engender an ‘appetite for learning’ within its pupil community, both in the classroom and within the range of extra-curricular activities it provides.","trainWithDisability":"TES Institute and Essex School Direct are committed to promoting access for people with disabilities and additional needs. We support and enable students with physical disabilities, sensory impairments, specific learning difficulties, special psychological needs and medical conditions that can have an impact on day-to-day activities, to participate in TES Institute programmes, as far as is reasonably practicable and within any constraints laid down by relevant professional bodies.\nTES Institute will:\n* Encourage applications from people with disabilities\n* Seek to provide information in suitable formats\n* Assess applicants who disclose disabilities or specific needs solely on the basis of academic potential and suitability to train to teach\n* Invite applicants with a disability or specific need to contact TES Institute to discuss how their requirements can be accommodated\n* Provide additional support or resources at application to enable the applicant to complete the application process including attending interview where applicable\n* Offer additional provision to ensure no disadvantage compared with other applicants\n* Work towards the earliest possible assessment of needs and offer of reasonable accommodations where required\n* Make reasonable accommodations in assessment where applicable and without impacting the learning outcomes to be assessed\n* Provide educational support services as appropriate for eligible students\n* Take steps to encourage students with progressive conditions, or who become disabled during their programme of study, to continue their studies\n* Promote an inclusive environment and attitude at TES Institute and endeavour to provide appropriate training to staff where required","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:47:53.884Z","updatedAt":"2021-09-23T14:50:20.991Z"}
