{"id":"0eeabf5e-4b3a-4dd1-9afc-be1b4a8818fa","name":"The Education Learning Trust","code":"1OJ","type":"lead_school","isAccreditedBody":false,"urn":"141275","ukprn":"10047166","address":{"addressLine1":"Hawthorn Road","addressLine2":"Gatley","town":"Cheadle","county":"Stockport","postcode":"SK8 4NB"},"contact":{"website":"http://www.gatleyprimary.com","email":"ccoleman@gatleyprimary.com","telephone":"1614286180","fullName":"Claire Kitchen"},"location":{"latitude":53.3896068,"longitude":-2.2371435},"trainWithUs":"The Education Learning Trust is passionate about shaping the minds of the future. The Trust comprises of three primaries and two secondaries. The Lead schools for ITT are Gatley Primary and The Kingsway Secondary. The ELT are at the forefront of school-led Initial Teacher Training and is uniquely placed to deliver innovative training opportunities. One of the most empowering routes into teaching is the School Direct route. It offers the opportunity to learn with and from a team of professionals in an inspirational school. Gatley School Direct trainees have an outstanding record since September 2014.\n“This year has been the most intense year of my life but at the same time everything I have experienced has been really, really rewarding and I’m so glad that I’ve come into teaching”\n(School Direct Trainee 2015-2016)\n“I cannot speak any more highly of the course and the opportunity we have been given. Being trained by professionals who are truly passionate about what they do, makes me feel I have been given such a fantastic head start. The support I have received throughout the course has been amazing”\n(School Direct Trainee 2016-2017)\nGatley, The Kingway and their alliance partners, working together, have combined their expertise to continue to deliver the School Direct programme into 200-21. This will be the alliance’s 7th year of delivering its very successful School Direct Programme. The diverse representation of schools within the alliance offers a vast range of experiences giving trainees the opportunity to learn and excel.","trainWithDisability":"We offer a wide range opportunities to learn about special educational needs and how to support children with needs.We give an opportunity to experience a special school as well as looking at special needs in mainstream. In line with the code of practice, you will learn how to support all pupils.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:49:25.552Z","updatedAt":"2021-10-05T20:50:24.092Z"}
