{"id":"0f3abdaf-7b36-422e-a700-046f8a641c60","name":"Cornwall School Centred Initial Teacher Training. (Cornwall SCITT)","code":"C79","type":"scitt","isAccreditedBody":true,"ukprn":"10007063","address":{"addressLine1":"Truro College","addressLine2":"College Road","town":"Truro","county":"Cornwall","postcode":"TR1 3XX"},"contact":{"website":"http://www.cornwallscitt.org","email":"scitt@truro-penwith.ac.uk","telephone":"01872 305728","fullName":"Julie Bennett"},"location":{"latitude":50.2630357,"longitude":-5.1006316},"trainWithUs":"Cornwall SCITT is an outstanding provider of teacher training for Primary and Secondary teaching routes.\n\nWe are deeply committed to ensuring the very best outcome for our student teachers and for the young people of Cornwall. Our training programmes reflect the unique needs of young people at all stages of their educational development, and value the importance of bespoke training to ensure that our graduates possess the knowledge and skills to successfully embark on a career in education. Central training for our Primary Course is delivered at Heartlands, near Redruth, and for our Secondary Course at Truro College. Most of the year is spent in schools, gaining first-hand experience with the support of experienced school-based trainers.\n\nCornwall SCITT was graded as outstanding in their last Ofsted inspection. Embedded in our approach is a strong relationship with local schools, and our reputation for providing outstanding training endorses our graduates to local employers. We are supported by specialists working within our partnership schools to ensure that our training reflects current best practice and continues to be innovative.\n\n[Visit the Cornwall SCITT Website](https://www.cornwallscitt.org/)","trainWithDisability":"Cornwall SCITT is founded on the principles of equality and inclusion. Our management team, academic tutors, subject leaders and school-based mentors strive to ensure the best possible outcomes for all student teachers. Prior to the start of the course all student teachers undertake a health and physical capacity to teach check. \n\nFor those with additional learning needs, every student teacher receives bespoke support from a dedicated academic tutor who can provide support with assignment writing. Students can also access additional support through Student Finance's Disabled Learning Allowance Scheme. \n\nWe carefully select placement schools for those with physical needs to optimise any reasonable adjustments that may be required. Mentors and subject leaders can provide support to those with visual and hearing difficulties to develop impairment-friendly strategies within the classroom.\n\nOur personalised approach to learning allows those with mental health needs to develop their practice with support from the central management team. We offer an empathetic dialogue to provide an appropriate balance of support and challenge throughout the programme.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:56:16.957Z","updatedAt":"2021-08-05T17:01:49.587Z"}
