{"id":"0fb2b8f2-25f4-45f0-a50a-62ca25f4e8db","name":"Nicholas Postgate Catholic Academy Trust","code":"2DW","type":"lead_school","isAccreditedBody":false,"urn":"142282","ukprn":"10053805","address":{"addressLine1":"St. Patrick’s Catholic Primary School","addressLine2":"Westbury St","town":"Thornaby","county":"Stockton on Tees","postcode":"TS176NE"},"contact":{"website":"https://stpatrickscp.npcat.org.uk/","email":"enquiries@stpatrickscp.npcat.org.uk","telephone":"01642 676724","fullName":"Mark Ryan"},"location":{"latitude":54.5511198,"longitude":-1.2992746},"trainWithUs":"Nicholas Postgate Catholic Academy Trust is a family of 23 primary schools serving communities across Teesside and North Yorkshire.\nYou will be trained only in ‘Good’ and ‘Outstanding’ schools to develop you into a teacher, having the opportunity to train within Nicholas Postgate Catholic Academy Trust (NPCAT). For further information please visit: https://npcat.org.uk/\nSt. Patrick’s Catholic Primary is the lead school within the partnership and the school has a wealth of experience in training teachers. You will be working alongside, receiving support and benefiting from the guidance of experienced classroom practitioners.\nOur vision is to work in close partnership with all of our trainee teachers so they receive bespoke support. Your class-based learning is complemented through a comprehensive professional development programme led in partnership with Leeds Trinity University. This will be delivered by experienced teachers with current and relevant curriculum expertise. Almost all of the professional development programme is delivered within school. Leeds Trinity visit the schools to deliver their training.\nSt. Patrick's works in close partnership with its partner schools across NPCAT to support and develop our next teachers. You will be based in two schools during your training.\nOur role is simple: to support and help our trainees so they can enter the teaching profession well prepared. Being a successful teacher can be challenging, but the rewards are immense. Our ultimate aim is to nurture and develop our next generation of teachers so they bring positive outcomes to our schools and communities.\nPlease contact us for more information.","trainWithDisability":"All of the schools are inclusive schools. We recognise that disabilities and other needs can be wide ranging and diverse, therefore we offer bespoke support to individuals to meet their needs.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:54:19.131Z","updatedAt":"2021-08-23T23:55:22.077Z"}
