{"id":"0fd2de51-736a-4516-81ce-94659d58951d","name":"Mid Somerset Consortium for Teacher Training","code":"M84","type":"scitt","isAccreditedBody":true,"ukprn":"10034178","address":{"addressLine1":"Crispin School","addressLine2":"Church Road","town":"Street","county":"Somerset","postcode":"BA16 0AD"},"contact":{"website":"http://www.mscitt.org.uk","email":"office@mscitt.org.uk","telephone":"01458 449418","fullName":"MSC Office"},"location":{"latitude":51.1297721,"longitude":-2.7314701},"trainWithUs":"The MSC is a SCITT based at Crispin School in Street, Somerset. Each year we train between 35 and 50 trainees in a range of secondary school subjects. We work with most schools across Somerset and North Dorset as part of a well developed and pro-active partnership aiming to supply well qualified teachers in to our schools.\n\nWe are a local provider specialising in working with career changers and local residents who want to train to teach in their local schools.\n\nWe have excellent outcomes for our trainees; we were ranked 27 out of 153 secondary trainers across the UK in the Good Teacher Training Guide 2017.\n\nWe understand that training to teach can be hard work and sometimes stressful; we pride ourselves on our pastoral care of our trainees.","trainWithDisability":"The MSC welcomes all candidates and trainees with disabilities, health conditions, metal health conditions or learning difficulties and aims to support all candidates and trainees throughout the recruitment process and training course. We support trainees with their specific learning needs to achieve their dream of becoming a teacher and will ensure appropriate support throughout the recruitment process and training year. As an experienced provider of Initial Teacher Training, we are proud to have supported students with a variety of additional needs to become fantastic and successful teachers. We will aim to tailor our support to make sure that the course is both accessible and achievable. We encourage all candidates/trainees with any disability or health conditions to discuss this with the MSC. If you wish to discuss any of the above, please contact the office. We work closely with trainees and schools to ensure training is accessible and personalised to an individual's needs.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:56:27.006Z","updatedAt":"2021-09-15T14:02:09.358Z"}
