{"id":"106d33a1-8d87-440f-b156-69dc935d693a","name":"PACE Academy Trust","code":"1O1","type":"lead_school","isAccreditedBody":false,"urn":"140704","ukprn":"10045671","address":{"addressLine1":"Chipstead Valley Primary School","addressLine2":"Chipstead Valley Road","town":"Coulsdon","county":"Surrey","postcode":"CR5 3BW"},"contact":{"website":"https://www.paceacademytrust.com/teacher-training/","email":"tsadministrator@chipstead.croydon.sch.uk","telephone":"1737553255","fullName":"Clare Rackham"},"location":{"latitude":51.3167348,"longitude":-0.160282},"trainWithUs":"PACE Academy Trust, in partnership with Roehampton University, provides bespoke, school-based teacher training with exceptional levels of support and guidance for all our trainees. We offer a PGCE with QTS as the accreditation for all school direct students, whether salaried or fee-paying trainees and we base our students in school for the entirety of the academic year. We create an environment in which staff, pupils and trainee teachers all feel valued and supported and this leads to a culture of enthusiasm, commitment and outstanding achievement.\n\nWe provide a unique opportunity to experience a diverse and contrasting range of teaching and training experiences across our local area. The School Direct Lead School for PACE is Chipstead Valley Primary School, an Ofsted Outstanding school in Croydon. Within our trust, we have New Valley Primary and Keston Primary in Croydon and Stanford and Beecholme in Merton. \n\nOur outstanding practitioners have a proven track record in training and professional development and all our trainees receive the highest level of continual support throughout their training. This covers all aspects of teaching life including behaviour management skills, planning and assessment, subject knowledge, professional enrichment, SEND, inclusion, pastoral care and a wide range of pedagogy. All students have the opportunity to work closely with an experienced, trained mentor and will become part of the school ethos from the first day of entry.\n\n100% of students we have trained agreed that if they were to do it again, it would be with us!","trainWithDisability":"Chipstead Valley Primary has an Enhanced Learning Provision Unit (ELP) for pupils on site, which means that we have full accessibility for those with physical disabilities (ramps, wheelchair access, refuge areas, lifts etc).\nWe can provide modified materials for those with dyslexia or visual impairments and are happy to support all other disabilities in any way necessary. Please contact us to discuss the needs you would have and we can discuss how we can provide you with tailored, specific support.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"accreditedBodies":[{"id":"33037eab-f75d-4350-b1e2-967c41e9d4c6","code":"R48","name":"Roehampton University","description":"The School Direct Training Programme (tuition fee) route is open to all high quality graduates. Applications are made to individual schools. Trainees carry out training at Roehampton and within their school. \\r\\n\\r\\nThis route leads to a PGCE with 60 Master’s credits on successful completion. There will be three assignments across the year. You will spend at least 120 days in school and will also attend classes at Roehampton. Your main placement will be in the school that you have applied to and there will also be a shorter placement in another school which will add breadth to the experience."}],"createdAt":"2021-07-06T17:48:28.643Z","updatedAt":"2021-09-29T02:30:28.648Z"}
