{"id":"10a0d5b3-b953-40ac-ad6b-ee4fa3f4a087","name":"River Wye Federation","code":"2JP","type":"lead_school","isAccreditedBody":false,"urn":"116919","ukprn":"10070385","address":{"addressLine1":"Whitchurch CE Primary School","addressLine2":"Whitchurch","town":"Ross-on-Wye","county":"Herefordshire","postcode":"HR9 6DA"},"contact":{"website":"https://www.whitchurch.hereford.sch.uk/","email":"vtansley@whitchurch.hereford.sch.uk","telephone":"1600890571","fullName":"Vicky Tansley"},"location":{"latitude":51.8545982,"longitude":-2.651951},"trainWithUs":"The River Wye Federation is based at Whitchurch CE Primary, an outstanding school, situated on the borders of Herefordshire, Gloucestershire and Monmouthshire. Whitchurch is federated with Weston under Penyard CE Primary and is a member of the Wye Valley Learning Network. We are committed to ‘being the best we can be.’ As a result of this we work alongside schools to provide support, continuing professional development and workshops for children. We passionately believe in every child’s ability to fulfil their potential and are clear about our role in providing the very best teaching in order for this to happen. That high quality first teaching is at the core of our practice. We have specialist teachers in curriculum development, NCETM maths, English and ECT support amongst our staff and expertise across all age ranges, more able children and those with special needs. As a Schools Direct school we are able to offer placements in a range of Primary Schools including:\n* Brampton Abbotts CE Primary School\n* Bridstow CE Primary School\n* Goodrich CE Primary School\n* Gorsley Goffs Primary School\n* Kimbolton St James CE Primary\n* Lea CE Primary school\n* Ledbury Primary School\n* Ludlow Junior School\n* Orleton CE Primary School\n* St Thomas Cantilupe CE Primary School\n* Weston under Penyard CE Primary School\n* Whitchurch CE Primary School","trainWithDisability":"The River Wye Federation provides opportunities for candidates with disabilities and other needs. Candidates will work alongside our co-ordinators in order for them to achieve their potential. The well being of all adults and children is at the heart of our federation’s development.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"6019b3ce-f2f6-4b0e-b2a9-5813d74c4d54","code":"W80","name":"University of Worcester","description":"We have worked alongside the University of Worcester for the past eight years providing high quality placements, in a supportive environment, for both PGCE and BA (Hons) students.\\r\\nFor the past three years we have also run a School Direct programme alongside the University of Worcester."}],"createdAt":"2021-07-06T17:51:28.205Z","updatedAt":"2021-09-25T22:44:39.910Z"}
