{"id":"10d4c862-a0d1-45bb-bf1b-0bc2d5409158","name":"Coastal Teaching Partnership South","code":"2LA","type":"lead_school","isAccreditedBody":false,"urn":"116498","ukprn":"39410758","address":{"addressLine1":"Crofton School (Coastal Teaching Partnership South)","addressLine2":"Marks Road","town":"Stubbington, Fareham","county":"Hampshire","postcode":"PO14 2AT"},"contact":{"website":"https://www.ctpsouth.uk/","email":"teachertraining@croftonschool.co.uk","telephone":"01329 664251","fullName":"Stuart Barnes"},"location":{"latitude":50.8227081,"longitude":-1.2046582},"trainWithUs":"The CTPS was one of the first secondary Schools Direct teacher training providers on the South Coast and we are an established and experienced secondary teacher training provider. Centred in Fareham we liaise with education providers in the surrounding areas to the benefit of all schools and young people.\n\nWe are able to offer a variety of school experiences including Special School provision and work closely with the University of Winchester in developing teacher trainees academically and vocationally. Our students are truly comprehensive and trainees are guaranteed to given the opportunity to work students from different backgrounds and origins. You will be awarded a PGCE (Secondary) 11-18 at the end of the programme and will benefit from an experienced team of mentors in school and at the University to ensure that you make the very best progress over the course of the year meaning that you are best prepared for the challenges and opportunities of taking up a full time position in your first post as an Newly Qualified Teacher (NQT).","trainWithDisability":"Your wellbeing is a top priority and we will do all we can to give you the chance to flourish and maximise your potential. In partnership with the University of Winchester there is a dedicated student support team to help with any questions or challenges you might experience during your studies. We work with you to support your wellbeing and mental health, provide confidential advice and offer workshops to boost your academic skills. If you have a disability or learning difference, we encourage you to get in touch before you apply so we can discuss tailored support for your individual needs.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:54:02.150Z","updatedAt":"2021-09-07T17:55:45.578Z"}
