{"id":"1116b22f-57b5-4fa0-8710-9bd51f1b73d6","name":"Benton Dene School","code":"18O","type":"lead_school","isAccreditedBody":false,"urn":"108655","ukprn":"10077003","address":{"addressLine1":"Hailsham Avenue","town":"Longbenton","county":"Tyne and Wear","postcode":"NE12 8fd"},"contact":{"website":"https://www.bentondeneschools.org.uk/","email":"helen.richardson1@bentondeneschool.co.uk","telephone":"0191 6432730","fullName":"North Tyneside Special School Partnershi"},"location":{"latitude":55.0197687,"longitude":-1.5728151},"trainWithUs":"Benton Dene School is a Good special school (Ofsted 2017) for primary aged pupils experiencing complex moderate learning difficulties or Autistic Spectrum Disorders (ASD).\n\nThe school has specific provision to meet the educational needs of pupils with ASD who may not have any additional learning difficulties. However, most children will have additional education needs in areas such as: the development of learning, communication, speech and language, emotional, behavioural and social skills, personal and independence skills, motor skills and sensory issues.\n\nWe provide a bespoke training package that provides you with experience in a special and mainstream school. \n\nAll of our students have left as at least good but the majority have been outstanding.","trainWithDisability":"We have a multi-disciplinary approach to the education of our pupils involving Educational Psychologists, teachers of the deaf and visually impaired, Speech and Language Therapists, Occupational Therapists, Paediatricians and Psychiatrists and Public Health Nurses. A Primary Mental Health Worker, Social Workers and Education Welfare professionals.\n\nThe Local Authority’s commissioned Language and Communication Team supports pupils in schools across North Tyneside and also has responsibility for Dene Communication Centre – a specialist pre-school provision for children with Speech, Language and Communication needs for children across the borough.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:49:27.365Z","updatedAt":"2021-10-06T23:30:48.834Z"}
