{"id":"111dd349-9bea-46b6-b75c-e13581145b55","name":"Wigan and West Lancashire Catholic School Direct","code":"27Q","type":"lead_school","isAccreditedBody":false,"urn":"106540","ukprn":"10003956","address":{"addressLine1":"St Edmund Arrowsmith Catholic High School","addressLine2":"Rookery Avenue","town":"Ashton in Makerfield","county":"Wigan","postcode":"WN49PF"},"contact":{"website":"www.catholicsd.org.uk","email":"enquiries@catholicsd.org.uk","telephone":"1942363306","fullName":"Sarah Cole"},"location":{"latitude":53.4825325,"longitude":-2.6398373},"trainWithUs":"The Wigan & West Lancashire Catholic School Direct Programme is a fantastic opportunity to work and learn within a partnership of nine Catholic Secondary schools and one Catholic Sixth Form college, all of which share the same outstanding values and ethos:\n* St Edmund Arrowsmith Catholic High School, Ashton-in-Makerfield (Lead School) * St Mary's Catholic High School, Astley * St Bede's Catholic High School, Ormskirk * St John Fisher Catholic High School, Wigan * Our Lady Queen of Peace Catholic Engineering College, Skelmersdale * St Peter's Catholic High School, Orrell * Holy Cross Catholic High School, Chorley * St Gregory's Catholic High School, Warrington * St John Rigby Catholic Sixth Form College, Orrell *Saints Peter and Paul Catholic College, Widnes\nWe work closely together, with a commitment to providing first class Initial Teacher Training, that not only equips trainees with the skills and knowledge required to teach their subject, but also appreciates the distinct nature that working as part of a Catholic community can bring. All of our schools are conveniently located, with excellent transport network links. The pupils in our schools are happy, friendly and well behaved, and at the heart of everything we do. Many of our pupils consistently out-perform their national peers and make significantly more progress. Employability rates of our trainees are excellent, with a significant proportion gaining positions within our partner schools. We believe that our staff are our most valuable resource. By training potential new staff ourselves, we ensure we recruit the best.\n(www.catholicsd.org.uk)","trainWithDisability":"We are committed to ensuring equality of opportunity for all applicants. It is a personal choice if you wish to inform us of your disability, however we would want to support you, and put reasonable adjustments in place, as much as possible. The Liverpool Hope University Learning Support Team assist us, with Learning Support Plans being used as the main method by which information is communicated to all relevant parties.\n\n[For further information:](www.hope.ac.uk)","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"e328aab3-a535-4921-8ded-5e37133c76dd","code":"L46","name":"Liverpool Hope University","description":"We have worked in partnership with Liverpool Hope University for many years now. They provide subject pedagogy support as well as the Masters Level teaching that leads to the award of PGCE."}],"createdAt":"2021-07-06T17:51:03.400Z","updatedAt":"2021-09-16T15:03:37.084Z"}
