{"id":"1165d5fd-11f4-4dab-99c9-47b309481463","name":"Canterbury Christ Church University","code":"C10","type":"hei","isAccreditedBody":true,"urn":"133806","ukprn":"10001143","address":{"addressLine1":"North Holmes Road","town":"Canterbury","county":"Kent","postcode":"CT1 1QU"},"contact":{"website":"https://www.canterbury.ac.uk/study-here/train-to-teach/train-to-teach.aspx","email":"PGadmissions@canterbury.ac.uk","telephone":"01227 926699","fullName":"PGCE Admissions"},"location":{"latitude":51.277939,"longitude":1.090659},"trainWithUs":"Canterbury Christ Church University (CCCU) is one of the largest and well-respected providers of postgraduate initial teacher education in the country. We offer a wide range of programmes leading to Qualified Teacher Status (QTS) for those wishing to teach in primary and secondary schools and a variety of qualifications for those wishing to teach in further education sector. Ofsted has praised us for our high employment rates and said that CCCU is making a significant contribution to teaching in the local area.\nOur courses offer a blend of subject knowledge and theory which is directly linked to school-based teaching and learning. We aim to help you become a confident, high-achieving teacher. You will develop a wide range of strategies for supporting children and young people’s learning to help them maximise their learning.\nYour learning will be underpinned by the latest research so you will receive up-to-date provision. You will be supported by tutors and mentors who are all qualified teachers. Our students regularly comment on how friendly and supportive the university and course team are. Our range of placements mean that you will gain a wide experience of education and learning in different settings. You will have an excellent support network both in school and at university. Read more about our courses at https://www.canterbury.ac.uk/study-here/train-to-teach/train-to-teach.aspx","trainWithDisability":"Canterbury Christ Church University is committed to ensuring that you can succeed and reach your full potential. We have a range of support services to help you both during your application and during your course. Please see our website at https://www.canterbury.ac.uk/study-here/student-life/supporting-you-to-succeed for more information and contact details.\nDepending on your need, we can offer special arrangements such as accessible interview rooms, access to a hearing loop, use of a laptop to complete written tests and information printed on coloured paper.\nIf you are dyslexic or believe you might be, we can help you with support which includes screening and learning support. Examples of support we have provided for dyslexic students in the past include extra time for exams and consideration for spelling and grammar. A dedicated team of mental health practitioners can help you with any mental-health related queries. You are able to access support services including resources and techniques to help with anxiety, stress and depression. They also refer students for counselling both within the University and externally. If you have been diagnosed with a long-term psychological condition, the team can help you access further support which includes help with accessing funding and tailored.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"createdAt":"2021-07-06T17:52:05.705Z","updatedAt":"2021-09-29T16:23:50.439Z"}
