{"id":"11837e30-bbcb-4958-9bf2-df59160ffb6e","name":"Learners First Schools Partnership","code":"1GX","type":"lead_school","isAccreditedBody":false,"urn":"140646","ukprn":"10045188","address":{"addressLine1":"Learners First Schools Partnership","addressLine2":"Bawtry Road","town":"Wickersley","county":"Rotherham","postcode":"S66 1JL"},"contact":{"website":"http://www.learnersfirst.net","email":"teachertraining@learnersfirst.org","telephone":"1709267021","fullName":"Sarah Butler"},"location":{"latitude":53.4218884,"longitude":-1.273433},"trainWithUs":"Learners First Schools Partnership is an inclusive, not-for-profit teaching school partnership of over 200 schools and academies. Learners First is a large, well established and successful partnership covering all phases (0-19) and school contexts with a proven track record across all key performance indicators. Learners First is based in South Yorkshire and much of its work takes place across this area but the partnership has strong connections with many other schools, academies, multi academy trusts, teaching schools and system leaders from across the country.\nLearners First provides high quality, relevant professional development and facilitates opportunities for forward thinking research and school-to-school support to promote meaningful collaboration and school improvement. School Direct is an ever increasingly popular alternative route into teaching which is more school-based and school-led than a traditional one year PGCE.\n85% of the programme is spent in at least 2 schools training, teaching and observing lessons and best practice. The remaining 15% is spent at one of our partner HEIs' studying for the PGCE element of the programme. The school based part of the programme is bespoke to the individual, and there's a full and comprehensive support network for each trainee. Graduating the programme means the award of QTS and PGCE.\nUpon graduation via the School Direct route, there is the intention to offer graduates their first job as a teacher. Over the past 2 years 96% of Learners First School Direct graduates have been offered employment within our partnership of schools.","trainWithDisability":"Learners First Schools Partnership (LFSP) is committed to promoting disability equality, eliminating unlawful discrimination in all of its activities and working towards ensuring that all trainees with disabilities realise their potential. LFSP values the diversity of its trainee population and is committed to ensuring that the highest equality and diversity standards are maintained.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:46:52.693Z","updatedAt":"2022-02-08T18:27:06.867Z"}
