{"id":"12492a29-b42b-448b-9b66-5a6e93dbda88","name":"Winchester Schools’ Partnership","code":"27L","type":"lead_school","isAccreditedBody":false,"urn":"116468","ukprn":"10016269","address":{"addressLine1":"Kings’ School","addressLine2":"Romsey Road","town":"Winchester","county":"Hampshire","postcode":"SO22 5PN"},"contact":{"website":"www.winchesterschoolspartnership.org","email":"enquiries@winchesterschoolspartnership.org","telephone":"01962 861161","fullName":"Rob Jeckells"},"location":{"latitude":51.0578498,"longitude":-1.344983},"trainWithUs":"Winchester Schools' Partnership comprises of schools within the City of Winchester, Peter Symonds Sixth Form College and The University of Winchester. Our aim is to provide excellent teacher training for our city and the surrounding area.\nThe University of Winchester is recognised by OFSTED as an ‘Outstanding’ provider of teacher education at both primary and secondary level and has a long history of training teachers. Our schools, meanwhile, have considerable experience and expertise in developing and supporting both qualified teachers and those entering the teaching profession. Winchester is a beautiful and well situated city which has many good and outstanding schools and children growing up in the area receive an education of high quality. It is a fantastic place to live and work and, as a trainee teacher, you will be within schools that are totally committed to providing you with the best training year possible. We offer both primary and secondary positions and also are able to provide short term placements within a special school or sixth form college to interested applicants.\nThe school based mentors of our School Direct teachers are very experienced and often outstanding teachers who are well trained in coaching, classroom observation and feedback skills. They work closely with staff at The University of Winchester, an institution with which the schools have an excellent relationship. Since the inception of School Direct, all those who have completed the course with WSP and wanted to apply for newly qualified teacher posts have successfully gained employment.","trainWithDisability":"Your well-being is a top priority and we will do all we can to give you the chance to flourish and maximise your potential. In partnership with The University of Winchester, there is a dedicated student support team to help with any questions or challenges you might experience during your studies. We work with you to support your well-being and mental health, provide confidential advice and offer workshops to boost your academic skills. If you have a disability or learning difference, we encourage you to get in touch before you apply so we can discuss tailored support for your individual needs.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:49:19.463Z","updatedAt":"2021-10-07T18:30:29.030Z"}
