{"id":"1274db06-d413-4798-bc6f-d4deda140b19","name":"Benfleet Team Supporting All","code":"1JH","type":"lead_school","isAccreditedBody":false,"urn":"136579","ukprn":"10033256","address":{"addressLine1":"Croft Road","town":"Benfleet","county":"Essex","postcode":"SS7 5RN"},"contact":{"website":"http://www.theappletonschool.org","email":"sparsonson@theappletonschool.org","telephone":"01268 794215","fullName":"Sarah Parsonson"},"location":{"latitude":51.5633142,"longitude":0.5531858},"trainWithUs":"The BTSA is led by three schools (The King John School, The Appleton School and Kingston Primary School) with 30 local Primary and Secondary schools in the partnership (Benfleet, Canvey, Basildon, Rayleigh, Rochford and Westcliff on Sea in Essex) We are committed to attracting, training and developing the very best graduates so that the students within our area have the very best teachers and as a result exceed the progress targets expected of them.\nIn order to realise this vision our schools have made a commitment to work together to provide a high quality training programme with TES Institute. Applicable to both the primary and secondary sectors.\nOur school based teacher training programme is led and supported by the finest classroom practitioners, using the high quality resources developed by TES Institute. The programme maximises time spent in the classroom and ensures that the face to face professional studies programme is focused, relevant and up to date. These sessions are led by top practitioners and school leaders in our locality.\nEach year our cohort of trainees are fully supported and challenged with our personalised yet tried and tested approach. In the last three years 68% of all of our trainees have completed the course with outstanding grading’s. Employment rates on completion of training currently stand at 100%.\nIn 2017 BTSA were shortlisted for a collaboration award at the national TES School Awards.","trainWithDisability":"TES Institute and BTSA are committed to promoting access for people with disabilities and additional needs. We support and enable students with physical disabilities, sensory impairments, specific learning difficulties, special psychological needs and medical conditions that can have an impact on day-to-day activities, to participate in TES Institute programmes, as far as is reasonably practicable and within any constraints laid down by relevant professional bodies.\nTES Institute will:\n* Encourage applications from people with disabilities\n* Seek to provide information in suitable formats\n* Assess applicants who disclose disabilities or specific needs solely on the basis of their academic potential and suitability to train to teach\n* Invite applicants with a disability or specific need to contact TES Institute to discuss how their requirements can be accommodated\n* Provide additional support or resources at application to enable the applicant to complete the application process including attending interview where applicable\n* Offer additional provision to ensure no disadvantage compared with other applicants\n* Work towards the earliest possible assessment of needs and offer of reasonable accommodations where required\n* Make reasonable accommodations in assessment where applicable and without impacting the learning outcomes to be assessed\n* Provide educational support services as appropriate for eligible students\n* Take steps to encourage students with progressive conditions, or who become disabled during their programme of study, to continue their studies\n* Promote an inclusive environment and attitude at TES Institute and endeavour to provide appropriate training to staff where required","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:52:37.838Z","updatedAt":"2021-09-14T20:09:05.383Z"}
