{"id":"12a0360e-341f-4650-a10e-d038387810c1","name":"Fylde Coast SCITT","code":"252","type":"scitt","isAccreditedBody":true,"ukprn":"10046861","address":{"addressLine1":"Fylde Coast SCITT","addressLine2":"Blackpool Sixth Form College","town":"Blackpool Old Road","county":"Blackpool","postcode":"FY3 7LR"},"contact":{"website":"http://www.fyldecoastscitt.co.uk","email":"aly.spencer@blackpoolsixth.ac.uk","telephone":"01253 209199","fullName":"Aly Spencer"},"location":{"latitude":53.8421039,"longitude":-3.0052471},"trainWithUs":"Our programmes are school-centred initial teacher training programmes and all lead to Qualified Teacher Status with the option of an online PGCE alongside. Our programmes are designed to maximise time spent on the job, in contrasting schools, to fully prepare candidates for life as a teacher in the area. As the one-stop shop for teacher training in the North West, we offer the following programmes:\nQTS 3-7 with Early Years specialism;\nQTS 5-11;\nQTS 5-11 with Special Educational Needs specialism;\nQTS 11-16;\nQTS 11-19.\nFirstly, our programmes are completely personalised to each candidate; no two people have the same experience because we know our trainees come from all walks of life. We tailor the year to maximise your skills and ensure you have the best possible start to your teaching career.\nSecondly, because our trainees don’t have to attend University lectures, we have time to give them a broad and carefully sequenced curriculum in total synergy with their school placements. Our trainees teach in a wide range of settings and sequentially learn the skills and knowledge to teach pupils from all backgrounds and of all abilities. Finally, our programmes are competitively priced because we know graduates are already carrying huge university debts. All of our trainees complete trauma training. We also give our secondary trainees a free qualification alongside so they all leave as qualified teachers of PSHE Association [Personal, Social, Health and Economic Education]. Please visit our website for further information: https://www.fyldecoastscitt.co.uk/","trainWithDisability":"The Fylde Coast SCITT encourages the development of a teacher training community in which diversity is valued. An important part of putting this into practice is a commitment to prohibit discrimination on the grounds of disability in all training matters, to increase employment opportunities for people who have a disability and to ensure that its recruitment and selection processes are fully accessible.\nAt the point of application, we ask candidates if they need any adjustments for the assessment day or any extra time to complete the activities. We make it clear that any information will always be kept strictly confidential unless they agree to it being shared with schools or mentors.\nWe meet individually with trainees regularly about their needs. Trainees have different learning needs and are members of diverse communities: a trainee with dyslexia may also be a single parent and a trainee with depression may also be struggling with finance. Talking to trainees about their individual needs early, and ensuring all reasonable adjustments are in place before they begin their placements in schools, is crucial. In our Ofsted inspection report 2017, it states:\nBoth pastoral support and wrap-around, bespoke care across the partnership are outstanding. Every trainee teacher has access to the partnership’s life coach. He delivers regular sessions to individuals and to the cohort on developing resilience, maintaining a work–life balance and ensuring emotional well-being. Trainees really value this unique feature of the partnership.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:56:48.793Z","updatedAt":"2021-09-29T17:05:49.948Z"}
