{"id":"12b0c520-ab1e-4119-9807-b29c4aef5479","name":"Dallam Teaching Alliance","code":"3DS","type":"lead_school","isAccreditedBody":false,"urn":"137205","ukprn":"10034628","address":{"addressLine1":"Dallam Teaching Alliance, C/o Dallam School","addressLine2":"Haverflatts Lane","town":"Milnthorpe","county":"Cumbria","postcode":"LA7 7DD"},"contact":{"website":"https://www.dallamta.co.uk","email":"enquiries@dallamta.co.uk","telephone":"015395 65165","fullName":"Ruby Summerscales"},"location":{"latitude":54.2282817,"longitude":-2.7685283},"trainWithUs":"Dallam Teaching Alliance is an alliance of secondary schools in and around The Lake District in South Cumbria and within easy reach of the M6 and Lancaster. A high quality experience: Dallam Teaching Alliance and the University of Cumbria have an outstanding partnership. We have many years’ experience training and supporting new trainees into the teaching profession.\nConvenient training in a beautiful rural location: Our Alliance schools are placed throughout South Cumbria so no matter where you live in the area you will not have too far to travel.\nTrainee support: We offer comprehensive support throughout the course and pride ourselves on really getting to know our trainees. We endeavour to place our trainees in the most appropriate placement schools where they can hone their skills and flourish as teachers. Boarding facilities: If you are from further afield and would like to train with us we are able to offer boarding facilities at Dallam School.\nOutdoor education: Dallam School is a regional centre for outdoor education and an Operating Authority for the Duke of Edinburgh Award scheme.\nInternational dimension: As well as being a local comprehensive, Dallam is home to over one hundred boarders from across the globe including Europe, Nigeria, Hong Kong, Chile and the USA. This means we are truly an international school.","trainWithDisability":"We are committed to ensuring that our trainees are able to participate effectively in all aspects of the course.\nIf you have a disability, or additional requirements, please contact us so we can discuss how best to accommodate your needs.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:54:03.278Z","updatedAt":"2021-07-15T17:34:01.259Z"}
