{"id":"133b003d-f8ce-44db-be1d-16cb0e481800","name":"Collingwood College","code":"1LJ","type":"lead_school","isAccreditedBody":false,"urn":"136828","ukprn":"10034091","address":{"addressLine1":"Collingwood College","addressLine2":"Kingston Road","town":"Camberley","county":"Surrey","postcode":"GU15 4AE"},"contact":{"website":"http://www.collingwoodcollege.com","email":"e.wright@collingwood.surrey.sch.uk","telephone":"01276 457600","fullName":"School Direct Co-ordinator"},"location":{"latitude":51.3507418,"longitude":-0.7210243},"trainWithUs":"Collingwood College is Surrey Heath’s first high-performing Academy. Collingwood is one of Surrey’s largest and most successful secondary schools for students aged 11-19. We have more than 1700 students, including a Sixth Form of well over 250 and 150 teaching and support staff, all of whom are dedicated to ensuring that all our students fulfil their potential and enjoy to the full their secondary education.\nAs a comprehensive school specialising in Technology, we welcome students of all abilities. The College offers an outstanding range of educational and extra-curricular opportunities, which few other schools can match. The College’s very successful OFSTED inspection in January 2017 confirmed it to be a good school with outstanding leadership and management. Collingwood’s breadth of curriculum and the quality of the Sixth Form received particular praise. Academic performance at GCSE and A Level is impressive. Our relentless focus on English and Maths ensures results at GCSE are consistently high. Able students are stretched with, on average, 20% of the cohort achieving 5 or more Grade 7-9 each year.\nThe diverse talents of our students supported by committed and highly experienced staff are key factors in the success of the College. All Collingwood students are offered a wide range of personal development and leadership opportunities within their curriculum. We have a thriving Sixth Form based in a purpose-built teaching centre. The majority of our students progress into our Sixth Form and from there into higher education. We offer extensive academic and vocational programmes of study.","trainWithDisability":"Just as we are an inclusive secondary school, so too are we inclusive with staff and trainees. In the past we have been able to accommodate trainees who had to access the site in a wheelchair and we are very happy to accommodate where we can.","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"6439adcc-af64-4d3d-a1da-de045755db06","code":"R12","name":"University of Reading","description":"The University of Reading’s Institute of Education is an established provider of high-quality training and research. It is ranked 10th in the UK for Education (The Guardian University League Table 2022).\\r\\n\\r\\nCommitted to developing caring, reflective, professional teachers, it has well-established partnerships with over 400 schools in Berkshire and the surrounding area.\\r\\n\\r\\nOfsted report that the “effective relationships with partner schools support the development of high quality teaching and trainees that are well-prepared to work in the region’s schools.” (ITE inspection report, September 2016)."}],"createdAt":"2021-07-06T17:49:34.912Z","updatedAt":"2021-10-21T23:00:09.441Z"}
