{"id":"136170e8-4cb3-45f3-bc2d-3f028bccb3c8","name":"Mid Essex Initial Teacher Training","code":"M82","type":"scitt","isAccreditedBody":true,"ukprn":"10058864","address":{"addressLine1":"Mid Essex ITT","addressLine2":"Notley High School & Braintree Sixth Form","town":"Braintree","county":"Essex","postcode":"CM7 1WY"},"contact":{"website":"http://www.midessexteachertraining.com","email":"admin@midessexteachertraining.com","telephone":"01376 556 398","fullName":"Mid Essex ITT"},"location":{"latitude":51.865992,"longitude":0.550046},"trainWithUs":"Mid Essex is an outstanding school-based Initial Teacher Training scheme (Ofsted, October 2017), working with 22 local schools in Essex. We will train you to teach at secondary school level and, after successfully completing the course, you will be awarded Qualified Teacher Status (QTS) and a Postgraduate Certificate in Education (PGCE) accredited by the University of Greenwich. You can choose to train full-time in one year, or part-time over two years. Mid Essex ITT has been training teachers for almost 25 years and has excellent employment rates for its trainees.\nMid Essex ITT is unique in that all our training is run by experienced, practising teachers. As well as four days a week in your placement school, you will receive one day a week of training at our centre at Notley High School & Braintree Sixth Form. Mid Essex ITT is run by a small, friendly team who get to know all the trainees well and can offer personalised support. You will also have the support of a Course Tutor, subject mentor, Professional Mentor and Lead Subject Mentor.\nEach year, Mid Essex ITT welcomes around 50 trainee teachers across 15 different subjects. You can find out more about our staff, our trainees and upcoming events on our website and social media pages:\n[The Mid Essex ITT website](https://www.midessexteachertraining.com/)\n[The Mid Essex ITT Wordpress Blog](https://midessexitt.wordpress.com/)\n[Mid Essex ITT on Facebook](https://www.facebook.com/meitt/)\n[Mid Essex ITT on Twitter](https://twitter.com/MidEssexITT)\nIf you are interested in training to teach in Essex, please get in touch!","trainWithDisability":"Mid Essex ITT is fully committed to fairness and equality. We strive to recruit from all backgrounds and ages and value the diversity it brings to the profession. We have full disabled access at our training venue and a number of our schools. In the past we have provided extra support such as help with proof-reading assignments, providing handouts on pastel coloured paper and running “Breakfast Support” sessions and Wellbeing days. If you think you may require assistance with any of the tasks at our interview and assessment day, we are happy to chat in advance about how we can make them accessible for you.\nWe welcome any requests from applicants concerning anything we can do to support you as you apply to join the course.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:55:54.897Z","updatedAt":"2021-09-24T18:19:10.556Z"}
