{"id":"13a37d5e-61a5-4fb2-aa03-54eebf8d41e5","name":"Forest of Dean Schools Direct (Formerly WGSP Schools Direct)","code":"2C1","type":"lead_school","isAccreditedBody":false,"urn":"148212","ukprn":"10087083","address":{"addressLine1":"Forest of Dean Schools Direct","addressLine2":"Lydney CofE Primary","town":"Bream Road","county":"Lydney, Gloucestershire","postcode":"GL15 5JH"},"contact":{"website":"https://www.sfat.uk/forest-of-dean-schools-direct/","email":"schoolsdirect@lydney.gloucs.sch.uk","telephone":"01594 842172","fullName":"Leigh Grantham"},"location":{"latitude":51.7273472,"longitude":-2.5353419},"trainWithUs":"We are based in the idyllic Forest of Dean where Star Wars and Dr Who were filmed, and which also provided JK Rowling with the inspiration for Harry Potter! The Forest is a rural area between the Rivers Severn and Wye, where 31% of the population live in four market towns, the remainder in small widely scattered settlements. However, this idyll masks the fact that some areas are in the 10% most deprived wards nationally for \"Education, Skills & Training\" and \"Income Deprivation Affecting Children\" and there is a real need to raise aspirations of Forest children at an early age to make an impact in their adult life.\nTo make this happen, Forest of Dean Schools Direct works in partnership with West Gloucestershire Schools Partnership and the University of Gloucestershire, to design and deliver our Schools Direct Programme. The emphasis on ‘partnership’ is fundamental in our intention to produce highly skilled confident teachers who can make a difference to the lives of children in our schools. This approach has led to 100% of our previous students rating our programme as Very Good /Good and 92% of our graduates employed in Gloucestershire schools.\nA quote from one recent student says it all: “I have loved this course and will be recommending it to so many people. Thank you for helping me grow and believing in me, even when I doubted myself. I have grown in confidence and self-belief and am now ready to teach!”\nSo - why go anywhere else?","trainWithDisability":"The schools within the Forest of Dean Schools Direct Programme are actively inclusive and promote positive attitudes towards children and adults with disabilities.\nIt is our policy to discuss any specific requirements with students individually, but we have experience with helping students and staff who attend our training with support in areas such as dyslexia and visual impairment. In addition, we can accommodate staff and students with physical disabilities in most of our schools.\nAs part of the Schools Direct Programme, our students receive support with well-being which puts the role of teaching into context and provides strategies to help them look after themselves and have a good work-life balance.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:51:51.581Z","updatedAt":"2021-10-01T20:26:26.019Z"}
