{"id":"13c3b4cb-af2a-4b12-bcd6-d6d862a863a1","name":"BEC Teacher Training","code":"B28","type":"scitt","isAccreditedBody":true,"ukprn":"10058882","address":{"addressLine1":"c/o The Bromfords School","addressLine2":"Grange Avenue","town":"Wickford","county":"Essex","postcode":"SS12 0LZ"},"contact":{"website":"www.billericayscitt.com","email":"louise@billericayscitt.com","telephone":"01268 477611","fullName":"Billericay Educational Consortium"},"location":{"latitude":51.6047131,"longitude":0.5086671},"trainWithUs":"Join our exceptional School Centred Initial Teacher Training course. We have 26 years of experience training teachers in Essex, have been rated outstanding by Ofsted for the last 13 years, and are listed as one of the top ten teacher training providers in the Good Teacher Training Guide. Our friendly and highly qualified team know every trainee is an individual and offer ‘a very high quality of personalised pastoral and academic support’ (Ofsted) combined with a well-planned programme providing a strong foundation for your future career. Our trainees feel supported and confident that they have the skills needed to be successful teachers. All our trainees get jobs, with many following an accelerated career path.\nWhen you train with us we’ll give you:\n◆a thorough grounding in educational theory through our inspiring academic lectures and workshops.\n◆a minimum of 125 days teaching experience in our excellent partner schools\n◆a school placement from the very start of your training so you are immersed in school life from day one\n◆an experienced mentor who will help you every step of the way in school.\n◆a specialist mentor to support you in developing phase or subject specific teaching skills\n◆a personal tutor to oversee your progress. ◆opportunities to visit a variety of educational settings\n◆a chance to study for a Postgraduate Certificate in Education, worth 60 Master credits. ◆tailor made training arrangements to suit you including an opportunity to request a school where you would like to train\n◆continued support in your Early Career","trainWithDisability":"We value every trainee as an individual and we firmly believe in the importance of an inclusive learning and teaching environment where everyone can contribute and succeed. If you have a disability, we will welcome your application and our experienced team will be there to give you all the help and advice you need. Trainees have already successfully completed our training programme with conditions such as visual and hearing impairments, dyslexia, dyspraxia and autistic spectrum conditions. Once you have applied for our course, please contact us to discuss your individual needs and to identify the appropriate adjustments we can make to support you. Such adjustments could include:\n◆ adapting interview arrangements\n◆ extending deadlines\n◆ recording workshops\n◆ sending powerpoint slides in advance\n◆ photocopying on coloured paper\n◆ securing wheelchair access\nWith your permission, we will also work with your school based mentor to ensure you have all the support and reasonable adjustments you need to make the most of your school placement.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:56:54.309Z","updatedAt":"2021-10-01T17:47:21.793Z"}
