{"id":"13e1009e-7679-4772-afbd-39b47aed2a26","name":"Severn Training and Schools Alliance","code":"1B5","type":"lead_school","isAccreditedBody":false,"urn":"123635","ukprn":"10016969","address":{"addressLine1":"Severn Training & Schools Alliance","addressLine2":"Brookside Central","town":"Brookside","county":"Telford, Shropshire, West Midlands","postcode":"TF3 1LP"},"contact":{"website":"www.stsa.uk","email":"stsa@taw.org.uk","telephone":"01952 387237","fullName":"Teaching School Director"},"location":{"latitude":52.6380366,"longitude":-2.4671957},"trainWithUs":"Severn Training & Schools Alliance (STSA) are committed to inspiring the next generation of teachers, we want graduates to make the most of their degree by taking the highly successful ‘School Direct’ route towards qualified teacher status. Our programme is mostly based in school and as a consequence our trainees are highly employable by the end of the year. We offer 120 days school based experience in two contrasting schools, coupled with 60 centre based training days, all of which will take place in Telford. We offer you the opportunity to gain Qualified Teacher Status by training in schools of the highest quality across our alliance, working alongside a highly skilled and dynamic workforce. Your training programme will be supported by an excellent team of local school improvement specialists and the University of Chester.\nOur School Direct programme is based in Telford, with very good transport links to the West Midland conurbation and surrounding towns in Shropshire. Telford is home to the famous Ironbridge Gorge and as a designated new town has an abundance of affordable accommodation. Successful completion of our programme will provide candidates with Qualified Teacher Status and a Post Graduate Certificate in either Primary or Early Years (3-7) Education.","trainWithDisability":"STSA and the University of Chester are keen to ensure all students are able to achieve their learning potential. Specialist University staff will support students in identifying the most appropriate solutions to potential barriers to learning. This may include creation of an Inclusion Plan which STSA will endeavour to support.\n\nOur training base is fully accessible.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"e843cb68-d310-478c-8dba-cf9633fea086","code":"C55","name":"University of Chester","description":"We are proud to work in close partnership with the University of Chester, who are rated Outstanding by Ofsted for their primary and secondary teacher education programmes."}],"createdAt":"2021-07-06T17:52:58.330Z","updatedAt":"2021-09-17T18:14:54.963Z"}
