{"id":"141372b1-501f-420a-973d-4a719442f010","name":"Somers Park Primary School","code":"28W","type":"lead_school","isAccreditedBody":false,"urn":"137292","ukprn":"10034285","address":{"addressLine1":"Somers Park Primary School","addressLine2":"Somers Park Avenue","town":"Malvern","county":"Worcs","postcode":"WR14 1BN"},"contact":{"website":"https://www.somersparkschool.org.uk","email":"ledkins@metacademies.org.uk","telephone":"1684572949","fullName":"Byron Williams"},"location":{"latitude":52.1284018,"longitude":-2.3271503},"trainWithUs":"School Direct teacher training is an inspiring, school-centred training route where you will be immersed in the day-to day workings of a thriving school community.\nEverything we do at Somers Park is about the children. During their time at Somers Park, we enjoy seeing our learners grow into independent thinkers who have a thirst for learning and great enjoyment of school. This comes as a result of an interesting and progressive curriculum delivered by skilled and caring teaching and support staff.\nOur Think. Know. Explain. Do. curriculum model flows through the school. Children are encouraged to challenge their own ideas and those of others, experiment and explore, they engage with experiences which support and develop the whole child.\nWe have enjoyed a highly successful partnership with The University of Worcester; 100% of our School Direct trainees have achieved 'Outstanding' (70%) or 'Good' grades. Our partner schools have been carefully selected and provide further experiences and opportunities to ensure you are fully prepared to successfully gain employment and take on responsibility for your own classes at the conclusion of the course.\nYou will work closely with, and be mentored by, an experienced high quality classroom teacher - we have received many comments from students on the high quality of mentoring and coaching they have received. We are split across two contrasting sites meaning a large supportive team and a wealth of experience.\nIf you require more information about the training programme or school, please contact the Deputy Head, Laura Edkins, ledkins@metacademies.org.uk","trainWithDisability":"At Somers Park, we are committed to ensuring equality of opportunity for all pupils, staff, parents and carers irrespective of race, gender, disability, belief, sexual orientation, age or socio-economic background, in line with the Equality Act 2010.\nSupport is given to students, when needed, with both academic and pastoral needs. We signpost students to specialist services if required and work closely with our partner universities to support students.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"accreditedBodies":[{"id":"6019b3ce-f2f6-4b0e-b2a9-5813d74c4d54","code":"W80","name":"University of Worcester","description":"The course contains: \\r\\nA comprehensive induction programme.\\r\\nPersonalised school mentoring and University Tutor support throughout the programme.\\r\\nTaught days at the University with subject specialist university tutors to link theory and classroom practice.\\r\\nOn-going assessment against the Teachers’ Standards Reflective portfolio of evidence to achieve the Teachers’ Standards.\\r\\nThe University places emphasis on enabling students to develop the independent learning capabilities for lifelong learning and future employment, as well as academic achievement. \\r\\nA mixture of independent study, teaching and academic support through the personal academic tutoring system enables reflection on progress creation of a profile of skills, achievements and experiences."}],"createdAt":"2021-07-06T17:57:17.993Z","updatedAt":"2021-09-21T14:34:59.175Z"}
