{"id":"147911ad-e753-45ba-8a5b-db7a1b0cd8f4","name":"Quantock Teaching Alliance","code":"2JK","type":"lead_school","isAccreditedBody":false,"address":{"addressLine1":"Quantock Teaching Alliance","addressLine2":"Haygrove School","town":"Durleigh Road","county":"Bridgwater","postcode":"TA6 7HW"},"contact":{"website":"http://quantockta.co.uk","email":"Mjfrost@educ.somerset.gov.uk","telephone":"1278455531","fullName":"Dominique Beach"},"location":{"latitude":51.1229947,"longitude":-3.0225176},"trainWithUs":"We are delighted to be working with the University of Exeter to offer School Direct training from our lead school, Haygrove School, in Bridgwater (https://www.haygroveschool.co.uk/)\nSet in the heart of Somerset on the edge of the Quantock Hills Area of Outstanding Natural Beauty our training route provides a fantastic opportunity for students to study their taught PGCE programme as part of the Ofsted ‘Outstanding’ provision at St Luke’s Campus at the University of Exeter. The rest of the training takes place in the classroom, learning from teachers and working directly with pupils from the outset.\nWe work with a range of primary and secondary schools and a local 'Outstanding' college to ensure students have as diverse experience. Our schools range from urban (town) to rural (small church schools) as well contacts with special schools and a 6th form colleges. Although our offer and our partnership with Exeter will remain the same, we may be proceeding in the 2021-2021 year under the name of Quantock Education Trust.","trainWithDisability":"The University of Exeter provides comprehensive student services that include AccessaAbility and Wellbeing teams, Student Learning Skills Service, Student Advice Unit, Counselling Service, Students’ Union Advisors, Student Health Centre, Family Centre and the Chaplaincy. For further details on the wealth of support available to you please go to [Student Support Services](http://www.exeter.ac.uk/newstudents/supportandservices/yourhealthandwelfare/#a4)\nPGCE trainees can access the support of a Wellbeing Services Welfare Caseworker to discuss concerns, talk through options for support or understand more about how the University Wellbeing Services may be able to help.\nAlongside the support described above, every PGCE trainee is assessed by an Occupational Health provider as part of the admissions process to ensure they are fit to teach in a school setting. If the Occupational Health provider recommends any adjustments, the University’s Partnership Office will ensure you are placed in schools where these adjustments can be made, providing they are logistically possible and reasonable.","accreditedBodies":[{"id":"d41a1821-e35b-48eb-bf02-4842872b04a2","code":"E84","name":"University of Exeter","description":"The university of Exeter are leaders in Initial Teacher Education (ITE), consistently graded as outstanding in all areas by Ofsted. They recruit excellent trainees who relish the opportunity to gain a strong grounding in the field of education to complement their knowledge of the subject/s they teach, whilst gaining substantial experience in the classroom via the Exeter Model of ITE"}],"createdAt":"2021-07-06T17:52:51.562Z","updatedAt":"2021-10-05T16:54:20.102Z"}