{"id":"14b9044a-557e-4408-8a3f-df8ce6079d93","name":"Teacher Training @ Knutsford","code":"1M1","type":"lead_school","isAccreditedBody":false,"urn":"138002","ukprn":"10036828","address":{"addressLine1":"Knutsford Academy","addressLine2":"Bexton Road","town":"Knutsford","county":"Cheshire","postcode":"CW14EB"},"contact":{"website":"https://www.knutsfordacademy.org.uk/staff/teacher-training","email":"ehooley@thelearningalliance.co.uk","telephone":"7919021473","fullName":"Peter Kingdom"},"location":{"latitude":53.3007853,"longitude":-2.3811572},"trainWithUs":"Teacher Training @ Knutsford is a school led teacher-training programme developed in partnership between The Learning Alliance Multi Academy Trust and Liverpool John Moores University (LJMU). Knutsford Academy is the Lead School for this programme and we are complemented and supported by schools within our Trust and other leading schools in the region for additional home school and alternative placements.\nTT@K is a combination of school based teaching experience with a university-facilitated professional studies programme, delivered through The Learning Alliance rather than at the University itself. This is, in many ways, beneficial to our trainees since University lecturers and school–based leaders and specialists deliver side by side, enabling trainees to hear about current practice in schools, and underpinning practice with educational theory. The Professional Studies lecture and seminar programme delivered within The Learning Alliance is the core part of the PGCE element of our programme. Our training programme develops outstanding and inspirational teachers with an in-depth knowledge and understanding in delivering excellence in teaching and learning.\nOur Postgraduate Certificate in Education (PGCE) with Qualified Teacher Status (QTS) provides an in-depth training programme, focused on delivering the skills, knowledge and attributes needed when embarking on your teaching career. Our training and professional studies programmes has been mapped against the new ITT Core Content Framework and focuses on meeting the Teaching Standards and gaining participants Qualified Teacher Status.\nFor more information, please contact us: ehooley@thelearningalliance.co.uk","trainWithDisability":"We are committed to working together to provide an inspirational and exciting learning environment where everybody can develop an enthusiasm for life-long learning. We believe that staff and pupils alike should feel happy, safe and valued, so that they gain a respectful and caring attitude towards each other and the environment. We are also committed to providing an environment that enables full curriculum access, plus one that values and includes all students, staff, parents and visitors regardless of their education, physical, sensory, social, spiritual, emotional and cultural needs. We are committed to taking positive action in the spirit of the Equality Act 2010 with regard to disability and to developing a culture of inclusion, support and awareness within the school. \n\nFurthermore, LJMU offer excellent support to all students with a disability or specific learning difficulty (SpLD) e.g. dyslexia. This is provided through the University’s Inclusive Services team, who have highly experienced staff members.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"ec34b77c-cba3-4598-93be-23f0471adff1","code":"L51","name":"Liverpool John Moores University","description":"Our accredited body, Liverpool John Moores University has an established reputation for high quality Teacher Training. The LJMU Partnership’s 2019 OFSTED inspection outcomes were the best on Merseyside with Primary provision graded Outstanding and Secondary programmes judged to be Good. Our Partnership with LJMU ensures that our teachers develop a deep and research-informed understanding of subjects, the curriculum, learners and learning. The Postgraduate Award from LJMU is co-designed to ensure that teaching and assignments are embedded in classroom practice. There is significant academic and pastoral support from LJMU, whose staff also visit our students and their mentors on placement."}],"createdAt":"2021-07-06T17:49:51.036Z","updatedAt":"2021-09-30T20:13:32.013Z"}
