{"id":"154509e2-743e-4f0b-9d99-396393aa57ff","name":"Leeds Beckett University","code":"L27","type":"hei","isAccreditedBody":true,"ukprn":"10003861","address":{"addressLine1":"Admissions","addressLine2":"Bronte Hall","town":"Headingley Campus","county":"Leeds","postcode":"LS6 3QW"},"contact":{"website":"http://www.leedsbeckett.ac.uk","email":"Admissionsenquiries@leedsbeckett.ac.uk","telephone":"0113 812 3113","fullName":"Leeds Beckett University"},"location":{"latitude":53.8258226,"longitude":-1.5912794},"trainWithUs":"Our aspiration is to help create great graduates, exceptional employees, dynamic citizens and enterprising leaders and we work closely with employers and partners to ensure that our graduates are ready for work, ready for life, and ready to seize the opportunities that lie ahead.\nCarnegie School of Education has been identified as one of the leading teacher training providers in England. We are one of only 25 universities to have had their initial teacher training allocations confirmed for the next three years, an acknowledgement by the Department for Education of their excellent provision. The satisfaction of our students has advanced significantly over the course of a year, in part due to the fact that students feel as though they are joining an academic community, in which they are involved in the research work of their academic colleagues, positioning our students as co-creators of knowledge.\nWork is now complete on our new Carnegie Teacher Education Building. The two storey teaching facility will be used solely by our teacher training courses and comprises a number of spaces which mimic real-life nursery and primary school settings. All the classrooms have been designed to model both primary and early-years learning environments, which will allow our teaching students to investigate the impact of the environment on learning, teaching and assessment. It will also enable the students to work with children from local schools who will be able to visit for Carnegie School of Education aspiration and project days in a cutting edge, bespoke environment.","trainWithDisability":"The Disability Advice team offers support, information and guidance at any stage of the application process and throughout your time at our University.\nSupport is available to students with a range of disabilities and long term conditions such as:\n•\tSpecific Learning Difficulties (e.g. dyslexia, dyspraxia, etc.)\n•\tMental health conditions (e.g. depression, anxiety, etc.)\n•\tLong term health conditions (e.g. epilepsy, IBS, diabetes, etc.)\n•\tAutism (including Aspergers)\n•\tPhysical conditions\n•\tSensory condition (e.g. visual or hearing impairment)\nWe would encourage you to contact us as early as possible in your application process to find out about the support available at our University and to enable us to implement any adjustments prior to your arrival. The Disability Advice team is available all year round and we welcome prospective students to contact us and arrange a visit before their course starts.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"createdAt":"2021-07-06T17:49:58.839Z","updatedAt":"2021-10-05T17:19:19.999Z"}
