{"id":"15d69054-c862-4f7a-b0ba-bb86087ce2f7","name":"Northampton Teacher Training Partnership","code":"N42","type":"scitt","isAccreditedBody":true,"ukprn":"10031382","address":{"addressLine1":"c/o Northampton School for Boys","addressLine2":"Billing Road","town":"Northampton","county":"Northamptonshire","postcode":"NN1 5RT"},"contact":{"website":"http://www.ntctsa.co.uk/teacher-training-nttp","email":"nttp@nsb.northants.sch.uk","telephone":"01604 258662","fullName":"Pasqualina Condron"},"location":{"latitude":52.2392573,"longitude":-0.8672386},"trainWithUs":"Northampton Teacher Training Partnership (NTTP) works jointly with Northampton School for Boys, an Ofsted 'Outstanding' school (Nov 2014) which is the Lead School from our Partnership. NTTP is a School-Centred Teacher Training provider based on the school site. We offer a one year full-time Secondary (11-16) teacher training course with a Post Graduate Certificate in Education currently validated by Newman University. All of the partnership schools have ex-trainees as members of staff, many of whom work as School Based Tutors for us. The partnership is comprised of schools which offer a wide range of different experiences for our trainees.\nWe encourage applications from all spheres of the community regardless of age, race, disability, religion and gender. The vast majority of trainees who successfully achieve both QTS and an academic award, gain employment in local schools, which is a huge strength of the partnership. Our Key Strengths are:\n•\tTrainees’ professionalism, the good relationships they develop with staff and pupils and their high expectations of the learners\n•\tThe pivotal role of administrative support in facilitating excellent communication across the partnership that benefits support for, and attainment of trainees\n•\tConsistently good quality school placements, and their intelligent use by the provider, to provide contrasting experiences for and carefully match them to the individual needs of trainees\n•\tThe expertise of school-based tutors in coaching their trainees towards improvement\n•\tDeveloping a strong shared ethos of pastoral care that facilitates swift and effective intervention and support for trainees.","trainWithDisability":"We support trainees with a wide variety of needs both during centre-based training and on school placements. The programme is personalised to be supportive and challenging for each trainee. We work closely with Newman University (PGCE Validating body) to ensure that trainee needs are met.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:53:27.543Z","updatedAt":"2021-09-29T20:24:24.404Z"}
