{"id":"16207dcb-70fa-4ce1-9932-1afbe2e72d1b","name":"The Federation of St. Elphege’s Catholic Schools","code":"149","type":"lead_school","isAccreditedBody":false,"urn":"102997","ukprn":"10078365","address":{"addressLine1":"St Elphege’s RC Schools","addressLine2":"Mollison Drive","town":"Wallington","county":"Surrey","postcode":"SM6 9HY"},"contact":{"website":"http://www.stelphegesrcschools.org.uk/","email":"ITT@stelph.org","telephone":"2086696306","fullName":"Laurence Hawkes"},"location":{"latitude":51.356228,"longitude":-0.127815},"trainWithUs":"The Federation of St. Elphege's Catholic Schools is based in Wallington, Greater London. St. Elphege's aims to improve teaching and learning in all areas of the primary curriculum, working tirelessly to stay at the forefront of government initiatives and pilot schemes. St Elphege's Infants was a Teaching School from 2014-2021.\nITT enables graduates to become qualified teachers through a variety of different routes such as School Direct, Post Graduate Certificate of Education (PGCE) placements and Bachelor of Education (Bed) placements. The schools offer tailored support for each individual candidate.\nAll student teachers that have been trained through St Elphege's have completed the course graded good or outstanding and have been employed immediately. Working alongside our alliance partners, we have created a robust and exciting CPD programme for teachers with different levels of experience.","trainWithDisability":"We will treat all people with dignity and respect, valuing the diversity of all. We will promote equality of opportunity and diversity. We will eliminate all forms of discrimination including race, gender, caring responsibilities, disability, age, social class and religion or belief.\nOur aim is to work in an environment free from discrimination, harassment and prejudice and embed this in all our policies, procedures, day-to-day practices within our schools and the wider community.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:55:40.864Z","updatedAt":"2021-09-13T17:33:24.818Z"}
