{"id":"16750442-7610-4767-a9bd-6055df156a16","name":"Sparkenhoe School Direct","code":"1RL","type":"lead_school","isAccreditedBody":false,"urn":"146857","ukprn":"33910076","address":{"addressLine1":"Sparkenhoe Community Primary School","addressLine2":"Saxby Street","town":"Leicester","county":"Leicester","postcode":"LE2 0TD"},"contact":{"website":"http://www.sparkenhoe.leicester.sch.uk/School-Direct","email":"dcheetham@sparkenhoe.leicester.sch.uk","telephone":"1162512686","fullName":"Mr Dan Cheetham"},"location":{"latitude":52.6300347,"longitude":-1.1185214},"trainWithUs":"Sparkenhoe School Direct is a group of schools uniquely placed to deliver rounded teaching experiences. The lead school is Sparkenhoe Primary School, a stone’s throw from the University of Leicester in the historic area of Highfields. This vibrant, diverse, multicultural region of Leicester boasts excellent community relations and is an exciting place to train and work. We place our students with Sparkenhoe as their main school and at least one alternative school placement in a contrasting locality either within the city or county. All of our schools have a history of supporting students, new staff and volunteers and have been the starting places of many successful careers in education. School staff have been guest lecturers at the University and sit on the Partnership Steering Group. We also accommodate a wide range of visitors from educational establishments across the world, recently Japanese trainee teachers and the Egyptian Minister for Education. PGCE students routinely apply for jobs at our schools and we have an excellent track record of employment with our Schools Direct graduates.\nWe offer high quality training as part of the University of Leicester course. Mentors are handpicked from our highly experienced staff and work alongside successful applicants nurturing their talents and fostering potential. Trainees experience a robust, holistic and bespoke program of induction and support that enables them to excel. Our mentors work in tandem with the University of Leicester to ensure that the each teaching experience is delivered seamlessly.","trainWithDisability":"Equality and diversity is at the core of everything that the school does.\nWe are committed to ensuring that no-one is disadvantaged because of race, sexuality, gender, disability, age or faith.\nSpecific arrangements to ensure equality for candidates with disabilities and other needs would be met on a case by case basis.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"accreditedBodies":[],"createdAt":"2021-07-06T17:50:13.777Z","updatedAt":"2021-10-13T15:13:40.512Z"}
