{"id":"16996284-9b77-4e09-aff9-50968b547dda","name":"Debden Park High School","code":"2AP","type":"lead_school","isAccreditedBody":false,"urn":"131876","ukprn":"10033412","address":{"addressLine1":"Debden Park High School","addressLine2":"c/o The Kemnal Academies Trust (TKAT), The Atkins Centre, Kemnal Technology College","town":"Sidcup","county":"Kent","postcode":"DA14 5AA"},"contact":{"website":"http://www.scitt.tkat.org/","email":"scitt@tkat.org","telephone":"020 3740 1808","fullName":"Andrew Hogan"},"location":{"latitude":51.4120189,"longitude":0.1104716},"trainWithUs":"Debden Park High School is the School Direct Lead School for our Essex training hub providing secondary (11-16) and primary (5-11) school-based teacher training. Our other ITT partner schools in the Essex Training Hub are:\nSecondary:\n* Hylands School\n* King Harold Business & Enterprise Academy\nPrimary:\n* Heybridge Primary School\n* Maldon Primary School\n* Stapleford Abbotts Primary School\n* Willow Brook Primary School & Nursery\nTrainees can gain Qualified Teacher Status (QTS) with the option to study for a Distance Learning Postgraduate Certificate in Education (DLPGCE) with Masters' credits. Our HEI Provider responsible for the PGCE is Leeds Beckett University.\nWe offer a bespoke training programme: every training session is delivered by a highly skilled, experienced and enthusiastic practitioner. Our training is relevant and responsive to current developments in education and provides a hands-­on approach to classroom practice. We believe the best teachers are trained by outstanding practitioners.","trainWithDisability":"Our excellent communication with our ITT partner schools enable us to meet the needs of our trainees wherever possible. Individual support programmes are established at the start of the training programme to ensure trainees' needs are met.\nWe believe pastoral support of our trainees is essential. SCITT staff are trained in mental health awareness and all trainees receive professional training to have coping strategies for their mental health and well-being throughout the training programme. Our Commitment - Equal, Inclusive, Diverse\nTKAT is committed to inclusion, diversity and equality of opportunity by encouraging and welcoming differences, listening to individual experiences, aspirations and accomplishments and learning how to grow better together. We welcome applications from all suitable candidates, regardless of any protected characteristic.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"1b2e3a7d-f712-48ff-b866-4a49733b8ab0","code":"K13","name":"TKAT SCITT","description":"TKAT SCITT is an accredited ITT Provider offering secondary (11-16) and primary (5-11) school-based initial teacher training awarding Qualified Teacher Status (QTS) with the option to study for a Distance Learning Postgraduate Certificate in Education (DLPGCE) with Masters’ credits. Our HEI Provider responsible for the PGCE is Leeds Beckett University.\\r\\n\\r\\nTKAT SCITT provides primary and secondary teacher training for over 40 schools in our ITT partnership. \\r\\n\\r\\nWe pride ourselves on the communication and support provided to trainees to enable them to successfully complete their training year.\\r\\n\\r\\nWe also support trainees in finding a suitable Early Career Teacher (ECT) post."}],"createdAt":"2021-07-06T17:53:04.589Z","updatedAt":"2021-10-05T16:59:44.318Z"}
