{"id":"16d63b18-f640-4267-abfe-989ef4c2f7ef","name":"St Peter’s Solihull Teaching School Alliance","code":"17Y","type":"lead_school","isAccreditedBody":false,"urn":"104119","ukprn":"10086770","address":{"addressLine1":"St. Peter’s Catholic School","town":"Solihull","county":"West Midlands","postcode":"B91 3NZ"},"contact":{"website":"https://www.st-peters.solihull.sch.uk/teaching-school/","email":"teachingschool@st-peters.solihull.sch.uk","telephone":"0121 705 3988","fullName":"Gemma Hobbs"},"location":{"latitude":52.4058341,"longitude":-1.7882931},"trainWithUs":"St. Peter's Solihull Teaching School Alliance is an Alliance of primary and secondary schools based in Solihull and Birmingham. We offer non-salaried places at primary and salaried and non-salaried places in a range of secondary subjects. As a relatively small Alliance, we pride ourselves on the personal and bespoke training that you receive with us; we tailor your training year around your experience, needs and progress. It isn't a \"one-size-fits-all\" approach for us. We work closely with two local Universities, Newman University and The University of Warwick, to offer our School Direct programmes in our schools. All of our courses allow trainees to gain QTS, a PGCE and Masters credits. If you train with us, you will receive an excellent programme of support and professional development to enable you to become an outstanding classroom practitioner. Our friendly and approachable staff are highly experienced in training and developing teachers and we are incredibly proud to have a 100% recruitment rate. We are passionate about training the next generation of teachers, and our future stars of the profession, and we help our trainees every step of the way.","trainWithDisability":"Candidates with disabilities or other needs should not be afraid of following their dream of becoming a teacher. We welcome applications from all candidates, and no applicant will be disadvantaged in the admissions process due to a disability, health condition or learning difficulty.\nIf you have a disability, including a specific learning difficulty, we strongly encourage you to tell us on your application form, as this will enable our administrative team to contact you to begin to discuss any support requirements you may have.\nIf you have disclosed a disability in your application, the selection processes we follow is identical to those for all other applicants.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:47:42.376Z","updatedAt":"2021-07-25T22:28:46.310Z"}
