{"id":"16da5c6a-4ff7-4d22-8494-24bb667e5f94","name":"Academies Enterprise Trust: South East","code":"2CF","type":"lead_school","isAccreditedBody":false,"urn":"138982","ukprn":"10033736","address":{"addressLine1":"Academies Enterprise Trust","addressLine2":"3rd Floor, 183 Eversholt Street","town":"London","county":"London","postcode":"NW1 1BU"},"contact":{"website":"https://sites.google.com/aetinet.org/academies-enterprise-trust/work-at-aet/initial-teacher-training","email":"recruitment@academiesenterprisetrust.org","telephone":"2039475689","fullName":"Tanya Bentham"},"location":{"latitude":51.5320268,"longitude":-0.1361007},"trainWithUs":"Academies Enterprise Trust is one of the largest networks of schools in England with 57 schools in virtually every region of the country. We believe that the achievement gap across our system is a provision gap and every child has an entitlement to an excellent education in every classroom, every day. We understand that getting it right in every classroom every day is hard, but it’s also the single most important thing that we do. Our people are our single greatest resource and we want to make sure we are creating the optimum environment and conditions so that everyone in AET can do their very best work. We will only deliver on our promise of excellence for all of our children if we attract, develop and retain the very best talent in the country and surround them with exceptional development throughout their careers. We want people on our team who are excited by scale and the prospect of having a deep and lasting impact on the lives of thousands of children. We also want people who are intellectually rigorous, stay curious, and generous enough to be committed to the messy challenge of collaboration.\nIn joining the Trust in your training year you will have the opportunity to make a transformational impact in the communities you work.\nWhatever your area of expertise,if you have the right skills and outlook, AET is an excellent place to develop your career.\nTo make your next move a career-defining opportunity, choose to train with us.","trainWithDisability":"We are committed to supporting trainees with disabilities and other needs, so please let us and the accrediting provider know if you would like us to make any adjustments to support you during the application, interview process and throughout your programme.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"d0986f27-a799-48e6-a367-9e3aac8924ab","code":"1CS","name":"ARK Teacher Training","description":"Ark Teacher Training is an Outstanding programme that allows graduates and career changers to become highly-effective, inspiring teachers, learning from some of the best educators in the profession.\\r\\n\\r\\nWe work in low income areas with a history of academic underachievement, striving for the best outcomes for all our pupils, regardless of their background.\\r\\n\\r\\nClassroom teaching: from day one, you’ll be in the classroom so you can have an impact straight away. Your tutor and coach will support you to build up your independent teaching time during the year."},{"id":"26797ebf-f835-47c8-9369-7d6d67fb2343","code":"C85","name":"Coventry University","description":""},{"id":"5abccd25-3cfa-47a4-9f66-d30a662ae5d1","code":"P80","name":"University of Portsmouth","description":""},{"id":"252d7e03-741e-4453-b6a8-3d361e6c9d1b","code":"E69","name":"e-Qualitas","description":""}],"createdAt":"2021-07-06T17:54:43.000Z","updatedAt":"2022-01-24T21:30:23.710Z"}
