{"id":"170e7510-6d0f-4467-b225-f20f950022e3","name":"Middlefield Primary Academy","code":"1C2","type":"lead_school","isAccreditedBody":false,"urn":"138595","ukprn":"10038094","address":{"addressLine1":"Andrew Road","addressLine2":"Eynesbury","town":"St. Neots","county":"Cambridgeshire","postcode":"PE19 2QE"},"contact":{"website":"http://www.diamondepl.org","email":"head@diamondepl.org","telephone":"01480 277494","fullName":"Tanya Grisby"},"location":{"latitude":52.2136627,"longitude":-0.2642901},"trainWithUs":"Diamond Education & Professional Learning (Diamond EPL) is the choice for you if you wish to train with a provider that prides itself on treating every trainee as an individual, tailoring the training experience to meet individual requirements and providing a strong support network. We want to train the most ambitious, enthusiastic and committed graduates who aspire to make a difference to the life chances and education of children and have a rewarding and challenging career. They will embrace all the opportunities we offer at the beginning of their journey to becoming outstanding teachers.\nWe work closely with The Diamond Learning Partnership Trust (DLPT), comprising 14 schools in the St Neots, Fenland and Royston areas (see website). Our partner schools are a mixture of large and smaller town schools, and small village schools. Our pupils are at the heart of all we do. We are focussed on providing the perfect balance between an excellent education, uncompromising pastoral care and the nurtured development of every individual child’s qualities. We believe our staff are our greatest asset, so we invest in them to ensure they also reach their full potential. Professional development of staff is a key priority.\nDuring your training, you will experience teaching in different settings to deepen your understanding of a range of educational contexts. A large proportion of your training will be in classrooms learning from enthusiastic, highly skilled and experienced mentors. All of our previous trainees have gained QTS status and been employed, 75% within the DLPT.","trainWithDisability":"We support any trainees with disabilities and other needs. Please contact us to discuss any support you may need. \n\nApplications from students who have the necessary academic qualifications/experience are also passed to the Disability Advice Team at the University to make a provisional assessment of educational and related personal support needs. Read more here:\nhttps://www.beds.ac.uk/student-support/disabilities2/","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"af388cc3-644a-4fd3-bd71-55503b74fc21","code":"B22","name":"University of Bedfordshire","description":"The University of Bedford has an excellent reputation in training teachers, which spans over 100 years. It has a strong working relationship reinforced by working with a number of School Direct partners in both primary and secondary phases. The Gateway building features high-quality teaching spaces, informal learning spaces, and lecture theatres; as well as a new student services centre. The university Teaching Practice resource collection offers a wide range of items that students can take into the classroom to enhance their teaching including books for children, audio-visual materials and boxes of artefacts."}],"createdAt":"2021-07-06T17:47:44.750Z","updatedAt":"2021-08-12T22:27:53.534Z"}
