{"id":"1722b419-05e7-4994-ab16-9741d0975c21","name":"Thames Gateway Teaching School Hub","code":"1FN","type":"lead_school","isAccreditedBody":false,"urn":"136662","ukprn":"10033431","address":{"addressLine1":"Thames Gateway Teaching School Hub","addressLine2":"Leigh Academies Trust c/o Strood Academy","town":"Strood","county":"Kent","postcode":"ME2 2SX"},"contact":{"website":"www.thamesgatewaytsh.org.uk","email":"enquiries@tgtsh.org.uk","telephone":"1634412265","fullName":"Medway Teaching School Alliance"},"location":{"latitude":51.398135,"longitude":0.466407},"trainWithUs":"As one of the DfEs 87 Teaching School Hubs, our mission to ‘provide excellent professional development opportunities to support educators as they shape the lives of every child in our region’ drives our work. This evidence-based, comprehensive offer starts when colleagues enter the very first stages of their leadership journey with us and place a commitment to world-class Initial Teacher Training at the heart of our work. Our partnership with KMT leads to exciting opportunities to provide professional development which enables our colleagues to thrive as they move through their ITT opportunities into their Early Career Teacher programmes and beyond. We have led Initial Teacher Training for nearly ten years. Colleagues work with us from schools all over Medway and further afield. With our work underpinned by our core values of integrity and a shared ambition, a pursuit for being research led and a commitment to collaboration, our partnerships are rich and diverse. We are delighted to work with schools in every stage and phase, from Early Years to Post-16, with expertise in SEN, and with the full spectrum of specialisms. We are proud of our commitment to mentoring and to working with our Curriculum Hubs to provide specialist curriculum support. We are committed to safeguarding and promoting the welfare of children and young people and expect all staff and volunteers to share this commitment. Seeing our children thrive is at the centre of all we do. We are excited to welcome you to start your journey with us.","trainWithDisability":"We value equality and believe in the uniqueness and worth of each individual, and the experience they bring. We look to work positively, capturing what’s good and building upon it, providing holistic support and nurture for both staff and pupils. We are therefore committed to working with colleagues who require additional support throughout their training.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:55:31.572Z","updatedAt":"2021-09-30T20:49:04.840Z"}
