{"id":"1748c4f3-e6ca-411e-a01f-798f1fc99daa","name":"Bridgewater High School","code":"2H4","type":"lead_school","isAccreditedBody":false,"urn":"141598","ukprn":"10048090","address":{"addressLine1":"Bridgewater High School","addressLine2":"Broomfields Road, Appleton","town":"Warrington","county":"Cheshire","postcode":"WA4 3AE"},"contact":{"website":"https://bridgewaterhigh.org","email":"j.hodgson@bridgewaterhigh.com","telephone":"01925 263919","fullName":"Teaching School Administrator"},"location":{"latitude":53.3629643,"longitude":-2.5753247},"trainWithUs":"Bridgewater High School is responsible for the design and delivery of TCAT's ITT programme based at Bridgewater High School in Appleton in South Warrington. Why train with us?\nYour two Secondary placements will take place in contrasting schools in our family of TCAT schools, within a 5 mile radius of the school ensuring you can concentrate on becoming the best teacher possible without a long commute to school. Our course leads to QTS, a PGCert qualification and PSHE accreditation. All our students successfully completed the course at the end of last year, all were awarded PGCert with its masters' credits and all became accredited teachers of PSHE.\nWe provide additional subject knowledge support via our Academic Mentors as well as Curriculum and Professional Mentor support. You will be supported by all our enthusiastic and dedicated staff to ensure you fulfil your potential. This is a bespoke course and we offer bespoke placements for those wishing to pursue particular areas of development such as Inclusion and STEM. We would encourage you to enrich and expand your experience beyond your two placement schools and experience what the Challenge Academy Trust can offer.\nOur inclusive schools enable you to work with students from a diverse range of social backgrounds and from SEND to the most able. We want you to join us and fulfil your potential and become a highly effective teacher and inspire the next generation to achieve the best for themselves","trainWithDisability":"Bridgewater High School is an inclusive school for both pupils and members of staff. We have lifts available to provide access to most teaching areas of the school. Areas of the school are set up to facilitate current members of staff with hearing difficulties and further areas can be created as required. Bridgewater High School is a split site school and transport is provided for all staff to change sites. Staff with and without mobility issues use this facility. At Bridgewater every member of staff is treated as an individual and we would try to accommodate every applicant that applied to train with us.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"0e64ff81-c28a-46fa-96fd-0fa735e9c357","code":"M70","name":"Endeavour Learning SCITT","description":"QTS is awarded by Endeavour Learning Trust, an outstanding provider of Teacher Training and the PGCert is awarded by Liverpool John Moores University. Our trainees have full access to the University resources to support work on their assignments and are supported by LJMU teaching staff to ensure a high quality learning experience."}],"createdAt":"2021-07-06T17:49:53.815Z","updatedAt":"2021-10-01T16:46:21.998Z"}
