{"id":"174b60fe-3dac-47c0-a65a-5691b6dda11c","name":"The John Taylor SCITT","code":"24V","type":"scitt","isAccreditedBody":true,"ukprn":"10057362","address":{"addressLine1":"John Taylor High School","addressLine2":"Dunstall Road","town":"Barton under Needwood","county":"Staffordshire","postcode":"DE13 8AX"},"contact":{"website":"https://jtscitt.co.uk/","email":"l.axten@jths.co.uk","telephone":"01283 247813","fullName":"Mrs Leah Axten"},"location":{"latitude":52.765731,"longitude":-1.716944},"trainWithUs":"The John Taylor SCITT, offering both primary and secondary programmes is based at John Taylor High School. We work in collaboration with 15 secondary school partners, 35 primary and 3 special school partners all of which are located within half an hour of the SCITT, predominantly in Staffordshire and South Derbyshire.\nWe are a relatively small provider and pride ourselves on knowing all our trainees well and being able to offer highly personalised support. Typically we have between 5-7 trainees per subject on our Secondary programmes and approximately 20 trainees on our Primary Programme. Trainees on both Primary and Secondary programmes work closely with specialists from their phase and subject. These pedagogy and subject experts will get to know them very well during the course of the year, visiting them in their placement schools and supporting them during weekly training sessions and termly tutorials. We consider the phase and subject specific expertise to be a strength of our programme. Additional in-school support is provided by professional mentors, subject mentors, school mentors and members of the SCITT team. The John Taylor SCITT is based at the John Taylor High School site in a bespoke training centre. In 2017 the SCITT was commended by Ofsted for :\n* their vision and ambition\n* the training and support provided\n* the quality of placements offered\n* their responsiveness to needs and views of trainees\n* communication and collaboration with partner schools\n* trainee outcomes\n* employment rates\n* professionalism and commitment of NQTs","trainWithDisability":"The John Taylor SCITT welcomes applications from people with disabilities. The training centre, on the John Taylor High School site has full access and facilities for people with disabilities.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:48:06.842Z","updatedAt":"2021-09-28T19:57:21.165Z"}
