{"id":"1751c254-9181-4287-80bb-eada4bf05068","name":"Cheshire Leadership & Teaching Alliance","code":"144","type":"lead_school","isAccreditedBody":false,"urn":"138742","ukprn":"10038606","address":{"addressLine1":"Kelsall Primary School","addressLine2":"Flat Lane","town":"Kelsall","county":"Cheshire","postcode":"WA16 9QG"},"contact":{"website":"www.cheshirelta.co.uk","email":"admin@cheshirelta.co.uk","telephone":"01829 752811","fullName":"Carole Farrell"},"location":{"latitude":53.2050365,"longitude":-2.7164632},"trainWithUs":"Cheshire LTA was designated as a Teaching School in February 2013, the first Teaching School in Cheshire. It is now a strategic partner of the Cheshire Teaching School Hub. We are working together to deliver high quality training for teachers Our School Direct Programme is an exciting school based training route for graduates interested in primary school teaching.\nWorking in partnership with the University of Chester we deliver Initial Teacher Training (ITT), leading to accreditation for the Post Graduate Certificate of Education (PGCE) with Qualified Teacher Status (QTS).\nWe have an excellent reputation for delivering high quality innovative training by practioners within our Alliance and designated Specialist Leaders of Education, ensuring our training is practical, relevant and up to date.\nWHAT ARE WE LOOKING FOR IN A CANDIDATE?\n- Friendly, approachable and have a positive outlook\n- Organisation and time management skills\n- A passion for teaching and learning - A creative and innovative approach\n- The ability to reflect on and develop good practice\nELIGIBILITY\n- GCSE Grade C/4 or above in English Language, Maths & a Science\n- UK undergraduate 2:2 degree or a recognised equivalent qualification\nWe understand the needs of our trainees, identify their strengths and ultimately help them go on to gain employment as a Early Career Teachers.\nWe want all our Associate Teachers to be successful, fulfilled professionals who can make a difference.\nThe course is non-salaried and tuition fees are paid to the University of Chester. We look forward to working with you!","trainWithDisability":"All reasonable adjustments to provision will be made to ensure that learners with a learning difficulty, disability and/or a medical condition that affects their learning are not substantially disadvantaged. \n\nIf you have a learning difficulty, disability and/or medical condition, please ensure that we know what you need so that we can make all reasonable adjustments to help you succeed.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"e843cb68-d310-478c-8dba-cf9633fea086","code":"C55","name":"University of Chester","description":"At the heart of the University’s vision is an unwavering commitment to ensuring an outstanding student learning experience, developing the expertise of staff and providing teaching excellence.\\r\\n\\r\\nThrough these actions, the University hopes to make a positive impact on the lives of students, staff, and the communities that it serves, enabling the institution to make a significant and growing contribution to the region, nationally and internationally.\\r\\n\\r\\nIn valuing and celebrating its long history and traditions, the University is committed to engendering a sense of pride and shared ownership in all that it does."}],"createdAt":"2021-07-06T17:53:53.375Z","updatedAt":"2022-01-17T21:38:15.132Z"}
