{"id":"1794bba0-082c-48f9-beab-53738f7cf396","name":"Whitley Bay Teacher Training","code":"1HM","type":"lead_school","isAccreditedBody":false,"urn":"108638","ukprn":"10007799","address":{"addressLine1":"Deneholm","town":"Whitley Bay","county":"Tyne & Wear","postcode":"NE25 9AS"},"contact":{"website":"https://www.whitleybayhighschool.org/teacher-training","email":"schooldirect@whitleybayhighschool.org","telephone":"1917317070","fullName":"School Direct Administrator"},"location":{"latitude":55.0481908,"longitude":-1.4659412},"trainWithUs":"You can complete your Initial Teacher Training through the Whitley Bay School Direct Teacher Training. We are partnered with a range of inspirational schools that educate young people from Year 1 to Year 13. Our School Direct programme means you will be in the classroom from day 1, learning first-hand the knowledge and skills needed to become an outstanding teacher. We work in conjunction with Newcastle University and on successful completion of the training year you will be awarded either a Professional Graduate Certificate (Level 6) in Education or a PGCE (Level 7) with Qualified Teacher Status (QTS).\nWe have a national reputation for the quality of our: Teaching and Learning; innovative and rigorous training; and the exceptional levels of support offered for emerging teachers, as captured in the comments below, taken from our latest cohort of newly qualified trainees:\n‘The most supportive, insightful group of professionals behind you’\n‘Great range of creative and interesting training in a variety of schools’\n‘Quality of training is phenomenal’\n‘Outstanding - the programme is superb as it is delivered by very experienced and approachable staff who genuinely care about you’ ‘This alliance is at the forefront of teaching and learning’\n‘Employers are keen when they know you’ve trained with Whitley’","trainWithDisability":"All schools within the Whitley Bay School Direct Teacher Training are fully accessible. Provision for additional support where needed is provided on site. Applicants who would benefit from disabled access should let us know on their application so that they can be considered for placements at the most appropriate schools\nPlease contact Sharon Armstrong on sharon.armstrong@whitleybayhighschool.org with any specific disability access requirements.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"accreditedBodies":[],"createdAt":"2021-07-06T17:53:23.989Z","updatedAt":"2021-11-11T22:04:49.730Z"}
