{"id":"17aa7869-bf7f-4997-969a-38d9a9a740e9","name":"St Mary and St Thomas Aquinas Catholic Primary School","code":"1EW","type":"lead_school","isAccreditedBody":false,"urn":"108392","ukprn":"10074467","address":{"addressLine1":"St Mary and St Thomas Aquinas","addressLine2":"Stella Lane","town":"Blaydon","county":"Tyne and Wear","postcode":"NE214NE"},"contact":{"website":"https://www.centreforteaching.com/contact-us/","email":"aherdman@stb.bwcet.com","telephone":"01207 520424","fullName":"Elaine White"},"location":{"latitude":54.9696712,"longitude":-1.7335636},"trainWithUs":"Gateshead Teaching School Alliance works in partnership with Carmel Teacher Training Partnership (CTTP), an outstanding Initial Teacher Training Provider and Bishop Wilkinson Education Trust who in turn work with ITT providers within the North East region. Our training programmes are Primary 5-11 years . We pride ourselves on the bespoke level of training for all our trainees, focused on our high quality training provision from very experienced practitioners. The Partnership is made up of Catholic and non-Catholic, primary schools, widely spread across Gateshead and the surrounding area. The GTSA School Centred Initial Teacher Training course aims to promote excellence in all aspects of education. This is achieved through high quality central and school-based training activities, regular observations with developmental feedback, to secure progress throughout the training programme. Central training takes place in clusters around our Lead Schools. Our overarching aim is to provide the most skilled and competent practitioners for our schools, improving the outcomes and life chances for young people. A very high percentage of trainees on our programme either gain employment in their placement schools, or within our Partnership of schools. GTSA is a well-established Provider, offering a friendly, nurturing and supportive environment for all trainees.","trainWithDisability":"All Schools within the Gateshead Teaching School Alliance, Carmel Teacher Training Partnership and Bishop Wilkinson Trust are fully accessible. Provision for additional support where needed is provided on site.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:52:50.274Z","updatedAt":"2021-11-01T18:18:03.081Z"}
