{"id":"185b0977-4aa4-4082-b385-27b30af11dbb","name":"Brays ITT","code":"1MR","type":"lead_school","isAccreditedBody":false,"urn":"144042","ukprn":"10007166","address":{"addressLine1":"Brays Road","addressLine2":"Sheldon","town":"Birmingham","county":"West Midlands","postcode":"B26 1NS"},"contact":{"website":"http://fet.ac","email":"a.whitehouse@fet.ac","telephone":"0121 743 5730","fullName":"Paul Roberts"},"location":{"latitude":52.4593467,"longitude":-1.7945414},"trainWithUs":"Our programme is for those who are passionate about wanting to work in Special Education.\nThrough our strong alliance of good and outstanding special schools that educate pupils in a unique range of types of SEND and our mainstream partner schools we can offer you a rich and varied training experience.\nWe are happy for you to contact us prior to applying for advice or for us to arrange school experience.\nWe recognise that a 1 year PGCE is a demanding experience and previous trainees have praised our accessible and personal pastoral support. We have a very high rate of trainees completing and passing our PGCE course. All of those who have completed our course in the last 5 years have succeeded in finding teaching jobs.\nForward Education offers a range of learning and development opportunities for all of our staff. Beyond your PGCE year, if you started your employed teaching journey with us, we offer our Early Career Teachers (ECTs), a comprehensive two year induction, which includes access to the national Early Career Framework, Trust and school based induction and training about various aspects of SEND pedagogy. Beyond your two year induction we also offer a range of leadership development, curriculum subject development and further training on a wide range of SEND pedagogy . As a result nearly all of those who have trained with us are still teaching and some have moved successfully into middle / senior leadership roles within our Trust.","trainWithDisability":"As a provider that specialises in SEND we are committed to supporting trainees who have disabilities or other needs because we believe that this gives you an insight into the needs of our pupils.\nOur schools and the university all have accessibility plans and we will work closely with you to consider any reasonable adjustments that we can make to your training and school placements to enable you to succeed.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:55:21.277Z","updatedAt":"2021-09-16T19:34:26.112Z"}
