{"id":"191401fe-efde-439a-8fbd-5c4a54b3e442","name":"Oxfordshire Teacher Training","code":"24T","type":"scitt","isAccreditedBody":true,"ukprn":"10046745","address":{"addressLine1":"The Cherwell OTSA SCITT","addressLine2":"The Cherwell School","town":"Marston Ferry Road","county":"Oxford","postcode":"OX2 7EE"},"contact":{"website":"http://www.oxfordshireteachertraining.co.uk/","email":"info@ott-scitt.org.uk","telephone":"01865 518209","fullName":"Marion Rawlings"},"location":{"latitude":51.7757449,"longitude":-1.2586363},"trainWithUs":"What makes our programme special?\n•\tOur trainees are called Associate Teachers, rather than interns, student teachers or trainees, which indicates your status as someone valued and respected, while starting out in this fantastic profession. •\tAs well as being fully committed to supporting you with our brilliant training programmes the vast majority of the team are also current school teachers, which means everything we do is grounded in the reality of the classroom. •\tWe deliver an ambitious, integrated curriculum based on our seven Core Areas which has been designed to support your development to become a confident, competent and determined teacher with the capacity and drive to improve pupil outcomes. •\tWe have the highest employment rate of any local provider and one of the highest nationally! The Headteachers who have employed our graduates agree that our training ensures people are well prepared for the profession.\n•\tWe are a big enough organisation to offer a wide range of high-quality programmes and great peer support, whilst also having a highly personalised approach and ethos which nurtures individuals. •\tIn December 2017 we were graded as Outstanding in all areas in our first [Ofsted ITT inspection] (https://oxfordshireteachertraining.co.uk/wp-content/uploads/2018/02/The-Cherwell-OTSA-SCITT-Ofsted-final-PDF.pdf) •\tWe offer you a choice of three school-based locations (Hubs) for training, in Banbury, Oxford and Henley, and you can specify a preference of school placement locations (some elements will only be delivered in one location so you will need to travel at times, see our [website] (https://oxfordshireteachertraining.co.uk/) for further information.)","trainWithDisability":"At Oxfordshire Teacher Training we are committed to equality and diversity in our schools and the Associate Teachers training to teach in them, in order to create a diverse and inclusive profession. We welcome all applications and are happy to discuss any specific needs or concerns with you at any stage.\nIn the early stages of training, you will be invited to dig deep and share your specific needs, core values and beliefs with the SCITT Team, who will then tailor bespoke support packages for you. This not only ensures accessible learning during all training opportunities - both in school and with peers in training - but also ensures each individual develops and strengthens their own particular teacher toolkit, for a sustained and mentally-healthy teaching career ahead. This means that Associate Teachers with, for example, profound hearing impairment, with processing or memory challenges or with a history of social anxiety will have the opportunity to observe highly-skilled practitioners with identical needs and discuss strategies to overcome traditional barriers and stigma. Our dedicated Wellbeing Team works hand-in-hand with Programme Leaders and partnership colleagues to construct a support package which emphasises guided independence, and prioritises self-care and increasing agency, in order to ensure that each graduate Associate Teacher leaves the programme knowing when and where to seek support and advice.\nThat so many of our alumni become mentors, buddies and partnership colleagues is testament to this pioneering approach to nurturing the whole teacher within mentally-healthy school communities.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:47:14.341Z","updatedAt":"2021-10-02T20:53:05.670Z"}
