{"id":"19a3446e-382d-4c14-83bb-a76563cef3c1","name":"Leeds Trinity University","code":"L24","type":"hei","isAccreditedBody":true,"urn":"133838","ukprn":"10003863","address":{"addressLine1":"Leeds Trinity University","addressLine2":"Brownberrie Lane","town":"Horsforth","county":"Leeds","postcode":"LS18 5HD"},"contact":{"website":"https://www.leedstrinity.ac.uk","email":"admissions@leedstrinity.ac.uk","telephone":"0113 283 7123","fullName":"Leeds Trinity University"},"location":{"latitude":53.8481606,"longitude":-1.6459213},"trainWithUs":"Leeds Trinity University has been synonymous with high quality teacher training since 1966, when we were founded as a Catholic teacher training college. \n\nOver the years, we’ve diversified and expanded to become renowned for teaching excellence and producing highly employable graduates across many subject areas, but an unwavering commitment to outstanding teacher training has remained at the heart of what we do. \n\nRecognising that people begin PGCE courses with different levels of experience and skills, we train you in three stages to build your confidence and capability with a mix of research-informed practice, school-based training and plenty of one-to-one support. \n\nWe work with over 600 schools – from small rural schools to large, inner-city high schools. We work with ‘Outstanding’ schools leading innovations in education, as well as schools that may have difficulties in reaching outcome targets at the end of key stages. \n\nWhen you train with Leeds Trinity, you’ll experience best practice in school improvement, whichever school you train in.\n\nYou’ll work with expert school mentors while on placement and receive help, advice and support from University-based link tutors. This combination means you’ll get specialist training on teaching the most difficult aspects of subject content, and understanding children and young people at various ages and stages of development.\n\nAfter you graduate, we offer excellent support for teachers in the early stages of their career, and have a very strong Early Career Teacher (ECT) programme, with CPD, an active online community, and an annual conference.","trainWithDisability":"We’re committed to ensuring that every student with potential, regardless of their background or circumstances, has the opportunity to benefit from higher education. If you have a disability or additional needs, Leeds Trinity University will endeavour to put in place reasonable adjustments to accommodate any additional requirements throughout your teacher training year. We’re able to support with conditions such as: -\tDyslexia\n-\tSpecific learning difficulties\n-\tAsperger syndrome/autism\n-\tVisual/hearing impairments\n-\tPhysical and mobility restrictions\n-\tLong-term medical conditions\n-\tA mental health condition. If you register with our Disability Service, a member of the team will develop a Learning Support Plan tailored to your specific needs. The support within this plan could include exam adjustments, extended library loans, specialist one-to-one study skills, dyslexia screening and assessments, learning materials provided in alternative formats and alternative assessments.\nWith your permission, they’ll share this plan with your University-based personal tutor so that they know how to best support you during your University-based training. They can also share this plan with the School Partnerships team, who are able to inform the host schools for your placements so they can discuss how to best support you during your school-based training.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"createdAt":"2021-07-06T17:52:55.297Z","updatedAt":"2021-09-22T21:14:08.925Z"}
