{"id":"19ade2eb-f141-4d67-8f63-b0908904aad6","name":"TADSS ITT Partnership","code":"26E","type":"lead_school","isAccreditedBody":false,"urn":"113960","ukprn":"10015594","address":{"addressLine1":"Westfield Arts College","addressLine2":"Littlemoor Road","town":"Weymouth","county":"Dorset","postcode":"DT3 6AA"},"contact":{"website":"https://tadss.co.uk/initial-teacher-training/","email":"tadssitt@westfield.dorset.sch.uk","telephone":"01305 833518","fullName":"ITT Co-ordinator"},"location":{"latitude":50.6458024,"longitude":-2.4383321},"trainWithUs":"TADSS ITT Partnership is a group of nearly 50 first, primary and special schools across Dorset. Our wide partnership gives opportunities to gain experience in coastal, rural or urban school settings, with trainees predominately placed within thirty minutes of home. Trainees can express a preference for placements in both mainstream and special schools. Our teacher training programme combines:\n* school based practice and reflection\n* academic on-line learning\n* face to face training events. We offer places for Primary phase teacher training in Dorset through the School Direct route into teaching. This means our trainees are mainly school based during their training year. The intensive and immersive classroom experience helps to build teaching skills, supported by an experienced classroom teacher and in-school mentor. Alongside the practical experience, our trainees regularly come together for our 20 day taught programme. This covers all aspects of teaching and learning, and of the curriculum. There is a strong emphasis on understanding special educational needs and positive behaviour management. The programme is designed and led by outstanding school practitioners, giving trainee teachers practical training and advice based on classroom experience\nIn addition, our trainees are students of the University of Exeter who award Qualified Teacher Status and the Post Graduate Certificate of Education to trainees on successful completion of the training year. Trainees are allocated a day each week for their academic studies with the university, studying at home or in school.","trainWithDisability":"We work with our trainees as individuals in order to ensure they can access the programme and are effectively supported in school, whatever their needs. The trainees progress in school at their own pace. The University of Exeter provides comprehensive student services that include AccessAbility and Wellbeing teams, Student Learning Skills Service, Student Advice Unit, Counselling Service, Students’ Union Advisors, Student Health Centre, Family Centre and the Chaplaincy. For further details on the wealth of support available to you please go to [Student Support Services](http://www.exeter.ac.uk/newstudents/supportandservices/yourhealthandwelfare/#a4)\nPGCE trainees can access the support of a Wellbeing Services Welfare Caseworker to discuss concerns, talk through options for support or understand more about how the University Wellbeing Services may be able to help.\nAlongside the support described above, every PGCE trainee is assessed by an Occupational Health provider as part of the admissions process to ensure they are fit to teach in a school setting. If the Occupational Health provider recommends any adjustments, the University’s Partnership Office will ensure you are placed in schools where these adjustments can be made, providing they are logistically possible and reasonable","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"d41a1821-e35b-48eb-bf02-4842872b04a2","code":"E84","name":"University of Exeter","description":"We partner with the University of Exeter to provide the School Direct fee paying distance learning programme. The university are leaders in Initial Teacher Education, consistently graded as outstanding in all areas by [Ofsted] (https://files.ofsted.gov.uk/v1/file/2739445).\\r\\n\\r\\nOur trainees access online learning with Exeter for a one day familiarisation with the training model and 6 focused seminar days across the training year. Each term, the university visiting tutor meets with the trainee and their mentor.\\r\\n\\r\\n[University of Exeter website](https://www.exeter.ac.uk/teachertraining/schooldirect/)"}],"createdAt":"2021-07-06T17:57:05.138Z","updatedAt":"2021-07-20T16:37:35.647Z"}
