{"id":"19d8dbd6-01c5-41e8-befb-b477b26de3c8","name":"University of Bolton","code":"8N5","type":"hei","isAccreditedBody":true,"urn":"133794","ukprn":"10006841","address":{"addressLine1":"Senate House, Deane Road","town":"Bolton","county":"Lancashire","postcode":"BL3 5AB"},"contact":{"website":"https://www.bolton.ac.uk/subject-areas/education-and-teacher-training/","email":"J.Hornby2@bolton.ac.uk","telephone":"1204903342","fullName":"Paul Starkey"},"location":{"latitude":53.572808,"longitude":-2.4379741},"trainWithUs":"With a student body of around 11,000 you will get the best of all worlds at Bolton. You will be based on a modern, compact campus where no-one feels anonymous and, with small teaching groups on many courses, you can be sure you are a name, not just a number.\nOur number one mission is to be a distinctive “Teaching Intensive and Research Informed” university that puts student experience and education first, supported by the quality of our staff, our facilities and our links to employment sectors.\nA Silver TEF Rated University: The University of Bolton is a Teaching Intensive, Research Informed Higher Education Institution whose distinctive high quality, student-focused, undergraduate and postgraduate programmes attract applications from all over the world. It will offer an exciting and challenging student experience with high levels of proactive student support and with excellent facilities which match the quality of its academic provision.","trainWithDisability":"We are proud that all elements of society are fully represented and that we are a culturally diverse, inclusive learning community in which staff and students continue to learn from, and celebrate, individual differences.\nWe strive to nurture the qualities that students bring with them, putting heavy emphasis on developing the skills and the interests that students bring with them, as well as stimulating new knowledge and skills. We use assessment data to improve the teaching/ learning system, curriculum, instruction, learning resources, counselling and student services and show adaptability, rigour and flexibility in identifying and meeting the needs of individuals.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"createdAt":"2021-07-06T17:46:46.025Z","updatedAt":"2021-10-12T16:45:10.788Z"}
