{"id":"19f7aa7d-b0c7-4f65-b7e7-1425ae0100a9","name":"Pimlico Academy","code":"1ZC","type":"lead_school","isAccreditedBody":false,"urn":"135676","ukprn":"10024202","address":{"addressLine1":"Lupus Street","addressLine2":"Pimlico","town":"London","county":"London","postcode":"SW1V 3AT"},"contact":{"website":"https://www.futuretraining.org/page/?title=Courses+on+Offer%3A+QTS+and+PGCE&pid=13","email":"info@futuretraining.org","telephone":"7471246588","fullName":"Natalie Parker"},"location":{"latitude":51.4881092,"longitude":-0.1376093},"trainWithUs":"Future Training at the Pimlico-London SCITT is rated ‘Outstanding’ by Ofsted and sets a new standard in school-based teacher training and mentoring. The Pimlico London SCITT is part of Future Academies, a small family of schools in London and Hertfordshire. Our motto is libertas per cultum (freedom through education) and we have the highest expectations of our students and what they can achieve. We are committed to providing all students with a rigorous education in a well-disciplined but caring environment that will help them to compete on a level playing field with their more advantaged peers.\nThroughout your training with us you will:\n•Receive weekly training from expert teachers.\n•Take guidance from carefully selected subject-specialist mentors who are trained in identifying specific, actionable feedback that will move your practice forwards.\n•Gain Qualified Teacher Status and the Post Graduate Certificate in Education","trainWithDisability":"The needs of the candidates will be taken into account at interview. Trainee teachers benefit from a mentor who leads their support throughout their training. The central SCITT team meets with trainee teachers weekly through our Professional Studies programme. This allows us to regularly update our risk assessment of the trainee teacher and adapt the course accordingly. For the right candidate(s), we may also be able to support part-time. This would be discussed at the interview stage.","accreditedBodies":[],"createdAt":"2021-07-06T17:49:34.012Z","updatedAt":"2021-07-06T17:49:34.012Z"}