{"id":"19fc94ac-62e3-4176-ac49-9c36b6d8a349","name":"The OAKS Suffolk","code":"4T6","type":"lead_school","isAccreditedBody":false,"urn":"138506","ukprn":"10038447","address":{"addressLine1":"Ormiston Sudbury Academy","town":"Sudbury","county":"Suffolk","postcode":"CO10 1NW"},"contact":{"website":"https://www.theoaks.org.uk/","email":"OAKS_Suffolk@ormistonsudbury.co.uk","telephone":"1787375131"},"location":{"latitude":52.0473157,"longitude":0.7334625},"trainWithUs":"The OAKS Suffolk is based at Ormiston Sudbury Academy in Sudbury, Suffolk and is steered by a collaborative working partnership between a number of schools in Sudbury, Clare, Ipswich, Hadleigh and Stowmarket. The schools have a combined wealth of experience and an excellent local reputation for supporting teacher training of the highest quality. This new venture acting as a hub for the Outstanding and widely respected OAKS SCITT based at Keele University, will ensure a highly personalised and rewarding pathway through initial teacher training.\nTrainees will be placed in one of the schools in Suffolk, enabling them to benefit from the experience of the OAKs Suffolk tutors and the OAKs team based at Keele University. We also strive to create great recruitment and further professional development opportunities at the end of the training year.\nOur aim is to ensure that trainees come into the profession with a high level of readiness to change lives in our local schools and act as part of the solution to the challenging recruitment picture in the area. With this in mind we will ensure there are many support structures in place for this challenging but very rewarding course to enable you to successfully gain QTS and a PGCE(m) Academic Award.","trainWithDisability":"We have a dedicated support tutor, who supports our trainees with disability or any other need. It is important to state that they do not assess your teaching performance, this gives you the opportunity to speak honestly about your needs, but also enables the support tutor to have the freedom to help you and visit you; whether you are in placement school or here at The OAKS. This includes signposting through to developing individualised learning plans which may extend beyond the course date to enable you to successfully complete the programme.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"7f349baa-f4ef-4fd5-b228-fcc56247e9b9","code":"24P","name":"The OAKS (Ormiston and Keele SCITT)","description":"The OAKS is an Ofsted Outstanding (2016) and innovative SCITT (School Centred Initial Teacher Training programme) which links Keele University and OAT (Ormiston Academies Trust) with a long established partnership of schools in various hubs across the UK.\\r\\nIt is an innovative and intensive one year course during which trainees will complete both the Teaching Standards, gaining QTS certification and obtain a Keele University PGCE academic award at either level 6 or 7.\\r\\nThe course is both supportive and enjoyable, with Outstanding success rates well above the national average for the Initial Teacher Training sector."}],"createdAt":"2021-10-18T18:11:39.830Z","updatedAt":"2021-10-31T22:55:24.063Z"}
