{"id":"1a66be16-ab17-44ac-982a-02035d8c3e84","name":"Reach Academy Feltham","code":"7K1","type":"lead_school","isAccreditedBody":false,"urn":"138266","ukprn":"10037673","address":{"addressLine1":"53-55 High Street","town":"Feltham","county":"Middlesex","postcode":"TW12 4AB"},"contact":{"website":"www.reachacademyfeltham.com","email":"reachteachertraining@reachacademy.org.uk","telephone":"020 8893 1099","fullName":"Ed Vainker"},"location":{"latitude":51.4432157,"longitude":-0.411364},"trainWithUs":"Reach Academy Feltham is an all-through school serving pupils aged 2-18 in South West London. The vision of the school is to support our pupils to develop the skills, attitudes and academic qualifications to live lives of choice and opportunity. The school is 30 minutes from Waterloo in the borough of Hounslow. Reach opened in 2012 and has quickly developed an excellent reputation. It was judged outstanding in 2014 and has achieved strong results across the board, including the 16th best GCSE results in the country in 2017. The school has a strong track record of training and developing teachers. We have trained more than 50 teachers via Schools Direct, Now Teach, Researchers in Schools and Teach First in Primary and Secondary and across a range of subjects. The school has particular expertise in curriculum design - more than 100 schools around the country subscribe to use our History and Geography curriculum - and community engagement - we work closely with families and the wider community. Instructional coaching is a strong feature of working at Reach. Every teacher and leader receives weekly coaching on their teaching and this is strong element of the training programme. We will support trainees to quickly become highly effective teachers! In addition the school has developed an innovative cradle to career model to support the whole community. The [Reach Children's Hub] (https://www.reachacademyfeltham.com/reachchildrenshub) offers expertise in working with parents and the community. Our School Direct programme is delivered in partnership with South West Teacher Training.","trainWithDisability":"We are committed to support candidates with disabilities and other needs. The school is fully accessible and we will work with prospective trainees to create a plan to enable them to flourish in the school.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:57:14.605Z","updatedAt":"2021-11-29T01:43:33.168Z"}
