{"id":"1a675a06-71eb-4ba8-9d26-ea18262884d9","name":"Bosco Sussex","code":"1KY","type":"lead_school","isAccreditedBody":false,"urn":"144243","ukprn":"10063488","address":{"addressLine1":"Elm Grove South","addressLine2":"St Philip Howard Catholic School","town":"Barnham","county":"West Sussex","postcode":"PO22 0EN"},"contact":{"website":"https://boscocet.org.uk/tsa/","email":"gjones@boscocet.org.uk","telephone":"1243552055","fullName":"Keith Perera"},"location":{"latitude":50.83361,"longitude":-0.64495},"trainWithUs":"Bosco Sussex (formally Inspire and Bosco) have strong links to a range of different schools in the Sussex region. We are committed to providing an environment for teachers to thrive whether they are at the start of their training year or whether they aspire to be headteachers.\nOur partnership of schools is not geographically rooted in one area of Sussex. The lead school for Bosco is St Philip Howard Catholic School in Barnham but our partnership is made up of faith schools, state comprehensives, primary and secondary schools, a special school and also independent schools. We are geographically spread from Brighton to Chichester and Crawley to Worthing. We believe we have a responsibility to make teaching an enriching, fulfilling and manageable career.","trainWithDisability":"We aim to support all prospective teachers to ensure that our teaching workforce reflects the communities we serve.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"accreditedBodies":[{"id":"23fba24b-1e90-4b68-9558-1814033bde74","code":"2EW","name":"Teach SouthEast","description":"As an Initial Teacher Training (ITT) provider, Teach SouthEast delivers high quality bespoke school-centred ITT programmes for aspiring primary and secondary teachers in South East England. Since its inception in 2013, Teach SouthEast has trained over 400 trainees. We seek to provide a dynamic environment where trainees on any of the ITT pathways can immerse themselves in what it is to be a great teacher, be nurtured within their own practice and be empowered to deliver outstanding lessons to our students. All trainees are provided with a trained and dedicated mentor to lead you through your training year."},{"id":"4d4cceab-1516-4a6c-a9ab-5de0e32e1fe1","code":"S90","name":"University of Sussex","description":"The University of Sussex Schools’ Partnership offers high quality professional and academic School Direct teacher Education courses leading to Qualified Teacher Status (QTS), a PGCE of 90 Masters Level Schools and the university work together at every stage of the selection, training and assessment of our beginner teachers. \\r\\nWe aim to develop ‘thinking’ teachers with an over-riding desire to make a difference to the lives of young people. As a research intensive university, we believe teachers benefit from critical engagement in evidence-based practice, reflection on research and continuing professional development as well as excellent practical classroom skills."}],"createdAt":"2021-07-06T17:47:05.315Z","updatedAt":"2021-10-08T16:38:06.008Z"}
