{"id":"1aae963f-cb7e-4c07-b271-588e6dfde1d7","name":"The South Downs School Direct Partnership","code":"2GH","type":"lead_school","isAccreditedBody":false,"urn":"140713","ukprn":"10045651","address":{"addressLine1":"Durrington High School","addressLine2":"The Boulevard","town":"Worthing","county":"West Sussex","postcode":"BN13 1JX"},"contact":{"website":"http://thesouthdownsscitt.co.uk/","email":"info@southdownsscitt.co.uk","telephone":"01903 705671","fullName":"Lianne Allison"},"location":{"latitude":50.8274631,"longitude":-0.4076364},"trainWithUs":"Durrington High School is Lead School for Primary and Secondary School Direct through The South Downs SCITT (an Outstanding Provider). The South Downs partnership is based in Worthing in West Sussex. It offers School Direct training in general primary education (five to 11 years) and secondary (11 to 16 years). Subjects offered at secondary: art, biology, chemistry, computing, drama, English, geography, history, mathematics, physical education, physics and religious education. Trainees who successfully complete their training achieve qualified teacher status (QTS) and a postgraduate certificate in education (PGCE). The PGCE is awarded by the University of Brighton. You will have access to the facilities at the SCITT, Research School, your placement schools and the university library. You will typically have a day each week working with other trainees to reflect and develop your practice and four days each week in schools working with the young people in our locality. Our course is full time for one year and commences in September. You will teach across two consecutive age ranges/phases and experience teaching in at least two contrasting schools as well as completing training in special educational needs and disabilities (SEND).","trainWithDisability":"We will discuss how we can support each applicant individually. We can make reasonable adjustments to training. Our schools all have appropriate facilities to accommodate candidates with disabilities. Candidates with dyslexia can access extra time for assignments.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"b60b0d7c-ada0-459c-9d81-da7df3e82da9","code":"2AZ","name":"The South Downs SCITT","description":"The South Downs SCITT (school-centred initial teacher training) is a provider based in Worthing in West Sussex. The SCITT is part of Durrington Multi Academy Trust (DMAT) and shares accommodation with Durrington High School and the research school. There is a strong partnership with local schools and the partners are spread throughout the West Sussex local authority. The SCITT is an Ofsted Outstanding Provider. Trainees in the SCITT are exceptionally well taught and prepared to meet the rigours of the classroom with confidence."}],"createdAt":"2021-07-06T17:51:37.612Z","updatedAt":"2021-10-01T03:57:51.599Z"}
