{"id":"1ac14a11-5310-453f-aea7-06c069dbac01","name":"First Federation Train to Teach","code":"1QR","type":"lead_school","isAccreditedBody":false,"urn":"137665","ukprn":"10035179","address":{"addressLine1":"First Federation Train to Teach,","addressLine2":"Blackpool CE Primary School, Liverton","town":"Newton Abbot","county":"Devon","postcode":"TQ12 6JB"},"contact":{"website":"https://www.firstfederation.org/train-to-teach","email":"traintoteach@firstfederation.org.uk","telephone":"1626821316","fullName":"Mrs Angela Jenkins"},"location":{"latitude":50.5542062,"longitude":-3.6774065},"trainWithUs":"First Federation Train to Teach [formally Primary Excellence Teaching School] has been delivering the School Direct programme since 2013. We are proud to be recognised as a supportive partnership. Our schools, located across Devon, are highly aspirational and are committed to sharing very best practice and provide the highest quality of teaching and learning for our children. Collaboration is at the heart of our teaching training model. Fundamental to our principle is the development of excellent teachers and high-quality leaders. Through the development of ‘Leaders of Learning’ in every classroom and sustainable leadership within and across schools, we will be able to contribute to the growth of a world class education system. We believe that every child has the right to be taught by excellent teachers in excellent schools that nurtures, challenges and supports their potential. Our School Direct Partnership is an exciting training route for top graduates, in partnership with Plymouth Marjon University. Our programme uses a variety of school-based settings, enabling trainees to experience a wide range of learning environments and contexts. This ensures that trainees are fully prepared to take up posts in schools. We are offering School Direct places for those interested in teaching in EYFS, General Primary, Primary with Mathematics, Primary with English and Primary with SEND. Our programme awards both QTS and PGCE on successful completion. It is expected that as a reflective, highly developed, early career teacher, you will secure employment in one of our partner schools.","trainWithDisability":"We are very aware of, and sympathetic to, disabilities and different individual needs that the trainees may have and we work with our ITT partner to ensure that opportunities are the same for all.\nDisability and needs disclosure: If you have an illness or a disability which you think may benefit from support from the partnership, we encourage you to disclose this to your mentor. Disclosure is a personal preference and not compulsory but for your needs to be met you will need to declare them as we do not have access to this information otherwise. For further information, it is suggested that you contact the University Disability & Inclusion Advice Service (DIAS) in Student Support. [Plymouth Marjon University]\n(https://www.marjon.ac.uk/student-life/student-support-/disability--inclusion-advice-service/)","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"a4e84530-e1f1-47c6-b57e-ec693d629637","code":"P63","name":"Plymouth Marjon University","description":"Plymouth Marjon University celebrates 180 years of teacher training and is dedicated to preparing the next generation of teachers.\\r\\nAt Plymouth Marjon learning and teaching is underpinned by research, policy and practice. \\r\\n We build on a unique, long standing heritage through the development of values-based collaborative partnerships. \\r\\n University led and school led programmes are designed to train trainees to become highly reflective teachers. At Plymouth Marjon learning and teaching is underpinned by research, policy and practice. \\r\\nWe will build on a unique and long standing heritage through the development of a values-based collaborative partnership that ensures excellent outcomes for all."}],"createdAt":"2021-07-06T17:57:15.825Z","updatedAt":"2021-10-01T20:49:37.891Z"}
