{"id":"1ac42057-a6e2-4b36-a987-69eb1426c2c8","name":"Thurston Community College","code":"2TC","type":"lead_school","isAccreditedBody":false,"urn":"124802","ukprn":"10006910","address":{"addressLine1":"Thurston Community College,","addressLine2":"Norton Road","town":"Thurston","county":"Suffolk","postcode":"IP31 3PB"},"contact":{"website":"https://www.thurstoncollege.org/Initial-Teacher-Training/","email":"swest@thurstoncollege.org","telephone":"01473 265077","fullName":"Sean West"},"location":{"latitude":52.2541589,"longitude":0.8112104},"trainWithUs":"Thurston Community College, is a highly successful secondary school in Suffolk in partnership with the Suffolk & Norfolk Secondary SCITT Tuition PGCE programme. We have an excellent local reputation for providing teacher training of the highest quality. We are a large secondary school so can offer a range of subjects and during the year we have many trainees on placement with us. Our trainees and new staff often comment upon the warm welcome they receive and how quickly they get to know students and colleagues alike. \n\nHow the placements work are you have your first placement in one school for all of the autumn term; spring term is spent in a second school and then you return to the first placement school for the summer term until the end of June. This placement structure provides you with a breadth of experiences to help inform your choice of the type of school you wish to work in as an Early Career Teacher.\n\nOur overall aim is to train you not as a teacher for a specific school but as a future member of the teaching profession.","trainWithDisability":"Suffolk and Norfolk SCITT supports all trainees based on their individual needs. Recently this has included those with dyslexia, physical, hearing and visual impairments and mental health conditions. Plans are developed with trainees to ensure that they can fully access in centre training, operate effectively on school placement and complete written assignments.\nWe are committed to supporting trainees with disabilities and other needs. All successful application complete a ‘Fit to Teach’ screening process managed by our occupational health provider. This will make us aware of any specific adaptations that you may require in order to be successful in your training year.\nWe have a highly developed programme to support trainee well-being. We know that teaching can be stressful (as it can be rewarding) and our aim is to get the right balance of skills knowing that the skills and tools you will gain will help support your well-being and mental health throughout your training and into your career as a teacher.\nPlease contact us to discuss any access requirements.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:55:59.138Z","updatedAt":"2021-10-19T18:45:34.988Z"}
