{"id":"1ad0ce7b-9fcc-4c77-8b06-88779a629750","name":"Cheshire Vale Teaching Support Alliance","code":"26L","type":"lead_school","isAccreditedBody":false,"urn":"138483","ukprn":"10003957","address":{"addressLine1":"Cheshire Vale Teaching Support Alliance c/o Tarporley High School and 6th Form College","addressLine2":"Eaton Road","town":"Tarporley","county":"Cheshire","postcode":"CW6 0BL"},"contact":{"website":"https://cvtsa.co.uk/become-teacher","email":"admin@cvtsa.co.uk","telephone":"01829 733868","fullName":"Pamela Bailey"},"location":{"latitude":53.1530408,"longitude":-2.6651634},"trainWithUs":"The Cheshire Vale TSA is a group of more than 25 Secondary and Primary schools working in partnership with Liverpool John Moores University and key partners from across Cheshire and the Wirral including Chester, Northwich, The Wirral, Ellesmere Port, Helsby and rural Cheshire and can provide a variety of teaching experiences in a range of schools which can be viewed at (http://cvtsa.co.uk/become-teacher)\n\nAs an Alliance it is our mission to provide high quality, school based initial teacher training. We know our provision ensures trainees feel fully prepared for life in the classroom and a career in teaching. Trainee teachers will have the benefit of working with a strong alliance of schools during their training year. You will train in one of our alliance schools who have a strong history of highly successful teacher-training, where you will receive intensive support from experienced teachers and mentors.\n\nYour School Direct Programme will consist of a combination of classroom practice and high quality training from experienced school staff and Liverpool John Moores University tutors. You will be given the opportunity to spend much of your time 'improving your teaching and students learning experiences' with high quality school placements from across our Teaching Support Alliance.","trainWithDisability":"Our University partner LJMU is committed to Equality of Opportunity. Their Disability Advice Team will help you access the support you need. The best time to contact the Disability Advice Team is before you start your course. By contacting the team before you begin and disclosing your disability, you'll be able to receive support from when you arrive. Email: disability@ljmu.ac.uk Tel: 0151 231 3164/3165.\nAll trainees are encouraged to disclose any specific learning need that they experience, in order to make any adjustments, both at LJMU and within our partner schools. As part of the enrolment process to Teacher Training Programmes all students are required to complete a Health Questionnaire and some may be asked to attend a screening appointment with LJMU’s Occupational Health Unit. This is designed to ensure that arrangements are in place, from the outset, to support any students who may need additional support or reasonable adjustments to be made.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:50:04.439Z","updatedAt":"2021-11-01T21:32:19.508Z"}
