{"id":"1ae3bd2b-29fc-4ba7-83bd-8e008b7920d8","name":"The Cotswold Teacher Training Partnership","code":"2EH","type":"lead_school","isAccreditedBody":false,"urn":"136292","ukprn":"10031378","address":{"addressLine1":"The Avenue","addressLine2":"Bourton-on-the-Water","town":"Cheltenham","county":"Gloucestershire","postcode":"GL54 2BD"},"contact":{"website":"https://cotswold.gloucs.sch.uk/teacher-training/","email":"bedwards@thecotswoldschool.co.uk","telephone":"1451812945","fullName":"Ben Edwards"},"location":{"latitude":51.8885387,"longitude":-1.7585323},"trainWithUs":"The Cotswold School Teacher Training Partnership offers trainees the opportunity to train on a School Direct route in an Outstanding Comprehensive school or in a range of our local excellent primary schools. We have a long tradition of training excellent teachers and superb employment rates, many at our school or in one of our near partners. We are ranked in the top 30 non selective coeducation secondary’s in the country by the Sunday Times. Pupils are receptive, engaged and enthusiastic. We are also a true comprehensive school and all trainees get opportunities to work with pupils of different abilities and at all key stages, including sixth form for secondary trainees and both main key stages for primary trainees. We have a team of experienced mentors who will support you through your training year and excellent training managers who oversee your development, provide coaching and help you to pass the course with flying colours!\nPlease see our website [www.cotswold.gloucs.sch.uk] (https://www.cotswold.gloucs.sch.uk/) for me more details","trainWithDisability":"As a school familiar with supporting pupils with special needs, we are more than ready to support candidates with disabilities and particular needs. In the past, this has included supporting teachers with dyslexia and giving them extra support with preparing teaching resources and preparing for academic assignments. We are also always on hand to help trainee teachers who are finding the strains of the course difficult and offer 1:1 mentor support and have a team of training managers ready to give support, advice and guidance. We are able to tailor our course at times to fit the needs of each individual and this has, in the past, enabled some trainees who have had difficulties to complete the course and enter teaching successfully. We are also very aware that practical arrangements and geography play a key part in choosing a teacher training provider, especially for the many career changers who apply. We look to accommodate this as best as possible when deciding upon placement schools. We also welcome applicants interested in completing the course over two years on our flexi-route approach.\nGITEP, The University of Bristol, The University of Gloucestershire and The Cotswold Teacher Training Programme are all committed to safeguarding and promoting the welfare of children and expects all our trainees to share this commitment.","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"e6c26d28-03d4-443c-9b65-5db7e183966c","code":"G48","name":"Gloucestershire Initial Teacher Education Partnership (GITEP)","description":""},{"id":"9aa67012-b776-4027-89f4-5531efb3a9d2","code":"G50","name":"University of Gloucestershire","description":""}],"createdAt":"2021-07-06T17:56:23.131Z","updatedAt":"2021-10-04T16:32:13.590Z"}
