{"id":"1ba9de37-e5c9-42c9-9eb9-f630d4fec10f","name":"St Francis School","code":"1LU","type":"lead_school","isAccreditedBody":false,"urn":"120755","ukprn":"10017640","address":{"addressLine1":"Wickenby Crescent","addressLine2":"Ermine Estate","town":"Lincoln","county":"Lincolnshire","postcode":"LN1 3TJ"},"contact":{"website":"https://www.st-francis.lincs.sch.uk/","email":"Nick.wray@st-francis.lincs.sch.uk","telephone":"07990 070638","fullName":"Head Teacher"},"location":{"latitude":53.2479767,"longitude":-0.5395883},"trainWithUs":"The St Francis School cluster is unique as we offer all our places within Special Schools, which are spread across the County of Lincolnshire. All the schools are judged Outstanding or Good by OFSTED. There are few clusters similar to ours across the country. Across our cluster, we cater for a broad spectrum of pupils with SEND. Therefore, if you have some SEND experience and this is an area in which you may be interested to take up a career in teaching, then please look to join one of our teams. We offer bespoke opportunities with experienced mentors, in supportive environments, where all the young people come first. You would gain a wide range of skills both in your base school but also with some training delivered across all our schools and opportunities to visit the other schools. The wide range of skills you acquire would prepare you well to deliver quality lessons, suitably differentiated and resourced to meet the needs of all the young people we serve so they can thrive and reach their potential.","trainWithDisability":"We really care about all of our trainees and aim to support them all of the way through their studies, from application to graduation. Here at BGU we recognise that trainees may require additional assistance to engage fully with their studies due to a range of access needs. Student Advice plays a key role in co-ordinating services available to BGU’s disabled and sensory impaired students, and/or with specific learning differences or other access needs before and during their studies. In order to assess the level of support trainees may require, we use the legal definition of disability, which is wide ranging but includes:\n•\tSpecific learning differences including dyslexia\n•\tPhysical mobility difficulties\n•\tHearing impairments\n•\tVisual impairments\n•\tPersons requiring personal care\n•\tAutistic Spectrum Disorders including Asperger’s Syndrome\n•\tMental health difficulties\n•\tMedical conditions such as epilepsy, diabetes or asthma\n•\tPlease note that this is not an exhaustive list – trainees may have access needs that are not listed above. If you are unsure whether you have access needs which are covered by disability legislation, please contact Student Advice – we will be happy to offer advice and guidance.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:46:55.735Z","updatedAt":"2021-07-16T18:08:44.784Z"}
