{"id":"1c270488-81f1-4dd3-a69c-a6d3f05dd9fa","name":"Teach in Kent","code":"26J","type":"lead_school","isAccreditedBody":false,"urn":"138046","ukprn":"10035578","address":{"addressLine1":"157","addressLine2":"Walderslade Road","town":"Walderslade","county":"Kent","postcode":"ME5 0LP"},"contact":{"website":"http://www.teachinkent.co.uk","email":"dan@teachinkent.co.uk","telephone":"1634861596","fullName":"Dan Wise"},"location":{"latitude":51.3503575,"longitude":0.5260299},"trainWithUs":"Teach in Kent offers a classroom-based training route in partnership with the TES Institute who have a reputation for innovative online learning materials which offer great flexibility for your learning.\n\nOur blended learning programme combines school-based training, online learning materials, experienced subject specialists as mentors and high quality professional studies training sessions. We are lucky to have a high number of Outstanding Teachers who act as excellent role models. You will have ample opportunity to observe them teaching and to discuss their techniques. \n\nOur partnership of over 50 schools across Kent offers a range of contexts at both secondary and primary level. We want our trainees to gain experience in different school settings to ensure they are well prepared for their future career in teaching.","trainWithDisability":"TES Institute and Teach in Kent are committed to promoting access for people with disabilities and additional needs. We support and enable students with physical disabilities, sensory impairments, specific learning difficulties, special psychological needs and medical conditions that can have an impact on day-to-day activities, to participate in TES Institute programmes, as far as is reasonably practicable and within any constraints laid down by relevant professional bodies.\nTES Institute will:\n•\tEncourage applications from people with disabilities\n•\tSeek to provide information in suitable formats\n•\tAssess applicants who disclose disabilities or specific needs solely on the basis of their academic potential and suitability to train to teach\n•\tInvite applicants with a disability or specific need to contact TES Institute to discuss how their requirements can be accommodated\n•\tProvide additional support or resources at application to enable the applicant to complete the application process including attending interview where applicable\n•\tOffer additional provision to ensure no disadvantage compared with other applicants\n•\tWork towards the earliest possible assessment of needs and offer of reasonable accommodations where required\n•\tMake reasonable accommodations in assessment where applicable and without impacting the learning outcomes to be assessed\n•\tProvide educational support services as appropriate for eligible students\n•\tTake steps to encourage students with progressive conditions, or who become disabled during their programme of study, to continue their studies\n•\tPromote an inclusive environment and attitude at TES Institute and endeavour to provide appropriate training to staff where required","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:47:40.341Z","updatedAt":"2021-11-12T20:17:57.547Z"}
