{"id":"1c98d571-b990-4c5e-a612-70333c30b248","name":"Aspirer School Direct","code":"1XQ","type":"lead_school","isAccreditedBody":false,"urn":"140444","ukprn":"10005790","address":{"addressLine1":"Ash Grove Academy","addressLine2":"Belgrave Rd","town":"Macclesfield","county":"Cheshire","postcode":"SK117TF"},"contact":{"website":"http://www.aspirerteachingalliance.co.uk/schooldirect","email":"markavis@aet.cheshire.sch.uk","telephone":"01625 466914","fullName":"Programme Leader"},"location":{"latitude":53.2442747,"longitude":-2.1324902},"trainWithUs":"Aspirer and Sheffield Hallam University work in partnership together with 15+ primary schools within Cheshire East, Cheshire West, Buxton and Manchester. Trainees will be placed in schools in the Macclesfield, Wilmslow, Crewe, Northwich, Buxton and Sandbach areas and in Fallowfield, Manchester. The schools within our alliance are varied in terms of their contexts. We work with schools in rural, urban and more deprived areas, However, all schools in our partnership are committed to ensuring the very best outcomes for all children regardless of their starting points and are excited about training the next generation of teachers who will continue to do this. As one of the first five National Research Schools, our programme is rooted in the latest understanding and research into effective teaching and learning. We strongly believe that we are best placed to share with trainees up to date, current practice around teaching and learning, classroom management and anything else that trainees need to know in order to become an outstanding and inspirational classroom practitioners, whatever school setting they choose to apply to in the future. More information about the course and the schools within our alliance can be found on our website:(http://www.aspirerteachingalliance.co.uk/schooldirect).","trainWithDisability":"Both Aspirer and Sheffield Hallam are proud of the support - from application to course completion - that we give to students with access difficulties. We consider every applicant as a unique individual with the potential to become an outstanding teacher and that we do all that we can to help trainees to overcome any barriers to success.\nIn the recent past, students with difficulties such as physical needs, dyslexia and hearing impairment have successfully gained their PGCE and QTS with Aspirer.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:53:13.308Z","updatedAt":"2021-09-10T03:38:57.759Z"}
