{"id":"1cb7705c-e6cc-4d25-b825-e62cfc846732","name":"Bransgore Initial teacher Training (BITT) – School Direct","code":"19F","type":"lead_school","isAccreditedBody":false,"urn":"137693","ukprn":"10035668","address":{"addressLine1":"Bransgore Primary, Ringwood Road","addressLine2":"Bransgore","town":"Christchurch","county":"Hampshire","postcode":"BH23 8JH"},"contact":{"website":"https://www.bransgoreprimaryschool.co.uk/initial-teacher-training","email":"j.maddams@bransgore.hants.sch.uk","telephone":"1425672272","fullName":"Bransgore Teacher Training Admissions"},"location":{"latitude":50.7773421,"longitude":-1.7299577},"trainWithUs":"Bransgore Initial Teacher Training (BITT), validated by the University of Winchester offer this Primary School Direct route into teaching. Both the School and University are rated 'Outstanding' by Ofsted and seek to offer trainees a high quality training route based on a personalised approach.\nFor trainees, the majority of the training year is spent in the classroom, learning from the expertise offered by a class teacher / mentor. Each trainee's individual strengths and areas for development are assessed and addressed on an ongoing basis. We pride ourselves in a highly personalised approach to your training.\nThe Autumn and Summer terms are spent in a 'main base school', and in the Spring term trainees have the opportunity to work in a different school setting/ Key stage for about six weeks.","trainWithDisability":"Both the school and University work with an ethos committed to inclusion and meeting the needs of each individual in a bespoke manner. As such, the course welcomes all eligible participants, regardless of sex, age, disability, sexuality, colour, religion or nationality. We welcome applications from ethnic minority and other under-represented groups.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:48:24.742Z","updatedAt":"2021-09-23T22:57:57.022Z"}
