{"id":"1d6cf404-92b6-4ad9-940a-4f965f93ccb1","name":"St George’s CofE VA Primary","code":"1SO","type":"lead_school","isAccreditedBody":false,"address":{"addressLine1":"St George’s Academy","addressLine2":"Neasham Rd., Middleton St George","town":"Darlington","county":"Durham","postcode":"DL2 1LD"},"contact":{"email":"bgreenwood@greatsmeatonschool.co.uk","telephone":"01609 881349","fullName":"Janine Gleeson / Bernie Greenwood"},"location":{"latitude":54.5140111,"longitude":-1.4704558},"trainWithUs":"We support and stretch our students to be the best they can be and provide a one to one package with a 'Team around You' approach.\nOur training programme covers a core that works in partnership with the university. It also gives you the opportunity to be a little more intrigued by how to use NLP ( Neuro Linguistic Programmming ) to develop skills that will make you an even better practitioner in the classroom. We devise a programme of placements that sees you experience a very small rural primary school of 36 children to a large two form entry Church of England Academy. We have high quality mentors who have many years experience and continue to be outstanding practitioners.\nOur team around you works on a professional basis to ensure you are not alone and can face challenges together.\nWe have access to many diverse professionals that you can strengthen your experiences as you work towards being an outstanding qualified teacher.","trainWithDisability":"Any and all disabilities are encouraged and welcomed.\nOurs schools are inclusive and diverse and we would encourage you to come and see us to see how we want to continue broadening the backgrounds of all applications.","accreditedBodies":[{"id":"b011427a-6dff-4a77-9df3-c85a54be605a","code":"Y75","name":"York St John University","description":"We have worked with York St John for a number of years now and the partnership works exceptionally well. We work to ensure our students are supported as individuals to ensure we meet your needs. \\r\\nWe work as equal partners and have strong links to all departments in the best interests of each student."}],"createdAt":"2021-07-12T20:49:40.501Z","updatedAt":"2021-07-12T20:49:40.501Z"}