{"id":"1d95b6cb-0e08-4485-848a-0e304d71102a","name":"Bishop Grosseteste University","code":"B38","type":"hei","isAccreditedBody":true,"urn":"133835","ukprn":"10007811","address":{"addressLine1":"Longdales Road","town":"Lincoln","county":"Lincolnshire","postcode":"LN1 3DY"},"contact":{"website":"https://www.bishopg.ac.uk/","email":"enquiries@bishopg.ac.uk","telephone":"01522 583658","fullName":"Bishop Grosseteste University"},"location":{"latitude":53.2438226,"longitude":-0.5364247},"trainWithUs":"Bishop Grosseteste University (BGU) has been educating students in the historic heart of Lincoln for over 150 years. Our beautiful campus is located just a few minutes’ walk from Lincoln Cathedral, Castle and the old Roman city.\nOver the past 150 years, our commitment to first-class teacher training has remained consistent and, as a result, we continue to provide schools across the country with highly-skilled graduates who are equipped to teach the next generation of young learners. Life after BGU is also extremely important to us and we offer many different methods of support for our trainees as they begin their teaching careers. The latest Graduate Outcomes survey shows that BGU is 3rd in the UK for graduate employability when compared to non-specialist universities. We organise school placements for our trainees in a diverse range of partnership schools located across the East Midlands and ensure our teacher training both in schools and at the University allows trainees to develop an extensive understanding of every aspect of teaching.","trainWithDisability":"We really care about all of our trainees and aim to support them all of the way through their studies, from application to graduation. Therefore, applicants with disabilities and other needs are encouraged to apply. The School Direct Route makes the most of in-school mentoring, offering close support for trainees. Here at BGU we recognise that trainees may require additional assistance to engage fully with their studies due to a range of access needs. Student Advice plays a key role in co-ordinating services available to BGU’s disabled and sensory impaired students, and/or with specific learning differences or other access needs.\nIn order to assess the level of support trainees may require, we use the legal definition of disability, which is wide ranging but includes:\n· Specific learning differences including dyslexia\n· Physical mobility difficulties\n· Hearing impairments\n· Visual impairments\n· Persons requiring personal care\n· Autistic Spectrum Disorders including Asperger’s Syndrome\n· Mental health difficulties\n· Medical conditions such as epilepsy, diabetes or asthma\nPlease note that this is not an exhaustive list – trainees may have access needs that are not listed above. If you are unsure whether you have access needs which are covered by disability legislation, please contact Student Advice – we will be happy to offer advice and guidance.\nAdjustments, where necessary, become part of daily inclusive practice in school. Further support, including for wellbeing, is available to all trainees through our Student Advice team. Clusters welcome any questions or enquiries throughout the application process.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"createdAt":"2021-07-06T17:46:42.704Z","updatedAt":"2021-09-25T16:20:29.818Z"}
