{"id":"1e04c08d-b7a5-4073-975e-1af8bfd24c94","name":"St John Bosco ITT","code":"1S9","type":"lead_school","isAccreditedBody":false,"urn":"103991","ukprn":"10079439","address":{"addressLine1":"Holly Lodge High School","addressLine2":"Holly Lane","town":"Smethwick","county":"West Midlands","postcode":"B67 7JG"},"contact":{"website":"http://www.stjohnboscotsa.co.uk/school-direct/","email":"imelling@holly-lodge.org","telephone":"0121 5580691","fullName":"Ian Melling"},"location":{"latitude":52.4985532,"longitude":-1.9867579},"trainWithUs":"The St John Bosco Initial Teacher Training is a partnership of primary and secondary schools across Sandwell, Dudley and South Birmingham. We aim to develop outstanding teachers. We do this by providing a subject / class mentor who supports you on a daily basis, in addition there is a professional mentor looking after your wider development. As a School Direct trainee you would also have access to your placement school's professional development programme.\n\nOur year's training comprises three main elements;\n-1) A main school placement where you feel part of the school. The aim is to mirror the life of a qualified teacher for the year.\n-2) A six week second school placement in a partner school.\n-3) Training and support from either Newman University or Birmingham City University.\n\nThe qualification at the end of the course awards QTS and PGCE. For the past three years 100% of our trainees, primary and secondary, have gained employment by the end of the course.\n\nFor further information\n-Primary training, St John Bosco Catholic Primary School in West Bromwich lead the Primary training\n[StJohnBosco](http://www.stjohnboscotsa.co.uk/school-direct/)\n-Secondary Training, Holly Lodge High School in Smethwick is the lead school for Secondary training.\n[HollyLodge](http://www.holly-lodge.org/sites/default/files/LearnToTeach/index.html)","trainWithDisability":"We have a wide range of partner schools across a large geographical area. This enables us to match trainees to the right place for them. Our experienced team of mentors and close relationship with tutors at Newman University and Birmingham City University allow us to offer all our trainees the support they need.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:54:37.866Z","updatedAt":"2022-01-06T01:03:19.088Z"}
