{"id":"1f069b7d-ab6c-491c-8320-a99098ba6c2f","name":"Cardinal Hume Catholic School","code":"198","type":"lead_school","isAccreditedBody":false,"urn":"137852","ukprn":"10036181","address":{"addressLine1":"Old Durham Road","town":"Gateshead","county":"Tyne & Wear","postcode":"NE9 6RZ"},"contact":{"website":"https://www.centreforteaching.com/contact-us/","email":"aherdman@stb.bwcet.com","telephone":"01207 520424","fullName":"Miss Martine Murphy"},"location":{"latitude":54.9308872,"longitude":-1.5771033},"trainWithUs":"Our partnership of Catholic schools has extensive experience of working with student teachers and can provide excellent school placement opportunities. All three schools have outstanding practice in learning and teaching with specialist staff in all curriculum areas. Importantly, all of our schools have exceptional pupil behaviour which means our trainee teacher can really concentrate, first and foremost, on their teaching.\nWe have trained facilitators across our partnership who will deliver the professional studies programme, alongside our accredited providers, to all trainees. Our wealth of experience in training teachers means our mentoring and support for new staff is second to none: a comprehensive training and support programme begins on the very first day of term in September.\nHaving also a proven track record of successful school to school support, with key staff designated as National and Specialist Leaders of Education, means our schools will ensure your continuing professional development needs are addressed.\nEvery aspect of the programme is aimed at developing you as a Professional. Schools are looking to employ the best teachers, those that are aware of the current demands of teaching as a profession.\nOur 'Education and Professional Studies' will address assessment and reporting, special education needs, classroom organisation and management, pupil behaviour, the professional responsibility of teachers, current school and curriculum issues.","trainWithDisability":"All schools within the Cardinal Hume Catholic School Teacher Training Partnership are fully accessible. Please contact Anna Herdman at aherdman@stb.bwcet.com with any specific disability access requirements.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"5bce9a0d-f372-4667-b3ec-3d58d42a1345","code":"C23","name":"Carmel Teacher Training Partnership (CTTP)","description":""},{"id":"917facc1-82bb-4a00-a765-a1522edcb916","code":"2BA","name":"Sacred Heart Newcastle SCITT","description":""},{"id":"db2188d3-0047-44ee-92d2-64d1b5e1a939","code":"N21","name":"University of Newcastle Upon Tyne","description":""}],"createdAt":"2021-07-06T17:47:55.892Z","updatedAt":"2021-09-30T21:15:27.357Z"}
