{"id":"1f91f989-047b-4bbc-a73e-d45ffcfc1f28","name":"Norfolk Teacher Training Centre","code":"N43","type":"scitt","isAccreditedBody":true,"ukprn":"10004772","address":{"addressLine1":"Norfolk Teacher Training Centre","addressLine2":"City College Norwich","town":"5 Ipswich Road","county":"Norwich","postcode":"NR2 2LJ"},"contact":{"website":"http://www.norfolkttc.org.uk/","email":"EnquiriesNTTC@ccn.ac.uk","telephone":"01603 773708","fullName":"Paul McCann"},"location":{"latitude":52.6176581,"longitude":1.2853557},"trainWithUs":"Why train with us?\nAt the Norfolk Teacher Training Centre, everything we do is about training excellent teachers. We have over 45 schools in our partnership from which we draw on the very best expertise for your future training. We offer the opportunity to train in a broad range of environments, including rural and city academies, a college of further education, a university technical college, a state boarding school and independent schools. Your school-based learning experiences will be grounded in a central training programme run by experts in adult education and based at our main site, City College Norwich. You will be supported by an experienced team of higher education professionals who are at the heart of teaching in Norfolk. Your subject knowledge development must take centre stage throughout your training. This is why at the NTTC, in addition to your course leaders and school-based mentors, you will also have access to our pool of ‘Go-To’ subject specialists. These are practicing experts from within our partnership who currently teach your subject in an 11-19 setting and therefore perfectly qualified to support you.\nOver the last five years, 100% of our graduates secured employment for their Newly Qualified Teacher year before the end of the programme. We believe that this demonstrates NTTC’s commitment to ensuring that you are well prepared to present yourself at interview.\nWe are dedicated to you and your future in this dynamic and rewarding profession and this is proven by results which are above the national average.","trainWithDisability":"As part of City College Norwich, we are committed to ensuring that all our trainees have equal access to the learning opportunities we provide. As part of a larger college, we also have the facilities to be able to support trainees throughout our programme. We feel it is important that applicants disclose any particular needs they might have both on their application and at interview. This way we can ensure that we have productive conversations with you and tailor your training year to suit your need. All of our partner schools are well equipped to support our trainees.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:53:37.476Z","updatedAt":"2021-08-24T21:10:13.367Z"}
