{"id":"2016568e-1ca5-4260-81f7-b86d41c79d41","name":"The Wider Ponteland Partnership","code":"16S","type":"lead_school","isAccreditedBody":false,"urn":"145780","ukprn":"10082400","address":{"addressLine1":"Ponteland Primary School","addressLine2":"Callerton Lane","town":"Ponteland","county":"Newcastle-upon-Tyne","postcode":"NE20 9EY"},"contact":{"website":"http://www.pontelandprimary.co.uk","email":"alistair.mccourt@ppschool.uk","telephone":"1661822103","fullName":"The Wider Ponteland Partnership"},"location":{"latitude":55.0438679,"longitude":-1.7427317},"trainWithUs":"Thank you for your interest in training to become a teacher through the School Direct programme in The Wider Ponteland Partnership based at Ponteland Primary School.\nIf you are looking for a teacher training course in which you spend most of your time in school while you study, this course may be for you. You work with experienced teachers, first of all, observing and team teaching, then teaching independently. We are pleased to be working in partnership with Northumbria University. Northumbria University is recognised by OFSTED as an outstanding provider of initial teacher education across all age phases.\nThe Wider Ponteland Partnership incorporates schools in the Ponteland, Cramlington and Morpeth partnerships. We are a group of schools comprising of 8 primary schools. The schools vary in size and character and include 4 faith schools. The schools work closely together to:\n* Promote collaborative practice and mutual respect within our partnerships and communities.\n* Facilitate a high quality and positive learning climate for pupils, staff and trainees.\n* Ensure learning is personalised so that all of our children, staff and trainees have the opportunity to achieve their full potential.\n* Provide a broad, balanced and inclusive curriculum that is challenging, realistic and responsive to changing needs and opportunities.\n* Aspire continually to excel throughout all we do. Recognise and celebrate the achievement of all.\nFor further information about any of our schools please visit [Ponteland Primary School](www.pontelandprimary.uk)\nWe are pleased to allocate places for 2022/2023.","trainWithDisability":"Applicants who would benefit from disabled access or modifications should let us know on their application so that they can be considered for placements at the appropriate schools. Please contact the school to discuss this if you wish.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:55:02.310Z","updatedAt":"2021-08-27T16:36:34.639Z"}
