{"id":"2016ba42-fef9-4ccd-8657-9bddaae97e4f","name":"Portsmouth and Solent Training Alliance","code":"1DR","type":"lead_school","isAccreditedBody":false,"urn":"140325","ukprn":"10043918","address":{"addressLine1":"Training and Learning Centre, Portsmouth Academy, Cowper Road","addressLine2":"Southsea","town":"Portsmouth","county":"Hampshire","postcode":"PO1 5LD"},"contact":{"website":"https://ps-ta.net/","email":"lynn.nicholls@ps-ta.net","telephone":"2392893702","fullName":"Lynn Nicholls"},"location":{"latitude":50.8046779,"longitude":-1.0749981},"trainWithUs":"We are an Ofsted 'Outstanding' Provider and have been delivering excellent teacher training for the past 11 years. Our excellence in training leads to our School Direct trainees successfully passing the course and gaining employment. Training in school and learning ‘on the job’ alongside experienced teachers is the best way to gain first-hand experience of teaching. Your training year will be underpinned with regular theory sessions and pedagogy delivered both at our dedicated alliance training centre and, for secondary, University.\nTypically you will be based in school four days a week and attend training on day five. This is a full-time PGCE course; you will spend 80% of your time in local schools and 20% in training centre. Our strong track record results in 100% of our trainees gain employment in schools. If you want to gain hands on experience then our School Direct teacher training route is for you. Our high-quality training and mentoring is at the heart of what we do.\nWe will support you to become a confident, knowledgeable and skilled practitioner by providing excellent learning experiences matched by our support and guidance.\nTraining in one of our alliance schools, gives you the opportunity to work with experienced teachers and mentors. We believe it is important that trainees feel part of the school environment from Day 1 so we host our interviews in school with senior members of staff. This is an opportunity to meet the staff and feel part of their community before you start.\nhttps://ps-ta.net/","trainWithDisability":"Teachers with disabilities make an important contribution to schools on both the classroom and in shaping the wider culture. If you have a disability then that shouldn’t dissuade you from school.\nThe Equality Act 2010 and Special Educational Needs and Disability Act 2001, require teacher training providers to ensure they are not discriminating against applicants with disabilities or special educational needs (SEN).\nIt is helpful to let us know your requirements so we can consider your placement and any reasonable adjustments that may need to be considered. All partners within the alliance are committed to supporting trainees with disabilities.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"accreditedBodies":[],"createdAt":"2021-07-06T17:51:30.523Z","updatedAt":"2021-10-08T17:26:00.243Z"}
