{"id":"20362ef1-f238-42a6-86d2-a017459fdec8","name":"Hartismere School","code":"1GP","type":"lead_school","isAccreditedBody":false,"urn":"136271","ukprn":"10031385","address":{"addressLine1":"Castleton Way","town":"Eye","county":"Suffolk","postcode":"IP23 7BL"},"contact":{"website":"http://www.hartismere.com","email":"lcl@hartismere.com","telephone":"1379870315","fullName":"Director of Teaching - Mrs Louise Cliffo"},"location":{"latitude":52.323447,"longitude":1.1369897},"trainWithUs":"Hartismere is a State Funded Independent School for the whole community, and was Suffolk's first Academy. Although the School continues to enjoy a good relationship with the Local Authority, it also has independence from it. This autonomy is exemplified through the facilities enjoyed by our students, as well as the curriculum that they follow. The school is able to respond to the needs of its own community and charts its own course in the educational world. This course reflects its independence, as well as its traditional, academic and community values. For further information please [see our website](https://www.hartismere.com/)","trainWithDisability":"Together with our accredited providers we operate an equal opportunities policy and welcomes applications from people with disabilities. All PGCE trainee teachers must meet the Secretary of State's requirements for physical and mental fitness to teach. All candidates offered a place are required to complete an Occupational Health questionnaire. If this reveals any additional needs, we will consider reasonable adjustments, which may include particular school placements, and other support and monitoring during the course.\n[Find out more about the information and advice available through UEA's Wellbeing Service](https://www.uea.ac.uk/uea-life/student-support/wellbeing)","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"accreditedBodies":[{"id":"d8370001-6f2b-4624-b30c-27ddc5beebfc","code":"S14","name":"Suffolk and Norfolk Secondary SCITT","description":"The Suffolk and Norfolk Secondary SCITT programme is a highly personalised, well regarded and established teacher training course. It has very high attainment and employment outcomes for trainees. This programme has the unique structure of being in partnership with a significant number of schools across all areas of Suffolk, Norfolk and some in Cambridgeshire. Due to the size of our partnership, this course provides with you the wealth of experiences so you can become a resilient and confident newly qualified teacher who will be able to teach in any type of school at the start of your teaching career."},{"id":"b8bcaeed-f311-4867-a1e3-c0fde20809d6","code":"E14","name":"University of East Anglia","description":"UEA’s School of Education and Lifelong Learning is one of the UK’s premier centres for teaching and research in professional education and training. The School’s research has made a difference in schools across the country, influencing approaches to managing classroom behaviour, understanding students’ motivation, and creating effective communities for learning.\\r\\n\\r\\nAll of our PGCE tutors have experience of school teaching and leadership, and all are specialists in particular areas of the curriculum. UEA’s expertise, together with our partner schools, means you'll be well-supported throughout your PGCE."}],"createdAt":"2021-07-06T17:54:59.054Z","updatedAt":"2021-09-29T21:20:46.220Z"}
