{"id":"215cd582-2a3f-4a89-9e1d-5b4f981c07e4","name":"TeachSlough","code":"17T","type":"lead_school","isAccreditedBody":false,"urn":"136420","ukprn":"10032611","address":{"addressLine1":"TeachSlough","addressLine2":"Lascelles Road","town":"Upton","county":"Berkshire","postcode":"SL3 7PR"},"contact":{"website":"https://www.teachslough.org.uk/","email":"schooldirect@uptoncourtgrammar.org.uk","telephone":"01753 522 892","fullName":"Ravinder Ghei"},"location":{"latitude":51.5046351,"longitude":-0.5780979},"trainWithUs":"Slough is a multi-cultural, vibrant and diverse community. Our students are passionate, exuberant, witty and sharp, offering our teachers some of the most inspiring, captivating and exciting schools in the country. Our partnership of schools is led by Upton Court Grammar School and comprises of a mixture of Grammar schools and Comprehensive schools, Academies and State schools, Primary, Infant, Junior and Secondary schools. We encourage a supportive community for our trainees and offer diverse and contrasting teaching and training experiences through school-to-school collaboration. Our school-based, highly supportive training programme, nurtures our trainees to flourish and excel within the teaching profession. Since 2013, we have successfully trained 104 trainees. To date*, we have achieved a 100% pass rate with 72% of our trainees passing with a grade 1 ('outstanding'). Our staff are our most valuable resource and have a proven track record in training and professional development. Following the training year, Slough's excellent practitioners continue to offer outstanding professional development opportunities, guiding their colleagues through a variety of leadership pathways. Our dedication to professional development makes Slough an attractive place to work with 75% choosing to stay in our partnership in their NQT year.** Working in partnership with the University of Reading, TeachSlough is committed to recruiting innovative and inspiring trainee teachers in both the primary and secondary sector to enthuse our next generation. If you are looking for an exciting new challenge working alongside like-minded passionate, pioneering educational practitioners, TeachSlough: Awake. Create. Educate. *June 2017.\n**in June 2017.","trainWithDisability":"We use individual training plans to offer bespoke support for all of our trainees and to create a provision in which all of our trainees can succeed. Our recruitment is a rigorous and thought-provoking process which includes a number of pre-assessment tasks. We make reasonable adjustments to facilitate all interviewees (for example, extra time).\nAll of our schools are accessible sites.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:56:27.617Z","updatedAt":"2021-07-16T17:05:00.675Z"}
