{"id":"21b7500e-ce80-4b8e-a89d-b3527a39b27c","name":"Hope Sentamu Learning Trust","code":"1DH","type":"lead_school","isAccreditedBody":false,"urn":"136544","ukprn":"10058624","address":{"addressLine1":"Hope Sentamu Learning Trust","addressLine2":"C/O Vale Of York Academy Rawcliffe Drive","town":"Clifton, York","county":"North Yorkshire","postcode":"YO30 6ZS"},"contact":{"website":"https://hslt.academy/train-to-teach/","email":"development@hslt.academy","telephone":"01904 528661","fullName":"Beth Hartwell"},"location":{"latitude":53.9755691,"longitude":-1.1004895},"trainWithUs":"At the heart of the Hope Sentamu Learning Trust School Direct programme is a strong and established partnership of schools, led by the 'Lead School' Manor CE Academy. Together we provide a programme led by outstanding practitioners in teaching and learning and immersion in wider school life within a diverse range of schools in York, Hull, Scarborough and North Yorkshire.\nWe work in partnership with York St John University (https://blog.yorksj.ac.uk/ite/pgce-secondary-education/) to deliver high quality teacher training and education which leads to a PGCE with QTS. At the last Ofsted inspection inspectors rated the partnership as ‘highly respected in our region, with outstanding leaders who have clear vision, relentless drive and well targeted actions. The university, Academy Trust and schools demonstrate a common vision and shared commitment to teacher training. The university provides strong institutional support for initial teacher education’.\nWe have a strong employment record and contribute to the local and national teaching community. The School Direct programme is a popular choice for those wanting to train on the job, have an immersive, practical experience and who hope to secure a role in the network of schools where they train.","trainWithDisability":"York St John University is an inclusive university and has a range of support services for students with disabilities and other needs. We have a dedicated Disability Advice Team and PGCE programmes have a strong track record of supporting all students to enable them to complete their studies successfully.\nThroughout the programme there is strong support for you by both university and school-based staff and you also will benefit from the full range of university services (e.g. writing and academic support, wellbeing services, library and IT, careers etc.)","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:52:30.523Z","updatedAt":"2021-09-01T22:07:09.891Z"}
