{"id":"21cc212c-3fb3-441b-9eeb-ae77ae234ce5","name":"Bedgrove Infant School","code":"1YP","type":"lead_school","isAccreditedBody":false,"urn":"110282","ukprn":"10078291","address":{"addressLine1":"Ingram Avenue","town":"Aylesbury","postcode":"HP21 9DJ"},"contact":{"website":"http://www.bedgroveinfantschool.co.uk","email":"clee@bedgroveinfant.co.uk","telephone":"1296481353","fullName":"Carolyn Lee"},"location":{"latitude":51.8058812,"longitude":-0.780006},"trainWithUs":"Bedgrove Infant School has been an Outstanding School, as judged by Ofsted, since 2008 and this rating was maintained in our most recent inspection in October 2018. We have a renowned reputation for our Early Years provision, making the best use of both the indoor and outdoor environments to stimulate children’s learning. We understand that teaching in the Early Years requires specific training focusing on the benefits of learning through play, the role of the adult and child development. Our aim is to support trainees in becoming the best Early Years teachers they can be whilst enabling them to understand teaching and learning from 3 through to 7 years of age.\nOther benefits of training with Bedgrove Infant School include:\n* Opportunities to observe and work alongside outstanding teachers;\n* Experienced and supportive Teacher Tutors, Mentors and Training Managers;\n* Placements in Early Years classes to fully immerse you in the EYFS environment;\n* Strong focus on practical experience and application of skills;\n* Personalised learning ensuring outstanding progress is made by all;\n* Fortnightly visits to all trainees by a training manager with specialist knowledge of the Early Years\n* Growing partnership offering a diverse range of high-quality placements in both EYFS and KS1 classes;\n* Excellent employment opportunities across and beyond the partnership at the end of the training year;","trainWithDisability":"We strongly encourage skilled and talented applicants from a variety of backgrounds, including those with a disability.\n\nWe therefore endeavour to cater for you individual needs, through the application and selection process, as well as the duration of the training programme by working in collaboration with our schools to make reasonable adjustments, as recommended by occupational therapy.\n\nPlacements are carefully chosen to ensure that the specific needs of an individual can be met within the setting and this includes accessibility for trainees with a physical disability.\n\nRegular visits by a training manager from the lead school enable us to keep in close contact with trainees and the personalise the training and support they receive.\n\nAs a result of these factors, data analysis from 2017-18 demonstrated that there were no differences in the outcomes of trainees with a known disability compared to those with no disability.\n\nIf you have a disability or other need you'd like to discuss before applying to our training programme, please contact us so we can discuss your specific requirements in more detail and answer any questions that you may have.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"255c8ae2-bc9f-4e33-8b70-7492c9bf9615","code":"1WR","name":"Bourton Meadow Initial Teacher Training Centre","description":"Bourton Meadow ITTC is an established, outstanding provider of initial teacher training. It accredits School Direct courses for two lead school partnerships: Bourton Meadow Academy (Primary General 5-11 years) and Bedgrove Infant School (Primary General 3-7 years). All trainees, regardless of the route, benefit from the same high quality training and support, including the fortnightly visits from a training manager.\\r\\n\\r\\nBourton Meadow ITTC has a wealth of experience across the sector and is also registered to provide the AO route to QTS as well as post-graduate teaching apprenticeships."}],"createdAt":"2021-07-06T17:48:44.060Z","updatedAt":"2021-10-04T15:38:13.369Z"}
