{"id":"222a5fbc-f990-4836-bddb-69c8ff0e41dc","name":"St Bernard’s School Direct Training","code":"29P","type":"lead_school","isAccreditedBody":false,"urn":"138329","ukprn":"10037583","address":{"addressLine1":"Saint Bernard’s School Direct Training","addressLine2":"St Bernard’s RC High School, Herringthorpe Valley Road","town":"Rotherham","county":"South Yorkshire","postcode":"S65 3BE"},"contact":{"website":"http://www.sbch.org.uk","email":"cwan@sbch.org.uk","telephone":"01709 828183","fullName":"Debbie Hepplestone"},"location":{"latitude":53.423868,"longitude":-1.323461},"trainWithUs":"St. Bernard’s Catholic High School is a School Direct Lead with an Outstanding Ofsted grading. We are centered in a partnership of primary and secondary schools working in collaboration to provide the very best teaching to students within our local communities and beyond. There are many school based ITT programmes to select from. St Bernard's is different and we are proud of our uniqueness. As a small school, we are passionate about training the next generation of teachers. Our staff are enthused and fully equipped to share their extensive experience, knowledge and skills to develop the very best teachers of the future. St Bernard's is a welcoming and friendly environment where all our trainees say they feel safe to learn, reflect and improve. Specific highlights to training with us (both Primary or Secondary route) include: * 100% of our ITTs complete their training on at least ‘good’.\n* 100% of our ITTs secure jobs for their NQT year. * Immediate immersion into school life - becoming an active member of our school, experiencing a range of classroom settings and building lasting relationships with colleagues and students.\n* A focused training plan, designed by current practitioners. * Experienced mentors who will meet weekly with you to provide supportive reflection on your progress. * A commitment to mentoring you within the highest of Professional Standards required for Outstanding teachers. * Weekly ‘hub’ meetings where you will undertake specific training and spend invaluable time with other ITTs to share experiences, ideas and support.","trainWithDisability":"Those with disabilities are under-represented in the teaching profession. At St Bernard's School Direct Training we feel we have a responsibility to provide equality of access to the training programme as well as ensuring applicants have the health and physical capacity to teach. Every individual will have different circumstances and needs and so it is impossible to generalise about the likely impact a disability could have on a potential teaching career. For this reason it is important that you get in touch with St Bernard's School Direct Training early on into the process to discuss any special arrangements you may need, and to explore the options.\nSt Bernard's partners with The Sheffield SCITT who has a ‘Reasonable Adjustments Policy and Procedure’. This underpins our approach and is available on request by emailing kmcardle@sbch.org.uk","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:56:56.993Z","updatedAt":"2021-10-04T16:32:41.770Z"}
