{"id":"2235dbff-d1e3-48ea-8843-eda1eb61638d","name":"The Bridge London TSA","code":"1W6","type":"lead_school","isAccreditedBody":false,"urn":"143217","ukprn":"10057627","address":{"addressLine1":"the bridge london","addressLine2":"251 hungerford road","town":"london","county":"islington","postcode":"n7 9ld"},"contact":{"website":"https://www.thebridgelondon.co.uk/default-item/school-direct-2/","email":"Teacher.Training@TheBridgeTrust.Academy","telephone":"0207 617 1000","fullName":"Gary Morrissey"},"location":{"latitude":51.5484487,"longitude":-0.1270883},"trainWithUs":"The Bridge London Trust is a unique Multi Academy Trust which consists of three special schools, one primary school, a teaching and development centre and an outreach service. The Bridge School is a large special school which provides for pupils with severe learning difficulties and/or autism. It is based on two sites, a Primary site and a Secondary site. The Bridge School has been judged outstanding by Ofsted in its last three inspections. We have always been committed to supporting staff and pupils in other schools and sharing the knowledge we have. It was a natural progression for the CEO/Executive Headteacher to become a National Leader of Education in 2009 and the school to become a Teaching School in 2011, transferring to our Teaching & Development Centre in 2021.\nThe Bridge London supports schools which may be facing challenging circumstances through facilitating our staff and staff from other schools to provide advice and support, and to share, develop and promote research.\nThis has enabled us to offer a wide variety of training opportunities to our own staff and staff from other schools and over the last 5 years delivering our own, individual initial teacher education PGCE programme for primary mainstream QTS with an individual SEN enhancement based upon the latest research and evidence in practice.\nOur fundamental principles drive us; Pride, Passion, Professionalism, Partnership and Positivity. Our decisions and developments are anchored on these values. When recruiting we look for staff who embrace and uphold these values.","trainWithDisability":"We are fully committed to equality and diversity. We seek to be as inclusive and accessible as possible in terms of the information we provide, the campus, training environment and facilities, and the services and support we offer to both students and staff. \n\nWe are welcoming to people from all backgrounds and seek to reflect this in our learning and teaching activities and overall experience.\n\nFunding may be available via Goldsmiths student centre to pay for additional study related costs incurred by disabled students as a direct result of their condition, impairment or Specific Learning Difficulty (SpLD).","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:51:16.997Z","updatedAt":"2021-10-04T20:15:00.439Z"}
