{"id":"223a47d7-05d6-4363-8b3a-2cf21a392c8f","name":"East Herts Partnership","code":"1VT","type":"lead_school","isAccreditedBody":false,"urn":"137532","ukprn":"10035495","address":{"addressLine1":"Goffs Academy","addressLine2":"Goffs Lane","town":"Cheshunt","county":"Waltham Cross","postcode":"EN7 5QW"},"contact":{"website":"https://www.goffs.herts.sch.uk/405/train-to-teach","email":"lgd@goffs.herts.sch.uk","telephone":"01992 424200","fullName":"Laura Edwards"},"location":{"latitude":51.7062891,"longitude":-0.0575556},"trainWithUs":"Our schools are fantastic places to train, work and learn. They provide a unique school based learning opportunity in partnership with the University of Hertfordshire, which is our higher education partner. Our partnership’s vision is simple but powerful; we prepare our teachers and students to be respectful of others, to be confident in all that they do and to achieve their full potential.\nAlso, all partnership schools endeavour to create an environment in which staff, pupils and trainee teachers alike feel valued and supported. We have all worked with trainee teachers for many years and we fully recognise how much vibrancy, enthusiasm and drive they can offer our respective school communities.\nImportantly, the partnership sees its staff as its most valuable resource and its schools have a proven track record in training and professional development. Our teachers are excellent practitioners with exemplary behaviour management skills and are eager to share their skills, knowledge and practice with the next generation of teachers.\nOur Partnership Schools:\nThe partnership are all located in East Hertfordshire. Namely, Goffs Academy, Goffs-Churchgate Academy, Haileybury Turnford, Robert Barclay Academy (RBA), Goffs Oak Primary, Burleigh Primary, Hunsdon JMI Primary and St Andrew's CE Primary.\nWhere to Find Our Schools:\nThe schools in the partnership are strategically positioned a few miles from Junction 25 of the M25 and are all close to the A1. The nearest mainline railway stations are in Cheshunt and Broxbourne. Goffs Oak Primary is close to Cuffley station.","trainWithDisability":"Please do not hesitate to contact us at lgd@goffs.herts.sch.uk for further information on how we can support applicants with disabilities and other needs.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:47:56.983Z","updatedAt":"2021-09-30T04:24:57.717Z"}
