{"id":"224fdd23-b0ce-4eb5-b7aa-921720092234","name":"The Millais Alliance","code":"1BK","type":"lead_school","isAccreditedBody":false,"urn":"126066","ukprn":"10016537","address":{"addressLine1":"The Millais Alliance","addressLine2":"Depot Road","town":"Horsham","county":"West Sussex","postcode":"RH13 5HR"},"contact":{"website":"http://www.millaisalliance.org.uk","email":"caroline.carroll@millais.org.uk","telephone":"01403 267890","fullName":"Caroline Carroll"},"location":{"latitude":51.0641194,"longitude":-0.3072018},"trainWithUs":"The Millais Alliance (TMA) is an excellent partnership to train and work in. Our vision is straightforward but powerful - 'the highest standards of education and care'. We prepare our young people to be global citizens ready to take on the world. We have a proven record of working with trainee teachers for many years and fully recognise how much vibrancy, enthusiasm and drive they offer to the school community. We encourage our trainees to join in from Day 1. We have excellent in-school mentors who will support trainees in their training year and raise confidence in their classroom practice. Our partnership of schools is led by Millais School, in the first cohort of designated Teaching Schools in 2011, and re-designated in 2015. We are an inspirational West Sussex partnership of 17 primary schools, 12 secondary schools and a Sixth Form College, many with Outstanding Ofsted ratings. The range of schools working together gives the opportunity to experience cross-phase observation in another of our Alliance schools regardless of the chosen phase being trained in. Students across the partnership are happy, friendly and well-behaved and are at the heart of everything we do. Both staff and students are ambitious and confident. Many consistently out-perform their peers nationally and make significantly greater progress. Our staff are our most valuable resource and have a proven track record in training and professional development. They are eager to share their skills, knowledge and practice with the next generation of teachers.","trainWithDisability":"Our alliance schools will explore assistance options with disabled trainee teachers and seek specialist advice from relevant agencies on the equipment and support that can be made available. Any assessment of teachers’ needs within the school would closely involve the individuals, providing personalised support.\nSome of our schools have older buildings where modern adjustments have not been possible, so any accessibility issues would be overcome through flexible timetabling in suitable classrooms near disabled facilities.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:48:08.517Z","updatedAt":"2021-10-08T13:56:12.851Z"}
