{"id":"226e9ff7-92c1-43ad-ab01-ed9a173ac0d7","name":"Odyssey Learning Alliance","code":"1ZB","type":"lead_school","isAccreditedBody":false,"urn":"136353","ukprn":"10032220","address":{"addressLine1":"Pate’s Grammar School","addressLine2":"Princess Elizabeth Way","town":"Cheltenham","county":"Gloucestershire","postcode":"GL51 0HG"},"contact":{"website":"http://www.odysseyla.org","email":"admin@odysseyla.org","telephone":"01242 538276","fullName":"Rachel Thorpe"},"location":{"latitude":51.906695,"longitude":-2.1156684},"trainWithUs":"Why chose to train with Odyssey? * An opportunity to train in an Alliance led by Pate's Grammar School - a school rated Outstanding by Ofsted in every category and awarded the title Sunday Times School of the Year 2020. Our exam results consistently place us in the top 10 state schools nationally.\n* Our professional studies programme offers a unique opportunity to work cross phase to gain an understanding of the full learning journey from 3 - 19. * We have an excellent employment track record. *At secondary level, an opportunity to train equally in both the grammar and comprehensive sectors, with four schools proudly working collaboratively to develop and train staff to the highest standards. An opportunity to work with most able and academic students through 11 – 18. Alongside fantastic opportunities to get involved with wider school life; Pate's, Barnwood Park, Sir Thomas Rich's and Tewkesbury all have vibrant, thriving extra-curricular programmes. You will receive a GITEP PGCE awarded by the University of Bristol. *At primary level, a unique opportunity to train in an alliance of strong Gloucestershire based primary schools – all recognised for their exceptional staff development, who share a rich history and commitment in employing School Direct trainees over the last 6 years. You will receive all the benefits of the University of Gloucestershire Course (including the PGCE accreditation), however spending more time in school learning 'on the job'. Together, we are able to offer an unrivalled opportunity to start a career in teaching.","trainWithDisability":"As an alliance we take great pride in knowing and supporting our trainees personally. Our trainees come from a variety of backgrounds, and we are committed to enabling access to the profession for all. Please contact us if you would like to better understand how we may be able to support any access requirements that you have. Trainees receive excellent support from mentors and training managers in schools, as well as their subject leader. Liaison between schools and Odyssey is very strong and we are used to making reasonable adjustments to help trainees, both short term and over the whole course.\nAll GITEP PGCE trainees are registered as students with the University of Bristol, and this gives access to the full range of student services offered by the University. This includes support with academic assignments for trainees with dyslexia and all the University counselling and student support services. Trainees with disabilities and other needs are strongly encouraged to register with the University Library Support service.","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"e6c26d28-03d4-443c-9b65-5db7e183966c","code":"G48","name":"Gloucestershire Initial Teacher Education Partnership (GITEP)","description":"GITEP SCITT is a highly successful school centred initial teacher training provider, rated outstanding by [Ofsted]. GITEP SCITT works with the University of Bristol to offer the academic PGCE. GITEP and the University both focus solely on secondary teacher training and share a commitment to developing outstanding subject expertise."},{"id":"9aa67012-b776-4027-89f4-5531efb3a9d2","code":"G50","name":"University of Gloucestershire","description":"With sustainability at its core, The University of Gloucestershire cares about the future of its students and the future of the planet. Priding itself on small classes and the personal approach of tutors and support teams, the University focuses on professional, pedagogical and subject development to support and prepare trainees for teaching placements."}],"createdAt":"2021-07-06T17:56:33.740Z","updatedAt":"2021-10-04T16:41:21.732Z"}
