{"id":"22e33bab-77d8-4881-9a3d-809c37c9aaac","name":"Richmond School","code":"18L","type":"lead_school","isAccreditedBody":false,"urn":"145090","ukprn":"10065396","address":{"addressLine1":"Richmond School & Sixth Form Coll","addressLine2":"Darlington Road","county":"Richmond","postcode":"DL10 7BQ"},"contact":{"website":"http://richmondschool.net","email":"chouse@richmondschool.net","telephone":"01748 850111","fullName":"Charlotte Wardle"},"location":{"latitude":54.4080559,"longitude":-1.723381},"trainWithUs":"This is an exciting time in the history of Richmond School and Sixth Form College; a history that goes back nearly 700 years. With recent refurbishment and new buildings, teachers and students now have facilities that rank as some of the best in the country. Richmond School and Sixth Form College is part of the Areté Learning Trust. We are delighted that our Ofsted inspection confirmed that we continue to be a good school, with leadership and management, and behaviour and safety, all deemed as ‘Good’. Our goal now is to push on towards becoming a truly outstanding school. We are confident that we will achieve this through our shared responsibility for the future success of all students.\nWe have a team of dedicated staff who work hard together to ensure our agenda of continual improvement and future success. We are looking for positive and ambitious people to join our team, share our values and drive innovation in this exciting setting. In return, we will provide you with the stretch and support to develop your career as an educational leader.","trainWithDisability":"We welcome interest from people who want to work in a hard-working and collegiate environment with fellow colleagues who are constantly seeking to improve and help one another get better. \n\nWe are an Equal Opportunities employer and welcome applications from appropriately qualified persons regardless of gender, race, religion, disability or age.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"99d7311e-6bc7-4ef3-a36b-72a3ff429155","code":"D87","name":"Durham SCITT","description":""}],"createdAt":"2021-07-06T17:53:28.369Z","updatedAt":"2021-09-08T19:02:41.655Z"}
