{"id":"2301745b-affa-4923-90f6-8f0808fa89e8","name":"St George RC School","code":"1NK","type":"lead_school","isAccreditedBody":false,"urn":"139369","ukprn":"10040659","address":{"addressLine1":"St George’s RC","addressLine2":"Lanark Road","town":"Maida Vale","county":"London","postcode":"W91RB"},"contact":{"website":"https://stgeorgesrc.org/home/about/teacher-training/","email":"f.morgan@stgeorgesrc.org","telephone":"020 7328 0904","fullName":"Tonya Frost"},"location":{"latitude":51.5328428,"longitude":-0.1879878},"trainWithUs":"St George's is the lead school in the Cardinal Hume Academies Trust which comprises of four Catholic secondaries (St George's, Salvatorian College, Bishop Douglass and St Thomas More) and one Catholic primary (St Edward's). Your application will come through St George's but you can train at any of the schools in the trust.\nAll our schools offer a huge amount of support and guidance to their trainees. They are a wonderful place to train because of the intensive support you receive from your mentor and because the focus on good behaviour and support from the senior management mean that you are able to hone teaching skills in a calm and ordered environment.\nThere is also a catered weekly CPD programme for trainees and plenty of opportunities for helping out on trips and after school clubs.","trainWithDisability":"We are sensitive to all potential disabilities and have trained students with varying conditions in the past. Please make sure you highlight your specific needs in interview so we can be sure to support you as best we can.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"1165d5fd-11f4-4dab-99c9-47b309481463","code":"C10","name":"Canterbury Christ Church University","description":""},{"id":"33037eab-f75d-4350-b1e2-967c41e9d4c6","code":"R48","name":"Roehampton University","description":""}],"createdAt":"2021-07-06T17:46:19.591Z","updatedAt":"2021-10-11T23:54:04.606Z"}
