{"id":"24b60b07-5b85-4033-882f-d71d54a7c18c","name":"Windsor Academy Trust","code":"2HE","type":"lead_school","isAccreditedBody":false,"urn":"136618","ukprn":"10058502","address":{"addressLine1":"Trinity Point","addressLine2":"High Street","town":"Halesowen","county":"West Midlands","postcode":"B63 3HY"},"contact":{"website":"https://www.windsoracademytrust.org.uk/","email":"ngotting@kingswinford.windsoracademytrust.org.uk","telephone":"0121 602 7594","fullName":"Alison Halford"},"location":{"latitude":52.4510508,"longitude":-2.050936},"trainWithUs":"Windsor Academy Trust (WAT) is a West Midlands based family of schools. We bring together four secondary schools and five primary academies.\nOur academies are\nWindsor High School and Sixth Form\nThe Kingswinford School\nGreat Wyrley Academy\nCheslyn Hay Academy\nGoldsmith Primary Academy\nRivers Primary Academy\nManor Way Primary Academy\nTenterfields Primary Academy\nColley Lane Primary Academy\nOur aim is to unlock the personal and academic potential in every child. Windsor Academy Trust aims to improve the quality of educational provision through the sharing of ideas and best practice amongst its schools. Our teaching and learning development is firmly rooted in the latest evidence based research. Teachers at WAT are both consumers and producers of pedagogical research. At WAT we combine a shared experience of primary and secondary schools and promote student and staff collaboration. This raises aspirations across our family of schools, united in their ethos and operation to achieve the very best for all students.\nWe work collectively to ensure that all our children achieve their full potential in a climate of high challenge for all, where teachers feel supported, motivated and empowered.\nWe give trainees an excellent first step in becoming a highly effective practitioner. Our training year provides a strong foundation to be developed and built upon in ECT years and beyond.","trainWithDisability":"https://www.birmingham.ac.uk/undergraduate/support/disability/index.aspx","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"c357e0fa-802e-471b-818a-d0cd1434f9cd","code":"B32","name":"University of Birmingham","description":"We enjoy an excellent and well established partnership with University of Birmingham for Initial Teacher Education, Early Career Framework delivery, and other post and undergraduate projects. \\r\\nThe University of Birmingham’s School of Education has a long-standing reputation as a centre of excellence for teaching and research in a wide range of areas of educational practice and policy. It is an international leader in education and has a history of top rated research."}],"createdAt":"2021-07-06T17:56:47.072Z","updatedAt":"2021-09-16T20:02:33.869Z"}
