{"id":"24b91a06-a168-408d-addc-3bc166cac34b","name":"Unity Teaching School Hub","code":"1NT","type":"lead_school","isAccreditedBody":false,"urn":"139732","ukprn":"10042046","address":{"addressLine1":"Unity Schools Partnership","town":"Wells Hall Road","county":"Sudbury","postcode":"CO10 0NH"},"contact":{"website":"http://www.unityteachingschoolhub.net","email":"hmain@unitysp.co.uk","telephone":"01440 333 400","fullName":"Helen Main"},"location":{"latitude":52.0245903,"longitude":0.7529021},"trainWithUs":"Can you remember a truly brilliant teacher from school who made a real difference to your life? As a teacher you can use your knowledge and passion for your subject to help children unlock capabilities and talents that they didn’t even know they had. [Unity Schools Partnership](https://unitysp.co.uk/welcome-unity-schools-partnership) is a partnership of schools located on the Suffolk, Essex, Cambridgeshire borders. We share the same values, face similar issues and are geographically close enough to support and challenge each other.\nWe train the Best Teachers in Suffolk and for Suffolk. If you gain 'Outstanding' when you qualify with QTS (Qualified Teacher Status) we will offer you a NQT contract within the Unity Schools Partnership.","trainWithDisability":"Teachers with disabilities make an important contribution to schools both in the classroom and in shaping the wider culture and ethos of the schools they work in. Schools value diversity and the unique contribution that all their staff and trainees bring. If you have a disability, you shouldn’t be dissuaded from applying. If you are invited to attend an interview, and have any special requirements, please let us know beforehand so that we may make reasonable adjustments for you. We want all interview candidates to have an equitable and enjoyable experience, regardless of any disability. Full details are on the Department for Education website.\nAll trainees are required to complete a medical check when they receive the offer of a training place. This will identify if there are adjustments required. As a training provider, CTSN will make such adjustments in our training. We encourage all trainees to disclose all relevant information with their placement schools as this will enable them to make suitable provision. Schools have experience of making provisions for their own students and are therefore well placed to offer similar adjustments for trainee teachers. If you have an offer, but have not yet disclosed a disability or other need, you can disclose at any time.","accreditedBodies":[],"createdAt":"2021-09-21T23:13:20.343Z","updatedAt":"2021-10-05T22:22:43.897Z"}