{"id":"24bde592-c2e8-495f-aec3-d4ad325921fe","name":"Orleans Park Teaching Alliance","code":"2HZ","type":"lead_school","isAccreditedBody":false,"urn":"138651","ukprn":"10038668","address":{"addressLine1":"Orleans Park School","addressLine2":"Richmond Road","town":"Twickenham","county":"Middlesex","postcode":"TW13BB"},"contact":{"website":"https://www.orleanspark.school/orleans-park-teaching-alliance/1323972.html","email":"opta@orleanspark.school","telephone":"020 8891 0187","fullName":"ITT Partnership Manager"},"location":{"latitude":51.4500633,"longitude":-0.32082},"trainWithUs":"Orleans Park Teaching Alliance is a relatively new alliance, however all of the schools in our alliance have a lot of experience in nurturing talent and getting the best out of you in the classroom. Our schools range from faith based schools, to newer free schools, as well as established and successful academies. And still being relatively small, it means that we can ensure your training is personalised to your needs so that you are able to progress confidently in the classroom at your own pace. Our mentors are well trained, supportive and excellent classroom practitioners in their own right. We believe it is vital that we place you with great teachers to help you 'be the best you can be.'\nOur lead school, Orleans Park, was re-awarded an outstanding grade by Ofsted in 2017 who described it as 'an inspirational teaching and learning environment where pupils can flourish and excel.' Moreover, they praised how seriously we took our staff training and our focus on 'getting it right in the classroom.' It is this which underpins our teacher trainee programme and we have vast experience of successfully training students in a range of different subjects; many who continue to work with us once qualified.","trainWithDisability":"We make it a priority to support all of our recruits with the necessary help to ensure they can thrive both in their training year and once qualified. This may include specific support from St Mary's, for example extra support with assignments and directed tasks. Moreover, our sites are accessible for a range of physical, hearing and visual impairments; indeed we have many pupils with similar needs in our schools too.\nOur mentors are well-experienced in providing emotional support and, when needed, we have provision in place for trainees who may experience difficulties.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:47:38.972Z","updatedAt":"2021-10-08T03:52:33.274Z"}
