{"id":"24dcb79a-404f-4232-b129-386c24cf8dac","name":"The Trinity Partnership","code":"1RM","type":"lead_school","isAccreditedBody":false,"urn":"138525","ukprn":"10038188","address":{"addressLine1":"Trinity School","addressLine2":"Love Lane","town":"Newbury","county":"West Berkshire","postcode":"RG14 2DU"},"contact":{"website":"http://www.trinitynewbury.org/","email":"traintoteach@trinity.newburyacademytrust.org","telephone":"01635 510500","fullName":"Gemma Adams"},"location":{"latitude":51.4128345,"longitude":-1.3193271},"trainWithUs":"The Trinity Partnership is a teacher training provider in West Berkshire. We offer primary and secondary School Direct places for unsalaried trainees. Our teacher training courses are organised in partnership with the University of Reading.\nTrinity is the lead school in the partnership. We work with other schools, including our trust schools Fir Tree School and Speenhamland School. We also have training links with other schools in the area to provide flexibility for second placement opportunities and particular subject specialisms.\nTraining at the Trinity Partnership offers the chance to work in a growing trust, where students are treated as individuals. Staff in the Trinity Partnership are dedicated and ambitious, they have high expectations of the students in their care and the schools all boast excellent facilities. Staff work closely with the School Direct trainees to ensure that all make the progress they need in their training year. The Trinity school ethos of ‘Personal Excellence and Collective Responsibility’ resonates for staff, trainees and students alike.","trainWithDisability":"In accordance with the 2010 Equality Act, the Trust recognises the rights of the individual and will not accept discrimination against staff, parents,\nstudents/pupils, contractors and visitors, be it on any basis, whether direct or indirect discrimination, harassment or victimisation.\nIt is the Trust’s desire to:\n ensure that all those within its schools are committed to the\nprinciples of equality as outlined in the Equality Act 2010;\n promote equality of opportunity between disabled persons and\nother persons;\n ensure that everyone who belongs to, or comes into contact with,\nour Trust’s community is valued and respected;\n eliminate unlawful discrimination, harassment or victimisation;\n promote equality of opportunity;\n promote positive attitudes towards disabled persons;\n encourage participation by disabled persons in all aspects of school\nlife;\n take steps to take account of disabled persons’ disabilities, even\nwhere that involves treating disabled persons more favourably than\nother persons.\n show due compliance with statutory duties.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"6439adcc-af64-4d3d-a1da-de045755db06","code":"R12","name":"University of Reading","description":"The University of Reading’s Institute of Education is an established provider of high-quality training and research. It is ranked 10th in the UK for Education (The Guardian University League Table 2022).\\r\\n\\r\\nCommitted to developing caring, reflective, professional teachers, it has well-established partnerships with over 400 schools in Berkshire and the surrounding area.\\r\\n\\r\\nOfsted report that the “effective relationships with partner schools support the development of high quality teaching and trainees that are well-prepared to work in the region’s schools.” (ITE inspection report, September 2016)."}],"createdAt":"2021-07-06T17:47:36.595Z","updatedAt":"2021-10-04T21:02:32.014Z"}
