{"id":"252d7e03-741e-4453-b6a8-3d361e6c9d1b","name":"e-Qualitas","code":"E69","type":"scitt","isAccreditedBody":true,"ukprn":"10046623","address":{"addressLine1":"Hend House","addressLine2":"4th Floor, 233 Shaftesbury Ave","town":"London","county":"London","postcode":"WC2H 8EE"},"contact":{"website":"https://www.e-qualitas.co.uk/","email":"initialteachertraining@e-qualitas.co.uk","telephone":"0208 051 8774","fullName":"Programme Director"},"location":{"latitude":51.5163012,"longitude":-0.1266746},"trainWithUs":"We are a large SCITT, working with schools of all kinds (primary, secondary, special, independent) in the London area and across southern England. We have rolling recruitment, meaning that trainees can start in September or later in the academic year. Our course suits those who are independent, self-motivated learners. An individual training plan guides each trainee; we have an extensive on-line library, and training days in central London complement the in-school training. Trainees are assessed every five weeks, which ensures that they know what they have done well, and what to focus on next. Each trainee has a visiting tutor who is a secondary subject, or primary, specialist. Tutors visit their trainees for a full day each half term. These visits include two lesson observations of the trainee, feedback on strengths and development points, and a check on progress overall.\nOur aim is that all our trainees become excellent teachers. Everything we do is focused on this. In each of the last three years, two-thirds of our trainees have been graded 'excellent' in the final assessment for QTS. Over 90% have been appointed to a teaching post in the school in which they trained or did a placement (a few take teaching posts in other schools).","trainWithDisability":"Our course is designed to be flexible and responsive to individual needs. As a group of full-time trainees starts each term, trainees who aren't able to train on a full-time basis, or who become ill and need time off during the course, don't miss out on any training as they join in with the next group of trainees. Adapted tasks are available for students whose dyslexia makes it hard to write full essays for their assignments. Training day venues have wheelchair access, and cater for all dietary requirements. We ask trainees to let us know of any disability or other need, so that we and the partner schools can make appropriate arrangements.\nTrainees who wish to gain a PGCE as well as QTS can add the academic award through our higher education partner. As we do not have a compulsory integral PGCE we have great flexibility in meeting our trainees' individual training needs eg we can adapt coursework tasks for those who need individual arrangements, we don't have fixed coursework deadlines during the training, and our trainees can start the course when it suits them and their school during the academic year.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:51:07.850Z","updatedAt":"2021-09-28T16:56:15.269Z"}
