{"id":"253e7c13-d3b2-4c3c-916f-b34467421e90","name":"Chauncy Training Partnership","code":"1RK","type":"lead_school","isAccreditedBody":false,"urn":"137090","ukprn":"10034843","address":{"addressLine1":"Chauncy School","addressLine2":"Park Road","town":"Ware","county":"Herts.","postcode":"SG12 0DP"},"contact":{"website":"www.chauncyschool.com","email":"craig.burnett@chauncy.org.uk","telephone":"1920411200","fullName":"Craig Burnett"},"location":{"latitude":51.8147578,"longitude":-0.0449656},"trainWithUs":"The Chauncy Training Partnership includes a collection of schools who, individually, provide the school based training. Each school has its own character and ethos but all use The University of Hertfordshire as a university partner.\nEach advertised training course specifies which school acts as the host for the school based training and there is no suggestion that there is any hierarchy of schools. Chauncy, as Lead School, administrates the application process but it is the school to which the training place is linked that carries out short-listing, interviewing and in the case of successful applicants, the bulk of the school based training. The Chauncy School Training Partnership advertise training positions on FIND and APPLY from October but applicants should check periodically from this date as further opportunities may be posted during the academic year. As Lead School, Chauncy School participates in the School Experience Programme, details of which may be found on The Department for Education's \"Get into teaching\" section.","trainWithDisability":"The University of Hertfordshire report their support for trainees with disability on their website. Individual schools within the partnership have different arrangements within their own settings to support trainees with disability and other needs. For further information, please contact the Lead School with any queries you have about disability arrangements and you will be directed to the appropriate source of information.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:50:59.891Z","updatedAt":"2021-10-01T18:45:17.172Z"}
