{"id":"254dc4c3-0de2-478f-95d0-8d1e2d12ad3d","name":"ORTU Trust (Gable Hall)","code":"1KM","type":"lead_school","isAccreditedBody":false,"urn":"136854","ukprn":"10034116","address":{"addressLine1":"Southend Road","addressLine2":"Corringham","county":"Stanford-le-Hope","postcode":"SS17 8JT"},"contact":{"website":"http://www.ortu.org","email":"lindsay.bayfield@gablehall.com","telephone":"1375400800","fullName":"Ceri Evans"},"location":{"latitude":51.5334302,"longitude":0.4493067},"trainWithUs":"ORTU trust encompasses two comprehensive and two primary schools but we work with a range of different institutions and schools locally. We are a small trust with an outstanding record of both training and recruiting ITT's. We are very proud of our 100 percent Good or Better record of ITT passes over the past 4 years but we were particularly pleased with 2017-2018. From the 9 trainees that completed the course with us last year 7 achieved outstanding and 8 were recruited to the trust. Being a trust school has many advantages one of which is our ability to offer a large variety of ITT subjects which are often hard to come by such as EBAC PE , Dance , Media ,Psychology as well as MFL in French, German or Spanish.\nWe believe our record could not be achieved without the support of outstanding teacher/mentors and this is where we feel we excel. The majority of our mentors are lead practitioners (outstanding teachers in their right) and they are always willing to go the extra mile to make sure you succeed. If you have any questions at all prior to your application please do not hesitate to contact the school/trust directly and we will do our best to put you at ease.","trainWithDisability":"Having a disability of any kind should not prevent you from training to teach. It is our job to help train and support you throughout the process what ever the circumstance. If you are unsure whether we are able to accommodate your personal needs,whatever they may be, please do not hesitate to contact us directly.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"00782614-9301-40e4-8832-9a74cc1bbb07","code":"E75","name":"Essex Teacher Training","description":"Essex Teacher Training is a large provider, offering a variety of different school-based routes to QTS in schools across Essex and its adjoining counties. \\r\\n\\r\\nHeadteachers value the contribution trainee teachers can make to their schools. As a result, trainees enjoy their training and the vast majority gain employment in one of our partner schools, once qualified. \\r\\nAll of our tutors are experts in their field and many are still teaching, so you benefit from their knowledge and experience. We pride ourselves on the support we offer our trainees and put trainee wellbeing at the heart of what we do."}],"createdAt":"2021-07-06T17:52:01.373Z","updatedAt":"2021-10-03T20:00:39.362Z"}
