{"id":"255c8ae2-bc9f-4e33-8b70-7492c9bf9615","name":"Bourton Meadow Initial Teacher Training Centre","code":"1WR","type":"scitt","isAccreditedBody":true,"ukprn":"10055135","address":{"addressLine1":"Bourton Meadow Academy","addressLine2":"Burleigh Piece","town":"Buckingham","county":"Buckinghamshire","postcode":"MK18 7HX"},"contact":{"website":"www.bourtonmeadowittc.co.uk","email":"schooldirect@bourtonmeadow.co.uk","telephone":"01280 823374","fullName":"Helen Byrom"},"location":{"latitude":51.9964062,"longitude":-0.9714098},"trainWithUs":"Bourton Meadow Initial Teacher Training Centre (BMITTC) has a long history of training exceptional teachers. The teacher training centre is attached to Bourton Meadow Academy and operates within the Campfire Education Trust. Based in Buckingham, the partnership is ideally placed between Milton Keynes, Aylesbury, Oxford and Northampton. It is an established provider of initial teacher training - recognised by Ofsted (2014) as an outstanding provider and has been since its formation in 2000. A very unique and important aspect of our training programme is the regular meetings with an experienced training manager from Bourton Meadow, which take place every 2-3 weeks. Teaching is an incredibly rewarding career but it is not an easy one. These planned and regular face-to-face meetings (in addition to the time you'll spend with school-based colleagues) provide you with the highest level of support. By being with you every step of the way, we can ensure your wellbeing and progress on the course and really personalise the training you receive, to ensure you reach your full potential – both now and in the future. Other benefits of training with Bourton Meadow include:\n- Opportunity to work alongside skilled practitioners on a daily basis\n- Large focus on practical experience and application of skills across the full national curriculum\n- Regular feedback on your teaching and the impact it has had on pupil progress\n- A coherent and well-sequenced training programme, which delivers the statutory core curriculum.\n- A flexible training programme, responsive to trainees’ evolving needs","trainWithDisability":"We strongly encourage skilled and talented applicants from a variety of backgrounds, including those with a disability.\nWe therefore endeavour to cater for trainees' individual needs, through the application and selection process, as well as the duration of the training programme by working in collaboration with our schools to make reasonable adjustments.\nPlacements are carefully chosen to ensure that the specific needs of an individual can be met within the setting and this includes accessibility for trainees with a physical disability. The regular visits by a training manager from Bourton Meadow enable us to keep in close contact with trainees and to personalise the training and support they receive. Wellbeing is given high priority within these meetings and training managers are experienced at supporting trainees in different ways. In the past, trainees with dyslexia have benefitted from additional visits and meetings to support them with the completion and organisation of course-related paperwork, as well as time management. Bourton Meadow ITTC can also help to signpost trainees to various organisations which can provide more specialist advice.\nAs a result of these measures, data analysis from recent years demonstrates that there are no differences in the outcomes of trainees with a known disability compared to those with no disability.\nPlease contact us if you have a disability or other need and would like to discuss any specific requirements before applying to our training programme, as we would welcome the opportunity to do so.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:56:59.703Z","updatedAt":"2021-09-28T04:05:01.751Z"}
