{"id":"25fa6c5a-457b-4197-8fc8-dcd15c96fd45","name":"Royal Academy of Dance","code":"R55","type":"scitt","isAccreditedBody":true,"ukprn":"10005544","address":{"addressLine1":"Royal Academy of Dance: Faculty of Education","addressLine2":"188 York Road","town":"Wandsworth","county":"London","postcode":"SW11 3JZ"},"contact":{"website":"https://www.royalacademyofdance.org/study/higher-education/higher-education-1/postgraduate-certificate-in-education-dance-teaching-1","email":"faculty@rad.org.uk","telephone":"020 7326 8000","fullName":"Shanice Birchall, Programme Officer PGCE"},"location":{"latitude":51.4662752,"longitude":-0.1796035},"trainWithUs":"The RAD is a specialist dance education provider with over 90 years experience in inspiring, cultivating and supporting dance teachers around the world. The Royal Academy of Dance has been judged as an ‘outstanding’ provider of initial teacher education following their most recent Ofsted inspection (2018).\nThis programme combines postgraduate studies with initial teacher training to give you a comprehensive preparation for dance teaching. You will be introduced to the standards and requirements for government-recognised Qualified Teacher Status (QTS), and work to fulfil these standards through the duration of your studies. You will be supported by experienced school-based and RAD tutors who will provide valuable and regular feedback on your progress.\nThe programme comprises 13 weeks of full-time study on-site (in three blocks) at the RAD in London, and 24 weeks (120 days) in two distinct professional placements within schools or colleges covering the 11–19 age-range.\nModules taught at the RAD are delivered through practical workshops, lectures, seminars as well as group and individual tutorials. During your placements you will work alongside school-based tutors who are dance specialists. You will develop your knowledge and skills through a combination of observation, teaching, and discussion with your tutors who will provide support on planning, teaching and self-reflection. Alongside the two contrasting teaching placements you will also have the opportunity to teach across a variety of educational settings including a specialist performing arts school, primary schools, specialist Special Educational Needs and Disability provision schools and a Pupil Referral Unit.","trainWithDisability":"We welcome applications from students with disabilities (including long term medical conditions, physical impairments, learning disabilities and mental health conditions) who wish to pursue a career in the dance teaching profession. For on-site programmes, we encourage you to visit us before applying, to view classes and facilities and discuss any support\nor adjustments that may be required. The earlier you can let us know about your disability the better, so that we can work with you to implement a Personal Learning Support Plan.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"createdAt":"2021-07-06T17:54:28.240Z","updatedAt":"2021-07-23T15:11:13.895Z"}
