{"id":"260a3be1-6941-4299-89b0-1061d339c7a9","name":"Northumbria Art and Design Partnership","code":"2X6","type":"lead_school","isAccreditedBody":false,"urn":"108641","ukprn":"10001429","address":{"addressLine1":"Churchill Community College","addressLine2":"Churchill Street","town":"Wallsend","county":"North Tyneside","postcode":"NE25 0LB"},"contact":{"website":"www.northumbriaacdp.co.uk","email":"nacdp@churchillcc.org","telephone":"0191 2347200 ext 298","fullName":"Emma Tate"},"location":{"latitude":55.0052569,"longitude":-1.5066773},"trainWithUs":"Churchill Community College is a vibrant and inclusive secondary school in the heart of the North East. The Programme Lead has a wide and extensive range of experience as both a Curriculum Leader of Art in Schools and Senior Leader, with a wealth of experience in Arts education in a current setting.\nYour training will include access to specialist art equipment including kilns and printmaking equipment at Churchill, and also across the partner organisations that you train in. You’ll also spend a significant amount of time at Northumbria University, BALTIC and in our partnership museums, galleries and schools where you’ll be guided and mentored by experienced teachers and leaders.\nGraduates from the programme undergo extensive and focused training in acquiring their first appointment and previous graduates from Northumbria who have specialised in Art and Design education have enjoyed a consistently high employment rate with many students securing a position even before graduation. The opportunity to gain teaching experience in a second subject also ensures our students have that competitive edge over other providers. Most recent graduates are based in the UK but some are tapping into the growing demand for outstanding graduates with a postgraduate qualification in Art and Design education in schools across Europe and the Middle East.","trainWithDisability":"We would be delighted to consider applicants with disabilities and other needs and we will make any reasonable adjustments to accommodate and support all candidates. Please contact Lynn Welsh lynn.welsh@churchillcc.org if you wish to discuss this further.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:51:39.956Z","updatedAt":"2021-09-14T17:08:40.238Z"}
