{"id":"262b484d-d95d-44e5-81e4-9d23d2828c54","name":"St Thomas More’s Catholic Primary School, Colchester","code":"1K8","type":"lead_school","isAccreditedBody":false,"urn":"138164","ukprn":"10037434","address":{"addressLine1":"St Thomas More’s Catholic Primary School","addressLine2":"Priory Street","town":"Colchester","county":"Essex","postcode":"CO1 2QB"},"contact":{"website":"www.stthomasmores.co.uk","email":"office@st-thomasmores.essex.sch.uk","telephone":"1206865722","fullName":"Bridget Harris"},"location":{"latitude":51.8884496,"longitude":0.9086671},"trainWithUs":"We are a Lead School for Teacher Training with 18 years experience of school based training. We work closely with our colleagues at Essex Teacher Training. We train around 15 teachers each year here and in our partner schools which are mainly in NE and Mid Essex, Although as a growing multi-academy trust we will have schools in Tendring, Colchester, Witham, Chelmsford and Braintree. Schools are carefully selected so that trainees get the support they need during the training year. Each trainee will be placed with an experienced teacher, who is quite often their mentor too, and will also have the services of a Lead Mentor from St. Thomas More's as well as a Tutor from Essex Teacher Training. The schools we work with have lots of experience with ITT and many of the staff will have taken similar school based routes into teaching. St. Thomas More's has been Teaching School until the recent introduction of the TS Hubs and currently leads and manages Venn Essex Maths Hub, and as such will offer additional training opportunities and networking. Most of our schools will employ their trainee if a post becomes available. For example, in our school, 7 of our teachers were trained in house. There will be a similar picture across our partner schools showing how much we believe in the programme!","trainWithDisability":"We are committed to offering all prospective trainees the opportunity to gain QTS. We are able to support candidates with specific needs and this can be discussed with individuals during the application process.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"00782614-9301-40e4-8832-9a74cc1bbb07","code":"E75","name":"Essex Teacher Training","description":"Essex Teacher Training is a large provider, offering a variety of different school-based routes to QTS in schools across Essex and its adjoining counties. \\r\\n\\r\\nHeadteachers value the contribution trainee teachers can make to their schools. As a result, trainees enjoy their training and the vast majority gain employment in one of our partner schools, once qualified. \\r\\nAll of our tutors are experts in their field and many are still teaching, so you benefit from their knowledge and experience. We pride ourselves on the support we offer our trainees and put trainee wellbeing at the heart of what we do."}],"createdAt":"2021-07-06T17:46:39.283Z","updatedAt":"2021-09-25T18:17:56.172Z"}
