{"id":"2644c20c-18f3-4199-924a-4ebbfc98bb6a","name":"Teach North West, SS Simon and Jude Alliance","code":"14T","type":"lead_school","isAccreditedBody":false,"urn":"138957","ukprn":"10039401","address":{"addressLine1":"SS Simon and Jude CE Primary School","addressLine2":"Newport Road","town":"Bolton","county":"Greater Manchester","postcode":"BL3 2DT"},"contact":{"website":"https://www.teachnorthwest.co.uk","email":"info@teachnorthwest.co.uk","telephone":"7739364322","fullName":"Hannah Hodgson"},"location":{"latitude":53.5617389,"longitude":-2.4231402},"trainWithUs":"Become a qualified primary school teacher with QTS, PGCE and 60 Masters credits through School Direct with Teach North West; learning first-hand in the classroom, from day one. Train to teach in your local school, meet new friends, build relationships with potential employers and your professional network, whilst making a difference to local children.\nSchool-based from September, you will gain valuable practical experience from the start in your location hub, choosing from: Teach Bolton, Teach Merseyside or Teach East Manchester.\nThe Outstanding SS Simon & Jude CE Primary School, Bolton, is the lead school in the successful Teach North West Alliance and has been involved in School Direct teacher training with the University of Cumbria from its very first year. We are proud to celebrate a 98% employment record by the end of the academic year, for students completing our programme; for us, this is what School Direct is all about.\nOur highly supportive and personalised programme ensures that you:\nFeel NQT ready\nBecome a confident class teacher, with experience in both KS1 and KS2\nIdentify future leadership and career goals\nBuild your professional network\nTeaching is a career, not a course. We look beyond course completion and pride ourselves on offering a tailored and nurturing experience for all trainees. Join us for your teaching journey to help transform children's lives.","trainWithDisability":"We are an inclusive course and work with all potential trainees to give you the access you need at interview and throughout the programme, in order to reach your potential. All trainees undergo an occupational health assessment upon accepting their place, which will help us to guide the support offered throughout your time with us and create a wellbeing action plan at your induction to refer back to for additional support throughout the programme.\nThrough our accrediting body, the University of Cumbria, all our trainees have the right to access their Student and Staff Support Services. The Service is responsible for libraries, information advice and guidance, careers guidance and employability, learning enhancement, academic skills development, student psychological well-being, disability services and student development. The Service can also advise students regarding finance worries and hardship funds and can provide advice on student facing policies such as complaints procedures and the Student Progress Review process.\nTrainees can access university support and facilities easily and quickly via https://my.cumbria.ac.uk/Student-Life/Health-and-Wellbeing/","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"9be9f611-2d36-431a-9109-7fcbbfc88fc8","code":"C99","name":"University of Cumbria","description":"The University of Cumbria is one of the country’s leading and biggest providers of teacher education and School Direct partnerships, currently working with 27 school partnerships nationwide.\\r\\n\\r\\nThe success of Cumbria’s PGCE course is underpinned by both an academic teaching philosophy and the practical skills of real school-based learning. This learning process allows you to develop your teaching skills and reflect on the impact you make on pupils, the school and the community.\\r\\n\\r\\nWith the practitioner and academic expertise of the university and school leaders at your disposal, you can become an outstanding, critically reflective teacher."}],"createdAt":"2021-07-06T17:53:07.396Z","updatedAt":"2021-07-29T18:56:44.014Z"}
