{"id":"26797ebf-f835-47c8-9369-7d6d67fb2343","name":"Coventry University","code":"C85","type":"hei","isAccreditedBody":true,"ukprn":"10001726","address":{"addressLine1":"The National School of Education and Teaching (NSET)","addressLine2":"Whittlebury Park, Whittlebury","town":"Nr Towcester","county":"Northamptonshire","postcode":"NN12 8WP"},"contact":{"website":"www.coventry.ac.uk/education","email":"nset@coventry.ac.uk","telephone":"02477 650645","fullName":"Nikki Mugford"},"location":{"latitude":52.4071747,"longitude":-1.5037461},"trainWithUs":"We are one of the largest providers of teacher training in the country with a distinct programme that is available nationwide. The following principles govern our Initial Teacher Training courses:\nAt the heart of our Initial Teacher Training courses is teaching pedagogy i.e. learning ‘how’ to teach. Teaching is a practical activity and we believe that training is best done in schools, under the supervision of expert teachers, and underpinned by relevant theory.\nSince children are central to our Initial Teacher Training courses, their needs, individualities, development, and diversity are inherent in our training.\nTeaching is no different to any worthwhile and highly rewarding profession, in that it presents challenges and requires hard work to succeed. We are committed to supporting the wellbeing of all our trainees, and at the forefront of this is our commitment to their expertise and resilience.\nOur teachers will be able to use technology to enhance pupils’ learning, as well as prepare children to live happily and work successfully in a world dominated by its use.","trainWithDisability":"Coventry University is committed to promoting equality of opportunity to ensure that it meets the needs of all students.\n\nIf you have a disability we encourage you to disclose this along with any other relevant information that could support your studies.\n\nDisability Advisors are part of the Health and Wellbeing team and are available to provide advice and support to students from application through to graduation. This team of dedicated professionals have the experience and skills to ensure that individuals receive appropriate support throughout their time at University. They offer support to students with a variety of disabilities including (but not limited to) Specific Learning Difficulty (Dyslexia), Physical and Sensory Disabilities.\n\nFurther information can be found here: https://www.coventry.ac.uk/study-at-coventry/student-support/health-and-wellbeing/disability/","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:48:33.249Z","updatedAt":"2021-10-04T14:59:12.896Z"}
