{"id":"26a7def5-2416-4898-a6cd-0e9cbfed7c4c","name":"Forty Hill CofE Primary School","code":"2L8","type":"lead_school","isAccreditedBody":false,"urn":"102028","ukprn":"10073980","address":{"addressLine1":"Forty Hill","town":"Enfield","county":"Middlesex","postcode":"EN2 9EY"},"contact":{"website":"https://www.fortyhill.com/","email":"admin@teachinglondon.org","telephone":"2079321126","fullName":"Admissions"},"location":{"latitude":51.6709673,"longitude":-0.061056},"trainWithUs":"We are a voluntary-aided one form entry school based in a semi-rural, conservation area in Enfield, with opportunities for outdoor learning experiences. A dedicated and caring team work for the children of our school to ensure the best possible outcomes for every individual. Our aim is to provide an inclusive and exciting education based on Christian values, high expectations and academic excellence. Together, as a family of children, staff, parents and governors, we aim to fulfil our vision of aspiring to be a safe and welcoming Christian community, giving every child opportunities to be fulfilled, healthy and successful. We have the highest aspirations for trainee teachers in our school and offer individualised support for training. You are always welcome to come and see us.","trainWithDisability":"Being an inclusive school also applies to our trainees and we welcome trainees with disabilities to apply for the course. Adjustments as required can be made to ensure maximum opportunity is given to our trainees to teach whilst maintaining high standards and access to good quality teaching and learning for our pupils.\nTeaching London: LDBS SCITT has a degree of step-free access, but as the building was a Victorian school, we are unable to fully accommodate wheelchair access. We are always willing to discuss, and where possible, adapt to meet individual needs.\nThe well-being of our trainees is paramount, which is why you will be automatically enrolled into the Employee Assistance Programme with the Education Support Partnership. This provides 24/7 individual support and counselling, in addition to our in-house advice and support.\nWe also have experience in supporting trainees with a diagnosis of dyslexia and are able to offer specialist support on the course.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"720894da-360a-4f7a-9835-7ce7beb3c6de","code":"L59","name":"Teaching London: LDBS SCITT","description":"An Outstanding provider (Ofsted: 2017), Teaching London puts pupils at the heart of your training. The depth and breadth of our programme enables you to gain the confidence and competence to develop into a highly skilled, responsive teacher. Exciting, interactive and rigorous centre-based sessions will inform your classroom practice, led by inspiring and experienced tutors. Your growth as a reflective practitioner is underpinned by the PGCE element, routed in school-based and current research. \\r\\n\\r\\nTraining teachers for 20+ years, we are highly effective in our role with 76% of trainees graded as Outstanding at the end of their training in 2017-18."}],"createdAt":"2021-07-06T17:57:05.042Z","updatedAt":"2021-07-28T00:12:49.965Z"}
