{"id":"27771bee-a309-42dd-b85f-598b3185abdb","name":"Mascalls Training Partnership","code":"1GR","type":"lead_school","isAccreditedBody":false,"urn":"136847","ukprn":"10034109","address":{"addressLine1":"Mascalls Academy","addressLine2":"Maidstone Road","town":"Paddock Wood","county":"Tonbridge","postcode":"TN12 6LT"},"contact":{"website":"http://www.mascallsacademy.org.uk","email":"mike.illsley@mascallsacademy.org.uk","telephone":"01892 835366","fullName":"Jenny Gray"},"location":{"latitude":51.1692615,"longitude":0.38751},"trainWithUs":"Mascalls Training partnership is a great place to work and train. It provides a fantastic school based learning opportunity in partnership with Kent and Medway Training (KMT). Our vision, Academic excellence -Character - Culture prepares our students to be independent, resilient and responsible citizens. We have the same high expectations of our trainees – Excellence - aspire to be the best; Character - you can be an outstanding teacher (you will be supported by our Professional Mentor team who will help you build your confidence as a teacher); Culture - successfully complete the training programme as an outstanding teacher in a supportive environment.\nYou would be part of an organisation where we pride ourselves on high academic achievement, where personal qualities are valued highly and where the atmosphere is friendly and purposeful. We enjoy a great reputation in the area and one that will develop your career; we have a fantastic track record and there are numerous opportunities for professional development.\nMascalls Training Partnership comprises Mascalls School, Hugh Christie technology college, St Gregory's catholic school, Skinners Kent academy, High Weald academy, Hayesbrook school and a variety of primary schools. Our staff are very experienced in working with trainees and you will have the opportunity to work with a range of teachers with a variety of specialisms. Trainees will each have a bespoke training programme and access to a large team of experienced Professional Mentors. We are totally committed to providing excellent training opportunities for our next generation of teachers.","trainWithDisability":"If you have any special needs or disabilities please contact us for further discussion. We have experience of successfully supporting trainees with specific needs and disabilities.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:52:21.831Z","updatedAt":"2021-07-19T14:52:08.697Z"}
