{"id":"277e47ad-3043-413c-b8bf-6cc6e4d242e5","name":"Northgate High School","code":"3C4","type":"lead_school","isAccreditedBody":false,"urn":"124840","ukprn":"10004756","address":{"addressLine1":"Sidegate Lane","town":"Ipswich","county":"Suffolk","postcode":"IP4 3DL"},"contact":{"website":"http://www.northgate.suffolk.sch.uk","email":"mch@northgate.suffolk.sch.uk","telephone":"01473 210123","fullName":"Mary Hallett"},"location":{"latitude":52.0718742,"longitude":1.1807656},"trainWithUs":"At Northgate High School we have been supporting PGCE students extremely successfully for many years. Our CPD provision was highly praised in our recent Ofsted report and we have enthusiastic and highly experienced staff who value the process of mentoring students through their journey towards becoming excellent teachers. We currently have several staff who run workshops for a range of ITT providers and an Action Research Group that focuses specifically on mentoring Early Career Teachers.\nNorthgate High School embraces the three core values of Respect, Determination and Teamwork. These values are fundamental to the calm and positive learning environment that we strive to achieve at all levels across the school. Northgate has high expectations – not only around securing academic success and appropriate onward pathways for our students, but in maintaining good discipline and behaviour.\nThe Northgate site is impressive, with purpose-built centres maintained and equipped to the highest standards to meet the expectations and demands of today's students, their parents, and the wide-ranging timetable we offer. We also cater for the needs of the community in that we have joint-use and shared Arts and Sports Centre facilities.\nWe are proud to work in partnership with schools across the area and aim to train and support our next generation of teachers. Schools within the partnership are Northgate High School, Copleston High School, East Bergholt High School, St Albans High School and Westbourne Academy.","trainWithDisability":"We are committed to supporting trainees with disabilities. Please contact us to discuss any access requirements.\nUEA operates an equal opportunities policy and welcomes applications from people with disabilities. All PGCE trainee teachers must meet the Secretary of State's requirements for physical and mental fitness to teach. All candidates offered a place are required to complete a health declaration form. If this reveals a need, UEA will consider reasonable adjustments, which may include particular school placements, and other support and monitoring during the course.\n[Find out more about the information and advice available through UEA's Wellbeing Service](https://www.uea.ac.uk/uea-life/student-support/wellbeing)","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"accreditedBodies":[{"id":"b8bcaeed-f311-4867-a1e3-c0fde20809d6","code":"E14","name":"University of East Anglia","description":"UEA’s School of Education and Lifelong Learning is one of the UK’s premier centres for teaching and research in professional education and training. The School’s research has made a difference in schools across the country, influencing approaches to managing classroom behaviour, understanding students’ motivation, and creating effective communities for learning.\\r\\n\\r\\nAll of our PGCE tutors have experience of school teaching and leadership, and all are specialists in particular areas of the curriculum. UEA’s expertise, together with our partner schools, means you'll be well-supported throughout your PGCE."}],"createdAt":"2021-07-06T17:56:18.223Z","updatedAt":"2021-10-15T17:38:23.364Z"}
