{"id":"27a030d5-a4d6-446d-932d-1d3c26f22f47","name":"Dacorum Schools Alliance","code":"1HS","type":"lead_school","isAccreditedBody":false,"urn":"138352","ukprn":"10007147","address":{"addressLine1":"Mortimer Hill","town":"Tring","county":"Herts","postcode":"HP235JD"},"contact":{"website":"www.tring.herts.sch.uk/teacher-training","email":"dredwood@tringschool.org","telephone":"1442822303","fullName":"David Redwood"},"location":{"latitude":51.798029,"longitude":-0.654629},"trainWithUs":"A growing Alliance based around Hemel Hempstead, Tring and Berkhamsted. Our aim as an Alliance is to build upon the excellent collaborative working practice which already exists amongst our schools. Each school houses its own outstanding practice and we work together to share ideas, strategy and provision wider to benefit so many more students. \nOur School Direct Teacher Training positions provide a unique opportunity to work within some amazing departments within Dacorum schools. As an Alliance we are operating a “Centre of Excellence” model where, in order to ensure that our trainees receive the best mentoring and support, we will only place trainees in departments and schools that have consistently demonstrated excellence in their practice. This will mean that trainees will be mentored by experienced staff and will benefit from being surrounded and supported by outstanding teachers. We aim to serve our local area by providing training and employment opportunities within our community\n\nWe are supported and guided by the University of Hertfordshire who ensure that all trainees receive the level of support appropriate to their level of experience, ability and confidence.","trainWithDisability":"Each year the University of Hertfordshire welcomes a significant number of students who disclose a disability and/or have other needs. The University seeks to create a fair, inclusive culture where everyone feels valued\nand respected.\nThe University of Hertfordshire is committed to promoting equality of opportunity to ensure that it meets the needs of disabled people and has policies that are intended to support all students both in their studies and in developing their professional practice.\nIf you have a disability or other need we encourage you to disclose this and any other relevant information that could support your studies.\nThe School of Education at the University of Hertfordshire provides both academic and practice placement support for teachers in training with disabilities and other needs.\nOne key aspect of the PGCE course is to raise awareness of mental health and well-being and to support the removal of unnecessary workload.\n[University of Hertfordshire disability support](https://www.herts.ac.uk/life/student-support/disability- services)\n[University of Hertfordshire statement on disability disclosure by\nstudents](https://www.herts.ac.uk/life/student-support/disability services/statement-on-disability- disclosure-by-students).","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:52:23.326Z","updatedAt":"2021-09-03T15:14:37.672Z"}
