{"id":"28684649-3407-4004-9cb2-4aca8757498a","name":"South Cumbria School Direct","code":"2KS","type":"lead_school","isAccreditedBody":false,"urn":"135940","ukprn":"10058677","address":{"addressLine1":"Furness Academy","addressLine2":"Park Drive","town":"Barrow-in-Furness","county":"Cumbria","postcode":"LA13 9BB"},"contact":{"website":"http://www.furnessacademy.co.uk","email":"info@southcumbriaschooldirect.co.uk","telephone":"1229484270","fullName":"Stephen Kelly"},"location":{"latitude":54.1176432,"longitude":-3.2125662},"trainWithUs":"The South Cumbria School Direct is based at Furness Academy, Barrow in Furness and works in close collaboration with the Ripley ITT SCITT in Lancaster.\nThis is a 12 month programme which gives you PGCE and recommendation for QTS. The PGCE includes 60 credits at Master’s level.\nAs a trainee teacher on the South Cumbria School Direct Programme you will spend a much greater proportion of time in school than you would on a traditional PGCE programme and the curriculum will be delivered by school expert practitioners working across our partnership. This will facilitate much stronger links between theory and practice, enabling you to apply pedagogical knowledge in the classroom and reflect upon it more immediately. Our highly innovative curriculum is designed and delivered by us and, our partner schools, in order to train the type of teachers that schools want to employ. Our vision is to develop outstanding teaching and learning which is relevant to schools today and therefore linked to enhanced employment prospects. Our partner schools are involved in the recruitment and selection of trainees and have a real commitment to their training. Our trainees are highly valued and well supported at all stages of their training by expert practitioners and outstanding mentors. They greatly enjoy the exciting and innovative curriculum which we have designed, and make excellent progress in our schools.","trainWithDisability":"If you have a disability, or additional requirements, please contact us so we can discuss how best to accommodate your needs.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"d14be96c-fe6c-4962-a0b9-6717cf4f9d5b","code":"R23","name":"Ripley ITT","description":"Ripley ITT SCITT has an outstanding reputation in the locality with a consistent record of high teaching standards and good results.\\r\\nThe training programme is highly valued and recommended by our trainees and the schools we work with.\\r\\nThe ITT SCITT offers a modern, relevant curriculum delivered by expert practitioners across our partner schools."}],"createdAt":"2021-07-06T17:50:07.654Z","updatedAt":"2021-10-08T20:38:40.078Z"}
