{"id":"28a7c3bb-e1fc-406e-bff7-b398d882cfbb","name":"Aspire Teaching Alliance","code":"28R","type":"lead_school","isAccreditedBody":false,"urn":"116305","ukprn":"10071569","address":{"addressLine1":"Aspire Teaching Alliance","addressLine2":"c/o Overton CE Primary, Court Drove","town":"Overton","county":"Hampshire","postcode":"RG25 3ES"},"contact":{"website":"http://www.overtonprimary.co.uk/initial-teacher-training","email":"aspire@overton.hants.sch.uk","telephone":"1256770249","fullName":"Warren Glew ITT Coordinator"},"location":{"latitude":51.2478324,"longitude":-1.2698911},"trainWithUs":"\"It's a great way to learn and you're part of a team straight away.\" School Direct Trainee.\n100% of the trainees who have completed Aspire’s innovative school-based training programme have secured employment. Our School Direct programme is designed in partnership with the University of Winchester and carries the award of both Qualified Teacher Status (QTS) and Post-Graduate Certificate of Education (PGCE).\nThe University of Winchester is recognised by Ofsted as an ‘Outstanding’ provider of teacher education at both primary and secondary level and has a long history of training teachers. Aspire and the University work in partnership to help you reach your full potential. Overton CE Primary School is the lead school of Aspire Teaching Alliance and has been judged outstanding in two consecutive Ofsted inspections. Our partner schools share a long-term commitment and proven track record in developing and supporting the next generation of teachers. Aspire’s training programme is informed by the latest research and compliments and deepens the training delivered at the University of Winchester. Specialist leaders and teachers deliver bespoke, relevant and practical training at the Alliance partner schools.\n\"Training within the Alliance on a Friday meant I could implement things straight away on the following Monday and improve my practice.\" School Direct Trainee.","trainWithDisability":"Your wellbeing is a top priority and we will do all we can to give you the chance to flourish and maximise your potential. \n\nIn partnership with the University of Winchester there is a dedicated student support team to help with any questions or challenges you might experience during your studies. We work with you to support your wellbeing and mental health, provide confidential advice and offer workshops to boost your academic skills. \n\nIf you have a disability or learning difference, we encourage you to get in touch before you apply so we can discuss tailored support for your individual needs.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:52:13.509Z","updatedAt":"2021-09-29T17:14:41.134Z"}
