{"id":"28b43282-af1b-4c5d-b19d-a106a25ed5fb","name":"Lindens","code":"14S","type":"lead_school","isAccreditedBody":false,"urn":"104212","ukprn":"10068832","address":{"addressLine1":"Lindens Primary School","addressLine2":"Hundred Acre Road","town":"Streetly","county":"West Midlands","postcode":"B742BB"},"contact":{"website":"www.lindens.walsall.sch.uk","email":"crandall@lindens.walsall.sch.uk","telephone":"1213539273","fullName":"Simon Griffiths"},"location":{"latitude":52.5680338,"longitude":-1.8882142},"trainWithUs":"We at Lindens Teaching School offer 2 routes to teaching in a primary school:\nSchool Direct Tuition\nSchool direct Salaried\nBoth routes, on completion, award you QTS and you gain teaching experience in 2 Key Stages during the year-long course.\nSchool Direct Salaried routes are funded by a school where you are likely to have worked or are working in a classroom assistant or support role. You spend 2.5 terms in a lead school and .5 term in a second school. The lead school funds your course and this needs to be agreed prior to application\nSchool Direct Tuition routes cost £9000 and the route enables you to gain experience in 2 different school settings within Lindens and their partners.\nExperience in school settings will provide insight into outstanding practice and knowledge of SEND, EAL and mastery of the curriculum\nAssessment is through the Teachers' Standards\nYou will have access to an Outstanding school and work within a vibrant community of learners and partner schools.\nPlease check Lindens school website for further details\nPrior to commencing the course GSCE English, maths and science is required and degree 2:2 or above - previous school experience is desirable to support your application\nwww.lindens.walsall.sch.uk","trainWithDisability":"We at Lindens pride ourselves on our inclusive practice and policy\n\nWithin the lead school we have an inclusion unit which as a trainee you will have access\n\nWe welcome all applicants to apply as we cater for all needs\n\nDo not hesitate to contact the Director, Chris Randall, to discuss further","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"4da5abb2-b287-451e-8d75-c5b79e11c2bb","code":"W75","name":"University of Wolverhampton","description":"The University of Wolverhampton is our accrediting provider awarding QTS and PGCE and MA credits.\\r\\nIt is a local provider geographically which will deliver subject-specific sessions during the year of training.\\r\\nThe campus is based in Walsall and during the year you are expected to visit and train with the UoW staff.\\r\\nSalaried routes attend approx 30 days during the academic year\\r\\nTuition routes attend during the Autumn and Spring Terms \\r\\nBoth courses commence September\\r\\nAll trainees are allocated a university tutor."}],"createdAt":"2021-07-06T17:56:50.112Z","updatedAt":"2021-10-06T22:59:48.798Z"}
