{"id":"28e7b0da-15c3-4164-ad9e-2646e4ff5ff6","name":"Central Learning Partnership Trust","code":"1VG","type":"lead_school","isAccreditedBody":false,"urn":"137730","ukprn":"10035949","address":{"addressLine1":"Heath Park Scool","addressLine2":"Prestwood Road","town":"Wolverhampton","county":"West Midlands","postcode":"WV11 1RD"},"contact":{"website":"www.heathpark.net","email":"kirsty.prashar@heathpark.net","telephone":"01902 556360","fullName":"Kirsty Prashar"},"location":{"latitude":52.5994915,"longitude":-2.1008294},"trainWithUs":"Applicants considering a profession within teaching want a training experience which fully prepares them for a career in the twenty first century classroom, with up to date pedagogical theory and practice, with an insight into all factors impacting on progress and attainment, delivered by outstanding trainers and teachers. This is what the Central Learning Partnership Trust provides. Heath Park is the lead school in the CLPT which encompasses a breadth of schools and phases in Wolverhampton and beyond, most of which are good or outstanding schools. All schools have a commitment to the children in their communities, overcoming barriers and providing life opportunities beyond the school gates. The range of subjects offered across the partnership is exceptional and shows our commitment to continued growth in both traditional and creative subjects, reflecting the diverse wants, needs and talents of our students There is a long and successful history of teacher training within the partnership through involvement with universities and ITT providers, but also through national partnerships in which the schools have directly contributed to the training programmes. This experience helps us meet the needs of all trainees, from ECTs to Senior Leaders engaged in national professional programmes. There is a strong tradition of 'grow your own' within the school, with many trainees continuing in situ after their training and quickly taking management positions within the schools. Within a strong network of schools, you will soon learn that teaching is all about the individual.","trainWithDisability":"We offer an inclusive and engaging environment for both our students and our trainee teachers.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:48:12.704Z","updatedAt":"2021-11-02T19:26:10.249Z"}
