{"id":"2915cd8b-c4a4-4169-8715-78a9302d9548","name":"East Midlands Teacher Training Partnership","code":"E31","type":"scitt","isAccreditedBody":true,"ukprn":"10055367","address":{"addressLine1":"The West Bridgford School","addressLine2":"Loughborough Road","town":"West Bridgford","county":"Nottingham","postcode":"NG2 7FA"},"contact":{"website":"http://emttp.ac.uk","email":"emttp@emet.uk.com","telephone":"0115 6718411","fullName":"EMTTP Administration"},"location":{"latitude":52.9191327,"longitude":-1.1392074},"trainWithUs":"The East Midlands Teacher Training Partnership is a School Centred Initial Teacher Training provider (SCITT) which has a large, committed partnership of schools in Nottinghamshire, Derbyshire and Leicestershire. In order to provide the very best experience for our trainee teachers, we offer the opportunity to gain QTS and PGCE with 60 Master’s credits. The PGCE element is delivered in partnership with the University of Nottingham. This, we believe, ensures that our trainees have access to fantastic opportunities beyond the classroom that complement the school based training.\nWe have an individualised approach to training. We take into consideration past experience and areas of needs and, where necessary, put in bespoke solutions to support. We view your training year as the beginning of a fulfilling career, and as such, work with you to make your transition into teaching a positive, rewarding experience.\nAmongst the many strengths highlighted in our most recent Ofsted report were the excellent levels of pastoral care afforded to trainees, the shared, committed partnership ethos across all stakeholders, the quality of training and the responsiveness of course leaders to feedback received. All of these are crucial in supporting trainees to have a successful and enjoyable year of training. All of our trainees in 2017/18 reported that they felt that their training had prepared them very well for their first teaching position. Our trainees have a good record of securing employment within our partner schools. This potential for continuity, trainees tell us, provides a real incentive to train with us.","trainWithDisability":"In line with the Equality act 2010, we ensure equal treatment of all applicants to our courses. We will give equal treatment in access to our courses regardless of the identified protected characteristics. Therefore, we welcome applications from all prospective teachers who are suitably qualified and demonstrate the potential and motivation to teach.\nIn order to support trainees with disabilities and other needs we ask all trainees to undergo an occupational health assessment. This will identify any additional support or adjustments that we can make to ensure that you have access to the best possible training. Our partner schools themselves will work with you to ensure that you have access to the experiences that you need to allow you to be successful in your training. We also have key staff within the partnership, such as SENCo’s and Inclusion Leaders who will work with training staff to ensure that we are putting in place the necessary support for all trainees. As a partnership we are committed to supporting all of our trainees to make their training year as enjoyable and successful as possible. The young people within our schools gain so many positives from being taught by teachers from a range of backgrounds. Through our training model, we have regular opportunities for all trainees to network. We know, from feedback, that this is seen, by trainees, as extremely valuable and supportive.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:47:10.175Z","updatedAt":"2021-11-12T16:27:28.753Z"}
