{"id":"294d0e65-0b96-46d1-a8eb-f27c9a96d9d2","name":"Teach Cheshire","code":"1JS","type":"lead_school","isAccreditedBody":false,"urn":"136278","ukprn":"10031375","address":{"addressLine1":"THE FALLIBROOME ACADEMY","addressLine2":"PRIORY LANE","town":"Macclesfield","county":"Cheshire","postcode":"SK10 4AF"},"contact":{"website":"http://www.teachcheshire.org.uk","email":"bur@fallibroome.org.uk","telephone":"01625 827898","fullName":"School Direct Admissions"},"location":{"latitude":53.269878,"longitude":-2.160895},"trainWithUs":"[Teach Cheshire](http://www.teachcheshire.org.uk/) is an experienced School Direct Alliance with a hub centred around Macclesfield and Poynton for both secondary and primary teacher training. All of the schools in the Alliance have comprehensive intakes and you will get experience of working with young people of all abilities. We have high academic standards and we are passionate about enabling our students to be confident, articulate, creative and resilient. We have very high completion rates and all trainees have been graded good or outstanding. Over the past five years, on average, 90% of Teach Cheshire trainees found teaching jobs at the end of the course, with a significant proportion employed within the Teach Cheshire partnership. We work closely with our university colleagues to share the delivery of the programme so that you have the opportunity to apply learning from university sessions to the practical context of the classroom, supported and guided by experienced and enthusiastic teachers.\nAs a Teach Cheshire trainee, you are fully immersed into wider school life, with the opportunity to build up strong relationships with the staff and students in each placement school. You spend time in two different partnership schools, normally starting in one in the Autumn term, going to a contrasting placement in the Spring term and then returning to the first school in the Summer term.","trainWithDisability":"Specialist disability and inclusion staff at both universities provide confidential information, advice and guidance to support students in identifying the most appropriate solutions to potential barriers to learning. Teach Cheshire schools will work closely with the universities to ensure needs are met whilst on placements.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:52:58.553Z","updatedAt":"2021-07-14T20:03:34.212Z"}
