{"id":"2a4e5292-329f-4924-b5e2-d7ff455be4b5","name":"Aspire Community Trust","code":"2X3","type":"lead_school","isAccreditedBody":false,"urn":"116109","ukprn":"10077457","address":{"addressLine1":"Swaythling Primary School","addressLine2":"Mayfield Road","town":"Southampton","county":"Hampshire","postcode":"SO17 3SZ"},"contact":{"website":"swaythlingprimary.net","email":"emma.anderson@swaythlingprimary.org","telephone":"2380552252","fullName":"Emma Anderson"},"location":{"latitude":50.9365709,"longitude":-1.389467},"trainWithUs":"The Aspire Community Trust is a co-operative trust made up of 9 schools in Southampton - 1 secondary school, 5 primaries, 1 junior, 1 infant and 1 special school. Our schools serve pupils from a diverse range of socio-economic and ethnic backgrounds, including many who have English as an additional language. We are very proud of how we promote and celebrate diversity in our schools and we will provide applicants with a unique and rich training experience.\n\nAs a group of schools we work together in a close partnership that provides great benefits to the children and staff that we serve. The values of all of the schools within our trust are underpinned by the co-operative values of promoting aspiration, sharing and caring, perseverance, independence, responsibility and enjoyment. However, each school has its own distinctive ethos and ways of working. Although we collaborate closely together, each school is completely autonomous and there is no hierarchy between them.\n\nWe have a long established and successful partnership with the University of Southampton. All of our schools are within close walking distance of the university and staff within our schools contribute to the universities training programme. Applicants will have the best of both worlds, a university led and school based training programme. \n\nYou will receive the same teaching entitlement as those following the university led programme and will benefit from the full support of university tutors. In addition, you will also benefit from the training experiences and support provided within the Trust.","trainWithDisability":"We welcome applications from candidates with disabilities and other needs. SEND is a very important element of training throughout the PGCE and trainees who have personal experiences of SEND are of real benefit to our programmes as they bring a wealth of experience. Our trainees with disabilities will benefit from the full package of support provided by the University of Southampton. This includes:\n\nNeurodiverse Trainees (including Trainees with dyslexia, ADHD and ASD) meet together for an informal session, led by a tutor with significant SEND experience. This group supports one another throughout the course, with individual, personalised input from the tutor as required.\n\nTrainees with Physical Disabilities are always accommodated as appropriate and a wide variety of modifications are available. For example, a student with a hearing impairment may be supported by our enabling services, as well as by their Personal Academic Tutor with services such as remote transcription available - we work with individuals to ensure that their needs are met both when in University and when teaching in schools.\n\nWe recognise that teaching can be stressful. The University offers a variety of services for Trainees who may be suffering from anxiety or depression, for example trainees can access talking therapies via the University Enabling Services. Trainees are also encouraged to make full use of their Personal Academic Tutor.\n\nThe course team are able to personalise many aspects of the programme to accommodate needs on an individual basis, to enable successful completion of the course.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:51:32.390Z","updatedAt":"2021-10-04T19:27:45.983Z"}
