{"id":"2a9e902c-11f5-47fe-9b7e-1eaefe052133","name":"Yorkshire Inclusive TSA","code":"1ER","type":"lead_school","isAccreditedBody":false,"urn":"108119","address":{"addressLine1":"John Jamieson School","addressLine2":"Hollin Hill Drive","town":"Leeds","county":"West Yorkshire","postcode":"LS8 2PW"},"contact":{"website":"http://www.yorkshire-inclusive.org","email":"YorkshireInclusiveTSA@eastsilc.org","telephone":"0113 2930236","fullName":"Head of Teaching School"},"location":{"latitude":53.8233116,"longitude":-1.4945188},"trainWithUs":"We are training the next generation of outstanding teachers for the Leeds area. We are committed to providing the highest standard of education and we want to recruit student teachers who share the same commitment. Our current cohort of student teachers are training to teach in primary and secondary in both mainstream and special school settings.\nWe provide training and placements of the highest quality to deliver a truly bespoke training package. We are committed to helping you develop professionally, well beyond your initial teacher training and Newly Qualified Teacher (NQT) year by means of an extensive programme of Continuing Professional Development (CPD) opportunities – As an Appropriate Body for NQTs we offer our trainees a coherent two year programme of support.\nWe also support training places in Calderdale through the Parkinson Lane School Direct Partnership:\nParkinson Lane School Direct Partnership (Calderdale) has a track record of supporting and bringing new teachers into the profession, a committed team of experienced mentors, coaches and tutors providing support throughout the programme, a wide range of schools within the partnership offering outstanding training and placements within varying contexts.","trainWithDisability":"We are committed to Equality and Diversity. All partner organisations and all schools participating in the programme have clearly established policies, processes and systems for monitoring. All trainees will be introduced to their school’s policy through focused training by the host school.\nWe are committed to the achievement of equal opportunities. This is central to our mission as providers of school-based teacher training and we have a proven track record of supporting trainees with additional needs.","accreditedBodies":[],"createdAt":"2021-07-06T17:51:43.810Z","updatedAt":"2021-07-14T15:38:49.158Z"}