{"id":"2b692b6f-491c-4e74-9799-16a616ced9d8","name":"Willows School Direct Partnership","code":"1Q7","type":"lead_school","isAccreditedBody":false,"urn":"123999","ukprn":"10069223","address":{"addressLine1":"Willows Primary School","addressLine2":"Anglesey Road","town":"Off Weston Road","county":"Lichfield","postcode":"WS13 7NU"},"contact":{"website":"http://www.willows.staffs.sch.uk","email":"deputy@willows.staffs.sch.uk.uk","telephone":"1543421830","fullName":"Laura Lazenby"},"location":{"latitude":52.6945806,"longitude":-1.828367},"trainWithUs":"Thank you for your interest in the Willows School Direct partnership. As a partnership we are committed to developing future teachers for the local area. Willows Primary School is an Outstanding primary school situated in Lichfield. Staff enjoy working here and children enjoy learning here. Our School Direct cluster is a group of supportive, like-minded, forward thinking primary schools passionate about delivering the highest standards for our pupils. This is at the heart of our School Direct partnership.\nAs a partnership, we always put our pupils first. In order to give our pupils the best, we ensure that our initial teacher training is the best. Associate teachers (School Direct students) receive the highest quality in both training and school experience. Our School based University Tutor ensures that the communication between university, placement schools and candidates is as smooth and effective as possible. There is always someone available to listen, liaise and support.","trainWithDisability":"As a training provider we support candidates with disabilities and other needs by close liaison between ourselves, the University and the candidate. We understand that all candidates are individuals and we approach each candidate and their specific needs o that basis.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:48:32.688Z","updatedAt":"2021-10-31T17:42:06.414Z"}
