{"id":"2b72c9a7-eddf-4eba-bc4c-744e7645b0b5","name":"Bengeworth Multi-Academy Trust","code":"2JC","type":"lead_school","isAccreditedBody":false,"urn":"140932","ukprn":"10046169","address":{"addressLine1":"Bengeworth Multi-Academy Trust","addressLine2":"Kings Road","town":"Evesham","county":"Worcestershire","postcode":"WR11 3EU"},"contact":{"website":"http://www.bengeworthacademy.co.uk/","email":"so22@bengeworth.worcs.sch.uk","telephone":"1386442047","fullName":"Sian-Louise O'Neill"},"location":{"latitude":52.0954818,"longitude":-1.9315199},"trainWithUs":"Why train with us?\nBengeworth Multi -Academy Trust is a dynamic and vibrant school where every child acquires a high quality education and an unforgettable childhood experience. We provide a happy, safe and caring environment where each person feels valued and excellence and enjoyment are embedded. We all choose to be here, children and staff alike, demonstrating mutual respect, a desire to learn and a zest for life through aspiration, determination and fulfillment. The multi-academy trust provides outstanding training for those aspiring to provide children with an outstanding education through school based learning opportunities, in partnership with the University of Worcester. The Primary course will be run by Bengeworth CE Academy in partnership with the University of Worcester, with main teaching placements taking place in one of the excellent First Schools within the area. The multi-academy trust works closely with schools within the alliance which means it can offer a wide range of opportunities and experiences for trainees, wishing to train within the age range of 5-11. The professional studies elements of the course will be coordinated by Bengeworth CE Academy, the lead school, and will provide a range of training opportunities to enhance teaching and learning skills across the settings within the alliance. Bengeworth CE Academy is an outstanding first school where it’s pupils learn at a rapid pace and make outstanding progress. Above all, the schools within the Bengeworth CE Multi-Academy Trust alliance are committed to ensuring all learners will develop into valuable members of the community.","trainWithDisability":"Bengeworth Multi Academy Trust and the schools within the alliance are inclusive schools that endeavour to meet the needs of trainees and pupils with disabilities and other needs.\nPlease contact Bengeworth Multi Academy Trust to discuss how your individual needs or disability can be best met within your training.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"accreditedBodies":[],"createdAt":"2021-07-06T17:52:52.232Z","updatedAt":"2021-09-22T02:11:02.155Z"}
