{"id":"2b84ae64-ebca-4e4d-88b1-13effff3a411","name":"University of Southampton","code":"S27","type":"hei","isAccreditedBody":true,"urn":"133879","ukprn":"10007158","address":{"addressLine1":"Southampton Education School","addressLine2":"Highfield","town":"Southampton","county":"Hampshire","postcode":"SO17 1BJ"},"contact":{"website":"http://www.southampton.ac.uk/education/postgraduate/itt.page","email":"ITTAdmissions@soton.ac.uk","telephone":"023 8059 4732","fullName":"Southampton Education School"},"location":{"latitude":50.9344329,"longitude":-1.3953487},"trainWithUs":"Our ITE department is a dynamic and thriving community of professional educators and researchers. Southampton Education School has been placed in the top 100 universities in the World (QS Rankings). This adds to our UK ranking of 4th in the UK for Education from the Complete University Guide, 2022.\nWhy come to Southampton?\n* Our Tutors. Trainee Teachers rate tutor dedication and commitment extremely highly, External Examiners praise the time and effort that Tutors devote to Trainees and Ofsted recognises the ‘high quality mentoring and support’ offered. * Our quality of teaching and our diverse partnerships and placements. Our Tutors are all Teachers. We thrive through continuous professional development – and enjoy implementing new research or theories in collaboration with Trainee Teachers and our Partnership schools. This partnership is key to our success, and the Mentors that we work are experienced, dedicated and enthusiastic. * Our commitment to Health and Wellbeing. The health and wellbeing of our Trainee Teachers, and the students that they teach, is central to producing outstanding teachers and happy students who can make progress and succeed.\n* Our scope to personalise and individualise your learning on your Programme. Every Trainee Teacher is unique, and we want every trainee to be the best teacher that they can be. We achieve this by personalising our programmes to suit you.\n* Our commitment to ‘Student Voice’. We actively encourage trainees to work with us to make our courses even better. * Employability. Almost 100% of our Trainees get jobs.","trainWithDisability":"At Southampton we welcome applications from candidates with disabilities and other needs. SEND is a very important element of our training throughout the PGCE, and trainees who have personal experiences of SEND are of real benefit to our programmes, as they bring a wealth of experience.\nHow are Trainee Teachers with disabilities and other needs supported?\n* Neurodiverse Trainees (including Trainees with dyslexia, ADHD and ASD) meet together for an informal session, led by a tutor with significant SEND experience. This group supports one another throughout the course, with individual, personalised, input from the tutor as required.\n* Trainees with Physical Disabilities are always accommodated as appropriate and a wide variety of modifications are available. For example, a student with a hearing impairment may be supported by our enabling services, as well as by their Personal Academic Tutor with services such as remote transcription available - we work with individuals to ensure that their needs are met both when in University and when teaching in schools.\n* We recognise that teaching can be stressful. The University offers a variety of services for Trainees who may be suffering from anxiety or depression, for example trainees can access talking therapies via the University Enabling Services. Trainees are also encouraged to make full use of their Personal Academic Tutor.\n* The course team are able to personalise many aspects of the programme, to accommodate need on an individual basis, to enable successful completion of the course.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"createdAt":"2021-07-06T17:55:26.757Z","updatedAt":"2021-10-01T16:36:24.050Z"}
