{"id":"2b8fac2f-ed98-4278-a7fc-fa3f418dfbef","name":"Teach Kent & Sussex","code":"2EZ","type":"scitt","isAccreditedBody":true,"ukprn":"10058549","address":{"addressLine1":"Bennett Memorial Diocesan School","addressLine2":"Culverden Down","town":"Tunbridge Wells","county":"Kent","postcode":"TN4 9SH"},"contact":{"website":"http://www.teachkentandsussex.org.uk","email":"contact@teachkentandsussex.org.uk","telephone":"01892 521595","fullName":"Carol Hughes"},"location":{"latitude":51.1429466,"longitude":0.2483522},"trainWithUs":"Teach Kent & Sussex works with some of the highest performing state schools in the country. These schools succeed because of high quality teaching. By training with us you will learn alongside those expert teachers.\nTeach Kent & Sussex works with a range of primary and secondary schools across West Kent and East Sussex to provide highly effective teacher training. Our expertise in teacher training was recognised in our 2019 Ofsted inspection in which we were graded as 'outstanding' in all categories. Inspectors reported that \"Trainees achieve excellent outcomes because their training course, informed by the most up-to-date research, is carefully sequenced & expertly led....enabling trainees to perform exceptionally well across all the teachers’ standards.\"\nTeach Kent & Sussex provide all our partner schools with regular training to ensure that their mentors and professional tutors are able to support our trainee teachers effectively.\nTeach Kent & Sussex is also part of the Kent Teaching School hub. We therefore can draw upon considerable teaching and leadership expertise to help you grow and flourish as you begin your career as a new teacher.","trainWithDisability":"We wish to ensure that every candidate can show their potential to become a great teacher. We therefore work closely with candidates who declare a disability or additional need to ensure that reasonable adjustments are made at interview in order to ensure that all candidates have an equal chance to show their potential to teach. If offered a place to train to teach we agree with you an independent support plan which is reviewed on a termly or more frequent basis if necessary. This helps to ensure that our provision is the best it can be. Such reviews have shown to be helpful and effective in the past and are an essential part of our provision.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:51:40.703Z","updatedAt":"2021-10-05T05:34:30.640Z"}
