{"id":"2c28447d-60a4-4c6f-9db3-06a1045a5a1f","name":"The Bracknell Forest Partnership","code":"2FZ","type":"lead_school","isAccreditedBody":false,"urn":"137267","ukprn":"10034787","address":{"addressLine1":"Ranelagh Drive","town":"Bracknell","county":"Berkshire","postcode":"RG12 9DA"},"contact":{"website":"http://bracknellforestschooldirect.co.uk/","email":"teacher.recruitment@bracknell-forest.gov.uk","telephone":"1344354005","fullName":"Bracknell Forest Partnership"},"location":{"latitude":51.4115116,"longitude":-0.7473093},"trainWithUs":"You will have the opportunity to receive invaluable ‘on the job’ experience in school with the Bracknell Forest School Partnership. This consists of eight co-educational secondary schools with sixth forms, a pupil referral unit and a special school all part of the small friendly and successful local authority of Bracknell Forest, Berkshire.\nThis training programme is a one-year school based full-time route into teaching leading to the award of Qualified Teacher Status or a Postgraduate Certificate in Education and credits towards a Masters degree.\nOne school will be your host school, but more importantly you will be part of a wider community of trainee teachers across all the partnership schools. Your training will be carried out in conjunction with University of Reading.\nThe aim of all involved in the partnership is to train excellent practitioners who have a positive impact on the learning of pupils. You will take ownership of your development during your first year and establish the skills to allow you to reflect on your own learning to enable you to continuously improve during the training year and throughout your career.\nBracknell Forest is renowned for being a small, friendly and very effective local authority. New teachers often tell us how easy it is to settle in our schools and how valuable the networking opportunities are. There is a real sense of community amongst our teachers.\nAfter the course you will be in an ideal situation to apply for suitable vacancies in any of the partnership schools .","trainWithDisability":"Disability access varies from school to school. If you have any specific concerns about access please contact us at teacher.recruitment@bracknell-forest.gov.uk as early as possible in the application process. If your application is shortlisted we will make adjustments to ensure you can attend and participate fully in the interview process and, if successful at interview, place you in the most suitable school with training places.\nThe University of Reading's London Road campus is a compact and level campus. Most teaching buildings are accessible for wheelchair users, although some older buildings have limited access. They are continually improving access to buildings and operate a central room booking system so that lectures are timetabled in accessible rooms .\nAll University buildings are accessible by car and most have disabled parking spaces nearby.\nStudents with mobility difficulties may apply for a permit to park on campus, for which there is a small annual charge. Permits for Blue Badge holders are free.\nThere are buses into town from campuses with around 50% of the Reading buses having low floors.","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"6439adcc-af64-4d3d-a1da-de045755db06","code":"R12","name":"University of Reading","description":""}],"createdAt":"2021-07-06T17:49:29.873Z","updatedAt":"2021-07-20T18:52:30.642Z"}
