{"id":"2c46efe4-e6f5-4ebb-ac2f-8096f58ee426","name":"Bishop Rawstorne School Direct Programme","code":"18C","type":"lead_school","isAccreditedBody":false,"urn":"137296","ukprn":"10034569","address":{"addressLine1":"Highfield Road","addressLine2":"Croston","town":"Leyland","county":"Lancashire","postcode":"PR6 7JZ"},"contact":{"website":"https://www.bishoprra.co.uk","email":"teachertraining@bishopr.co.uk","telephone":"1772600349","fullName":"Mrs Helen Winter"},"location":{"latitude":53.661729,"longitude":-2.76925},"trainWithUs":"Our unique and well-established programme offers a skilled alliance of schools who work closely with us to ensure you receive the highest quality training, as well as the care, support and resources you require. Our accredited provider, the University of Cumbria, also offer experienced staff and together we guarantee your experiences in school, and at University, or when completing assignments, are not only positive but rewarding ones.\nAll placement schools have been carefully selected to provide many fantastic opportunities and a personalised school based experience. They are conveniently located across the northwest and include: Penwortham Girls’ High School, Parklands Academy, Brownedge St. Mary’s Catholic School, Bishop Rawstorne Academy, Lostock Hall Academy, St.Michael’s Church of England High School and Balshaw’s Church of England High School. Moreover, we pride ourselves on supporting all trainee teachers, on an individual level, and throughout your training you will receive incalculable support with preparing for interviews and job applications. Consequently, our trainees have a fantastic track record of securing employment, often within our own or partnership schools.\nIn addition, as we are committed to ongoing professional development, you will have the benefit of many extras; for example, you will have access to any CPD we offer, as well as teaching and learning events. This will not only allow you opportunities for further networking, but also to gain cutting-edge training from experienced staff, many of whom are specialists in their own field, thereby allowing you to become an outstanding teacher in your own right.","trainWithDisability":"As an initial teacher trainer provider, we recognise that we are all different and each have our own unique ways of learning. Consequently, we aim to provide a supportive environment that allows all individuals to flourish, and actively encourage applications from disabled people. We are committed to widening participation and provide a range of services to enable those with a disability or specific learning difficulty (SpLD) to access their training. To accomplish this, we offer:\n- Adjustments to the interview process, including extra time, readers and scribes, use of computers and rest breaks, subject to receiving appropriate evidence of disability\nAt University:\n-\tDigital recorders for loan to enable you to record your teaching session\n-\tAssistance in the library -\tAccess to a range of non-medical help services such as practical support, note-taking and specialist mentoring (to access these services you will need to have applied for Disabled Students Allowance through your funding body – the university can assist you with this process if required\n- An individualised disability/SpLD action plan giving staff an overview of the impact of your disability/SpLD and detailing the adjustments that you require\nWe will always discuss any requirements with you to ensure any adjustments necessary reflect your needs and assist you in becoming an independent learner thereby improving your employability skills.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:48:27.973Z","updatedAt":"2021-09-22T16:47:31.909Z"}
