{"id":"2c89b3e1-0ba2-4b4e-a0ca-0011112cf0b6","name":"Mickle Trafford Alliance","code":"1TR","type":"lead_school","isAccreditedBody":false,"urn":"111082","ukprn":"10077824","address":{"addressLine1":"School Lane","town":"Mickle Trafford","county":"Cheshire","postcode":"CH2 4EF"},"contact":{"website":"http://www.mickletraffordvillageschool.co.uk/","email":"julie.cox@mickletrafford.cheshire.sch.uk","telephone":"01244 981 321","fullName":"Di Kennedy"},"location":{"latitude":53.2229801,"longitude":-2.8351575},"trainWithUs":"Mickle Trafford Village School Alliance has a long established and successful School Direct programme and we are looking to recruit our 8th cohort of Associate Teachers. In partnership with The Bishops' Blue Coat Church of England High School, Chester, we offer training in both primary and secondary settings - please see the secondary subject offer available on UCAS.\nOur school-based teacher training programme provides the perfect platform from which to embark on a successful and rewarding career in teaching. Our aim is to ensure you are well equipped to start your career armed with the appropriate knowledge, skills and confidence to enable you to inspire the next generation. This is a tall order, you can expect to be based in a school from the start, gaining an understanding of the practicalities of school life and have an impact on children's learning straight away. You’ll spend the majority of the academic year with your students supporting and motivating them to make progress, as well as spending time reflecting on your own development and practice. The programme provides the perfect balance of theory (in conjunction with University of Chester) and school based learning, which is why employment rates are high. Almost all our Associate Trainees gain employment in local schools or are supported to gain employment in other locations nationally and internationally.","trainWithDisability":"Mickle Trafford Village School Alliance welcomes applications from those who identify as having a disability. Please state on your application form any additional needs you may have and also additional support you require in place for interview.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:46:32.235Z","updatedAt":"2021-09-30T21:28:33.921Z"}
