{"id":"2c9bd644-9451-4605-aa68-1586fea4863d","name":"Southampton Inclusion Partnership","code":"26W","type":"lead_school","isAccreditedBody":false,"urn":"116620","ukprn":"10078277","address":{"addressLine1":"Hinkler Road","addressLine2":"Thornhill","town":"Southampton","county":"Hampshire","postcode":"SO19 6DH"},"contact":{"website":"http://www.southamptoninclusion.net","email":"info@southamptoninclusion.net","telephone":"023 8044 5981","fullName":"Julie King"},"location":{"latitude":50.9081441,"longitude":-1.3434757},"trainWithUs":"The Southampton Inclusion Partnership’s (SIP) aim is to empower the learning and lives of children with special educational needs and disabilities (SEND). Our School Direct programme equips trainees with the knowledge and skills to become outstanding teachers of all children including those with a range of special education needs in both special and mainstream schools. \n\nWe are proud of our 100% success rate with all our trainees achieving QTS with a Post Graduate Certificate in Primary Education specialising in SEND. All our trainees have obtained employment within the education sector. \n\nOne of our biggest assets includes the range of schools and professionals working in partnership with SIP. Host schools enable trainees to experience the complete spectrum of special educational needs ranging from those specialising in complex learning differences, social, emotional and mental health to profound and multiple learning differences. Special schools comprise of 9 local special schools and a pupil referral unit with a combined age range of 2 to 19. Local mainstream schools also act as host schools and contribute an essential facet in making our trainees’ teaching wholly inclusive and well rounded.","trainWithDisability":"Our course is fully supportive of all candidates with disabilities and additional needs. Trainees have time to meet with the School Direct Lead (SDL) and share concerns or specific needs. Risk Assessments and / or support plans are written with the trainees and used to help communicate their needs to placement schools or adjust training approaches. \n\nTrainees receive ongoing support from the SDL, Teacher Tutors and Professional Mentors throughout the year where they can discuss reasonable adjustments that may need to be made. A crucial part of the course is ongoing resilience and well-being training. This helps trainees reflect on their approach to life and learning and how to form positive habits especially in relation to workload. In addition, all School Direct trainees can access the wide range of support available via Winchester University Student Services which includes counselling, financial advice and much more.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"accreditedBodies":[{"id":"3700fb02-7007-40c8-9127-b070e146d6cb","code":"W76","name":"University of Winchester","description":"Shortlisted for University of the Year in the prestigious Times Higher Education (THE) Awards 2017, our accredited training provider is the University of Winchester. Winchester is consistently recognised by Ofsted as a provider of outstanding Initial Teacher Training in England.\\r\\n\\r\\nWorking in partnership, Winchester and SIP provide high quality training ensuring trainees are fully equipped to teach in both primary mainstream and special schools. Experienced teachers, SENCos, specialist leaders of education, headteachers and other professionals including speech and language specialists contribute to our programme ensuring training is current and delivered with passion and expertise."}],"createdAt":"2021-07-06T17:46:22.827Z","updatedAt":"2021-09-24T18:22:50.750Z"}
