{"id":"2caa774a-cb20-42f6-9c07-6bf03ff53c4d","name":"Nottingham Catholic Initial Teacher Training Partnership","code":"1YD","type":"lead_school","isAccreditedBody":false,"urn":"137409","ukprn":"10059277","address":{"addressLine1":"The Becket Way","addressLine2":"Wilford Lane","town":"West Bridgford","county":"Nottinghamshire","postcode":"NG2 7QY"},"contact":{"website":"http://www.becketonline.co.uk/teachingschool","email":"v.scott@becketonline.co.uk","telephone":"0115 982 4280","fullName":"Vanessa Scott"},"location":{"latitude":52.9276945,"longitude":-1.1545246},"trainWithUs":"We are delighted that you are considering training with our partnership and we would really like you to apply to join us. Providing a high level of care and support for our trainees is part of our ethos. Our places are open to all applicants who share our values and are passionate about supporting the learning of our students.\nOur partnership is founded on the principle of collaboration and an absolute belief that by working together we can improve outcomes for all students in all of our schools. Our schools have a long record of partnership with our Higher Education partners in helping to train teachers. School Direct gives us the chance to select and train our own outstanding teachers of the future. If you choose to train with us you can expect:\n*successful trainees will obtain a PGCE (Post Graduate Certificate in Education) and QTS (Qualified Teacher Status) by the end of the programme\n*a programme that gives you four days a week in school and one day a week at University\n*the chance to observe and work with outstanding teachers\n*outstanding mentoring from an experienced and trained mentor\n*a bespoke programme of support sessions\n*a comprehensive induction programme\n*a second school placement in a contrasting school\nWe are working in partnership with Nottingham Trent University, University of Leicester, University of Derby and Bishop’s Grosseteste Lincoln. We are committed to identifying, training and developing outstanding teachers of the future.","trainWithDisability":"We coordinate support and access arrangements for disabled applicants with specific learning difficulties. We work with academic staff, Universities and external agencies to meet individual access requirements.\nOur commitment is to ensure that everybody has an equal opportunity to become an active part of school life irrelevant of their needs.\nThe Teaching School is committed to equality and aims to comply with the Equality Act (2010).","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"1d95b6cb-0e08-4485-848a-0e304d71102a","code":"B38","name":"Bishop Grosseteste University","description":"Bishop Grosseteste University is working within partnership with School Direct to be able to support students in into teaching. School Direct offers more school-led training within local schools around the county.\\r\\n\\r\\nProgrammes generally last for one year. Successful completion of the programme will lead to the award of qualified teacher status (QTS) and many courses also award a postgraduate certificate in education (PGCE) or masters-level credits on completion.\\r\\n\\r\\nYou will be based in one of the schools in the partnership and you’ll also be taught by BG, attending lectures and seminars to bolster your hands-on experience with theories."},{"id":"d2b7d074-fac9-42c5-a0d3-d5471b35f7d9","code":"N91","name":"Nottingham Trent University","description":"Nottingham Institute of Education at NTU is one of the foremost providers of education and training for teachers and other learning and development professionals. Our courses and research span all phases of learning and development – from the early years, right through to adult education.\\r\\n\\r\\nWe have extensive partnership links with many settings, primary schools, secondary schools, colleges and academies across the East Midlands. Our latest Ofsted inspection praised these partnerships, recognising the strength of our links with local schools and the range of specialist placements for trainee teachers, giving them access to high-quality training."},{"id":"aa023df3-b71e-4249-b9c4-41fca8bd135e","code":"D39","name":"University of Derby","description":""}],"createdAt":"2021-07-06T17:55:16.271Z","updatedAt":"2021-09-28T14:35:06.643Z"}
