{"id":"2d2c0819-58bc-455d-bc95-4e967bbc0774","name":"GLF Schools’ Teacher Training","code":"2B4","type":"scitt","isAccreditedBody":true,"ukprn":"10053217","address":{"addressLine1":"c/o Rosebery School","addressLine2":"White Horse Drive","town":"Epsom","county":"Surrey","postcode":"KT18 7NQ"},"contact":{"website":"https://www.glfscitt.org/","email":"info@glftt.org","telephone":"020 3519 6454","fullName":"Helen Shaw"},"location":{"latitude":51.3275861,"longitude":-0.2774182},"trainWithUs":"GLF Schools’ Teacher Training is a School Based Teacher Training provider (SCITT) working with an alliance of highly successful schools with a strong history of providing exceptional Initial Teacher Training since 2013. Our programme allows you to learn to teach in a school environment where you will be treated as a member of the team from your very first day. Throughout your course you will be supported by experienced teachers. Primary Trainees will be assigned a dedicated Mentor. Secondary Trainees will also have a Mentor and a Lead Subject Mentor - all skilled teachers who are passionate about education. We provide all our trainees with a first rate training experience. All of our placement schools have significant experience in delivering ITT and are able to provide consistently high quality placements.\nOur comprehensive summer induction programme ensures that all our trainees are fully prepared for their teaching year ahead. Our carefully devised Professional Studies curriculum is delivered by expert practitioners one day per week.\nOur mentors receive regular training and have a deep understanding of our training curriculum allowing them to provide personalised support and guidance.\nAs a Teaching School hub and a Multi Academy Trust, our wide partnership of schools provide a vast network of highly qualified practitioners and offer a wealth of opportunities to share good practise. We care about mental health and well being and offer regular coaching sessions and well-being meetings if needed.\nWe have a proven record of positive course outcomes and employment rates.","trainWithDisability":"GLF Schools’ SCITT will adhere to its Recruitment and Selection policy in relation to all new appointments. In particular, this means that essential criteria on person specifications will be limited to those requirements which are necessary for the effective performance of the role. Candidates for employment will be assessed objectively against the requirements for the role, taking into account any reasonable adjustments that may be required for candidates with a disability. GLF Schools’ will make reasonable adjustments to its standard working practices to overcome barriers caused by disability. GLF Schools’ SCITT will monitor the composition of the existing workforce and of applicants for jobs and, where problems are identified, will consider whether appropriate action can be taken to address these. All trainees complete a pre-employment questionnaire which is assessed by GLF Schools’ health care provider. Any recommendations are risk assessed and reasonable adjustments are actioned. In addition, GLF Schools’ SCITT has partnerships with a diverse range of both secondary and primary schools and trainees are placed according to their suitability and needs.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:53:34.127Z","updatedAt":"2021-09-30T21:44:00.136Z"}
