{"id":"2d9bfb1e-5694-4726-beb0-e46bfc74b59c","name":"Ebor Academy Trust","code":"4E3","type":"lead_school","isAccreditedBody":false,"urn":"140471","ukprn":"10061219","address":{"addressLine1":"The Leyes","town":"York","county":"Yorkshire","postcode":"YO10 3PR"},"contact":{"website":"https://eboracademytrust.co.uk/","email":"info@ebor.academy","telephone":"01904 553404"},"location":{"latitude":53.957028,"longitude":-1.0388996},"trainWithUs":"Ebor Academy Trust is proud to offer an established and successful school centred route into primary teaching. Our School Direct primary programme has a strong and established partnership of schools, led by the 'Lead School' Robert Wilkinson Primary Academy. Together we provide a programme led by outstanding practitioners in teaching and learning and immersion in wider school life within a diverse range of schools in York and surrounding areas, Selby and East Coast. We work in close partnership with York St John University (https://blog.yorksj.ac.uk/ite/pgce-primary-education/) to deliver high quality teacher training and education which leads to a PGCE with QTS. At the last Ofsted inspection inspectors rated the partnership as ‘highly respected in our region, with outstanding leaders who have clear vision, relentless drive and well targeted actions. The university, Academy Trust and schools demonstrate a common vision and shared commitment to teacher training. The university provides strong institutional support for initial teacher education’.","trainWithDisability":"York St John University is an inclusive university and has a range of support services for students with disabilities and other needs. We have a dedicated Disability Advice Team and PGCE programmes have a strong track record of supporting all students to enable them to complete their studies successfully.\nThroughout the programme there is strong support for you by both university and school-based staff and you also will benefit from the full range of university services (e.g. writing and academic support, wellbeing services, library and IT, careers etc.)","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-09-28T22:31:27.540Z","updatedAt":"2021-09-30T03:59:41.311Z"}
