{"id":"2e1e2750-fa57-48d8-90b5-cbd12055895c","name":"St. Michael’s Federation","code":"2A8","type":"lead_school","isAccreditedBody":false,"urn":"123547","ukprn":"10076327","address":{"addressLine1":"Brampton Road","town":"Lydbury North","county":"Shropshire","postcode":"SY7 8AU"},"contact":{"website":"http://www.stmichaelsfed.shropshire.sch.uk","email":"head@stmichaelsfed.shropshire.sch.uk","telephone":"01588 680277","fullName":"Penny Knight"},"location":{"latitude":52.4676009,"longitude":-2.9575015},"trainWithUs":"St Michael’s Federation is a federation of Lydbury North CofE Primary School and Onny CofE Primary School. We are two small schools joined together by our vision of ‘Growing to be the best that we can be for God, Ourselves and Each Other’. As a federation, we believe we should be always aiming to achieve our best. This goal is a continuous journey and we are always seeking ways to learn, grow and become better members of our community. We cannot achieve this goal on our own so we encourage one another and support one another to be our best selves. We take this approach to our teacher training programme and our staff professional development. The initial teacher training will take place at Lydbury North Primary School - a rural school in a picturesque part of Shropshire. We work alongside a cluster of local primary schools to deliver our teacher training programme. All of the schools are rated good or better by Ofsted and every school has a long successful history of working with Worcester University on the schools direct programme, We have supported many students to successfully achieve their teaching qualification and find employment as a teacher.","trainWithDisability":"We are an equal opportunities employer and will endeavour to support candidates with additional needs. Lydbury North is a wheelchair accessible with provision for disabled toilets. The school is one floor with no stairs within the building. Within our cluster of schools, we have the ability to place students in appropriate wheel chair friendly environments for their second placement. We have a mental health first aider within our federation team and have previous experience of supporting pupils with mental ill-health. Many of our staff have taken additional qualifications within this area.\nWe are experienced at supporting pupils, students and staff members with dyslexia. We have adapted approaches and provided technology where needed to support this learning difficulty and to enable students a way of managing their needs independently.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:53:17.276Z","updatedAt":"2021-10-13T20:33:49.029Z"}
