{"id":"2e6dd44e-2c36-4489-a4cb-52df48d1c365","name":"The John Wallis Church of England Academy","code":"1SK","type":"lead_school","isAccreditedBody":false,"urn":"136197","ukprn":"10030997","address":{"addressLine1":"Millbank Road","addressLine2":"Kingsnorth","town":"Ashford","county":"Kent","postcode":"TN23 3HG"},"contact":{"website":"http://www.thejohnwallisacademy.org","email":"TMasters@thejohnwallisacademy.org","telephone":"01233 623 465","fullName":"Hayley Porter-Aslet"},"location":{"latitude":51.1268499,"longitude":0.8555479},"trainWithUs":"The John Wallis Church of England Academy, which opened in September 2010, is a leading Academy in Ashford, Kent. In 2011 we opened our new Sixth Form and in 2012 a neighbouring Primary School became part of our 3-19 Academy. We are passionate in our belief that every child and young person should have the opportunity to realise their full potential; to be encouraged to raise their aspirations; and to have the opportunity to learn in an environment that is safe, inspired and guided by the key Christian values of respect, truth, trust, integrity and love.\nOur Trainee Teacher & NQT programme is proud to offer bespoke training, support and guidance for every teacher that is training, or newly qualified into teaching. There is a comprehensive system of mentoring that works in conjunction with direct support offered by the Senior Leadership Team as well as weekly training that covers a whole host of topics to help teachers develop further. New members of staff comment frequently on how well they feel supported. The Academy enables trainee teachers and NQTs to make good progress during their first year of teaching with many becoming outstanding classroom practitioners. NQTs also enjoy making valuable contributions to the wider Academy community and relish the opportunity to build relationships with our pupils and students through extra-curricular provision which is often led by an NQT.","trainWithDisability":"The ethos of the Academy enables pupils and students to develop personal responsibility and self-discipline in our community where gospel values are at the centre of all that we do in and through the relationships we have with each other. We must respect ourselves, respect each other, respect our values and respect our environment. Our mission is to inspire and enable each unique pupil/student to achieve their full spiritual, academic, physical, moral and personal potential and to strive always for excellence, not only academic excellence, but excellence in the development of the whole person, \"Life in all its fullness\" (John: 10: 10).","accreditedBodies":[],"createdAt":"2021-07-06T17:46:40.654Z","updatedAt":"2021-07-06T17:46:40.654Z"}