{"id":"2e7f34f3-5fde-410e-b84e-be2558c1b6e8","name":"Gosport and Fareham Multi-Academy Trust","code":"1AS","type":"lead_school","isAccreditedBody":false,"urn":"137791","ukprn":"10035997","address":{"addressLine1":"Bay House School","addressLine2":"Gomer Lane","town":"Alverstoke","county":"Gosport","postcode":"PO12 2QP"},"contact":{"website":"https://gfmat.org/","email":"lstevens@bayhouse.gfmat.org","telephone":"2392505205","fullName":"Lauren Stevens"},"location":{"latitude":50.7882906,"longitude":-1.1644908},"trainWithUs":"The Gosport & Fareham Multi-Academy Trust has a dedicated and experienced ITT team, through which we provide an exceptional standard (as recognised by Ofsted) of school-based Initial Teacher Training through a stimulating and supportive environment. Trainees are supported to become reflective, enthusiastic and knowledgeable practitioners; ready to enhance the learning of young people. An allocated mentor will work with you on a daily basis to develop the qualities needed to meet the Teacher Standards and support your passion to become an outstanding practitioner. A continuous programme of professional learning is part of a package of personal and professional support, tailored specifically to meet your individual needs. Our expectations are for high calibre trainees who are excited by our learning ethos and who feel that they could make a positive contribution to enhancing our offer to pupils. We welcome applications from ambitious trainees who are enthusiastic about training to teach, who are creative, imaginative and forward thinking, with high aspirations for learners. You need to be patient, resilient and adaptable, with good interpersonal skills, but also be approachable and passionate about your subject.","trainWithDisability":"Your wellbeing is a top priority and we will do all we can to give you the chance to flourish and maximise your potential. In partnership with the University of Winchester there is a dedicated student support team to help with any questions or challenges you might experience during your studies. We work with you to support your wellbeing and mental health, provide confidential advice and offer workshops to boost your academic skills. If you have a disability or learning difference, we encourage you to get in touch before you apply so we can discuss tailored support for your individual needs. The GFM have a culture of supporting you to ensure you are able to thrive in a school environment through our mentoring scheme and the continuous nurture of the Initial Teacher Training team.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"3700fb02-7007-40c8-9127-b070e146d6cb","code":"W76","name":"University of Winchester","description":"The University of Winchester is recognised by Ofsted as an ‘Outstanding’ provider of teacher education at both primary and secondary level and has a long history of training teachers. Our passion is to provide you with a university experience that helps you reach your full potential in a stimulating and supportive learning environment that challenges and inspires, in a beautiful, historic cathedral city. \\r\\nThe city of Winchester has a rich heritage and vibrant contemporary culture, so whether living here or commuting, there is plenty to enjoy in the city and surrounding area."}],"createdAt":"2021-07-06T17:56:28.867Z","updatedAt":"2021-08-06T19:45:35.908Z"}
