{"id":"2ed9b983-2151-47c1-9042-acc32961857c","name":"Paradigm Trust: Old Ford Primary Academy and Ipswich Academy","code":"1C8","type":"lead_school","isAccreditedBody":false,"urn":"140096","ukprn":"10043010","address":{"addressLine1":"Old Ford Primary Academy - Paradigm Trust","addressLine2":"Wrights Road","town":"Bow","county":"London","postcode":"E3 5LD"},"contact":{"website":"http://paradigmtrust.org/careers/teacher-training-school-direct-with-paradigm/","email":"school.direct@paradigmtrust.org","telephone":"2089801503","fullName":"School Direct Applications - salaried"},"location":{"latitude":51.5336401,"longitude":-0.0311911},"trainWithUs":"“The best thing has been hands-on training that I can take into the classroom immediately. Lots of chances to see others teach and learn best practice.” (former School Direct trainee).\nAt Paradigm Trust, we have a teaching motto: “We teach the right things, efficiently.” Every minute we have with our learners is important and we can’t afford to waste time. We take what’s most important in every subject and make sure we teach it in the most effective way. Cognitive science is at the heart of our initial teaching programme - the science of learning. We know what works in the classroom and we want to share that with you.\nParadigm Trust has a significant track record of delivering high-quality initial teaching training. Last year 100% of our trainees were graded good or better. 90% of last year’s trainees successfully applied for permanent teaching posts with us this year. “The second placement at Old Ford was really useful. Working in a different environment in a new year group was important for getting used to teaching in a different way and understanding the differences between year groups.” (Former School Direct trainee).\nParadigm Trust’s mission is “to develop and sustain great schools where we can make the biggest difference to pupils.” Education changes lives. Come and train to teach with us.\n[Paradigm Trust](http://paradigmtrust.org/)\nWe have had great success with our School Direct programme and the majority of our trainees successfully gain employment within the Trust at the conclusion of their training.","trainWithDisability":"Paradigm Trust is an equal opportunities employer. We are committed to providing an environment of mutual respect where equal training opportunities are available to all individuals. \n\nPlease let us know if you have a specific need and/or require any adjustments at the interview stage or throughout the ITT programme.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"00782614-9301-40e4-8832-9a74cc1bbb07","code":"E75","name":"Essex Teacher Training","description":"Essex Teacher Training is a large provider, offering a variety of different school-based routes to QTS in schools across Essex and its adjoining counties. \\r\\n\\r\\nHeadteachers value the contribution trainee teachers can make to their schools. As a result, trainees enjoy their training and the vast majority gain employment in one of our partner schools, once qualified. \\r\\nAll of our tutors are experts in their field and many are still teaching, so you benefit from their knowledge and experience. We pride ourselves on the support we offer our trainees and put trainee wellbeing at the heart of what we do."}],"createdAt":"2021-07-06T17:55:37.167Z","updatedAt":"2021-12-09T17:54:49.895Z"}
