{"id":"2f568a3c-413d-4daa-b8b2-b120e3886a4c","name":"Hamwic SCITT","code":"26U","type":"scitt","isAccreditedBody":true,"ukprn":"10049721","address":{"addressLine1":"Weston Park Primary School","town":"Southampton","county":"Hants","postcode":"SO19 9HX"},"contact":{"website":"www.hamwicscitt.org","email":"info@hamwicscitt.org","telephone":"02380 786833","fullName":"Lucy Phillips"},"location":{"latitude":50.8926795,"longitude":-1.3587111},"trainWithUs":"The SCITT is an integral part of Hamwic Multi Academy Trust and we see our trainees as the future. \n\nWe are committed to support you as embark on your training so that you become exceptional teachers who are fully prepared to teach across a range of contexts. We are passionate about building the future life chances of the young people in our trust and invite you to join us on that journey. We will equip you well as you take your first steps into a successful career in teaching. We have a strong track record of recruitment into our trust schools and a close network of school leaders who support the programme.\n\nOur central training, led by experts in their fields from our in house education team and external consultants, is designed to help you engage with the latest educational thinking and practice. All that you learn, you will experience and apply in practice alongside your school based mentors. Our 60 master level PGCE provision further compliments your education studies. We can place you in schools across four local authorities, making us geographically diverse but united in ambition.\n\nOur programme includes ‘Enriched Learning Experiences’ affording you the opportunity to spend time in a variety of settings, such as our hospital school, to widen your understanding of a range of educational provisions.","trainWithDisability":"We are an inclusive provider, embracing diversity and following through fully on our commitment to equalities.\nWe welcome applications from trainees with disabilities and other specific needs. Our profile of schools are accessible and we work closely with trainees to identify reasonable adjustments to both the programme and placements where these are needed.\nWhere trainees are in receipt of DSA, we meet with them early in the programme to review their needs, liaising with university providers, placements leaders, mentors and tutors to ensure the programme works for them and supports them effectively.\nThe well being of our trainees is hugely important. We have prioritised access to our central trust wellbeing packages. This includes access to 24 hour counselling services and packages such as Headspace. Our university provider also provides full access to their student wellbeing and counselling services. Each trainee is looked after by school based mentors and are assigned a link tutor. This support is overseen by a lead tutor who quality assures this support.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:54:48.832Z","updatedAt":"2021-09-17T20:05:20.343Z"}
