{"id":"30194b6f-5252-4ab3-a6d5-55e92730bc62","name":"Welford-on-Avon Primary School","code":"2L6","type":"lead_school","isAccreditedBody":false,"urn":"125528","ukprn":"10078076","address":{"addressLine1":"Welford on Avon Primary School","addressLine2":"Welford-on-Avon","town":"Stratford-upon-Avon","county":"Warwickshire","postcode":"CV37 8ER"},"contact":{"website":"https://welfordonavonschool.co.uk","email":"head2058@welearn365.com","telephone":"1789750214","fullName":"Head of Admissions"},"location":{"latitude":52.165954,"longitude":-1.7879933},"trainWithUs":"The Arden Forest School Direct programme is led by Welford-on-Avon Primary School in partnership with a group of local primary schools and the University of Worcester.\nWelford on Avon Primary School will be providing school based initial teacher training from September 2022, both at Welford and in other highly rated local primary schools. Welford on Avon Primary School is a highly successful primary school with a strong track record for supporting initial teacher training. Through our programme we can offer students:\n* A supportive atmosphere in which to learn and develop as a teacher\n* Experienced mentors who have delivered the School Direct programme previously\n* Opportunities to work in a small network of local schools\n* A structured and supportive programme of school based training\n* Opportunities to observe, work alongside and be part of our outstanding teaching team * Personal, academic and pastoral support","trainWithDisability":"The Arden Forest School Direct programme is committed to supporting students with disabilities and additional needs and is a fully inclusive course.\nWe are happy to discuss access arrangements as needed with potential applicants.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"6019b3ce-f2f6-4b0e-b2a9-5813d74c4d54","code":"W80","name":"University of Worcester","description":"Our accredited partner, the University of Worcester, offer an immersive and inspiring, school-centred training route into teaching.\\r\\n\\r\\nAt Worcester the PGCE: School Direct Primary is tailored to your needs - building on your existing strengths and expertise. Our course is inclusive and innovative in its design and delivery, and places you at the heart of a thriving school community.\\r\\n\\r\\n\\r\\n*Full immersion in the daily life of a school \\r\\n*Breadth and depth of experience across a range of schools\\r\\n*Outstanding additional opportunities for enrichment and extension\\r\\n*A dynamic taught programme, \\r\\n*Unparalleled personal and academic support throughout the programme and beyond"}],"createdAt":"2021-07-06T17:56:16.668Z","updatedAt":"2021-10-05T20:09:08.542Z"}
