{"id":"30330059-c616-423e-9e2d-ef07d44e1724","name":"Bristol Early Years Teaching Consortium","code":"1LF","type":"lead_school","isAccreditedBody":false,"address":{"addressLine1":"Little Bishop Street","addressLine2":"St Pauls","town":"Bristol","county":"Bristol","postcode":"BS2 9JF"},"contact":{"website":"http://www.stpaulschildrenscentre.co.uk","email":"Cate.peel@bristol-schools.uk","telephone":"07880 465793","fullName":"Eva Gossan or Sophie Nicholls"},"location":{"latitude":51.4627174,"longitude":-2.5846946},"trainWithUs":"The Bristol Early Years Teaching School Alliance (BEYTSA) is a Teaching School led by St Pauls Nursery School and Children’s Centre. We are an outstanding centre and specialise in high quality Early Years Education from 3-5 years.\nPlease visit our website to find out more about our inspiring learning community at St Pauls Nursery School and Children’s Centre.\nhttp://www.stpaulschildrenscentre.co.uk\nwww.beytc.co.uk\n* We are proud of the fact that we are one of the few Teaching Schools specialising in Early Years. We have a well-established track record in Initial Teacher Education (ITT) with high levels of success in recruitment and retention. * The Head Teacher and the Teaching School Lead is a National Leader in Education (NLE). The Teaching School provides high-quality courses for leaders, teachers/practitioners, and parents/carers that has a lasting impact on raising achievement in Bristol and beyond. All courses are facilitated by Specialist Leaders of Education (SLE's) and Lead Teachers.\n* We hold the learner firmly at the heart of all our teaching, provide challenges to reflect on and develop emotionally and culturally intelligent leaders at all levels as well as having great expertise in closing the gap in outcomes and achievement for both children and families. * We work in collaboration with Cabot Learning Federation (CLF) who are the accrediting body who award the QTS and The University of the West of England (UWE) who award the PGCE element of the course. Our work together has unequivocal high standards and builds on active research and evidence-based practice.","trainWithDisability":"We understand that everyone is unique and we are committed to providing a course that is accessible to all and ensure that we adapt our provision accordingly.\nWe work in close partnership with the Accessibility and Disability Adviser and you will be able to access support from your employing school, as a member of their staff. We can direct you to appropriate support services. We have an understanding of different learning needs and have a flexible and inclusive approach. We believe that well-being and a good level of mental health is at the heart of successful learning and therefore offer a high level of care and professional support throughout this intensive year. Your School Mentor and Professional Tutor are there to get to know you, your individual needs and offer additional support and strategies to help you along your individual learning journey to achieve your goal.\nWe are committed to supporting students who are working with Dyslexia and related learning needs, refining our approaches to suit individual people. This has resulted in highly creative, talented students, completing the course at a high standard and securing teaching posts. We have accommodated students with physical disabilities, through careful consideration of suitable placements and working with appropriate agencies.","accreditedBodies":[{"id":"4a3dc1e3-2ee8-496d-85d1-b5d9f9eae94f","code":"B20","name":"Bath Spa University","description":""},{"id":"e1473ef6-b29f-4e0b-adff-558ab367008a","code":"2AV","name":"Cabot Learning Federation SCITT","description":"\\r\\nWe work in collaboration with Cabot Learning Federation (CLF), who are a well-established Bristol-based Primary and Secondary School Centred Initial Teacher Training (SCITT). \\r\\n\\r\\nThe SCITT is in its fifth year as an accredited QTS provider, building on a successful track record of delivering the School Direct Teacher Training route since 2012 with Partner Provider and Sponsor UWE. \\r\\n\\r\\nThe CLF is committed to training and developing the future teaching workforce through designing and supporting innovative school-led programmes and ensuring that there is a supply of excellent teachers for schools, children and young people across Bristol and beyond."},{"id":"9aa67012-b776-4027-89f4-5531efb3a9d2","code":"G50","name":"University of Gloucestershire","description":""},{"id":"da8e5252-e14a-470a-8247-00b835a79010","code":"B80","name":"University of the West of England, Bristol","description":""}],"createdAt":"2021-07-06T17:48:48.664Z","updatedAt":"2021-07-06T17:48:48.664Z"}
