{"id":"3040a229-0a4e-4b8f-a4eb-5afb6aca3f50","name":"East Lancashire Inclusion Partnership","code":"1NP","type":"lead_school","isAccreditedBody":false,"urn":"143879","ukprn":"10062373","address":{"addressLine1":"Tor View School - Ewood Campus","addressLine2":"Clod Lane","town":"Haslingden","county":"Lancashire","postcode":"BB4 6LR"},"contact":{"website":"https://torview.org/educational-excellence/initial-teacher-training","email":"teachingschool@theviewtrust.org","telephone":"01706 214640","fullName":"East Lancashire Inclusion Partnership"},"location":{"latitude":53.6905049,"longitude":-2.3124425},"trainWithUs":"We are an Initial Teaching Training provider, part of PLSCITT, based in East Lancashire, formed from a collaboration between mainstream primary, secondary and specialist schools and further and higher education providers and led by Tor View Specialist Learning Community, a four time Outstanding Special School.\nWhy train to teach with us?\n\"The impressive network of supporting schools in the local area assured me that wherever I was placed - I'd have a great chance to learn and succeed. \" J Wilson (2017/18)\n*100% of student teachers who completed their training with us moved into a teaching position by the following term\n*Flexibility to follow mainstream or SEND route, with the option to mix elements or completely change *A wide range of optional units available in addition to core elements, ensuring our students are better equipped to face the challenges ahead\n*All lectures delivered at Tor View by specialist subject leaders\n*A network of well trained, supportive Mentors *Close to the M65 / M66 and accessible by public transport from Burnley, Blackburn, Manchester, Bury\n*Nurturing, supportive environment where you feel motivated to succeed.\n\"The support offered to me throughout my year of study was essential to my success on the course. Your course mentors are readily available to help you in any way - no matter or big or small. As well as this, the mentor meeting following each placement was very handy for steering you in the right direction regarding your progress and future targets.\" S O'Regan (2017/18)\nTwitter: @teach_with_ELIP","trainWithDisability":"At the heart of ELIP is a specialist learning community. Our expert practitioners assist local primary and secondary schools to support pupils with a wide range of disabilities and special educational needs. This extends to our student teachers, who we work very closely with to enable them to succeed.\nAs a special school, the Equality Act 2010 & SEN Disability Act 2001 are very important to us. Our training facility is fully accessible for wheelchair users, and we have access to in-house Hearing and Visual Impairment Specialists who would be able to provide a detailed report to assist us with making the necessary adjustments to meet an individual's needs.\nWe have experience of supporting students with Dyslexia. Two of our Specialist Teachers and course lecturers are both accredited Dyslexia Specialists. We are able to work with students on access arrangements for skills testing and assignments, in addition to ensuring that they have the tools they need to achieve.\nAll student teachers are assigned a personal tutor. If you are experiencing any mental health problems, we would advise you to discuss this with your personal tutor so that the correct support can be arranged. If you feel that you may require additional support, or need help with access arrangements, then please do get in touch to discuss your individual requirements and find out how we can work together. Of course, applicants are under no obligation to disclose, however, we cannot support individual needs if we are not aware of them.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"76c55af9-5232-41bd-a308-9fc5a4270cdd","code":"P38","name":"Pennine Lancashire SCITT","description":"The Pennine Lancashire SCITT is an Initial Teacher Training provider run by four East Lancashire Schools: The Hollins, Marsden Heights, Ribblesdale and Tor View giving graduates the opportunity to receive practical teacher training and to learn ‘on the job’. All our programmes also lead to trainees gaining a PgCE.\\r\\n\\r\\nFor more information please go to:\\r\\n\\r\\nhttps://plscitt.org.uk/"}],"createdAt":"2021-07-06T17:55:57.184Z","updatedAt":"2021-10-05T17:14:50.985Z"}
