{"id":"306730ad-fed0-4719-8598-b6f6a996d04c","name":"Torfield School","code":"1YE","type":"lead_school","isAccreditedBody":false,"urn":"141476","ukprn":"10047137","address":{"addressLine1":"Croft Road","town":"Hastings","county":"East Sussex","postcode":"TN34 3JT"},"contact":{"website":"http://www.torfield-saxonmount.com","email":"head@tasmat.org.uk","telephone":"01424 428228","fullName":"R Preece"},"location":{"latitude":50.8620529,"longitude":0.5936579},"trainWithUs":"If you are applying to become a teacher and you are particularly interested in working with pupils who have Special Educational Needs and Disabilities (SEND), then training with us is an excellent choice. Our School Direct route is delivered in partnership with the University of Brighton, providing high quality experiences. Torfield and Saxon Mount School, The Lindfield School, New Horizons School and South Downs School offer opportunities to complete PGCEs, preparing candidates to teach in mainstream and SEND settings. Torfield and South Downs offer Primary placements; Saxon Mount offers Secondary English, Secondary Maths and Secondary Biology; New Horizons offers Secondary English and Secondary Maths; The Lindfield offers Secondary Maths and Secondary Biology. The taught elements are delivered by the University of Brighton. Two of the three teaching placements are facilitated in the host school. A third placement occurs in a contrasting (mainstream) school. Torfield is a 4-11 special school in Hastings. Saxon Mount is an 11-16 special school in St Leonards. Torfield was judged 'Outstanding' (Ofsted, September 2017) and Saxon Mount was judged ‘Good with Outstanding features’ (November 2017). More information can be found at: www.torfield-saxonmount.com. Lindfield is a 11-16 special school in Eastbourne, judged 'Outstanding' at its last inspection. South Downs School is a 4-11 special school in Eastbourne, judged 'Outstanding' at its last inspection. More information can be found at: www.southdowns-lindfield.com. New Horizons is a 9-16 special school in St Leonards, judged 'Outstanding' at its last inspection. More information can be found here: www.sabden.org.uk.","trainWithDisability":"Please see the Federation Equalities Statement on our website. www.torfield-saxonmount.com.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"d2ba71f2-c125-4d86-bb22-736e67043120","code":"B72","name":"University of Brighton","description":""}],"createdAt":"2021-07-06T17:55:02.760Z","updatedAt":"2021-08-04T14:55:02.660Z"}
