{"id":"30bda414-7b00-426c-956b-18a187efe967","name":"London Metropolitan University","code":"L68","type":"hei","isAccreditedBody":true,"urn":"133816","ukprn":"10004048","address":{"addressLine1":"London Metropolitan University","addressLine2":"Admissions Office","town":"166-220 Holloway Road","county":"London","postcode":"N7 8DB"},"contact":{"website":"https://www.londonmet.ac.uk/applying/postgraduate/teacher-training-ite/","email":"courseenquiries@londonmet.ac.uk","telephone":"020 7133 4202","fullName":"Admin"},"location":{"latitude":51.5516422,"longitude":-0.1105435},"trainWithUs":"London Met provides an excellent platform to develop your career as a teacher. We offer innovative, inspiring courses delivered by knowledgeable industry professionals, with employment and completion rates well above the national average. Many students are offered employment in their placement schools.\nOur recent Ofsted report (2016) acknowledged the \"inclusive, welcoming and open ethos\", and said that the \"culture created by leaders combined with the tailored and personalised, pastoral support that trainees receive enables them to successfully complete their training and confidently go on to gain employment.\" We offer a range of PGCE subjects at Primary and Secondary levels. We have also teamed up with partner schools and teaching school alliances across London and beyond to offer PGCE School Direct places and the employment-based Teacher Apprenticeships.\nExisting teachers with sufficient experience and support in their current school may consider the Assessment Only route to QTS. Read further details on all these options on the [https://www.londonmet.ac.uk/applying/postgraduate/teacher-training-ite/](London Met website.)\nUniversity sessions are taught on our Holloway Road campus, which is easily accessible, with excellent public transport links. “The strong moral imperative, instilled by leaders with passion in their work, permeates all aspects of the partnership. Leaders attract local trainees, who in turn work and learn within the locality, and act as strong role models for the children and young people they teach.”\nOfsted 2016","trainWithDisability":"We aim to be inclusive in our practice and welcome applications from everyone. We can offer support both at interview stage and once students have enrolled. London Met has a dedicated service to support students with disabilities, long-term medical or mental health conditions or Specific Learning Difficulties (SpLDs) such as dyslexia.\nFollow the link to our [https://www.londonmet.ac.uk/services-and-facilities/disability-support/](DDS Service) to find out more.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:51:15.330Z","updatedAt":"2021-07-21T17:52:13.520Z"}
