{"id":"3117eaa6-b483-49de-92a2-ee4ead1b0903","name":"University of York","code":"Y50","type":"hei","isAccreditedBody":true,"ukprn":"10007167","address":{"addressLine1":"University of York","addressLine2":"Department of Education","town":"York","county":"North Yorkshire","postcode":"YO10 5DD"},"contact":{"website":"https://www.york.ac.uk/education/pgce/","email":"education-pgce-admissions@york.ac.uk","telephone":"01904 323576","fullName":"Student Recruitment and Admissions"},"location":{"latitude":53.948561,"longitude":-1.053931},"trainWithUs":"\"Studying at York means you'll graduate with more than a qualification.\n\nYou'll be immersed in knowledge and opportunities that will encourage you to grow and succeed. You’ll be encouraged to think differently and benefit from outstanding teaching and learning outcomes (as demonstrated by our Gold Teaching Excellence Framework award).\n\nThe PGCE programme provided by the University of York are delivered by a friendly team of tutors who are passionate about both their subject areas and teaching. We pride ourselves on the supportive and approachable learning environment we provide to our teacher trainees and the positive feedback we receive about students' learning experience. \n\nIn its most recent evaluation, the Office for Standards in Education (Ofsted) awarded our PGCE programme a Grade 2: Good.\"","trainWithDisability":"\"The University of York actively promotes inclusivity and we have a dedicated team who can advise and support students with a disability or long-term health condition. If you disclose any individual requirements to us, we will do our utmost to ensure that all reasonable adjustments are made so you can feel supported and able to fully engage with your PGCE course.\n\nExamples of how we can offer support include:\n\n- working with you to find suitable school placements\n- ensuring that you have a 'Student Support Plan' in place, if necessary, which will include any assessment requirements you may have (e.g. extra time in examinations)\n- providing learning materials and resources in accessible formats\n- signposting to specialist colleagues who can advise about funding support for students with a disability\n\nThe Department of Education is an open and friendly department and we provide support to all students studying with us. If you have any queries or concerns about accessibility before you start the programme or when enrolled, we encourage you to get in contact and we will be happy to assist you.\"","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"createdAt":"2021-07-06T17:54:02.621Z","updatedAt":"2021-08-17T17:16:17.702Z"}
