{"id":"3188762f-4fac-46f3-b660-49507ccaa225","name":"InMAT Northamptonshire","code":"1YY","type":"lead_school","isAccreditedBody":false,"address":{"addressLine1":"Unit 2","addressLine2":"Swan Court","town":"Lamport","county":"Northamptonshire","postcode":"NN6 9ER"},"contact":{"website":"http://www.inmat.org.uk","email":"sally.hamson@inmat.org.uk","telephone":"01604 434600","fullName":"Ali Buttress"},"location":{"latitude":52.3629651,"longitude":-0.8923684},"trainWithUs":"* A contemporary setting\n* Resources and future focused approaches for 21 century learners\n* Teacher researcher skills integrated into all aspect of your training\n* A learning experience for you which models ways that you can teach\n* Support for your wellbeing and resilience for teaching\n* As well as QTS we also include PGCE\nTraining through 'InMAT' provides you with the opportunity to join a growing network of schools committed to providing excellence for 21st century learners. Innovative practice is at the heart of our work and research and development is a key feature of our practice. Working with a family of primary schools stretching across Northamptonshire means that you can make choices about the kind of school that you would like to learn in.\nJoining the InMAT network, who partner with the University of Northampton, you will study in a brand new, contemporary setting. You will achieve an internationally recognised qualification. You can also elect to complete credits towards a Masters Degree.\nAs your personal wellbeing is of the upmost importance to us, we provide you with intensive support, and professional enrichment, for the duration of your training.","trainWithDisability":"Support is offered for applicants with a declared need. Our partner, The University of Northampton, hosts individual meeting with trainees throughout the year. These meetings are facilitated by the Head of Initial Teacher Training and the Programme Leader to discuss needs and to signpost support. Through 'InMAT', you will have access to experienced mentors. Our previous students speak very highly of the support that we offer to safeguard their wellbeing and mental health. We have always guided any student who initially found their training year challenging so that they were able to complete the course.","accreditedBodies":[],"createdAt":"2021-07-06T17:53:02.196Z","updatedAt":"2021-07-06T17:53:02.196Z"}