{"id":"31a50c17-1b5d-492f-8047-8524ea607889","name":"Wensum Junior Partnership","code":"8H6","type":"lead_school","isAccreditedBody":false,"urn":"70287","ukprn":"10004772","address":{"addressLine1":"Norfolk Teacher Training Centre","addressLine2":"City College Norwich, Ipswich Road","town":"Norwich","county":"Norfolk","postcode":"NR2 2LJ"},"contact":{"website":"www.norfolkttc.ac.uk","email":"EnquiriesNTTC@ccn.ac.uk","telephone":"01603 773708","fullName":"Paul McCann"},"location":{"latitude":52.6178124,"longitude":1.2871217},"trainWithUs":"Wensum Junior School works in partnership with the Norfolk Teacher Training Centre (NTTC), who provide all the training courses, based at City College Norwich. Working closely with our partner schools across the region, NTTC offers age 3 to 11 & 11to 18 experience across a broad range of schools. NTTC provide a tailor-made route into teaching with our school based programme. The professional development programme follows a curriculum which links cohesively with the new ECF, preparing trainees for the start of their career. Our well qualified mentors are at the heart of our programmes, offering the opportunity to develop curriculum knowledge alongside engaging classroom activities. Wensum Junior School offers its wide range of specialisms within Primary to contribute to the training programme and supporting trainees, completing the School Direct programmes, on placements.\nWe offer 4 routes to QTS, Primary Teaching Apprenticeships, Primary with Mathematics Apprenticeship, Primary with Mathematics School Direct (fee-funded) and Primary School Direct (fee-funded).\nWe also offer Secondary Apprenticeship courses for those wishing to study for QTS through the Teacher Apprenticeship and already have an employer.","trainWithDisability":"Working with City College Norwich we are able to work closely with all our learners to ensure that all needs are supported in an atmosphere of inclusivity. If you have any special needs, please talk to us in confidence during your interview and we will ensure that the most appropriate and individualised learning plan is put in place.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"1f91f989-047b-4bbc-a73e-d45ffcfc1f28","code":"N43","name":"Norfolk Teacher Training Centre","description":"Our core values:\\r\\nInclusivity \\r\\nAn unwavering belief in all trainee’s potential \\r\\nA passion for excellence \\r\\nPersonal responsibility/commitment/integrity \\r\\nTrust and Respect for others \\r\\nAll stakeholders are critical to the process \\r\\n\\r\\nWorking with our partnership schools you will gain the knowledge, skills and professional behaviours to ensure you become a confident member of the teaching profession and have a positive impact on the life chances of the children you teach."}],"createdAt":"2021-07-06T17:46:37.373Z","updatedAt":"2021-09-16T15:25:39.125Z"}
