{"id":"31e61b7a-48ec-44ac-80d8-519d16b51c63","name":"Castleman Learning Network","code":"1RP","type":"lead_school","isAccreditedBody":false,"urn":"141258","ukprn":"10047154","address":{"addressLine1":"Broadstone Middle School","addressLine2":"Dunyeats Road","town":"Broadstone","county":"Dorset","postcode":"BH18 8AE"},"contact":{"website":"www.castlemanlearning.co.uk","email":"info@castlemanlearning.co.uk","telephone":"1202604063","fullName":"Aimee Lancaster"},"location":{"latitude":50.7647701,"longitude":-1.9848215},"trainWithUs":"At Castleman Learning we are committed to engaging high quality, enthusiastic, motivated people in the teaching profession. We work in close partnership with The Learning Institute as well as a rich cross-section of local schools, to offer our successful primary teacher training. The breadth and strength of our partnerships allows us to bring together expertise from across our locality to provide the highest quality taught sessions and placements.\nOur 3 - 11 years School Direct programme is school-based and our partner schools welcome our trainees into their placements from the very beginning of the academic year. We believe that the best way to experience all aspects of school life is to learn alongside leading, experienced professionals. Trainees are supported by school-based mentors and our experienced visiting tutor team. School-based learning is supported by regular taught sessions to help develop teaching skills with greater depth and understanding. Our taught sessions are led by a variety of experienced, specialist school colleagues.\nAt Castleman Learning Network, we pride ourselves in supporting our trainees as individuals and with an understanding that trainees come into teaching with a range of experiences and strengths. We are keen to enable bespoke learning opportunities that prepare out trainees for the career ahead of them. Find out more information: www.castlemanlearning.co.uk","trainWithDisability":"We are a fully inclusive training organisation. At Castleman Learning Network trainees will have support from your academic tutors, visiting tutors and from a range of support services:\n\n- support for students who have a disability, medical condition or Specific Learning Difficulty (SpLD) e.g. dyslexia\n- support for students with English as an Additional Language (EAL)\n- support relating to mental health liaising with Course Representatives\nadvice relating to maternity leave\n\nPlease refer to our policies at (www.learninginstitute.co.uk).","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:51:50.150Z","updatedAt":"2021-10-06T17:45:12.011Z"}
