{"id":"32933a3d-8739-4300-a46a-06453f97ff3f","name":"Bristol Primary Training and Support Alliance (Whitehall Primary/Ashley Down Primary)","code":"1PL","type":"lead_school","isAccreditedBody":false,"urn":"108910","ukprn":"10069017","address":{"addressLine1":"Bridge Farm Primary School","addressLine2":"East Dundry Road","town":"Bristol","postcode":"BS14 0LL"},"contact":{"website":"http://bptsa.org","email":"mark.townsend@bristol-schools.uk","telephone":"7557003679","fullName":"Mark Townsend"},"location":{"latitude":51.4642539,"longitude":-2.5544646},"trainWithUs":"We have a well-established track record in ITT as part of our overall staff development, leadership and succession planning work. The Training & Support Alliance is made up from the three primary schools in the city, each with outstanding reputations for excellence. These are Whitehall Primary School in Easton, Bridge Farm Primary School in Whitchurch & the Ashley Down Schools' Federation. Two of the head teachers are designated as National Leaders of Education (NLEs) who support other schools across the city and beyond. The Training & Support Alliance has a strong reputation and proven track record of delivering training to leaders, leadership teams, teachers and trainees, which makes a lasting difference to teaching, leadership and classroom practice. We have links with more than 80 of Bristol's primary schools and work closely with many schools and head teachers in the city.\nIn 2021 - 2022 we are training 26 teachers of the future through the School Direct PGCE route in schools across the city. We work hard to ensure that your training year works for you, and pride ourselves on working closely with every trainee, mentor and school. We offer a unique and high-quality learning experience to prepare you fully for your future career in teaching. We have an invested interest in ‘growing our own’ teachers, spotting talent and raw potential in local schools, and our communities, then coaching and nurturing trainee teachers towards employment in local schools as excellent practitioners.\nFor more information, please visit our website (https://bptsa.org/)","trainWithDisability":"Disability Access\n\nAll schools and the university have disabled access. For information on any other needs, please contact a member of the BPTSA team through our main email address BPTSA@bristol-schools.uk","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"e1473ef6-b29f-4e0b-adff-558ab367008a","code":"2AV","name":"Cabot Learning Federation SCITT","description":""},{"id":"da8e5252-e14a-470a-8247-00b835a79010","code":"B80","name":"University of the West of England, Bristol","description":"The School Direct (PGCE) route blends a traditional university PGCE with school-based learning across our partner schools and support/training through BPTSA. You can access the expertise of your placement schools/class mentors/university tutor/BPTSA’s ITT lead and SLEs from across the city. (Normal tuition fees apply-not a salaried route.)\\r\\n\\r\\nBPTSA works collaboratively with UWE, making this a very successful route into teaching. Assignments are part of this course.\\r\\n\\r\\nOur sessions are in small groups run by educators at the cutting edge of practice. We will organise your placements alongside you, and you will receive a high level of support from us throughout."}],"createdAt":"2021-07-06T17:53:57.487Z","updatedAt":"2021-09-14T20:29:25.948Z"}
