{"id":"32b15728-ff86-47d8-916c-aa264708f77f","name":"Pennine Teaching Alliance","code":"2FK","type":"lead_school","isAccreditedBody":false,"address":{"addressLine1":"Colne Park High School","addressLine2":"Venables Avenue","town":"Colne","county":"Lancashire","postcode":"BB8 7DP"},"contact":{"website":"https://www.park-high.co.uk/page/?title=Pennine+Teaching+Alliance&pid=37","email":"info@pennineteachingalliance.co.uk","telephone":"01282 865200","fullName":"Katie Atherton"},"location":{"latitude":53.8643845,"longitude":-2.1561502},"trainWithUs":"The Pennine Teaching Alliance is an expanding alliance situated on the border of Lancashire and Yorkshire. We are an alliance of 9 schools (1 high school and 8 primary schools) with extremely close working partnerships with secondary schools within our area. We work alongside The University of Manchester to offer our students personalised training that will equip them with the skills necessary to become an outstanding teacher.\nThe schools within our alliance have a strong track record of successfully leading teacher training and have a robust, quality assured, bespoke program for students. Feedback from students and their HEI providers has always been overwhelmingly positive with specific reference to the support provided.\nOur aim is to provide our students with the opportunities to allow the children within our local area to succeed from receiving an exceptional quality of education. Our schools share a common ethos to deliver outstanding professional development in order to produce the best possible teachers so that our children can be the best that they can be.","trainWithDisability":"The Pennine Teaching Alliance is an inclusive trust that works with all individuals to ensure that they can be the best they can possibly be. We cater for all needs ensuring equality for all. Any individual requirements can be discussed and arrangements made for successful applicants.","accreditedBodies":[{"id":"9d03acb4-95ce-41e1-8458-0b4bec147b6b","code":"M20","name":"University of Manchester","description":"Working alongside the University of Manchester, who are rated outstanding by OFSTED and who underwrite the PGCE, with QTS, qualification."}],"createdAt":"2021-07-06T17:50:17.228Z","updatedAt":"2021-07-06T17:50:17.228Z"}
