{"id":"32dccb00-6a89-4381-84b8-d8d1eec992e0","name":"East Lancashire School Direct","code":"2KB","type":"lead_school","isAccreditedBody":false,"urn":"119757","ukprn":"10017225","address":{"addressLine1":"Hollins Lane","town":"Accrington","county":"lancashire","postcode":"BB5 2QY"},"contact":{"website":"www.eastlancstsa.co.uk","email":"stubbsl@thehollins.com","telephone":"1254233500","fullName":"Admissions"},"location":{"latitude":53.7384225,"longitude":-2.3540058},"trainWithUs":"What does East lancashire School Direct have to offer to teacher trainees?\nEast Lancashire is one of the most exciting places in the UK to both train to become a teacher and to teach in. We have some of the most economically deprived areas in the UK and the opportunity to make a huge impact on the future of the young people you work with.\nWe work with secondary, primary and special schools who are working together, sharing talent, skills and experience to improve the teaching, learning, leadership and educational outcomes for young people. h the East lancashire School Direct programme you will be able to work towards a PGCE with Leeds Beckett University, and gain qualified teacher status while training in schools who thrive on developing the next generation of outstanding teachers.\nBy Joining the East lancashire programme you become part of the school community and train as a professional from day one. In partnership with the Pennine Lancashire SCITT, our programme is designed and delivered by outstanding teachers with a proven track record of developing future teachers and leaders. Many of the staff involved are themselves specialist leaders of education and are experts in their fields.","trainWithDisability":"We are able to support candidates with special needs. We can provide:\naccessible schools with ramps/lifts etc\nhearing loops\nlaptop loan for students with dyslexia\nThe Hollins are a regional hub for Leading a Mentally Healthy School (a SDSA initiative).\nPlease contact us to discuss your individual requirements","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:54:17.661Z","updatedAt":"2021-09-02T22:25:28.115Z"}
