{"id":"33025477-7e18-459b-827b-0ca924c022fa","name":"Redhill Primary Teacher Training","code":"1EY","type":"lead_school","isAccreditedBody":false,"address":{"addressLine1":"The Redhill Academy","addressLine2":"Redhill Road","town":"Arnold","county":"Nottinghamshire","postcode":"NG5 8GX"},"contact":{"website":"www.redhilltsa.org.uk","email":"RTSAenquiries@theredhillacademy.org.uk","telephone":"0115 9261481","fullName":"The Redhill Teaching School Alliance"},"location":{"latitude":53.0092294,"longitude":-1.13029},"trainWithUs":"As an outstanding teaching school, heading an alliance around 30 schools, including both Primary and secondary schools, the Redhill Teaching School Alliance offers an opportunity to work with highly experienced professionals to train to teach. As a trainee with us you will be fully integrated into the the school, in which you are placed and made to feel like a fully-fledged member of staff. You will be encouraged to engage in all aspects of school life, including being a co-tutor, attending parents' evenings, staff meetings and CPD. You will benefit from the expertise of specialist staff, mentoring and regular meetings with our ITT Co-ordinator. We have a bespoke CPD programme for alliance trainees and a large supportive cohort, who meet on a regular basis. There are regular employment opportunities across the alliance for our successful trainees and many of our graduates go on to develop rewarding careers in teaching and leadership in our own and other schools. We have a rigorous, but supportive approach, which helps trainees apply effective teaching and learning methodology to their developing practice and pride ourselves on our excellent programme of training and support.","trainWithDisability":"Nottingham Trent University has full disabled access.\nApplicants who would benefit from disabled access, or who need support with physical, hearing and visual impairments, or mental health conditions, should let us know on their application, so that they can be considered for placements at appropriate schools. The Director of Teaching School, Sally Barfoot, would be in a position to discuss this with anyone who required further information or guidance.","accreditedBodies":[{"id":"d2b7d074-fac9-42c5-a0d3-d5471b35f7d9","code":"N91","name":"Nottingham Trent University","description":"We have a strong working partnership with Nottingham Trent University, a highly successful training provider, which enables us to offer our trainees not only QTS, but also a Postgraduate Certificate in Education. We meet regularly with the team at NTU to ensure our trainees’ needs are met in terms of both the practical and academic demands of the School Direct programme."}],"createdAt":"2021-07-06T17:51:45.722Z","updatedAt":"2021-10-12T15:30:22.529Z"}