{"id":"33037eab-f75d-4350-b1e2-967c41e9d4c6","name":"Roehampton University","code":"R48","type":"hei","isAccreditedBody":true,"ukprn":"10007776","address":{"addressLine1":"Roehampton University","addressLine2":"Roehampton lane","town":"London","postcode":"SW15 5PU"},"contact":{"website":"https://www.roehampton.ac.uk/teacher-training/","email":"teachertraining@roehampton.ac.uk","telephone":"0208 392 3314","fullName":"Enquiries"},"location":{"latitude":51.4579866,"longitude":-0.2432869},"trainWithUs":"The School of Education at Roehampton is one of the principal providers of teacher training in the UK, with a partnership network of over 400 schools. We have a rich tradition of training teachers dating back to 1841, longer than any other university.\nAs a student in our School, you will enjoy high quality teaching which will equip you for a successful career with a competitive starting salary. The subject specific expertise of our tutors and the outstanding resources offered by the course will help you gain the knowledge and skills necessary to become an Early Career Teacher. 95% of students who left the course in 2020 and 2021 agreed that the course had equipped them to be a good or better teacher (Ofsted survey 2020 and 2021).\nWe are based on a beautiful parkland campus in south west London, close to Putney and Hammersmith, and just 30 minutes from the West End.","trainWithDisability":"The University of Roehampton welcomes students with disabilities and offers flexible support services tailored to your needs. Our Disability and Dyslexia Services are on the main campus, Digby Stuart, along with our Access Centre: Access@SW15.\n\nFor new students, we strongly recommend that you get in touch to let us know about your specific disability and support needs. Any information provided will be kept strictly confidential and will only be used to support you with your studies. \n\nWe recommend you inform us of your specific learning difference (SpLDs) such as Dyslexia, Dyspraxia, Dyscalculia and Attention Deficit Hyperactivity Disorder (ADHD).\n\nFor more information please see our disability services website here.\n\nhttps://www.roehampton.ac.uk/disability-services/","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"createdAt":"2021-07-06T17:50:16.652Z","updatedAt":"2021-10-01T20:55:52.080Z"}
