{"id":"334aaa65-76f2-48e6-b8a8-ebbdea6aec3d","name":"Active Teacher Training","code":"2KL","type":"lead_school","isAccreditedBody":false,"urn":"138177","ukprn":"10059514","address":{"addressLine1":"Cromwell Community College","addressLine2":"Wenny Road","town":"Chatteris","county":"Cambridgeshire","postcode":"PE16 6UU"},"contact":{"website":"http://www.cromwellcc.org.uk","email":"csears@cromwell.cambs.sch.uk","telephone":"01354 697495","fullName":"Matt Jackson - Professional Tutor"},"location":{"latitude":52.4501005,"longitude":0.0527753},"trainWithUs":"Cromwell Community College has decades of experience in teacher training. We are a Lead School at the heart of our community. We offer a unique teacher training course which will help you realise your potential as a secondary school teacher.\nTeaching is a vibrant, fast-paced and exciting career and we’d love you to train with us here at Cromwell. We have a friendly, experienced team who work with our trainees at the very start of their journey in order to ensure that our trainees get the very best teacher training around. When you make your application to train to teach through us we’ll make sure you learn with us and our partner schools in the local area. We have a dedicated and well-equipped training room specifically reserved for our trainee teachers. This provides you with a quiet and secure base where you can work, meet to exchange ideas and experiences with others or simply make a coffee and have a biscuit.\nIn addition to providing the highest standards and quality of training, Cromwell also provides all trainees with a laptop and a dedicated continuing professional development library. In addition to the Professional Studies course provided by our partners at the University of Bedfordshire, Cromwell delivers bespoke in house training from an experienced team of teachers and leaders. This rigorous and energising teacher training programme has helped us to achieve 100% employment for all Cromwell trainees in recent years.\nFor more information, reach out to us and we'll be in touch.","trainWithDisability":"We support applications from learners with a range of backgrounds and needs, including:\n•dyslexia\n•physical, hearing and visual impairments\n•mental health conditions\nPlease reach out to us if you have any questions and we'll be happy to help.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:54:48.977Z","updatedAt":"2021-10-05T15:18:59.045Z"}
