{"id":"334b16f6-a923-4db8-8f96-f174ad2696a6","name":"Harrow First","code":"214","type":"lead_school","isAccreditedBody":false,"urn":"137199","ukprn":"10034661","address":{"addressLine1":"Canons High School","addressLine2":"Shaldon Road","town":"Edgware","county":"Middlesex","postcode":"HA86AN"},"contact":{"website":"https://www.doingitwelldoingitright.co.uk","email":"SchoolDirect@canons.harrow.sch.uk","telephone":"2089515780","fullName":"Leah Macnamara"},"location":{"latitude":51.5992188,"longitude":-0.2872216},"trainWithUs":"We are looking for exceptional graduates to join us on Harrow First – a unique and challenging route into teaching, following a full-time training programme. Applicants will be passionate about education, have an excellent academic background and a deep commitment to working with young people to improve their life chances. We create an environment in which staff, pupils and trainee teachers alike feel valued and supported. All schools involved in Harrow First have extensive experience of training teachers. Trainee teachers recruited onto the Harrow First programme will be well supported and challenged to become creative, innovative and reflective practitioners. In addition there will be a strong focus on leadership development throughout the programme including opportunities to work in teams and take on various responsibilities.\nHarrow is located in North-West London with good transport links to Central London. Successful applicants will have school based training in two schools.\nPupils across the partnership are happy, friendly and well-behaved and are at the heart of everything we do. Our staff are our most valuable resource and we have a proven track record in training and professional development. Our teachers are excellent practitioners with exemplary behaviour management skills and are eager to share their skills, knowledge and practice with the next generation of teachers.","trainWithDisability":"The University of Hertfordshire has full disabled access and is committed to admitting and supporting students with disabilities. Please refer to the website for details – www.herts.ac.uk The individual host schools have differing disabled access provisions, so if in doubt please contact the host school directly.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:48:42.737Z","updatedAt":"2021-07-22T16:03:56.878Z"}
