{"id":"336869e0-6b71-46c4-80eb-8b3401070e82","name":"ConnectEd Partnership","code":"27U","type":"lead_school","isAccreditedBody":false,"urn":"143506","ukprn":"10061610","address":{"addressLine1":"ConnectEd Partnership","addressLine2":"Berrybrook Education and Business Suite","town":"Greenacres Avenue","county":"Wolverhampton","postcode":"VV10 8NZ"},"contact":{"website":"http://www.connectedpartnership.com","email":"harinder.jandu@connectedpartnership.com","telephone":"01902 290152","fullName":"Harinder Jandu"},"location":{"latitude":52.620267,"longitude":-2.096061},"trainWithUs":"ConnectEd Partnership is a unique partnership of over 100 schools, mainly based in Wolverhampton that have come together to share skills, experience and capacity to improve learning outcomes and achievements of our children and young people in their schools.(Please see ConnectEd Partnership's website for a list of partnership schools).\nConnectEd is a school direct provider who works in close strategic partnership with the University of Wolverhampton and Birmingham City University to offer primary and secondary school led programmes.\nSuccessful primary students will carry out their placements in partnership schools that have the capacity,expertise and proven track record in training students to become effective teachers.\nConnectEd's secondary school direct programme is currently a partnership between Highfields Secondary School, Aldersley High School and the University of Wolverhampton. Due to the extensive nature of our partnership, ConnectEd can offer a wide range and breadth of experience to ITT students. For example our Special schools will offer support and training to trainees wishing to specialise in working with children and young people with Special Education and Disabilities. Gaining school experience can make a valuable contribution to your application process. Connected offer structured pre - placement experience work experience days to prospective applicants that will take place in one or more of our partnership schools. Completing a 5 day 'Passport to Teaching Programme' can guarantee you an interview on the School Direct Programme.\nVisit ConnectEd Partnership's website for further details and information.","trainWithDisability":"ConnectEd's School Direct Route is fully accessible to all and will make reasonable adjustments where required.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"62d5803b-89ca-4e21-bb6f-5c74944c56ad","code":"B25","name":"Birmingham City University","description":""},{"id":"4da5abb2-b287-451e-8d75-c5b79e11c2bb","code":"W75","name":"University of Wolverhampton","description":""}],"createdAt":"2021-07-06T17:55:57.424Z","updatedAt":"2021-09-23T20:08:16.349Z"}
