{"id":"33bbde51-c9e1-4203-9682-b04ade9740e6","name":"Growing Expert Teachers","code":"2AO","type":"lead_school","isAccreditedBody":false,"urn":"109108","ukprn":"10005959","address":{"addressLine1":"Golden Valley Primary School","addressLine2":"Nailsea Park","town":"Nailsea","county":"North Somerset","postcode":"BS48 1BB"},"contact":{"website":"http://www.goldenvalleyschool.co.uk","email":"kevin.lynch@goldenvalleyschool.co.uk","telephone":"01275 853077","fullName":"Kevin Lynch"},"location":{"latitude":51.4320864,"longitude":-2.7502474},"trainWithUs":"The 'Growing Expert Teachers' School Direct Consortium is a group of primary schools across North Somerset, led by Golden Valley Primary School, Nailsea. It provides high quality, school-based experience and training in partnership with Somerset SCITT. The course will provide Qualified Teacher Status (QTS) and a Post Graduate Certificate in Education (PGCE). The School Direct Consortium aims to create a pathway of the highest quality training and possible succession opportunities for trainees within its partner schools. The School Direct training programme is for high quality graduates who want to train as part of a school team from day one. We offer placements across the Early Years and Primary phase from Nursery to Year 6. In addition, applicants with an interest in training within a Special School setting may be able to do so from September 2022.\nOur pupils are happy, enthusiastic and reflective learners who are at the heart of everything we do. Many pupils out-perform their peers nationally and make significantly more progress; pupils' attainment at the end of the FS and Key Stages 1 and 2 are above national averages. Our teachers are excellent practitioners who are eager to share their skills, knowledge and practice with the next generation of teachers. The schools have a history of collaborative team work, working together on areas such as Curriculum Design, assessment and English and form a strong and supportive partnership. Full details can be found on the Golden Valley Primary School (Nailsea) website.","trainWithDisability":"The 'Growing Expert Teachers' School Direct Programme is inclusive and welcomes applications from potential trainees who may have a disability or other need. \n\nA previous dyslexic trainee was given additional support and had certain allowances made, for example, extensions to assignment deadlines. She was the first of her cohort of trainees to secure a permanent position!\n\nIf successfully recruited to the programme, candidates with physical, hearing and visual impairments will be placed in appropriate settings for their placements. \n\nCandidates with any specific need that is declared will be offered appropriate support within the resources available at school level or via the ITT partner.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"be897ea1-5b41-4b40-8eaf-877a15ad688b","code":"S31","name":"Somerset SCITT Consortium","description":"Somerset SCITT’s partnership with the University of Worcester has grown and developed since 1997, providing high quality, local teacher training to benefit the education of young people across the Southwest.\\r\\n\\r\\nIn 2017 Somerset SCITT was awarded Ofsted ‘Outstanding’ (in all areas).\\r\\n\\r\\nOur ethos is:\\r\\n\\r\\n*To contribute to the quality and status of the teaching profession by training effective teachers.\\r\\n\\r\\n*To encourage trainees to explore their training as a basis for their continuing professional development.\\r\\n\\r\\n*To help Trainees become familiar with a range of professional and educational issues by applying their growing knowledge and skills in a practical and supportive environment."}],"createdAt":"2021-07-06T17:48:17.642Z","updatedAt":"2021-11-17T17:12:26.487Z"}
