{"id":"33e4aacf-99cb-48e6-aea4-b82ecbc6b828","name":"Green Park Primary School","code":"2F6","type":"lead_school","isAccreditedBody":false,"urn":"104884","ukprn":"10070130","address":{"addressLine1":"Green Park Primary School","addressLine2":"Green Lane","town":"Maghull","postcode":"L31 8BW"},"contact":{"website":"https://amp-scitt.lydiatelearningtrust.co.uk/","email":"teachertraining@deyeshigh.co.uk","telephone":"0151 526 3814","fullName":"Pauline Treanor"},"location":{"latitude":53.5190823,"longitude":-2.9537835},"trainWithUs":"Green Park Primary School is a lead school for The Associated Merseyside Partnership SCITT (AMP). We offer a range of primary programmes with our schools guiding many successful trainees into the teaching profession and we have a passion for developing future leaders of education.\nOur course is led by experienced practicing teachers who ensure your learning is completely focused on working with and in schools. We have an excellent training and employment record. End of course evaluations also show our trainees are highly confident and feel that we have prepared them well for their future careers. The wide variety of primary and secondary schools we work with is a major strength of the partnership. We can offer trainees a teaching experience in mixed comprehensives or a single sex school, age ranges from 3-18, faith schools and Academies. In short AMP SCITT has friendly, well equipped schools that offer a wide range of personalised educational experiences. We understand the needs of Initial Teacher Training and ensure a successful transition to NQT year by creating a supportive community network. Links to all the partner schools can be found on our website.\nOur trainees graduate with a PGCE with QTS including 60 credits at Post Graduate level towards a Masters degree through Liverpool Hope University.\nTo access our website, [please click here](http://amp-scitt.lydiatelearningtrust.co.uk )","trainWithDisability":"We endeavour to ensure equality of training and teaching opportunity across our diverse trainee teacher community. AMP SCITT will take reasonable steps to ensure that the general need for access and the specific requirements of individuals with additional support needs are addressed. Our team works with disabled students in order to minimise any potential disadvantage they may face because of their condition. Mental health and well-being\nAdjusting to a new role can be difficult for some. Stress factors such as moving away from home, academic demands and financial worries can all impact on trainees’ mental well-being. We provide support for anyone who is experiencing any form of mental health difficulty. Counselling\nWe provide access to a professional and confidential student counselling service to help you with any personal issues that may be affecting your studies, self-esteem, relationships, emotional or general feelings of well-being. Disability access\nApplicants who would benefit from disabled access should let us know on their UCAS application so that they can be considered for placements at the most appropriate schools.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"8796f284-20bb-4ad7-a6e6-cd40fc05fb2d","code":"25F","name":"Associated Merseyside Partnership SCITT","description":"Associated Merseyside Partnership SCITT (AMP SCITT) is part of Lydiate Learning Trust (LLT). AMP SCITT has a proven track record in successfully training high quality teachers that go on to become valued employees of local schools. \\r\\nOur training curriculum is developed and delivered by current, practising teachers and informed by the latest educational research. \\r\\nOur success has been recognised by the National Association of School Based Teacher Training (NASBTT) and OFSTED. \\r\\nWe have a strong partnership with Liverpool Hope University, who deliver the PGCE element of our programme."}],"createdAt":"2021-07-06T17:56:51.514Z","updatedAt":"2021-09-20T20:56:57.079Z"}
