{"id":"3472d0f7-5914-495d-b643-bdfa1b298dac","name":"Merton Special Training Association","code":"163","type":"lead_school","isAccreditedBody":false,"urn":"102698","ukprn":"10017617","address":{"addressLine1":"Perseid School","addressLine2":"Middleton Road","town":"Morden","county":"Surrey","postcode":"SM4 6RU"},"contact":{"website":"mertonspecialtrainingassociation.org.uk","email":"msta@perseid.merton.sch.uk","telephone":"2086489737","fullName":"Headteacher"},"location":{"latitude":51.3906998,"longitude":-0.1960733},"trainWithUs":"MSTA works collaboratively with partners within Merton and beyond in order to bring about the best possible outcomes for pupils in our schools, especially those with special or additional needs. MSTA is led by two Merton (special) schools, Perseid and Cricket Green, along with (mainstream) primary schools Bishop Gilpin, Melbury College and the Smart Centre (special) and one (mainstream) high school, Ricards Lodge, in collaboration with Merton Local Authority. This complement provides a unique context for our Teaching School, led as it is by special schools working in close partnership with mainstream colleagues to ensure that our offer meets local need.\nMSTA offers trainees access to outstanding schools and outstanding teachers within our network, providing experience in local mainstream primary and specialist settings across Merton. A range of high quality professional development opportunities are available via this training route enabling trainees to fulfil their teaching and learning potential with us.\n100% of MSTA ITT trainees who completed School Direct from 19-20 secured employment for 2020. For further information, please visit our website https://www.mertonspecialteachingalliance.org.uk/Initial-Teacher-Training-ITT/","trainWithDisability":"MSTA welcomes applications from candidates with disabilities and other additional needs. We will work with candidates individually to accommodate their needs.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"3c17f1f1-e695-473f-8836-57997d910e5b","code":"L75","name":"London South Bank University","description":"https://www.lsbu.ac.uk/study/course-finder/school-direct"},{"id":"252d7e03-741e-4453-b6a8-3d361e6c9d1b","code":"E69","name":"e-Qualitas","description":"https://www.e-qualitas.co.uk/for-schools/training-routes/teaching-apprenticeships/"}],"createdAt":"2021-07-06T17:54:44.794Z","updatedAt":"2021-10-22T20:56:24.754Z"}
