{"id":"34da1f57-8568-4212-8e49-d45d4d26e35f","name":"St. James’s School Direct Partnership","code":"18J","type":"lead_school","isAccreditedBody":false,"urn":"144046","ukprn":"10064724","address":{"addressLine1":"Lucas Road","addressLine2":"Farnworth","county":"Bolton","postcode":"BL4 9RU"},"contact":{"website":"http://www.thebishopfrasertrust.co.uk/School-Direct-ITT-Programme/","email":"training@st-james.bolton.sch.uk","telephone":"01204 333000","fullName":"Carolyn Thornton"},"location":{"latitude":53.5458692,"longitude":-2.4174421},"trainWithUs":"The Train:Teach:Lead Partnership (formally the St James;s Teaching School), incorporating the St James's School Direct Partnership and part of The Bishop Fraser Trust family is focused on providing all pupils the opportunity to access high quality teaching and learning to help them reach their full potential. We want to be the inspiration that drives them to achieve their dreams. With this in mind we are committed to training the next generation of outstanding teachers.\n‘Train, Teach, Lead’\nYour Career in Education Starts with us:\nOur programme is bespoke to each individual trainee and your teacher training journey. But it doesn’t end there. As the Train:Teach:Lead Partnership we track your career once you qualify and support you throughout your professional development for years after you gain QTS. We have a vast CPD programme which we encourage all trainees to access during your training year. Our former trainees can access bespoke training as they develop into effective teachers, middle and senior leaders, should they wish to follow this career path.\nOur partnership is made up of a wide variety of schools including both faith and non-faith schools. Currently there are 27 schools in our partnership and are all based in Bolton and Bury. Headteachers in the local areas are determined to attract outstanding practitioners into their schools and we work collaboratively to ensure our programme supports this. We are proud to have such fantastic schools within our partnership showing excellence really is at the forefront of what we do.","trainWithDisability":"If you have a disability or special needs please contact us so that we can discuss your requirements and how these can be met. Applicants who would benefit from disabled access should let us know on their application so that they can be considered for placements at the appropriate schools where access is high quality.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:49:16.066Z","updatedAt":"2021-11-04T20:01:35.912Z"}
