{"id":"34f0b949-839c-4292-88c3-5289076bd205","name":"Keele and North Staffordshire Teacher Education","code":"24J","type":"scitt","isAccreditedBody":true,"ukprn":"10060817","address":{"addressLine1":"KNSTE, Seabridge Primary School","addressLine2":"Roe Lane","town":"Newcastle under Lyme","county":"Staffordshire","postcode":"ST5 3PJ"},"contact":{"website":"http://knste-shaw.org.uk","email":"enquiries@knste-shaw.org.uk","telephone":"01782 432537","fullName":"Diane Swift"},"location":{"latitude":52.9926112,"longitude":-2.2377254},"trainWithUs":"Keele and North Staffordshire Teacher Education (KNSTE) is a partnership of over 140 schools who work closely with Shaw Education Trust and Keele University to offer high quality teacher education.\nOurs is an innovative course which is available both as a full time and a part-time route (2 years). You will come to us with a wealth of experience, talents and attributes. We seek to develop these in relation to early years, primary and special school pedagogy. You will complete a Keele University Postgraduate or Professional Certificate alongside your Qualified Teacher Status (QTS). In 2017 we were recognised as being an ‘outstanding’ provider by Ofsted. They stated that, ‘The partnership’s strapline is “rooted in evidence, reaching for excellence”. Leaders ensure that it does exactly that, by leaving no stone unturned in ensuring that trainees receive the high-quality training, support and challenge they require to be successful teachers.’\nOur partnership is made up of primary, special and middle schools and comprises a mixture of large and small, urban and rural, faith schools, local authority and academy settings. Our schools are predominately located in Stoke-on-Trent, and across Staffordshire, not just the north of the county. A map of our current partnership is available [here](https://knste-shaw.org.uk/placement-schools/). We have a teaching base at Keele, and at Seabridge School We work closely with a variety of partner organisations as well as a large range of t School Clusters. Details can be found [here](https://knste-shaw.org.uk/our-partners/).","trainWithDisability":"It is a privilege for us to be working in a diverse region with exceptional teachers who value supporting trainees who also come to us with a range of prior experiences and needs. We enable you to take as seriously as ourselves issues related to inclusion, equity and social justice.\nKeele University and our school based teaching rooms have full access. Applicants who would benefit from additional support in relation to access should let us know on their application so that we can facilitate appropriate placements. We regularly support trainees with a variety of needs including for example dyslexia and dyspraxia, and find that they are able to thrive on our course. At the start of the programme you will all have the opportunity to disclose any needs that they may have so that the appropriate support can be put into place. Your mental health and wellbeing is a prime concern of ours. On the course you will be enabled to support others and so we will ensure that you are aware of how we can help you to meet your own needs so that you can thrive and enjoy our amazing profession. Keele and North Staffordshire Teacher have a Deputy Director who is pleased to be responsible for student welfare and also acts as the enabling coordinator. She can assist students in accessing the various excellent support services offered by Keele University. More information can be found at [Student Support] (https://www.keele.ac.uk/students/lifeoutsideofstudy/disabilityanddyslexiasupport/supportforcurrentstudents/reasonableadjustments/)","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:56:03.179Z","updatedAt":"2021-07-18T22:36:12.053Z"}
