{"id":"35046a33-288c-4594-9a2c-f6d6665634f3","name":"Doncaster Partners in Learning Alliance","code":"1RD","type":"lead_school","isAccreditedBody":false,"urn":"143451","ukprn":"10061950","address":{"addressLine1":"c/o Doncaster ITT Partnership","addressLine2":"Civic Office, Waterdale","town":"Doncaster","county":"South Yorkshire","postcode":"DN1 3BU"},"contact":{"website":"www.doncasteritt.co.uk","email":"ittpartnership@doncaster.gov.uk","telephone":"01302 737046","fullName":"Partners in Learning Teaching School All"},"location":{"latitude":53.5770329,"longitude":-1.0160841},"trainWithUs":"Unlike some ITT Providers, a key factor of applying to train with Doncaster's 'Partners in Learning' Alliance on either Primary School Direct (or SCITT) is that ALL training placements are in Doncaster schools.\n\nTherefore trainees aren't required to travel outside of the Local Authority (LA) area whilst training, whether they are on either the QTS (Qualified Teacher Status) only programme or completing the optional PGCE (Post Graduate Certificate of Education) in addition to QTS. \n\nA comprehensive teacher development / training programme has been developed using outstanding teachers and other Specialists Leaders in Education (SLEs etc.) from across the Alliances of schools. \n\nTrainees attend 'Curriculum Development Sessions' (i.e. mostly on a Friday) and, as well as valuing the training, trainees find the sessions invaluable in allowing them to build relationships with other trainees where they share resources, experiences and emotions. They have a good social life as well! \n\nWe do not differentiate between SCITT & School Direct, as to us they are the same.\n\nAll tuition-fee paying and salaried trainees also gain experience in local Partner Secondary Schools and Academies with a focus on transition and also in Partner Special Schools for additional experience with either: behavioural, medical or severely disabled pupils.\n\nWe also charge less than most other providers for a QTS only course, as we appreciate the need to keep costs down. We can do this because we are a genuinely schools-led partnership between the Local Authority, Teaching School Hub and partner schools and academies.","trainWithDisability":"All training venues and schools must meet statutory requirements for access, but individual needs will be accommodated wherever possible.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"762ad8a4-41ad-495b-aff1-37a53aebe264","code":"D51","name":"Doncaster ITT Partnership","description":"We aren't just ‘partnered’ with the Doncaster ITT Partnership, our Alliance of Schools is the Primary side of the Partnership, working alongside our Secondary Colleagues, Teaching School Hub and LA colleagues.\\r\\n\\r\\nBased in Doncaster Council, the Partnership is Ofsted Inspected and has been successfully delivering Schools-based ITT in Doncaster since 2003.\\r\\n\\r\\nThe Partnership is the ONLY DfE Accredited ITT Provider in Doncaster and is one of only 5 in the whole of South Yorkshire!"}],"createdAt":"2021-07-06T17:57:10.406Z","updatedAt":"2021-09-23T19:15:12.003Z"}
