{"id":"353c7b88-71c1-4a49-9e11-ac3494805400","name":"Romford Teacher Training Partnership","code":"285","type":"lead_school","isAccreditedBody":false,"urn":"102291","ukprn":"10072875","address":{"addressLine1":"Clockhouse Primary School","addressLine2":"Clockhouse Lane, Collier Row","town":"Romford","county":"Essex (Havering)","postcode":"RM5 3QR"},"contact":{"website":"https://www.clockhouseprimaryschool.co.uk/","email":"office@clockhouse.havering.sch.uk","telephone":"01708 745972","fullName":"Margy Bushell"},"location":{"latitude":51.6021997,"longitude":0.1645948},"trainWithUs":"Clockhouse Primary leads a partnership of primary schools mainly within the London Borough of Havering. The schools within the partnership have a diverse clientele with a rising number of EAL children. All of the schools are inclusive and as such have children with different medical, learning , emotional and social needs. The schools have a friendly ethos with mentors supporting trainees to be successful in their chosen career. The schools offer insight into delivering the curriculum in place in a variety of way thus giving the trainees in place a wider knowledge and understanding of teaching and learning. Support is given by the lead school and by mentors in the partnership schools. All of the trainees who completed their training with us over the past years have been successful being graded as outstanding / good and in gaining employment; many within Havering or nearby LAs.","trainWithDisability":"As a partnership we try our utmost to accommodate and support trainees with disabilities and other needs. This is done on an individual basis with needs being discussed and assessed.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"00782614-9301-40e4-8832-9a74cc1bbb07","code":"E75","name":"Essex Teacher Training","description":"Essex Teacher Training is a large provider, offering a variety of different school-based routes to QTS in schools across Essex and its adjoining counties. \\r\\n\\r\\nHeadteachers value the contribution trainee teachers can make to their schools. As a result, trainees enjoy their training and the vast majority gain employment in one of our partner schools, once qualified. \\r\\nAll of our tutors are experts in their field and many are still teaching, so you benefit from their knowledge and experience. We pride ourselves on the support we offer our trainees and put trainee wellbeing at the heart of what we do."}],"createdAt":"2021-07-06T17:47:14.915Z","updatedAt":"2021-10-04T01:19:38.540Z"}
