{"id":"3654750b-61f6-4344-865a-7e47e6362390","name":"The Wokingham Federation","code":"152","type":"lead_school","isAccreditedBody":false,"urn":"136891","ukprn":"10034161","contact":{"website":"http://wokinghamfederation.co.uk","email":"jbushell@bulmershe.wokingham.sch.uk","telephone":"07725 722 557","fullName":"Julian Bushell"},"location":{"latitude":51.3761859,"longitude":-1.0611428},"trainWithUs":"The Wokingham Federation is a close partnership of ten secondary schools, two special schools and a PRU. Its aim is to support collaboration in order to raise the standards of students’ achievement across the borough. It works closely with the primary schools in the area.\nWokingham is a high performing authority and delivering an exceptional ITT programme is an integral part of the Federation's work. Its School Direct programme, in partnership with the University of Reading for all subjects with the exception of Business Studies, where Teach South East is its partner, is widely recognised for its success in producing outstanding teachers.\nPlease see [The Wokingham Federation](www.wokinghamfederation.co.uk) to see more details of our schools.\nFor 2022 - 2023, the Federation is delighted to be able to continue to offer Primary School Direct courses.\nThe Federation is extremely proud of its work with its ITT trainees, many of whom stay on each year to work as teachers in one of our schools.\nOver a quarter of all the secondary trainees with the University of Reading train each year in schools in the Wokingham Federation School Direct partnership. Any applicant successfully awarded a place with us will work in two schools, both of which are in or near to Wokingham, a town which is often named as one of the best places in the country to live.","trainWithDisability":"Both The Wokingham Federation and its partner providers are committed to equal opportunities.","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"accreditedBodies":[{"id":"23fba24b-1e90-4b68-9558-1814033bde74","code":"2EW","name":"Teach SouthEast","description":"As an Initial Teacher Training (ITT) provider, Teach SouthEast delivers high quality bespoke school-centred ITT programmes for aspiring primary and secondary teachers in South East England. Ofsted found it to be outstanding in every category in its 2018 inspection. \\r\\n\\r\\nTeach SouthEast is passionate about training and developing outstanding teachers of the future. It seeks to provide a dynamic environment where trainees can immerse themselves in what it is to be a great teacher, be nurtured within their own practice and be empowered to deliver outstanding lessons to their students."},{"id":"6439adcc-af64-4d3d-a1da-de045755db06","code":"R12","name":"University of Reading","description":"The University of Reading’s Institute of Education is an established provider of high-quality training and research. It is ranked 10th in the UK for Education (The Guardian University League Table 2022).\\r\\n\\r\\nCommitted to developing caring, reflective, professional teachers, it has well-established partnerships with over 400 schools in Berkshire and the surrounding area.\\r\\n\\r\\nOfsted report that the “effective relationships with partner schools support the development of high quality teaching and trainees that are well-prepared to work in the region’s schools.” (ITE inspection report, September 2016)."}],"createdAt":"2021-07-06T17:47:19.926Z","updatedAt":"2021-10-04T19:24:48.484Z"}
