{"id":"36549ffd-b1d5-48b5-9d42-5449642ab0ef","name":"North Somerset Teaching Alliance","code":"16Z","type":"lead_school","isAccreditedBody":false,"urn":"136722","ukprn":"10033577","address":{"addressLine1":"Backwell School, Station Road, Backwell, Bristol, BS48 3BX","addressLine2":"Backwell","town":"Bristol","county":"North Somerset","postcode":"BS48 3BX"},"contact":{"website":"http://www.nsta.org.uk","email":"htwiggs@backwellschool.net","telephone":"1275463371","fullName":"Carol Gair (Initial Teacher Training Lea"},"location":{"latitude":51.4162897,"longitude":-2.7395089},"trainWithUs":"The North Somerset Teaching Alliance is a fantastic place to work and learn; located as it is close to Bristol City centre and surrounding area.\nA trainee's thoughts: \" A big thank you! I have had an incredible experience. Everyone was very welcoming, helpful and encouraging which made the hardest part of this year easier for me. I feel very lucky to be part of a wonderful team.\" This is an inspirational partnership of eight secondary schools, some of which have achieved outstanding ratings. Our vision is to ensure a clear pathway of the highest quality training and succession opportunities for School Direct trainees in partnership with our HEI partners. The NSTA website address is (https://www.nsta.org.uk/) The NSTA guarantees successful School Direct trainees an interview in its partner schools should a vacancy arise in a suitable post. We create an environment in which staff, students and trainee teachers' feel valued and supported. We have a strong track record of working with trainee teachers for many years and fully embrace the energy, enthusiasm and drive they offer to a school community. Students across the partnership are happy, friendly and well-behaved and are at the heart of everything we do. We believe that our staff are our most valuable resource, ambitious and confident, and therefore provide access to high quality on-going training and professional development opportunities. Our teachers are excellent practitioners with exemplary behaviour management skills and are eager to share their skills, knowledge and practice with the next generation of teachers.","trainWithDisability":"We welcome applications from candidates with disabilities and other needs and with our HEI partners make reasonable adjustments to ensure that the training programme is accessible to all. \n\nPlease find detailed information about the support we provide in conjunction with our HEI partners below\n\nUniversity of Bristol: [Student health and wellbeing]\n(http://www.bristol.ac.uk/students/wellbeing/)\n\nPlymouth Marjon University : [Disability and Inclusion Advice Service] (https://www.marjon.ac.uk/student-life/student-support-/disability--inclusion-advice-service/","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"a4e84530-e1f1-47c6-b57e-ec693d629637","code":"P63","name":"Plymouth Marjon University","description":"Plymouth Marjon University Teacher Education Partnership is a well-established partnership between the University and schools in the South West, London and Service Children’s Education. It is a values-based collaborative partnership that ensures excellent outcomes for pupils, trainees and teachers. It is rated good with outstanding leadership and management by Ofsted.\\r\\n\\r\\nYou will spend time studying your subject specialism with peers from the University and then develop these skills with training in the school setting. You will have two mentors, one at your home School and a University based Tutor to guide you through your year."},{"id":"992b9d4a-bdcf-44e8-9296-fb1fe3bb3315","code":"B78","name":"University of Bristol","description":"The University of Bristol is a valued partner in providing our NSTA School Direct programme. It’s education programme is rated outstanding by Ofsted. \\r\\nYou will benefit from full access to a dynamic facilitator of both innovative and traditional approaches to teaching and learning. You will spend time studying your subject specialism with peers at the University and then developing these skills with training in the school setting. You will have two mentors, one at your home School and a University based mentor to guide you through your year."}],"createdAt":"2021-07-06T17:46:34.678Z","updatedAt":"2021-07-07T18:35:48.036Z"}
