{"id":"369ea7a4-0f87-43f3-a34a-9d92b2093273","name":"Saint George’s Church of England School","code":"295","type":"lead_school","isAccreditedBody":false,"urn":"137609","ukprn":"10035681","address":{"addressLine1":"Meadow Rd","town":"Gravesend","county":"Kent","postcode":"DA11 7LS"},"contact":{"website":"http://www.saintgeorgescofe.kent.sch.uk","email":"ARMSTRONGN@saintgeorgescofe.kent.sch.uk","telephone":"1474533082","fullName":"Nikki Shibli"},"location":{"latitude":51.428548,"longitude":0.361958},"trainWithUs":"Saint George's Church of England School is part of the Aletheia Anglican Academies Trust and an OfSTED graded \"Good with Outstanding Leadership\" 11-18 Secondary School in Gravesend, Kent. An over-subscribed school, we have a long history of training teachers and a large number of our current teaching body were trained at the school. We offer a broad and balanced curriculum, believing the Arts, sport and vocational subjects are as equally important as the traditional subjects. Saint George's is a christian school as opposed to a school for Christians where we pride ourselves on our diverse and welcoming community and school ethos of everyone being \"All different, all equal\". We work in partnership with a number of schools (there are 6 Primary Schools in the trust and we will be opening a Primary on our site in the next year) and, as a Lead School for KMT, send applications to 3 other Secondary schools in the area as well as the aforementioned Primary Schools. Our buildings are traditional but the teaching that happens within them is in line with the 21st century. We are a hub school for KAGAN strategies (a technique for collaborative learning) and were a pilot school for the Shanghai inspired maths mastery programme.","trainWithDisability":"We welcome applications from those with disabilities and regularly train and support students with dyslexia and mental health problems.\nOur accreditation partners, Kent and Medway Training, offer support and help with strategies for ensuing that Spelling, Punctuation and Grammar are accurate in, especially, work that is handed out to school pupils.\nWe have introduced a programme of support for those with mental health conditions and further advice as to where to gain specialist support should you need it.\nWe are proud of the support and guidance that we give to ensure that you are able to give of your best during your training year and we provide an environment in which you can feel comfortable in seeking support should you need it.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"757d0dca-c7a9-43c8-8c3b-96c0a81539b6","code":"K30","name":"Kent and Medway Training","description":"Kent and Medway Training (KMT) is a highly regarded and successful Schools Centred Initial Teacher Training Provider (SCITT) which has been successfully training teachers for over 25 years. With School Direct our reputation has seen us grow tremendously KMT offer training which leads to Qualified Teacher Status (QTS) and our partnership arrangement with The University of Leeds Beckett gives our trainees the opportunity to access a PGCE Top-Up qualification while they train or in the first two years of teaching. This offers Masters Level credits."}],"createdAt":"2021-07-06T17:51:01.357Z","updatedAt":"2021-08-05T16:54:21.277Z"}
