{"id":"376f08f6-1827-4fd9-89f1-1e0e4d03f939","name":"Sherborne Area Schools Trust","code":"18M","type":"lead_school","isAccreditedBody":false,"urn":"138471","ukprn":"10059883","address":{"addressLine1":"The Gryphon School","addressLine2":"Bristol Road","town":"Sherborne","county":"Dorset","postcode":"DT9 4EQ"},"contact":{"website":"https://www.sast.org.uk","email":"isabelle.rawlings@sast.org.uk","telephone":"07741 578699","fullName":"Tim Ovenden"},"location":{"latitude":50.9587908,"longitude":-2.5142045},"trainWithUs":"Why train with us? It is quite simple: our provision is outstanding. You will train with Ofsted Outstanding Initial Teacher Education providers and schools. Across our partnership you will encounter exceptional learning environments and experienced staff; you will work with awesome young people as you hone your skills and learn to teach. We are a well-established provider with long-standing relationships. You will be given the opportunity to not just work towards Qualified Teacher Status (QTS), but also to study for the Post Graduate Certificate of Education (PGCE). This additional qualification is worth 60 credits towards a Masters degree and is widely recognised across the world as a prestigious addition to being a qualified teacher.\nYou will have two mentors throughout your training, both based in your home school. You will also have the chance to explore a second school during a six-week placement in a different partnership school. We will also ensure you are part of our on-going professional development programme, designed especially to support our School Direct trainees.\nOne of our trainees explained that \"Throughout the application process everyone I spoke to was very organised, well informed and honest. I was able to discuss my particular wants and wishes from my training; they have chosen my placement schools based on this, even allowing me to visit the school for a day to make sure both parties were happy. The larger programmes do not offer such a good service.\"","trainWithDisability":"The Sherborne Area Schools Trust welcomes candidates and trainees and does not discriminate on the grounds of physical ability or mental health. We support trainees with their specific learning needs to achieve their dream of becoming a teacher and will ensure appropriate support throughout the recruitment process and training year. As an experienced provider of Initial Teacher Training, we are proud to have supported students with a variety of additional needs to become fantastic and successful teachers. We will aim to tailor our support to make sure that the course is both accessible and achievable. We encourage all candidates/trainees with any disability, or additional needs to discuss this with the Sherborne Area Schools Trust. We would advise that you contact us on 01935 811066 or isabelle.rawlings@sast.org.uk for a further discussion about the support we can offer.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:52:20.621Z","updatedAt":"2021-09-30T16:42:36.680Z"}
