{"id":"382bc2e1-cbd3-4bd3-b100-b58898e7e021","name":"Yorkshire Anglican Learning and Education Partnership","code":"13J","type":"lead_school","isAccreditedBody":false,"urn":"143232","ukprn":"10057834","address":{"addressLine1":"Wakefield Road","addressLine2":"Scissett","town":"Huddersfield","county":"West Yorkshire","postcode":"HD8 9HR"},"contact":{"website":"https://www.scissettceacademy.org/yalep","email":"office@yalep.org","telephone":"1484861488","fullName":"Elaine Watson"},"location":{"latitude":53.5910409,"longitude":-1.6254337},"trainWithUs":"Yorkshire Anglican Learning and Education Partnership are proud to be working in partnership with The Kirklees and Calderdale SCITT and Huddersfield University. YALEP works with Partnership schools across local authority boundaries, which means we can offer a diverse selection of schools and contrasting experiences to support a wider learning & development base. Our trainees make very good progress, are well supported to achieve success & demonstrate good/outstanding outcomes at the end of their placements. 100% of trainees gained their QTS in 2020.\nWhat our trainees say about us:\n“During my interview I felt that the staff effectively assessed my abilities and provided me with a great deal of information for me to start my teacher training journey.” “My training experience (with YALEP) has given me the tools to become an enthusiastic, creative & driven primary school teacher.” “The support and guidance I received throughout my training was excellent and all staff were friendly, helpful and accommodating. Within my placements I was given broad opportunities to develop my classroom, behaviour management, teaching style & subject knowledge, always with the consistent support of my mentor.” “From my experience I would highly recommend Yorkshire Anglican to any potential applicant.”","trainWithDisability":"YALEP is a fully inclusive training provider, committed to equal opportunities. We actively encourage applications from all groups. We welcome applications from ethnic minority and other represented groups. We are committed to the achievement of equal opportunities. This is central to our mission as a provider of school-based teacher training.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"74d0e1b3-80ac-4a0e-b93d-f19cb6587144","code":"1WK","name":"Kirklees and Calderdale SCITT","description":""},{"id":"791f82c8-19fd-4339-9c7b-301dee8067ce","code":"H60","name":"University of Huddersfield","description":""}],"createdAt":"2021-07-06T17:50:13.523Z","updatedAt":"2021-09-30T18:25:52.966Z"}
