{"id":"3873d791-19ad-427c-b04a-7d7d3188af7f","name":"Kendal Primary Partnership","code":"2FE","type":"lead_school","isAccreditedBody":false,"urn":"112325","ukprn":"10074913","address":{"addressLine1":"Kendal Primary Partnership","addressLine2":"Oxenholme Lane","town":"Natland","county":"Cumbria","postcode":"LA9 7QH"},"contact":{"website":"http://www.kendalprimarypartnership.org","email":"kklijn@st-marks.cumbria.sch.uk","telephone":"07765 038274","fullName":"Rachel Esposito"},"location":{"latitude":54.2970261,"longitude":-2.736147},"trainWithUs":"The Kendal Primary Partnership School Direct programme (KPP) is proud to work with the University of Cumbria. Study with us towards a PgCE at Masters level, with Qualified Teacher Status. Our exciting programme provides opportunities to experience critical and creative teaching approaches in Early Years and/or Primary settings.\nWe work with the Kendal Collaborative Partnership (KCP), which consists of 13 Primary schools, a Nursery, two Secondary schools and a Special school, who work together to train the next generation of outstanding teachers.\nThe KPP is based in Kendal, where you will learn from experienced teachers. Our training is led by staff from local schools in partnership with University of Cumbria tutors and takes place within our partner schools. You will immediately be immersed in school-life and benefit from experiencing an exciting variety of settings. The KPP has established partnerships with many schools who support placements and the academic modules.\nOur course brings together the expertise of current practitioners, complimented by staff from one of the largest ITT universities. You will join a learning community where everyone is interested in reflecting and researching the pedagogies of teaching and learning.\nAcademic philosophy will underpin your learning, which you then apply in classroom settings. You will develop the craft of teaching at the same time as reflecting on the impact that a range of approaches have on pupils, staff, school and the wider community.\nWe are very proud of our UoC Excellence nomination 2016 and our People's Choice Golden Apple Award 2018.","trainWithDisability":"The Kendal Primary Partnership aims to provide a supportive environment that allows all individuals to flourish, and actively encourage applications from disabled people. We are committed to widening participation and provide a range of services to enable those with disability or specific learning difficulty (SpLD) to access our courses. This has included prior access to module notes in preparation for taught sessions, individual tutorial support and consideration in matching placements to student needs.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:52:48.922Z","updatedAt":"2021-09-30T02:49:55.817Z"}
