{"id":"387efe47-51b3-4387-82bb-09861f5906ba","name":"The Rodillian Multi Academy Trust","code":"2DS","type":"lead_school","isAccreditedBody":false,"urn":"138336","ukprn":"10059698","address":{"addressLine1":"Rodillian Academy","addressLine2":"Longthorpe Lane","town":"Lofthouse, Wakefield","county":"England - Yorkshire and the Humber","postcode":"WF3 3PS"},"contact":{"website":"http://www.rodillianacademytrust.co.uk/teacher-training/","email":"schooldirect@rodillianacademy.co.uk","telephone":"01757 707731","fullName":"Diana Hall"},"location":{"latitude":53.7300652,"longitude":-1.5018597},"trainWithUs":"Welcome to the Rodillian Multi Academy Trust. We have successfully transformed a number of academies across Yorkshire, improving whole school performance for our students thanks to our unique, pioneering approach. We believe in growing our own talented teaching leaders of the future, and investing in our staff through quality accredited programmes and coaching.\nThe Rodillian Multi Academy Trust offer the opportunity to train through the School Direct initiative across a variety of secondary schools in Leeds, Wakefield and Selby.\nWhy train with Rodillian?\nWe believe that the best way to start a teaching career is to develop your experience of schools from the outset, and the joint courses between Rodillian and Leeds Trinity University and Leeds Beckett University provides this in a supportive balanced manner.\nBenefits of the Rodillian training programme:\n* You will be accepted and inducted as a colleague from day one.\n* You will receive mentoring from well-trained, outstanding practitioners and train with the teachers who made us one of the top performing MATs.\n* We have a nationally recognised behaviour system, which allows teachers to concentrate on ensuring the best possible outcomes for students. When you train with us, the behaviour system in all your placement schools is the same, so you can concentrate on developing your practice.\n* You will be given the opportunity to explore our innovative resilience curriculum which strives to develop a Growth Mindset in all students\n*You will train in a trust that offers excellent employment opportunities.\nFor more information:\nhttp://www.rodillianacademytrust.co.uk/teacher-training/","trainWithDisability":"All our training locations are fully accessible and we would support individual needs.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"accreditedBodies":[],"createdAt":"2021-07-06T17:53:13.722Z","updatedAt":"2021-10-15T18:48:15.075Z"}
