{"id":"397bec91-96d9-4560-b795-db05bbb17a4c","name":"Court Moor Partnership","code":"2J8","type":"lead_school","isAccreditedBody":false,"urn":"116412","ukprn":"10015454","address":{"addressLine1":"Court Moor Partnership","addressLine2":"Spring Woods","town":"Fleet","county":"Hampshire","postcode":"GU52 7RY"},"contact":{"website":"http://www.court-moor.hants.sch.uk/","email":"terry.mcenroe@court-moor.hants.sch.uk","telephone":"1252615065","fullName":"Terry McEnroe"},"location":{"latitude":51.2706387,"longitude":-0.8455292},"trainWithUs":"Court Moor School is one of the highest performing schools in Hampshire: in 2017 we had the highest 'Basics 9-5' results (students achieving at least a Grade 5 in both maths and English) in the county. The school is consistently rated 'good' by Ofsted and is pushing towards 'outstanding'. Attendance is excellent and behaviour issues are rare; in fact, visitors frequently comment favourably on the conduct of our students.\n\nOur new partnership offers the chance to train within a network of local schools who work closely together and are all committed to the development of new staff. We have an excellent track record of ITT, and many current members of staff trained at the school. Our teaching mentors have all undertaken the relevant training with the University of Reading (and/or similar institutions), and the feedback we receive from trainees reflects the supportive and collaborative environment.","trainWithDisability":"Trainees with disabilities and other needs are offered our full support. The school/partnership has made staff wellbeing a priority: this year, for example, we have focused on 'mindfulness' as a pathway to good mental health, and we have appointed a wellbeing co-ordinator to ensure we are doing everything we can to support staff.","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"6439adcc-af64-4d3d-a1da-de045755db06","code":"R12","name":"University of Reading","description":"One of the ‘Top 10’ ITT providers in the country. The University of Reading have a superb track record in ITT and are always supportive of trainees and partnerships schools, working collaboratively to ensure trainees get the best possible experience."}],"createdAt":"2021-07-06T17:55:07.231Z","updatedAt":"2021-10-11T23:59:12.745Z"}
