{"id":"39b04a57-06c3-45a1-b012-00a5b120e17e","name":"Stour Vale Academy Trust","code":"1FA","type":"lead_school","isAccreditedBody":false,"urn":"139872","ukprn":"10059465","address":{"addressLine1":"c/o Halesowen College","addressLine2":"Whittingham Road","town":"Halesowen","county":"West Midlands","postcode":"B63 3NA"},"contact":{"website":"https://svat.org.uk/train","email":"teach@svat.org.uk","telephone":"0121 5855385","fullName":"Lance Hanson"},"location":{"latitude":52.4563729,"longitude":-2.0525859},"trainWithUs":"Stour Vale Academy Trust is a group of primary and secondary schools offering school direct training across a range of specialisms. Teaching and learning is our core purpose and our course is built on principles of knowledge, inquiry and challenge. Whether you opt for primary or secondary training, you will be part of an exciting and comprehensive training programme. Supported by our experienced and talented mentors, you will quickly become an integral part of a supportive and aspirational environment that is committed to outstanding outcomes for all, assuring you of the best possible start to your teaching profession.\nOur secondary schools: Redhill School, Stourbridge; The Earls High School, Halesowen; Ridgewood High School, Stourbridge; Oldbury Academy, Oldbury\nOur primary schools: Olive Hill Primary, Halesowen; Northfield Road Primary, Netherton; Newtown Primary, West Bromwich\nWe also work closely with a number of other schools across the Black Country as part of our wider ITT partnership. Our courses are accredited by University of Worcester, University of Wolverhampton and Haybridge Alliance SCITT (c/o Birmingham City University), and all our tuition fee courses award a Postgraduate Certificate in Education (PGCE) to all successful trainees.\nWe offer places for secondary and primary trainees.\nFor more information about Stour Vale, please visit https://www.svat.org.uk. For the latest information on School Direct places and locations, please feel free to email us at teach@svat.org.uk.","trainWithDisability":"We are a fully inclusive Trust and pride ourselves on our provision for all our stakeholders’ needs. Wheelchair access is excellent with lift access to all areas of our site. We take care to ensure the mental health and well-being of staff and pupils and have recognised this in our ITT handbook.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"0ab5238e-606a-4f42-9aea-90d321ad7dc8","code":"2B3","name":"Haybridge Alliance SCITT","description":""},{"id":"4da5abb2-b287-451e-8d75-c5b79e11c2bb","code":"W75","name":"University of Wolverhampton","description":""},{"id":"6019b3ce-f2f6-4b0e-b2a9-5813d74c4d54","code":"W80","name":"University of Worcester","description":""}],"createdAt":"2021-07-06T17:53:29.359Z","updatedAt":"2021-10-07T19:19:08.652Z"}
