{"id":"39f84488-b175-4d2d-b886-bbef6c190ac1","name":"Whitburn Church of England Academy","code":"23F","type":"lead_school","isAccreditedBody":false,"urn":"136386","ukprn":"10038631","address":{"addressLine1":"Whitburn Church of England Academy","addressLine2":"Whitburn","town":"Sunderland","county":"Tyne & Wear","postcode":"SR6 7EF"},"contact":{"website":"http://www.whitburncofeacademy.org","email":"cshaw@whitburncofeacademy.org","telephone":"1915293712","fullName":"Alan Hardie"},"location":{"latitude":54.949459,"longitude":-1.360291},"trainWithUs":"Whitburn Church of England Academy (formerly the lead secondary school in the Prince Bishops Teaching School Alliance) is one of the highest achieving schools in the North East.(https://www.whitburncofeacademy.org/)\n\nOur motto of 'Excellence for All' permeates all our work with students, trainee teachers and colleagues. We provide a unique school based learning opportunity in partnership with Durham SCITT (School Centre Initial Teacher Training), an OFSTED Outstanding ITT Provider.\n\nWhitburn Church of England Academy and its partner schools work closely with Durham SCITT to provide outstanding support for teachers at the start of their careers. We have extensive experience in providing exceptional training and development opportunities for our trainees. Our track record in supporting ITT students into their first teaching posts is exceptionally strong with an average of 90% of students gaining a position each year.\n\nWe work with a range of schools across South Tyneside and Sunderland and are one of the very few nationally that also places students into the independent sector. This offers our trainees greater opportunity to experience a wide range of educational settings to aid their professional development.\n \nWe actively encourage applicants, and those interested in teaching, to apply to our unique school volunteering programme. This offers potential applicants the chance to meet experienced staff and present trainees as well as receiving advice to enhance their UCAS application and guide them through the process of application and selection.","trainWithDisability":"Whitburn Church of England Academy have an inclusive approach to all trainee teachers and their needs, offering additional support throughout the year, should it be required","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:55:39.077Z","updatedAt":"2021-10-14T17:35:03.438Z"}
