{"id":"3a04d0d3-7c91-44a9-b61c-1b57ba5611cb","name":"The Solent SCITT","code":"S56","type":"scitt","isAccreditedBody":true,"ukprn":"10016462","address":{"addressLine1":"The Dickinson Centre, Park Community School","addressLine2":"Middle Park Way","town":"Havant","county":"Hampshire","postcode":"PO94BU"},"contact":{"website":"https://www.thesolentscitt.co.uk","email":"info@thesolentscitt.co.uk","telephone":"2392489819","fullName":"Clare Harrison"},"location":{"latitude":50.87005,"longitude":-1.0012329},"trainWithUs":"Calling upon years of school expertise and current teaching practitioners, The Solent SCITT offer a practical school-centred route where you can learn on the job from real teachers in real classrooms. Classroom theory is important but in the same way a surgeon needs significant ‘hands on’ practical training to hone their craft, so do teachers. We offer primary and secondary teacher training in a range of subjects and the opportunity to gain Qualified Teacher Status (QTS) with a PGCE option. We welcome graduates, career changers, Teaching Assistants and Cover Supervisors of all ages and backgrounds.\nGraded ‘Good’ by Ofsted in 2015, we have a proven track record of high-quality training delivered and designed by expert teachers. It is important to us that SCITT trainees gain employment and to date 100% of primary and secondary trainees seeking employment have secured a job on completion of the course. Feedback tells us that SCITT candidates stand out among their peers due to their superior school experience and we prepare candidates with mock interviews. We have a personalised approach to training with candidates assigned a SCITT team member alongside their school mentor and Subject Expert providing an effective three-pronged support framework. Well-being is important to us so we organise a variety of activities and provide expert advice on managing stress, workload and effective use of time. Training with The Solent SCITT comes with additional perks such as free gym membership at Park Community School and full-time use of a laptop with the latest software.","trainWithDisability":"We welcome all applications and will make reasonable adjustments for students with disabilities. If you have a disability, please provide full details on your teacher training application so we can help in any way we can and find a suitable placement to meet your needs.","createdAt":"2021-07-06T17:55:37.908Z","updatedAt":"2021-09-07T20:15:46.952Z"}