{"id":"3a0d00b9-3749-4c51-a5f0-c53c6f19c243","name":"St Paul’s Caritas Christi","code":"242","type":"lead_school","isAccreditedBody":false,"urn":"103531","ukprn":"10006246","address":{"addressLine1":"Vernon Road","addressLine2":"Edgbaston","town":"Birmingham","county":"West Midlands","postcode":"B16 9SL"},"contact":{"website":"http://www.stpaulgl.bham.sch.uk","email":"sseery@stpaulgl.bham.sch.uk","telephone":"1214540895","fullName":"Mary Atterbury"},"location":{"latitude":52.4753715,"longitude":-1.9395687},"trainWithUs":"St Paul’s School for Girls is an outstanding Catholic Secondary school which works in collaboration with a number of Catholic primary and secondary schools, forming the Caritas Christi group, having been involved in School Direct for 6 years. We have combined our experience in order to develop the role of schools who have extensive experience in school based initial teacher training. We have a cross-phase alliance of 13 schools, both secondary and primary located across the inner city region of Birmingham. The Caritas Christi group of schools have formalised a Catholic based regional network of schools, using their collective experiences to provide extensive support to staff and trainees. Our close partnership of inner-city schools, Universities and other organisations is important to us because our schools are addressing similar needs and challenges: for example, very high levels of EAL, SEND, poverty and low baseline achievement in diverse communities which need our support. We are dedicated to reducing inequalities and giving children every opportunity to succeed at school and beyond. We are all committed to the best possible achievement for our children and staff and we set expectations high so that community aspirations can be raised. St Paul’s Caritas Christi works in partnership with the University of Birmingham, Newman University and the University of Warwick (Ofsted Outstanding for Initial Teacher Education) for all of our secondary subjects and the primary (general) programme, providing high quality courses and support for trainees.","trainWithDisability":"Members of the ITT Support Team are highly experienced professional mentors from our schools. A member of this team will make visits to your school during the year. You will also have regular visits from your assigned university tutor. As a committed group of professionals, we invest in our School Direct trainees, and see the School Direct year as the start of your successful career with us. NQTs in our schools benefit from our high quality, year-long NQT Induction Programme.\nAll trainees with receive tailored support to help with any specific needs and our friendly and welcoming staff will enable a smooth transition to the role of class teacher. Recent trainees have received support for medical needs throughout their training.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:52:33.596Z","updatedAt":"2022-02-03T04:38:19.803Z"}
