{"id":"3a93582a-6893-487b-8d62-cbabbe2b2962","name":"Elmhurst Teaching School Alliance","code":"15U","type":"lead_school","isAccreditedBody":false,"address":{"addressLine1":"Elmhurst Primary School","addressLine2":"Upton Park Road","town":"Forest Gate","county":"London","postcode":"E7 8JY"},"contact":{"website":"http://www.elmhurstteachingschool.co.uk","email":"eturner@elmhurst.newham.sch.uk","telephone":"2084721062","fullName":"Michele Zylstra"},"location":{"latitude":51.539751,"longitude":0.0292143},"trainWithUs":"You can train to be a teacher in East London with Elmhurst Teaching School Alliance. The School Direct scheme is designed to train up the next generation of high-quality primary teachers, and at ETSA, we draw upon the experience and excellence of our schools across East London to ensure our trainees have a supportive start to their teaching careers. In partnership with the University of East London (UEL), our trainees work to gain Qualified Teacher Status in one academic year.\n\nIf you want to work in a diverse and exciting area, make a profound difference to children’s lives and earn a competitive salary, then you should consider becoming a teacher with ETSA.\n\nThere are two routes – Salaried and Tuition-Funded. Explore your options to decide which routes you are eligible for, and which one is most suitable for you.","trainWithDisability":"If you have a disability that you need to declare we can discuss at interview stage how we can best accomodate your needs.","accreditedBodies":[{"id":"7f11aaed-7c3e-42c5-af7a-023d33b45fa3","code":"U80","name":"UCL, University College London","description":"UEL is one London’s leading centres for teacher training, offering highly successful courses for the primary, secondary and further education and training sectors. Capitalising on its east London location, they've earned an excellent reputation for working in partnership with schools to prepare teachers to work in multi-ethnic and multilingual urban schools.\\r\\n\\r\\nThe School of Education and Communities trains approximately 600 teachers every year. Through joining the School Direct programme with ETSA you will be joining a large department with a long and impressive track record and benefit from subject specific coaching and mentoring from experienced and expert practitioners.\\r\\n\\r\\n(https://www.uel.ac.uk/teacher-training)"}],"createdAt":"2021-07-06T17:52:00.318Z","updatedAt":"2021-12-22T02:02:15.688Z"}