{"id":"3b1817ea-d0f3-4385-a555-6361fa0e2e9c","name":"The OAKS Norfolk","code":"4T7","type":"lead_school","isAccreditedBody":false,"urn":"136187","ukprn":"10031101","address":{"addressLine1":"Ormiston Venture Academy, Oriel Avenue","town":"Gorleston","county":"Norfolk","postcode":"NR31 7JJ"},"contact":{"website":"https://www.ormistonventureacademy.co.uk/","email":"oaksnorfolk@ormistonventureacademy.co.uk","telephone":"01493 662966 x 324","fullName":"Jodie"},"location":{"latitude":52.5705285,"longitude":1.7076019},"trainWithUs":"The OAKS Norfolk is based at Ormiston Venture Academy in Gorleston and is steered by a collaborative working partnership between the Ormiston Academies Trust secondary schools in Norfolk and Lowestoft. The seven schools have a combined wealth of experience and an excellent local reputation for supporting teacher training of the highest quality. This new venture acting as a hub for the Outstanding and widely respected OAKS SCITT based at Keele University, will ensure a highly personalised and rewarding pathway through initial teacher training. Trainees will be placed in one of the seven OAT schools in the East, enabling them to benefit not only from the experience of the OAKs Norfolk tutors and the OAKs team based at Keele University but also the close working relationship of the Ormiston Academies Trust team in the Eastern Region, giving great recruitment and further professional development opportunities at the end of the training year. Our aim is to ensure that trainees come into the profession with a high level of readiness to change lives in our local schools and act as part of the solution to the challenging recruitment picture in the area. With this in mind we will ensure there are many support structures in place for this challenging but very rewarding course to enable you to successfully gain QTS and a PGCE(m) Academic Award.","trainWithDisability":"We have a dedicated support tutor, who supports our trainees with disability or any other need. It is important to state that they do not assess your teaching performance, this gives you the opportunity to speak honestly about your needs, but also enables the support tutor to have the freedom to help you and visit you; whether you are in placement school or here at The OAKS. This includes signposting through to developing individualised learning plans, which may extend beyond the course date to enable you to successfully complete the programme.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"7f349baa-f4ef-4fd5-b228-fcc56247e9b9","code":"24P","name":"The OAKS (Ormiston and Keele SCITT)","description":"The OAKS is an Ofsted Outstanding (2016) and innovative SCITT (School Centred Initial Teacher Training programme) which links Keele University and OAT (Ormiston Academies Trust) with a long established partnership of schools in six local authorities: Staffordshire, Stoke on Trent, Shropshire, Birmingham, Cheshire and Norfolk. \\r\\n\\r\\nThe OAKS course is based in the beautiful green campus of Keele University and all trainees will qualify with a Keele University PGCE and QTS from The OAKS.\\r\\n\\r\\nOur programme was rated 17th out of over 200 Teacher Training providers across the country in the Good Teacher Training Guide 2017."}],"createdAt":"2021-07-06T17:51:56.645Z","updatedAt":"2021-09-28T18:25:28.595Z"}
