{"id":"3b39f229-cdd2-4d41-b4e0-9e9ae5ab006d","name":"John Donne Primary School","code":"1DS","type":"lead_school","isAccreditedBody":false,"urn":"140507","ukprn":"10044489","address":{"addressLine1":"John Donne Primary School","addressLine2":"Woods Road","town":"London","county":"London","postcode":"SE15 2SW"},"contact":{"website":"https://www.jdacademy.org.uk/school-direct","email":"schooldirect@jdacademy.org.uk","telephone":"2076390594","fullName":"Jo Rooney"},"location":{"latitude":51.4727429,"longitude":-0.0611774},"trainWithUs":"We offer outstanding teacher training in creative and innovative schools. You will have access to expert teachers from whom you can learn the art of teaching. You will also learn the very latest in theory and research on which our teaching rests. On completion you will be well equipped to teach in schools in London and across the world. \n\nYou will join Goldsmiths, University of London's Primary programme, with full access to university services and facilities, benefitting from the expertise and the research profile of our Primary team. You will focus on either Foundation Stage/Key Stage 1, Key Stage 1/Key stage 2 or Key Stage 2. You are supported professionally by a system of school and personal tutoring and will spend 120 days in two different placement schools within this School Direct cluster. \n\nWe are proud that our School Direct salaried programme leads to the award of the Postgraduate Certificate in Education (PGCE), with 60 Master's credits and QTS. \n\nThe programme covers all the National Curriculum subjects and deals in detail with the three core areas of English, Mathematics and Science. In each curriculum area, opportunities are provided to enable you to develop understanding of the teaching and learning process, and to learn about effective classroom practice. The 3-7 age range programme includes additional sessions relevant to teaching in the Foundation Stage. Cross curricular themes, skills and dimensions are a vital part of the programme, and thematic integrated patterns of work are encouraged throughout your school experience and college-based work.","trainWithDisability":"Goldsmiths has a dedicated Disability Team, which is part of Student Services. The team is responsible for the co-ordination of support for current and prospective disabled students. The University is committed to supporting students, and will make reasonable adjustments to allow you to concentrate on your academic studies and support your independence. The campus is accessible to students with limited mobility.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:47:24.555Z","updatedAt":"2021-09-29T18:26:13.415Z"}
