{"id":"3b4f5907-5855-4960-819c-eae7b426a589","name":"Hales Valley Teaching Hub","code":"18E","type":"lead_school","isAccreditedBody":false,"urn":"143783","ukprn":"10061958","address":{"addressLine1":"Lutley Primary School","addressLine2":"Brookwillow Road","town":"Halesowen","county":"West Midlands","postcode":"B63 1BU"},"contact":{"website":"http://www.hvts.org.uk","email":"hpickles1@lutley.dudley.sch.uk","telephone":"01384 818220","fullName":"Hannah Pickles"},"location":{"latitude":52.4408107,"longitude":-2.0765076},"trainWithUs":"School Direct and SCITT courses are school-led training which gives you the chance to learn ‘on the job’ in a school. You work as part of the teaching team from day one learning from experienced, highly-skilled colleagues and immediately put your new skills into practice.\nHere at Hales Valley Teaching Hub, we offer four different routes into teacher training.\nThe two routes we offer which are validated by the University of Birmingham are:-\n•Primary Postgraduate Certificate of Education award (Level 7), 60 Masters level credits and QTS.\n•Early Years Postgraduate Certificate of Education award (Level 7),60 Masters level credits and QTS.\nThe third route we offer is in partnership with Haybridge School Centred Based Initial Teacher Training is:-\n•Primary Postgraduate Certificate of Education award (Level 7), 60 Masters level credits and QTS.\nThe fourth route we offer is validated by the Birmingham City University is:-:-\n•Primary (3 - 7 year old) Postgraduate Certificate of Education award (Level 7), 60 Masters level credits and QTS.\nWhy choose Hales Valley Teaching Hub?\n•Excellent support and bespoke provision to meet the individual needs of our trainees.\n•22 primary partnership schools.\n•100% pass rate at good or above and 100% employment rate once qualified since we began offering the programme.\n•Experienced Hales Valley mentor designated to each trainee throughout the year.\nFor more information on one of our three courses, please email\nhpickles1@lutley.dudley.sch.uk\nor\nbhale@lutley.dudley.sch.uk","trainWithDisability":"Hales Valley Teaching Hub strives to be an inclusive learning community. Whatever your disability, mental health or learning support needs, we’re here to help make sure you that you can access appropriate support to take advantage of the School Direct and SCITT experience.\nHow we support our teacher trainees depends on your condition and other circumstances. Support is individual and personalised to you and responsive to how your needs may change throughout your time with us.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:55:20.310Z","updatedAt":"2021-10-05T16:41:52.160Z"}
