{"id":"3b6d9961-47a3-4833-a6ce-902e396adb51","name":"Tall Oaks Academy Trust","code":"27M","type":"lead_school","isAccreditedBody":false,"urn":"140329","ukprn":"10052488","address":{"addressLine1":"Castle Wood Academy","addressLine2":"The Avenue","town":"Gainsborough","county":"Lincolnshire","postcode":"DN21 1EH"},"contact":{"website":"https://www.talloaksacademy.co.uk/initial-teaching-training-itt/","email":"vic.warburton@talloaksacademy.co.uk","telephone":"01427 811516","fullName":"Lucy Lia"},"location":{"latitude":53.4084045,"longitude":-0.7696686},"trainWithUs":"Blyton Cum Laughton CE Primary School (our lead school) is a primary school, based across two sites in Lincolnshire. We work closely with a nearby Multi-Academy Trust called Tall Oaks Academy Trust which consists of three schools - Mercer’s Wood Academy, White’s Wood Academy and Castle Wood Academy. Blyton Cum Laughton CE Primary School and Tall Oaks Academy Trust have a long-standing working relationship with Bishop Grosseteste University, working in partnership to train new teachers. Many teachers who have trained with us through this route have gone on to secure teaching jobs within our schools. All students who train with us will have opportunities to observe highly effective teaching within our training cluster and across our partner schools. We have a dedicated School Direct Lead who will liaise with partner schools, organise placements and lead mentor support, not only whilst you are training, but also into your ECT years.","trainWithDisability":"We really care about all of our trainees and aim to support them all of the way through their studies, from application to graduation. Here at BGU we recognise that trainees may require additional assistance to engage fully with their studies due to a range of access needs. Student Advice plays a key role in co-ordinating services available to BGU’s disabled and sensory impaired students, and/or with specific learning differences or other access needs before and during their studies. In order to assess the level of support trainees may require, we use the legal definition of disability, which is wide ranging but includes:\n•\tSpecific learning differences including dyslexia\n•\tPhysical mobility difficulties\n•\tHearing impairments\n•\tVisual impairments\n•\tPersons requiring personal care\n•\tAutistic Spectrum Disorders including Asperger’s Syndrome\n•\tMental health difficulties\n•\tMedical conditions such as epilepsy, diabetes or asthma\n•\tPlease note that this is not an exhaustive list – trainees may have access needs that are not listed above. If you are unsure whether you have access needs which are covered by disability legislation, please contact Student Advice – we will be happy to offer advice and guidance.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"accreditedBodies":[],"createdAt":"2021-07-06T17:49:33.593Z","updatedAt":"2021-10-07T19:50:06.772Z"}
