{"id":"3c17f1f1-e695-473f-8836-57997d910e5b","name":"London South Bank University","code":"L75","type":"hei","isAccreditedBody":true,"urn":"133873","ukprn":"10004078","address":{"addressLine1":"London South Bank University","addressLine2":"103 Borough Road","town":"Southwark","county":"London","postcode":"SE1 0AA"},"contact":{"website":"https://www.lsbu.ac.uk/study/course-finder/primary-pgce","email":"admissions@lsbu.ac.uk","telephone":"+44 (0)20 7815 6100","fullName":"Department of Education"},"location":{"latitude":51.4979806,"longitude":-0.1023327},"trainWithUs":"London South Bank University is located in the centre of London, a 15 minute walk from Waterloo Station and 20 minutes from the Royal Festival Hall and the River. We were awarded Silver for Teaching Excellence in 2017. In August 2018 we won an [Advance HE’s Collaborative Award for Teaching Excellence](https://www.advance-he.ac.uk/news-and-views/ntfs-cate-announcement-2018) which recognises and rewards collaborative work that has had a demonstrable impact on teaching and learning across the University as a whole. We were the University of the Year for Graduate Employment in The Times and Sunday Times Good University Guide 2018 and in 2019. In [The Guardian University league tables 2019]( https://www.theguardian.com/education/ng-interactive/2018/may/29/university-league-tables-2019) our undergraduate Education courses were in the UK top 10 for graduate level jobs or further professional or higher education study after 6 months.\nCourses at LSBU have a particular focus on social justice and equality. This focus is well matched to addressing the needs of schools in urban and multicultural areas. We strongly welcome applications from members of Black, Asian and minority ethnic communities, as we are keen to ensure the teaching workforce is more representative of London's diverse population.","trainWithDisability":"We’re committed to removing barriers to your learning and enabling you to get the most out of your time at LSBU. We understand that every student is different and that each person’s disability can affect them in different ways. By discussing potential barriers and tailoring an individual support plan, we aim to help you achieve the success you’re capable of. Our disability advisers can help identify barriers and make reasonable adjustments to remove them for current and prospective students.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"createdAt":"2021-07-06T17:52:24.737Z","updatedAt":"2021-10-03T18:13:56.774Z"}
