{"id":"3c2b7bb3-71cc-4ae3-87b8-88f18b27d6d1","name":"Warwickshire Early Years Hub","code":"2KO","type":"lead_school","isAccreditedBody":false,"urn":"125488","ukprn":"10048037","address":{"addressLine1":"Kenilworth Nursery School & Early Years Teaching Centre","addressLine2":"Bertie Road","town":"Kenilworth","county":"Warwickshire","postcode":"CV8 1JP"},"contact":{"website":"http://warwickshire-eyh.co.uk","email":"Hutton.m2@welearn365.com","telephone":"01926 853394","fullName":"Michelle Hutton"},"location":{"latitude":52.342112,"longitude":-1.5765951},"trainWithUs":"The Warwickshire Early Years Hub, together with the CREC Early Years Partnership (CEYP) are committed to providing high quality teacher training experiences that allow a PGCE qualification with specialism in Early Education to be gained through a School Centred Initial Teacher Training (SCITT) programme. We provide access to a range of Primary, Infant and Maintained Nursery Schools across Coventry and Warwickshire who are all highly skilled in supporting teacher training with qualified mentors. You will gain excellent EYs and KS1 experience for the foundations of your teaching career. We are an Early Years Hub with 11 members, including 6 nursery schools. We tap into the expertise of our nursery school members to add additional pedagogical input into your programme and can flexibly respond to your needs through the course to add extra support where required. If you really enjoy working with young children, feel passionate about making a difference in their lives and about teaching, then this course is ideal for you. It will equip you with the skills to work with young children during some of their most crucial stages of development and provide an invaluable foundation for your teaching career.","trainWithDisability":"We aim to provide an accessible, inclusive course which is open to anyone applying with a disability. We can be flexible to support candidates who have additional needs and make reasonable adjustments to allow access to learning and practice. Trainees will be able to access the Student Support Team at Birmingham City University (where all Trainees are registered for their academic qualification) for specialist advice.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:51:32.316Z","updatedAt":"2021-10-12T19:57:42.101Z"}
