{"id":"3c2da793-4258-4aca-8fb3-efebba645770","name":"The Bardney Church Of England And Methodist Primary School","code":"1N2","type":"lead_school","isAccreditedBody":false,"urn":"120589","ukprn":"10078117","address":{"addressLine1":"Bardney Church of England and Methodist Primary School","addressLine2":"Henry Lane","town":"Bardney","county":"Lincoln","postcode":"LN3 5XJ"},"contact":{"website":"www.bardneyschool.co.uk","email":"garth.hicks@bardney.lincs.sch.uk","telephone":"01526 398255","fullName":"Garth Hicks"},"location":{"latitude":53.2116149,"longitude":-0.3158135},"trainWithUs":"An exciting opportunity has arisen for YOU!\nIf you want to train to be a teacher and already have a degree, the School Direct Training Programme could be for you.\nThe outstanding and experienced practitioners in our cluster work in partnership with Bishop Grosseteste University to provide high quality, school based initial teacher training, tailored to the individual student’s needs. Our staff are highly experienced at mentoring and supporting students who choose a school based training route. The high quality training we already provide on the School Direct programme has enabled all our previous school based students to successfully secure teaching positions. A particular strength of our partnership is the strength of support across the cluster. Students have the opportunity to develop their skills in a range of settings. Links between the cluster schools are very well established and there is a real intention to work together to prepare students to fill teaching vacancies within our cluster. All training places will be on the non-salaried route.","trainWithDisability":"Trainees with a variety of disabilities are successfully supported to achieve their ambitions of becoming a teacher.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:56:51.398Z","updatedAt":"2021-11-17T00:58:20.690Z"}
