{"id":"3c5152eb-6a77-4b85-ac33-742aeac2fd7e","name":"Sunderland Aim High Alliance","code":"1A7","type":"lead_school","isAccreditedBody":false,"urn":"140584","ukprn":"10044819","address":{"addressLine1":"Houghton Road","addressLine2":"Newbottle","town":"Houghton Le Spring Tyne & Wear","county":"Tyne and Wear","postcode":"DH4 4EE"},"contact":{"website":"http://www.newbottleprimaryacademy.co.uk","email":"denise.shovlin@aimhigh.co.uk","telephone":"1915005957","fullName":"Denise Shovlin"},"location":{"latitude":54.8531997,"longitude":-1.4766025},"trainWithUs":"Aim High Academy Trust is a not for profit, publically accountable, Multi Academy Trust within the clear geographical context of the Coalfields area of Sunderland. With a predecessor primary school history going back to 2006, the trust has the expertise, capacity and experience to secure transformational change and sustainable improvement within our schools.\nOur vision is to provide tailored and specific solutions to all the schools in our trust, through the involvement and co-ordination of our core improvement team (Executive Head Teacher, Assistant Executive Head Teacher, Academy Improvement leads and Finance lead) along with the sharing of outstanding practice between our families of schools.\nAim High Academy Trust is committed to inspiring, supporting and enabling all pupils to aim high, believe in themselves, achieve their full potential and develop the skills needed to succeed and enjoy life.\nOur Trust consists of 3 primary schools: Newbottle Primary Academy, Gillas Lane Primary Academy and Dubmire Primary Academy. Within our School Direct Alliance we are currently working closely with Deaf Hill Primary, Kelloe Primary and Hetton Primary. All schools offer high quality teacher training experiences and work together to support teaching students within their schools.\nWe offer tuition route school direct places: You will pay a tuition fee for your course.","trainWithDisability":"We follow the University of Sunderland Diversity Statement:\n\"We celebrate and value the diversity of all students and staff, working to ensure that all are welcome in our community and do not face discrimination or encounter barriers with regard to their disability.\"\nOn application please contact the Disability Support Team for disability related queries:\ndisability.support@sunderland.ac.uk\nTel: 0191 5152952","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:48:24.538Z","updatedAt":"2021-09-27T20:27:10.436Z"}
