{"id":"3c613eb7-ccea-4af6-aa86-db5e1fa3f9e3","name":"Lordswood Girls’ School and Sixth Form Centre","code":"1VK","type":"lead_school","isAccreditedBody":false,"urn":"136592","ukprn":"10033245","address":{"addressLine1":"Knightlow Road","addressLine2":"Harborne","town":"Birmingham","county":"West Midlands","postcode":"B17 8QB"},"contact":{"website":"http://www.lordswoodtrust.co.uk/","email":"k.adamson@lordswoodtrust.co.uk","telephone":"0121 429 2838","fullName":"Karen Adamson"},"location":{"latitude":52.4694938,"longitude":-1.9651511},"trainWithUs":"Lordswood Girls’ School is a school that does not stand still. We are constantly striving to improve on our best, be it with regard to school facilities and the educational opportunities that we offer students, or in the range of innovative projects in which the school is involved and which enable Lordswood Girls’ School to remain at the cutting edge of education.\n\nWe are very proud of our position as one of the top schools, both in Birmingham and nationally. The school has been ranked consistently within the top 10% of all schools nationally, based on examination performance at Key Stage 4 and enjoys an excellent reputation for its academic, sporting, and artistic achievements.\n\nLordswood Girls' School is a member of the Oaks Collegiate, a group of nine mainstream schools and one special school located in south west Birmingham. Together we work in partnership to develop best practice and improve the quality of learning in all Oaks schools. The collegiate is instrumental in developing and delivering teacher training and offers a comprehensive programme of continuing professional development. Network groups and courses support teachers at every stage of their career, from NQTs to middle and senior leaders.\n\nThrough our partnership with the Oaks collegiate we are able to offer teachers who train with us an opportunity to complete their placements in a range of schools; from single sex to co-educational, from special schools to sixth form centres. Further information about our partner schools can be found on our school website.","trainWithDisability":"[Information about disability access for students at University of Wolverhampton](https://www.wlv.ac.uk/current-students/student-support/student-support-and-wellbeing-ssw/)\n\n[Information about disability access for postgraduate students at the University of Birmingham](https://www.birmingham.ac.uk/study/support/index.aspx)","accreditedBodies":[],"createdAt":"2021-07-06T17:57:00.686Z","updatedAt":"2021-07-06T17:57:00.686Z"}