{"id":"3ccd7d4f-26bb-4885-af20-00c41ad8a285","name":"Churchfields Junior School","code":"2D7","type":"lead_school","isAccreditedBody":false,"urn":"133935","ukprn":"10069413","address":{"addressLine1":"Churchfields","addressLine2":"South Woodford","town":"Redbridge","county":"London","postcode":"E18 2RB"},"contact":{"website":"http://www.churchfieldsjunior.com","email":"admin.churchfields-jun@redbridge.gov.uk","telephone":"2085044650","fullName":"Rebecca Emeny"},"location":{"latitude":51.5986004,"longitude":0.023737},"trainWithUs":"We believe that teaching is an exciting, challenging and rewarding profession. We pride ourselves on having a proven track record over the past 15 years in training excellent practitioners and supporting them in gaining positions within our partnership schools. Redbridge Head Teachers in partnership with Forest Independent Primary Collegiate, the accredited provider, have written this highly comprehensive and bespoke programme. It reflects the exceptional standards in Redbridge schools and our understanding of what makes an excellent teacher. We are committed to offering high quality training for local candidates with the aim of securing the beginning of a successful career in a Redbridge school. We also aim to support trainees' careers after completing the programme through excellent CPD opportunities on offer from the Gants Hill Partnership Teaching Alliance. This includes subject knowledge and leadership training, and opportunities to take part in research and to work collaboratively with colleagues in other schools. There is also the opportunity to achieve a masters in your NQT year, taking forward an action research school direct module credit towards this qualification, through a successfully run school-led course in collaboration with UEL. The three lead schools (Mayespark Primary, Gearies Primary and Churchfields Junior School) will scrutinize the School Direct applications and place trainees in the partnership schools. These are excellent mainstream schools that are committed to supporting the process of the training in Redbridge.","trainWithDisability":"We welcome applications from candidates including those with special educational needs and disabilities. We aim to meet the challenge of all declared disabilities and other needs placing candidates in our diverse range of school. We are committed to supporting the full inclusion of individuals ensuring their needs are met. In Redbridge, we are proud of our inclusive practices meeting the needs of children and adults alike.\nOur locations are all DDE compliant.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"6033093f-acb8-4d05-8239-a622103af18f","code":"F82","name":"Forest Independent Primary Collegiate SCITT","description":""}],"createdAt":"2021-07-06T17:48:03.610Z","updatedAt":"2021-10-04T16:05:05.449Z"}
