{"id":"3ceb44af-261f-4fab-8c65-f3ced24ab9c4","name":"Yarrow Schools Alliance","code":"22P","type":"lead_school","isAccreditedBody":false,"urn":"119466","ukprn":"10040125","address":{"addressLine1":"St George’s CE Primary School","addressLine2":"Carr Lane","town":"Chorley","county":"Lancashire","postcode":"PR7 3JU"},"contact":{"website":"http://www.ysta.co.uk","email":"a.hitchen@st-georges.lancs.sch.uk","telephone":"1257262323","fullName":"Anna Hitchen"},"location":{"latitude":53.6419222,"longitude":-2.6205595},"trainWithUs":"Our vision is, first and foremost, to provide school-led ITT of the highest quality and we believe there is no better training ground for future teachers than in the classroom working alongside experienced professionals.\nYarrow Schools Teaching Alliance is led by St George’s CE – an outstanding primary school located at the heart of the community. We are a large Alliance of local schools firmly committed to the philosophy of improving outcomes for the children in our schools. We understand that the best way to achieve this is through quality teaching and it is this belief that led us to establish our highly successful ITT programme which has run now since 2014. All placements are organised by YSTA staff and take place in schools within the Alliance. Trainees can expect to spend 80% of their time in class gaining practical experience on how to provide challenging and meaningful teaching and learning opportunities. To complement this, there is regular theory based training delivered by Lancashire's Senior Consultants and other experienced practitioners. Our training programme ensures that trainees gain the skills and experience needed to become fully qualified and highly effective teachers able to take up a post in either Key Stage 1 or Key Stage 2.","trainWithDisability":"The Yarrow Schools' Teaching Alliance is committed to treating all applicants fairly and with respect, irrespective of their actual or assumed background, disability or any other protected characteristic. Applicants with a disability or need such as dyslexia, a medical condition or individual need which they believe could affect their performance during the selection process should notify the YSTA at the point of application in order that the selection panel can make adjustments to enable them to perform at their best.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:47:18.730Z","updatedAt":"2021-11-04T01:36:35.150Z"}
