{"id":"3d474c90-bb57-4736-9292-817062831717","name":"Aspirational Teaching Alliance of St. Helens","code":"1LA","type":"lead_school","isAccreditedBody":false,"urn":"136421","ukprn":"10034913","address":{"addressLine1":"Ashton Road","town":"Newton-leWillows","county":"Lancashire","postcode":"WA12 0AD"},"contact":{"website":"http://www.hopeacademy.org.uk/770/aspirational-teaching-alliance-st-helens","email":"Rachel.Bradburn@sthelens.org.uk","telephone":"1744671930","fullName":"Jeniffer Sing"},"location":{"latitude":53.4619503,"longitude":-2.6257904},"trainWithUs":"We aim to provide our aspiring teachers with the unique opportunity to develop into successful leaders of learning. We are incredibly passionate and committed in providing our students with a high quality education which enables them to thrive, both academically and spiritually. You will work alongside like-minded individuals and join us in our journey to outstanding as well as developing your own continual professional development. Our staff are eager to guide new members of staff in developing themselves as professionals so they can experience a truly rewarding career choice.\nHope Academy, a joint Catholic and Church of England Academy situated in Newton-le-Willows, is the lead school of the Aspirational Teaching Alliance and sponsored by Liverpool Hope University. Our Alliance has brought together a wide variety of schools so that your training experience will be a comprehensive one. It draws on the strengths and high achievements of our schools covering all key stages so that you will be fully qualified, prepared and equipped to contribute to educational improvement and school leadership as your own career develops.\nAs a training provider, we work in close partnership with Liverpool Hope University and several secondary schools across St. Helens to ensure that we provide stimulating and challenging training to all of our aspiring teachers. Our School Direct Teacher Training programme has been carefully planned to ensure that you receive a personalised experience, drawing on your own knowledge and experience so that you are the driver of your own success.","trainWithDisability":"We endeavor to support candidates with additional needs. Our course has previously supported candidates successfully with additional needs such as Dyslexia, Mental Health Conditions, English as an additional language, and both physical and hearing impairments. We work in close partnership with Liverpool Hope University and our St Helens partnership school to create bespoke care plans to ensure accessibility to our teacher training programme between both university and school based settings. Based on the needs of the individual successful candidates.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"e328aab3-a535-4921-8ded-5e37133c76dd","code":"L46","name":"Liverpool Hope University","description":"Accreditation of qualified teacher status awarded by Liverpool Hope University."}],"createdAt":"2021-07-06T17:55:56.643Z","updatedAt":"2021-09-16T18:21:27.095Z"}
