{"id":"3e0deb50-0f01-42ca-b225-59a385c48347","name":"Mills Hill Primary","code":"1Y3","type":"lead_school","isAccreditedBody":false,"urn":"105648","ukprn":"10070074","address":{"addressLine1":"Mills Hill Primary School, Baytree Avenue","town":"Oldham","county":"Greater Manchester","postcode":"OL9 0NH"},"contact":{"website":"https://www.millshill.oldham.sch.uk/initial-teching-training/48.html","email":"head@millshill.oldham.sch.uk","telephone":"1616241133","fullName":"Ian Mason"},"location":{"latitude":53.5478467,"longitude":-2.1657322},"trainWithUs":"To educate children is to take responsibility for shaping our future society. The children we teach today will become the adults who determine how our country develops and grows in the future. We have one chance to get this right. This is why being a teacher is the most amazing job in the world with incredible highs and the occasional low. In partnership with Leeds Beckett University we provide school direct placements across a small local cluster of schools in Oldham. We also work closely with Burnley Brow, Yew Tree, Mather Street, Stanley Road and St Hilda’s primary schools. Our alliance has been heavily involved in initial teacher training for around 10 years and is currently leading provision for 9 trainee teachers across 6 Schools. Since 2012, we have worked with cohorts from 6 to 18 and we have an excellent record in recruiting “our” trainees to our immediate cluster and to schools in the local area. Close to 95% of our trainees have secured jobs within teaching. Mills Hill currently employs 10 graduates of our training programme.\nAll schools within the alliance have experienced senior leaders as mentors. They have a friendly and approachable attitude towards training and supporting trainees. The alliance offers enhanced training days to support professional development and all students within the cluster train together for the school based training.","trainWithDisability":"Direct access to a highly trained senior member of staff enables concerns around disabilities and other needs to be readily addressed. Pastoral support on the programme is delivered initially through a school based mentor but also through the programme leads who are based at Mills Hill, Mr Norman, deputy head & Mrs Ivell, assistant head.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:51:46.372Z","updatedAt":"2021-09-17T17:24:09.907Z"}
