{"id":"3e12cc37-28f0-4b37-b77a-3b78044d48ba","name":"Elston Hall Learning Trust (St Bartholomew’s Multi Academy Trust)","code":"2JA","type":"lead_school","isAccreditedBody":false,"urn":"142349","ukprn":"10061031","address":{"addressLine1":"Elston Hall Primary School","addressLine2":"Stafford Road, Fordhouses","town":"Wolverhampton","county":"West Midlands","postcode":"WV10 6NN"},"contact":{"website":"http://www.elstonhall.org.uk/","email":"rwood@ehlt.org.uk","telephone":"01902 558866","fullName":"Bridget Highman"},"location":{"latitude":52.6231263,"longitude":-2.1269889},"trainWithUs":"Elston Hall Learning Trust and St Bartholomew's Multi Academy Trust offers trainee teachers the unique opportunity to work and learn at exciting and innovative primary schools. All our schools share a common ethos and approach to pedagogy, ensuring that pupils become confident lead learners, achieving the highest standards possible.\nOur schools from within both Trusts have a proven track record of working in partnership with local universities and other outside agencies. We are passionate about growing future leaders and believe that School Direct and Teaching Apprenticeship routes offer an unrivalled opportunity for trainees to learn and develop in our vibrant schools.\nBy working within the Trusts, trainees will experience a range of contrasting challenges that will make them highly marketable in the current job market. Your school will provide you with a fully qualified mentor and CPD in school which will complement the training received at Wolverhampton University and Birmingham City University.\nOur excellent partnerships with the University of Wolverhampton and Birmingham City University mean that students will receive high-quality hands-on support from day one. This will continue as you take up your first appointment as an Early Career Teacher (ECT) and throughout your career.","trainWithDisability":"Elston Hall Learning Trust and St Bartholomew's Multi Academy Trust supports an inclusive vision. Where needed, we will make reasonable adjustments to support disabled job applicants and employees. We want to make sure that all our students get the most from training with us. By telling tell us about your disability as early as possible, we can identify any support that you may need.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:54:55.499Z","updatedAt":"2021-10-15T22:21:25.786Z"}
