{"id":"3e6c62a3-5d34-4a91-9c23-01c7409fd909","name":"University of Leicester","code":"L34","type":"hei","isAccreditedBody":true,"ukprn":"10007796","address":{"addressLine1":"21 University Road","town":"Leicester","county":"United Kingdom","postcode":"LE1 7RF"},"contact":{"website":"http://www.le.ac.uk/pgce","email":"educationdept@le.ac.uk","telephone":"0116 252 3676","fullName":"School of Education"},"location":{"latitude":52.6211393,"longitude":-1.1246325},"trainWithUs":"The School of Education has a long and successful history of teacher training and a strong reputation for producing graduate teachers prized by schools.\nThe School of Education is located in the heart of Leicester, identified in recent research as one of the most affordable study destinations in Britain. We are within five minutes’ walk of both the railway station and the main University of Leicester campus with its student support services and award-winning library.\nThe School of Education works in partnership with over 150 local schools. They represent an unusually varied and interesting range of institutions, including rural village schools, suburban and inner city schools and academies, and special schools. Many of the schools have a diverse, multi-ethnic population. Training to teach here provides the solid foundations to teach in a range of different contexts.\nWe are also a proactive partner with individual schools and alliances who offer the University of Leicester PGCE via the School Direct and SCITT training routes. Our close and collaborative relationship with partner schools ensures that, whichever training route they choose, University of Leicester PGCE students benefit from the same wide-ranging but consistently high quality experiences.","trainWithDisability":"The School of Education's AccessAbility Tutor will contact all students who declare a disability and offer advice about the support which they may be entitled. We ask students to tell us how their disability may affect their learning and any adjustments they needed in order to access their studies.\nThese requests, with students' permission, are passed on to the relevant tutors, lecturers and schools so that they can accommodate all student needs.\nStudents can contact the School of Education's AccessAbility Tutor and the University's AccessAbility Centre for further advice or to report a problem.\nSome examples of how we support students with disabilities include:\n• Accessible school placements provided for students with a physical disability.\n• Tutors who are sensitive to the needs of students with mental health difficulties.\n• Slide presentations and resources are made available to all students at least 24 hours before a session takes place.\n• The AccessAbility Centre provides after hours appointments for PGCE students who are on placement and unable to attend during the day.\n• Disabled parking permits are provided to enable students with physical disabilities to park close to university buildings.\n• A variety of lesson planning templates is discussed with students with dyslexia to identify one that meets their needs and aids progression.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"createdAt":"2021-07-06T17:56:35.773Z","updatedAt":"2021-10-05T14:35:39.380Z"}
