{"id":"3f5b1139-3651-4ee5-845c-54cd9e999b08","name":"University of Chichester","code":"C58","type":"hei","isAccreditedBody":true,"urn":"133868","ukprn":"10007137","address":{"addressLine1":"Bognor Regis Campus","addressLine2":"Upper Bognor Road","town":"Bognor Regis","county":"West Sussex","postcode":"PO21 1HR"},"contact":{"website":"https://www.chi.ac.uk/teaching/","email":"admissions@chi.ac.uk","telephone":"01243 816002","fullName":"Admissions"},"location":{"latitude":50.7889941,"longitude":-0.6650175},"trainWithUs":"We are recognised as one of the leading institutions in the country for teacher training, we have a long and distinguished record of training teachers dating back to 1839.\n- We offer high-quality training and experience that will prepare you to become a confident and effective teacher\n- Much of your training will be practical, school-based experiences\n- You’re supported throughout your school-based learning by experienced mentor teachers and university tutors\n- You’ll gain a respected professional qualification in a career of major importance\n- You’ll learn how to use research to improve your teaching skills\n- Our courses have varied content, including: lectures, seminars, presentations, group tasks, mini-research projects and assessments\n- You’ll develop a range of communication, interpersonal and problem-solving skills that will be invaluable in a teaching career and beyond\n- Political and public policy announcements are built into the curriculum, so you will be up to date on contemporary teaching issues.","trainWithDisability":"The University of Chichester has an outstanding reputation for student satisfaction and retention and one of the key underlying factors is the excellence of our support services. Our aim is to support your experience as a student by listening, advising and offering a range of professional services.\nAs a student you could benefit from specific types of support, for example, sorting out your finances, managing a disability, looking after your health, getting through a tough period, planning your future or a host of other needs and combinations of needs.\nWe have teams of highly qualified specialists to support all students whatever the need and with an exceptional ‘Support and Information Zone’ (SIZ) providing a friendly and accessible first point of call.\nFor more information about specific services see: https://www.chi.ac.uk/study-us/student-services For students with specific needs, the university can work with those individuals and our partner schools to ensure that reasonable adjustments are put in place to ensure success while on placement.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"createdAt":"2021-07-06T17:46:46.977Z","updatedAt":"2021-11-25T20:55:18.687Z"}
