{"id":"406ae1ab-7a0a-4254-b930-79e8fcd509a3","name":"Shires Teaching Alliance","code":"2EB","type":"lead_school","isAccreditedBody":false,"urn":"136786","ukprn":"10058699","address":{"addressLine1":"Crooks Lane","town":"Studley","county":"Warwickshire","postcode":"B80 7QX"},"contact":{"website":"https://www.shiresmat.org.uk/teacher-training/","email":"traintoteach@shiresmat.org.uk","telephone":"1527852478","fullName":"Amy Page"},"location":{"latitude":52.2690755,"longitude":-1.8984383},"trainWithUs":"Shires Teaching Alliance is a collaboration of schools across South Warwickshire in partnership with the University of Worcester. We offer the opportunity to train to teach through a one year postgraduate programme in a culture of excellence, with nurture, support, mentoring and respect at its heart. We aim to ensure that you are challenged to be the best teacher you can be. We offer enrichment opportunities across our alliance schools from leadership pathways to half-day experiences in age groups and subjects outside of your specialism. This programme and the people you will encounter, will guide you through your first steps into the rest of your teaching career. The Shires Alliance comprises multiple schools and academies who have the experience, capacity and passion to deliver outstanding teacher training to the next generation of teachers.\nThere is no escaping that your training will bring challenges as well as successes. We believe that to be highly effective teacher, you need to receive the tools, support and motivation right from the start. We focus on full immersion into school life, putting theory into practice. Train with us and you can expect the highest levels of experience from educators who are passionate about their profession. Our aim is simple: we want to nurture acorns into oaks and your needs are at the heart of our training programme. Please visit our website [Shires TSA](https://shirestsa.co.uk/teacher-training)","trainWithDisability":"We want to support you and where possible, make reasonable adjustments to help you overcome physical and mental health barriers whilst you are training and in your school placements.\nIf you have study support needs related to a physical or health condition: dyslexia and other specific learning difficulties; mental health difficulties; autism or Asperger’s Syndrome, we are here to help you. If you have complex support requirements, particularly mobility, care or transition support, we would welcome you contacting us to discuss how we can support your teacher training year.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:46:54.548Z","updatedAt":"2021-09-17T22:59:04.439Z"}
