{"id":"4151da2c-ff17-46d4-bbfa-11fb57e76a24","name":"St Marys Menston","code":"1AA","type":"lead_school","isAccreditedBody":false,"address":{"addressLine1":"Bradford Road","addressLine2":"Menston","town":"Ilkley","county":"Leeds","postcode":"LS29 6AE"},"contact":{"website":"http://www.stmarysmenston.org/teacher-training-and-development","email":"r.wayman@stmarysmenston.org","telephone":"01943 883000","fullName":"Richard Wayman"},"location":{"latitude":53.8837297,"longitude":-1.7278185},"trainWithUs":"Trainees applying to St. Mary’s School Direct follow the Leeds SCITT course. St. Mary’s, Menston is currently the lead school for Mathematics English and RE with other schools in Leeds taking this role for other subjects. You may or may not be placed at St. Mary’s during the year. Leeds SCITT is one of the longest operating SCITTs in West Yorkshire with enviable employment rates. Working in partnership with Leeds Trinity University, initial teacher training courses offer both QTS and a Professional Graduate Certificate of Education (PGCE) (FHEQ Level 6). PGCE students are registered to study for a Postgraduate Certificate in Education qualification (PGCert) (FHEQ Level 7) and awards are from Leeds Trinity University.\nAll PGCE courses with Leeds SCITT are offered in the 11-16 age range with the opportunity to experience teaching at post-16 level.\nAs a Leeds SCITT trainee teacher, you will be immersed in the school environment from week one and you will be seen as a professional by school staff, pupils and parents. This allows you to take the theory, thinking and research and see / implement this in the classroom, ensuring you develop your ‘teacher’ persona as quickly as possible.","trainWithDisability":"We are committed to ensuring that every student with potential, regardless of their background or circumstances, has the opportunity to benefit from higher education. If you have a disability or additional needs, Leeds Trinity University and St. Mary's, Menston will endeavour to put in place reasonable adjustments to accommodate any additional requirements throughout your teacher training year. We are able to support with conditions such as: -\tDyslexia\n-\tSpecific learning difficulties\n-\tAsperger syndrome/autism\n-\tVisual/hearing impairments\n-\tPhysical and mobility restrictions\n-\tLong-term medical conditions\n-\tA mental health condition If you register with Leeds Trinity's Disability Service, a member of the team will develop a Learning Support Plan tailored to your specific needs. The support within this plan could include exam adjustments, extended library loans, specialist one-to-one study skills, dyslexia screening and assessments, learning materials provided in alternative formats and alternative assessments.\nWith your permission, they will share this plan with your personal tutor so that they know how to best support you during your training. They can also share this plan with the School Partnerships team, who are able to inform the host schools for your placements so they can discuss how to best support you during your school-based training.","accreditedBodies":[{"id":"f8a389ed-1e76-445c-8d11-34e8979ed40e","code":"L26","name":"Leeds SCITT","description":""},{"id":"19a3446e-382d-4c14-83bb-a76563cef3c1","code":"L24","name":"Leeds Trinity University","description":""}],"createdAt":"2021-07-06T17:51:51.125Z","updatedAt":"2021-09-22T21:53:12.627Z"}