{"id":"41d8835a-6727-4c7c-bb0e-23e8149bb539","name":"Learn-AT School Direct","code":"237","type":"lead_school","isAccreditedBody":false,"urn":"145203","ukprn":"10007796","address":{"addressLine1":"Church Langton CE Primary School","addressLine2":"Stonton Road","town":"Church Langton Nr Market Harborough","county":"Leicestershire","postcode":"LE16 7SZ"},"contact":{"website":"https://www.teachingschool.learnat.uk/page/?title=Initial+Teacher+Training&pid=6","email":"schooldirect@clp.learnat.uk","telephone":"01858 383155","fullName":"Tracy Bastock"},"location":{"latitude":52.5339627,"longitude":-0.9321806},"trainWithUs":"We are based in the South East of Leicestershire near Market Harborough. We have good road links being close to the A6, A47 and A14.\nWe have delivered a Primary PGCE teacher training programme in partnership with the University of Leicester since 2014, initially as Church Langton School Direct and now as Learn-AT School Direct. We provide high quality teaching placements across our excellent group of local schools. We can be flexible and allocate teaching placements according to your needs and experiences, matching you with the best schools for you. We have a range of highly skilled, experienced specialist teachers whom you can learn from. Training opportunities will be available to you across all the schools we work with.\nWe are very excited to be providing the Maths and English strands of your academic training. Our specialist teachers work closely with the University to provide masters level training whilst drawing on practical, classroom based experiences.\nWe are proud to be part of the Diocese of Leicester and many schools we work with are Church Schools. The Diocese take an active role in the RE training we provide.\nAt Learn-AT Teaching School we are privileged to work teachers who are specialists in their field. These specialists run workshops for our trainees in areas such as Art, Music and Design.\nSo if you want to teach in a range of engaging Primary Schools and have a say in where your training takes place then Learn-AT School Direct is the course for you!","trainWithDisability":"Please get in touch with us directly if you wish to discuss any particular needs or disabilities. We will do everything we can to support you:\n\nTeaching School Office: (01858) 383155\n\nSchool Direct Mobile: 07596 659380","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:55:40.156Z","updatedAt":"2021-10-04T17:17:40.431Z"}
