{"id":"426b1039-5a78-435d-bf2d-252a3bbb2ed9","name":"Wessex Teach","code":"1QW","type":"lead_school","isAccreditedBody":false,"urn":"137163","ukprn":"10034818","address":{"addressLine1":"Thomas Hardye School","addressLine2":"Queen’s Avenue","county":"Dorchester","postcode":"DT1 2ET"},"contact":{"website":"http://www.thomas-hardye.dorset.sch.uk/","email":"lcheney@thomas-hardye.net","telephone":"1305266064","fullName":"Laura Cheney"},"location":{"latitude":50.7083775,"longitude":-2.4537026},"trainWithUs":"The Dorset Teaching School Alliance ITT partnership is designed and led by outstanding school practitioners, giving our trainee teachers practical training, support and advice, combined with classroom experience in a range of schools.\nWe are based at The Thomas Hardye School, an outstanding school which is committed to maximising the potential of every young person through inspirational teaching. As a training provider we are committed to the following: * Ensuring a comprehensive network of support for trainees – we recognise the challenges that our trainees face and we place great emphasis on support provided both within and outside of the classroom.\n* Offering high quality training and development sessions – our weekly training sessions are delivered by expert practitioners across a wide range of topics. We also run regular reflective sessions whereby trainees can share their experiences in a coaching environment.\n* Ensuring a rich experience for trainees across the age range with partner schools – we work closely with a large number of local schools across all phases in both mainstream and special schools. In addition our trainees enjoy the challenge of working with Year 12 and 13 students in the highly regarded Thomas Hardye sixth-form\n* Developing a culture of reflection and continuous development for sustained learning beyond the first year – our trainees benefit hugely from the wide range of CPD opportunities available to all staff, and they are very well prepared for their NQT year.","trainWithDisability":"We are able to provide extensive individual support to candidates with disabilities and other needs. As a relatively small training provider we pride ourselves on the quality of our provision which really is geared towards individual needs. Examples of support on offer include:\n* Specialist software to assist trainees with specific learning difficulties/conditions * Fully accessible school sites for those with physical disabilities\n* Access to a range of counselling services to support trainees with mental health conditions\n* One-to-one support outside of subject areas to support trainees experiencing emotional/social difficulties","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:49:09.458Z","updatedAt":"2021-11-22T23:59:11.440Z"}
