{"id":"42bce8af-e86c-4e4a-b811-3dc72ef20ed4","name":"Future Teacher Training","code":"P58","type":"scitt","isAccreditedBody":true,"ukprn":"10043978","address":{"addressLine1":"Pimlico Academy","addressLine2":"Lupus Street","county":"London","postcode":"SW1V 3AT"},"contact":{"website":"https://www.futuretraining.org/page/?title=Courses+on+Offer%3A+QTS+and+PGCE&pid=13","email":"info@futuretraining.org","telephone":"7471246588","fullName":"Emma Burbidge"},"location":{"latitude":51.4880378,"longitude":-0.1375772},"trainWithUs":"Future Teacher Training (formerly Pimlico - London SCITT) is part of Future Academies, a family of schools which has built a reputation for achieving the highest standards for all its pupils. There are 10 schools in the Multi Academy Trust across London and Hertfordshire and they are all committed to the same vision, guided by our motto: ‘libertas per cultum’, (Freedom Through Education) offering a traditional education that is knowledge-rich and furnishes children with the freedom to choose a path in life that they value. At Future Teacher Training we have an unrelenting focus on producing trainee teachers of the highest calibre, characterised by their deep subject knowledge, and desire to become expert teachers and leaders.\nOur Initial Teacher Training curriculum is unique and is designed intentionally and sequenced iteratively, building upon what we know about cognitive science and the road to becoming an expert teacher. We deliver weekly training sessions where we aim to disseminate a research-informed aspect of training that links to our curriculum strands. Our training is rooted in exploitation of examples and non-examples to exemplify how to apply this to your teaching practice. We endeavour to bust lingering educational myths and ensure trainees have access to exemplar curriculum resources. These sessions are combined with practice-based, often subject-specific training to empower trainees to apply the pedagogical principles to their own subject and classroom, with the oversight of subject experts who can model best practice and give feedback, whilst working collaboratively with your subject/phase peers.","trainWithDisability":"The needs of the candidates will be taken into account at interview. Trainee teachers benefit from a mentor who leads their support throughout their training. \n\nThe central SCITT team meets with trainee teachers weekly through our Professional Studies programme. This allows us to regularly update our risk assessment of the trainee teacher and adapt the course accordingly. For the right candidate(s), we may also be able to support part-time. This would be discussed at the interview stage.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:46:51.673Z","updatedAt":"2021-10-12T19:33:29.588Z"}
