{"id":"43339609-e75d-4229-bc10-ca6cc0246cc0","name":"Field Lane J I & N School","code":"1UN","type":"lead_school","isAccreditedBody":false,"address":{"addressLine1":"Field Lane JI&N School","addressLine2":"Albion Street","town":"Batley near Leeds","county":"Kirklees","postcode":"WF17 5AH"},"contact":{"website":"http://fieldlanepri.kgfl.dbprimary.com/kgfl/primary/fieldlanepri","email":"office.fieldlane@fieldlaneschool.co.uk","telephone":"01924 326378","fullName":"Mandy Williamson"},"location":{"latitude":53.7096266,"longitude":-1.6300412},"trainWithUs":"You will be based in one of the schools within Batley and Birstall area (BBEST) four days a week from the start term in September. The fifth day will be Core Training. This will be based on which school we feel will support you in your age preference.\nYou are training to teach 5-11 age range but some of the schools in our partnership have nurseries which enhances your training opportunities.\nYou will spend most of the year in one school with a second experience in a contrasting school (usually Christmas to February half term).\nWorking alongside your classroom mentor, you will identify your current level of knowledge, skills and experience and from that draw up a training plan. This will involve observing experienced teachers, other teaching experiences and training activities leading to delivering whole lessons.\nBy the end of the training year you will be fully equipped to deliver lessons in your chosen phase.\nIn order to gain Qualified Teacher Status (QTS) you have to be judged competent against the Teacher Standards\nFor Kirklees & Calderdale SCITT this involves:\n•3 Evidence Bundles (these are training activities which focus on a group of standards)\n•2 Assignments (these form the concluding part of the Evidence bundle)\n•Tutor visit reports - your Tutor will visit you half-termly\n•3 Periodic Reports - your school will write a report at the end of each term","trainWithDisability":"The Kirklees & Calderdale SCITT is committed to Equality and Diversity. All partner organisations and all schools participating in the programme have clearly established policies, processes and systems for monitoring. All trainees will be introduced to their school’s policy through focused training by the host school.\nThe Kirklees & Calderdale SCITT is committed to the achievement of equal opportunities. This is central to our mission as a provider of school-based teacher training and have a proven track record of supporting trainees with additional needs.","accreditedBodies":[{"id":"74d0e1b3-80ac-4a0e-b93d-f19cb6587144","code":"1WK","name":"Kirklees and Calderdale SCITT","description":"Kirklees and Calderdale SCITT are an established and successful teacher training provider and have been training teachers across West Yorkshire since 2003, rated ‘Good’ in our Ofsted Inspection in 2015.\\r\\n\\r\\nAs a trainee you will benefit from experienced mentors in school, supporting you on a daily basis. This runs alongside highly regarded tutors and core team who ensure your training year is a positive and successful experience in becoming a qualified teacher."}],"createdAt":"2021-07-06T17:56:30.826Z","updatedAt":"2021-09-15T20:31:26.481Z"}