{"id":"433613c8-568b-4f15-9bb6-2adb76d62764","name":"Yeovil Area Teacher Training Alliance","code":"28Y","type":"lead_school","isAccreditedBody":false,"urn":"123944","ukprn":"10007792","address":{"addressLine1":"YATTA (Fiveways School)","addressLine2":"Victoria Road","town":"Yeovil","county":"Somerset","postcode":"BA21 5AZ"},"contact":{"website":"www.yatta.org.uk","email":"contact@yatta.org.uk","telephone":"1935411384","fullName":"Ian Baker"},"location":{"latitude":50.9482603,"longitude":-2.6147312},"trainWithUs":"Yeovil Area Teacher Training Alliance (YATTA) lead innovative school-led initial teacher training programmes, combining expertise from both special education and mainstream primary. We enjoy a strong and well-established ITT partnership, which includes an excellent track record of trainees gaining employment before the end of the course, and are very proud to have among our trainees those who have received the prestigious Ted Wragg Award, given in recognition of outstanding contribution and achievement.\nTrainees undertake placements within a valued partnership of highly regarded Somerset schools, providing a range of contrasting experiences and opportunities to learn and teach alongside excellent teachers, and gain qualified teacher status (QTS).\nTrainees also qualify with a Post Graduate Certificate in Education qualification (PGCE), accredited by the University of Exeter. Trainees on this course also benefit from the following:\n- Bespoke, curriculum training programmes, covering a wide range of curricular areas and led by experienced practitioners;\n- Local teaching placements and designated time to study from home, with only limited requirement to attend university or college;\n- A personal approach with full pastoral support and direct access to Programme Leaders;\n- Support with securing a first teaching post, including training for interviews;\n- Enhanced opportunities for interviews when applying for teaching posts within partnership schools;\n- Full support from the University of Exeter, including personal tutor and access to library resources/online learning materials.","trainWithDisability":"We offer a fully inclusive training programme and applications are welcomed from candidates with disabilities and other needs.\nFor trainees requiring support with subject knowledge, support plans in English and mathematics are provided. The programme endeavours to support individual needs accordingly.\nThe University of Exeter provides comprehensive student services that include AccessAbility and Wellbeing teams, Student Learning Skills Service, Student Advice Unit, Counselling Service, Students’ Union Advisors, Student Health Centre, Family Centre and the Chaplaincy. For further details on the wealth of support available to you please go to Student Support Services (http://www.exeter.ac.uk/newstudents/supportandservices/yourhealthandwelfare/).\nPGCE trainees can access the support of a Wellbeing Services Welfare Consultant to discuss concerns, talk through options for support or understand more about how the University Wellbeing Services may be able to help.\nAlongside the support described above, every PGCE trainee is assessed by an Occupational Health provider as part of the admissions process to ensure they are fit to teach in a school setting. The Occupational Health provider can recommend ‘Reasonable Adjustments’, which will be put into place by the provider, providing they are logistically possible and reasonable.\nShould you wish to discuss your particular needs, prior to application, please do not hesitate to contact us.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"accreditedBodies":[],"createdAt":"2021-07-06T17:51:13.237Z","updatedAt":"2021-10-18T14:57:40.202Z"}
