{"id":"43670709-fc69-4edf-8f5a-e6ed6d4386a9","name":"Maiden Erlegh Institute","code":"1Y1","type":"lead_school","isAccreditedBody":false,"urn":"136637","ukprn":"10033353","address":{"addressLine1":"Maiden Erlegh School","addressLine2":"Silverdale Road","town":"Earley","county":"Reading","postcode":"RG6 7HS"},"contact":{"website":"www.maidenerleghinstitute.org","email":"MEIOffice@maidenerleghtrust.org","telephone":"0118 9262467","fullName":"Richard Hawthorne"},"location":{"latitude":51.4373034,"longitude":-0.9254626},"trainWithUs":"Maiden Erlegh Institute is based at the 'Outstanding' rated Maiden Erlegh School in Berkshire and is part of the Maiden Erlegh Trust. \n\nWe provide excellent high quality training to new and current teachers. We collaborate with a variety of schools and organisations to learn together, to ensure the nurturing of the next generation of learners, teachers and leaders. \n\nWe participate in the Schools Direct Programme of school-led training and work closely with The University of Reading to deliver training.\n\nWith the University of Reading being so close to our teaching school, we have a strong partnership with the university. Reading is a vibrant town, with excellent employment opportunities. \n\nWe offer training in a variety of secondary schools and all key stages. You can train at Maiden Erlegh School or another school partner. \n\n\nIf you have any questions, please get in touch.\nMEIOffice@maidenerleghtrust.org","trainWithDisability":"Maiden Erlegh Trust takes very seriously its responsibilities and duties under the Equality Action. Our motto of \"schools for the community, schools as a community\" as well as our vision and ethos illustrate our commitment to treat everyone fairly and respectfully, to embrace and celebrate difference and to support every student in our schools to meet their potential.\nMaiden Erlegh Trust will fulfil its statutory Public Sector Equality Duty to consider needs of students and their families, employees, governors, visitors and contracted service providers in terms of:\n•Eliminating unlawful discrimination*, harassment and victimisation and other conduct prohibited by The Act.\n•Advancing equality of opportunity between people who share a protected characteristic and those who do not.\n•Fostering good relations between people who share a protected characteristic and those who do not.","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"6439adcc-af64-4d3d-a1da-de045755db06","code":"R12","name":"University of Reading","description":"The University of Reading’s Institute of Education is an established provider of high-quality training and research. It is ranked 10th in the UK for Education (The Guardian University League Table 2022).\\r\\nCommitted to developing caring, reflective, professional teachers, it has well-established partnerships with over 400 schools in Berkshire and the surrounding area.\\r\\n\\r\\nOfsted report that the “effective relationships with partner schools support the development of high quality teaching and trainees that are well-prepared to work in the region’s schools.” (ITE inspection report, September 2016)."}],"createdAt":"2021-07-06T17:50:22.456Z","updatedAt":"2021-09-27T17:29:19.166Z"}
