{"id":"43920484-d42a-42ca-8071-74b1ff5e81cc","name":"The Sheffield SCITT","code":"S97","type":"scitt","isAccreditedBody":true,"ukprn":"10037587","address":{"addressLine1":"Notre Dame High School","addressLine2":"Fulwood Road","town":"Sheffield","county":"South Yorkshire","postcode":"S10 3BT"},"contact":{"website":"https://www.sheffieldscitt.org.uk/information-and-events/","email":"admin@sheffieldscitt.org.uk","telephone":"1142302536","fullName":"The SCITT Manager"},"location":{"latitude":53.3719804,"longitude":-1.5195327},"trainWithUs":"The Sheffield SCITT is owned and run by Notre Dame High School, Sheffield. Notre Dame has been judged ‘Outstanding in all areas’ by OFSTED and The Sheffield SCITT was recently judged ‘Good’ by OFSTED for the quality of its teacher training.\nOur partnership schools all see The Sheffield SCITT as the best way to find and develop their own future teachers. The Sheffield SCITT aims to supply most of the Newly Qualified Teacher needs of our partnership of schools. Whilst we cannot guarantee jobs for all trainees at the end of the course, the vast majority of trainees secure jobs within our partnership. We remain small enough to know every trainee as an individual and give every partner school a voice in the running of the SCITT, but large enough to offer our trainees a diverse and bespoke experience of a different schools within the partnership - including Academies, Maintained Community Schools, Church Schools, those in multicultural inner cities, secondary schools with large sixth forms and primary schools with early years centres.\nOur Lead School is one of a small number of schools designated as part of the Research School network. This means that your training is informed throughout by the evidence base as to what makes the effective teaching.\nOur course includes the opportunity to study for a PGCE in Secondary Education (PGCSE) during your ITT year. The PGCE is offered through The University of Hull.","trainWithDisability":"Our aim is to meet the unique needs of every trainee, specifically by taking reasonable steps to ensure that disabled trainees and applicants are not put at a substantial disadvantage by comparison with trainees and applicants who are not disabled.\nWe cannot do this unless we know you have a disability. We encourage all our applicants to declare their disability on their application form and to discuss their requirements with us at interview. While disabled access to our schools is good we can only place trainees at the most suitable school to meet their needs if we know what those needs are.\nIn addition to one to one support from your mentors and subject leaders we currently provide all our trainees access to free access to the Westfield Healthy Extras which provides support throughout the year. The Sheffield SCITT has a ‘Reasonable Adjustments Policy and Procedure’ which underpins this approach and is available on request by emailing admin@sheffieldscitt.org.uk","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:52:34.688Z","updatedAt":"2021-09-10T17:53:57.966Z"}
