{"id":"43b1a864-362f-4bc3-a929-616100971340","name":"Barrow CEVC Primary School","code":"1MJ","type":"lead_school","isAccreditedBody":false,"urn":"124690","ukprn":"10006399","address":{"addressLine1":"Colethorpe Lane","addressLine2":"Barrow","town":"Bury St Edmunds","county":"Suffolk","postcode":"IP29 5AU"},"contact":{"website":"https://connected.barrowcevcprimaryschool.co.uk","email":"admin.connected@barrowcevcprimaryschool.co.uk","telephone":"01284 810223","fullName":"SDS Business Support"},"location":{"latitude":52.2455985,"longitude":0.5777505},"trainWithUs":"Teaching is one of the most exciting, rewarding and challenging career choices and Barrow CEVC Primary School, which is a Lead School for Suffolk and Norfolk and the Cambridge Teaching Schools Network SCITTs, is proud of its contribution to the recruitment of high calibre teacher trainees.\nBarrow CEVC Primary School is an outstanding, one-form entry primary school; a vibrant learning community where excellence, equality and high expectations of all pupils are promoted within a strong Christian ethos. At Barrow, children are valued as individuals and teachers are passionately committed to their achievement and personal growth.\nBarrow School CEVC Primary School offers a broad, balanced and academically rigorous curriculum for all learners. Teachers strive to craft a learning environment which nurtures pupils' minds, bodies and souls to develop happy, healthy and well-rounded citizens of the world.\nChildren are encouraged to take responsibility for their own learning; they are involved as far as possible in reviewing the way they learn and prompted to reflect on how they learn best. The school's performance data is almost always above the national and county averages, sometimes significantly so.\nBarrow CEVC is a provider of continuing professional development for teaching, learning and leadership in primary schools through 'ConnectED'.\nMore information about the Initial Teacher Training providers with which Barrow CEVC Primary works can be found below.","trainWithDisability":"Suffolk and Norfolk SCITT supports all trainees based on their individual needs. Recently this has included those with dyslexia, physical, hearing and visual impairments and mental health conditions. Plans are developed with trainees to ensure that they can fully access in centre training, operate effectively on school placement and complete written assignments.\nSuffolk & Norfolk Primary SCITT training venues in Ipswich and Norwich have full disabled access as do partnership schools. However, applicants who would benefit from disabled access should let us know on their application so that they can be considered for placements at the most appropriate schools.\nThe Cambridge Teaching Schools Network (CTSN) feels that teachers with disabilities make an important contribution to schools both in the classroom and in shaping the wider culture and ethos of schools in which they work. If you have special requirements, and you are invited to attend an interview, please let CTSN know beforehand so reasonable adjustments can be made. CTSN wants all interview candidates to have an equitable and enjoyable experience, regardless of any disability. All trainees are required to complete a medical check when they receive the offer of a training place. This will identify if adjustments are required. As a training provider, CTSN will make such adjustments in its training. Trainees are encouraged to disclose all relevant information with placement schools to enable them to make suitable provision. If you receive an offer, but have not yet disclosed a disability or other need, you can disclose at any time.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"89831af6-535f-471b-aa97-098bd1a93291","code":"S13","name":"Suffolk and Norfolk Primary SCITT","description":"The Suffolk and Norfolk Primary SCITT programme is a personalised, relational and ethical training provider. Primary SCITT has very high attainment and employment outcomes for trainees. On average 95% of trainees are employed in local schools by the end of their training year. \\r\\n\\r\\nTrainees are supported by school mentors and SCITT Tutors who have a range of experience in schools as classroom practitioners and often headteachers or members of senior leadership teams, so have a wealth of experience to share with trainees. \\r\\n\\r\\nThe Primary SCITT course is a highly personalised course which offers a wide range of opportunities to trainees."},{"id":"16075b74-df88-4bcc-b3ce-6e42f63261d5","code":"1WO","name":"The Cambridge Teaching Schools Network, CTSN SCITT","description":"CTSN SCITT offers school-centred teacher training across the Eastern Region:\\r\\n* All applicants are able to choose whether they attend the Core Training in Cambridge or Bury St Edmunds.\\r\\n* There is a wide range of placement schools.\\r\\n* Most trainees get jobs working in local schools. \\r\\n* Course tutors are expert teachers, which means that our training is not only evidence-based, but also informed by current practice. \\r\\n* Non salaried (tuition fee) routes lead to QTS plus PGCE, with the Anglia Ruskin University.\\r\\n* Salaried routes are also available, leading to QTS.\\r\\n\\r\\nPlease see [CTSN SCITT](https://ctsnscitt.info) for more information."}],"createdAt":"2021-07-06T17:50:05.559Z","updatedAt":"2021-10-01T22:48:59.188Z"}
