{"id":"43c2e3e6-8768-4db6-b55f-c6c538c67ec8","name":"Ashfield School ITT","code":"2L9","type":"lead_school","isAccreditedBody":false,"urn":"137981","ukprn":"10036962","address":{"addressLine1":"Ashfield School","addressLine2":"Sutton Road","town":"Kirkby in Ashfield","county":"Nottinghamshire","postcode":"NG178HP"},"contact":{"website":"www.ashfield.notts.sch.uk","email":"ashfieldschoolitt@ashfield.notts.sch.uk","telephone":"01623 455000","fullName":"Matthew Cartwright"},"location":{"latitude":53.1093302,"longitude":-1.2691702},"trainWithUs":"Our ethos is that every professional should strive to be the absolute best they can be for the benefit of the wonderful students in our care. This places professional learning at the centre of all that we do and we see initial teaching training as integral to this. Based three miles from Junction 28 (M1), Ashfield School Direct is a choice for graduates looking for a successful career in teaching. What’s more, with the school boasting 2800 students, there are a wide range of opportunities available for trainee teachers that allow for creativity in inspiring a new generation of students. It is because of this that Ashfield School Direct offers aspiring teachers a broad range of opportunities across key stages. Working with The University of Sheffield, you will learn about the teaching environment in a range of contexts. Additionally, the placements in our Two Counties' Trust partner schools will give you valuable insights into different contexts and challenges faced to prepare you fully for a successful career in teaching. The University of Sheffield is the accredited provider for this course. This is a Russell Group University which is respected internationally for their forward-thinking, research-led training. You will be working with the University to achieve a Post Graduate Diploma in Education (PGDE) which carries 120 Masters' credits. Ashfield School Direct is dedicated to working with the University of Sheffield to produce a high quality training experience for students in the first stage of a fulfilling and dynamic career in teaching.","trainWithDisability":"Ashfield School is a disability confident employer and is committed in supporting candidates with disabilities and other needs. Candidates with disabilities and other needs who meet the minimum job criteria will be given an opportunity to demonstrate their abilities at interview. Moreover, the Ashfield School site is accessible to people with physical, hearing and visual disabilities and is equipped with lifts, ramps and braille for anybody that requires it. What's more, as a student teacher at The University of Sheffield you will have full access to support if you have a disability or additional needs. Full information is available [here]( http://www.shef.ac.uk/ssid/disability)\nAdditionally, we work closely with all our school partners to ensure that your needs are met whilst on placement, offering support and adaptations where necessary.\nThe more we know about your additional needs, the easier it is for us to support you to succeed in your development as a teacher.","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"7d0c173d-d084-47d1-8aea-909930227991","code":"S18","name":"University of Sheffield","description":"The University of Sheffield is a world top-100 university. As a member of the UK’s prestigious Russell Group of leading research-led institutions, Sheffield offers world-class teaching and research excellence. Our Students’ Union has been voted best in the UK for the fourth year in a row by the Whatuni Student Choice Awards (2020, 2019, 2018, 2017).\\r\\n\\r\\nFind out more on our [website](https://www.sheffield.ac.uk/education/pgde)."}],"createdAt":"2021-07-06T17:48:47.442Z","updatedAt":"2021-11-15T23:47:01.881Z"}
