{"id":"447fc553-c347-4889-864c-6d2bbb2faa24","name":"One Sixth Form College","code":"2M5","type":"lead_school","isAccreditedBody":false,"urn":"142283","ukprn":"10053874","address":{"addressLine1":"Scrivener Drive","town":"Ipswich","county":"Suffolk","postcode":"IP8 3SU"},"contact":{"website":"suffolkone.ac.uk","email":"hr@suffolkone.ac.uk","telephone":"01473 556600","fullName":"Gail Ollason"},"location":{"latitude":52.0448065,"longitude":1.1060837},"trainWithUs":"One is an inclusive outstanding Sixth Form College located in Ipswich, Suffolk. We offer an extensive range of Post-16 courses including: A Levels, BTEC Diplomas, GCSE re-sits and courses in Foundation Learning. In partnership with the Suffolk & Norfolk Secondary SCITT Tuition PGCE programme, One has an excellent local reputation for providing training of the highest quality. As a large institution we can offer a range of subjects and our trainees. Despite our size new staff comment upon the warm welcome they receive and how quickly they get to know students and colleagues alike.\nWe will provide you with an exciting opportunity to work within an outstanding, inclusive college where students are well motivated, enjoy learning and want to work hard to succeed.\nThroughout your training, you will be supported by an outstanding Mentor who will assist you to achieve your personal development goals and encourage you to become an outstanding practitioner.\nPlease note that not all placements will take place at One.","trainWithDisability":"Suffolk and Norfolk SCITT supports all trainees based on their individual needs. Recently this has included those with dyslexia, physical, hearing and visual impairments and mental health conditions. Plans are developed with trainees to ensure that they can fully access in centre training, operate effectively on school placement and complete written assignments.\nWe are committed to supporting trainees with disabilities and other needs. All successful application complete a ‘Fit to Teach’ screening process managed by our occupational health provider. This will make us aware of any specific adaptations that you may require in order to be successful in your training year.\nWe have a highly developed programme to support trainee well-being. We know that teaching can be stressful (as it can be rewarding) and our aim is to get the right balance of skills knowing that the skills and tools you will gain will help support your wellbeing and mental health throughout your training and into your career as a teacher\nPlease contact us to discuss any access requirements.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"d8370001-6f2b-4624-b30c-27ddc5beebfc","code":"S14","name":"Suffolk and Norfolk Secondary SCITT","description":"The Suffolk and Norfolk Secondary SCITT programme is a highly personalised, well regarded and established teacher training course. It has very high attainment and employment outcomes for trainees. This programme has the unique structure of being in partnership with a significant number of schools across all areas of Suffolk and Norfolk. Due to the size of our partnership, this course provides with you the wealth of experiences so you can become a resilient and confident newly qualified teacher who will be able to teach in any type of school at the start of your teaching career."}],"createdAt":"2021-07-06T17:55:21.460Z","updatedAt":"2021-10-06T21:53:26.498Z"}
