{"id":"4556f37e-9876-4aff-8f6d-3d8b7fe9455e","name":"Colegrave Primary School (SCITTELS)","code":"1P5","type":"lead_school","isAccreditedBody":false,"urn":"102752","ukprn":"10046003","address":{"addressLine1":"SCITTELS, Colegrave Primary School","addressLine2":"Henniker Road","town":"Stratford","county":"London","postcode":"E15 1JY"},"contact":{"website":"http://www.scittels.co.uk","email":"David.nott@colegrave.newham.sch.uk","telephone":"2085340243","fullName":"Recruitment and Selection Tutor, SCITTEL"},"location":{"latitude":51.548543,"longitude":0.001612},"trainWithUs":"Colegrave Primary School is situated in Stratford, East London in the London Borough of Newham, on the edge of the 2012 Olympic Site. It is well served by road, underground and rail links. The school is committed to promoting equality and diversity and inclusive practices. In addition to the usual range of pupils with special needs, we have resourced provision for up to 14 pupils (2 per year group) with Profound and Multiple Learning Difficulties. The last OFSTED inspection was in June 2017 when the school was categorised overall as 'Outstanding'. Colegrave Primary School is the lead school for the Colegrave School Direct programmes. SCITTELS (School Centred Initial Teacher Training in East London Schools) is the accredited teacher training provider. Colegrave and SCITTELS work in partnership to deliver the programme. SCITTELS is graded Outstanding by Ofsted, who described us as having 'the best possible training'. This is a view shared by current and ex-trainees, employers and partnership schools. We pride ourselves in developing strong relationships with individual trainees and schools. This means we are able to provide personalised training that meets the individual needs of each of our trainees. The SCITTELS programme prepares trainees for teaching in diverse, urban environments. While the training programme covers all aspects of a teacher's role. Inclusion and Behaviour Management are particular strengths. The skills you learn on the SCITTELS School Direct programme will prepare you for teaching whether you choose to stay in East London or move elsewhere.","trainWithDisability":"Colegrave Primary School and SCITT in East London Schools welcomes applications from trainees with disabilities and other needs. Colegrave Primary School and many of our partnership schools are equipped with disabled access and facilities.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:53:57.324Z","updatedAt":"2021-09-15T20:57:02.454Z"}
