{"id":"455e2809-ec8a-4997-b89a-ba70ff8bdae8","name":"Macmillan Academy Training School","code":"3K9","type":"lead_school","isAccreditedBody":false,"urn":"130908","ukprn":"10007713","address":{"addressLine1":"STOCKTON ROAD","town":"MIDDLESBROUGH","postcode":"TS5 4AG"},"contact":{"website":"www.macmillantrainingschool.org.uk","email":"s.jackson@macademy.org.uk","telephone":"1642800800","fullName":"Andrea Naylor"},"location":{"latitude":54.5657207,"longitude":-1.2643988},"trainWithUs":"Macmillan Academy Training School is based in an 11-18 secondary academy situated in Middlesbrough. It is part of a multi-academy trust called Endeavour Academies. Our alliance partners are from primary, secondary, independent and higher education institutes and we have a proven track record of working with ITTs across all alliance partners. We pride ourselves in providing our students with a whole education ensuring that they have academic success and a variety of opportunities to enrich their learning experience linked to sports, arts, culture, community and the wider world that we live in.\nMacmillan Academy Training School welcome applicants who are passionate about their chosen subject and inspiring students to learn and develop key skills needed in our modern world. We will provide bespoke support and training for trainees to enable them to embark on their journey to become the most successful classroom practitioners possible. We have worked for many years with trainees from all subjects and have an excellent track record of achievement in terms of successful completion rates and retention in teaching. We believe that in order to thrive in initial teacher training trainees must be enthusiastic, reflective, organised, be able to work independently and as part of a team and have excellent communication skills. They must also demonstrate a genuine interest in both education and securing the best outcomes (academic and pastoral) for their students no matter their background or ability.","trainWithDisability":"Macmillan Academy Training School is an inclusive establishment and has a range of support services for students and teachers with disabilities and other needs. We work in close partnership with York St John University who have a dedicated Disability Advice Team and whose PGCE programmes have a strong track record of supporting all students to enable them to complete their studies successfully.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:48:18.911Z","updatedAt":"2021-09-28T22:00:14.714Z"}
