{"id":"4583557a-6174-49f9-8923-a2aac6a2f4be","name":"Bromsgrove Primary Alliance","code":"2HU","type":"lead_school","isAccreditedBody":false,"urn":"116665","ukprn":"10080149","address":{"addressLine1":"Bromsgrove Primary Alliance","addressLine2":"St Catherine’s Road","town":"Blackwell, Bromsgrove","county":"Worcestershire","postcode":"B60 1BN"},"contact":{"website":"http://www.bptsa.co.uk","email":"itt@bptsa.worcs.sch.uk","telephone":"0121 445 6586","fullName":"Anita McLaren"},"location":{"latitude":52.350834,"longitude":-2.015754},"trainWithUs":"BPA is committed to providing high quality teacher training. Our vision is for trainees to become committed, confident and creative primary school teachers who are equipped with the skills and knowledge needed to lead the learning for a range of learners.\nBPA is an alliance of a wide range of schools, offering candidates opportunities to train in schools with a range of different catchments, contexts and sizes, enabling students a broad learning experience. Alliance schools vary from small rural village schools to large inner city schools and include first, middle and primary schools.\nAll of the schools within the alliance have a proven track record of providing highly effective professional development with a strong focus on teaching and learning. Candidates will be given the opportunity to discuss placements on interview. All candidates will be placed alongside good or outstanding teachers and will be given opportunities to plan, assess and teach with highly skilled practitioners. BPA will provide you with an experienced school-based mentor who will meet with you on a regular basis to plan your next steps.","trainWithDisability":"BPA is committed to meeting the needs of all candidates, including those with a disability. As the alliance has a wide range of schools to choose from, we would work in consultation with you to provide you with a placement that would best support your needs.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"62d5803b-89ca-4e21-bb6f-5c74944c56ad","code":"B25","name":"Birmingham City University","description":"Birmingham City University train more teachers than any other university in the West Midlands and are the 10th largest teacher training provider in the UK. BCU graduates are highly successful in finding teaching posts. Our PGCE Early Years programme provides you with a variety of dynamic and diverse opportunities that will equip you to engage, motivate and inspire young learners in a wide range of schools. Our innovative programme is responsive to new initiatives in primary education and will enable you to become a highly effective and reflective teacher."},{"id":"4aa8177a-27b8-4566-b77a-c45515e46739","code":"N36","name":"Newman University","description":"Newman University is one of the largest Accredited Providers of School Based ITT in the West Midlands. It has established an excellent reputation for producing high-quality teachers, who understand the needs of the children they teach, and develop creative and effective practice. Newman’s experienced tutors and strong relationships with schools support students’ learning and ensure high quality education. In the latest National Student Satisfaction Survey, it was ranked Number 1 (overall) in Birmingham for student satisfaction. Trainees are encouraged to develop into reflective teachers who can respond effectively to the learning needs of children of all abilities and needs."},{"id":"9e30a2ef-61ee-4ffb-8862-b6ea936ff561","code":"2ET","name":"Prince Henry’s High School & South Worcestershire SCITT","description":"The SCITT has extensive experience of working with Initial Teacher Training, Across the partnership of schools we successfully support and train the next generation of teachers. Our partnership and family ethos would support the view of Ofsted (2019): \\r\\n‘Strong relationships and family ethos and not giving up on trainees’ \\r\\nTrainees choosing to train with the Prince Henry’s and South Worcestershire SCITT will be trained by outstanding practitioners across a partnership of schools with one clear aim: Providing the highest quality of ITT, producing the next generation of outstanding practitioners in order to continually raise standards and pupil achievement."}],"createdAt":"2021-07-06T17:55:27.615Z","updatedAt":"2021-11-08T18:13:50.532Z"}
