{"id":"460d78af-537e-485f-af2a-74eee012dde6","name":"Aspire Academy Trust","code":"2HB","type":"lead_school","isAccreditedBody":false,"urn":"136597","ukprn":"10058372","address":{"addressLine1":"Aspire Academy Trust","addressLine2":"Unit 20","town":"St Austell Business Park, StAustell,","county":"Cornwall","postcode":"PL25 4FD"},"contact":{"website":"https://www.aspireacademytrust.org/604/primary-teacher-training-in-cornwall-train-to-teach","email":"CPD@iaspire.net","telephone":"01726 438613","fullName":"Andrew Earnshaw"},"location":{"latitude":50.3587693,"longitude":-4.7825683},"trainWithUs":"Aspire Academy Trust offers a unique opportunity to train in a modern and forward-thinking Multi-Academy Trust of 29 primary schools across Cornwall. Each of our academies is unique, giving access to a broad selection of schools of different sizes, demographics and geographical areas to strengthen and enrich the training experience. \n\nTraining with us gives greater flexibility, unique opportunities and benefits including:\n\n* Career prospects. Training with us is the start of an Aspire career. Where vacancies are available and circumstances allow, following successful completion of the course, we will seek to place trainees as Early Career Teachers in our Aspire schools, taking away the stress of applying for jobs and interviews whilst training.\n\n* A personal-issue laptop for the duration of training to connect and be fully integrated into the Aspire networks and our online community of resources.\n\n* Dedicated mentor time with excellent class teachers to develop practice.\n\n* Our class teachers working with trainees also have access to mentoring themselves to help them give complete support to trainees.\n\n* All placements are in Aspire schools, carefully chosen to give trainees the best experiences.\n\n* Support from a wide range of expert practitioners and teachers across a range of areas.\n\nTrainees will have high-quality training, development and support from Aspire Academy Trust, right from day one. Our aim is to produce outstanding system leaders of the future; with multiple career opportunities and specialisms available within our Trust, we recognise talent for the future.","trainWithDisability":"Aspire Academy Trust are a fully inclusive organisation, as are our carefully selected partners, Cornwall SCITT. Wellbeing and inclusion are high on the Aspire agenda, with all our academies fully committed to supporting those with disabilities or other needs, making appropriate reasonable adjustments. We take great pride in matching trainees with placements, so trainees can be fully supported. Our trainees also complete a 'fitness to teach' check in advance of starting the course. Trainees with additional learning needs will have access to individual support from an academic tutor. Those with physical needs, such as hearing or visual impairments, will be supported to ensure full access to the course, with support for classroom strategies as needed. All trainees have mentor support. Ensuring development, mental health and wellbeing are of equally high importance throughout the course is fundamental to our approach. We want to get the best from our trainees, by giving them the best support we can.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:54:39.661Z","updatedAt":"2021-07-30T18:11:23.321Z"}
