{"id":"467ebfc9-625d-4e7b-a1b3-0c08029163b4","name":"New Collaborative","code":"2AJ","type":"lead_school","isAccreditedBody":false,"address":{"addressLine1":"Park Lane","town":"Pontefract","county":"West Yorkshire","postcode":"WF8 4QR"},"contact":{"website":"http://www.ncpontefract.ac.uk","email":"brian.coughlan@nclt.ac.uk","telephone":"1977702139","fullName":"Brian Coughlan"},"location":{"latitude":53.693845,"longitude":-1.325687},"trainWithUs":"The New Collaborative Teaching School Alliance (NCTSA) is a recently designated Teaching School based in the Yorkshire region. We are an alliance of over 20 good and outstanding providers producing excellent outcomes for our learners. Our lead school, New College Pontefract has been rated as 'outstanding in all areas' by Ofsted and has been officially recognised as the most successful college in the north of England. We opened a college in Doncaster in 2017 and have expanded our provision with a new college in Bradford in 2019.","trainWithDisability":"The Wellbeing and Disability Service at the University works with students with a range of disabilities and long-term conditions that have a significant impact on their ability to study. This includes specific learning difficulties such as dyslexia, long-term medical conditions such as diabetes, mobility or physical disabilities or conditions, hearing impairments, visual impairments and social communication difficulties such as autistic spectrum conditions or mental health issues. Our main aim is to work alongside you to get the right support in place at the right time as we believe that nothing should stop you achieving what you're capable of. For more information please email (disability@hud.ac.uk)","accreditedBodies":[{"id":"791f82c8-19fd-4339-9c7b-301dee8067ce","code":"H60","name":"University of Huddersfield","description":"Our PGCE is provided through Huddersfield University who have a proven track record in developing great teachers since 1947. The University has been recognised as a gold-rated University by the Teaching Excellence Framework (TEF)."}],"createdAt":"2021-07-06T17:49:36.364Z","updatedAt":"2021-07-06T17:49:36.364Z"}