{"id":"469f1848-b902-4395-89c8-6e3f43f344b4","name":"Cleeve School","code":"3B6","type":"scitt","isAccreditedBody":true,"ukprn":"10033702","address":{"addressLine1":"Cleeve School, Two Hedges Road,","addressLine2":"Bishops Cleeve","town":"Cheltenham","county":"Gloucs","postcode":"GL528AE"},"contact":{"website":"https://www.cleeveschool.net/Cleeve-Training-Hub/","email":"trainwithus@cleeveschool.net","telephone":"1242672543","fullName":"Claire"},"location":{"latitude":51.9414539,"longitude":-2.0552792},"trainWithUs":"We are an exciting and forward-thinking secondary school based in North Cheltenham within easy access from Worcestershire and Warwickshire. We are a large and well-resourced campus with a range of modern facilities including a multi-million pound Sixth Form Centre of excellence and a newly opened purpose built training centre where we base our Schools Direct course.\nWe have a dynamic and high-performing staff at Cleeve who hold training and teaching and learning at the very heart of what we do. This enables us to offer a course which is facilitated by a range of highly qualified and passionate professionals.\nWe are proud of the close relationships we hold with our partner schools for both the middle and secondary phase courses. Each school is individual and provides a different experience, but we believe strongly that we all hold the same ethos of putting student achievement and opportunity first and have an unswerving belief in opportunities for all.","trainWithDisability":"We are an inclusive institution believing in opportunities for all and pride ourselves on our high expectations of all stakeholders and this applies absolutely to our trainees. We work hard to personalise our course to meet the needs of all our trainees whether it is to differentiate for those who have varying experiences of education or to adapt the learning to ensure that those with disabilities are able not only to access our course but to thrive during their training.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:55:25.407Z","updatedAt":"2021-10-05T16:45:33.039Z"}
