{"id":"46fcebe2-49b1-4e80-8531-772dc26f3c38","name":"NELTA","code":"251","type":"scitt","isAccreditedBody":true,"ukprn":"10046736","address":{"addressLine1":"Beal High School Upper Site","addressLine2":"Woodford Bridge Road","town":"Ilford","postcode":"IG45LP"},"contact":{"website":"http://nelta.co.uk/programmes/initial-teacher-training-programme/","email":"admin@nelta.co.uk","telephone":"2085514954","fullName":"NELTA manager"},"location":{"latitude":51.5860169,"longitude":0.0517167},"trainWithUs":"NELTA is a large teaching school network of 20 schools. Beal High School is the lead school.\nWe are passionate about developing the next generation of teachers and school leaders. Teachers and leaders who will ensure an outstanding educational future for all pupils irrespective of background or ability. The Ofsted inspection of our initial teacher training provision on 2017 said:\n“Leaders’ ambitious vision for excellence and their aspirations for trainees are of the highest order”\n“The quality of training is outstanding”\n“Trainees are overwhelmingly positive about the quality of mentoring”\nWorking with our alliance you can expect:\n* Guidance from an experienced school based mentor and NELTA tutor\n* Very well established support programmes\n* Access to a wide network of schools including community secondary, primary, independent, grammar and special education\n* Professional development opportunities beyond your training year focused on outstanding teaching and leadership\nNELTA, which spans Barking and Dagenham, Waltham Forest, Redbridge, Newham and beyond, offer opportunities to work in a range of different socio-economic areas. Working in a partnership which includes independent schools, boys' and girls' grammar schools, faith schools, comprehensive schools and special schools means you will have access to a broad range of training experiences which will give you the opportunity to you develop your practice in a variety of different settings.\nWe offer teacher training places for both the tuition fee and salaried routes to Qualified Teacher Status.","trainWithDisability":"We are committed to supporting equal opportunities and disability access. NELTA has the full support of our Multi-Academy Trust Human Resources department and every person is treated as an individual.\nWe offer information, advice and guidance to current and prospective disabled students about support that may help them to engage with their studies. When we refer to the term “disability” we also include long-term medical or mental health conditions and Specific Learning Difficulties (SpLDs). We have accommodated trainees in the past with a range of disabilities including mental health conditions, dyslexia and physical impairments.\nDisability access in schools varies according to the specific training location. Please email us to discuss your needs [NELTA](admin@nelta.co.uk).","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:57:20.895Z","updatedAt":"2021-10-29T21:08:33.541Z"}
