{"id":"4750085b-4a49-4ffa-8a40-e9c2082d2011","name":"Boarshaw Community Primary School","code":"2LJ","type":"lead_school","isAccreditedBody":false,"urn":"105787","ukprn":"10070058","address":{"addressLine1":"Stanycliffe Lane","addressLine2":"Middleton","town":"Manchester","postcode":"M24 2PB"},"contact":{"website":"www.boarshawprimary.co.uk","email":"ITT@boarshawprimary.co.uk","telephone":"1616539536","fullName":"Jackie Harland"},"location":{"latitude":53.5600663,"longitude":-2.1834981},"trainWithUs":"PiraMidd ITT Partnership, is a new exciting school based route into Teaching that began in September 2021. Our Initial Teacher Training (ITT) programme is designed by the Department for Education (DfE) to give schools a leading role in training the next generation of teachers . The course allows trainees to immerse themselves in every aspect of the life of a busy primary school environment. Whilst the programme itself is validated by an Manchester Metropolitan University, much of the content within our course, is developed by our highly experienced leaders and teachers across our collaboration of 9 primary schools, special school and nursery school in order to produce the next cohort of outstanding classroom practitioners. We believe that we have a unique mix of partners that will help our students experience high quality primary, special and nursery education.","trainWithDisability":"The training partnership confirms its commitment to a comprehensive policy of equal opportunities for trainees and prospective trainees in all aspects of its teaching and examination; its counselling of trainees; the way it affords access to any of its benefits, facilities and services. The aim of the partnership is to ensure that no trainee or prospective trainee receives less favourable treatment directly or indirectly on grounds of race, colour, nationality, ethnic origins, gender, sexuality, marital or parental status, disability, creed, social or economic class.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"812b70c4-7fc4-46fc-975b-3e4d00f77dc4","code":"M40","name":"Manchester Metropolitan University","description":"Manchester Metropolitan University is one of the largest universities in the UK. It balances a rich and proud heritage with a modern and ambitious approach, striving to disseminate knowledge and make higher education accessible to those with passion and potential."}],"createdAt":"2021-07-06T17:49:47.049Z","updatedAt":"2021-09-16T18:48:32.318Z"}
