{"id":"4808c596-11e0-4586-8cb4-116a1d9838b3","name":"Educate Group Initial Teacher Training","code":"E65","type":"scitt","isAccreditedBody":true,"ukprn":"10035411","address":{"addressLine1":"S2","addressLine2":"Sedan House","town":"Stanley Place","county":"Chester","postcode":"CH1 2LU"},"contact":{"website":"https://educate-group.co.uk/itt/","email":"itt@educate-group.co.uk","telephone":"01978 281881","fullName":"Claire King"},"location":{"latitude":53.1900289,"longitude":-2.8974762},"trainWithUs":"If you want to gain Qualified Teacher Status (QTS) through a practical, 'hands-on', school-based route, then the Educate Group Initial Teacher Training programme is for you. Educate is a large, national SCITT provider with a long-standing reputation for successful Primary and Secondary QTS programmes. We are based in varied and diverse partner schools across the North West, North East, Yorkshire and the Humber, and East Midlands. This means you have the unique opportunity to train in a school near to where you live.\nTrainees enjoy the advantage of an 'on the job' experience as the majority of time is spent in a base school. Trainees are supported by expert practitioners, mentors and a personal Link Tutor to meet the Teachers' Standards and gain QTS.\nEducate-led training sessions on specific subject knowledge and classroom practice based on the Core Content Framework take place throughout the year. Trainees gain experience of different age ranges, curricula, teaching strategies, inclusion, diversity and SEND as well as Contrasting School Placement. We offer the PGCE qualification accredited by Leeds Beckett University (60 credits towards a Masters’). You do not have to attend campus (with the exception of a study day) but you have all the benefits of being a student with LBU.\nEmployment rates following this programme are consistently high.\n'Programme leaders are highly sensitive to the well-being of their trainees. They ensure that they provide timely and appropriate support to those trainees whose personal circumstances require it. Trainees appreciate this support' (Ofsted, 2018).","trainWithDisability":"Educate Group Initial Teacher Training has a designated tutor for trainees with disabilities and other needs. We take steps, before the programme begins, to fully assess the needs of trainees so that all aspects of the course are accessible to them and personal requirements accommodated.\nEducate have, in the past, supported trainees with dyslexia, physical impairment and mental health conditions to successfully complete their course. We take a collaborative approach to ensure that study needs assessment reports, school partners and university colleagues are consulted to design a complete package of personal support.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:48:01.010Z","updatedAt":"2022-02-09T20:43:15.236Z"}
