{"id":"481328de-4b05-44f3-abf1-d31b85941df9","name":"The National Modern Languages SCITT","code":"2F1","type":"scitt","isAccreditedBody":true,"ukprn":"10060171","address":{"addressLine1":"The National Modern Languages SCITT, Silverdale School (Lead School)","addressLine2":"Bents Crescent","town":"Sheffield","county":"South Yorkshire","postcode":"S11 9QH"},"contact":{"website":"http://www.nationalmodernlanguages.com/","email":"enquiries@nationalmodernlanguages.com","telephone":"0114 2357980","fullName":"Sarah Fidler"},"location":{"latitude":53.3509698,"longitude":-1.5285331},"trainWithUs":"As a result of our success recruiting and training Modern Languages teachers through School Direct, we have worked with the Department for Education to establish the first subject specific School Centred Initial Teacher Training (SCITT) provider for Modern Languages. The SCITT, now in its sixth year, is part of Chorus Education Trust which has, at its heart, Silverdale School, an outstanding school in South West Sheffield. Our learning community believe in the power of language to transform lives and to create life opportunities for all our children and all our school staff. Our passion for languages and language learning has led to the creation of a programme which will prepare all our trainees to teach languages in the state and independent sector. The National Modern Languages SCITT has established geographical hubs for the provision of training centred around a cluster of state and independent schools. Our current hub lead schools are: Charles Reed Academy (East Mids & South Lincs Hub), Cheadle Hulme School (South Manchester Hub), Dulwich College (South London Hub), Gosforth Academy (Newcastle Hub), Haberdashers' Aske's Boys School (North London Hub), Humberston Academy (Humber & North Lincs Hub), Oundle School (Near Peterborough), St Helen and St Katharine (Abingdon/Oxford) and Silverdale School (Sheffield) with more hubs to be developed in 2022.","trainWithDisability":"The National Modern Languages SCITT and our partners are committed to providing equal opportunities for all. If you wish to discuss how we can support you during your Initial Teacher Training or for further advice, please contact us on 0114 2357980.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:49:00.190Z","updatedAt":"2021-09-23T20:25:43.252Z"}
