{"id":"48245589-8feb-475b-aaf9-a44bf5204017","name":"Southam Teaching Alliance","code":"2BN","type":"lead_school","isAccreditedBody":false,"urn":"143905","ukprn":"10062422","address":{"addressLine1":"Southam College","addressLine2":"Welsh Road West","town":"Southam","county":"Warwickshire","postcode":"CV47 0JW"},"contact":{"website":"http://www.southamcollege.com/teaching-school","email":"STA@welearn365.com","telephone":"01926 812560","fullName":"Michelle Thresher"},"location":{"latitude":52.2573141,"longitude":-1.3939976},"trainWithUs":"Southam College is the lead school for the recently established ‘Southam Teaching Alliance’, based in Coventry and Warwickshire. We work closely as an alliance of secondary and primary schools with the University of Warwick and the University of Leicester as our HE partners. Southam College is an 11-18 school set in the heart of rural Warwickshire with 1650 students on roll, 313 of who are in the Sixth Form. As a result of our strong reputation, based upon outstanding achievement, wide ranging extracurricular opportunities and an ethos of support and care, the school continues to be oversubscribed.\nOur last Ofsted report (March 2014) graded the school as outstanding, building upon the outstanding report of 2011. We have used this accolade to spur us on to reaching even higher standards in everything that we do. This is inclusive of raising student achievement, providing a wider range of memorable experience and developing the quality of learning and teaching. In addition, we have continued to improve our facilities with the building of a new Science block and state of the art Music block.\nSoutham College was in the top 10% of schools nationally for Grade 9-4 GCSE results in 2019. 100% of our Sixth Form students gained A*-E in 2019.\nThere is a strong, supportive mentoring network at Southam College to support initial teacher training. We invest in our trainees from day 1 and seek to provide them with a sustained career in teaching.","trainWithDisability":"To support candidates with disabilities and other needs we assess how we can help on an individual basis. Southam College is an equal opportunities employer and we will seek to support trainees with additional needs wherever possible.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:54:29.614Z","updatedAt":"2021-09-20T16:27:40.776Z"}
