{"id":"4847b31d-34c2-4976-af76-2295a7174410","name":"St Andrew’s Alliance","code":"2C7","type":"lead_school","isAccreditedBody":false,"urn":"105933","ukprn":"10068553","address":{"addressLine1":"Vicars Hall Lane","addressLine2":"Boothstown","town":"Salford","county":"Manchester","postcode":"M28 1HS"},"contact":{"website":"http://www.standrewscepts.org.uk/","email":"standrewsce.teachingschool@salford.gov.uk","telephone":"0161 921 1640","fullName":"Joanne Squires"},"location":{"latitude":53.5003492,"longitude":-2.4217447},"trainWithUs":"St Andrew's is a happy, safe and welcoming environment where everyone is valued. Our Christian faith is central to moral development, mutual respect and an appreciation for the cultural diversity within our community. We are proud to be a teaching school. St Andrew's is an outstanding place to work and learn and offers a welcoming and supportive environment. Together with our University partners, we develop personalised training with the academic and theoretical underpinning which allows trainees to become outstanding practitioners. Led by St Andrew's CE Primary Teaching School, our Alliance comprises a mix of faith and non-faith schools, each passionate about providing the next generation of teachers and potential future leaders. Our Alliance partners schools are:\n*St Andrew's CE Primary School\n*Boothstown Methodist Primary School\n*James Brindley Community School\n*St Paul's CE (Crompton St) Primary School\n*Christ the King RC Primary School\n*St Philip's RC Primary School\nSuccessful trainees will gain a postgraduate Certificate of Education (PGCE), which includes up to 60 Masters level credits that can be used towards a Masters qualification, and are recommended for Qualified Teacher Status (QTS). [Teaching School website](http://www.standrewscepts.org.uk/)","trainWithDisability":"Applicants with disabilities and other requirements should make this clear on their application.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:54:19.663Z","updatedAt":"2021-10-05T20:53:09.363Z"}
