{"id":"4855bc32-baa6-4b1d-bc30-323f204fb82a","name":"Manchester Nexus SCITT","code":"2EU","type":"scitt","isAccreditedBody":true,"ukprn":"10058966","address":{"addressLine1":"The Blue Coat School","addressLine2":"Egerton Street","town":"Oldham","postcode":"OL1 3SQ"},"contact":{"website":"http://manchesternexus.com/","email":"recruitment@manchesternexus.com","telephone":"0161 6241484","fullName":"Kat Henshall"},"location":{"latitude":53.5459701,"longitude":-2.1075544},"trainWithUs":"At Manchester Nexus an unequivocal focus on excellence characterises our work, ensuring that everything we do is firmly rooted in the values that drive us – hope for the future, personalised learning and social justice.\nOur mission is to train teachers who will inspire, challenge and support all their pupils, both now and in the future. Nexus teachers are committed. They are skilful, creative specialists in their subjects and age ranges who continuously develop their practice and help others to do the same.\nOur training fosters resilience with a balanced approach that recognises the importance of personal wellbeing amid the demands of this great profession. In our last training year 100% of our trainees rated their training as good or very good.\nYou learn on the job and spend the majority of your time in the school. We refer to it as School-Led: your training is led by the school, not a university. Additionally, there are 12 Liverpool Hope University Masters Days which will lead to your PGCE qualification. It is important to note that LHU come to us for 9 of these sessions. Therefore you only need to go to Liverpool for 3 sessions over the course of the year.","trainWithDisability":"Manchester Nexus consider trainee location when allocating placements. This will be an even stronger focus when trainees have a physical impairment or a condition that has an impact on travel.\nWe ensure that trainees are supported within the framework of their school setting, as well as during the training sessions delivered by Nexus and Liverpool Hope University. This may involve making mentors aware of any adaptations required and quality assuring to ensure that these are in place. Trainees are given the opportunity to share any needs and to discuss how these can be met.\nWe do not have a one size fits all approach, meaning discussion and openness is encouraged in order to meet individual needs. Manchester Nexus has links with Health Assured, a 24 hour helpline aiming to support trainees through any life issues or problems. Trainee wellbeing is of the utmost importance to us and we have time set aside to focus on how to maintain a positive mindset and how to keep a healthy work life balance.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:52:27.089Z","updatedAt":"2021-09-27T15:29:12.843Z"}
