{"id":"48798bcf-b3fa-4b6f-af63-53909fe1bd85","name":"Lilian Baylis Technology School","code":"1ZY","type":"lead_school","isAccreditedBody":false,"urn":"100625","ukprn":"10003923","address":{"addressLine1":"Lambeth Teaching Schools’ Alliance, Vauxhall Primary School","addressLine2":"Vauxhall Street","town":"London","county":"London","postcode":"SE11 5LG"},"contact":{"website":"http://www.ltsa.org.uk","email":"schooldirect@ltsa.org.uk","telephone":"0208 6166 766","fullName":"Amy Lesik"},"location":{"latitude":51.4889006,"longitude":-0.1180918},"trainWithUs":"Lambeth is a dynamic and diverse borough in which to get in to teaching. Our schools are passionate about learning and teaching and ambitious for their pupils. Lambeth's young people deserve the best and we aim to deliver this by recruiting and training outstanding candidates for teaching posts in the borough. In return we offer first class training and support in some of the most dynamic, forward thinking and diverse schools in the country. What we offer:\n* Award of PGCE and QTS on all courses\n* Access to tax- free training bursaries of up to £28,000\n* Highly subsidised accommodation in one of our renovated Victorian school houses\n* Exceptional teachers working in our schools who are keen to share their diverse range of skills, knowledge and distinctive teaching methodology with the next generation of teachers. * Schools that have close partnerships with the range of world class organisations on our doorstep, such as the Royal Festival Hall and the Southbank Centre, Royal Society of Arts, University of Roehampton, London South Bank University, King’s College London University, St Thomas’ University Medical School and the Engineering Development Trust.\n* Excellent access to employment opportunities once qualified through our network of Lambeth Schools. 90% of trainees in 2019 went on to secure NQT positions in Lambeth.","trainWithDisability":"* The majority of our schools have lifts and step free access to teaching spaces. * We ask all candidates shortlisted for interview to complete a declaration of health form, which enables us, in partnership with the University, to provide bespoke support to trainees with additional health needs\n* In the past we have provided additional time in interview tests for trainees with specific needs.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:54:30.487Z","updatedAt":"2021-10-04T18:31:13.122Z"}
