{"id":"49325b10-be5d-42e6-b727-2e28a3230137","name":"North Lincolnshire SCITT Partnership","code":"N66","type":"scitt","isAccreditedBody":true,"ukprn":"10004694","address":{"addressLine1":"UCNL","addressLine2":"Ashby Road","town":"Scunthorpe","county":"North Lincolnshire","postcode":"DN16 1AB"},"contact":{"website":"https://www.northlincs.gov.uk/schools-libraries-and-learning/train-to-teach-in-north-lincolnshire/","email":"vicky.crossley@northlincs.gov.uk","telephone":"01724 297119","fullName":"Vicky Crossley - Administrator"},"location":{"latitude":53.5767382,"longitude":-0.6550381},"trainWithUs":"The programme offered by North Lincolnshire SCITT Partnership, has been developed over many years and has a proven track record and excellent reputation with local schools as a high performing Training Provider. With partner schools fully involved in all aspects of the programme design and delivery, a key strength is evidenced through the shared commitment and resolve held by all stakeholders’ to producing good and outstanding teachers capable of making a significant difference to the lives of the children in the local area. Acknowledged by Ofsted, Inspectors commented on how trainees were ‘well prepared and highly motivated to teach’ and how as ECTs they ‘approached their induction years with confidence and commitment.’\nThe Partnership’s strong commitment to supporting the development of a high performing local teacher workforce is clearly evidenced in the outcomes achieved by trainees. Approximately 20% of the current teacher workforce has been successfully ‘grown’ by the Partnership, many of whom have gone on rapidly into senior leadership positions. Over 90% of schools in North Lincolnshire have securing an Ofsted grading of good or better.\nRecruitment and retention rates are excellent: 92% of trainees secure ECT posts in their first year, with 69% recruited within the local area and 27% of these employed by partnership schools. The core programme benefits from this success as many ex-trainees become involved as mentors and training facilitators, enabling them to pass on the best possible advice and support based on their own experiences of school-centred training.","trainWithDisability":"All due consideration is made to ensure that applicants with specific needs are catered for so that they are not disadvantaged in any way. For example, at the assessment phase of the recruitment process, applicants with dyslexia are offered longer to complete the written task, they are offered coloured sheets to help them access the texts, issues with spelling and grammar are taken into account. During training, materials are printed to make them accessible on coloured papers, using different fonts, different sizes, 1:1 help is provided with writing assignments and other tasks which they might struggle with. Applicants with physical disabilities are catered for according to their varying needs so access issues on to various sites would be reviewed and plans put into place to mitigate them, e.g. choice of school placements, ensuring central training took place in ground floor rooms, travel to different locations minimised.\nApplicants with hearing or sight needs, specialised equipment would be sourced to support them in school locations and in central training venues, e.g. use of microphones.\nAll trainees have access to Welfare and Counselling Services as part of the local authority responsibility so applicants with any mental health problems can be fully supported by expert practitioners.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:55:24.049Z","updatedAt":"2021-07-07T16:55:53.898Z"}
