{"id":"49863b86-26f9-4b18-b7f9-21b1049ba8d3","name":"Prince Albert Junior and Infant School","code":"2JO","type":"lead_school","isAccreditedBody":false,"urn":"15797","ukprn":"10061025","address":{"addressLine1":"Unity House","addressLine2":"27 Trinity Road","town":"Aston","county":"Birmingham","postcode":"B6 6AJ"},"contact":{"website":"http://www.pact.bham.sch.uk/index.php/schools-direct","email":"v.smith@pahigh.co.uk","telephone":"1217255252","fullName":"Kathryn Morgan"},"location":{"latitude":52.5035686,"longitude":-1.89346},"trainWithUs":"At the Prince Albert Community Trust (PACT) we believe in the power of education to transform lives. We also believe that in order to provide the best possible education for our pupils, we must provide exceptional professional learning and development for our staff. We offer a comprehensive package of support for colleagues at all levels from trainees to senior leadership. Our Schools Direct programme provides trainees the opportunity to work with experienced and highly developed teachers from across the Trust.\nThe PACT is made up of 5 primary schools in Birmingham. The lead school, Prince Albert Primary was graded ‘outstanding’ by Ofsted in 2015. Prince Albert is an innovative, forward thinking school that aims to provide pupils with a range of enriching learning experiences alongside academic success. Prince Albert is an ‘Inclusion Centre of Excellence’ and the Trust is also a Bell Foundation Centre of Excellence for EAL provision. These reflect the excellent inclusive practice that characterises all of the schools in the Trust. Our schools work very closely together, sharing staff expertise, resources and a shared vision and ethos. We place great emphasis on both pupil and staff well-being.\nAt our Trust, we understand that for many of our children education is their only opportunity for real social mobility. We have exceptionally high expectations for them, building their resilience and imbuing in them a passion for learning. We are looking for applicants who will inspire and motivate our children and share our passion for changing lives for the better","trainWithDisability":"At the Prince Albert Community Trust, we are committed to a fully inclusive Schools Direct programme, ensuring that candidates with disabilities and other needs are fully supported. We would consider the needs of each individual and make whatever reasonable adjustments that are needed to ensure that each applicant can fully access the programme. For example, we would ensure that our accessibility plans reflect the changing needs as they become known. In addition to this, we would conduct personal accessibility audits to ensure that students are working in suitable and safe environments.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"c357e0fa-802e-471b-818a-d0cd1434f9cd","code":"B32","name":"University of Birmingham","description":"The University of Birmingham has a long tradition of delivering teacher training courses. Its teaching has been graded as ‘outstanding’ 3 times by Ofsted affirming the University’s status as one of the UK’s leading institutions teacher training.\\r\\nTheir employability statistics are amongst the very best in the country ( 97 % of SD students secured a teaching post in years 18/19 \\u0026 19/20) and a significant proportion of those who train with them complete their Master’s degree (Teaching Studies) and move on to middle or senior leadership in schools."}],"createdAt":"2021-07-06T17:51:11.148Z","updatedAt":"2021-10-04T04:01:53.899Z"}
