{"id":"49e00352-5fec-4469-8b7b-ce6585d52c81","name":"Forward First School Direct","code":"3F1","type":"lead_school","isAccreditedBody":false,"urn":"119406","ukprn":"10078126","address":{"addressLine1":"Trinity CE / Methodist Primary School","addressLine2":"Kiln Lane","town":"Skelmersdale","county":"Lancashire","postcode":"WN8 8PW"},"contact":{"website":"https://forwardfirst.co.uk/","email":"info@forwardfirst.co.uk","telephone":"01695 723878"},"location":{"latitude":53.5511178,"longitude":-2.7934986},"trainWithUs":"Forward First is a forward-thinking network of Lancashire primary schools committed to developing, equipping and sustaining the next generation of inspirational teachers. We provide an innovative Post Graduate Certificate of Education with Qualified Teacher Status (PGCE with QTS), in partnership with the award winning Edge Hill University. Our vision is to provide all children with the very best educational foundation for a happy, fruitful and successful life. At Forward First, we aim to create rich and diverse ‘experiences’ for our trainees so that you can learn, use, refine and consolidate your pedagogic approach in highly supportive, highly effective settings. Training to teach in this small and supportive network of likeminded schools will mean you become part of a very special school family, the Forward First family, where trust and enjoyment underpins excellent educational opportunities for our children. If you have a passion for teaching, are organised and hard-working, please explore our programme further and contact us to find out more about studying with Forward First.","trainWithDisability":"Edge Hill's Inclusion Team provide information, guidance and support to applicants and students who have disclosed any of the following: Autism Spectrum Conditions (ASC), Mental Health, Sensory Impairment, Mobility difficulties or a medical condition e.g. Epilepsy, Diabetes, Heart Condition, Asthma and we work closely with academic and support staff across the University. Learning Services provides support to students with a specific learning difficulty – SpLD, such as Dyslexia. We encourage disabled applicants to make contact with us early in the application process to enable us to plan for support you may need right from start of your university course. We provide a friendly and professional service and applicants and students can discuss individual requirements in complete confidence. Our highly experienced team are here to advise you about: * Impact of disability/health condition and potential impact on study * Support available including 1-1 sessions, group support and study skills sessions * The benefits of a Student Support Plan * Disabled Students Allowance (DSA) and eligibility * Reasonable adjustments to support your study * Exam modifications and alternative assessments * Rights and Responsibilities * Support whilst on placement\n* Disclosure and Confidentiality * Rights and Responsibilities * PEEPs\nSome students decide to wait until they have started their studies before coming to see us, but contacting us before you start is the best way to make sure that support you may need is in place.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-10-04T21:39:27.935Z","updatedAt":"2021-10-14T20:48:57.605Z"}
