{"id":"4a3dc1e3-2ee8-496d-85d1-b5d9f9eae94f","name":"Bath Spa University","code":"B20","type":"hei","isAccreditedBody":true,"urn":"133790","ukprn":"10000571","address":{"addressLine1":"Newton Park Campus","addressLine2":"Newton St Loe","town":"Bath","county":"Bath and North East Somerset","postcode":"BA2 9BN"},"contact":{"website":"https://www.bathspa.ac.uk/how-to-apply/teacher-training/","email":"teaching@bathspa.ac.uk","telephone":"01225 876180","fullName":"Bath Spa University"},"location":{"latitude":51.3755553,"longitude":-2.4382603},"trainWithUs":"Bath Spa University has a long and successful tradition of Initial Teacher Education dating back over 70 years. Newton Park campus was opened as Bath Teacher Training College in the 1940s, and the University, in partnership with local schools, is now the largest provider of teacher education in the area, extending across all counties in the South West and beyond.\nThe Bath Spa University Partnership provides a challenging and highly effective training programme that takes place in university and school. You will learn our ambitious ITE Partnership Curriculum both in University and School and be supported by subject and phase experts throughout the programme. Successfully engaging with our ambitious ITE Partnership Curriculum will ensure you are highly employable with a secure foundation for your role as an Early Career Teacher.\nOur belief that all children deserve the very best teachers was important to our Partnership in those early days, and is still central to our practice today. We believe that education plays a key role in promoting social justice and reducing social inequalities, and that well qualified and highly skilled teachers make a difference to the lives and futures of the learners they teach. Bath Spa University has been awarded a Grade 1 'outstanding' for its Primary and Secondary ITE programmes by the quality regulator Ofsted, which is the highest grade that can be given. Training with us will ensure you become the very best teacher that all children and young people deserve.","trainWithDisability":"Student Wellbeing Services\nQuestions about mental health, money or wellbeing? We provide professional advice and guidance, to help you make the most of your studies and university life.\nDisability and Accessibility\nAll students should have an equal opportunity to experience university. We provide confidential information, guidance, and practical support to students with a disability or specific learning difference.\nMental health and wellbeing\nMental Health Practitioners are available to speak with applicants and current students about your situation and explore options. You can get help liaising with external services and access short term counselling at Bath Spa.\nMoney Advice\nWe give students practical advice on managing money, financial entitlement and sourcing additional income. Our aim is to enable you to take control of your finances.\nFurther information can be found on our website, https://www.bathspa.ac.uk/students/student-wellbeing-services/","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"createdAt":"2021-07-06T17:50:08.588Z","updatedAt":"2021-10-07T12:40:53.767Z"}
