{"id":"4a3fc4aa-bf8a-42fc-8b28-59c5fd806ceb","name":"Belfairs Academy","code":"1AV","type":"lead_school","isAccreditedBody":false,"urn":"134861","ukprn":"10032853","address":{"addressLine1":"SCITT Training Base","town":"Southend on Sea","county":"Essex","postcode":"SS9 5AQ"},"contact":{"website":"www.etpscitt.co.uk","email":"info@etpscitt.co.uk","telephone":"01268 380025","fullName":"Karon Edney"},"location":{"latitude":51.549795,"longitude":0.6391255},"trainWithUs":"We are a large dynamic partnership of schools and two SCITTs with many years of experience behind us. Our excellent training is supported by expert practitioners in more good and outstanding schools throughout Southend. Our sole purpose is to provide outstanding education for the young people of Southend and beyond by training excellent teachers. Due to the outstanding reputation we hold locally for the provision of rigorous and effective training 100% of our trainees gain employment each year, often within partner schools. Programmes\nThe course takes one academic year to complete, full time. Not only will you gain Qualified Teacher Status (QTS) by training with us, but you will also receive professional training in educational theory leading to a PGCE award with masters level credits (validated by Anglia Ruskin University). As a result, you will begin your teaching career with excellent practical teaching skills and a deep understanding of the underpinning educational theory enabling you to work effectively. All elements of the programme are are taught by experienced, practising teachers.\n“The range of high-quality training experiences gives trainees an effective introduction to the role of the teacher.’ Ofsted.\nSupport\nWe pride ourselves on offering bespoke support and guidance during your training through your Tutors and School-Based Mentors and we continue this into your first year of teaching with our NQT support team. Visit http://etpscitt.co.uk to read more about our courses.","trainWithDisability":"We strive to understand, appreciate and value the differences in individuals; we aim to make people feel valued and supported so they achieve their full potential. We value diversity and encourage applications for places from disabled trainees. Many trainees with a wide range of disabilities have successfully completed our courses; many leave us to go on and become outstanding teachers. Each year we recruit trainees with a wide range of additional needs and we regularly work in partnership with other agencies to ensure we provide everyone with the best possible support. We employ a specialist in Occupational Health, and working together, we can accommodate the needs of any applicant we feel has the potential to become a good teacher and therefore an asset to our schools. We accept trainees every year with dyslexia and/or dyspraxia and have a number of specialist mentors who can provide bespoke advice and guidance. All trainees with disabilities will have allocated sessions with a centre-based tutor who can ensure that any reasonable adjustments are made to your training.\nWe pride ourselves on our approach to trainee wellbeing. We work extensively with other services to ensure that we provide you with the best possible support. We offer coaching and access to counselling services. All our staff are trained mental health first aiders. Taught sessions include mindfulness, stress management and resilience training. If you think your disability means you need additional support, or wish to discuss any aspect of access in more detail email office@etpscitt.co.uk","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:46:25.173Z","updatedAt":"2022-01-14T20:41:41.845Z"}
