{"id":"4aa8177a-27b8-4566-b77a-c45515e46739","name":"Newman University","code":"N36","type":"hei","isAccreditedBody":true,"ukprn":"10007832","address":{"addressLine1":"Genners Lane","addressLine2":"Bartley Green","town":"Birmingham","county":"West Midlands","postcode":"B32 3NT"},"contact":{"website":"https://www.newman.ac.uk/","email":"admissions@newman.ac.uk","telephone":"0121 476 1181","fullName":"Newman University"},"location":{"latitude":52.4329957,"longitude":-1.9936128},"trainWithUs":"The Faculty of Education at Newman University has been training teachers for over fifty years and has an established reputation for producing high quality teachers, who understand the needs of the children they teach, and develop creative and effective practice. Newman’s experienced tutors and strong relationships with schools throughout the West Midlands will support your learning and ensure high quality education.\nThese courses will support you with key strategies to become an effective and confident teacher. The PGCE programme is designed to develop and enhance knowledge and understanding of how to become an effective and creative teacher. Upon completion you will be recommended for QTS and may apply for newly qualified teacher roles with an advanced skill set ready to embark upon a successful and rewarding career within the classroom.\nThe Primary PGCE is available in two options: 3-7 (Early Years/KS1) or 5-11 (KS1/KS2). We offer the following subjects at secondary level: Computing, English, Geography, History, Mathematics, Physical Education, Religious Education, Science: Biology/Chemistry/Physics.\nThe Post Graduate Certificate in Education is the most widely recognised UK post graduate award and is transferable. It is accepted, across the UK and internationally, as an assurance that the candidate has achieved the high standard expected for entry to the teaching profession.\n“High-calibre trainees and NQTs who demonstrate exceptional professional attitudes. They share a passion for teaching and a desire to continually improve their teaching skills. They are held in high regard by local head teachers.” Ofsted 2015","trainWithDisability":"Around 20% of our students tell us they have some additional support requirements, last year we advised over 800 applicants and current students with:\n•\tSpecific Learning difficulties e.g. Dyslexia, Dyspraxia, Dyscalculia\n•\tHearing or Visual loss\n•\tPhysical, mobility and dexterity difficulties\n•\tMedical conditions e.g. asthma, diabetes, epilepsy, arthritis, ME, MS, cancer, HIV, heart conditions, etc.\n•\tMental Health difficulties e.g. depression, anxiety, Bi-polar, etc.\n•\tOther e.g. autism, speech difficulties, ADD/ADHD, disfigurements, severe allergies, etc.\nWe believe all students should be equally able to access the services and facilities we provide and participate fully in University life. We can:\n•\tAdvise you about services internally and externally to the University.\n•\tHelp address any concerns about access (environmental or information), and liaise with academic staff about any individual arrangements required\n•\tAdvise about Disabled Students’ Allowances (DSA) and other funding sources, which can help fund equipment, software, travel costs or one-to-one support to help access your university studies. Visit www.gov.uk/ and search for ‘disabled students’ allowances’.\n•\tIdentify individual arrangements which may help you study more effectively, including issues around missing sessions or concerns about deadlines due to health-related difficulties\nWe strongly encourage you to indicate that you have a disability, specific learning difficulty or health condition on your application form. This information will be considered separately from your academic suitability for your chosen course, but it helps us understand your access requirements and ensure you have what you need in place to succeed in your studies.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:56:00.583Z","updatedAt":"2021-08-06T16:16:31.099Z"}
