{"id":"4b15c2df-7f1b-4210-ba42-b1f14381e87b","name":"Red Kite Teacher Training","code":"2B9","type":"scitt","isAccreditedBody":true,"ukprn":"10054307","address":{"addressLine1":"Harrogate Grammar School","addressLine2":"Arthurs Avenue","town":"Harrogate","county":"North Yorkshire","postcode":"HG2 0DZ"},"contact":{"website":"https://redkiteteachertraining.co.uk/","email":"TeacherTraining@redkitealliance.co.uk","telephone":"01423 535646","fullName":"Kathy Murdie"},"location":{"latitude":53.9828212,"longitude":-1.5468081},"trainWithUs":"By becoming part of the Red Kite family, you’ll be choosing some of the highest quality training around and giving yourself the strongest possible chance of landing your dream teaching job.\nOur collective mission is to train evidence-informed, professional and inclusive teachers who can lead learning in today’s rich and varied educational landscape.\nWhether you apply for school-centred training (SCITT) or School Direct with Red Kite, you’ll follow a bespoke programme that’s designed nationally but delivered locally. You’ll spend over 24 weeks in your placement schools, meaning you’ll get to properly immerse yourself in school life with both pupils and colleagues.\nOur training network consists of primary, secondary and special schools spread across West and North Yorkshire, meaning there will always be a location and school type that fits with your own personal characteristics and circumstances.\nThe Red Kite approach is geared towards providing each of our trainees with the help and guidance they need at each stage of their journey into teaching, with a dedicated support structure in place from day one which includes experienced mentors and a dedicated Early Career Leader. Our courses are designed to give you the skills and experience most sought after by employers – evidenced by the number of trainees securing a teaching post.\nAll of our courses lead to Qualified Teacher Status (QTS) and a PGCE (worth 60 masters credits) awarded by the prestigious School of Education at the University of Leeds.","trainWithDisability":"At Red Kite we believe the teachers we train are important role models – both in their schools and in the wider community – and that they should reflect the diversity around them and help create a culture that promotes and celebrates inclusion in all its forms.\nIn response to this, we have built up a network of ‘Diversity Champions’, whose role it is to promote conscious inclusion and ensure that every one of our trainees, whatever their personal circumstances, feel welcomed, supported and valued.\nOver years we have worked with a number of individual trainees to tackle specific barriers they have faced, including:\n•\tWorking with a trainee with mobility issues to ensure their placement schools were able to arrange accessible parking, ground floor classrooms, bespoke pupil seating plans and a timetable that allowed them sufficient time to reach other areas of the school if required.\n•\tSupporting trainees with autism to clarify expectations with their schools and oversee any necessary modifications to classroom layouts, lighting and sounds.\n•\tMaking course adjustments for trainees with dyslexia, such as sending PowerPoint presentations in advance of the training and working with them to develop strategies to help turn any particular perceived weaknesses such as spelling and short-term memory into a strength.\n•\tEnsuring that all trainees learn about adult mental health awareness as part of their course.\nOur commitment to diversity in all its forms is evidenced by the fact that 15% of our trainees report having some form of disability.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:55:08.222Z","updatedAt":"2021-09-30T21:46:58.640Z"}
