{"id":"4b4b7a85-26a0-45e4-bc20-237dfe06b941","name":"Parkwood Primary School","code":"2HH","type":"lead_school","isAccreditedBody":false,"urn":"143569","ukprn":"10061930","address":{"addressLine1":"Parkwood Primary School - School Direct","addressLine2":"Parkwood St,","town":"Keighley","county":"West Yorkshire","postcode":"BD21 4QH"},"contact":{"website":"https://www.bradfordbirthto19.co.uk/index.php/home/scitt/initial-teacher-training-scitt/school-direct-primary","email":"scitt@bradfordbirthto19.org","telephone":"01274 494898","fullName":"Anja Wadsworth"},"location":{"latitude":53.8641016,"longitude":-1.9019839},"trainWithUs":"At Parkwood Primary School we provide our children with the best possible education and to develop the whole child during their time with us. Our aim is to serve our community by providing an education of the highest quality. This is achieved through a happy, stimulating learning environment where excellent staff and resources ensure the children achieve their potential. We believe that this is achieved through a close trusting relationship between home and school, working together at all times to promote the vision, aims and ethos of the school and community. We are keen to recruit student teachers who share the same commitment. If you share our vision for education, we want to hear from you. We will provide highest quality training, delivered by outstanding practitioners through a bespoke training package, to make the most of your knowledge and skills. After a year's successful training, you will achieve Qualified Teacher Status. As School Direct partner working with our SCITT provider, we are committed to helping you develop professionally, beyond your training and Early Career Teacher program by means of an extensive programme of Continuing Professional Development opportunities.","trainWithDisability":"We believe that teachers with disabilities make an important contribution to schools both in the classroom and in shaping the wider culture and ethos of the schools they work in, indeed we have 100% pass rate for trainees who have declared a disability. We adhere to The Equality Act 2010 and Special Educational Needs and Disability Act 2001, which require teacher training providers to ensure they are not discriminating against applicants with disabilities or special educational needs (SEN).\nAll our partner Schools value diversity and the unique contribution that all their staff and trainees bring.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"58e814cb-bf42-4d3d-9486-b3ea827fd9e2","code":"259","name":"Bradford Birth to 19 SCITT","description":"Bradford Birth to 19 School Centered Initial Teacher Training (SCITT) offers a different way of training to become a teacher. Learn by listening to and observing good and outstanding teachers. Training involves practicing your teaching skills with groups of students. Supported effectively by a school mentor, you are treated as a member of the school staff, someone the school is often looking to potentially employ. This route ensures you are working in your class from day one of the course.\\r\\nWe aim to train the next generation of outstanding teachers."}],"createdAt":"2021-07-06T17:53:37.378Z","updatedAt":"2021-09-30T19:20:46.708Z"}
