{"id":"4b833e5f-01f5-4306-aed0-cdf0c8db9fa3","name":"Hillingdon SCITT","code":"2B5","type":"scitt","isAccreditedBody":true,"ukprn":"10059208","address":{"addressLine1":"c/o Bishop Ramsey CE School","addressLine2":"Hume Way","town":"Ruislip","county":"Middlesex","postcode":"HA4 8EE"},"contact":{"website":"https://hillingdonteachingschoolalliance.org/Welcome-to-Hillingdon-SCITT/","email":"hillingdonscitt@bishopramseyschool.org","telephone":"1895671062","fullName":"David Poole"},"location":{"latitude":51.5792096,"longitude":-0.4080951},"trainWithUs":"Hillingdon SCITT, an Ofsted recognised Outstanding ITT Provider, located in North-West London, is looking to train exceptional graduates to become teachers. We are seeking people who are not only passionate about education, have an excellent academic background, and are committed to working with children and young people to make a difference in their lives. Trainees who join Hillingdon SCITT will be fully supported and challenged to become reflective, resilient and resourceful practitioners. All Primary and Secondary Schools who are in partnership with Hillingdon SCITT have extensive experience of training teachers and we fully recognise how much vibrancy, enthusiasm and drive they can offer to a school community. We provide a unique opportunity to experience a diverse and contrasting range of teaching and training experiences in at least two schools. Children and young people across the partnership are happy, friendly and well-behaved and are at the heart of everything we do. The teachers in our Partner Schools are excellent practitioners with exemplary behaviour management skills. They are supportive and eager to share their skills, knowledge and practice with the next generation of teachers.\nHillingdon SCITT has successfully trained 5 cohorts of Primary and Secondary teachers. Upon completion of the course Hillingdon SCITT trainees have been graded as Good or Outstanding towards the Teachers' Standards. As a result, our trainees a highly employable and we have had 100% employment rate upon course completion.","trainWithDisability":"Candidates who have disabilities or other needs should contact Hillingdon SCITT prior to their application to discussion their needs and the bespoke support that we can provide for them during their initial training year. The individual Partner Schools have differing disabled access provisions, so if in doubt please contact Hillingdon SCITT for more information.\nBrunel University (Hillingdon SCITT's PGCert provider) has full disabled access and is committed to admitting and supporting students with disabilities.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:53:01.289Z","updatedAt":"2021-09-20T19:42:33.474Z"}
