{"id":"4be7f6ce-ffa0-46a5-811c-90a464710fb2","name":"Hatton Centre for Education","code":"1Y7","type":"lead_school","isAccreditedBody":false,"urn":"137912","ukprn":"10036614","address":{"addressLine1":"The Pythgle","town":"Wellingborough","county":"Northamptonshire","postcode":"NN8 4RB"},"contact":{"website":"https://www.hattonacademy.org.uk/page/?title=Train+to+Teach+with+Us&pid=115","email":"teachingschooladmin@hattonacademy.org.uk","telephone":"01933 226077","fullName":"Keren Gunn"},"location":{"latitude":52.3081782,"longitude":-0.6941409},"trainWithUs":"The Hatton Centre of Education (https://www.hattonacademy.org.uk/page/?title=Train+to+Teach+with+Us&pid=115) is founded on the principle of collaboration and an absolute belief that by working together we can improve life chances for all students in all of our schools.\nOur School Direct training course is ideal for trainees who are looking for hands-on in-school training, learning from teachers who deliver lessons every day. You will be allocated a school-based mentor and will also have a school-based professional tutor, who puts together a comprehensive in-school training programme.\nWe have consistently high employment rates, with many of our trainees going on to be employed within the Centre. The combination of the school based mentoring programme and the University taught modules gives you a competitive advantage when applying for your first teaching position.\nYou will feel part of the school community from the start of your training to the end. We ensure you are supported to get Qualified Teacher Status giving you the best possible start to your teaching career. In addition to QTS you will also graduate with a PGCE which includes at least 60 credits towards a Masters degree.\nWe believe that we offer high quality training, giving sustained attention to developing the confidence of trainees to become reflective classroom practitioners who are confident subject specialists and all-round professionals. Constant support, training and collaborative work between our partners and the Hatton Centre of Education ensures close co-operation, and an excellent academic and professional partnership, which gives our School Direct student teachers varied but consistently rewarding experiences.","trainWithDisability":"The Hatton Centre of Education provides a personalised approach to all our trainee teachers, working in partnership with the higher education institutes, specialist teams and with the trainee to ensure that the course is fully accessible to all potential trainees. We do this by individualising a support plan which is regularly reviewed and evaluated to account for the evolving nature of a trainee's journey. For example, a previous trainee with dyslexia was successfully supported through their course and by being provided with specialist software, 1:1 discussions with specialist teams to build self-esteem and to achieve their full potential. Access for all is an integral characteristic of the HCE as we believe we thrive on diversity.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:47:12.433Z","updatedAt":"2021-09-16T20:40:42.609Z"}
