{"id":"4cb2f8ac-ba06-420b-b70e-cb2521dc1534","name":"Ambitions Training School","code":"135","type":"lead_school","isAccreditedBody":false,"urn":"137998","ukprn":"10003614","address":{"addressLine1":"Queen’s Park Academy","addressLine2":"East Way","town":"Bournemouth","county":"Dorset","postcode":"BH8 9PU"},"contact":{"website":"http://www.ambitions-trainingschool.co.uk/courses/itt/","email":"sarah.simmons@queenspark-academy.co.uk","telephone":"1202526079","fullName":"Sarah Simmons"},"location":{"latitude":50.7477593,"longitude":-1.8600495},"trainWithUs":"The Ambitions Training School Alliance is a diverse, vibrant learning community of schools which include mainstream primary and secondary in addition to specialist provision for primary and secondary children that have social and emotional difficulties. Our schools are all based in Bournemouth and Poole. We offer a school based School Direct training opportunity to achieve QTS and PGCE in partnership with the University of Winchester. This is an exciting opportunity to train with a dynamic and forward thinking Trust, where you will be a valued member of a dedicated and professional team of excellent teachers and support staff. You will be supported by either a class tutor / professional mentor within the school setting, alongside your professional tutor at the University. We have had a very high pass rate since our School Direct programme began and offer our own bespoke training package in addition to the University sessions. In addition, we also support all our trainees with gaining employment for their Early Career Teacher posts once they have achieved QTS. Anyone who is interested in applying to train with us is welcome to make an appointment to visit, tour any of our schools and discuss your individual needs.","trainWithDisability":"Your wellbeing is a top priority and we will do all we can to give you the chance to flourish and maximise your potential. In partnership with the University of Winchester there is a dedicated student support team to help with any questions or challenges you might experience during your studies. We work with you to support your wellbeing and mental health, provide confidential advice and offer workshops to boost your academic skills. If you have a disability or learning difference, we encourage you to get in touch before you apply so we can discuss tailored support for your individual needs.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:46:37.503Z","updatedAt":"2021-12-07T18:07:40.847Z"}
