{"id":"4cc0d82a-c0fc-4661-b1e0-4080bc75b27b","name":"Yorkshire Wolds Teacher Training","code":"2EV","type":"scitt","isAccreditedBody":true,"ukprn":"10058551","address":{"addressLine1":"The Education Alliance","addressLine2":"East Dale Road","town":"Melton","county":"East Riding of Yorkshire","postcode":"HU14 3HS"},"contact":{"website":"ywtt.org.uk","email":"sally.cooper@ywtt.org.uk","telephone":"01482 636720","fullName":"Alison Fletcher"},"location":{"latitude":53.7284536,"longitude":-0.5349145},"trainWithUs":"Yorkshire Wolds Teacher Training offers an exciting and innovative teacher training programme based in bespoke training facilities at South Hunsley School, an outstanding 11-18 school in the East Riding of Yorkshire. Yorkshire Wolds teacher training is privileged to work with a partnership of over twenty schools, giving trainees the opportunity to work with exceptional teachers in a variety of educational settings across the region. Our programme is designed to prepare trainees to become highly effective teachers, with a love of learning, who will continue to develop their skills throughout their career, through exposure to excellent practice, observation, mentoring, coaching, practice, reflection and sharing with peers. YWTT offers a bespoke training package, where excellent practitioners from across the partnership support the development of our trainees through the professional studies and the school based aspects of the programme. Trainees receive a high level of support throughout the programme to help them develop effective teacher wellbeing strategies as well as application support and interview practice, which result in an excellent employment record. YWTT works closely with Wolds Teaching School Alliance, ensuring our trainees gain the best possible start to their teaching career and access to continued professional development opportunities beyond the initial training year. Last year 100% of our trainees were graded good or better at the end of the training course, with almost 50% being graded outstanding. Please join us on our “Get into Teaching” days to find out more, see https://www.ywtt.org.uk for further details.","trainWithDisability":"Yorkshire Wolds Teacher Training is committed to delivering high quality teacher training that meets the diverse needs of its trainee population, ensuring that no individual or group is disadvantaged. All Yorkshire Wolds trainees are allocated a tutor who will work with each individual throughout the programme, celebrating progress, devising bespoke programmes to respond to individual needs and helping them overcome the challenges they may face.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:47:35.181Z","updatedAt":"2021-07-21T18:46:41.324Z"}
