{"id":"4cd36146-0588-4d28-9d21-c03fe3e704b7","name":"Fenland Alliance","code":"1XY","type":"lead_school","isAccreditedBody":false,"urn":"110632","ukprn":"10007152","address":{"addressLine1":"High Street","addressLine2":"Doddington","town":"March","county":"Cambridgeshire","postcode":"PE15 0TF"},"contact":{"website":"http://www.lionelwalden.cambs.sch.uk","email":"head@lionelwalden.cambs.sch.uk","telephone":"01354 740405","fullName":"David Barron"},"location":{"latitude":52.4968046,"longitude":0.0633532},"trainWithUs":"Lionel Walden Primary has linked with Sir Harry Smith Community College in order to deliver high quality primary and secondary School Direct training courses within Fenland, NE Cambridgeshire. Our partnership with the University of Bedfordshire enables successful trainees to achieve a PGCE with Qualified Teacher Status. Both schools have the expertise and commitment to deliver high quality training and support to trainee teachers. In recent years, trainees have been very successful in gaining employment, predominantly in Fenland schools.\n*Primary\nLionel Walden Primary (LWP) has strong connections with primary schools across Fenland meaning that we can offer a diverse range of high-quality placements from small village schools to some of the largest primaries in the country. Our high expectations and passion to enable children to be the best they can be runs through LWP and our partner primaries. *Secondary\nSir Harry Smith (SHS) is located in Whittlesey. Its close proximity to Peterborough means that there are regular trains and buses to the town with the bus stop being a five minute walk from the school. SHS has a very dedicated and supportive team of staff who work closely together. Each department is equipped with a mini staff room which is a quiet, secure base for planning, sharing ideas or simply having a cup of coffee. A number of our teachers completed the School Direct programme and are very willing to share their experiences with trainees. SHS will equip you with a laptop and a supportive professional development programme.","trainWithDisability":"Lionel Walden Primary and Sir Harry Smith Community College are very inclusive and therefore welcome applications from people with disabilities and other needs. We are happy to discuss specific requirements prior to application.\nThe University of Bedfordshire is an inclusive and empowering university. Particular care is taken to ensure that individual needs of all students are met. Encouragement is given so that students can reach their potential in a supportive environment. Disability access information can be found on the university website.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:51:18.423Z","updatedAt":"2021-11-05T23:07:28.644Z"}
