{"id":"4d17b7ae-a925-46e5-8127-d3e17c4929ff","name":"Ignite Institute","code":"22A","type":"lead_school","isAccreditedBody":false,"urn":"140896","ukprn":"10046195","address":{"addressLine1":"St Bernard’s RC Primary School - A Voluntary Academy","town":"Ellesmere Port","county":"Cheshire","postcode":"CH65 5EW"},"contact":{"website":"www.welcometoignite.co.uk","email":"sjevons@stbernards.cheshire.sch.uk","telephone":"0151 355 2047","fullName":"Steve Jevons"},"location":{"latitude":53.271175,"longitude":-2.8884614},"trainWithUs":"Ignite Institute is a diverse range of primary and secondary schools across the North West, committed to growing the next generation of primary and secondary school teachers through our School Direct PGCE programmes.\nAs a training provider, we are proud to work collaboratively with other local partnerships, offering specialist training in SEND and we are renowned for outstanding mentoring in our highly supportive schools. Trainees will receive bespoke training from outstanding practitioners, subject specialists and nationally renowned trainers, all of which will enable them to become highly effective teachers for 21st Century education.\nFor over 6 years, we have trained a growing number of Associate Teachers across EYFS, KS1/2/3 & 4 and have excellent employment rates. 95% of our trainees have gone on to secure jobs, with a high proportion of these in partnership schools. Following your training year, in partnership with Teaching School Hubs, Ignite are committed to supporting you in the next stage of your career, with networks and on-going outstanding training for you to access. We are delighted that many of our previous trainees are now progressing into roles of high responsibility and leadership within their schools.\nFor success stories from our previous trainees, please visit (http://www.welcometoignite.co.uk/itt/success-stories/) We are looking for the next generation of high quality teachers. If you have passion for working with children and want to make a difference, Ignite is the ideal place to realise your potential and help you develop you into a highly skilled classroom practitioner. Visit (www.welcometoignite.co.uk) for more information.","trainWithDisability":"Ignite Institute is highly committed to supporting candidates with disabilities and other needs. Since our training programme began, we have accommodated and supported trainees with specific needs. Please contact us to discuss any questions you may have.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:47:04.939Z","updatedAt":"2021-09-29T15:34:26.472Z"}
