{"id":"4d403991-b837-4d01-9a57-c8f7b1040937","name":"Nene Park Academy","code":"6N8","type":"lead_school","isAccreditedBody":false,"urn":"137082","ukprn":"10034976","address":{"addressLine1":"CMAT Swavesey Village College","addressLine2":"Gibraltar Lane, Swavesey","town":"Cambridge","postcode":"CB24 4RS"},"contact":{"website":"www.campartnership.org","email":"info@campartnership.org","telephone":"01223 491630","fullName":"Helen Naylor"},"location":{"latitude":52.2947667,"longitude":-0.0055253},"trainWithUs":"Cambridge Meridian Academies Trust is a family of schools centred in Cambridgeshire. CMAT schools share a vision of education at the heart of local communities. As a Trust we truly value the success of every child and we place the sharing of excellent education practice at the core of this value. We are committed to improving the quality of education and life in the county of Cambridgeshire, and its immediate surroundings. With this aim, the Trust operates from hubs in Cambridge and Peterborough and its staff, pupils and families are spread across the entire area from rural village to inner city estate. Training the next generation of outstanding teachers is a vital part of our vision for the future. CMAT has a long history of delivering professional training at all levels of a teacher's career. Our philosophy is to encourage creativity and evaluation to continually push the boundaries of learning.\nThe Cambridge Partnership is a well established, successful provider of Initial Teacher Training and rated 'Good' by Ofsted in 2017. The Partnership aims to create successful, bespoke training programmes to stretch and challenge talented graduates who are committed to working in primary or secondary schools around the country. As an experienced provider The Cambridge Partnership can provide the necessary support for schools and trainees to ensure that all trainees thrive in a high quality, reflective environment. The Cambridge Partnership joined CMAT in 2015 and is an integral part of CMAT's holistic view of education.","trainWithDisability":"CMAT and The Cambridge Partnership are committed to equal opportunities for all. We aim to ensure that no present or prospective trainee or tutor receives less favourable treatment than another on grounds of any condition or status not directly affecting study or work. As part of our equal opportunities policy, CMAT and the Cambridge Partnership are committed to improving the support of students with a disability.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:52:54.636Z","updatedAt":"2021-10-13T15:52:34.479Z"}
