{"id":"4d4cceab-1516-4a6c-a9ab-5de0e32e1fe1","name":"University of Sussex","code":"S90","type":"hei","isAccreditedBody":true,"ukprn":"10007806","address":{"addressLine1":"Sussex School of Education","addressLine2":"Essex House","town":"Falmer, Brighton","county":"Brighton and Hove","postcode":"BN1 9QQ"},"contact":{"website":"http://www.sussex.ac.uk/education/ite","email":"iteadmissions@sussex.ac.uk","telephone":"01273 873238","fullName":"Admissions Coordinator"},"location":{"latitude":50.8670895,"longitude":-0.087914},"trainWithUs":"The University of Sussex Schools Partnership offers high quality professional and academic teaching courses leading to Qualified Teacher Status (QTS), a PGCE of 90 Masters Level Credits and a progression route onto a Masters in Education. With a history of innovation we pioneered a model of school-based teacher training 50 years ago, now adopted nationally. Schools are involved at every stage of the selection, training and assessment of our beginner teachers. This long standing relationship results in excellent support from experienced teachers mentoring trainees on placement and dedicated University tutors offering models of successful pedagogy. As a small friendly department we offer our trainees a personal approach and aftercare support and training as Newly Qualified Teachers\nWe train 'thinking' teachers with a over riding desire to make a difference to the lives of young people. A research intensive university, we believe teachers benefit from critical engagement in evidence-based practice, reflection on research and continuing professional development as well as excellent practical classroom skills. Our University sits on a leafy campus at the edge of the South Downs National Park, accessible by road or rail from East and West Sussex, Brighton and Hove, Surrey, Kent, Hampshire and South London. The historic seaside city of Brighton is minutes away, with its pebble beaches and vibrant social and cultural opportunities.\nCourse outcomes are consistently high; 100% achieving QTS on first attempt, 94% completing with Merit or Distinction, 98% securing a teaching post and 99% of ex-trainees rating the course 'good' or 'very good'.","trainWithDisability":"The University of Sussex welcomes applications from all candidates who have the potential to make excellent teachers regardless of disability and additional needs. We have previously successfully supported trainee teachers with dyslexia, dyspraxia, aspergers, mental wealth conditions and a range of physical, hearing and visual impairments.\nAll trainee teachers are first screened for mental and physical fitness to teach by the University's Occupational Health Department before admission to the programme. Following this, if you have a disability or health condition, you will register with the University Student Support service and an assessment is arranged to establish your needs. The team will identify the additional support and adjustments recommended to help you be as successful as possible on the course.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"createdAt":"2021-07-06T17:54:44.013Z","updatedAt":"2021-09-20T19:03:01.948Z"}
