{"id":"4d8d69ab-6df9-4a3f-8ee0-5c7f08bf136c","name":"Cumbria Education Trust","code":"3Q2","type":"lead_school","isAccreditedBody":false,"urn":"141995","ukprn":"10049508","contact":{"website":"https://www.cumbriaeducationtrust.org/","email":"Cwilkins@cumbriaeducationtrust.org","telephone":"7725504132"},"location":{"latitude":54.9443454,"longitude":-2.7419639},"trainWithUs":"If you are keen to develop and progress, if you want to build a career based on research and learning from others and if you want to be supported and nurtured from Early Career Teacher all the way to Specialist Teacher and School Leader, then this is the course for you.\nCumbria Education Trust are a Multi Academy Trust currently consisting of 8 primary and 3 secondary schools serving a wide range of different communities across Cumbria. Our PGCE pathway is run in conjunction with the University of Cumbria and allows trainee teachers to develop their pedagogy teaching using our base curriculum, utilising shared resources and planning whilst allowing every school and every teacher to express their individuality.\nTeaching with us will allow you to explore your interests through a wide range of 27 collaborative groups (English, Maths, every key Stage, SEND, MFL, Media communication etc) across our Trust gaining insight and knowledge from experienced professionals. Visits to a wide range of diverse schools are built into our programme enabling you to learn more and learning quickly.","trainWithDisability":"As a Trust we believes that all staff, and those working with us, with medical conditions, in terms of both physical and mental health, should be properly supported so that they can play a full and active role in school life, We also understand that health needs may change over time, in ways that cannot always be predicted and our arrangements take this into account.\nWe acknowledge that many medical conditions require additional support and resources and we will endeavour to provide and make the necessary arrangements for that support.\nIn addition to the educational impacts, as a Trust we realise that there are social and emotional implications associated with medical conditions. Trust policies and procedures will aim to support both the physical and emotional impact of any medical condition.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-09-23T20:42:57.531Z","updatedAt":"2021-10-14T20:26:08.317Z"}
