{"id":"4da5abb2-b287-451e-8d75-c5b79e11c2bb","name":"University of Wolverhampton","code":"W75","type":"hei","isAccreditedBody":true,"ukprn":"10007166","address":{"addressLine1":"Gorway Road","town":"Walsall","county":"United Kingdom","postcode":"WS1 3BD"},"contact":{"website":"http://www.wlv.ac.uk/teaching","email":"enquiries@wlv.ac.uk","telephone":"01902 321000","fullName":"Institute for Education"},"location":{"latitude":52.5739518,"longitude":-1.9710029},"trainWithUs":"Be Informed, Be Inspiring, Be Influential'\nThe University of Wolverhampton is one of the West Midlands’ largest providers of teacher education, with many of our graduates going on to work within the region. Our tutors are all experienced teachers who have worked with our partnership and family schools for many years.\nWe are proud of our long-standing tradition of training teachers of Early Years, Primary, Secondary and Post Compulsory Education. Access to high quality, bespoke subject knowledge enhancement courses. Access to free Professional Skills Test Support.\nHigh quality learning facilities, including well equipped teaching rooms, cutting edge learning spaces, lecture theatres and a social learning environment.\nA clear progression to the Early Careers Framework and Master’s degree study, with opportunities to use PGCE credits to embark upon further study following successful completion of the course.\nAccess to leading research in the field of Education that enables trainees to develop as reflective practitioners.\nOFSTED May 2021 said:\n\"The partnership provides effective training, both in the university and partner settings, that prepares trainees well to teach their subjects. Trainees learn how to apply relevant research to their teaching. They become reflective practitioners, committed to ongoing professional development. Trainees are also well prepared for the realities of teaching.\"\n\"Staff provide excellent support. University tutors provide effective help with issues such as managing workload and maintaining good mental health and well-being. In partner settings, mentors help to develop trainees’ teaching skills while providing strong professional role models.\"","trainWithDisability":"We have a dedicated Student Support and Wellbeing department within the university offering support services in:\n- Mental Health and Wellbeing: Staff are equipped in supporting students who have mental health needs, or students with an Autism Spectrum Condition. Often, these difficulties overlap and therefore we are here to support you with your overall wellbeing whilst at university. - Disabilities and Specific Learning Difficulties: Including\nSpecific learning difficulties: Dyslexia, Dyspraxia, Dyscalculia and\nMental Health conditions, Autism Spectrum Conditions including Asperger syndrome, Sensory disabilities including those affecting sight or hearing and Long term medical conditions - Counselling: Help is offered in developing your strengths, making decisions and developing the skills and resources to cope. As counsellors, we help you to find the answers.\n- Chaplaincy : Whether you are a person of faith, someone who is searching, someone with questions and doubts, or of no faith, you are welcome in our Chaplaincy building and to receive the support of the Chaplaincy team. We are a team of multi-faith Chaplains and between us we cover all of the University sites.\nFind out more at www.wlv.ac.uk/ssw","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"createdAt":"2021-07-06T17:52:11.237Z","updatedAt":"2021-10-05T14:09:56.322Z"}
