{"id":"4daac859-d081-45ad-834c-4237f112924a","name":"Cheshire East SCITT","code":"25Q","type":"scitt","isAccreditedBody":true,"ukprn":"10035146","address":{"addressLine1":"Selkirk Drive","town":"Holmes Chapel","county":"Cheshire","postcode":"CW4 7DX"},"contact":{"website":"http://www.cheshireeastscitt.org","email":"lorraine.mellish@hccs.info","telephone":"01477 410544","fullName":"Karen Fuller"},"location":{"latitude":53.197618,"longitude":-2.367597},"trainWithUs":"Cheshire East SCITT is a passionate believer in Joint Practice Development with Initial Teacher Training being a key component supporting the professional growth and development of its teaching workforce. Our trainees work towards a Post Graduate Certificate in Education at Masters level which will lead to qualified teacher status (QTS). The PGCE (SCITT) is awarded by Manchester Metropolitan University.\nCheshire East SCITT works in collaboration with The Chimney House Alliance. Our partner schools are: Alsager School. Brine Leas School. Congleton High School, Eaton Bank Academy, Malbank School and Sixth Form College, Middlewich High School, Ruskin Community High School, Sandbach High School and Sixth Form College, Sandbach School, Shavington Academy and St Thomas More Catholic High School. We also work with two Staffordshire schools, Chesterton Community Sports College and The King's School, Kidsgrove. These include a free school, two faith schools, two single sex schools and seven 11-16 schools - some large, small, urban and rural. Some have achieved outstanding Ofsted ratings. Our schools have employed many of our trainees.\nWe have established an environment in which staff, students and trainee teachers feel valued and very well supported. We have worked with trainee teachers for many years and were the first training school consortium in the country. We are fully committed to training the next generation of outstanding teachers and future leaders and fully recognise how much vibrancy, enthusiasm and drive they offer to our school communities. Our expectations are high and our learning environment is fun yet challenging.","trainWithDisability":"The following schools in the partnership have full disabled access as does The Manchester Metropolitan University: * Alsager School * Brine Leas High School * Congleton High School * Eaton Bank Academy * Holmes Chapel Comprehensive School and Sixth Form College * Malbank School and Sixth Form College * Middlewich High School * Sandbach School * Shavington Academy\nIf you do have specific disability access needs, we are happy to discuss your requirements on a one to one basis.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:51:22.191Z","updatedAt":"2021-09-13T19:33:00.807Z"}
