{"id":"4e5e5389-5fa2-47e9-bf6a-1d62287c4927","name":"Zengage Teacher Training Essex","code":"3H5","type":"lead_school","isAccreditedBody":false,"urn":"114827","ukprn":"10073222","address":{"addressLine1":"Owers Road","town":"Witham","county":"Essex","postcode":"CM8 1FR"},"contact":{"email":"c.jones@chippinghill.co.uk","telephone":"01376 512201","fullName":"Ceri Jones"},"location":{"latitude":51.7872608,"longitude":0.6264811},"trainWithUs":"We believe that every trainee teacher has the capability to improve, further enhancing their skills to meet the needs of our children today. Every teacher can be better than the teacher they thought they could be.\nWe feel strongly that all trainee teachers should have high quality mentoring and specific, needs targeted support in order to guide them through the early years of their career - thus ensuring success and satisfaction in equal measure.\nAll trainee teachers should have the opportunity to access a high level, specific professional development package that ensures they feel passionate about a career in education alongside successes each day.\nOur Vision and Values:\n* Helping teachers of the future to find their feet, shape their own path and walk to achieve a career with successful longevity.\n* Care for the well being of each trainee teacher and encourage an outcome oriented mindset inline with crucial and vital goals.\n* Help to develop a sense of resilience and resourcefulness, to enable the future of teaching to be initiative led, based on challenge solving, creative and critical thinking.\n* Provide a win/win model of abundance and collaboration, giving opportunity to learn within an interdependent structure of support thereby achieving success for self and pupils alike.\n* Support trainee teachers with their skills to become the teacher they need to be for the children who will develop to be the healthy grown adults of the future.","trainWithDisability":"Here at Essex Teacher Training we are committed to offering all prospective trainees the opportunity to gain QTS. Please let us know if you have a specific need and/or require any adjustments at the interview stage or throughout the ITT programme.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"00782614-9301-40e4-8832-9a74cc1bbb07","code":"E75","name":"Essex Teacher Training","description":"Essex Teacher Training is a large provider, offering a variety of different school-based routes to QTS in schools across Essex and its adjoining counties. \\r\\n\\r\\nHeadteachers value the contribution trainee teachers can make to their schools. As a result, trainees enjoy their training and the vast majority gain employment in one of our partner schools, once qualified. \\r\\n\\r\\nAll of our tutors are experts in their field and many are still teaching, so you benefit from their knowledge and experience. We pride ourselves on the support we offer our trainees and put trainee wellbeing at the heart of what we do."}],"createdAt":"2021-07-06T17:53:46.420Z","updatedAt":"2021-10-04T01:58:15.116Z"}
