{"id":"4e8e0d83-c8f6-4338-ad0d-b5e8865e2b84","name":"Cotswold Edge Teaching Alliance","code":"26P","type":"lead_school","isAccreditedBody":false,"urn":"137123","ukprn":"10034599","address":{"addressLine1":"Marling School","addressLine2":"Cainscross Road","town":"Stroud","county":"Gloucestershire","postcode":"GL5 4HE"},"contact":{"website":"http://www.ceta.school","email":"info@ceta.school","telephone":"01453 762251","fullName":"Nikki Embling"},"location":{"latitude":51.7460977,"longitude":-2.2359216},"trainWithUs":"CETA is an inspirational place to work and learn. It provides a high quality school based learning opportunity for trainee teachers in partnership with the Gloucestershire Initial Teacher Education Partnership (GITEP) University of Bristol and Bath Spa University. We have a strong track record of working with trainee teachers for many years and fully embrace the energy, enthusiasm and drive they offer to a school community. Within our alliance there are three secondary schools, with Marling School being the lead school, and thirteen primary schools working collaboratively to provide support, challenge and a diverse and exciting experience for our trainees.\nStudents across the partnership are well-motivated and are at the heart of everything we do. In CETA we believe that our staff are the most valuable resource and therefore they have access to on-going training and professional development. Our teachers are excellent practitioners and they are eager to share their skills, knowledge and practice with the next generation of teachers.","trainWithDisability":"Marling School is committed to Equality and Diversity. All schools that we place trainees in have clearly established policies, processes and systems for monitoring that ensure trainees of all abilities are suitably catered for and supported. Where trainees have had specific needs in the past, we have taken a bespoke approach to ensure there are no barriers to learning experienced.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:46:46.217Z","updatedAt":"2021-09-16T17:15:24.743Z"}
