{"id":"4ea9c371-fd1b-4d83-bb71-392224146d87","name":"Pioneers Partnership SCITT","code":"1Z8","type":"scitt","isAccreditedBody":true,"ukprn":"10058215","address":{"addressLine1":"Kenyon Lane","addressLine2":"Middleton","town":"Manchester","county":"Lancs","postcode":"M24 2GT"},"contact":{"email":"mtsvrobinson@middtech.com","telephone":"1616435116","fullName":"Allison Crompton"},"location":{"latitude":53.5477921,"longitude":-2.180393},"trainWithUs":"The Pioneers Partnership SCITT is committed to providing the highest quality of teacher training: ensuring those who begin their careers with us are reflective, inquisitive and confident practitioners. Our vision is underpinned by a strong moral purpose to serve the pupils of our partner schools, by improving the life chances of those children, some of whom come from the most deprived areas of the country. Once having completed your training with us you will also be able to access a programme of Continued Professional Development through our partner schools, who will provide you with support for the next step of your career. We are proud of our very strong employment rates and many of our alumni now hold positions of responsibility within our partnership schools. The benefits of a school centred programme include: - You are immersed in school life from the very start of the course and join your host school as a valued member of their staff. - All training is delivered by expert practitioners and provides the opportunity to apply theory to classroom practice.\n- Trainees complete the course with many more hours classroom experience than those who have followed a university-led route, leaving them more confident and skilled as they embark on their NQT year.\n- As well as Qualified Teacher Status, trainees will also work towards the internationally recognised PGCE qualification (in association with Manchester Metropolitan University).","trainWithDisability":"The training partnership confirms its commitment to a comprehensive policy of equal opportunities for trainees and prospective trainees in all aspects of its teaching and examination; its counselling of trainees; the way it affords access to any of its benefits, facilities and services. The aim of the partnership is to ensure that no trainee or prospective trainee receives less favourable treatment directly or indirectly on grounds of race, colour, nationality, ethnic origins, gender, sexuality, marital or parental status, disability, creed, social or economic class.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:55:50.384Z","updatedAt":"2021-07-09T20:02:38.563Z"}
