{"id":"4ec36a25-573c-4b65-a56c-137da4d16558","name":"Havering Train2Teach","code":"178","type":"lead_school","isAccreditedBody":false,"urn":"132776","ukprn":"10069441","address":{"addressLine1":"Severn Drive","addressLine2":"Cranham","town":"Upminster","county":"Essex","postcode":"RM14 1SW"},"contact":{"website":"https://www.haveringtrain2teach.com","email":"Train2teach@engayne.co.uk","telephone":"1708223492","fullName":"Sara Sankey"},"location":{"latitude":51.5462421,"longitude":0.2708525},"trainWithUs":"Havering Train2Teach is a trainee teacher programme within the London Borough of Havering.\nHavering Train2Teach are located in the London Borough of Havering and the Lead school is Engayne Primary. As a trainee you will be based in a Primary school within Havering, areas include Romford, Hornchurch, Upminster, Cranham and Rainham. Our teacher training programme is run over a one-year period (September to July) in partnership with the TES Institute. The one year course is delivered with a mix of in-school experience, online learning, tutor support and in-school mentor support.\nThe TES institute programme is a unique opportunity to work as a member of a school team and learn about teaching from dedicated, experienced professionals in schools. TES Institute’s School Direct ITT programme will allow you to:\n•\tWork in a school alongside teaching professionals, learning from experienced practitioners as part of a team\n•\tTrain to prepare and deliver your own lessons and in time, take shared responsibility for your own classes\n•\tGain contrasting experience in a second partnership school\n•\tAccess supporting online study sessions 24/7 that focus on the theory and practice of teaching and learning\n•\tBenefit from the support of an in-school mentor and a TES Institute pathway tutor to guide and progress towards QTS\n•\tBe part of School Direct partnership schools\n•\tGain QTS with an option to add PGCE\n•\tIncrease your subject knowledge with online Subject Knowledge Enhancement (SKE)\n•\tBursaries available.\nwww.haveringtrain2teach.com","trainWithDisability":"Havering Train2Teach recognises, celebrates and plans for diversity and equality. Our partnership schools are ones in which well-being and the principles of inclusion matter. All schools in the partnership are dedicated to achieving equality of opportunity where access hinges not on treating trainees in the same way, but on taking positive action to redress the inequalities faced by some trainees.\nHavering Train2Teach schools are located across the borough in a variety of buildings, all with different facilities allowing for a suitable placement for trainees with disabilities to be found. We have been able to accommodate trainees with mobility issues who have needed to be located on a ground floor or who have had trouble standing for long periods of time. Practical adjustments to physical environments are part of each school’s accessibility plan and will be considered in individual cases.\nBy working closely with TES, reasonable variations can be made to allow access to the training plan and the delivery of information. Each new trainee has an initial need assessment (INA) which leads to a more individualised program for all.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:47:09.818Z","updatedAt":"2021-07-22T15:16:42.353Z"}
