{"id":"4f36b9a3-863f-4ece-8d72-584435125ac7","name":"Twynham Learning (School Direct)","code":"13Q","type":"lead_school","isAccreditedBody":false,"urn":"142671","ukprn":"10056993","address":{"addressLine2":"Sherborn Crescent","town":"Poole","county":"Dorset","postcode":"BH17 8AP"},"contact":{"website":"https://www.twynhamlearning.com and www.poolescitt.co.uk","email":"hbscitt@adastra.poole.sch.uk","telephone":"01202 605315","fullName":"Roger Lister"},"location":{"latitude":50.733226,"longitude":-1.782691},"trainWithUs":"Twynham Learning is a partnership of schools and other organisations sharing skills and expertise to improve learning and achievement for every child and young person across Bournemouth and beyond. \n\nAs a Teaching School, Twynham Learning plays a fundamental role in developing a self-sustaining system where new teachers learn from the best teachers, supported through a culture of coaching and mentoring. \n\nThis course combines the excellence of Poole SCITT and Kingston University input alongside the outstanding practices that take place within the Twynham Learning partnership.","trainWithDisability":"Your well-being is a top priority and we will do all we can to give you the chance to flourish and maximise your potential. Candidates are given several opportunities to declare any disabilities or additional support required both before and during the course. We support students on an individual basis according to need. Being a small provider, on occasions we may need to seek specialist advice from outside agencies.\nAll candidates successful in obtaining a place will need to be medically cleared as 'Fit to Teach' as per DfE initial teacher training requirements. \nPoole SCITT centre at Ad Astra Infant School is accessible for all as are most of our placement schools.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"964657c0-043a-4280-8e2a-df4210748a8a","code":"B52","name":"Bournemouth Poole & Dorset Teacher Training Partnership","description":"n/a"},{"id":"f92545e7-be5f-4a2b-a9af-21271b8d985e","code":"P75","name":"Poole SCITT","description":"Poole SCITT is recognised by Ofsted as an ‘Outstanding’ provider of teacher education at primary level and has a long history of training teachers. \\r\\n\\r\\nAd Astra Infant School, Canford Heath, Poole, Dorset is the Taught Course Centre. Some course sessions may take place in the partnership schools. The team are based at Ad Astra Infant School and are responsible for the general direction and day-to-day running of the course.\\r\\n\\r\\nValidated for PGCE status by Kingston University, Kingston upon Thames, Surrey and the course carries ‘M’ credits towards a Masters."}],"createdAt":"2021-07-06T17:46:30.764Z","updatedAt":"2021-07-28T17:47:14.027Z"}
