{"id":"4f82138b-dca2-4a46-9686-e8391944b18f","name":"Orwell Education Alliance","code":"2HP","type":"lead_school","isAccreditedBody":false,"urn":"144217","ukprn":"10063480","address":{"addressLine1":"Orwell Education Alliance","addressLine2":"Prince of Wales Drive","town":"Ipswich","county":"Suffolk","postcode":"IP2 8PY"},"contact":{"website":"https://orwellea.org.uk/","email":"orwellea@omat.org.uk","telephone":"1473683932","fullName":"Anita Krishna"},"location":{"latitude":52.0419737,"longitude":1.1422584},"trainWithUs":"The Orwell Education Alliance’s constituent schools have been training teachers for many years as we have always believed in the importance of using our skilled practitioners to develop the next generation of teachers. We are proud of our track record in producing consistently good and outstanding teachers who often progress rapidly to becoming excellent classroom practitioners, move into positions of leadership or added responsibility. We have an established process that takes our trainees through an induction and training programme including detailed mentor meetings, and placement in a year group team. Key to our success has been consistent high expectations backed by the expertise of our mentors who are outstanding practitioners able to challenge and coach trainees to a high standard. We *will* challenge you but with that will come close support to help you develop the depth of skill and practical experience needed to become an outstanding teacher. We have excellent contacts with other schools, training partners and organisations that allow development tailored to your needs and ambitions. We are proud to be the Ipswich Hub for the outstanding Colchester Teacher Training Consortium who share our ideals and goals to provide an excellent ITT experience that equips our trainees with the skills and knowledge for a rewarding career in education. A recent quote from a Training partner: “Feedback from our trainees and colleagues has been exceptional about the overall experience and the confidence they have gained from being in your school” For further information, email orwellea@omat.org.uk or ring 01473 683932.","trainWithDisability":"We are committed to supporting trainees with disabilities and other needs, so please let us know if you would like us to make any adjustments to support you during the application, interview process and throughout your programme.\n\nBespoke support is provided for trainees with a variety of needs. Examples include:\n- Personal tutor for the PGCE\n- Resources to allow easier access on computer applications if required\n- Expert pastoral care","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:52:23.259Z","updatedAt":"2021-10-04T16:19:40.334Z"}
