{"id":"4fa35b82-a5a8-4a90-8ff0-04b8195a3a45","name":"Tykes TSA","code":"2C3","type":"lead_school","isAccreditedBody":false,"urn":"140242","ukprn":"10043460","address":{"addressLine1":"Tykes, Unit 4, Great Cliffe Court","addressLine2":"Dodworth","town":"Barnsley","county":"Barnsley","postcode":"S75 3SP"},"contact":{"website":"http://www.tykestsa.education/","email":"deemarsh@tykestsa.education","telephone":"01226 100450","fullName":"Dee Marsh or Victoria Harrison"},"location":{"latitude":53.5477543,"longitude":-1.5300749},"trainWithUs":"We provide professional personalised Initial Teacher Training. It is our aim to train the next generation of outstanding teachers in South Yorkshire!\nWe work in partnership with Sheffield Hallam to deliver the Schools Direct route into teaching (3-7, 5-11 & 11-16 age ranges). On successful completion of the course students are awarded QTS, PGCE, comprising 60 credits at Master Level 6. Students are placed in two highly performing schools (for Primary both will be within Barnsley ), mentored by good and outstanding teachers, experiencing all aspects of school life which is invaluable when applying for future teaching positions. We pride ourselves on our holistic support for students. Creating opportunities for sharing good practice ideas and we foster a supportive environment amongst our cohorts. Our experts deliver taught training sessions to ensure our students are fully equipped to enter the teaching profession. These cover topics that are most relevant to the current climate and needs of the local region. We work with small cohorts and so our training is tailored to meet the needs of individual students. Over the last three years we have had a 100% pass rate. In 2020/21 35% of students were awarded QTS with Higher Standard & over 75% of students had secured an ECT position before the end of the course. We are committed to providing the highest standard of education for the young people in our community of South Yorkshire. If you share our vision for education, we want to hear from you!","trainWithDisability":"At Tykes Teaching Alliance we aim to provide a bespoke, personalised, professional package for all our students. We discuss with our students their specific needs and tailor our support and training offer where needed. We are friendly, approachable and always on hand for our students. If you have a disability, including long term medical conditions, specific learning difficulties and mental health conditions you can access additional support for your academic studies whilst at Sheffield Hallam. This may include learning contracts, support workers equipment/assistive technology and software. There is an onsite assessment Centre, the Sheffield Regional Assessment Centre, where a range of disability specialists can carry out Study Needs Assessments. Daily drop in sessions are run, with no appointment needed. We have a detailed Equality Policy stating how we fulfil our responsibilities to The Equality Act 2010, this can be accessed here;\nhttps://www.tykestsa.education/resources/\nWe will take reasonable steps to ensure all our students receive the best possible training experience. This may involve altering or avoiding a physical feature, for example step and lifts, providing auxiliary aids/services or provide information in an accessible format (this is not exhaustive.)","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"accreditedBodies":[],"createdAt":"2021-07-06T17:48:13.329Z","updatedAt":"2021-10-12T16:56:31.582Z"}
