{"id":"4fac9429-c2af-4bc2-b871-245febfa809b","name":"Darlington West Park Partnership","code":"1DB","type":"lead_school","isAccreditedBody":false,"urn":"137042","ukprn":"10033825","address":{"addressLine1":"Alderman Leach Drive","town":"Darlington","county":"Durham","postcode":"DL2 2GF"},"contact":{"website":"http://www.westparkacademy.org.uk","email":"e.farrow@westparkacademy.org.uk","telephone":"01325 380792","fullName":"Emma Farrow"},"location":{"latitude":54.5465211,"longitude":-1.586284},"trainWithUs":"West Park Darlington Partnership is a commitment to ensuring that all learners within our partnership schools have access to bespoke learning pathways enabling them to succeed. This ethos applies to our children and young people as well as our trainees, teachers and support staff as learners. We work closely with the University of Sunderland, the partnership schools and our own strategic partners to provide continuity of experiences to ensure judgements and training reaches the required standards.\nTraining as a PGCE School Direct student ensures that you will be in your host school from your first day that your school opens in September and will have the opportunity to spend the year being part of an accomplished and experienced school staff team working within the wider curriculum. You will complete an additional placement in the spring term in one of our contrasting partner schools. You will study at the University of Sunderland for around fifteen days during your full training year.\nWest Park Academy (W) is the lead school for the partnership and as a Lead School we help to advertise School Direct vacancies for our host schools. The Darlington primary schools in the partnership are West Park Primary School (W), Red Hall Primary (R) Reid Street Primary (S), Skerne Park Primary (K) and George Dent Nursery School (G). The school which you are applying for will be one of two placement schools where you will be placed throughout the year.","trainWithDisability":"We follow the University of Sunderland Diversity Statement:\n“We celebrate and value the diversity of all students and staff, working to ensure that all are welcome in our community and do not face discrimination or encounter barriers with regard to their disability. “\nThe University of Sunderland Disability Support Team provides advice, information and guidance to students with a disability; students with mental illness or mental health difficulties; students with Specific Learning Difficulty (SpLD) such as dyslexia. On application please contact the Disability Support Team for disability-related queries:\nWebsite: Disability Services Email: disability.support@sunderland.ac.uk\nTel: 0191 515 2952","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"926804ac-be7a-4f0a-97f9-a26a5f5f032a","code":"S84","name":"University of Sunderland","description":"We are proud to work in Partnership with the University of Sunderland. The University has successfully trained teachers for over 100 years making a difference in educating the next generation of learners. Through our partnership with the University our Trainee Teachers benefit from the support of our Primary Tutor Team who are experts in their subject fields and related pedagogies. The School of Education is world leading in research according to the latest Research Excellence Framework. Trainees are allocated a Personal Tutor from the university who will work with their School Mentor to give academic, pastoral and placement support."}],"createdAt":"2021-07-06T17:50:09.442Z","updatedAt":"2021-09-29T20:21:06.149Z"}
