{"id":"505edc7f-1856-4330-b1eb-a50d784b6c25","name":"St Helens ONE - Grange Valley Primary","code":"2KF","type":"lead_school","isAccreditedBody":false,"urn":"104774","ukprn":"10073116","address":{"addressLine1":"Grange Valley Primary School","addressLine2":"Heyes Avenue, Haydock","town":"St Helens","postcode":"WA11 0XQ"},"contact":{"website":"https://www.grangevalley.st-helens.sch.uk/schools-direct-1","email":"ellen.riley@sthelens.org.uk","telephone":"01744 678300","fullName":"Dianne Holcroft"},"location":{"latitude":53.4628567,"longitude":-2.6698976},"trainWithUs":"Grange Valley Primary School is an Outstanding National Support School with responsibility for the St. Helens ONE Schools Direct. It has a very successful record of working with other schools and the local authority, in improving teaching and learning, pupils attainment and achievement. St. Helens ONE aims to provide future trainee teachers with the unique opportunity to develop into successful leaders of learning. We are passionate about providing our children with high quality education which enables them to thrive. You will work alongside like-minded individuals who are eager to guide new students in developing themselves as professionals so they can experience a truly rewarding career choice.\nAs a training provider, we work in close partnership with Liverpool Hope University and several primary schools across St. Helens to ensure that we provide stimulating and challenging training to all of our trainee teachers. In September 2021, we will be running two non salaried Schools Direct courses one for primary phase student teachers, who will be qualified to teach the age range 5 to 11 and one for primary trainee teachers, who will be qualified to teach the Early Years age phase age 3 to 7.\nOur School Direct Teacher Training programme has been carefully planned to ensure that you receive a personalised experience, drawing on your own knowledge and experience so that you are the driver of your own success and the success of the children you teach.","trainWithDisability":"We welcome all trainees regardless of their needs and would endeavor to support all. If you have a disability, you shouldn’t be dissuaded from applying. We will ensure all reasonable adjustments, on an individual basis, are put in place to help you achieve your ambition of becoming a teacher.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"e328aab3-a535-4921-8ded-5e37133c76dd","code":"L46","name":"Liverpool Hope University","description":"Liverpool Hope University has a long established tradition of delivering high quality Teacher Education. Their School Direct Partnership believes that it is vital that all trainees have the academic and theoretical underpinning to become outstanding practitioners within the field of Education. It is compulsory for all trainees completing a Postgraduate Certificate of Education (PGCE) to study at Masters level. This aspect of the training takes place at the university."}],"createdAt":"2021-07-06T17:47:07.074Z","updatedAt":"2021-08-05T21:01:08.039Z"}
