{"id":"50aa4750-b887-49bc-9bf4-b67a55e18288","name":"National Online Teacher Training","code":"2LC","type":"lead_school","isAccreditedBody":false,"urn":"135945","ukprn":"10027700","address":{"addressLine1":"c/o Sirius Academy West","addressLine2":"296 Anlaby Park Road South","town":"Hull","county":"Kingston upon Hull","postcode":"HU4 7JB"},"contact":{"website":"https://nott.vidlearn.ac.uk/","email":"info@onlineitt.ac.uk","telephone":"0800 002 5282","fullName":"Chris Fletcher"},"location":{"latitude":53.7345085,"longitude":-0.4090966},"trainWithUs":"Welcome to the National Online Teacher Training (NOTT) Programme, a new online initiative to suit modern busy lifestyles that enables trainees to complete most of their teacher training through distance learning. Train to teach one of the priority subjects of Mathematics, Physics, Chemistry, Biology, English, Spanish, French, Computer Science, Geography or Religious Studies. Our courses lead to QTS via a two stage route into teaching. The unique approach of NOTT allows us to offer you support before and during your teacher training. With elements of the course delivered online there is no need for you to attend centre or university-led lectures. This means you can be based full time in your placement school to benefit from immersion in the school environment from the very start of your training.","trainWithDisability":"With elements of the course delivered online there is no need for you to attend centre or university-led lectures. This means you can be based full time in your placement school to benefit from immersion in the school environment from the very start of your training. The TTEP suite of online resources takes you through the Professional Studies 1 and Subject Studies that you need at the start of your teacher training. Professional Studies 2 builds on this to extend and improve your teaching. This is supported by our pedagogy sessions that are aligned with the Teachers’ Standards to provide coherent examples of best practice.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:53:41.480Z","updatedAt":"2021-09-29T23:49:37.387Z"}
