{"id":"50cc94f3-f72f-4c17-acb4-a3295d7eeb70","name":"Kingsbridge EIP SCITT","code":"K51","type":"scitt","isAccreditedBody":true,"ukprn":"10054033","address":{"addressLine1":"C/o Platt Bridge Community School,","addressLine2":"Rivington Avenue, Platt Bridge","town":"Wigan","county":"Lancashire","postcode":"WN2 5NG"},"contact":{"website":"http://www.kingsbridgeteachertraining.co.uk/applications/ucas","email":"kingsbridge@cfat.org.uk","telephone":"01942 487999","fullName":"Trish Sexton"},"location":{"latitude":53.5222368,"longitude":-2.5948394},"trainWithUs":"At Kingsbridge we provide a fantastic package that offers excellent training, experience and results. We have a strong tradition of academic excellence. For over 10 years we have been training graduates to become outstanding teachers. We are proud of our 100% pass rate, with 85% of trainees achieving the outstanding grade.\nWe offer a wide variety of opportunities to enrich your training. You will spend all your time with us based in one of our partner schools. You will also be able to experience life in a different teaching environment through a separate placement.\nWe will be with you every step of the way because all our placements offer a level of support to suit your needs. Every trainee has a school-based mentor who is on hand to offer daily advice and guidance. You will also get outstanding support from your subject coaches and Kingsbridge’s team of consultants.\nAt the end of your training you will achieve qualified teacher status and a PGCE (SCITT). This qualification will give you 60 masters credits which you can use if you choose to go on to complete your masters qualification.\n“The quality of mentoring is of a high standard. School-based and subject\nmentors work closely with trainees to develop their subject knowledge and\nteaching skills. They skilfully coach and develop trainees’ skills in a\nsystematic way, through the setting of short-term targets. By the end of\ntheir training, trainees are highly accomplished practitioners in all aspects of\nthe teachers’ standards.” Ofsted, November 2015","trainWithDisability":"We value applications from all candidates irrespective of race, colour, nationality, national or ethnic origins, gender, marital status, sexual orientation, disability or religious beliefs. All candidates must be physically and mentally fit to teach children and not legally debarred from so doing.\nKingsbridge SCITT ensures that our provision does not place applicants with declared disabilities at a disadvantage. We consider making anticipatory adjustments to promote positively equality of access for disabled applicants, including access to benefits, facilities and services. We provide as many opportunities as possible for applicants to identify any special arrangements they may require, for example when inviting them for interview.","createdAt":"2021-07-06T17:53:02.312Z","updatedAt":"2021-08-11T16:42:40.961Z"}