{"id":"51404eba-d28e-4e15-8035-db8bf367b1bd","name":"Mounts Bay","code":"12U","type":"lead_school","isAccreditedBody":false,"urn":"136873","ukprn":"10034131","address":{"addressLine1":"Mounts Bay Academy","addressLine2":"Boscathnoe Lane","town":"Penzance","county":"Cornwall","postcode":"TR18 3JT"},"contact":{"website":"www.appliedminds.eu","email":"enquiries@mountsbay.org","telephone":"01736 352321","fullName":"Les Hall"},"location":{"latitude":50.1280212,"longitude":-5.557178},"trainWithUs":"We believe in investing in the growth of teachers, unlocking potential and encouraging both critical thinking and engaged, dynamic learning. We believe that teacher learning is an ongoing process, beginning with this initial training phase and continuing throughout your professional life. We are a group of schools with like-minded educational philosophies. We work together to promote leading teaching methods and cutting-edge learning services. For Secondary our main placement school is Mounts Bay Academy, an Outstanding school in Penzance. We use other good and outstanding schools for the second placement. We use a selection of good and outstanding Primary schools in and around this area to give a positive and varied experience. All our schools used experienced teachers to support their trainees and a comprehensive CPD programme of training and support. There are many wider opportunities during the training programme and we encourage people to apply who are motivated, creative, patient, confident and engaging as your enthusiasm for teaching will empower the futures of others.","trainWithDisability":"We support all candidates who meet the minimum selection criteria to participate fully in the training. Each school used for placements will have their own accessibility differences and they will work with any candidates to accommodate their needs.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:52:16.466Z","updatedAt":"2021-09-20T16:30:05.610Z"}
