{"id":"516df722-51ff-43fd-9278-f5ad88ba39ec","name":"Claydon High School","code":"2GU","type":"lead_school","isAccreditedBody":false,"urn":"144214","ukprn":"10063919","address":{"addressLine1":"Claydon High School","addressLine2":"Church Lane","town":"Claydon","county":"Suffolk","postcode":"IP6 0EG"},"contact":{"website":"https://www.claydonhigh.co.uk/Vacancies/Suffolk-and-Norfolk-SCITT/","email":"fhubbard@claydonhigh.com","telephone":"01473 836110","fullName":"Maeve Taylor"},"location":{"latitude":52.1064061,"longitude":1.1157683},"trainWithUs":"Claydon High School, a highly successful school in Suffolk in partnership\nwith the Suffolk & Norfolk Secondary SCITT Tuition PGCE programme, has an excellent local reputation for providing training of the highest quality. We are a small school but can offer a range of subjects and our trainees and new staff comment upon the warm welcome they receive and how quickly they get to know students and colleagues alike.\nPlease note that not all placements will be at Claydon High School.","trainWithDisability":"Suffolk and Norfolk SCITT supports all trainees based on their individual needs. Recently this has included those with dyslexia, physical, hearing and visual impairments and mental health conditions. Plans are developed with trainees to ensure that they can fully access in centre training, operate effectively on school placement and complete written assignments.\nWe are committed to supporting trainees with disabilities and other needs. All successful application complete a ‘Fit to Teach’ screening process managed by our occupational health provider. This will make us aware of any specific adaptations that you may require in order to be successful in your training year.\nWe have a highly developed programme to support trainee well-being. We know that teaching can be stressful (as it can be rewarding) and our aim is to get the right balance of skills knowing that the skills and tools you will gain will help support your wellbeing and mental health throughout your training and into your career as a teacher\nPlease contact us to discuss any access requirements.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:56:44.484Z","updatedAt":"2021-10-05T16:42:25.942Z"}
