{"id":"52152e02-61fc-4c95-a124-496d673831e5","name":"Landau Forte College Derby SCITT","code":"186","type":"scitt","isAccreditedBody":true,"ukprn":"10018562","address":{"addressLine1":"Landau Forte College","addressLine2":"Fox Street","town":"Derby","county":"Derbyshire","postcode":"DE1 2LF"},"contact":{"website":"http://www.landaufortescitt.org.uk","email":"scitt@landau-forte.org.uk","telephone":"01332 204040","fullName":"Sandra Oswald"},"location":{"latitude":52.9273944,"longitude":-1.4727404},"trainWithUs":"Landau Forte College Derby where our central SCITT hub is based, is rated ‘Outstanding’, has the leading Progress 8 and Attainment 8 results for GCSE in Derbyshire and is ranked first in the Good Schools Guide (2020). Our staff work hard to support trainee teachers whilst making a difference to the outcomes of all the young people in our care. We are justifiably proud of our learning environment and the difference we make to disadvantaged students. We have a growing partnership of secondary schools across the local region and we take a lot of care to match you to a school and mentor where we think you will flourish.\nAt the end of your training you will be assessed against the Teachers' Standards and Landau Forte SCITT will recommend you for QTS (Qualified Teacher Status). This is the qualification you need to be able to work in schools. TEF Gold awarded University of Derby is our PGCE partner. They attend the SCITT hub to support you with research focused assignments leading to the PGCE award with 60 Master’s level credits which will allow you to continue your teacher education in the future.\nWe have a great record of achievement for those graduating into the profession and going on to achieve successful careers in education.","trainWithDisability":"Landau Forte College Derby has full disabled access. \nApplicants who would benefit from disabled access should let us know on their application so that they can be considered for placements at the appropriate schools. \n\nWe will only ask questions about health that are necessary to ensure that a person is able to teach. We have a wide range of facilities to meet the needs of trainees with special requirements and disabilities. Please discuss any requirements with us at any time.\n\nAs a training provider we welcome our duties under the Equality Act 2010. We are committed to fairness and equality of opportunity to all candidates and are committed to the principle that every member of the college community is entitled to equal opportunities irrespective of age, disability, race, sex, marital status, sexual orientation, or religion.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:49:25.888Z","updatedAt":"2021-10-05T19:51:30.609Z"}
