{"id":"524a9943-eb5f-4b31-8e69-c8e1fcac60b6","name":"Diocese of Leeds BKCAT Alliance","code":"1ZX","type":"lead_school","isAccreditedBody":false,"urn":"108297","ukprn":"10006270","address":{"addressLine1":"Cutsyke Road","town":"Featherstone","county":"West Yorkshire","postcode":"WF7 6BD"},"contact":{"website":"www.st-wilfrids.bkcat.co.uk","email":"jball@st-wilfrids.bkcat.uk","telephone":"1977691000","fullName":"Jane Ball"},"location":{"latitude":53.6982201,"longitude":-1.3636907},"trainWithUs":"The Diocese of Leeds BKCAT Alliance offers the opportunity to train to teach alongside serving outstanding teachers in a scheme overseen by St Wilfrid’s Catholic High School & Sixth Form College.\nSt Wilfrid’s has expanded into a large partnership working with 16 schools across Primary and Secondary phases. Training with the Diocese of Leeds BKCAT Alliance can therefore be tailored to your needs and the type of school you are drawn to with experience available in a range of settings. All the schools are committed to playing a significant role in training up their own future teachers as part of this collaborative network.\nSt Wilfrid’s has a national reputation as an award winning school which makes it an ideal leader of our innovative approach to school based teacher training.\nSt Joseph’s Castleford lead the primary aspect of the Alliance. They offer opportunities to train in an environment where teaching and learning are centred on the teaching and example of Jesus Christ in secure, well-ordered schools which allow for the spiritual, emotional and intellectual growth of the pupils.\nChild Care Facilities\nWe have no onsite child care facilities but we are happy to advise trainees about local providers close to our schools, many of which are used by our existing staff.","trainWithDisability":"Disability Access\n\nDisabled access to our schools is good but we ask people to discuss their specific needs with us so we can place trainees at the most suitable school to meet their needs.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"19a3446e-382d-4c14-83bb-a76563cef3c1","code":"L24","name":"Leeds Trinity University","description":"We work in partnership with Leeds Trinity University who accredit and co-deliver our course. The course is a blend of university and school based training and leads to a PGCE qualification QTS with Master’s credits. Master’s modules can be completed in the ECT year and act as a bridge into further professional development. \\r\\nAssessment is both summative and formative during each progressive stage. At the end of each stage you will be required to submit a portfolio of evidence which is moderated and validated by school based and university based tutors for Quality Assurance."}],"createdAt":"2021-07-06T17:56:51.897Z","updatedAt":"2021-09-27T15:52:19.555Z"}
