{"id":"529174aa-ece6-4d7c-a36c-8e96278631c1","name":"Dartmoor Teacher Training Partnership","code":"2BT","type":"lead_school","isAccreditedBody":false,"urn":"145334","ukprn":"10007792","address":{"addressLine1":"Dartmoor Multi Academy Trust","addressLine2":"Mill Rd, Okehampton","town":"Okehampton","county":"Devon","postcode":"EX20 1PW"},"contact":{"website":"https://www.dartmoormat.org.uk/","email":"shuxen@dmatschools.org.uk","telephone":"01837 52866","fullName":"Martin Smith"},"location":{"latitude":50.7364208,"longitude":-3.9969593},"trainWithUs":"Dartmoor Multi Academy Trust is pleased to lead the Dartmoor Teacher Training Partnership. Working in collaboration with both the University of Exeter and Plymouth Marjon University, we have years of experience of offering a range high-quality primary teacher training routes – including tuition fee and employment based. Our programme nurtures the teachers of tomorrow and the leaders of the future. We’re a forward-thinking family of 17 primary and secondary schools with over 5000 children and young people and over 720 staff. Our mission's to provide the highest possible quality of education, so that all pupils, regardless of their background, are able to succeed and flourish. We're committed to the development of all our staff; with opportunities for everyone connected to the Trust to grow and develop and therefore fulfil their ambitions. Learn more by visiting https://www.dartmoormat.org.uk/ There are many reasons to train with us:\n* We offer high quality placements and excellent taught provision; equipping you with the skills, knowledge and practical experience to make a positive start to your career.\n* Diverse range of placements. Within our Trust there are 14 primary schools. We also work in partnership with other schools in the area. * Every effort is made to match trainees to placement schools that will develop their skills as a teacher.\n* Guaranteed interview for Early Career Teacher positions within our Trust. * Values-centred training: We are passionately committed to the values of co-operative schools that put people at the centre of everything we do.","trainWithDisability":"The University of Exeter provides comprehensive student services that include AccessAbility and Wellbeing teams, Student Learning Skills Service, Student Advice Unit, Counselling Service, Students’ Union Advisors, Student Health Centre, Family Centre and the Chaplaincy. For further details on the wealth of support available to you please go to Student Support Services web page [HERE](http://www.exeter.ac.uk/newstudents/supportandservices/yourhealthandwelfare/#a4)\n\nPGCE trainees are assessed by an Occupational Health provider as part of the admissions process to ensure they are fit to teach in a school setting. If the Occupational Health provider recommends any adjustments, the University’s Partnership Office will ensure you are placed in schools where these adjustments can be made, providing they are logistically possible and reasonable.\n\nWe always seek to support teachers for whom special educational needs could be a barrier to teaching. We will openly discuss the accessibility of our courses and indeed various partner schools in terms of training.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:50:32.919Z","updatedAt":"2021-10-05T20:39:56.533Z"}
