{"id":"529ba7a4-f3e8-42cc-b235-e420ac1deb59","name":"South East Learning Alliance","code":"1J1","type":"lead_school","isAccreditedBody":false,"urn":"138178","ukprn":"10037408","address":{"addressLine1":"South East Learning Alliance","addressLine2":"Riddlesdown Collegiate","town":"South Croydon","county":"Surrey","postcode":"CR8 1EX"},"contact":{"website":"https://tct-academies.org/train-to-teach/","email":"schoolsdirect@riddlesdown.org","telephone":"2086685136","fullName":"Philippa Bigden"},"location":{"latitude":51.3312364,"longitude":-0.1108331},"trainWithUs":"Thank you for taking an interest in the South East Learning Alliance School Direct training programme we have been running our teacher development programme since September 2014 and therefore have a wealth of experience and expertise to fully nurture and support trainees. Our School Direct Alliance is coordinated through Riddlesdown Collegiate in South London, which is an Outstanding school. We are an innovative partnership, which is continually developing its approaches to training and pedagogy. We invest greatly in the professional development of all our staff and those who choose to train alongside us. The South East Learning Alliance is a relatively small Alliance, but we pride ourselves on ensuring personal and bespoke training opportunities for all our trainees, which is reflected in the excellent success and retention rates we have achieved over the last seven years. Our size has added to our ability to provide a full and comprehensive range of support and ensures a variety of opportunities to work across a wide plethora of demographics and institutions. Ensuring our trainees receive the right support; in the most appropriate setting possible, is at the forefront of our ethos.","trainWithDisability":"We will make every effort to support any disabilities or additional needs candidates may have. However, as we work with over 10 different partner-schools and Universities; we strongly advise you to check directly with the individual school/Higher Education Institute to discuss your needs in greater depth.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"36425fae-da68-4e79-89de-8b41ea733c37","code":"K60","name":"King’s College London (University of London)","description":"Located in the heart of London, PGCE courses at King’s are rated Outstanding by Ofsted with excellent tutors on hand to support you through your training. In the last research assessment exercise, the department was rated second in the UK (REF, 2014). You will have the opportunity to work with experienced tutors who are actively engaged in research in their subject and in pedagogy more widely. 96% of 2017 graduates who sought teaching posts were employed within 6 months of qualifying. In our 2019 student survey, 92% of trainees rated the quality of their training as very good or good."},{"id":"33037eab-f75d-4350-b1e2-967c41e9d4c6","code":"R48","name":"Roehampton University","description":"Roehampton has been at the forefront of education for over 100 years and has a long established reputation as one of the principal providers of teacher education in the UK.\\r\\nMembers of the academic staff are at the cutting edge of research in education. The strengths of the partnership; as identified in the 2013 Ofsted inspection include:\\r\\n* the partnership’s strong reputation that helps to maintain high employment rates\\r\\n* outstanding training in subject teaching enabling trainees to apply the best practice in subject-specific pedagogy\\r\\n* the quality of training contributes to trainees’ strong professional skills."},{"id":"252d7e03-741e-4453-b6a8-3d361e6c9d1b","code":"E69","name":"e-Qualitas","description":"e-Qualitas offers a route into teacher training, through the South East Learning Alliance, where your study is completed through the distance-learning resources on the eQ virtual learning environment (VLE). Training sessions are provided by experienced school staff, and you are invited to attend training days led by eQ at a central London location. You will also benefit from a subject-specialist visiting Tutor from e-Qualitas, who will support you through your training. You will follow a course that leads to QTS. The course content is organised into six modules, the first three of which may be worked on concurrently."}],"createdAt":"2021-07-06T17:49:27.488Z","updatedAt":"2021-10-01T11:18:19.620Z"}
