{"id":"52bf746a-16d6-4399-8a80-b582e71de904","name":"Five Towns ITT Partnership","code":"2FW","type":"lead_school","isAccreditedBody":false,"urn":"136633","ukprn":"10003861","address":{"addressLine1":"Castleford Academy","addressLine2":"Ferrybridge Road","town":"Castleford","county":"West Yorkshire","postcode":"WF10 4JQ"},"contact":{"website":"http://www.fivetownsittpartnership.com","email":"enquiries@fivetownsittpartnership.com","telephone":"1977605060","fullName":"Joanna O'Brien"},"location":{"latitude":53.7249553,"longitude":-1.341375},"trainWithUs":"We work closely with the teams at Leeds Beckett University and the University of Huddersfield to offer primary and secondary training places across the Wakefield area. Both of the universities have successfully produced highly skilled teachers for many years. Together with their academic team and our partnership schools, we have successfully developed the Five Towns ITT Partnership. We offer placements with a large number of primary and secondary schools to ensure you gain practical school experiences and academic knowledge throughout the course to equip you with the most relevant and up to date skills for a career in teaching. We are a small alliance so we know each of our trainees' individual needs and can ensure placements accommodate any family commitments and additional needs. We offer primary 5 - 11 in partnership with Leeds Beckett University a wide range of secondary courses 11-16 (with Leeds Beckett) and 11-18 ( with Huddersfield).","trainWithDisability":"We ensure candidates with disabilities and other needs are aware of the support they can access through the universities so that they have the right support in place. We also look to place candidates in schools which are best suited to their specific needs.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"154509e2-743e-4f0b-9d99-396393aa57ff","code":"L27","name":"Leeds Beckett University","description":""},{"id":"791f82c8-19fd-4339-9c7b-301dee8067ce","code":"H60","name":"University of Huddersfield","description":""}],"createdAt":"2021-07-06T17:51:11.219Z","updatedAt":"2021-09-27T22:02:37.027Z"}
