{"id":"52ced3fc-9631-4e06-9e0e-78a1f27a12ee","name":"Telford Partnership","code":"2GO","type":"lead_school","isAccreditedBody":false,"urn":"142705","ukprn":"10007166","address":{"addressLine1":"Grange Park Primary School","addressLine2":"Grange Avenue","town":"Telford","county":"Shropshire","postcode":"TF3 1ET"},"contact":{"website":"http://www.grangeparkprimaryschool.co.uk/web","email":"nicky.brown@taw.org.uk","telephone":"1952387490","fullName":"Nicky Brown"},"location":{"latitude":52.6557481,"longitude":-2.435475},"trainWithUs":"The Telford Partnership offers an outstanding academic and ‘hands on’ school based experience in a variety of settings working in teams that are friendly and supportive. We are a partnership of 5 Primary and 3 Secondary schools all in Telford and we work very closely together As part of School Direct we give an innovative opportunity to access high quality school based initial teacher training with an outstanding ITT partner— University of Wolverhampton\nWe warmly welcome you to our bespoke School Direct PGCE programme for 2018/19. We are looking forward to working together to develop you into a passionate teacher. The Telford Partnership offers trainee teachers the opportunity to work and learn in range of schools\n“We are looking to recruit people who we believe can make a real difference to children’s learning. We are looking for candidates that will fit naturally into our schools—that share the same ethos and values”","trainWithDisability":"As a Partnership we are committed to inclusion for all and have experienced staff who ensure all needs can be supported. All schools in the Partnership have policies and procedures in place to support trainees with all disabilities or needs and all environments are accessible for all. We do regular and specific risk assessments when needed and seek advice if needed as well. We have worked previously with a student on work experience who had cerebral Palsy she used the lift in school, we provided her with space in the classrooms where she was comfortable to work and ensured where support was needed it was available. Her placement was very successful.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:47:44.816Z","updatedAt":"2021-09-22T16:15:13.053Z"}
