{"id":"5320faa7-881b-457d-80ad-211957724ffe","name":"Scarborough Teaching Alliance","code":"1YS","type":"lead_school","isAccreditedBody":false,"urn":"121267","ukprn":"10007149","address":{"addressLine1":"Fieldstead Crescent","town":"Scarborough","county":"North Yorkshire","postcode":"YO12 6TH"},"contact":{"website":"http://www.scarboroughteachingalliance.co.uk","email":"e.birley@sc.coastandvale.academy","telephone":"+441723362301","fullName":"Emma-Jane Birley"},"location":{"latitude":54.293515,"longitude":-0.434594},"trainWithUs":"The Scarborough Teaching Alliance is a cross phase alliance based on the North Yorkshire Coast and surrounding areas. The alliance is led by Childhaven Community Nursery School (Early Years & Primary) & Scalby School (Secondary)\nWe have a proven track record of training the next generation of teachers into the profession. Employability success rate is 100%.\nYou will be mentored and supported by outstanding practitioners while in your placement schools. As trainees with the Scarborough Teaching Alliance we invest in your future and our aim is help you grow and develop as professionals in our schools throughout your career.\nWe offer places on both Primary (3-7 & 5-11) and Secondary school direct.\nWe want students who can demonstrate the characteristics of effective learning themselves: to show real interest and enthusiasm for children's learning, to be resilient and be prepared to work hard, to show creativity and be able to critically reflect on their own learning. We have high standards for the children in our schools and the adults who work with us.","trainWithDisability":"We are an inclusive organisation and see no barriers to anyone wanting to pursue a career in teaching.\nPlease speak to us to let us know what your specific needs are and we will be able to accommodate without any hesitation.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:47:05.006Z","updatedAt":"2021-10-05T20:12:40.183Z"}
