{"id":"53552100-2ca2-47b5-93b8-b5db8b0f5537","name":"Vita London","code":"21C","type":"lead_school","isAccreditedBody":false,"urn":"144238","ukprn":"10063486","address":{"addressLine1":"Brooke Road","town":"Walthamstow","county":"London","postcode":"E17 9HJ"},"contact":{"website":"http://vitaeducation.co.uk","email":"emma.cherry@st-marys-coe.waltham.sch.uk","telephone":"2085211066","fullName":"Leann Valiquette"},"location":{"latitude":51.5696619,"longitude":0.012593},"trainWithUs":"Vita is a group of schools, led by the Federated Schools of St Mary’s and St Saviour’s, who are working in partnership with Goldsmith's University offering School Direct, a school-led route into teaching.\n\nThis new path into teaching is a way to gain the qualifications and practical skills you need to become a teacher. It allows those who have just finished a degree, or have been working in a career for many years to combine teacher training at Goldsmith's with 'learning on the job'. Successful completion leads to a PGCE with Qualified Teacher Status (QTS).\n\nVita is Latin for ‘life’ and all the schools in our Schools Direct group are committed to lifelong learning, for our pupils, staff and any trainees who work with us. We look forward to supporting our School Direct trainees in their journey to becoming outstanding teachers. \n\nVita London is proud to provide individualised support and training. Our vision is for each School Direct candidate to feel part of the team from day one. It can be scary to start something new and we understand that providing personal support is the best way to mentor. Unlike some larger SD chains, we feel that high quality training starts with getting the attention and direction in a more intimate setting. This allows our candidates to feel part of their training and the school community from the start. We aspire to have our candidates join our schools or link schools after their successful training.","trainWithDisability":"Our buildings are accessible for those with mobility issues. We have robust equality policies in line with The Equality Act 2010. We welcome applications from all candidates meeting entry requirements.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:56:28.685Z","updatedAt":"2021-11-10T18:37:45.283Z"}
