{"id":"53854e01-6343-44cd-97b5-44ab930641e4","name":"QE School, Wimborne","code":"1AN","type":"lead_school","isAccreditedBody":false,"urn":"141526","ukprn":"10060603","address":{"addressLine1":"Blandford Road","town":"Wimborne Minster","county":"Dorset","postcode":"BH21 4DT"},"contact":{"website":"http://www.qe.dorset.sch.uk","email":"bjose@queenelizabeths.com","telephone":"01202 885233","fullName":"Rhianna Elsden"},"location":{"latitude":50.8062357,"longitude":-2.0044331},"trainWithUs":"Queen Elizabeth’s School is a heavily oversubscribed 13-18 mixed comprehensive school with an excellent local reputation for high quality teaching and learning and an innovative and forward looking approach to education.\nThis reputation was reinforced by OFSTED in September 2017 and it continues to grow as we succeed in raising achievement still further; results have risen consistently over time and we expect to see further improvement over the next few years.\nThere is a strong commitment to comprehensive education and a focus on creating an environment that supports continual school improvement and the attainment of all students.\nThe complete rebuilding of the school into one of the best educational facilities in the entire country was completed in 2011 and we genuinely believe it is highly unlikely you will find better anywhere.\nWe are committed to developing people within the teaching profession, including those just starting their training. We have run School Direct with Exeter since the programme began and we believe that they are an outstanding provider; together we will give you the best start in your teaching career.","trainWithDisability":"For our students who have disabilities and other special needs we believe we offer outstanding support. We do the same for our trainees. Our facilities mean that the building is fully accessible on all levels, with lifts and ramps, and the site is open with wide corridors and pathways to support anyone with physical needs. We have many students in wheelchairs, we also have visually and hearing impaired students - each with us due to the fact that we have both the facilities and the staff/understanding to support their needs.\nOn our School Direct course we have supported trainees with both disabilities and training needs, including many trainees who are dyslexic. They have all excelled with us and have commented positively on the support that was afforded to them. The University of Exeter provides comprehensive student services that include AccessAbility and Wellbeing teams, Student Learning Skills Service, Student Advice Unit, Counselling Service, Students’ Union Advisors, Student Health Centre, Family Centre and the Chaplaincy. For further details on the wealth of support available to you please go to [Student Support Services](http://www.exeter.ac.uk/newstudents/supportandservices/yourhealthandwelfare/#a4)","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:56:37.109Z","updatedAt":"2021-09-26T00:07:16.604Z"}
