{"id":"53c3b0c5-2331-4a5f-9369-e0d77207f763","name":"TTTC (Thurrock Teacher Training Company)","code":"1CN","type":"lead_school","isAccreditedBody":false,"urn":"115356","ukprn":"10016633","address":{"addressLine1":"Butts Lane","addressLine2":"Stanford Le Hope","town":"Thurrock","county":"Essex","postcode":"SS17 0NW"},"contact":{"website":"https://www.st-cleres.thurrock.sch.uk/198/teacher-training","email":"thurrockteachertraining@osborne.coop","telephone":"1375641001","fullName":"Sarah Fernon"},"location":{"latitude":51.5107167,"longitude":0.4178917},"trainWithUs":"St Clere’s has been a very successful Initial Teacher Training (ITT) provider since 2004 and has an excellent success record that has enabled many candidates to successfully complete the ITT programme with the majority of trainees being good or outstanding. A large number of these trainees have been employed by their school and have gone on to start our Newly Qualified Teacher (NQT)programme.\nSchool Direct offers both a fee-funded and a salaried path. The salaried path is an employment-based route for high quality graduates who will be employed as an unqualified teacher for the duration of their training and receive a salary. The salary is expected to reflect subject priorities with Physics, Maths, Chemistry, MFL and Computing attracting the higher salaries. Other subjects which would attract a bursary are listed on the School Direct website below.\nAs well as a degree all ITT applicants must have English and Mathematics at GCSE Grade C or above (as well a grade C or above for Science for Primary Education trainees). Getting classroom experience will help you decide whether teaching is right for you. We encourage applicants to visit our partnership schools to gain classroom experience. The experience will support your application but we must state that school experience is not essential and that we do welcome applications from all interested candidates.","trainWithDisability":"TES Institute and St Clere's are committed to promoting access for people with disabilities and additional needs. We support and enable students with physical disabilities, sensory impairments, specific learning difficulties, special psychological needs and medical conditions that can have an impact on day-to-day activities, to participate in TES Institute programmes, as far as is reasonably practicable and within any constraints laid down by relevant professional bodies.\nTES Institute will:\n• Encourage applications from people with disabilities\n• Seek to provide information in suitable formats\n• Assess applicants who disclose disabilities or specific needs solely on the basis of their academic potential and suitability to train to teach\n• Invite applicants with a disability or specific need to contact TES Institute to discuss how their requirements can be accommodated\n• Provide additional support or resources at application to enable the applicant to complete the application process including attending interview where applicable\n• Offer additional provision to ensure no disadvantage compared with other applicants\n• Work towards the earliest possible assessment of needs and offer of reasonable accommodations where required\n• Make reasonable accommodations in assessment where applicable and without impacting the learning outcomes to be assessed\n• Provide educational support services as appropriate for eligible students\n• Take steps to encourage students with progressive conditions, or who become disabled during their programme of study, to continue their studies\n• Promote an inclusive environment and attitude at TES Institute and endeavour to provide appropriate training to staff where required","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:53:05.745Z","updatedAt":"2021-09-29T17:39:33.946Z"}
