{"id":"54859abb-2285-491c-a563-017dedbe4679","name":"CTSA","code":"1N4","type":"lead_school","isAccreditedBody":false,"urn":"137422","ukprn":"10059221","address":{"addressLine1":"Bridge Road","town":"Aldershot","county":"Hampshire","postcode":"GU11 3DD"},"contact":{"website":"https://www.thectsa.org/","email":"ctsa@st-josephs.hants.sch.uk","telephone":"01252 350583","fullName":"CTSA Coordinator"},"location":{"latitude":51.2404519,"longitude":-0.7649635},"trainWithUs":"At the CTSA we believe the best way to train to be a teacher is in the classroom supported, by a team of experts, trainers and mentors who will support you throughout your day to day experience.\nWe work with several Catholic and Non Catholic partner schools across the south east, in which students are able to train. Each area is supported by a main training hub as well as the overall support from the main teaching school (St Joseph’s Catholic Primary), to ensure students have access to a wealth of experience and tutelage from all over the south east of England.\nOur hubs are based in Aldershot, Basingstoke,Bournemouth, Reading, Wokingham, Isle of Wight, Portsmouth and Southampton\nThe CTSA has a number of training programs available for potential teachers at both Primary and Secondary levels suitable for both Catholic and non-Catholic applicants. Students will be based in one of our partner schools most conveniently placed. Our Alliance schools can be found throughout Hampshire, Surrey, Berkshire and Dorset.\nWe offer the following courses:\n* School Direct Primary Tuition Fee\n* School Direct Primary Salaried\n* School Direct Secondary Maths Tuition Fee\n* School Direct Secondary Physics Tuition Fee\n* School Direct Secondary RE Tuition Fee\n[www.thectsa.org](https://www.thectsa.org/)","trainWithDisability":"We welcome all candidates who wish to train to with us and as a Catholic organisation we believe in providing a safe and nurturing environment for all our students.\nWe operate in several locations throughout the south east and will endeavor to meet your needs when placing you in schools to train, as well as accommodating your professional goals.\nYou will be placed with a trained mentor who will work with and support you on a daily basis. As a small teaching school we can tailor your training experience to meet your specific personal needs, and we believe in treating each of our students as individuals.\nWe are committed to supporting our students and helping them to be successful in their chosen career.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"c6cc9d00-9dc5-4e23-959d-d2be40dd4aed","code":"P85","name":"Primary Catholic Partnership SCITT (PCP SCITT)","description":"PCP SCITT delivers highly successful primary teacher training courses. They have been training teachers for 20 years and have been graded Outstanding by Ofsted in 2011 and 2018. As a school-centred training provider, their programmes offer lots of hands-on learning, providing ‘an exceptionally effective balance of academic and practical experiences’ that lead to the award of Qualified Teacher Status..\\r\\nWe have been working closely with the PCP since 2013.\\r\\n[The Primary Catholic Partnership] (http://www.pcp-scitt.org.uk/)"},{"id":"252d7e03-741e-4453-b6a8-3d361e6c9d1b","code":"E69","name":"e-Qualitas","description":"e-Qualitas have successfully trained thousands of teachers over the last two decades, enabling them to acquire qualified teacher status (QTS). Working with a network of schools to provide school-led training including Schools Direct and Teaching Apprenticeships, e-Qualitas is recognised as one of the country’s leading teacher training providers.\\r\\nWe have been working closely with the e-qualitas since 2013.\\r\\n [e-qualitas](https://www.e-qualitas.co.uk/)"}],"createdAt":"2021-07-06T17:55:38.460Z","updatedAt":"2021-10-11T15:29:33.555Z"}
