{"id":"54bc2ad7-9574-47b7-8fde-0737ec19d941","name":"The Mead Academy Trust","code":"1LE","type":"lead_school","isAccreditedBody":false,"urn":"138133","ukprn":"10007145","address":{"addressLine1":"The Mead Academy Trust","addressLine2":"Hackett Place","town":"Hilperton","county":"Wiltshire","postcode":"BA14 7GN"},"contact":{"website":"www.themeadtrust.org","email":"hello@themeadtrust.org","telephone":"01225 759273","fullName":"Head of Teaching School (Lindsay Palmer)"},"location":{"latitude":51.3251032,"longitude":-2.1806849},"trainWithUs":"The Mead Academy Trust is an inspirational and innovative learning and teaching environment with an extremely successful track record in Initial Teacher Training. \n\nOur Trust is a family of three schools, The Mead and Castle Mead Schools, Trowbridge and River Mead School in Melksham. All three have their own nurseries. Castle Mead and River Mead also have Resource Bases for children with complex needs.\n\nThe Mead is a Good school based across two sites. The latest Ofsted inspections in 2019 highlighted: 'Staff enrich pupils’ learning well. Pupils become articulate, well-mannered and spirited...They gain a strong appreciation of the arts, including music. Pupils enjoy wide-ranging\nsporting activities and clubs.'\n\nCastle Mead is also a 'Good' school. It opened in 2014 and is a two-form entry school. In 2017, Ofsted said that 'The school's curriculum is exciting, interesting and relevant. Trips, visitors and projects 'bring learning to life'. They engage and inspire pupils to learn well.'\n\nRiver Mead is a smaller than average primary and nursery school. In 2019 it was graded as 'Good' in its Ofsted inspection. The school was described as 'a nurturing haven of aspiration. Pupils... demonstrate pride in their learning and show an appetite to learn'. Additionally, 'Leaders implement a high-quality curriculum which promotes pupils’ achievement across a range of subjects very well'.","trainWithDisability":"Applicants who would benefit from any environmental adjustments should let us know on application so we can ensure any necessary arrangements are made for interview and any subsequent placements.\nPlease contact us at hello@themeadtrust.org to discuss any specific access issues further.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:48:58.379Z","updatedAt":"2021-07-07T21:09:04.595Z"}
