{"id":"54e32479-0d46-4127-8de7-ed286416e683","name":"Haberdashers’ Academies Trust South","code":"1KP","type":"lead_school","isAccreditedBody":false,"urn":"135073","ukprn":"10058159","address":{"addressLine1":"Haberdashers’ Academies Trust South","addressLine2":"Jerningham Road","town":"New Cross","county":"London","postcode":"SE14 5NY"},"contact":{"website":"https://www.habsfed.org.uk/Habs-Institute-for-Professional-Learning/","email":"habsinstitute@haaf.org.uk","telephone":"020 7652 9571","fullName":"Kafilat Agboola"},"location":{"latitude":51.474082,"longitude":-0.041315},"trainWithUs":"The [Haberdashers’ Academies Trust South](https://www.habsfed.org.uk/) is a family of five primary schools and four secondary schools, all of which are located in the heart of their communities across the London boroughs of Southwark, Lewisham and Bexley.\n\nWe have been educating young people in South London since 1876 and have over 15 years’ experience of initial teacher training. Embedded in a rich culture of both tradition and innovation, we draw on our long history of educational excellence while embracing new, forward-thinking ideas. \n\nOur vision for education is built on aspiration and achievement, which is why we provide our staff with the highest levels of support. We have a unique and engaging professional development offer that provides opportunities for collaboration and access to networks for every teacher, no matter their career stage. Each member of our community, staff and students alike, also benefit from the Haberdashers’ Advantage – a unique set of benefits and opportunities that come from our sponsorship by the Haberdashers Company.\n\nHaberdashers’ Academies Trust South is an inclusive employer that strongly values diversity. We welcome applications from members of black and minority ethnic communities, as we are keen to ensure that the teaching workforce is more representative of London's diverse population.","trainWithDisability":"We want to make sure that our training programme is open to everybody. If you have a disability, we will make adjustments wherever reasonably possible in order to enable you to perform to the best of your ability throughout our recruitment process.\n\nIf you would like us to do so at the interview stage, please provide details on your application form. This will in no way affect your application.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:53:31.106Z","updatedAt":"2021-10-08T22:16:18.860Z"}
