{"id":"554ca5b2-7f5a-4a4a-b9a4-956bc1e880de","name":"Leicestershire Secondary SCITT","code":"L33","type":"scitt","isAccreditedBody":true,"ukprn":"10055113","address":{"addressLine1":"Rushey Mead Teaching School","addressLine2":"Melton Road","town":"Leicester","county":"Leicestershire","postcode":"LE4 7AN"},"contact":{"website":"https://www.leicestershiresecondaryscitt.org","email":"AdminSCITT@rushey-tmet.uk","telephone":"0116 268 9734","fullName":"Dave Roper"},"location":{"latitude":52.661843,"longitude":-1.111195},"trainWithUs":"Teachers Training Teachers and Changing Children's Lives...\n[Leicestershire Secondary SCITT](https://www.leicestershiresecondaryscitt.org) is a school-based teacher training provider. You train in the best place to learn, in schools. In addition, you work with the University of Leicester, to gain a PGCE, so you are getting the best of both worlds; the academic rigour of a university and hands-on school-based training.\nIt’s a great time to train as a teacher, with significant job prospects and career progression opportunities. Trainees receive bursaries of up to £28,000, so you focus on becoming a great teacher and really changing lives!!!\nA great opportunity to change lives!!\nTrain as a teacher with the [Leicestershire Secondary SCITT](https://www.leicestershiresecondaryscitt.org) and you will be given up to 32 weeks experience in schools, the best place to learn to be a teacher. In addition to this, you will also be a full member of the University of Leicester, who will award your PGCE.\nDuring your ITT year, you will work with amazing teachers who will model best practice and support you on your journey to becoming a teacher. Your Lead Subject Tutor will work with you to develop your subject and pedagogical knowledge whilst the University of Leicester Tutors will help you explore the academic research that underpins great teaching. All components of the course will provide you with the skills, knowledge and experience to become the best teacher you can be and really start to change lives.\nAre you ready to make a difference and change lives? You could [TEACH](https://www.bookwhen.com/leicesterscitt)...","trainWithDisability":"We want inspiring teachers in the classroom working with impressionable young minds and disabilities or additional needs should not prevent this. If you have something to offer in the classroom, then we want to hear from you.\nIn terms of support, we offer a range of options and each is specifically tailored to meet the needs of the individual:\n*Accessibility within the training schools is assessed and addressed. Within the SCITT, there is access to a lift, low-level thresholds, ramps and other features to increase accessibility\n*Adjustments can be made on placements - this may be in terms of the workload, support offered, access to support systems and services\n*We identify the needs of all trainees, very early and offer ongoing support\n*All trainees complete an Occupational Health Assessment, which identifies strategies that would support them in role\n*We have Lead Mentors, whose role is to work across all schools to offer bespoke support to trainees or their mentors. This allows trainees to fully engage with the course and that any challenges are addressed early and fully.\n*Wellbeing sessions are interspersed throughout the training year, keeping this a priority.\n*All trainees complete sessions on 'Managing Workload', so as to prepare them for a long and healthy career in teaching *Each of our courses are tailor-made to meet the needs of our trainees. This allows us the flexibilty to make adjustments to ensure accessibility for all.\n[Leicestershire Secondary SCITT](https://www.leicestershiresecondaryscitt.org) Teachers training teachers and changing children's lives...","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"yes","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:54:07.278Z","updatedAt":"2021-09-13T15:02:32.447Z"}
