{"id":"567b32af-2b43-499d-a9ae-b407f35d5780","name":"West London Teacher Training Alliance (Primary)","code":"1EL","type":"lead_school","isAccreditedBody":false,"urn":"137935","ukprn":"10036715","address":{"addressLine1":"WLTTA Office c/o Sacred Heart High School","addressLine2":"212 Hammersmith Road","town":"Hammersmith","county":"London","postcode":"W6 7DG"},"contact":{"website":"http://www.wltta.org.uk/initial-teacher-training/primary-courses/","email":"pcurrey@sacredh.lbhf.sch.uk","telephone":"020 8748 7600 x466","fullName":"WLTSA Administrator"},"location":{"latitude":51.493165,"longitude":-0.2228436},"trainWithUs":"THE WEST LONDON TEACHER TRAINING ALLIANCE (WLTTA) The West London Teacher Training Alliance represents a large group of 70 schools (nurseries, primaries, special needs, secondaries, sixth forms; faith and non-faith, maintained schools, independent schools and free schools) – who are all seeking to mentor and build a relationship with a trainee who aspires to work in their school. Most of our schools are in Hammersmith & Fulham and Kensington & Chelsea, but we also have schools in Westminster, Richmond, Twickenham, Ealing, Hounslow, Hillingdon and Brent. The WLTTA office is based at Sacred Heart High School, in Hammersmith.\nWe have formal partnership arrangements with four universities\n* St Mary's University, Twickenham\n* University of Roehampton\n* University College London (UCL)\n* London Metropolitan University\nOUR APPROACH TO TRAINEE RECRUITMENT\nWe pride ourselves in the support that we provide potential applicants and in the speed of our shortlisting. We have a detailed website (do please look) [wltta.org.uk](www.wltta.org.uk) and the WLTTA office is staffed full time with experts to talk to on the phone. You choose the schools when you apply. If you perform well at interview but fail to get a place at your preferred school, we operate an internal referral system rather than rejecting you (see the interview section below).\nWe place significant emphasis on getting a good fit between trainee and school because we are all keenly focused on recruitment for qualified teachers in our alliance schools the following year.","trainWithDisability":"WLTTA and all our partner universities are committed to supporting students with disabilities. Please contact us as early as possible in your application process so that your needs are met and support can be arranged.\nYou can also find support and information from the university accrediting the course that you hope to apply for:\nST MARY'S UNIVERSITY offers advice and support to their students who have requirements as a result of a disability, specific learning difficulty (e.g. dyslexia), medical condition or temporary disability, such as injury. St Mary’s Dyslexia and Disability Co-ordinator (DDC) works closely with the other members of the Student Services team, supporting students in their time at university assisting them to be proactive in their studies as an independent learner. [http://www.smuc.ac.uk/student-support/dyslexia-and-disability/](http://www.smuc.ac.uk/student-support/dyslexia-and-disability/)\nUNIVERSITY OF ROEHAMPTON: [http://www.roehampton.ac.uk/Disabilities/Support/](http://www.roehampton.ac.uk/Disabilities/Support/)\nLondon Met","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"30bda414-7b00-426c-956b-18a187efe967","code":"L68","name":"London Metropolitan University","description":"This WLTTA programme is accredited by London Metropolitan University. The university takes pride in helping its students reach their goals and succeed in their careers. \\r\\n\\r\\nLondon Met trainee teachers have been praised by Ofsted for their “professional attributes… and their ability to manage pupils’ behaviour” as well as achieving employment and completion rates well above the national average.\\r\\n\\r\\n‘We're proud of our vibrant, multi-ethnic and socially diverse community, and encourage you to join us – we currently have more than 140 nationalities studying with us’.\\r\\n\\r\\nThe university is committed to environmental sustainability\\r\\n\\r\\n[Campus tour](https://www.youtube.com/watch?v=54Mz2kLnBdk)"},{"id":"33037eab-f75d-4350-b1e2-967c41e9d4c6","code":"R48","name":"Roehampton University","description":"This WLTTA course is accredited by University of Roehampton, who have been at the forefront of teacher education for over 100 years. Many members of staff are at the cutting edge of research in teacher education, which has a positive impact on the quality of our provision; tutors have extensive teaching experience in schools with many having served as consultants or as Ofsted inspectors.\\r\\n\\r\\nThe university experience is enhanced by its beautiful campus - unique in being both close to central London and set in parkland with grand, historic buildings and lakes side by side with newly built modern facilities."},{"id":"ef172d85-20e4-4aa2-96d0-9e3ae81f526d","code":"S64","name":"St Mary’s University, Twickenham","description":"This WLTTA course is accredited by St Mary’s University, Twickenham, with 170 years in Education.\\r\\n\\r\\nWith just under 4,000 students training to teach on primary and secondary, they are now London’s second largest teacher training course provider and in 2019 the St Mary’s Institute of Education was once again rated Ofsted ‘Outstanding’.\\r\\n\\r\\nCourse tutors at St Mary’s are all skilful teachers themselves, with many years of experience in schools and higher education. Schools in the Alliance have excellent relationships with the university."}],"createdAt":"2021-07-06T17:55:20.553Z","updatedAt":"2021-09-09T22:06:19.728Z"}
