{"id":"568b3051-6b96-4d1b-98dd-ba2b3e30715a","name":"Arthur Terry School","code":"1QN","type":"lead_school","isAccreditedBody":false,"urn":"138136","ukprn":"10034759","address":{"addressLine1":"Kittoe Road","addressLine2":"Four Oaks","town":"Sutton Coldfield","county":"West Midlands","postcode":"B74 4RZ"},"contact":{"website":"http://www.arthurterry.bham.sch.uk/atnts","email":"jmurphy@arthurterry.bham.sch.uk","telephone":"0121 323 2221","fullName":"Cathryn Mortimer"},"location":{"latitude":52.589201,"longitude":-1.8356073},"trainWithUs":"The Arthur Terry SCITT “An innovative and collaborative approach to developing outstanding educators”\nThe Arthur Terry School is one of the top performing comprehensive schools in the Birmingham area and the lead school in a successful Multi Academy Trust. All our partnership schools, excel in developing teachers at all stages of their career.\nAs a SCITT and Teaching School Hub for North Birmingham we are looking to train and recruit the very best teachers. Our partnership of schools covers Birmingham, Staffordshire and Warwickshire, offering diverse teaching experiences in both rural and urban settings.\nWe are now recruiting for highly motivated graduates, for both Primary and Secondary, either straight out of University or those looking for a career change, who are committed to inspiring and challenging young people. We are looking for people with excellent subject knowledge, but also the ability to deliver this in an exciting and engaging way. Our course provides Qualified Teacher Status (QTS) and a Post Graduate Certificate in Education (PGCE) in association with Birmingham City University (BCU).\nFurther information can be found on (https://www.arthurterry.bham.sch.uk/atnts/train-to-teach/)","trainWithDisability":"Recruitment and selection procedures are consistent with current Equality legislation. We are an equal opportunities provider and welcome applications from candidates with additional needs.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:56:40.730Z","updatedAt":"2021-10-05T17:46:29.595Z"}
