{"id":"56e5442b-b4aa-4b0b-b437-f88103606b10","name":"Teach North East","code":"1D7","type":"lead_school","isAccreditedBody":false,"urn":"144204","ukprn":"10063921","address":{"addressLine1":"Lisle Road","town":"South Shields","county":"Tyne & Wear","postcode":"NE34 6DL"},"contact":{"website":"https://harton-tc.co.uk/teaching-school-alliance/","email":"sdegiorgio@hartonacademy.co.uk","telephone":"0191 4274050","fullName":"Miss Stef De Giorgio"},"location":{"latitude":54.9758827,"longitude":-1.4082422},"trainWithUs":"At Teach North we are passionate about teaching and this passion will be shared and embedded in a supportive, practical and hands on way with all our trainees. You will receive training so you are confident when taking the next steps into the profession and can take what you have learnt into a fulfilling and successful career. We believe in holding onto tradition whilst embracing innovation and, above all, we pride ourselves in the quality of the training we offer. The best way to learn to teach is to do it, to make mistakes and to learn from them. Teach North East will allow you to become immersed in school life from the start, but offers you a safety net of the support needed to thrive as a new teacher.\nTeach North East is a partnership of 16 Secondary and Primary schools working in close collaboration with local providers to deliver high quality and innovative teacher training. The Lead School for the Partnership is Harton Academy, an OFSTED ‘Outstanding’ rated school (2013) and has been a successful Teaching School. Harton was one of the first 100 teaching schools in the country. A distinctive feature of the programme is the focus on carefully staged and appropriately supervised practical classroom experience within two contrasting schools, which is further supported by academic and professional study via central training.","trainWithDisability":"Teach North East welcomes applications for teacher training from all candidates. Harton Academy hosts a large number of pupils and students with a range of physical impairments and social, emotional and mental health conditions, and can use this expertise to help identify and provide any support agreed for trainees. Harton benefitted from significant building improvements under the government’s Building Schools for the Future programme and therefore has bespoke infrastructures to suit people of all abilities. Additionally, Human Resources support is available, as we consider our trainees a member of the staffing team, and would look to make reasonable adjustments as necessary. Both of our accredited providers have a Disability Support Team who will be able to provide advice, information and guidance to students with a disability; students with mental illness or mental health difficulties; students with Specific Learning Difficulty (SpLD) such as dyslexia. In relation to our partner schools where a school is unsuitable for a particular placement, we would seek to find an appropriate school which can accommodate successfully. Please contact John Gibson on jgibson@hartonacademy.co.uk with any specific disability access requirements.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"b384b008-59e2-461e-a15f-3551d1165c1e","code":"N77","name":"University of Northumbria at Newcastle","description":""},{"id":"926804ac-be7a-4f0a-97f9-a26a5f5f032a","code":"S84","name":"University of Sunderland","description":""}],"createdAt":"2021-07-06T17:50:38.143Z","updatedAt":"2021-09-10T21:01:52.625Z"}
