{"id":"573a7915-0299-4c86-a12f-d08384f25cac","name":"Queen Elizabeth’s Grammar School, Horncastle","code":"2KK","type":"lead_school","isAccreditedBody":false,"urn":"138665","ukprn":"10038619","address":{"addressLine1":"West Street","town":"Horncastle","county":"Lincolnshire","postcode":"LN9 5AD"},"contact":{"website":"https://www.qegs.lincs.sch.uk/","email":"jo.fieldsend@horncastleeducationtrust.org","telephone":"1507522465","fullName":"Jo Fieldsend"},"location":{"latitude":53.209944,"longitude":-0.121758},"trainWithUs":"We are an alliance of schools, and other partners, who are working together to train the next generation of outstanding teachers. The School Direct teacher training route is led by Queen Elizabeth’s Grammar School, working in partnership with local schools and Bishop Grosseteste University (BGU). The School Direct teacher training programme with Queen Elizabeth’s Grammar School is an excellent opportunity for graduates and career changers to join the teaching profession. School Direct is a route into teaching that places school-led training at the heart of the experience.\nThe Queen Elizabeth’s Grammar School programme is primary and secondary age focused with a 3-11 and 11-18 pathway. On our School Direct teacher training programme, you’ll be given in-depth experience in the classroom. You will be based in one of the schools in the partnership and you’ll also be taught by BGU, attending lectures and seminars to bolster your hands-on experience with theories. In addition, away from the classroom, you’ll receive practical training sessions from SLEs, experienced teachers and the teams across our alliance of schools.\nWe recommend that you train to teach with Queen Elizabeth’s Grammar School and partners as we provide opportunities for varied placements in great schools, we have a strong partnership with BGU, a university recognised for teaching excellence and we offer a wide range of experts to provide practical help and support.","trainWithDisability":"Queen Elizabeth's Grammar School and partners believe that teachers with disabilities and other needs, make an important contribution to schools both in the classroom and in shaping the wider culture and ethos of the schools they work in. The schools that we work with value diversity and the unique contribution that all their staff and trainees bring. Therefore, applicants with disabilities and other needs are encouraged to apply. The School Direct Route makes the most of in-school mentoring, offering close support for trainees. We recognise that trainees may require additional assistance to engage fully with their studies due to a range of access needs. If you are unsure whether you have access needs which are covered by disability legislation, please contact us – we will be happy to offer advice and guidance.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"1d95b6cb-0e08-4485-848a-0e304d71102a","code":"B38","name":"Bishop Grosseteste University","description":"The accredited provider for the Queen Elizabeth’s Grammar School School Direct programme is Bishop Grosseteste University (BGU). \\r\\n\\r\\nBGU has been educating students in the historic heart of Lincoln for over 150 years. The beautiful campus is located just a few minutes’ walk from Lincoln Cathedral, Castle and the old Roman city.\\r\\n\\r\\nBGU demonstrates a commitment to first-class teacher training and provides schools across the country with highly-skilled graduates who are equipped to teach the next generation of young learners.\\r\\n\\r\\nThe latest Graduate Outcomes survey shows that BGU is 3rd in the UK for graduate employability when compared to non-specialist universities."}],"createdAt":"2021-07-06T17:47:34.453Z","updatedAt":"2021-10-13T17:27:11.050Z"}
