{"id":"57beac36-52e5-4092-8eb7-920aedbceba1","name":"Kernow Initial Teacher Education","code":"21J","type":"lead_school","isAccreditedBody":false,"urn":"136312","ukprn":"10007792","address":{"addressLine1":"Early Career Development Centre","addressLine2":"The Old Cricket Pavilion, Treninnick Hill","town":"Newquay","county":"Cornwall","postcode":"TR7 2JU"},"contact":{"website":"www.kernowteaching.co.uk","email":"asweet@kernowlearning.co.uk","telephone":"01637 477381","fullName":"Kernow Teaching School Alliance"},"location":{"latitude":50.4074249,"longitude":-5.0707965},"trainWithUs":"KITE (formerly KTSA) brings together outstanding providers from all educational phases.\nWe can offer you the benefits of an experienced and supportive organisation, recently designated as one of 87 new national Teaching School Hubs, recognised for their excellence in providing ITT, Early Career support, Leadership Development and CPD. We are also a designated Associate Research School. We draw upon this expertise to deliver high quality training and support. We have:\n* Schools experienced in delivering ITT, who have a passion for supporting new entrants into the profession. * a friendly, supportive organisation.\nYou will be part of an organisation that supports schools, trains future leaders, and engages in research. This opens further opportunities to widen our ITT School Direct trainees’ experiences. Our ITT programmes are demanding but, there's still time to enjoy Cornwall.\nA unique 3 programme offer * School Direct PGCE (non-salaried) * 1 yr. programmes in Primary 3-7, Primary 5-11, Primary with SEND.\n* An option to teach in a special school or APA.\nOur pupils deserve the most talented and committed teachers, to help them to be the best they can be, this is where you come in.\nWe need you to:\n* Be passionate about teaching * Want to make difference * Be success focussed when presented with the most vulnerable, challenging and ultimately rewarding pupils * Be self-motivated, enthusiastic, resilient, compassionate and inspirational\nOn completing your PGCE, SD programme, you gain credits towards your master’s degree. (You can continue later with OneCornwall TSH.)","trainWithDisability":"The University of Exeter provides comprehensive student services that include AccessAbility and Wellbeing teams, Student Learning Skills Service, Student Advice Unit, Counselling Service, Students’ Union Advisors, Student Health Centre, Family Centre and the Chaplaincy. For further details on the wealth of support available to you please go to Student Support Services (http://www.exeter.ac.uk/newstudents/supportandservices/yourhealthandwelfare/).\nPGCE trainees can access the support of a Wellbeing Services Welfare Consultant to discuss concerns, talk through options for support or understand more about how the University Wellbeing Services may be able to help.\nAll trainees are assessed by an Occupational Health provider during the admissions process to ensure they are fit to teach in a school setting. Occupational Health can recommend ‘Reasonable Adjustments’, which will be put into place by the provider, providing they are logistically possible and reasonable.\nPlymouth Marjon\nWe are very aware of, and sympathetic to, disabilities and different individual needs that the trainees may have and we work with our ITT partner to ensure that opportunities are the same for all. Disability and needs disclosure: If you have an illness or a disability which you think may benefit from support from the partnership, we encourage you to disclose this to your mentor. Disclosure is a personal preference and not compulsory but for your needs to be met you will need to declare them as we do not have access to this information otherwise. For further information, it is suggested that you contact the University Disability & Inclusion Advice Service (DIAS) in Student Support.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"accreditedBodies":[{"id":"a4e84530-e1f1-47c6-b57e-ec693d629637","code":"P63","name":"Plymouth Marjon University","description":"Plymouth Marjon University celebrates 180 years of teacher training and is dedicated to preparing the next generation of teachers. At Plymouth Marjon learning and teaching is underpinned by research, policy and practice. We build on a unique, long standing heritage through the development of values-based collaborative partnerships. University led and school led programmes are designed to train trainees to become highly reflective teachers. At Plymouth Marjon learning and teaching is underpinned by research, policy and practice. We will build on a unique and long standing heritage through the development of a values-based collaborative partnership that ensures excellent outcomes for all."},{"id":"d41a1821-e35b-48eb-bf02-4842872b04a2","code":"E84","name":"University of Exeter","description":"At Exeter we have over 165 years of experience in Education. We offer a wide range of Teacher Training and postgraduate programmes, and are recognised as one of the top Education research schools in the country.\\r\\nWe are: \\r\\n - 6th in the UK for world-leading and internationally excellent research in \\r\\n Education and influencer of national education policy\\r\\n - Ranked 3rd amongst university providers of initial teacher training in the \\r\\n Good Teaching Training Guide 2017\\r\\n - Recognised by Ofsted as an outstanding provider of Primary and \\r\\n Secondary teacher education \\r\\n - Top 125 in the world for Education"}],"createdAt":"2021-07-06T17:54:20.372Z","updatedAt":"2021-10-13T14:51:47.924Z"}
