{"id":"582accca-32a7-4719-824f-309a08954da8","name":"Paradigm Teaching School","code":"2J3","type":"lead_school","isAccreditedBody":false,"address":{"addressLine1":"St Joseph’s Catholic Primary School","addressLine2":"Rosebank, West Street","town":"Epsom","county":"Surrey","postcode":"KT18 7RT"},"contact":{"website":"http://www.stjosephs-epsom.surrey.sch.uk","email":"paradigm@stjosephs-epsom.surrey.sch.uk","telephone":"1372727850","fullName":"Jo Cullen"},"location":{"latitude":51.3301771,"longitude":-0.2747804},"trainWithUs":"Paradigm teaching School, led by St Joseph's Catholic Primary School in Epsom, is proud to be part of nurturing the next generation of teachers into the profession. St Joseph's was judged to be 'Outstanding' in November 2017 and has an excellent track record of recruiting and retaining staff right from their earliest days as trainees. We believe that we offer the best of both worlds - personalised and supportive school experiences in our close network of schools alongside the academic rigour and expertise of an outstanding PGCE (QTS) programme delivered by experts in their fields at both St Mary's and Roehampton. The option of Masters level credits is also available to you if you choose.\nOur placements are hosted in our network of Catholic primary schools across Banstead, Leatherhead, Caterham, Ewell, Dorking, Redhill and Epsom. These placements are agreed right from the start of your year so you are as prepared for the logistics of your training year as possible as we appreciate trainees are often juggling family and other commitments. We have a strong relationship with all of these schools and work closely together in order to ensure that your training year is as manageable and comprehensive as possible. Superb mentors and wonderful children will make your PGCE year one to remember!","trainWithDisability":"Just as every child is unique, so are our trainees! If you believe you have a need which will require additional support, contact us to talk through your concerns.","accreditedBodies":[{"id":"33037eab-f75d-4350-b1e2-967c41e9d4c6","code":"R48","name":"Roehampton University","description":"Roehampton University is based on a beautiful parkland campus in South-West London, close to Putney and Hammersmith. It’s School is ranked third in London for the quality of our research in the field of Education, reflecting the world-class expertise of our staff.\\r\\n\\r\\nThe School of Education at Roehampton is one of the principal providers of teacher training in the UK with a rich 175-year history. As a student in the School, you will enjoy high quality teaching, equipping you for a successful career. 99% of 2017 teacher training graduates are in work or further study six months after leaving."},{"id":"ef172d85-20e4-4aa2-96d0-9e3ae81f526d","code":"S64","name":"St Mary’s University, Twickenham","description":"St Mary’s has been recognised as one of the highest quality providers of training for primary teachers in the country. The Primary PGCE programme provides an intense training experience that combines academic rigour with personal and professional learning experiences. The training is designed to meet the needs of each trainee to support and develop the skills, knowledge and attributes needed to start a teaching career.\\r\\n\\r\\nTeaching students at St Mary’s have one of the highest employment ratings in the UK with 98% of 2016 Primary PGCE graduates in employment."}],"createdAt":"2021-07-06T17:52:42.890Z","updatedAt":"2021-09-21T23:04:28.654Z"}