{"id":"585f0d71-f778-4cd8-9fca-47490bc2ef1e","name":"Shropshire Primary Partnership","code":"2AN","type":"lead_school","isAccreditedBody":false,"urn":"145790","ukprn":"10007848","address":{"addressLine1":"Shropshire Primary Partnership","addressLine2":"Shrubbery Gardens","town":"Wem","county":"Shropshire","postcode":"SY4 5BX"},"contact":{"website":"www.shropshireprimarypartnership.co.uk","email":"schooldirect@shropshireprimarypartnership.co.uk","telephone":"01743 343812","fullName":"Ian Nurser"},"location":{"latitude":52.8586526,"longitude":-2.7204693},"trainWithUs":"Shropshire Primary Partnership is a partnership of successful and highly regarded schools across Shrewsbury and North Shropshire. Our unique selling point is that we are able to provide high quality teacher training, locally delivered within Shropshire by supportive practitioners and university staff with placements in successful and highly regarded local schools. Our programme offers a way of training teachers which puts the schools into the heart of the process. In partnership with the University of Chester, we have developed this school led training programme which is committed to training teachers to ensure they have the potential to be outstanding at the end of the programme. Our associate teachers receive a flexible and bespoke timetable offering substantial mentoring to ensure lesson planning and delivery is of the highest standard. The high quality local delivery aspect ensures local trainees no longer need to travel long distances to an alternative Higher Education provider.","trainWithDisability":"St Peter's CE Primary School and Woodfield Infant School, the lead schools in the alliance, have disablity access to all parts of their sites and buildings. This is the case for some of our partner schools, but not all and applicants may want to bear this in mind when applying to us.\nThe disability and inclusion team at the University of Chester provides confidential information, advice and guidance to disabled students. This includes students with specific learning differences, long-standing health conditions, mental health difficulties, Autistic Spectrum Disorder and sensory impairment. Staff will support students in identifying the most appropriate solutions to potential barriers to learning","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:49:43.002Z","updatedAt":"2021-10-08T17:36:00.142Z"}
