{"id":"58d08f2a-6e45-4f0c-be28-91c5a99fb04b","name":"Merrylands Teacher Training Partnership","code":"2D6","type":"lead_school","isAccreditedBody":false,"urn":"143205","ukprn":"10057789","address":{"addressLine1":"Merrylands Primary School","addressLine2":"Cumberland Drive","town":"Basildon","county":"Essex","postcode":"SS15 6QS"},"contact":{"website":"http://www.merrylandsprimaryschool.co.uk","email":"lisaperry@berlesduna.co.uk","telephone":"1268464759","fullName":"Sean Tobin"},"location":{"latitude":51.5730113,"longitude":0.4134219},"trainWithUs":"Our School Direct (SD) course is designed by the Merrylands Teacher Training Partnership (MTTP) and Essex Teacher Training (ETT). We are looking to recruit high quality graduates onto our School Direct programme. School Direct is a popular choice for trainees and many secure a teaching post in the network of schools where they train, for their ECT induction years.\nThe MTTP School Direct course lasts one year, and trainees train at schools across Basildon. This course offers a brilliant option for trainees that want to train and learn ‘on the job’ – but prospective trainees shouldn’t worry about being thrown in at the deep end. They’ll be part of a team from the very start, receiving intensive support from experienced teachers and mentors. This ensures trainees won’t be teaching classes unsupported until the school thinks the trainee is ready.\nSchool Direct graduates have very high rates of employment and trainee\nsatisfaction.\nThe MTTP prides itself on the following values:\n* Growing and developing future teachers\n* Investing time and energy in supporting and challenging trainees\n* Creating a long term career pathway – from trainees to highly effective, reflective practitioners, and building potential for future school leaders and managers\n* Developing a depth of understanding of teaching and learning\n* Facilitating delivery of great learning experiences\n* Offering high quality training and excellent Continuous Professional Development across the teaching school alliance\n* Harnessing the quality existing within our schools in order to create aspirational and inspirational future teachers and leaders","trainWithDisability":"Here at MTTP we are committed to offering all prospective trainees the opportunity to gain QTS. If you have a specific need, we can discuss this with you at interview and agree a suitable level of support.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"00782614-9301-40e4-8832-9a74cc1bbb07","code":"E75","name":"Essex Teacher Training","description":"Essex Teacher Training is a large provider, offering a variety of different school-based routes to QTS in schools across Essex and its adjoining counties. \\r\\n\\r\\nHeadteachers value the contribution trainee teachers can make to their schools. As a result, trainees enjoy their training and the vast majority gain employment in one of our partner schools, once qualified. \\r\\nAll of our tutors are experts in their field and many are still teaching, so you benefit from their knowledge and experience. We pride ourselves on the support we offer our trainees and put trainee wellbeing at the heart of what we do."}],"createdAt":"2021-07-06T17:49:52.638Z","updatedAt":"2021-10-03T19:13:15.787Z"}
