{"id":"58f40855-9285-4391-8644-17c6fa124fb8","name":"Harrington Nursery School","code":"268","type":"lead_school","isAccreditedBody":false,"urn":"112474","ukprn":"10007163","address":{"addressLine1":"Harrington Nursery School","addressLine2":"Harrington Street","town":"Derby","county":"Derbyshire","postcode":"DE23 8PE"},"contact":{"website":"www.harrington.derby.sch.uk","email":"admin@harrington.derby.sch.uk","telephone":"01332 769821","fullName":"Laura Baddiley"},"location":{"latitude":52.90132,"longitude":-1.475832},"trainWithUs":"Our Teacher training programme is an exceptional partnership between Harrington Nursery School, St Giles School and The University of Warwick. It is a very proactive and progressive course with a real focus on teaching and learning. It really is the place to learn to teach and continue with exciting and varied career development opportunities. The University of Warwick work in a very unique way with us. We deliver training in your local area, Derby, and our University colleagues travel to us to train you.\nHarrington Nursery School is an 'outstanding' school with a vast array of experiences between the staff team, who can offer you, our graduates, the highest quality opportunities for the foundations of your teacher training.\nOur programme is an exciting and innovative programme for people who have some experience of working with children and want to become teachers. We specialise in Early Years and Key Stage one and will give you the opportunities to 'learn on the job' in a school. You, the trainee will work as part of the teaching team from day one, learning from experienced colleagues and immediately putting new skills into practice.\nThe School Direct course runs for an academic year and leads to qualified teacher status (QTS), a postgraduate certificate in education (PGCE) and masters level credits from the University of Warwick.","trainWithDisability":"We encourage existing students and applicants to declare any disability or learning difference and contact us in advance to discuss their support requirements to enable us to make reasonable adjustments for the duration of their studies. Our courses attract a diverse range of age groups and backgrounds, creating a welcoming, inclusive and supportive community, that everyone can feel a part of.\nPlease note that students with mental health difficulties or disabilities are signposted to and supported by the Mental Health and Wellbeing team and the Counselling Service at the University that are also part of Wellbeing Support Services.\nThe University of Warwick and Wellbeing Support Services and Harrington Nursery School are committed to equality, diversity and to promoting an inclusive teaching and learning environment for all.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:48:18.106Z","updatedAt":"2021-09-20T20:51:57.943Z"}
