{"id":"5906a7eb-a322-46d3-aba3-70d8615dad9b","name":"Professional Learning Network (Lyons Hall)","code":"1JW","type":"lead_school","isAccreditedBody":false,"urn":"138028","ukprn":"10037006","address":{"addressLine1":"Lyons Hall Primary School","addressLine2":"Deerleap Way","town":"Braintree","county":"Essex","postcode":"CM7 9FH"},"contact":{"website":"http://www.prolearnnet.com","email":"vboreham@lyonshall.org.uk","telephone":"7833472639","fullName":"Director Professional Learning Network"},"location":{"latitude":51.8839692,"longitude":0.5798431},"trainWithUs":"Lyons Hall School, an outstanding school works in partnership with Essex Primary SCITT and Mid Essex ITT (for secondary) which were both recognised as outstanding providers by Ofsted in November 2017. Lyons Hall is the lead school in the Professional Learning Network (PLN), an alliance of over 50 primary, secondary and special schools\nIf you have a degree and would like to become a primary or secondary school teacher, PLN is here to support and guide you, every step of the way. We offer Initial Teacher Training through School Direct placements, a one-year programme in which candidates undertake on-the-job-training in at least two schools in Essex across the school year. The course is structured so that trainees gain hands on experience in schools from the very beginning and many of our trainees go on to work in one of the schools they trained in.\nWe are different to many other training organisations as we can support you with your induction as a Newly Qualified Teacher as well as with Continuing Professional and Leadership Development throughout your career.\nYou will receive support from experienced teachers to help develop the knowledge, skills and behaviours you need to become a successful practitioner. Trainees are encouraged to make the most of every opportunity that our strong partnership of schools offers and are well supported and challenged to achieve the very best outcomes that prepare them well for the start of their teaching careers.","trainWithDisability":"We are fully committed to fairness and equality. We strive to recruit from all backgrounds and ages and value the diversity it brings to the profession.\n\nOver the years we have supported trainees with disabilities and other needs to achieve at least good and often outstanding outcomes by the end of their training by taking in to account their individual needs and tailoring their training accordingly. \n\nIn the past we have provided extra support to trainees with dyslexia, dyspraxia, dyscalculia, hearing impairments, ME and other long standing illnesses who have successfully completed their training.\n\n We have provided help with proof-reading assignments, providing handouts on pastel coloured paper and running “Breakfast Support” sessions and Wellbeing days. If you think you may require assistance with any of the tasks at our interview and assessment day, we are happy to chat in advance about how we can make them accessible for you.\n\nWe welcome any requests from applicants concerning anything we can do to support you as you apply to join the course.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:48:53.574Z","updatedAt":"2021-10-05T19:28:54.298Z"}
