{"id":"59579b9d-79e3-4ab9-a34e-6d11aad8263e","name":"Gorse SCITT","code":"1N1","type":"scitt","isAccreditedBody":true,"ukprn":"10055363","address":{"addressLine1":"c/o The Bruntcliffe Academy","addressLine2":"Bruntcliffe Lane","town":"Leeds","county":"Leeds, Yorkshire","postcode":"LS27 0LZ"},"contact":{"website":"http://www.gorsescitt.org.uk","email":"info@gorsescitt.org.uk","telephone":"0113 4871777","fullName":"Stephen Mckenzie"},"location":{"latitude":53.7458695,"longitude":-1.6190285},"trainWithUs":"Over the last nine years, GORSE SCITT has trained over 1600 trainee teachers across all subjects and in both Primary and Secondary phases. As an Ofsted Outstanding provider of Initial Teacher Training, we have worked hard to ensure that our training programme and curriculum is one that we can be proud of, and one that ensures that our trainees are well-prepared for employment in any school, in any context, in any location.\nGORSE SCITT offers the opportunity to train in locations across Yorkshire and Humber. Because of the range of schools we are partnered with, trainees experience a minimum of two contrasting placements throughout their training year. The powerful and mutually-rewarding relationship between GORSE SCITT and its partner schools means that you can be sure that if you are offered a place on our programme, your placements are guaranteed; you will not be expected to find your own placements. An overview of the schools we are partnered with can be found on our website. In addition to these placements, you will have the opportunity to engage with a range of enhancements. These enhancements support your development in understanding the learning journey of a child from the moment they start in an educational setting to the moment they leave. Our enhancements range from SEND, EAL, Post-16 and Alternative Provision, as well as allowing you to engage with different key stages from those you are training to teach. Our aim is to ensure you are well-prepared for a successful career in teaching.","trainWithDisability":"We pride ourselves on the layers of support we provide for our trainees. Each week you will be mentored by a placement mentor who will support you with the planning, delivery and reflection of your lessons, as well as ensuring that you experience your placement as a colleague rather than as a trainee; we also expect our trainees to act like colleagues. You will be mentored and coached each week by a Professional Mentor who will support the development of your classroom pedagogy, and a Subject Lead who will support your subject knowledge development as well as ensuring that you are able to fully deliver your subject curriculum. You will also have the full support of the GORSE SCITT leadership team at all times. Our training programme, and our curriculum, mirror the teaching philosophy of The GORSE Academies Trust and our partner schools; we deal with, and remove barriers to learning so that children from all backgrounds and all starting points are supported in fulfilling their potential. We work closely with our trainees to ensure that where possible, we personalise your training experience so that you are able to successfully complete your training.\nWe take trainee wellbeing and welfare extremely seriously. We know that our trainees come from a range of backgrounds and are diverse in terms of their experiences, age and career paths. We are able to make your transition into teaching as seamless as possible.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:47:46.683Z","updatedAt":"2022-01-19T23:04:03.440Z"}
