{"id":"59c5c303-2d98-4c16-a712-f1178c7941d0","name":"Pilton Bluecoat Academy","code":"3T2","type":"lead_school","isAccreditedBody":false,"urn":"138315","ukprn":"10037633","address":{"addressLine1":"Pilton Bluecoat Academy","addressLine2":"Abbey Road","town":"Barnstaple","county":"Devon","postcode":"EX31 1JU"},"contact":{"website":"https://www.teamacademytrust.com/","email":"dpolak@piltonbluecoat.devon.sch.uk","telephone":"+441271345952"},"location":{"latitude":51.0870407,"longitude":-4.0647675},"trainWithUs":"TEAM Multi-Academy Trust is a collection of North Devon schools, led by research and inspired by children. We collaborate with schools beyond our Trust to provide trainees with a range of school placements and experiences to best equip them for working in a variety of settings.\n\nOur belief is that prospective teachers need the best possible start to their career, and this can only be achieved through world-class training. We employ specialists who are not only experts in their field, but also demonstrate how academic principles apply to the reality of the classroom on a daily basis. The vast majority of our training comes from active teachers or those with very recent experience, which we see as fundamental to learning how theory shapes effective practice.\n\nThe schools we work with range from tiny, 40-child village schools, to town schools with more than 400 children on roll. We work closely with all schools to ensure mentoring is both practical and inspiring. We love teaching and we want you to love it, too.","trainWithDisability":"We are fully committed to working with all prospective teachers. Children and schools need diversity and we care deeply about supporting all trainees to realise an ambition of working in schools. \n\nWe have an excellent track record of supporting teachers with a range of disabilities, and welcome all conversations about how we can support you with bespoke plans to access any of our settings.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-10-12T21:05:17.432Z","updatedAt":"2021-10-14T22:54:42.192Z"}
