{"id":"5a0db7e7-e141-423e-8110-a88bdcc435b2","name":"Blessed Thomas Holford Catholic College","code":"1YR","type":"lead_school","isAccreditedBody":false,"urn":"106376","ukprn":"10015044","address":{"addressLine1":"Urban Road","town":"Altrincham","county":"Cheshire","postcode":"WA15 8HT"},"contact":{"website":"http://www.bthcc.org.uk","email":"RobertMcGuinness@bthcc.org","telephone":"1619118090","fullName":"Robert McGuinness"},"location":{"latitude":53.3870231,"longitude":-2.3415212},"trainWithUs":"Our expanding and oversubscribed school has 1565 pupils from 11-18 years of age including 186 in our Sixth Form College. Our mission statement at Blessed Thomas Holford Catholic College reflects our commitment to developing the best in all our pupils and staff.\nOur most recent June 2013 Ofsted report judged the school to be Outstanding in every area for the third time in succession. Our university entrance rate is exceptional and other students secured their place with a prestigious graduate apprenticeship provider. In 2021, all our students who wanted to, secured a place at their chosen university with 30% into Russell Group/prestigious universities across the UK.\nOur vision is to develop teachers who will become the school leaders of the future. By starting your teaching career at Blessed Thomas Holford Catholic College we would like to think your first year will be just the beginning. We are proud of our Middle Leaders and Senior Leadership Training programmes which will recognise your potential and give you the opportunity to explore careers management. Our relentless quest for excellence includes providing coaching for every member of our teaching staff. Continuing Professional Development is very much central to our philosophy.\nPlease visit our website\n(http://www.bthcc.org.uk/schooldirect)","trainWithDisability":"Blessed Thomas Holford Catholic College seeks to ensure that staff are supported with any additional needs which they may wish to disclose. All staff, including staff with additional needs or disability, have an equal opportunity to access relevant support and reasonable adjustments in order to fulfil their role within the college. The fundamental principles – as set out in the college’s mission statement – are reflected in college policies on curriculum, pastoral care, equal opportunity and assessment, recording and reporting.\nAt Blessed Thomas Holford Catholic College, we will seek to work in partnership with staff and relevant outside agencies to ensure individual needs are met.\nThe college adopts the principles, policies and relevant sections of the Equalities Act, 2010.","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"accreditedBodies":[{"id":"812b70c4-7fc4-46fc-975b-3e4d00f77dc4","code":"M40","name":"Manchester Metropolitan University","description":"Manchester Metropolitan University has a longstanding national reputation for providing high-calibre initial teacher training with over 20 Secondary specialisms available.\\r\\n\\r\\nThe School of Teacher Education and Professional Development is proud to have been training teachers and education professionals for over 100 years.\\r\\n\\r\\nTrainees are supported throughout by university and placement mentors.\\r\\n \\r\\nTrainees have access to NQT alumni support in their first year of teaching. \\r\\n\\r\\nThere are close links with their Educational and Social Research Institute\\r\\n\\r\\n(https://www.mmu.ac.uk/stepd/secondary/train-to-teach/school-led/)"},{"id":"9d03acb4-95ce-41e1-8458-0b4bec147b6b","code":"M20","name":"University of Manchester","description":"The Good Teacher Training Guide 2017 rated The University of Manchester as top in the North West for secondary initial teacher training. \\r\\n\\r\\nTheir 2018 Ofsted inspection recognised them as Outstanding across all assessed elements in all their PGCE Programmes which shows the high quality of work done across the Partnership in the training of teachers.\\r\\n\\r\\nTrainees are taught by experts in education who are active in education-related research. \\r\\n\\r\\nSecondary subjects are taught by specialist tutors with substantial teaching experience. The tutors are in touch with current educational practice and often contribute to research, policy and curriculum developments.\\r\\n\\r\\n(https://www.seed.manchester.ac.uk/education/study/pgce/school-direct/)"}],"createdAt":"2021-07-06T17:53:25.385Z","updatedAt":"2021-09-29T15:54:27.870Z"}
