{"id":"5a4fec49-a7bb-4fb6-a805-0e18a8c1fd18","name":"Beal High School (NELTA)","code":"1NA","type":"lead_school","isAccreditedBody":false,"urn":"140575","ukprn":"10046736","address":{"addressLine1":"Beal High School","addressLine2":"Woodford Bridge Road","town":"Ilford","county":"Essex","postcode":"IG45LP"},"contact":{"website":"http://nelta.co.uk/programmes/initial-teacher-training-programme/","email":"admin@nelta.co.uk","telephone":"2085514954","fullName":"NELTA manager"},"location":{"latitude":51.5860169,"longitude":0.0517167},"trainWithUs":"NELTA is a school-centered initial teaching training provider within Beal High School which works with over 20 schools. We are passionate about developing the next generation of teachers and school leaders. Teachers and leaders who will ensure an outstanding educational future for all pupils irrespective of background or ability. Working with our alliance you can expect:\n* Guidance from an experienced school based mentor and provider tutor\n* Very well established support programmes\n* Access to a wide network of schools including community secondary, primary, independent, grammar and special education\n* Professional development opportunities beyond your training year focused on outstanding teaching and leadership\nNELTA, which networks in Barking and Dagenham, Waltham Forest, Redbridge, Newham and beyond, offer opportunities to work in a range of different socio-economic areas. Working in a partnership which includes independent schools, boys' and girls' grammar schools, faith schools, comprehensive schools and special schools means you will have access to a broad range of training experiences which will give you the opportunity to you develop your practice in a variety of different settings.\nWe offer teacher training places for both the tuition fee and salaried routes to Qualified Teacher Status. For tuition fee routes routes we work with King’s College London, UCL and NELTA as our accredited providers.\nFor our salaried route the accredited provider is NELTA (the operating name of teacher training provided by the Beacon Multi-Academy Trust)","trainWithDisability":"We are committed to supporting equal opportunities and disability access.\nWe have accommodated trainees in the past with a range of disabilities including mental health conditions, dyslexia and physical impairments.\nDisability access in schools varies according to the specific training location. Please check with the relevant accredited provider or email us to discuss your needs [NELTA](admin@nelta.co.uk).","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"accreditedBodies":[{"id":"36425fae-da68-4e79-89de-8b41ea733c37","code":"K60","name":"King’s College London (University of London)","description":"Located in the heart of London, PGCE courses at King’s are rated Outstanding by Ofsted with excellent tutors on hand to support you through your training. In the last research assessment exercise, the department was rated second in the UK (REF, 2014). You will have the opportunity to work with experienced tutors who are actively engaged in research in their subject and in pedagogy more widely. 96% of 2017 graduates who sought teaching posts were employed within 6 months of qualifying. In our 2018 student survey, 92% of trainees rated the quality of their training as very good or good."},{"id":"46fcebe2-49b1-4e80-8531-772dc26f3c38","code":"251","name":"NELTA","description":"We are committed to working in partnership with trainees and partner schools to provide highly trained teachers for the local community and beyond.\\r\\n\\r\\nWeekly contact with other trainees and our programme tutors means that you will always feel fully supported.\\r\\n\\r\\nThe Ofsted inspection of our initial teacher training provision on 2017 said:\\r\\n“Leaders’ ambitious vision for excellence and their aspirations for trainees are of the highest order”\\r\\n“The quality of training is outstanding”\\r\\n“Trainees are overwhelmingly positive about the quality of mentoring”"},{"id":"7f11aaed-7c3e-42c5-af7a-023d33b45fa3","code":"U80","name":"UCL, University College London","description":"Our university partner for this programme is UCL Institute of Education (IOE), a global leader in teacher education. Their programmes are recognised by Ofsted as “outstanding” in every criterion across Primary and Secondary education. \\r\\n\\r\\nTraining with disabilities and other needs\\r\\nSchool Direct students can access the services provided by UCL’s Student Support and Wellbeing team. See the following web page for full details:-\\r\\nhttps://www.ucl.ac.uk/students/student-support-and-wellbeing"}],"createdAt":"2021-07-06T17:56:25.720Z","updatedAt":"2021-10-04T17:45:25.121Z"}
