{"id":"5a534974-57fd-41a0-b900-b059d4bef86f","name":"Thamesmead School","code":"1OU","type":"lead_school","isAccreditedBody":false,"urn":"137237","ukprn":"10034809","address":{"addressLine1":"Thamesmead School","addressLine2":"Manygate Lane","town":"Shepperton","county":"Middlesex","postcode":"TW17 9EE"},"contact":{"website":"www.thamesmeadscitt.co.uk","email":"c.lane@thamesmead.surrey.sch.uk","telephone":"1932219412","fullName":"Karen Hall"},"location":{"latitude":51.3934369,"longitude":-0.4425889},"trainWithUs":"Thamesmead SCITT is an ITT provider based on principles of excellence that is highly regarded by Ofsted. We lead a partnership of schools in Surrey with a network of effective and committed Mentors, Professional Tutors and Headteachers. During the past 15 years, we have been in the privileged position of educating children and training the next generation of excellent teachers. In doing so we have built up a well-regarded reputation across Surrey and beyond. Our programme will enable high-level graduates to engage with the academic and pastoral curriculum in their placement school in order to give them a rounded understanding of what it means to work in an educational setting. Trainees will find themselves working in welcoming and stimulating environments alongside highly experienced teachers. Our data shows that our trainees are, year on year, graded very highly and 100% of our trainees gain employment, many of them within our partner schools. We have a growing number of alumni who have rapidly moved up to positions of leadership because of the excellent support they receive.\nWe look forward to working with high calibre graduates who are passionate about their subject, who are willing to engage with a wide range of young people and who will give their all to becoming an excellent teacher.\nThamesmead SCITT is committed to providing trainee teachers with challenging and meaningful experiences to enable them to develop the high- level skills, knowledge and understanding that are required to teach young people in the 21st century.","trainWithDisability":"Thamesmead SCITT welcomes applications from all graduates, including those with disabilities, those from ethnic minority groups and those that can bring a wealth of life experience to the teaching profession as a mature graduate. Our programme includes advice and guidance concerning mental health and well-being and the range of professionals involved in the partnership means that there is a wealth of experience and support should a trainee need it.\nPreviously we have supported trainees with a range of needs including mental health issues, dyslexia and autism all of whom have developed into successful teachers.\nAn on-line occupational health check will need to be completed, as part of the pre-employment induction process and any recommendations that are provided by occupational health would be reviewed to ensure that candidates have the correct support for their disability and/or their specific needs. Trainees with specific physical disabilities including hearing and visual impairments will be placed within schools who are best able to provide the relevant accessibility.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:56:22.696Z","updatedAt":"2021-09-10T18:11:25.088Z"}
