{"id":"5ad487c0-1798-4965-809e-2bd909a569ed","name":"Seven Kings Learning Partnership","code":"1EH","type":"lead_school","isAccreditedBody":false,"urn":"102856","ukprn":"10005764","address":{"addressLine1":"Ley Street","town":"Ilford","county":"Essex","postcode":"IG2 7BT"},"contact":{"website":"http://www.sevenkings.school","email":"c.dnetto@sevenkings.school","telephone":"2085548935","fullName":"Laura Evans"},"location":{"latitude":51.5683282,"longitude":0.08541},"trainWithUs":"Seven Kings Teaching Alliance has 25 schools who have great experience working with trainee teachers at different levels. \nSeven Kings Teaching School Alliance is proud to offer primary and secondary teacher tuition route and salaried training through School Direct, a school-based teacher training route.\nTrainees work alongside highly experienced classroom practitioners and have more of their training in school.\n\nAs a Teaching Alliance we have vast experience in Initial Teacher Training and are proud of our achievements in turning inexperienced trainees into outstanding teachers and leaders of the future. Many of our trainees now hold positions in middle and senior leadership roles. It is expected that trainees will go on to work within their host school or group of schools although there is no absolute guarantee of employment. Last year all of our salaried trainees received an offer of a job within our alliance.\n\nWe are proud of our awarded Cradle to Grave programme of training and the exciting programmes we offer for ITT across our schools’ networks.\n\nOur School Direct training is delivered in partnership with the Institute of Education (University of London) and the University of East London.","trainWithDisability":"Seven Kings is equipped with lifts to support students with access.\nIn the past we have supported trainees with access needs by timetabling them in more easily accessed rooms.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:55:29.119Z","updatedAt":"2021-09-27T20:41:37.740Z"}
