{"id":"5b77bd40-8abb-47f9-b96e-3be033e98d03","name":"Sydney Russell Teacher Training Centre","code":"1EJ","type":"lead_school","isAccreditedBody":false,"urn":"141683","ukprn":"10048673","address":{"addressLine1":"The Sydney Russell School","addressLine2":"Parsloes Avenue","town":"Dagenham","county":"Essex","postcode":"RM9 5QT"},"contact":{"email":"ccr@sydney-r.bardaglea.org.uk","telephone":"0203 959 9900","fullName":"Clare Cross"},"location":{"latitude":51.5477332,"longitude":0.1335436},"trainWithUs":"The Sydney Russell Teacher Training Centre, in partnership with other local schools is able to offer you a fantastic school based opportunity to train in a supportive and aspirational environment. Our staff are excellent practitioners with outstanding behaviour management skills and are eager to support and train the next generation of teachers.\nOur partnership comprises of Primary, Secondary 11-18 and a Special School. They are conveniently located and trainees have the unique opportunity to experience more than one school, age range and sector. We have successfully worked with trainee teachers for many years and offer you outstanding practical teacher training leading to QTS with the Professional Graduate Certificate in Education (PGCE). This is truly an exceptional opportunity.\nOur core philosophy is to train the next generation of teachers to inspire, motivate and challenge our children. We will work with our trainees to build a solid foundation from which they can embark upon a rewarding career. We work to create an environment in which teachers and students thrive and feel valued and supported. Parents, teachers and children need excellent teachers in schools and our purpose is to provide them!\nWorking closely with our partners allows us to provide each trainee with rich opportunities to develop their teaching skills. Each trainee will have a personal learning programme closely matched to their individual needs and aspirations.","trainWithDisability":"All Sydney Russell and PLS partner schools are compliant with disability access","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"a6a60029-f606-42b6-b526-48360b61890c","code":"2B1","name":"Partnership London SCITT (PLS)","description":"We see teaching as a vocation and we aim to recognise and respond to the talents and needs of every trainee and provide the best means of developing their full potential. \\r\\nWe will recruit, train and retain the very best teachers. A key part of our philosophy is that we ensure equality of opportunity and welcome, value and respect all who train with us.\\r\\nWe will build a learning community based on justice and a sense of personal responsibility. Central to our philosophy is promoting dialogue and cooperation with the wider community and encouraging a commitment to life-long learning."}],"createdAt":"2021-07-06T17:48:49.650Z","updatedAt":"2021-09-30T22:02:18.558Z"}
