{"id":"5bbb6845-8e36-4453-aa9a-a6dc751ca59c","name":"The Lozells School Direct Programme","code":"139","type":"lead_school","isAccreditedBody":false,"urn":"103227","ukprn":"10076566","address":{"addressLine1":"Holte School","addressLine2":"wheeler Street, Lozells","town":"Birmingham","county":"West Midlands","postcode":"B19 2EP"},"contact":{"website":"www.holte.bham.sch.uk","email":"chokri.chiha@holte.bham.sch.uk","telephone":"0121 566 4371","fullName":"Mr Chokri Chiha"},"location":{"latitude":52.5001783,"longitude":-1.9002623},"trainWithUs":"Lozells Primary School and Holte School are the lead Schools for School Direct, We work with BCU and we never give up in our aspirations for tomorrow’s teachers. Our student teachers will be ‘the village’ it takes ‘to raise a child’. We aspire to prepare teaching generations of professionals to teach generations of young people.\nOur courses are taught by staff who are experienced professionals and maintain links with their sector to ensure you get the most up-to-date learning during your course. Many are research active, contributing to scholarship in education, childhood and youth.\nPlacements form two-thirds of our School Direct courses, giving you the opportunity to get hands-on and apply and grow your skills in some of our school alliance, ensuring you gain experience in a variety of educational settings so that you’re ready for employment when you graduate. Holte School is an inner-city school and we work closely with BCU which is located in the City South Campus in Edgbaston, which has recently had a £41 million extension giving us excellent specialist facilities.\nOur aim for when you graduate is that you can think for yourself, critically and reflectively determining what’s best, not what’s easiest. Our graduates are very employable with many taking jobs in the West Midlands. 99% of our School Direct PGCE Secondary and 98% of our PGCE School Direct Primary students were in employment or further study 6 months after graduating (DLHE 2016/17).\nJoin us and let us empower you to inspire future generations","trainWithDisability":"Holte School, the Alliance and the University aim to provide an accessible environment and a range of support services to enable disabled students to participate fully in all activities of the University. We believe a person is only disabled when confronted by negative attitudes and environmental barriers. We are working towards creating a positive, supportive and inclusive learning environment across all the University’s sites and faculties.\nWe have staff who support and advice for prospective and current students with physical or sensory disabilities, specific learning difficulties (e.g. dyslexia), autism or chronic medical conditions. These specialist staff also provide information about additional funding such as Disabled Students’ Allowances, run a Personal Assistance Scheme and offer a dyslexia screening and diagnostic service.\nOur campuses are fully accessible with accessible toilets (having hoists), hearing loops in lecture theatres and networked assistive technology including Claro Read and Inspiration. In addition, we have PCs at our City South Campus which are designed to support students who may have difficulties with reading and writing, featuring specialised software with zooming/magnification and screen reading capabilities, which may also be customised for individual student needs.\nFor further information and advice, please visit: www.bcu.ac.uk/student-affairs","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:52:42.035Z","updatedAt":"2021-07-06T20:52:03.305Z"}
