{"id":"5bbdc19b-1e1f-4df3-9987-65e2eace12d4","name":"OAKS Norths Staffordshire and Shropshire Hub","code":"1JA","type":"lead_school","isAccreditedBody":false,"urn":"141448","ukprn":"10036532","address":{"addressLine1":"Blackfriars School","addressLine2":"Priory Road","town":"Newcastle-Under-Lyme","county":"Staffordshire","postcode":"ST5 2TF"},"contact":{"website":"http://www.blackfriarstsa.com","email":"tsa.director@blackfriarstsa.com","telephone":"1782987151","fullName":"Mrs Bernadette Pearce"},"location":{"latitude":53.0078353,"longitude":-2.2319338},"trainWithUs":"By offering the opportunity to embark on a Teaching Career with Blackfriars Teaching School Alliance, we know that by recruiting the very best individuals who are committed to the profession, we will make a positive difference to the lives of future generations. Such a strong moral compass highlights that ‘collaboration and networking’ are at the core of our Teaching School Alliance and recognises the importance of working together for ‘the greater good’.\nWe have a strong partnership of schools covering Staffordshire, Shropshire and Cheshire. All of our schools are incredibly experienced in welcoming and nurturing Trainee Teachers. From day one you will be made to feel part of the team and will be surrounded by passionate people who are dedicated to making a difference.\nAs well as receiving excellent support from our mentors in school, all Secondary Trainee Teachers within our partnership are offered a weekly CPD Programme which supplements the University programme. These CPD sessions offer Trainee Teachers the opportunity to learn from practitioners who are experts in their field and also allows time to share best practice and network.\nDuring current Covid-19 restrictions, visits to schools are difficult. Therefore potential applicants are encouraged to make contact with partner schools to discuss any questions they may have. For further information or to contact us, please go to our website [http://www.blackfriarstsa.com/](http://www.blackfriarstsa.com/)","trainWithDisability":"As an organisation we are experienced in supporting students with additional needs. Please contact Blackfriars to discuss, in confidence, any reasonable adjustments that need to be made to support you in your chosen career.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:47:32.120Z","updatedAt":"2021-10-27T20:23:07.766Z"}
