{"id":"5bce9a0d-f372-4667-b3ec-3d58d42a1345","name":"Carmel Teacher Training Partnership (CTTP)","code":"C23","type":"scitt","isAccreditedBody":true,"ukprn":"10055116","address":{"addressLine1":"Carmel College","addressLine2":"The Headlands","town":"Darlington","postcode":"DL3 8RP"},"contact":{"website":"www.carmelteachertraining.com","email":"thonnartm@carmel.bhcet.org.uk","telephone":"01325 523460","fullName":"Mike Shorten"},"location":{"latitude":54.5244598,"longitude":-1.585727},"trainWithUs":"Carmel Teacher Training Partnership (CTTP) is an ‘outstanding’ Initial Teacher Training Provider. We work with schools across the northeast of England within the cities and surrounding areas of Newcastle, Durham, Sunderland, Gateshead, Alnwick, Darlington, Bishop Auckland, Middlesbrough and the Tees Valley.\nCTTP provide high quality teacher training in school-based settings with highly experienced classroom practitioners. This is achieved through a blended approach of central and school-based training activities in regional clusters by our Lead Schools, and in conjunction with Leeds Trinity University. If you are looking for personalised and bespoke training in a nurturing and supportive environment, there is no better place for you to start your teaching career than with us (CTTP). OFSTED 2018 ‘High-quality and personalised training contributes well to trainees’ and NQTs’ development as reflective, confident teachers who are deeply committed to their own professional development. Tutors and mentors provide sharp, insightful feedback to trainees about the quality of their teaching. The targets set for improvement are accurate, ambitious and achievable. This high-quality feedback contributes exceptionally well to trainees’ success in becoming effective teachers.’ Employment rates are consistently high- 96% in 2020. Each year, a high percentage of trainees gain employment in their placement schools or within our Partnership of schools.","trainWithDisability":"All schools within the Carmel Teacher Training Partnership are fully accessible. Provision for additional support where needed is provided on site. Please contact Michala Atterby on matterby@carmel.bhcet.org.uk with any specific disability access requirements.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:57:19.086Z","updatedAt":"2021-10-04T21:09:15.987Z"}
