{"id":"5c840027-0128-47a3-9d86-54c513c82ca8","name":"St Marks’s teaching School Partnership","code":"13T","type":"lead_school","isAccreditedBody":false,"address":{"addressLine1":"School Lane","addressLine2":"Hadlow Down","county":"Uckfield","postcode":"TN22 4HY"},"contact":{"website":"http://www.st-marks.e-sussex.sch.uk","email":"head@st-marks.e-sussex.sch.uk","telephone":"1825830375","fullName":"Claire Rivers"},"location":{"latitude":50.9968179,"longitude":0.1795208},"trainWithUs":"St Mark’s teaching school partnership is an exciting place to work and learn. It provides a unique school based learning opportunity in partnership with the University of Brighton and the University of Sussex. This is an innovative partnership of six schools led by the outstanding St Marks Church of England Primary. The vision for our partnership is “To open a door to teaching and learning that will inspire the teachers of the future to be able to work collaboratively and creatively, and to have a passion to enable the pupils in their care to develop holistically to their full potential.”\nWe recognise how much enthusiasm and energy trainees bring to our schools. They give us an opportunity to share good practice and to learn with them. Our staff are trained in, and enjoy, coaching and developing, the next generation of teachers so that they can inspire our children. Our partnership of schools is led by St Marks Teaching School and comprises of four village primaries and a large urban primary with an ASD facility. The children across our schools are at the heart of everything we do. They are happy, well- motivated and they love learning. Both staff and children believe everyone matters, everyone helps to enable everyone to succeed. Our staff are our most valuable resource, and have a proven track record in training and professional development. Our teachers are excellent practitioners who are eager to share their knowledge and skills and work alongside the next generation of teachers","trainWithDisability":"The programme welcomes applications from all sections of\nthe community and recognises and values the diversity of trainees\nrecruited.\nWe oppose all forms of discrimination on the grounds of age,\ndisability, gender reassignment, marriage and civil partnership,\npregnancy and maternity, race, religion or belief, sex or sexual\norientation.\nWe want to ensure that everyone has equal access to\nopportunities and that all the attributes, talents and skills\navailable throughout the community are recognised.","accreditedBodies":[{"id":"b998b5d3-81fe-4510-b505-557f21141349","code":"E37","name":"Sussex Teacher Training Partnership","description":"Key facts about\\r\\nthe training\\r\\n•\\t School-Centred Initial Teacher Training\\r\\n•\\t Over 15 years’ experience as an accredited schoolbased Initial Teacher Training provider\\r\\n•\\t One year programme commencing in September\\r\\n•\\t Training covers the whole primary age range\\r\\n•\\t You can train at any suitable placement school or academy across East Sussex.\\r\\nLead partnership training schooll\\r\\n•\\t St Mark’s Teaching School with their partnership schools \\r\\n-Manor Primary School \\r\\n-High Hurstwood Church of England Primary School \\r\\n-Buxted Church of England Primary School \\r\\n-Bonners Church of England Primary School"},{"id":"4d4cceab-1516-4a6c-a9ab-5de0e32e1fe1","code":"S90","name":"University of Sussex","description":"The University also provides a comprehensive programme of professional studies which complements the sessions offered across our partnership.\\r\\n The University works in partnership with the school to organise a final assessment and make a recommendation for QTS. A university tutor will support you whilst on the programme and you will be eligible to access a range of support services provided by the University.\\r\\nCandidates on a School Direct Training place will be automatically registered on the PGCE which offers up to 90 Master credits. \\r\\n\\r\\nTo find out more about our partnership with the University of Sussex please visit:\\r\\nhttp://www.sussex.ac.uk/education/ite/schooldirect"}],"createdAt":"2021-07-06T17:52:52.357Z","updatedAt":"2021-11-04T22:32:53.900Z"}