{"id":"5c998346-25fc-42bc-b909-844f776eddb3","name":"Pioneer Learning Trust","code":"2M3","type":"lead_school","isAccreditedBody":false,"urn":"138469","ukprn":"10046141","address":{"addressLine1":"The Shire Foundation, Hillborough Junior School, Hillborough Road","town":"Luton","county":"Bedfordshire","postcode":"LU1 5EZ"},"contact":{"website":"https://www.theshirefoundationscitt.org","email":"tmurphy@shirefoundation.co.uk","telephone":"01582 522121","fullName":"Julie Darmody"},"location":{"latitude":51.8724543,"longitude":-0.4251093},"trainWithUs":"The Pioneer Learning Trust is a small MAT, in Luton, currently consisting of Chantry Primary Academy, Southfield Primary School and Whitefield Primary Academy, working in close partnership with other local schools within their proximity. Chantry Primary Academy, the Lead School for our partnership with the Shire Foundation is judged good by Ofsted. Our Trust has a strong focus on continuous professional development from initial teacher training into the Early Career Induction period and beyond, and has worked with Initial Teacher Training organisations for many, many years. The School Direct (Salaried) training is accredited by the Shire Foundation which is a well-established (since 1994) school-centred teacher training provider working with schools (nursery, primary and special), within a 30 mile radius of Luton. The schools within the Trust have worked in partnership with The Shire Foundation for a large number of years and have built up an excellent reputation in teacher training in the local area. Trainees consistently rate the quality of the course and support as very high. Shire has a consistently excellent employment rate (95 - 100% in recent years), with a high percentage of trainees securing a teaching job within their placement school.\nDuring the training year you will be employed within one of the schools within the Trust, or at one of its alliance schools within the West Area Partnership of Luton.","trainWithDisability":"Training accommodation at Shire, which is based at Hillborough Junior School in Luton, and the partner schools has appropriate disability access. Each year we work successfully with trainees with disabilities and other needs. Our personalised approach to training ensures that support and provision is tailored to each trainee's particular needs, in order to facilitate success during all aspects of the training year.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:56:59.639Z","updatedAt":"2021-09-20T17:58:35.792Z"}
