{"id":"5ca88673-1b08-44bc-89be-4729ee7539c1","name":"St Peter’s Teaching School","code":"2EM","type":"lead_school","isAccreditedBody":false,"urn":"143285","ukprn":"10057781","address":{"addressLine1":"St Peter’s Church of England Primary School","addressLine2":"Halletts Way","town":"Portishead","county":"North Somerset","postcode":"BS206BT"},"contact":{"website":"https://www.st-peters.n-somerset.sch.uk/","email":"janineashman@sppschool.uk","telephone":"1275843142","fullName":"Janine Ashman"},"location":{"latitude":51.4800612,"longitude":-2.7666406},"trainWithUs":"Thank you for considering beginning your teaching career with St Peter’s Teaching School. Where to study for this qualification is an important decision and we hope to provide you with the information to make an informed choice that will give you the best possible start to this wonderful career.\nSt Peter’s Teaching School is a teaching school within the Lighthouse School Partnership working with the University of the West of England in order to provide the best quality postgraduate teacher training. We are currently growing rapidly as a partnership.\nOur first cohort of 6 students started training with us in 2015 and our provision has grown with most of our trainees gaining their first teaching posts within our partnership of schools. All trainees receive outstanding support from our schools with additional training opportunities delivered by leaders within our alliance. We work closely with UWE but feel that our students are gaining extra opportunities to become essential members of the school staff by taking the School Direct route with us.","trainWithDisability":"We support candidates with disabilities and other needs in order to ensure they can successfully complete their training. We will work with them to develop necessary support.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:56:16.885Z","updatedAt":"2021-10-15T04:33:33.935Z"}
