{"id":"5d642eeb-33f4-42fc-941a-5319b0e3dd55","name":"United Teaching National SCITT","code":"1A9","type":"scitt","isAccreditedBody":true,"urn":"130912","ukprn":"10037395","address":{"addressLine1":"Paddington Academy","addressLine2":"50 Marylands Road","town":"London","county":"Greater London","postcode":"W9 2DR"},"contact":{"website":"http://www.unitedteaching.org.uk","email":"train@unitedteaching.org.uk","telephone":"01832 864439","fullName":"Samantha Robin-Hibbert"},"location":{"latitude":51.5249659,"longitude":-0.1928011},"trainWithUs":"United Teaching is the Initial Teacher Training scheme for United Learning. With over 80 primary and secondary schools nationwide, spanning the state and independent sectors, you can draw upon the expertise of our vast network of teachers and leaders to become the best teacher you can be.  Our bespoke programme is designed to support you during your training and beyond. Surrounded by a team of specialist mentors, you will always have someone to turn to throughout your teaching journey.  We offer real teaching exposure in a choice of schools, a mentor system, a support network, professional qualifications, as well as continuous professional development throughout the duration of your career with United Learning if you stay in the Group beyond your training year. Every trainee works to achieve Qualified Teacher Status (QTS), but you can also work towards a PGCE with 60 Master’s level credits through our partnership with Goldsmiths, University of London. Before undertaking the course, you will be required to attend our Summer Institute which will be held between the 4th – 8th July 2022. This is an intensive programme designed to prepare you to hit the ground running in September. Sessions will be a mixture of online sessions and face-to-face contact with the United Teaching team.  Please be aware that places on the salaried route are highly competitive and there are a limited number of places on our programme. Please email train@unitedteaching.org.uk if you would like further advice on routes available.","trainWithDisability":"At United Teaching, we aim to be an inclusive provider, promoting diversity and opportunities for all. We strive to support all our trainee teachers as best as we can and work with our partner PGCE provider and our partner schools to ensure that all trainees make excellent progress.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:56:04.821Z","updatedAt":"2021-11-01T20:47:09.597Z"}
