{"id":"5d691db0-3d77-4a57-a4a2-5392b1ed8fc1","name":"North Wiltshire SCITT","code":"24U","type":"scitt","isAccreditedBody":true,"ukprn":"10058663","address":{"addressLine1":"North Wiltshire SCITT, Teacher Education Centre","addressLine2":"Royal Wootton Bassett Academy, Lime Kiln","town":"Royal Wootton Bassett","county":"Wiltshire","postcode":"SN4 7HG"},"contact":{"website":"http://www.nwscitt.org.uk","email":"admin@nwscitt.org.uk","telephone":"01793 781511","fullName":"Kate Hopkins"},"location":{"latitude":51.547161,"longitude":-1.9016302},"trainWithUs":"Who we are:\n- North Wiltshire SCITT is an Outstanding Provider (Ofsted 2017). - North Wiltshire SCITT provides Initial Teaching Training (ITT) for Swindon, Wiltshire and beyond.\n- We are based at the Teacher Education Centre in Royal Wootton Bassett but work with over 40 partnership schools based in Swindon, Wiltshire and surrounding areas. Our vision: - \"to produce outstanding teachers who will ensure their students, whatever their starting point, thrive in all aspects of education. Our trainee teachers will value developing the whole person equally to the achievement of academic success.\"\nWhat we offer:\n- We offer ITT programmes leading to Qualified Teacher Status (QTS) and a Post Graduate Certificate in Education (PGCE) Level 7 with 60 masters credits, in both the Primary and Secondary fields of education. - North Wiltshire SCITT recommend for QTS qualification and our accrediting Higher Education Institute for PGCE is Bath Spa University. - We provide high quality initial teacher training delivered by current outstanding providers across the Partnership. - Each trainee will be challenged to become the best classroom practitioner they can possibly be. Trainees should aim to become confident, competent and reflective practitioners who are capable of delivering consistently high quality lessons. In turn, they should want to produce the very best learning opportunities for all their students. - Guidance and support is available throughout the programme for all our trainees and we support individual needs where appropriate.","trainWithDisability":"We are an inclusive organisation. All potential applicants are considered on an equal basis. We will ensure that all candidates applying and securing a place to train with us will be provided, wherever possible, with the means to do so, by implementing reasonable adjustments as required which may include:\n- Ensuring access to training venues and schools\n- Providing additional time where required e.g. for PGCE assignments\n- Providing larger print and/or coloured paper\n- Additional support from School-based mentor/ Subject Lead Tutors/Teaching and Learning tutors/Central SCITT staff\n- Ensuring all placement schools and venues are aware of any allergies and intolerances\n- Ensuring that candidates with hearing and/or sight impairments are seated appropriately to facilitate access to presentation content and instructions.\nPlease make us aware of any disabilities or other needs. We can assure you that all information will be treated in complete confidence.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:55:22.071Z","updatedAt":"2021-09-27T15:34:11.408Z"}
