{"id":"5eac7273-272e-45b6-b996-dc101534dd58","name":"St John’s Training School","code":"1OR","type":"lead_school","isAccreditedBody":false,"urn":"355311","ukprn":"10007166","address":{"addressLine1":"Brook Lane","addressLine2":"Walsall Wood","town":"Walsall","county":"West Midlands","postcode":"WS9 9NA"},"contact":{"website":"http://www.st-johns.walsall.sch.uk","email":"postbox@st-johns.walsall.sch.uk","telephone":"1543452197","fullName":"Enquiries"},"location":{"latitude":52.6271006,"longitude":-1.928521},"trainWithUs":"Many of our trainees go on to gain employment within our alliance or Walsall borough. All trainees last year successfully completed the course and gained employment ready for this September.\n Our training package is complemented with numerous qualified mentors and coaches throughout our school who offer a bespoke package of support to meet identified training needs.\nOur work with trainees was recognised in June 2020 by the University of Wolverhampton who awarded us the winner of the Outstanding School and Mentor Support Award.","trainWithDisability":"Depending on your individual needs, you may be eligible for additional support provided by the University. The Student Support and Wellbeing Team can talk to you about additional support that may be available.\nDisabled Students’ Allowances\nYou may be eligible to receive additional funding known as the Disabled Students’ Allowances to help cover the costs of any additional support you may need to access your university course. DSA funding is available for eligible students and can help with costs for specialist equipment, Non-Medical Helpers and other disability-related costs associated with studying.\nThe Sign Language Society at UoW has been running since 2008 and this is where you get to meet current Deaf students as well as other Deaf people who are both local and from all over the UK along with Deaf students who have already graduated - you can also meet BSL Interpreting and Deaf Studies students there too.\nFor more information please email: SLS@wlv.ac.uk","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:54:15.324Z","updatedAt":"2021-10-29T19:50:29.615Z"}
