{"id":"5fc43d72-6d2c-424f-adaa-dc58efa5de03","name":"Catholic Schools’ Partnership","code":"134","type":"lead_school","isAccreditedBody":false,"urn":"138961","ukprn":"10038068","address":{"addressLine1":"St Michael’s Catholic College","addressLine2":"Llewellyn Street","town":"Bermondsey","county":"London","postcode":"SE16 4UN"},"contact":{"website":"http://catholicschoolspartnership.org.uk/","email":"c.barclay@catholicschoolspartnership.org.uk","telephone":"0207 232 4569","fullName":"Postal Address:"},"location":{"latitude":51.499576,"longitude":-0.067463},"trainWithUs":"The Catholic Schools’ Partnership (CSP) is a strong and growing group of schools. It is a cross-phase partnership from primary, through to secondary and sixth form colleges. Our partner schools are based throughout South-East London and Kent covering Southwark, Greenwich Lewisham, Bromley and Bexleyheath. This diversity in type of school and location gives a richness to our shared work. Our shared vision is Growing Teachers, Growing Learners, Growing Schools. Our schools have a long history of Initial Teacher Education and have offered School Direct places since the initiative began. We have selected several universities that match our ethos. By carefully selecting the right universities to work with we are able to offer you an excellent start to your career in education. We offer Primary Tuition Fee School Direct places and are able to provide training in a range of secondary subjects. Some subjects are available with a choice of provider. We run an extensive CPD programme for trainees and most secure an ECT position within the group of schools. We also provide flexibility as your career progresses, with opportunities to move between schools.\nWe would encourage applicants to contact us to arrange a school tour prior to application and we are happy to answer any questions that you may have. Please contact the CSP Co-ordinator, Clare Barclay via email - c.barclay@catholicschoolspartnership.org.uk for more information or visit our website [here](https://catholicschoolspartnership.org.uk/) to find out more about our schools and the career opportunities that we are able to offer.","trainWithDisability":"All School Direct trainees must meet the Secretary of State's requirements for physical and mental health, but few health problems past or present preclude applicants from teaching. The activities that a teacher must be able to perform are set out in the [Education (Health Standards) (England) Regulations 2003](http://www.legislation.gov.uk/uksi/2003/3139/pdfs/uksi_20033139_en.pdf). We welcome applications from people with additional needs and disabilities. Successful applicants will be asked to complete a fitness questionnaire prior to commencing the programme. Within our group of schools, we are able to provide support for a range of disabilities and other needs and are usually able to arrange appropriate school placements and additional support as required. We have trained applicants with dyslexia, physical, hearing and visual impairments, as well as students with mental health issues. If you have any questions about health, disability, or the support provided or wish to discuss your own requirements further, please contact the CSP Co-ordinator, Clare Barclay, c.barclay@catholicschoolspartnership.org.uk. For further information on the support provided by our university partners please see the links below.\nGoldsmiths University\n[Disability Service](https://www.gold.ac.uk/students/disability-support/support-when-applying/)\nKing's College London\n[Disability Access:](http://www.kcl.ac.uk/campuslife/services/disability/index.aspx)\nSt Mary's University\n[Student Services](https://www.stmarys.ac.uk/smulic/why-choose-smulic/student-support-services.aspx)\nUniversity College London\nSchool Direct students can access the services provided by UCL’s Student Support and Wellbeing team. You can find more information [here](https://www.ucl.ac.uk/students/student-support-and-wellbeing)\nWe also strongly welcome applications from members of black and minority ethnic communities, as we are keen to ensure the teaching workforce is more representative of London's diverse population.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"049fe65f-08dc-4686-9ac8-606dce490128","code":"G56","name":"Goldsmiths, University of London","description":""},{"id":"36425fae-da68-4e79-89de-8b41ea733c37","code":"K60","name":"King’s College London (University of London)","description":""},{"id":"ef172d85-20e4-4aa2-96d0-9e3ae81f526d","code":"S64","name":"St Mary’s University, Twickenham","description":""},{"id":"7f11aaed-7c3e-42c5-af7a-023d33b45fa3","code":"U80","name":"UCL, University College London","description":""}],"createdAt":"2021-07-06T17:55:41.812Z","updatedAt":"2022-01-17T21:38:03.334Z"}
