{"id":"6019211a-2288-47aa-84ac-9e1038ba1854","name":"Greenwood Academies Trust","code":"1EX","type":"lead_school","isAccreditedBody":false,"urn":"137184","ukprn":"10034998","address":{"addressLine1":"Greenwood House","addressLine2":"Private Road No 2","town":"Colwick Quays Business Park","county":"Nottingham","postcode":"NG4 2JY"},"contact":{"website":"http://www.greenwoodacademies.org/schooldirect/","email":"theresa.ford@greenwoodacademies.org","telephone":"0115 7483310","fullName":"Theresa Ford, ITT and NQT Officer"},"location":{"latitude":52.9553883,"longitude":-1.077356},"trainWithUs":"We are looking for future teachers from all walks of life who are as diverse and vibrant as the communities we serve. Join us and benefit from a tailored package of support and development from outstanding, experienced staff and tutors.\nThe Greenwood Academies Trust (GAT) is a Multi-Academy Trust covering Nottinghamshire, Leicester, Northamptonshire, Peterborough, Bedfordshire and the East Coast. We currently have 37 open academies, educating over 17,000 pupils aged 3 to 19. Working mainly in areas with high levels of socio-economic disadvantage, our mission is to inspire and to ensure that every pupil thrives, makes excellent progress and succeeds.\nAlongside our accredited providers The Cambridge Partnership, Bishop Grosseteste University, Coventry University, Nottingham Trent University, and the University of Nottingham, we are offering a wide range of School Direct training places to start in September 2022. Based in one of our academies, you will study for a Post Graduate Certificate in Education (PGCE) with Masters credits, and Qualified Teacher Status (QTS).\nSince 2013 we have successfully trained more than 170 teachers through School Direct, with many former trainees now in positions of leadership. If you continue your teaching career with us we will provide ongoing support and Continuous Professional Development (CPD) specific to every stage of progression, through our Greenwood Learning Alliance.\nFind out more about us [here](http://www.greenwoodacademies.org)","trainWithDisability":"We welcome applications from all, irrespective of gender, marital status, disability, race, age or sexual orientation.\nIf you have a disability as defined by the [Equality Act 2010](https://www.gov.uk/definition-of-disability-under-equality-act-2010) please state this on your application. If invited to interview we will ask you if you require any reasonable adjustments to be made to help you access the selection process and, if offered a training place, to ensure that you aren't substantially disadvantaged during your training year.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"yes","canSponsorStudentVisa":"yes"},"accreditedBodies":[{"id":"1d95b6cb-0e08-4485-848a-0e304d71102a","code":"B38","name":"Bishop Grosseteste University","description":"You can find out more about Bishop Grosseteste University [here] (https://www.bishopg.ac.uk/about-bgu/partnerships/academic-partners)"},{"id":"26797ebf-f835-47c8-9369-7d6d67fb2343","code":"C85","name":"Coventry University","description":"You can find out more about Coventry University’s online School Direct programme [here] (https://www.coventry.ac.uk/study-at-coventry/faculties-and-schools/school-of-education-and-teaching/students/)"},{"id":"d2b7d074-fac9-42c5-a0d3-d5471b35f7d9","code":"N91","name":"Nottingham Trent University","description":"You can find out more about Nottingham Trent University [here for primary] (https://www.ntu.ac.uk/course/education/pg/next-year/school-direct-training-programme-primary) and [here for secondary] (https://www.ntu.ac.uk/course/education/pg/next-year/school-direct-training-programme-secondary)"},{"id":"828d1c59-36a8-4678-9a60-662565ae7172","code":"C03","name":"The Cambridge Partnership","description":"Unsalaried training places with The Cambridge Partnership are not eligible for sponsorship under the Student visa sponsorship scheme. You can find out more about The Cambridge Partnership [here] (https://campartnership.org/)"}],"createdAt":"2021-07-06T17:47:58.045Z","updatedAt":"2021-10-20T15:58:51.333Z"}
