{"id":"6019b3ce-f2f6-4b0e-b2a9-5813d74c4d54","name":"University of Worcester","code":"W80","type":"hei","isAccreditedBody":true,"urn":"133911","ukprn":"10007139","address":{"addressLine1":"Henwick Grove","town":"Worcester","county":"Worcestershire","postcode":"WR2 6AJ"},"contact":{"website":"https://www.worcester.ac.uk/about/academic-schools/school-of-education/get-into-teaching-at-worcester/home.aspx","email":"admissionsb@worc.ac.uk","telephone":"01905 855111","fullName":"Admissions"},"location":{"latitude":52.1970053,"longitude":-2.2428253},"trainWithUs":"The University of Worcester has a long-standing reputation for training excellent, highly employable teachers. Personalised academic and professional tutoring, from a range of experienced tutors and mentors, ensures that you will be supported throughout your course and in transition from trainee to teacher. With extensive research profiles, your learning is shaped by those helping to shape education itself. You will benefit from our excellent partnerships with schools, in a wide range of locations. With excellent support and dedicated school experience tutors, you will have the opportunity to flourish as an effective teacher.\nOur PGCE courses offer Master's-level credits as well as Qualified Teacher Status, and provide excellent opportunities.\nOur Primary courses include a high quality tailored programme of training in all National Curriculum subjects, in addition to SEND and RE. Trainee teachers at Secondary level can choose to add depth to their qualifications by involvement in additional enhancement activities in key areas such: as Special Educational Needs and Disabilities; working with learners who have English as an Additional Language; developing expertise in Citizenship; developing skills in a second STEM subject; preparing to be Education Leaders; developing skills in Technology Enhanced Learning; teenage mental health education; education in climate emergency; research in education.\nAt Secondary level we also offer pre-training Subject Knowledge Enhancement courses in a range of subjects for those who need them.\nOur inclusive courses attract applicants from a range of career and study backgrounds, including career changers and we welcome applications from all who meet our entry requirements.","trainWithDisability":"The University of Worcester offers a wide range of support and advice to disabled students and also to parents, staff and those external agencies supporting disabled students.\nOur Disability and Dyslexia Service offers support, advice and guidance to students who have a disability, medical condition or Specific Learning Difficulty (SpLD). This support lasts throughout a student’s studies at the University of Worcester. We also work with and offer support and advice to University staff on how to meet the needs of disabled students.\nWe can provide assistance through:\n* Supporting disabled students with general enquiries\n* Implementing special arrangements for lectures, exams and field trips. This might include notes in advance or special arrangements in exams.\n* Where appropriate, we can arrange note takers, academic support tutors, library assistance, interpreters and transcribers.\n* Help with applying for the Disabled Students Allowance (DSA) which is there to fund these types of support in higher education.\n* Limited loans of equipment\n* Confidential advice and support for students and staff\n* Training and awareness raising workshops\n* Assistive technology","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"createdAt":"2021-07-06T17:49:48.599Z","updatedAt":"2021-09-10T21:20:48.294Z"}
