{"id":"6022309e-cb78-44f4-bdf2-bdc48483608e","name":"Two Counties","code":"26Q","type":"lead_school","isAccreditedBody":false,"urn":"110048","ukprn":"10006865","address":{"addressLine1":"The Willink School","addressLine2":"School Lane","town":"Burghfield Common, Reading","county":"Berkshire","postcode":"RG7 3XJ"},"contact":{"website":"http://www.willinkschool.org.uk","email":"hjonas@willink.w-berks.sch.uk","telephone":"1189832030","fullName":"Aysha Stone"},"location":{"latitude":51.3966748,"longitude":-1.069333},"trainWithUs":"The Two Counties Teacher Training Partnership is made up of neighbouring secondary schools in the Berkshire and Hampshire area. We are proud to have Teaching School designation due to our proven track record in providing high quality teacher training and collaborative CPD opportunities. We offer secondary PGCE courses that are all planned and delivered in collaboration with the University of Reading's Institute of Education.\nAt the very heart of our model of Initial Teacher Training (ITT) is the drive to produce outstanding teachers who become critical curriculum thinkers, responsive and reflective practitioners and research informed professionals who can secure the very best outcomes for all children.\nThe partnership schools are:\n* Little Heath School – Tilehurst, Reading\n* Prospect School - Reading\n* The Wren School - Reading\n* The Hurst Community College - Baughurst, Hampshire\n* Theale Green School - Theale, West Berkshire\n* Denefield School - Tilehurst, Reading\n* The Willink School – Burghfield Common, West Berkshire\nThe purposes of this Teaching School partnership: * To share the knowledge, understanding and skills needed to be a good teacher through expert input.\n* To develop resilient, independent and reflective teachers that are over time consistently outstanding. * To collaboratively design and deliver a training programme that uses the expertise of experienced and successful teachers.\n* To recruit and develop the next generation of inspirational teachers for the partnership schools. * To provide a continued professional development programme for teachers as Early Career Teachers (ECTs).","trainWithDisability":"In partnership with the Institute of Education, we have created an open and inclusive environment, one which promotes a sense of well-being and belonging. A community where we recognise and treat all our trainees as individuals. You will enjoy high levels of personal attention and strong individualised support throughout your studies. The University of Reading has a dedicated Disability Advisory Service that you can access. The service offers advice and guidance to students with any disability, mental health condition, or specific learning difficulty (SpLD).\nAccessibility varies between the different training locations: further details can be provided upon request.","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"6439adcc-af64-4d3d-a1da-de045755db06","code":"R12","name":"University of Reading","description":"The University of Reading’s Institute of Education is an established provider of high-quality training and research. It is ranked 10th in the UK for Education (The Guardian University League Table 2022).\\r\\n\\r\\nCommitted to developing caring, reflective, professional teachers, it has well-established partnerships with over 400 schools in Berkshire and the surrounding area.\\r\\n\\r\\nOfsted report that the “effective relationships with partner schools support the development of high quality teaching and trainees that are well-prepared to work in the region’s schools.” (ITE inspection report, September 2016)."}],"createdAt":"2021-07-06T17:48:36.732Z","updatedAt":"2021-10-01T00:14:06.622Z"}
