{"id":"604f32f0-887f-4243-9e5d-addaec552b5e","name":"South Birmingham SCITT","code":"N32","type":"scitt","isAccreditedBody":true,"ukprn":"10052836","address":{"addressLine1":"South Birmingham SCITT","addressLine2":"Solihull Sixth Form College","town":"Widney Manor Road","county":"Solihull","postcode":"B91 3WR"},"contact":{"website":"www.southbirminghamscitt.org.uk","email":"carol.lewis@southbirminghamscitt.org.uk","telephone":"1217042581","fullName":"Administrator"},"location":{"latitude":52.4057217,"longitude":-1.7728004},"trainWithUs":"South Birmingham SCITT …\n… is the perfect place for someone who doesn’t just want a job in teaching, they want a career\n… is a supportive, encouraging environment and the staff will go out of their way to make you a success\n… will help find the teacher in you\n*\tPrimary and Secondary Teacher Training\n*\tSchool – Led (SCITT and Schools Direct)\n*\tLearn from real teachers in real classrooms\n*\t100% employment rates\n*\tBespoke programme offering high levels of support to enable you to reach your full potential\n*\tQualified Teacher Status and Post Graduate Certificate in Education (MA Level7 x 60)\n*\t1 day in training, 4 days in placement\n*\t50+ exciting and innovative schools in Birmingham and surrounding areas\n*\tStrategic partners of a number of Teaching Schools to secure individuals early career entry and opportunities into leadership\n*\t18 years’ experience training new teachers\n*\tRecognised locally and nationally for its strong provision\n* The West Midlands provider of Future Scholars and Researchers in Schools Programmes\n*\tHighly skilled practitioners to ensure high quality learning for the trainee *\tNQTs consistently rate us in the top 10 providers via the Good Teacher Training Guide\n*\tFantastic partnership of innovative schools who repeatedly employ our trainees\nOur programmes are all the same whether they are through our SCITT or our School Direct Partners. South Birmingham SCITT Colmore Partnership Training School Alliance\nSummit Learning Trust\nThe Augustine Partnership","trainWithDisability":"A condition of your offer will be the successful completion of an Occupational Health Check to satisfy the requirements for Fitness to Teach. We endeavour to meet the needs of trainees with disabilities and you are welcome to discuss any needs or disabilities with us at any time during the application process. If you are disabled or have a specific learning difficulty, all reasonable adjustments will be made.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:48:41.866Z","updatedAt":"2021-10-04T04:52:36.031Z"}
