{"id":"604f4b60-b680-4227-a787-370bf3942f27","name":"The Downland Alliance","code":"236","type":"lead_school","isAccreditedBody":false,"urn":"110102","ukprn":"10006654","address":{"addressLine1":"Downland Alliance - The Downs School","addressLine2":"Compton","town":"Newbury","county":"Berkshire","postcode":"RG20 6AD"},"contact":{"website":"http://downlandalliance.org.uk/","email":"itt@downlandalliance.org.uk","telephone":"01635 270096","fullName":"Teaching School Manager"},"location":{"latitude":51.512656,"longitude":-1.2537454},"trainWithUs":"This is a unique opportunity to train with a highly successful group of schools that make up our partnership, located in the beautiful county of West Berkshire but close to Oxford, Reading, Winchester and London. A wide spectrum of high achieving schools ensures a range of opportunities including a primary/secondary placement and 6th form experience for secondary trainees. The secondary in-school training is organised jointly by The Downs, Compton, St Bartholomew’s, Newbury, Kennet, Thatcham and Park House, Newbury. Our primary training is organised jointly by our primary partner schools - a full list is available on our website. The Downs School is the school direct lead school; it has been judged outstanding in all areas by Ofsted. Our courses lead to either QTS and PGCE or you can apply for QTS only - these professional qualifications are awarded by Oxford Brookes University so you get the best of both worlds – high quality school led training linked to a renowned higher education institution. Our training programme is just the first step on your career.\nThere is a complete programme of training offered in West Berkshire from Early Career Teacher to becoming a school leader, if you have the right skills. School-led courses have high rates of employment and, above all, of trainee satisfaction.\nEvery part of our programme is aimed at preparing you to be the best teacher possible. Immersion into the life of the teacher and daily exposure to outstanding practice ensures you have the best possible opportunity.","trainWithDisability":"We welcome applications from all sectors of the community including if you have a disability or other individual needs. We will make any necessary arrangements to help you attend your interview and reasonable adjustments to enable you to undertake your training. Please ensure you let us know by contacting our Teacher Training Manager for further information. Schools within the partnership have partial disabled access and Oxford Brookes University has full disabled access.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"66d7a620-e321-4149-9b28-fa5502ce365c","code":"O66","name":"Oxford Brookes University","description":"The School of Education at Oxford Brookes is one of the largest schools of education in the UK,\\r\\n\\r\\nThe university’s core belief is that education has the power to change lives and it is proud of its strong reputation for bringing this great gift to its students who will in turn work with children and adults to open up the world of learning and knowledge. \\r\\n \\r\\nOur partnership with The Downland Alliance is very well established. \\r\\n\\r\\nTogether we aim to educate excellent teachers to become agents of change, improving classroom practice for future generations."}],"createdAt":"2021-07-06T17:50:34.806Z","updatedAt":"2021-10-01T15:47:32.882Z"}
