{"id":"6083f93b-c11f-4c8d-b2b0-2a119ecab189","name":"North London New River Teaching Alliance","code":"1JV","type":"lead_school","isAccreditedBody":false,"urn":"137531","ukprn":"10034567","address":{"addressLine1":"Bidwell Gardens","county":"London","postcode":"N11 2AZ"},"contact":{"website":"http://www.nrta.co.uk","email":"info@nrta.co.uk","telephone":"0208 826 4914","fullName":"Iraj Felfeli"},"location":{"latitude":51.6007669,"longitude":-0.1371393},"trainWithUs":"The New River Teaching Alliance (NRTA) is a fantastic collaboration of North London schools with the collective goal of training the best teachers to join the profession. Working under the umbrella of North East London Teaching School Hub (NELTSH) and our awarding body UCL Institute of Education, we are well positioned to deliver some of the best teacher training in the world. Participants benefit from a unique school-based learning programme in partnership with a world-class university. This training route is referred to as 'School Direct'. Led by Alexandra Park School, all partner schools within the alliance have achieved 'Good' or 'Outstanding' Ofsted ratings and are conveniently located in North London. Our aim during the course is to create an environment in which staff, pupils and trainee teachers feel valued and supported. We have worked with trainee teachers for 15 years and fully recognise how much vibrancy, enthusiasm and drive they bring to a school community. By allowing trainees to engage with two schools during their training, we provide an opportunity to experience a diverse and contrasting range of teaching and learning styles. Our staff, are our most valuable resource and have a proven track record in training and professional development. All our partner schools have successfully developed new teachers for over a decade. This is demonstrated by a growing number of trainees choosing to embark on their new careers at these schools, upon completion of the course.\nOur mission statement is simple: 'Recruiting, supporting and developing the very best teachers’.","trainWithDisability":"Our University partner UCL IOE has full disabled access and a well-established Disability and Wellbeing team who provide support for students with a range of conditions. Every person is treated as an individual and you are invited to contact them as early as possible so that they can consider your needs and tailor their support to meet them.\nApplicants who would benefit from disabled access and arrangements should let us know on their application so that they can be considered for placements at the most appropriate schools.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"049fe65f-08dc-4686-9ac8-606dce490128","code":"G56","name":"Goldsmiths, University of London","description":""},{"id":"9188f17a-79c4-43a9-b459-4952815b739a","code":"M80","name":"Middlesex University","description":""},{"id":"7f11aaed-7c3e-42c5-af7a-023d33b45fa3","code":"U80","name":"UCL, University College London","description":"We work in partnership with UCL Institute of Education (UCL IOE) who have been providing first-class teacher training, in partnership with schools and colleges for over 100 years. \\r\\n\\r\\nFounded in 1902, as a teacher training college in London, the IOE is a world-class research and teaching institution. IOE graduates are highly sought after in schools and colleges throughout London and the UK.\\r\\n\\r\\nCentrally located in historic Bloomsbury means that you are in the heart of London. The London Underground station at Russell Square is minutes from the main building and King’s Cross, St Pancras and Euston stations are close by."}],"createdAt":"2021-07-06T17:46:50.839Z","updatedAt":"2021-09-20T22:40:38.505Z"}
