{"id":"60ac8dab-cb4f-41d9-8ea2-6a358655f71a","name":"The Radclyffe School","code":"2J1","type":"lead_school","isAccreditedBody":false,"urn":"105738","ukprn":"10016330","address":{"addressLine1":"The Radclyffe School","addressLine2":"Hunt Lane, Chadderton","town":"Oldham","county":"Greater Manchester","postcode":"OL9 0LS"},"contact":{"website":"https://theradclyffeschool.co.uk/","email":"fadenwala@theradclyffeschool.co.uk","telephone":"1616223200","fullName":"School Direct ITT Admissions"},"location":{"latitude":53.5455224,"longitude":-2.154479},"trainWithUs":"Our School is an Ofsted-rated Outstanding School and we are on a journey to ‘Beyond Outstanding’. On our journey of excellence, we are all learners. At The Radclyffe School our staff training programme is based on sound education research and aims to provide a range of high quality professional learning opportunities throughout the year, including weekly staff training incorporated into the school timetable. This means that our teachers have the opportunity to continue to develop their knowledge and confidence of learning and teaching strategies so that they can inspire and challenge our students. (https://theradclyffeschool.co.uk/)\nOur Mathematics and English Faculties have many advantages, including:\n- An ideal mix of colleagues within a diverse team of experienced staff, NQTs and RQTs, with each member of the team bringing their own individual personality and a wealth of knowledge and skills\n- Our talent is reflected in that we have a number of specialists in learning and teaching who have taken advantage of the whole school commitment to providing opportunities for developing leadership and excellence, including Excellent Teachers, Lead Teachers and Advanced Skills Teachers.\n- We believe in our school ethos of 'Working Together for Excellence' and constantly collaborate to share outstanding ideas and resources.\n- Our results are continually improving and compare favourably with national and local figures","trainWithDisability":"Disabled students make up over 15% of University of Manchester students, and the University are proud to offer an accessible and inclusive service.\n \nThe Disability Advisory and Support Service (sometimes called the DASS) supports a variety of different people, whether students, staff or supporters. The University of Manchester wants to help you succeed - in your studies, work, and the rest of your University experience.\n \nFor more information please see (www.dso.manchester.ac.uk)","accreditedBodies":[{"id":"9d03acb4-95ce-41e1-8458-0b4bec147b6b","code":"M20","name":"University of Manchester","description":"The University of Manchester is part of the prestigious Russell Group of universities and their research and teaching quality is recognised across the globe.\\r\\n \\r\\nWith an award-winning careers service and courses built with employability in mind, 94% of trainees from this provider find employment at the end of the course. \\r\\n \\r\\nThis School Direct route blends the expertise of staff at The Radclyffe School and this highly regarded university who are:\\r\\n \\r\\n- Rated as outstanding by Ofsted.\\r\\n- Best university provider of postgraduate teacher training in the North of England (The Good Teacher Training Guide 2017)."}],"createdAt":"2021-07-06T17:56:52.849Z","updatedAt":"2021-10-01T17:44:28.786Z"}
