{"id":"60ed0211-3bd3-404b-96d7-a9f719c612c3","name":"St Anthony’s Primary Learning Partnership","code":"1Y9","type":"lead_school","isAccreditedBody":false,"urn":"108021","ukprn":"10078651","address":{"addressLine1":"Barkly Road","addressLine2":"Beeston","town":"Leeds","county":"West Yorkshire","postcode":"LS11 7JS"},"contact":{"website":"http://www.stanthonysleeds.co.uk","email":"l.leonard@stanthonysleeds.org.uk","telephone":"0113 277 6944","fullName":"Lisa Leonard"},"location":{"latitude":53.7715538,"longitude":-1.562777},"trainWithUs":"The St Anthony’s Primary Learning Partnership provides an outstanding Catholic education for children from the four compass points of the city of Leeds and its neighbouring areas. The partnership contains schools with high percentage EAL (English as an additional language) children, and high pupil premium cohorts, alongside contrasting catchments with a high percentage of gifted and talented pupils. This in itself provides the opportunity to train in a diverse range of high-achieving schools, three of which are currently graded outstanding, with several others displaying outstanding features; all the rest being termed 'good' by Ofsted.\nThe Partnership has worked effectively in partnership with Leeds Trinity University for many years, providing outstanding training opportunities for teaching at primary level. The lead school has also previously been a partnership school for School Direct with another outstanding school in the city.\nWe provide high-quality training, mentoring and coaching, in a supportive and caring environment (trainee feedback tells us so). And since training began, all our graduates have achieved 100% employment. Our Teaching School Alliance is aspirational and aims to support and train outstanding teachers of the future.\nWorking closely with the National College for Teaching and Leadership we lead and share research that shapes and develops the future of education. Our investment in training teachers extends beyond Initial Teacher Training, and many of our trainees go on to complete our NQT and RQT programmes, often progressing to our higher-level leadership training.","trainWithDisability":"As we are in partnership with Leeds Trinity, we are able to offer all our Trainees extra academic and pastoral support. In addition, to help with diverse skills such as essay-writing or Maths and English training, St Anthony's trainees are able to use Trinity's Student Support Services to access support for a range of disabilities:\n* dyslexia or other specific learning difficulties\n* medical conditions\n* Asperger's syndrome\n* visual and hearing impairments\n* physical or mobility difficulties\n* mental health concerns​\nAll our Partnership schools along with the Trinity campus are accessible for those in a wheelchair or with limited mobility.\nThe Trinity Support Services are available during office hours, for one-on-one advice and support. Before joining a course they would very much welcome a discussion to decide how best to serve individual needs. They can be contacted using the following details:\n​​\n+44 (0) 113 283 7138 or (disability@leedstrinity.ac.uk.)","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"accreditedBodies":[{"id":"19a3446e-382d-4c14-83bb-a76563cef3c1","code":"L24","name":"Leeds Trinity University","description":"Leeds Trinity University gives you quality assurance as the leading regional provider in the country for teacher training.\\r\\n\\r\\nLeeds Trinity website \\r\\n\\r\\nLong established as one of the foremost providers of teacher training in the region, Leeds Trinity continues to support St Anthony’s in delivering outstanding Teacher Training Provision. For the School Direct course, Leeds Trinity will be delivering the academic components whilst at the same time ensuring that the quality of in-school provision is assured, meeting the high levels of practical and academic attainment that the university upholds."}],"createdAt":"2021-07-06T17:55:28.843Z","updatedAt":"2021-09-29T15:16:43.171Z"}
