{"id":"60f7e7de-aad1-4b67-bbbc-bf973e786d12","name":"Mercia Learning Alliance","code":"13C","type":"lead_school","isAccreditedBody":false,"urn":"138841","ukprn":"10068130","address":{"addressLine1":"King Ecgbert School","addressLine2":"Totley Brook Road","town":"Sheffield","county":"South Yorkshire","postcode":"S17 3QU"},"contact":{"website":"http://merciala.org.uk/","email":"enquiries@merciala.org.uk","telephone":"1142353855","fullName":"Jackie Arundale"},"location":{"latitude":53.320247,"longitude":-1.5371847},"trainWithUs":"Based in the vibrant city of Sheffield with its amazing facilities, transport links and access to the Peak District, Mercia Learning Alliance is a first class choice for graduates looking for a successful career in teaching. Our vision as Mercia Learning Alliance is to become a centre of educational excellence with a national reputation. Our ethos is that every professional in our alliance should strive to be the absolute best they can be. This places professional learning at the centre of all that we do and we see initial teaching training as integral to this. Mercia Learning Alliance offers aspiring teachers a broad range of opportunities across subjects and key stages. Working with The University of Sheffield (Secondary) and The Sheffield SCITT (Primary), with a wide range of postgraduate qualifications on offer, you will have the opportunity to carry out your training in some of the best schools in the country, learning from inspirational teaching staff who are leaders in their field. Our partnership schools are all committed to finding and developing their own teachers, therefore they are committed to their trainees. At Mercia Learning Alliance we want to ‘grow’ our own teachers, supporting you throughout your professional career from trainee all the way up to senior leader and beyond. We offer unrivalled choice in terms of type of school and location across Sheffield to train and work in, but we remain small enough to know every trainee as an individual enabling us to personalise training needs.","trainWithDisability":"As a student teacher at The University of Sheffield (Secondary) you will have full access to support if you have a disability or additional needs. Full information is available [here](http://www.shef.ac.uk/ssid/disability/index)\nWe work closely with all our school partners (Primary and Secondary) to ensure that your needs are met whilst on placement, offering support and adaptations where necessary. We encourage all our applicants to declare their disability on their application form and to discuss their requirements with us at interview. While disabled access to our schools is good we can only place trainees at the most suitable school to meet their needs if we know what those needs are.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"accreditedBodies":[],"createdAt":"2021-07-06T17:55:59.980Z","updatedAt":"2021-10-27T22:24:07.195Z"}
