{"id":"61484b90-d0fa-41a1-9695-e505591696fc","name":"Castle Hill School","code":"4C4","type":"lead_school","isAccreditedBody":false,"urn":"142420","ukprn":"10054655","address":{"addressLine1":"Newsome Road, South","town":"Huddersfield","county":"West Yorkshire","postcode":"HD4 6JL"},"contact":{"website":"https://www.penninealliance.org/itt","email":"alison.ley@castlehillschool.org.uk","telephone":"01484 544558","fullName":"Alison Ley"},"location":{"latitude":53.624622,"longitude":-1.78766},"trainWithUs":"Castle Hill School is the lead school of Pennine Teaching School Alliance. As a special school we are able to offer our trainees high quality placements within an SEND setting. We are working in partnership with other local SEND schools to ensure that you are provided with a broad experience of SEND during your time as a trainee teacher. Not only will you have the opportunity to train with in an SEND setting but you will also spend time on placement with one of our strong partner primary schools. All teachers that train with us will complete their training qualified to work as a mainstream Primary teacher or work within an SEND school. This route is ideal for all primary trainees that have in interest in supporting SEND or who have the aspirations to the be SENCos of the future. We are a small partnership, holding all of our training seminars in schools giving you real opportunities to experience the life of being a teacher. By being a part of a small cohort of trainee teachers we can ensure that we are able to provide personal, dedicated support. One size does not fit all. We are working closely with the University of Cumbria to be able to deliver this highly specialised programme. The University will provide the PGCE course content as face to face learning at Castle Hill School.","trainWithDisability":"As an SEND provider we are well equipped and experienced in supporting a range of needs. We will consider all applications based on their own merits and we actively welcome applications from suitable qualified individuals from all backgrounds, regardless of race, disability, religion, belief or sexual orientation. We would encourage our trainees to talk to us. We want to support you to become a successful teacher.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:48:24.439Z","updatedAt":"2021-10-04T18:23:42.492Z"}
