{"id":"6165f351-fb9e-4ef5-a638-6ce47fb757d3","name":"Gladesmore Community School","code":"1FW","type":"lead_school","isAccreditedBody":false,"urn":"102157","ukprn":"10002675","address":{"addressLine1":"Gladesmore Community School","addressLine2":"Crowland Road","town":"Tottenham","county":"London","postcode":"N15 6EB"},"contact":{"email":"jih@gladesmore.com","telephone":"2088000884","fullName":"Maggie Hulson"},"location":{"latitude":51.5808229,"longitude":-0.0660623},"trainWithUs":"The Gladesmore Community School Direct Partnership offers incredible opportunities for working and learning. It provides an ideal school based learning opportunity within excellent schools to train as a teacher. This inspirational partnership comprises thirty three schools, The Hub for Sport and Physical Education @ Kingston University and Middlesex University.\nWe have a straightforward and powerful vision:\nto provide an outstanding all round education where all students make impressive progress in a positive, friendly, family community atmosphere.\nThus, we create an environment in which staff, pupils and trainee teachers alike feel valued and supported. We have worked with trainee teachers for many years and we fully appreciate how their vibrancy, enthusiasm and drive contribute to the school community.\nOur school partnership is led by Gladesmore Community School, an outstanding school, and comprises a strong combination of urban schools serving catchment areas in different contexts.\nAs a partnership we provide a particular opportunity to experience a diverse and contrasting range of teaching and training experiences across a mixture of urban schools serving catchment areas in different contexts.\nStudents in all our schools are happy, friendly and well-behaved and are at the heart of everything we do. Both staff and students are ambitious and confident. Many consistently out-perform their national peers and make significantly more progress.","trainWithDisability":"Candidates who are offered a place must be certified as meeting national requirements for physical and mental fitness to teach, although this does not preclude disabled people from pursuing a programme of study","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:49:33.754Z","updatedAt":"2021-10-19T20:02:23.242Z"}
