{"id":"61878e05-5803-4a7c-986c-1ad0b48ffc87","name":"Teach Wimbledon","code":"1ZO","type":"lead_school","isAccreditedBody":false,"urn":"102683","ukprn":"10007190","address":{"addressLine1":"Crescent Road","addressLine2":"Wimbledon","town":"London","county":"Merton","postcode":"SW20 8HA"},"contact":{"website":"http://teachwimbledon.com","email":"teachwimbledon@uhsw.com","telephone":"7907574832","fullName":"Collette Farley"},"location":{"latitude":51.4151119,"longitude":-0.2238223},"trainWithUs":"About Us\nWorking alongside the University of Roehampton, University College London and St Mary's University, Teach Wimbledon leads an alliance and a unique School Direct partnership with 15 primary and secondary schools in Merton.\nOur Programme\nSchool Direct is a school-led route into teaching, which enables graduates to choose the school at which they complete their training year. The majority of our trainees obtain permanent employment at their placement school, or at another school within the Teach Wimbledon alliance.\nSchool Direct offers trainees the opportunity to spend most of their time in school from the very beginning, learning directly from experienced professionals. Trainees typically spend four days a week at their placement school, and one day at university. Upon successful completion of the course, trainees are awarded with a PGCE, QTS and 60 credits at Masters level.\nOur Schools\nPrimary Schools: Dundonald Primary School, Sacred Heart Catholic Primary School, St John Fisher RC Primary School, St Mary's Catholic Primary School, St Teresa's RC Primary School, St Thomas of Canterbury RC Primary School, The Priory Church of England Primary School, SS Peter & Paul Catholic School, St Mark's Primary School.\nSecondary Schools: Raynes Park High School, Ricards Lodge High School, Rutlish School, St Marks Academy, Ursuline High School, Wimbledon College.","trainWithDisability":"We welcome all applications and cater to the needs of all trainees according to individual requirements.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"33037eab-f75d-4350-b1e2-967c41e9d4c6","code":"R48","name":"Roehampton University","description":"Our School Direct teacher training programme is delivered in partnership with the University of Roehampton for the following subject(s): \\r\\n\\r\\nArt \\u0026 Design, Biology, Chemistry, Computing, Design \\u0026 Technology, Drama, English, Geography, History, Mathematics, MFL, Music, Physics, Physical Education, Religious Education."},{"id":"ef172d85-20e4-4aa2-96d0-9e3ae81f526d","code":"S64","name":"St Mary’s University, Twickenham","description":"Our School Direct teacher training programme is delivered in partnership with St Mary’s University for the following subject(s): \\r\\n\\r\\nPhysical Education."},{"id":"7f11aaed-7c3e-42c5-af7a-023d33b45fa3","code":"U80","name":"UCL, University College London","description":"Our School Direct teacher training programme is delivered in partnership with University College London for the following subject(s): \\r\\n\\r\\nBusiness Studies, Citizenship, Psychology, Social Sciences."}],"createdAt":"2021-07-06T17:54:32.582Z","updatedAt":"2021-09-27T20:26:33.166Z"}
