{"id":"624b09d2-36f0-4d34-8d12-275d584d9442","name":"The Rutland Learning Trust","code":"3N6","type":"lead_school","isAccreditedBody":false,"urn":"141454","ukprn":"10047605","address":{"addressLine1":"Main Street","town":"Whissendine","county":"Rutland","postcode":"LE15 7ET"},"contact":{"website":"www.rltschools.com","email":"hglassford@rltschools.com","telephone":"01664 474695","fullName":"Hazel"},"location":{"latitude":52.7205198,"longitude":-0.777598},"trainWithUs":"The Rutland Learning Trust is a partnership of schools spread across the Rutland and Northamptonshire area. Our shared vision is to provide outstanding education for all pupils – today and tomorrow! First-class education and care that allows every child to achieve their potential, regardless of location, prior attainment or background.\nOur Trust brings together a wealth of experience at all levels including those of National Leaders in Education. We work in close partnership with Nottingham Trent University through our successful School Direct Programme. We support each other to learn and develop. We support our students to gain employment and offer two placements during the year in two key stages to help with this.","trainWithDisability":"The Rutland Learning Trust is committed to promoting equality and diversity, providing an inclusive and supportive environment for all. Together with Nottingham Trent University, we will:\n* ensure that people are treated solely on the basis of their abilities and potential, regardless of race, religion or belief, age, gender reassignment, martial status or civil partnership, sexual orientation, disability, pregnancy or maternity, sex or any other inappropriate distinction;\n* promote diversity and equality for all staff and value the contributions made by individuals and groups of people from diverse cultural, ethnic, socio-economic and distinctive backgrounds; * promote and sustain an inclusive and supportive study and work environment which affirms the equal and fair treatment of individuals in fulfilling their potential and does not afford unfair privilege to any individual or group. If you have any specific questions, please contact the Rutland Learning Trust or visit the Nottingham Trent University support page.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"d2b7d074-fac9-42c5-a0d3-d5471b35f7d9","code":"N91","name":"Nottingham Trent University","description":"Nottingham Institute of Education at NTU is one of the foremost providers of education and training for teachers and other learning and development professionals. \\r\\nWe have extensive partnerships with educational settings across the area. Our latest Ofsted inspection praised these partnerships, recognising the strength of our links with local schools and the range of specialist placements for trainee teachers, giving them access to high-quality training.\\r\\n\\r\\nWe have a growing international reputation, but still retain a strong local presence: our staff work regularly with children and teachers in schools across the Midlands, helping to improve practice, raise standards, and change lives."}],"createdAt":"2021-07-06T17:51:32.250Z","updatedAt":"2021-10-04T18:06:19.543Z"}
