{"id":"628cb861-f9fb-4433-8cfc-9d176095119c","name":"The Royal Greenwich School Alliance","code":"185","type":"lead_school","isAccreditedBody":false,"urn":"100190","ukprn":"10006893","address":{"addressLine1":"Kidbrooke Park Road","addressLine2":"Kidbrooke","town":"London","county":"London","postcode":"SE3 9PX"},"contact":{"website":"https://rgtsa.uk/teacher-training/","email":"selliott@thomastallis.org.uk","telephone":"0208 856 0115","fullName":"RGTSA Secondary Hub Director"},"location":{"latitude":51.4657889,"longitude":0.026622},"trainWithUs":"The Royal Greenwich Teaching School Alliance is committed to providing world-class support for schools in Greenwich and beyond.\nWe are an alliance of strong and innovative schools, highly focused local authority support and universities (including the University of Greenwich and Goldsmiths University), collaborating to deliver excellent teaching and embed outstanding practice at all levels.\nhis programme is led by Thomas Tallis secondary school, will run for 36 weeks, and is available to high-quality graduates. Successful completion will lead to the award of a Postgraduate Certificate in Education (PGCE) and the award of Qualified Teaching Status (QTS). The programme comprises two elements; university-based teaching (with either the University of Greenwich or Goldsmiths University) and school-based experience. Practical teaching experience is gained in two main schools, where student teachers are allocated subject-specialist mentors who offer feedback and guidance. During both placements there is the opportunity to develop your subject teaching, supported by specialist teachers. As well as covering all aspects of the National Curriculum and addressing all relevant government standards, this programme helps trainee teachers to develop as effective teachers. Sessions with our University Partners cover a range of topics, including planning lessons, assessment of pupils and classroom management.\nWe offer the following subjects: Biology, Maths, MFL, Chemistry, Art & Design, Drama, English & Media, Design Technology, P.E., Physics, and Music.","trainWithDisability":"We welcome applications from students with additional needs for further details of support you can expect to receive please refer to: https://www.gold.ac.uk/students/disability-support/ We welcome applications from students with additional needs for further details of support you can expect to receive please refer to: https://www.gold.ac.uk/students/disability-support/ .","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:54:01.526Z","updatedAt":"2021-11-15T23:40:39.697Z"}
