{"id":"62d17cdf-cd81-4969-af49-abd98a8142ce","name":"Jurassic Coast Teacher Network","code":"172","type":"lead_school","isAccreditedBody":false,"urn":"113901","ukprn":"10006869","address":{"addressLine1":"The Woodroffe School","addressLine2":"Uplyme Road","town":"Lyme Regis","county":"Dorset","postcode":"DT7 3LX"},"contact":{"website":"https://www.woodroffe.dorset.sch.uk/jctn/","email":"jctn@woodroffe.dorset.sch.uk","telephone":"01297 442232","fullName":"Ms Beth Brooke"},"location":{"latitude":50.7302108,"longitude":-2.9488836},"trainWithUs":"The Jurassic Coast Teacher Network (JCTN) is a network for schools of all phases to work together to support and improve the expertise within each school. The JCTN is coordinated by The Woodroffe School, Lyme Regis and includes schools across West Dorset, East Devon and Somerset. We work in partnership with the local authorities, The University of Exeter and the Teaching School Hubs, providing a local link. There is also integration with curriculum hubs, including the Jurassic Maths Hub.\nThe Woodroffe School is an outstanding secondary school located in the middle of the Jurassic Coast, an area of outstanding natural beauty. Our consistent focus on pedagogy and outstanding learning and teaching leads to excellent progress for every student irrespective of starting point. By training with JCTN you will develop your skills as a teacher in schools that strive to deliver an outstanding learning experience for the pupils. You will gain a breadth of experience thus enabling you to start your career with confidence. There is considerable experience across the schools of working with trainee teachers and staff are keen to support those new to the profession.","trainWithDisability":"The University of Exeter provides comprehensive student services that include AccessAbility and Wellbeing teams, Student Learning Skills Service, Student Advice Unit, Counselling Service, Students’ Union Advisors, Student Health Centre, Family Centre and the Chaplaincy. For further details on the wealth of support available to you please go to Student Support Services (http://www.exeter.ac.uk/newstudents/supportandservices/yourhealthandwelfare/#a4)","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"accreditedBodies":[{"id":"d41a1821-e35b-48eb-bf02-4842872b04a2","code":"E84","name":"University of Exeter","description":"We work with The University of Exeter because they are leaders in Initial Teacher Education (ITE), consistently graded as outstanding in all areas by Ofsted. They recruit excellent trainees who relish the opportunity to gain a strong grounding in the field of education to complement their knowledge of the subject/s they teach, whilst gaining substantial experience in the classroom via the Exeter Model of ITE. The trainees are supported by excellent teachers in partner schools across the region, and by University tutors who are also experienced teachers and experts in their field including world-class educational researchers."}],"createdAt":"2021-07-06T17:49:17.949Z","updatedAt":"2021-10-04T21:15:00.676Z"}
