{"id":"62e4cde1-8489-4194-b004-e2d7e0d874eb","name":"Swindon Teacher Training Partnership","code":"2KD","type":"lead_school","isAccreditedBody":false,"urn":"137264","ukprn":"10034861","address":{"addressLine1":"Grange Park Way","addressLine2":"Grange Park","town":"Swindon","county":"Wiltshire","postcode":"SN5 6HN"},"contact":{"website":"https://sttp.org.uk/","email":"Gilbertj@lydiardparkacademy.org.uk","telephone":"1793874224","fullName":"Jo Gilbert"},"location":{"latitude":51.55799,"longitude":-1.84593},"trainWithUs":"The Swindon Teacher Training Partnership (STTP) comprises five schools and offers an exciting opportunity to train as a secondary school teacher with a ‘hands on’ approach. You will gain experience of the classroom environment from day one as you observe experienced practitioners and, under their mentorship, begin to develop your own teaching practice as you take on responsibility for planning and delivering lessons at a pace that suits you.\nAs part of a cohort of trainees, you will receive training in the fundamental aspects of teaching: how to manage behaviour for effective learning; how to plan lessons that maximise progress for pupils; how to effectively check for pupil understanding and provide intervention when necessary etc.\nThis in-school, practical experience, is underpinned by the academic expertise of the University of the West of England (UWE) who will deliver aspects of the core teacher training programme and guide you through the academic assignments that will lead to the PGCE qualification.\nSTTP is the only secondary training partnership based solely in Swindon. This means that your placement schools will be within the town at one of our five partner schools: [Lydiard Park Academy](https://www.lydiardparkacademy.org.uk/); [Abbey Park School](http://www.isambard.swindon.sch.uk/); [Commonweal School](http://www.commonweal.co.uk/); [St Joseph's Catholic College](http://www.stjosephs.swindon.sch.uk/) and [Highworth Warneford School](http://www.warnefordschool.org/). Within the partnership we can offer you experience of Sixth Form teaching and the opportunity to work with pupils that have additional needs. If you would like more information or to contact us directly, visit [STTP.org.uk](https://sttp.org.uk/). Applications close 30th June.","trainWithDisability":"We are able to provide full access and support for disabilities Please contact the STTP if you would like to discuss your specific needs and how we could support you.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"da8e5252-e14a-470a-8247-00b835a79010","code":"B80","name":"University of the West of England, Bristol","description":"UWE Bristol is in the top 10 universities in the UK for student satisfaction and has been awarded the highest possible rating in the Teaching Excellence and Student Outcomes Framework 2018. \\r\\n\\r\\nThe Guardian ranked UWE as 2nd in the UK for education in their 2020 university league table. UWE students are extremely positive about their experience and the faculty remain committed to providing a teacher training experience which enables trainees to graduate as skilled and thoughtful practitioners."}],"createdAt":"2021-07-06T17:51:15.705Z","updatedAt":"2021-09-23T16:21:09.444Z"}
