{"id":"63c6808b-9b6b-4508-a2b9-cf9a1ce6cb05","name":"Transforming Lives Educational Trust Initial Teacher Training (TLET ITT)","code":"1XO","type":"lead_school","isAccreditedBody":false,"urn":"136587","ukprn":"10058492","address":{"addressLine1":"Ashlawn School","addressLine2":"Ashlawn Road","town":"Rugby","county":"Warwickshire","postcode":"CV22 5ET"},"contact":{"website":"https://www.tlet.org.uk","email":"TeacherTraining@tlet.org.uk","telephone":"01788 573425","fullName":"Angela Greenway"},"location":{"latitude":52.3563555,"longitude":-1.2318286},"trainWithUs":"Transforming Lives Educational Trust Initial Teacher Training (TLET ITT) is a partnership of schools in Rugby, Coventry, Warwickshire, Northamptonshire and Leicestershire. Together we seek to provide teacher-training opportunities based in local schools with a common core of development opportunities focussed on the wider educational community. We create personalised training programmes with a breadth of experience and outstanding support to develop balanced well-rounded teaching professionals. At the heart of our alliance is the desire to provide learning communities where students can experience outstanding learning.\nOur School Direct programme is led by Ashlawn School, an outstanding bilateral secondary academy, which has an outstanding record of training teachers with experienced mentors across a wide range of primary age groups and secondary subjects.\n\"Any emails I sent were always responded to quickly and thoroughly\" 2020-21 DT\n\"I have learnt so much from my mentor in my host school this year – I am so thankful for them.\" 2020-21 Primary\n\"Very supportive department in Ashlawn School. Ashlawn School is very professional and treats their trainees as ‘’human-beings’’, provides appropriate advice when necessary and the quality of training and mentors provided is splendid.\" 2019-20 Maths\n\"Ashlawn Teaching School has been incredibly supportive and fundamental to the successful completion of my teacher training. Without their advice and support at vital times throughout the year, I would have struggled to stay on track and meet targets. \" 2018-19 History\n\"The teaching school facilitates individual learning needs for pedagogy in an outstanding manner.\" 2017-18 Art","trainWithDisability":"TLET ITT tailor our training process to the specific needs of each trainee and we work closely with our partner schools and universities to ensure this critical training year runs as smoothly as possible for each trainee's individual needs.\nIf you have a disability, including a specific learning difficulty, we strongly recommend you include this in your application form, so we can support you right from the beginning of the process.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:49:47.111Z","updatedAt":"2021-11-08T19:22:38.221Z"}
