{"id":"64069a76-35a8-4a50-bceb-1168d8ca32a8","name":"Teach South West (WeST)","code":"16U","type":"lead_school","isAccreditedBody":false,"urn":"113541","ukprn":"10032206","address":{"addressLine1":"Teach South West (WeST) Ivybridge Community College","addressLine2":"Harford Road","town":"Ivybridge","county":"Devon","postcode":"PL21 0JA"},"contact":{"website":"https://www.westst.org.uk/page/?title=Teach+South+West&pid=176","email":"admin@teachsw.co.uk","telephone":"01752 691000","fullName":"Amy Pearce"},"location":{"latitude":50.3930203,"longitude":-3.9182911},"trainWithUs":"Ivybridge Community College is a lead school for Teach South West within Westcountry Schools Trust (WeST).\nWeST are a partnership of high performing schools sharing our skills, experience, talent and capacity to help improve learning and achievement in schools across the South West both within and beyond our Trust.\nTeach South West is our Initial Teaching Training branch of WeST and offers Primary and Secondary (11-16 with Post-16 enhancement) School Direct training placements in English, Maths, Physics, Biology, Chemistry, History, French, Spanish, PE, RE and Primary . All our programmes (with the exception of Geography) are through an @Exeter model in partnership with The University of Exeter, delivered at The Graduate School of Education, St Luke's Campus, Exeter.\nWe always endeavour to place Teach South West trainees in schools that are agreeable to their circumstances and offer a breadth of experience; promoting future employability, hopefully within our Trust and/or local area of schools.\nTeach South West trainees have access to high quality CPD available within the WeST Training School and are supported in finding the right post for their ECT (Early Career Teacher) years following their PGCE year.\nPlease review our website for more details or to come on a Taster Event, https://www.westst.org.uk/page/?title=Training+events&pid=188&action=saved","trainWithDisability":"The University of Exeter provides comprehensive student services that include AccessAbility and Wellbeing teams, Student Learning Skills Service, Student Advice Unit, Counselling Service, Students’ Union Advisors, Student Health Centre, Family Centre and the Chaplaincy. For further details on the wealth of support available to you please go to [Student Support Services](http://www.exeter.ac.uk/newstudents/supportandservices/yourhealthandwelfare/#a4)\nPGCE trainees can access the support of a Wellbeing Services Welfare Caseworker to discuss concerns, talk through options for support or understand more about how the University Wellbeing Services may be able to help.\nAlongside the support described above, every PGCE trainee is assessed by an Occupational Health provider as part of the admissions process to ensure they are fit to teach in a school setting. If the Occupational Health provider recommends any adjustments, the University’s Partnership Office will ensure you are placed in schools where these adjustments can be made, providing they are logistically possible and reasonable.\nWe always seek to support teachers for whom special educational needs could be a barrier to teaching. We will openly discuss the accessibility of our courses and indeed various partner schools in terms of training.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:55:58.625Z","updatedAt":"2021-10-04T20:13:53.971Z"}
