{"id":"6439adcc-af64-4d3d-a1da-de045755db06","name":"University of Reading","code":"R12","type":"hei","isAccreditedBody":true,"ukprn":"10007802","address":{"addressLine1":"Admissions Office","addressLine2":"Miller Building","town":"Whiteknights","county":"Reading","postcode":"RG6 6AB"},"contact":{"website":"http://www.reading.ac.uk/education","email":"teachertraining@reading.ac.uk","telephone":"0118 378 5289","fullName":"Ms Vanessa Combeer"},"location":{"latitude":51.4414205,"longitude":-0.9418157},"trainWithUs":"The Institute of Education (IoE) at the University of Reading is an established provider of high-quality teacher training and research in education. The impact of our research and the breadth of our experience feeds directly into everything we do and the world around us.\nTrain with us and have a direct and positive impact on the lives of young people. In our latest Ofsted inspection in 2016 all our teacher training courses were rated 'Good'. We are currently ranked 10th in the UK for Education in the Guardian University League Tables 2022.\nOur networks and the impact of our work are both local and global. Locally, we have well-established partnerships with over 400 schools, who we work closely with to train the next generation of outstanding teachers. Globally, our research, consultancy and other projects extend to countries as varied as China, Jamaica, the USA and Singapore. In the latest national assessment, the Research Excellence Framework (REF) 2014, 80% of our research outputs were rated world leading or internationally excellent, positively impacting educational policy and practice. At the Institute of Education we have the research, the expertise and the passion to help others grow into engaged and active citizens; individuals with resilience and the confidence to tackle challenges.","trainWithDisability":"The University of Reading welcomes disabled students and has a dedicated Disability Advisory Service. The service offers advice and guidance to students with any disability, mental health condition, or specific learning difficulty (SpLD).\nIf you have not yet told the University about your disability, or have not disclosed it on your application, you can discuss the implications of a disclosure in complete confidence, with one of our disability advisers.\nWe offer support, advice and guidance with:\n- physical disabilities e.g. mobility\n- sensory disabilities e.g. visual impairments\n- mental health difficulties e.g. anxiety\n- medical conditions e.g. Irritable Bowel Syndrome, diabetes\n- autism/Asperger Syndrome\n- SpLDs e.g. dyslexia, dyspraxia DAS may be able to assist in study related support in the following ways:\n- Disability Advisory Service (DAS) may assess the impact of your disability on your studies and recommend any reasonable adjustments required\n- Provide information on funding for study support, including the Disabled Students Allowance and how to apply.\n- Liaise with your Department/Schools/Hubs including Senior Tutors and Disability Representative on reasonable adjustments, including extensions to deadlines and alternative modes of assessment where appropriate.\n- Flag students (with permission) in order that tutors are made aware of individual requirements.\n- The Disability Advisory Service can provide assistance on arranging non- medical helpers e.g. one to one support arrangements such as mentors and specialist study skills. - Liaising with the exams office re special exam arrangements\n- Referral and signposting to other services","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"createdAt":"2021-07-06T17:52:55.916Z","updatedAt":"2021-10-04T21:51:04.438Z"}
