{"id":"64723880-1d2f-478b-8399-9470ad4e404a","name":"BEP Teaching and Learning Alliance","code":"18P","type":"lead_school","isAccreditedBody":false,"urn":"138818","ukprn":"10038984","address":{"addressLine1":"Bradgate Education Partnership","addressLine2":"Merton Primary School, Cherry Avenue","town":"Syston, Leicestershire","county":"East Midlands","postcode":"LE7 2PT"},"contact":{"website":"https://bepschools.org/","email":"admin@leics-scitt.co.uk","telephone":"0116 254 3187","fullName":"Shelagh Thomson"},"location":{"latitude":52.6910511,"longitude":-1.0696943},"trainWithUs":"The Merton Primary School is the lead school for the School Direct route at STEP Teaching School Alliance (TSA). Our programme is delivered by [Leicester and Leicestershire SCITT]( http://www.leics-scitt.co.uk) (L&L SCITT) providing trainees with invaluable classroom experience enabling them to become effective and confident primary teachers.\nSTEP is an innovative alliance of primary and secondary schools working across Leicester, Leicestershire and surrounding areas. As a diverse partnership of schools in rural and urban settings we work collaboratively to improve outcomes for our children. We provide high quality, inspirational opportunities to develop and enthuse existing teachers and those new to teaching.\nWe work in close partnership with the L&L SCITT, an Outstanding ITT provider, in the design of this School Direct programme. STEP trainees on this route benefit from following the full SCITT training programme. All school placements are in SCITT partner schools with at least one being in a STEP school.\nThe L&L SCITT has been consistently rated by [Ofsted](https://reports.ofsted.gov.uk/inspection-reports/find-inspection-report/provider/ELS/70163) as Outstanding since 2009. In the most recent [`Good Teacher Training Guide’]( https://www.buckingham.ac.uk/wp-content/uploads/2017/04/GTTG17fin.pdf) the SCITT is in the top five ITT providers nationally, being the top primary provider in the East Midlands. Trainees gain an internationally recognised PGCE, worth 60 Masters level credits, awarded by the University of Leicester, alongside QTS.\nMany students that have completed the STEP School Direct programme go on to gain employment in one of our schools. They benefit from access to our high quality NQT and professional development programmes, providing continued support throughout their career.","trainWithDisability":"Education and training providers have a duty under the Equality Act 2010 to anticipate the adjustments that disabled students may need. The SCITT is committed to actively promoting equal opportunities in employment and to encouraging participation by disabled people in public life. If you would describe yourself as having a disability, in accordance with the Equality Act (2010), and need any adjustments made to promote equality of opportunity, please contact us, as soon as possible, so we can discuss your requirements. The best place for you to do this is on your UCAS form. However, you can also do it at any time during your studies, either by telling a member of SCITT Management. As we are partnered with the University of Leicester, our students can access the Student Support Services offered. The AccessAbility Centre offers support and advice for students with dyslexia or other specific learning difficulties as well as working with students who have sensory disabilities, mobility difficulties; mental health conditions and autism. The Centre offers study skills support. [The AccessAbility Centre](https://www2.le.ac.uk/offices/accessability)","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:56:16.781Z","updatedAt":"2021-10-01T22:54:22.438Z"}
