{"id":"64a4ec61-9a69-4391-accb-ce8e2095005f","name":"University of Cambridge","code":"C05","type":"hei","isAccreditedBody":true,"ukprn":"10007788","address":{"addressLine1":"Faculty of Education","addressLine2":"184 Hills Road","town":"Cambridge","county":"Cambridgeshire","postcode":"CB2 8PQ"},"contact":{"website":"http://www.educ.cam.ac.uk/pgce/","email":"pgce-admissions@educ.cam.ac.uk","telephone":"01223 767674","fullName":"Faculty of Education"},"location":{"latitude":52.1866982,"longitude":0.1368386},"trainWithUs":"The Faculty of Education provides high quality courses in both the Primary and Secondary age-range. Our trainees are always in demand from headteachers and many of our ex-trainees go on to positions of school leadership very quickly. We consistently receive outstanding feedback from our trainees on course evaluations. We are delighted to be ranked as the number one teacher training provider in England in the 2017 Good Teacher Training Guide. School colleagues are involved in all aspects of the course from interviewing through to Faculty course teaching.\nOur outstanding benefits are:\n* Well-established and diverse school partnerships * Exceptional employment rates * The stimulation of being a part of a group of high-attaining future leaders in education\n* Expert staff - experienced teachers and research active subject specialists in the Faculty * An intellectual and social hub to live in, comprising College life in the dynamic city of Cambridge\nThe PGCE courses are assessed at Masters level and trainees who successfully complete all examined elements of the Cambridge PGCE course can apply to undertake the part-time Master of Education (MEd) in just one year.","trainWithDisability":"The Faculty is committed to equal opportunities for all and to the provision of support for students with a disability and aims to ensure that no present or prospective student receives less favourable treatment than another on grounds of any condition or status not directly affecting study or work.\nThe University's Disability Resource Centre works with the Faculty to provide support to trainees throughout the PGCE course.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"createdAt":"2021-07-06T17:55:35.546Z","updatedAt":"2021-10-26T20:13:53.766Z"}
