{"id":"6643e438-3bed-40c1-9ab3-755e8d7c1177","name":"Elmridge Primary School","code":"1V4","type":"lead_school","isAccreditedBody":false,"urn":"138654","ukprn":"10038585","address":{"addressLine1":"Elmridge Primary School","addressLine2":"Wilton Drive","town":"Hale Barns","county":"Cheshire","postcode":"WA15 0JF"},"contact":{"website":"https://elmridgeteachingschool.co.uk/initial-teacher-training/","email":"teachingschool@elmridge.trafford.sch.uk","telephone":"1619804941","fullName":"Jayne Carmichael"},"location":{"latitude":53.3671921,"longitude":-2.311577},"trainWithUs":"Elmridge Primary School (https://elmridgeteachingschool.co.uk/) is passionate about shaping the minds of the future.\nAs a long term provider, Elmridge is at the forefront of school-led Initial Teacher Training and is uniquely placed to deliver innovative training opportunities. One of the most empowering routes into teaching is the School Direct route. It offers the opportunity to learn with and from a team of professionals in an inspirational and dedicated alliance. Due to strong partnerships, working across an alliance of schools, Elmridge School Direct trainees have an outstanding record since its School Direct programme began in September 2014:\n* 100% employed in readiness for start of the new school year upon completion of the course\n* 100% of trainees successfully completed the programme\n* 89% graded as ‘Outstanding’\nElmridge and its alliance partners, working together, have combined their expertise to continue to deliver the School Direct programme into 2021-22. This will be the alliance’s 8th year of delivering its very successful School Direct Programme. The diverse representation of schools within the alliance offers a vast range of experiences giving trainees the opportunity to learn and excel.\nThis School Direct programme is a full-time, primary, unsalaried programme running from September to June.","trainWithDisability":"Teachers with disabilities make an important contribution to schools in both the classroom and in shaping the wider culture and ethos of the schools they work in. Schools within the Elmridge Primary School and its alliance value diversity and the unique contribution that all their staff and trainees make. If you have a disability please do not be dissuaded from applying. Whilst it is a personal choice, informing us of your disability has the advantage of enabling support and reasonable adjustments to be put in place. We encourage you to contact us (https://elmridgeteachingschool.co.uk/contact-us/) to discuss how we can support you.","accreditedBodies":[{"id":"812b70c4-7fc4-46fc-975b-3e4d00f77dc4","code":"M40","name":"Manchester Metropolitan University","description":"This is a year-long school-based training programme that will lead to both a Postgraduate Certificate in Education (PGCE) and Qualified Teacher Status (QTS). It embodies a collaborative approach, enabling trainees to connect with experienced school-based professionals, whilst also receiving guidance from The Manchester Metropolitan University (MMU) education faculty and staff. The training will be delivered jointly by MMU and by expert teachers from alliance schools."}],"createdAt":"2021-07-06T17:53:03.785Z","updatedAt":"2021-07-06T17:53:03.785Z"}
