{"id":"66d7a620-e321-4149-9b28-fa5502ce365c","name":"Oxford Brookes University","code":"O66","type":"hei","isAccreditedBody":true,"urn":"133864","ukprn":"10004930","address":{"addressLine1":"Headington Road","addressLine2":"Headington","town":"Oxford","county":"Oxfordshire","postcode":"OX3 0BP"},"contact":{"website":"https://www.brookes.ac.uk","email":"admissions@brookes.ac.uk","telephone":"01865 484 848","fullName":"PGCE Course Admissions"},"location":{"latitude":51.755011,"longitude":-1.224225},"trainWithUs":"You'll join and take an active part in an inclusive teaching community. We promote lively, informed debate on education through our seminar and lecture programmes. We have connections to over 600 UK schools and international partnerships. Working together as a major contributor to the improvement of education and learning. Teaching staff have expertise and experience in a wide range of educational settings. Including specialist knowledge of the primary curriculum. Tutors include:\n* Former head teachers\n* ICT education experts\n* SEN specialists. You'll join a supportive and collaborative educational culture. You'll gain practical skills and academic theory to become an outstanding teacher. You'll have the opportunity to meet and chat to leading educational researchers. Your school placement will be set up by our teaching partnership. And once you've qualified you'll have further opportunities - to keep up with the latest initiatives in the world of education. Through our continuing professional development courses.","trainWithDisability":"[The Wellbeing team](https://www.brookes.ac.uk/students/wellbeing/) aims to enhance the learning, emotional, physical and spiritual life of the university community.\nLearning support includes:\n* Your personal academic adviser:\nYou'll have an academic staff member assigned to you through your studies from beginning to end. They are extra to the academic guidance provided within your programme. And are here to support your learning.\n* Student support coordinators: They are here to help you with any problem or issue you may encounter during your time at Oxford Brookes. You can go to them with personal issues as well as academic, and no problem is too small or too big for their advice.\n* Specialist dyslexia and disability advisers: One-to-one study skills support. As well as further advice and support for students with specific learning difficulties and disabilities or medical conditions.\n* Academic liaison librarians: The librarians offer guidance and support to help you access the resources you need.\n* English language support: A free service providing English language support to International and EU students. Whose first language is not English.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"createdAt":"2021-07-06T17:48:47.912Z","updatedAt":"2021-09-24T17:42:47.892Z"}
