{"id":"66de4cd1-c2d1-4d65-bbeb-d9a1d7377e56","name":"Heckmondwike Grammar School","code":"1NZ","type":"lead_school","isAccreditedBody":false,"urn":"136283","ukprn":"10031356","address":{"addressLine1":"High Street","addressLine2":"Heckmondwike","town":"Kirklees","county":"West Yorkshire","postcode":"WF16 0AH"},"contact":{"website":"http://www.heckgrammar.co.uk","email":"nstokoe@heckgrammar.co.uk","telephone":"1924402202","fullName":"Dawn Newton"},"location":{"latitude":53.7081867,"longitude":-1.6686262},"trainWithUs":"Heckmondwike Grammar School (HGS) is a leading provider for the School Direct teacher training scheme. We have extensive experience of school-based initial teacher training, which allows us to provide high quality teacher training experiences that will prepare you for a new and exciting career in education.\nHGS is a high achieving school composed of high ability children; approximately 1500 pupils including 600 in the sixth form. Our results are recognised as the highest in the Kirklees and Calderdale area. Ofsted judged the school to be outstanding during their last visit and the national and local press regularly include us in their lists of the UK's high-performing schools. In The Sunday Times Schools Guide 2020, Heckmondwike Grammar School was identified as one of the top ten state secondary schools in the North of England based on GCSE performance. We have a long established track record of training teachers and working with higher education institutions; we recognise the benefits that trainees can offer schools. We provide a unique school-based learning opportunity in partnership with the Kirklees and Calderdale SCITT and in conjunction with Huddersfield University. Your mentor will be a highly qualified teacher in your chosen subject specialism with subject knowledge and exam board specification experience unrivalled by any lecture-based teaching provider. You will become equipped with a toolbox of strategies, techniques and professional practices, specific to your subject, to become an outstanding teacher of tomorrow.","trainWithDisability":"Heckmondwike Grammar School is committed to Equality and Diversity. All schools where trainees are placed have clearly established policies, processes and systems that are closely monitored to ensure all trainees are suitably catered for and supported. For those trainees with specific needs, a bespoke approach is employed to ensure there are no barriers to learning.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"74d0e1b3-80ac-4a0e-b93d-f19cb6587144","code":"1WK","name":"Kirklees and Calderdale SCITT","description":"Kirklees \\u0026 Calderdale SCITT are an established and successful teacher training provider and have been training teachers across West Yorkshire since 2003, rated ‘Good’ in our Ofsted Inspection in 2015.\\r\\n\\r\\nAs a trainee you will benefit from experienced mentors in school, supporting you on a daily basis. This runs alongside highly regarded tutors who ensure your training year is a positive and successful experience in becoming a qualified teacher.\\r\\n\\r\\nYou will be based in school for four days and will spend one day at our central base for the core programme each week to ensure you develop as effective teachers."}],"createdAt":"2021-07-06T17:57:18.119Z","updatedAt":"2021-07-16T19:07:35.733Z"}
