{"id":"67348035-1b30-4e98-9570-7c0cd3113ffa","name":"The Basingstoke Alliance SCITT","code":"B17","type":"scitt","isAccreditedBody":true,"ukprn":"10034865","address":{"addressLine1":"The Basingstoke Alliance Scitt","addressLine2":"Dove House School, Sutton Road","town":"Basingstoke","county":"Hampshire","postcode":"RG21 5SU"},"contact":{"website":"http://www.basingstokealliancescitt.com","email":"krichens@dovehouseacademy.com","telephone":"01256 351555","fullName":"Nicky Hepworth"},"location":{"latitude":51.2748008,"longitude":-1.0869765},"trainWithUs":"https://www.basingstokealliancescitt.com/\nOur vision is to train human-first teachers in the latest research informed pedagogy, to provide the local community with passionate and confident teachers who enhance the life chances of our children.\nTeaching secondary education is a challenging and hugely rewarding profession. Teachers transform children and young people’s lives, “making a real difference”. The process of becoming a successful teacher is a complex one and requires support and training of the highest quality, which we are proud to offer.\nThe most significant advantage of school-based training is that, from day one, you are in a secondary school environment, acquiring the knowledge and skills required for effective teaching.\nThe most important elements of our training programme are that:\n1. We recognise that relationships and human-first teaching are paramount to success in the classroom and;\n2. We use the latest research, particularly focused on cognitive load theory, to inform how we prepare our trainees for teaching.\nYou'll be in placements supported by experienced, skilled and committed practitioners.\n‘High quality mentoring and coaching is at the heart of this process, with professional/subject mentors who have been trained to a high level by the BASCITT in order to unlock your potential’ Trainee teacher.\nWe educate the ‘whole trainee’ to educate all children through the development of highly professional and reflective teachers who are fully versed in practical experience, underpinned by relevant educational research and theory.\nPartnership school’s professional themes programmes provide trainees with an opportunity to develop their knowledge and application of SEN.","trainWithDisability":"We are mindful of equality and diversity and support our own trainees with specific needs. We have systems and processes in place to support trainees with for example dyslexia, dyspraxia, mental health as well as physical conditions. A strength of our provider is how we treat trainees as individuals and will provide excellent support to ensure their success.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:47:19.073Z","updatedAt":"2022-01-25T23:29:09.223Z"}
