{"id":"677d370a-3abf-429d-8fb4-b32438cbcec7","name":"St Mary’s College","code":"1RU","type":"lead_school","isAccreditedBody":false,"urn":"144104","ukprn":"10063694","address":{"addressLine1":"St Mary’s College","addressLine2":"Cranbrook Avenue","town":"Hull","county":"East Yorkshire","postcode":"HU6 7TN"},"contact":{"website":"www.schooldirecthull.co.uk","email":"schooldirect@smchull.org","telephone":"01482 808807","fullName":"Jonathan Boden"},"location":{"latitude":53.7753261,"longitude":-0.3631925},"trainWithUs":"St Mary’s College has been training outstanding teachers for many years. The college provides an ideal training environment thanks to our strong reputation for academic excellence, student achievement, quality pastoral care, and high standards of student behaviour. We are proud to have been rated 'outstanding' by Ofsted, and recognized as a Regional Teaching School Hub, National Support School and World-class school. St Mary’s College is the lead secondary school for Hull SCITT (School Centred Initial Teacher Training). Our partnership consists of other Hull secondary schools as well as the seven Catholic primary schools in Hull, which form St Cuthbert’s Catholic Academy Trust, so we are able to offer courses in Early Years and general Primary teacher training, as well as the full range of secondary subjects. Our schools provide a supportive and caring environment in which to train. St Mary's College and the other Trust schools have a Catholic ethos, and, whilst we welcome applications from people with any faith background (or none), you will notice that the atmosphere of tolerance, respect, forgiveness and reconciliation provides both staff and students with the ideal conditions for personal, academic and professional development. We also offer excellent facilities. All four secondary schools in our partnership - St Mary's College, The Marvell College, Kelvin Hall School and The Boulevard Academy - have benefited from multi-million-pound investment and boast state-of-the-art facilities which provide students and staff with excellent learning and working environments and access to the latest technology.","trainWithDisability":"St Mary's College and our St Cuthbert Trust primaries are fully accessible for wheelchair users with disabled parking bays, ramps, lifts and toilet facilities. Reasonable adjustments to our internal literacy and numeracy tests for extra time or other adaptations will be made for applicants with identified needs. Further details will be provided on request. We are fully committed to ensuring equal opportunities and have a successful track record of training previous applicants with dyslexia, or physical, medical and mental health conditions. It is important to discuss your requirements with us so that we can best gauge how to support you during the application process.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"bed96ffb-ddf2-4d78-a6cf-13b533b714df","code":"25O","name":"Hull SCITT","description":"St Mary’s College School Direct programme is quality assured and accredited by Hull SCITT, an ITE provider that, since its establishment in 2015, has established a strong reputation “for training high-calibre teachers who are well prepared for the demands of a teaching career.” [Ofsted, 2017] \\r\\n\\r\\nLed by the Hull Collaborative Academy Trust, Hull SCITT works in partnership with over 30 schools in the city with an absolute commitment from all partners to its mission to grow future teachers and leaders for Hull’s schools. The SCITT’s success is evident in the high employment rates for its trainees in the region."}],"createdAt":"2021-07-06T17:48:02.529Z","updatedAt":"2021-09-28T15:25:29.258Z"}
