{"id":"6790c223-2102-460a-afb9-0dffeb0ce142","name":"Kirkby Primary Partnership","code":"279","type":"lead_school","isAccreditedBody":false,"urn":"122717","ukprn":"10069280","address":{"addressLine1":"School Street","town":"Kirkby in Ashfield","county":"Nottinghamshire","postcode":"NG17 7BT"},"contact":{"website":"https://www.ntu.ac.uk/study-and-courses","email":"kwhitehouse@morvenpark.notts.sch.uk","telephone":"01623 459395","fullName":"Mark Watson"},"location":{"latitude":53.0992786,"longitude":-1.2415442},"trainWithUs":"Kirkby Primary Partnership schools are based in the Kirkby-in-Ashfield area of Nottinghamshire. They are a close knit family of schools who have, in their most recent Ofsted inspections, been graded as Good or Outstanding schools. Children at our schools are enthusiastic learners, who thrive on the stimulation of a creative and exciting curriculum. Students who train with us will be given the opportunity to facilitate this curriculum by working with experienced professionals in each school. You will be given the opportunity to develop your teaching skills through; observing excellent practitioners, working with experienced teachers and practicing your own teaching skills in a supportive environment. The aim of the partnership schools is to develop the potential of students to meet the Teacher's Standards at the highest level, classroom observations and weekly target setting and progress meetings.\nKirkby Primary Partnership looks forward to receiving your applications.","trainWithDisability":"Schools in the partnership have not yet benefited from training a student with a disability. It’s a personal choice if you want to inform us and/or NTU of your disability. However, the advantage of disclosure is that it enables support to be put in place and applications to be made for any extra funding available or for specialist equipment.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"d2b7d074-fac9-42c5-a0d3-d5471b35f7d9","code":"N91","name":"Nottingham Trent University","description":"NTU is an established and successful provider of initial teacher-training and education-related courses. Staff at our school work with the experienced researchers and practitioners at the University to design and deliver our courses which can be tailored to meet your individual needs. These courses carefully blend significant hands-on teaching experience in our schools with the critical thinking and theoretical underpinning that is so important for the teaching profession. \\r\\nNational surveys show that NTU’s trainee teachers highly recommend their course, and over 9 out of 10 are employed in a teaching role in the year following graduation, above the national average."}],"createdAt":"2021-07-06T17:52:00.704Z","updatedAt":"2021-09-16T22:54:13.819Z"}
