{"id":"67acf977-b01b-4e10-9477-d8ed789caad6","name":"The Beckfoot School Direct Partnership","code":"1MU","type":"lead_school","isAccreditedBody":false,"urn":"139975","ukprn":"10059960","address":{"addressLine1":"Wagon Lane","addressLine2":"Bingley","town":"Bingley","county":"West Yorkshire","postcode":"BD16 1EE"},"contact":{"website":"http://www.beckfoot.org","email":"schooldirect@beckfoot.org","telephone":"1274771444","fullName":"Beckfoot School"},"location":{"latitude":53.8407624,"longitude":-1.8276571},"trainWithUs":"At Beckfoot, our school motto is “Enjoy - Learn – Succeed”. Our students are at the heart of all we do, and we want to train teachers who are committed to these values.\n\nThe Beckfoot School Direct Partnership is a collaboration between all schools in the Beckfoot Trust (Primary, Secondary and Special), and Immanuel College. All schools are located within a 20 minute drive of Beckfoot, making planning and experiencing placements easier.\n\nBeckfoot was rated “Outstanding” in all areas by Ofsted, and working alongside Leeds Trinity University, Leeds Beckett University and Bradford Birth-19 SCITT, we take a lead role in delivering exceptional teacher training, supported by a clear vision and a powerful ethos that every single student can achieve great things.\n\n[Click Here to Visit our Website] (http://www.beckfoottrust.org/?page_id=3905)","trainWithDisability":"The Board is opposed to any discrimination against any person with a disability, based on assumptions of their ability or otherwise to carry out the duties of the post to which they were appointed in school.\nWhere applicable, all candidates with disabilities who meet the basic essential criteria for a post will be\ninterviewed.\n\nUnder the Equality Act 2010, reasonable provision will be made for adjustments to a member of staff’s working conditions or environment for any person with a disability appointed to a post in school, where the adjustments are reasonably practicable","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"accreditedBodies":[],"createdAt":"2021-07-06T17:51:13.422Z","updatedAt":"2021-09-23T17:00:28.036Z"}
