{"id":"681eb343-0ed5-4f82-8bdf-6a4934f6e39e","name":"Wren Academy","code":"19V","type":"lead_school","isAccreditedBody":false,"urn":"135507","ukprn":"10024205","address":{"addressLine1":"Hilton Avenue","town":"London","postcode":"N12 9HB"},"contact":{"website":"http://www.wrenacademy.org/","email":"admin@teachinglondon.org","telephone":"2079321126","fullName":"John Keohane"},"location":{"latitude":51.612949,"longitude":-0.1672989},"trainWithUs":"Our success is underpinned by a close and inclusive community with a strong Christian ethos. Wren Academy is an all-through academy (3-18) where everybody matters and each individual is celebrated for all their gifts and talents. It is important to us that all children make the best progress possible, regardless of their academic starting point, and this is reflected by exceptional academic success. The social dimension to education matters as much to us as academic achievement. We want our students to be happy, confident and secure so that they can make the most of all the opportunities they are given. The relationships between staff and students, and between students themselves, are excellent. Our ethos enable children to flourish in a disciplined yet caring environment which balances responsibilities and privileges. Trainee teachers are equally encouraged and flourish here.","trainWithDisability":"Wren Academy is fully accessible for people with physical disabilities. Although the academy is large, movement between buildings is helped by automated doors and ramps instead of steps. Doorways are wide and wheelchair users are able to access each classroom. Within each building there is a lift. Staff with a physical disabilities have priority parking on site. We are happy to discuss and accommodate any further access requirements required.\nTeaching London: LDBS SCITT has a degree of step-free access, but as the building was a Victorian school, we are unable to fully accommodate wheelchair access. We are always willing to discuss, and where possible, adapt to meet individual needs.\nThe well-being of our trainees is paramount, which is why you will be automatically enrolled into the Employee Assistance Programme with the Education Support Partnership. This provides 24/7 individual support and counselling, in addition to our in-house advice and support.\nWe also have experience in supporting trainees with a diagnosis of dyslexia and are able to offer specialist support on the course.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:56:45.396Z","updatedAt":"2021-07-28T01:21:27.193Z"}
