{"id":"68471e66-c04d-411c-ae0f-cd02f9aa74d3","name":"Black Pear Trust Alliance","code":"2HC","type":"lead_school","isAccreditedBody":false,"urn":"140933","ukprn":"10060754","address":{"addressLine1":"Black Pear Trust Alliance","addressLine2":"Hollymount School","town":"Hollymount Road","county":"Worcester","postcode":"WR4 9SG"},"contact":{"website":"https://www.hollymountschool.org/","email":"ITT@blackpeartrust.org","telephone":"190523159","fullName":"Head of Admissions"},"location":{"latitude":52.2010953,"longitude":-2.2002866},"trainWithUs":"There are five schools within the Black Pear Alliance, located in Worcester, Droitwich, Pershore, Evesham and Kidderminster. The training you receive here will cover a wide spectrum of teaching strategies enabling you as a teacher to address many different needs.\nWe provide students with a comprehensive package which is tailored to their individual need. We do this through layered CPD: whole group sessions, smaller focus groups and individually tailored coaching/mentoring.\nWithin our alliance we have a spectrum of schools including faith schools, first , nursery and primary schools which are situated in different types of areas. Two schools are in SOA which ensures that all students meet a wide variety of pupils.\nWe are a lead AfA school and Sonia Blandford noted our strong practice in working with children from disadvantaged backgrounds. In addition we have experienced mentors to support you on your journey to become a teachers and several Specialist Leaders in Education working within the alliance.","trainWithDisability":"The Black Pear Trust Alliance are committed to ensuring equality of opportunity for all pupils, staff, parents and carers irrespective of race, gender, disability, belief, sexual orientation, age or socio-economic background, in line with the Equality Act 2010.\nSupport is given to students, when needed, with both academic and pastoral needs. We signpost students to specialist services if required and work closely with our partner universities to support students.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"accreditedBodies":[],"createdAt":"2021-07-12T20:49:28.922Z","updatedAt":"2021-10-04T16:58:43.590Z"}
