{"id":"68473ec1-792f-46e1-ac08-c5151cd4b965","name":"L.E.A.D. Academy Trust","code":"3B9","type":"lead_school","isAccreditedBody":false,"urn":"138999","ukprn":"10060187","address":{"addressLine1":"5a The Ropewalk","town":"Nottingham","postcode":"NG1 5DU"},"contact":{"website":"https://www.leadacademytrust.co.uk/","email":"marianne.fareham@leadacademytrust.co.uk","telephone":"7864652539","fullName":"Marianne Fareham"},"location":{"latitude":52.9552927,"longitude":-1.1615491},"trainWithUs":"The L.E.A.D. Academy Trust is one of the strongest sponsors operating in the East Midlands, with a track record of successfully improving underperforming schools...' Department for Education, 29.05.15 (Leicester Mercury). The acronym L.E.A.D. embodies the four core principles at the heart of the Trust: strong leadership at every level; empowering every child to aim high; giving every child the opportunity to achieve and constantly driving for improvement.\nOur vision is that through outstanding leadership, we will provide the highest quality education to enable every pupil to realise their full potential. Of course, every good school aspires to this aim, so what makes us different?\nWe passionately believe in the power of partnership working as a catalyst for ensuring more children receive an exceptional education. Our member schools know the transformational impact it can have from experience. At the same time, we recognise the importance of autonomy. Every school has its own context and challenges. This is why we encourage our member schools to lead and manage in a way that preserves their individual identity and responds to the specific needs of their children and community.\nWe currently have 25 Academies in Nottingham, Sheffield, Lincoln, Newark, Derby and Leicester and cover both primary and secondary phases. CPD is at the heart of our practice with a very strong partnership with our L.E.A.D. Equate Teaching Schools and our Apprentice Teacher posts are delivered in conjunction with Nottingham Trent University.","trainWithDisability":"L.E.A.D. are an inclusive employer and will work with you to help support with any disabilities or other needs you may have. Each school environment is different therefore specific needs would be discussed with you on an individual basis.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:49:12.584Z","updatedAt":"2022-01-07T18:04:07.365Z"}
