{"id":"6892e176-1e27-44da-bcec-b80292833aa3","name":"Harlow Teacher Training Partnership","code":"1ZH","type":"lead_school","isAccreditedBody":false,"urn":"137056","ukprn":"10034585","address":{"addressLine1":"ACL Harlow","addressLine2":"Partridge Road","town":"Harlow","county":"Essex","postcode":"CM16 6TE"},"contact":{"website":"http://www.essexteachertraining.co.uk","email":"info@essexteachertraining.co.uk","telephone":"3330139982","fullName":"Essex Teacher Training"},"location":{"latitude":51.757412,"longitude":0.096466},"trainWithUs":"Harlow Teacher Training Partnership (HTTP) is led by St. Alban's Catholic Academy, the Lead School for Teacher Training in Harlow.\n​HTTP's role is to be an initial point of contact for potential trainees; work with Essex Teacher Training on admissions; co-ordinate the placement of trainees in the Harlow Partnership Schools and monitor the training courses and placements. But we offer more than just this ...\n* ​A voluntary experience placement scheme is run by St. Alban's Catholic Academy for potential trainees. This may help candidates to decide on a particular Key Stage of interest, gain more knowledge of a typical teacher's working day, gain some subject/curriculum knowledge, gain more experience in working in the classroom generally. * Skills test support for potential trainees holding offers is available\n* Ongoing additional support programmes run through the training year, NQT year and NQT+1\nWe have many partner schools in Harlow and surrounding areas and with such a range of placements available, we endeavour to find the school to suit each individual.","trainWithDisability":"We work very closely with Essex Teacher Training, our training provider and together we are committed to offering all prospective trainees the opportunity to gain QTS. Please let us know if you have a specific need and/or require any adjustments at the interview stage or throughout the ITT programme.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"00782614-9301-40e4-8832-9a74cc1bbb07","code":"E75","name":"Essex Teacher Training","description":"Essex Teacher Training is a large provider, offering a variety of different school-based routes to QTS in schools across Essex and its adjoining counties. \\r\\n\\r\\nHeadteachers value the contribution trainee teachers can make to their schools. As a result, trainees enjoy their training and the vast majority gain employment in one of our partner schools, once qualified. \\r\\nAll of our tutors are experts in their field and many are still teaching, so you benefit from their knowledge and experience. We pride ourselves on the support we offer our trainees and put trainee wellbeing at the heart of what we do."}],"createdAt":"2021-07-06T17:57:04.773Z","updatedAt":"2021-10-01T02:04:47.397Z"}
