{"id":"68c91306-4e8f-42ca-8fc7-cbba1f5b1676","name":"Lord Scudamore Primary Academy","code":"19N","type":"lead_school","isAccreditedBody":false,"urn":"136761","ukprn":"10033806","address":{"addressLine1":"Lord Scudamore Academy","addressLine2":"Friars Street","town":"Hereford","county":"Herefordshire","postcode":"HR4 0AS"},"contact":{"website":"http://hmfa.org.uk","email":"scarter@ls.hmfa.org.uk","telephone":"01432 273951","fullName":"Administrator"},"location":{"latitude":52.0560568,"longitude":-2.7217631},"trainWithUs":"Why train with us?\nThe Herefordshire Marches Federation of Academies (HMFA) is a fantastic place to work and learn. It provides a unique school based learning opportunity in partnership with Worcester of University. HMFA is recognised by DfE and Ofsted as an outstanding Federation. The vision is to always work in the best interests of the children to provide opportunities that ensure the highest standard of education and care.\nWe create an environment in which all staff, pupils and trainee teachers feel valued and supported. We have worked with trainee teachers for many years and we fully recognise how much vibrancy, enthusiasm and drive they can offer to a school community.\nOur Federation schools comprise of a mixture of large and small, urban and rural schools throughout Herefordshire. All schools are primary schools and we pride ourselves in offering trainee teachers a variety of settings and experiences within their teaching practices. This includes a 3-form entry school to schools with up to 3 year groups in a class.\nPupils across the Federation are happy, friendly, creative and at the heart of everything we do. Students are ambitious and confident and many out perform their national peers and make significantly more progress.\nOur staff are our most valuable resource and have a proven track record in training and professional development. Our teachers are excellent practitioners with exemplary behaviour management skills and are eager to share their skills, knowledge and practice with the next generation of teachers.","trainWithDisability":"Please contact the University of Worcester or check the website page https://www.worcester.ac.uk/disabilityanddyslexia/","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"accreditedBodies":[{"id":"6019b3ce-f2f6-4b0e-b2a9-5813d74c4d54","code":"W80","name":"University of Worcester","description":"\\r\\n\\r\\nYou will have full access to University of Worcester, a dynamic facilitator of both innovative and traditional approaches to teacher training. University of Worcester is a truly modern Higher Education institution and one of the country’s most innovative universities. At the end of your course you will gain a PGCE (60 level 7 Master’s credits) and QTS.\\r\\nYou will be assigned three mentors, one from the University and two from the staff at your designated school, one will be the class teacher you're placed with and the other will be a member of the senior leadership team."}],"createdAt":"2021-07-06T17:52:49.027Z","updatedAt":"2021-09-24T15:25:33.168Z"}
