{"id":"6991bf1b-b0b2-4b01-9c38-2f4208efa851","name":"The Swaledale Alliance","code":"1FG","type":"lead_school","isAccreditedBody":false,"urn":"121481","ukprn":"10062781","address":{"addressLine1":"Brompton-on-Swale CE Primary School","addressLine2":"Brompton Park","town":"Brompton-on-Swale, Richmond","county":"North Yorkshire","postcode":"DL10 7JW"},"contact":{"website":"http://www.swaledalealliance.org/itt","email":"aofford@swaledalealliance.org","telephone":"01748 818195","fullName":"School Direct Programme Lead"},"location":{"latitude":54.3936614,"longitude":-1.6645962},"trainWithUs":"Set in an idyllic part of North Yorkshire, the Swaledale Alliance comprises of 56 member schools. These schools range from small ‘Dales Village Primary settings to large schools in Darlington and the community of Catterick Garrison serving the Armed Forces, as well as St Francis Xavier Secondary Richmond.\nWe are committed to providing a high-quality School Direct training environment and developing teachers for the future. We work with two outstanding providers, High Force Education at Barnard Castle and Red kite Teacher Training in North Yorkshire and Leeds, 'Train where you Live' concept, to provide a wide range of school environments.\nWith this distinct range of schools, trainees have the opportunity to experience a variety of settings. The quality of training is fully supported by expert practitioners who provide training and mentorship for candidates throughout our courses, along with highly skilled Professional tutors.\nOn completion of training many candidates successfully secure teaching posts within Alliance schools and continue to develop as practitioners through our highly regarded CPD programmes.\nBrompton-on-Swale CE Primary School, located close to Richmond, the Lead school for the Alliance, works in partnership with High Force Education in the north of our region.\nWorking with Red Kite Teacher Training, Alverton Community Primary is our primary training venue based in Northallerton in the south of our region. All of our courses lead to Qualified Teacher Status (QTS) and a PGCE (worth 60 masters credits) awarded by the School of Education at the University of Leeds or Northumbria University.","trainWithDisability":"High Force is committed to equality of opportunity for all and does not discriminate on the grounds of race, gender, sexual orientation, age, disability, religion or socio-economic circumstances. For specific information and guidance on support, provision available and/or facilities for trainees with learning difficulties or disabilities, please contact the ITT Deputy Director on 01833 630487. We produce a separate Disability Statement, outlining facilities for disabled learners. This is available on request. We have a dedicated pastoral lead who can offer additional support when needed. Red Kite believe that the teachers we train are important role models – both in their schools and in the wider community – and that they should reflect the diversity around them and help create a culture that promotes and celebrates inclusion in all its forms.\nIn response to this, we have built up a network of ‘Diversity Champions’, whose role it is to promote conscious inclusion and ensure that every one of our trainees, whatever their personal circumstances, feel welcomed, supported and valued.\nOver years we have worked with a number of individual trainees to tackle specific barriers they have faced including, working with trainees with mobility issues, supporting trainees with autism and making course adjustments for trainees with dyslexia.\nOur commitment to diversity in all its forms is evidenced by the fact that 15% of our trainees report having some form of disability.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"dae8b113-3556-416a-8da0-57eb5aaff9e2","code":"H38","name":"High Force Education (SCITT)","description":"High Force Education is a an Ofsted Outstanding provider. We are a small provider who are passionate about nurturing and supporting you to become a highly skilled Early Career Teacher. We get to know all of our trainees and can personalise the course to reflect your needs. Our programme aims to prepare you to become an effective teacher capable of making a significant contribution to the workplace, both during and after the programme. You will spend the majority of the programme in the classroom and have a dedicated Hub Learning Lead to teach you from our ‘Learn to Curriculum'."},{"id":"4b15c2df-7f1b-4210-ba42-b1f14381e87b","code":"2B9","name":"Red Kite Teacher Training","description":"Red Kite’s ‘Train Where You Live’ concept is aimed at bringing teacher training to you, wherever you live in our region.\\r\\n\\r\\nPartnerships with providers across the region mean that wherever you train, you’ll be part of the same Red Kite programme and receive the same high-class teacher training. The only provider working with the University of Leeds, and from September 2021 your learning experience with them will be blended to allow you to work remotely wherever you live.\\r\\n\\r\\nWith our wide range of courses, which now includes Part-Time options, there’s something for everyone regardless of where you live."}],"createdAt":"2021-07-06T17:57:20.957Z","updatedAt":"2021-09-30T16:09:18.794Z"}
