{"id":"699b8c23-4d5a-400b-a189-86898da33a21","name":"St. Andrew’s Teaching Alliance","code":"2DD","type":"lead_school","isAccreditedBody":false,"urn":"123126","ukprn":"10074236","address":{"addressLine1":"Station Road","town":"Chinnor","county":"Oxon","postcode":"OX39 4PU"},"contact":{"website":"http://www.st-andrews.oxon.sch.uk","email":"kger3182@st-andrews.oxon.sch.uk","telephone":"1844351353","fullName":"Annette Mashru"},"location":{"latitude":51.7033445,"longitude":-0.9099049},"trainWithUs":"St. Andrew’s Teaching Alliance (SATA) is a Schools Direct Provider in the Oxfordshire and Buckingham area. Your training programme with SATA will have a strong focus on learning how to teach. We will ensure that you understand children's developmental stages and that you understand how children and young people learn. Our training programme is practical and innovative making full use of evidence based teaching strategies. You will experience teaching across three educational phases, in both mainstream and special settings. Our programme will give you the tools you need to do the job well so that you can meet the needs of all your students. We will ensure that you learn how to manage behaviour in your classroom; we combine all of our training with cutting edge evidence based research.\nWe believe that every child, regardless of ability or background, can succeed.\nIf you feel this way too, then our programme will be the right course for you.\nChoosing SATA as your training provider means that:\n\tYou will become part of a community committed to one another and to achieving the best for every young person we care for.\n\tYou will enjoy excellent facilities in which to learn, supporting your development as a practitioner.\n\tYou will have opportunities to take part in a wide variety of Professional Development.\n\tYou will work with the highly regarded Oxford Brookes University as our partner provider.","trainWithDisability":"Our lead school is an outstanding primary school with a Communication and Interaction Resource Base on site and all of our partner schools are rated outstanding or good which ensures excellent provision.\nWe passionately believe in the 'grow your own' philosophy and we will be committed to you as a professional. When you train with SATA we will invest in your development and while we cannot guarantee a position at the end of your training course, there may opportunities regarding employment in one of our schools. When you train with the SATA, we see you as our future.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:51:07.654Z","updatedAt":"2021-09-25T18:42:12.984Z"}
