{"id":"6ac4825e-67af-4fe2-9d0f-0f4e472a0965","name":"Congleton education Community Partnership","code":"29W","type":"lead_school","isAccreditedBody":false,"urn":"140981","ukprn":"10046166","address":{"addressLine1":"Longdown Road","town":"Congleton","county":"Cheshire","postcode":"CW12 4QJ"},"contact":{"website":"http://blackfirs.co.uk","email":"alexthompsoncecp@hotmail.co.uk","telephone":"07772 968051","fullName":"Toby Hassall"},"location":{"latitude":53.1655922,"longitude":-2.2467557},"trainWithUs":"The Congleton education Community Partnership (CeCP) is delighted to announce that following three years of 100% success with our teacher training pogramme, we are now recruiting applicants for the 2020-2021 School Direct Primary PGCE Programme in partnership with Staffordshire University. This is a school led program. The University has had an ‘Outstanding’ Ofsted rating for its PGCE provision over the last 12 years and we are looking forward to a strong partnership that will ensure the very best provision for our successful applicants.\nWe currently have 11 primary schools and 1 high school in our Partnership. Some of the primary schools have similar levels of deprivation as any inner-city area, others are in more affluent suburbs. Half the schools have links to the Church of England, three are foundation schools. Five of the primary schools are academies and one of the primary schools is in a multi-academy trust. One placement will be in Key Stage 1 and the other in Key Stage 2.\nWe have experience of working with many Universities for Initial Teacher Training and can offer outstanding teaching experiences in a variety of settings with children from 5-11 years. Many of these aspects are led by current school practitioners / leaders in their field. In order to ensure employability and that our trainees are meeting the needs of the sector we enrich the core provision through school based twilight sessions i.e. KiVa Anti-Bullying training, Growth Mindsets, Forest School, Philosophy for Children, Co-operative Learning Techniques and an arts-based residential.","trainWithDisability":"All of our schools & the training we provide support candidates with disabilities or additional needs, and the buildings are fully accessible. If you have any questions or queries please do not hesitate to contact us.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:56:20.215Z","updatedAt":"2021-11-08T23:29:13.542Z"}
