{"id":"6ce4dae8-7121-42e7-84ec-efda047b590f","name":"Emmanuel Teacher Training Partnership","code":"14U","type":"lead_school","isAccreditedBody":false,"urn":"135007","ukprn":"10016111","address":{"addressLine1":"Emmanuel Teaching School Alliance","addressLine2":"Consett Road","town":"Lobley Hill","county":"Gateshead","postcode":"NE11 0AN"},"contact":{"website":"http://www.traintoteach.net/","email":"clarkc@emmanuelctc.org.uk","telephone":"1914602099","fullName":"Teaching School"},"location":{"latitude":54.9383303,"longitude":-1.6421539},"trainWithUs":"Teaching is one of the most rewarding vocations and the Emmanuel Teacher Training Partnership provides an excellent start to your career. Our schools have a reputation for outstanding leaders and inspirational teachers who enable students to exceed expectations. We believe that the best place to train teachers to become outstanding practitioners is in the classroom. We give trainee teachers the opportunity to be at the heart of school life from the very first day of the academic year. You will be fully supported by classroom teachers, mentors and professional tutors throughout your training. We have more than twenty years’ experience in ITT, having developed a successful Graduate Teacher Programme (GTP) as well as providing PGCE placements for Durham, Newcastle, Northumbria, Sheffield Hallam, Sunderland and Teesside universities. Our School Direct programme, which started in September 2013, allows high calibre trainee teachers to achieve PGCE(M) alongside QTS which is accredited by Newcastle University, Sheffield Hallam University and Teesside University. Most of our trainees secure teaching positions and a large proportion commence their careers at schools within our alliance. Numerous previous trainees already hold significant leadership roles, including Head of Department and Assistant Vice Principal.","trainWithDisability":"Schools working in partnership with the Emmanuel Teacher Training Partnership are inclusive environments. Trainees are encouraged to declare any disabilities they may have so that reasonable adjustments can be put in place to support their training experience.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"accreditedBodies":[{"id":"899178cc-20a7-4df5-951a-ee83c1b3d4d1","code":"S21","name":"Sheffield Hallam University","description":""},{"id":"94695424-6553-46c4-9c05-181e61813587","code":"3S1","name":"Teesside University","description":""},{"id":"db2188d3-0047-44ee-92d2-64d1b5e1a939","code":"N21","name":"University of Newcastle Upon Tyne","description":""}],"createdAt":"2021-07-06T17:47:50.558Z","updatedAt":"2021-12-08T23:09:50.539Z"}
