{"id":"6cf33842-f1c4-49cf-8697-3ba1a2cd6c45","name":"All Saints RC School","code":"2KH","type":"lead_school","isAccreditedBody":false,"urn":"121720","ukprn":"10000225","address":{"addressLine1":"All Saints RC School","addressLine2":"Mill Mount Lane","town":"York","county":"North Yorkshire","postcode":"YO24 1BJ"},"contact":{"website":"http://www.allsaints.york.sch.uk/","email":"ITT@allsaints.york.sch.uk","telephone":"(01904) 545258","fullName":"School Direct Admissions"},"location":{"latitude":53.9514365,"longitude":-1.0942545},"trainWithUs":"All Saints is a successful, popular, high achieving and happy school located in the heart of the historic City of York, our split site school offers excellence in education. Steeped in history, we are immensely proud that our school is unique in its learning environment, its people and its ethos.\nAll Saints is recognised by Ofsted as \"Outstanding\" status. We are a designated Teaching School and National Support School. Our GCSE results are in the top 25% of UK schools and our thriving Sixth Form’s results are in the top 10%. We are proud to be Lead School in our Teaching School Alliance, working in partnership with partner schools and the University of York. We offer high-quality Initial Teacher Training (ITT) to graduates and career changers joining the teaching profession. As a trainee teacher with us, you will have access to specialist training and the school and classroom experience to equip you with the knowledge, skills and expertise needed to become an excellent teacher.\nIf you would like further information and support, including arranging a School Experience Visit please contact one of our team who will be pleased to help you.","trainWithDisability":"Our partners actively promote inclusivity and have a dedicated team who can advise and support students with a disability or long-term health condition. If you disclose any individual requirements, they will do their utmost to ensure that all reasonable adjustments are made so you can feel supported and able to fully engage with your PGCE course.\nExamples of how they can offer support include:\n- working with you to find suitable school placements.\n- ensuring that you have a 'Student Support Plan' in place, if necessary, which will include any assessment requirements you may have (e.g. extra time in examinations).\n- providing learning materials and resources in accessible formats.\n- signposting to specialist colleagues who can advise about funding support for students with a disability.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:47:45.660Z","updatedAt":"2021-07-21T20:13:17.703Z"}
