{"id":"6d249061-985e-4fe0-9463-c89cf2e4d9ba","name":"St Hugh’s School","code":"1RZ","type":"lead_school","isAccreditedBody":false,"urn":"118146","ukprn":"10017505","address":{"addressLine1":"Bushfield Road","town":"Scunthorpe","county":"North Lincolnshire","postcode":"DN16 1NB"},"contact":{"website":"https://www.st-hughs.n-lincs.sch.uk/","email":"tracy.millard@northlincs.gov.uk","telephone":"1724842960","fullName":"Mrs Tracy Millard"},"location":{"latitude":53.5796749,"longitude":-0.6486953},"trainWithUs":"St Hugh’s School is a special school for students between the ages of 11 years and 19 years of age who have a range of learning difficulties including moderate, severe learning difficulties, autism spectrum disorders, profound and complex needs and language and communication difficulties. The current numbers on roll, as stated in the last census report to the Department for Education are 173 students, of which 65.9% are boys and 34.1% are girls.\nThe school is rated “Outstanding” by Ofsted. It is part of Leading Learning Forward Education Partnership; it is also an Evidence Hub for KYRA Research School, designated by the Education Endowment Foundation and a Partner School of the new Teaching School Hub (DRET), designated by the Department for Education, working in collaboration with schools across North and North East Lincolnshire.\nTraining with St Hugh's, York St John University and our Education Partnership will provide you with a broad and relevant teaching experience as well as access to high quality SEND education and training.","trainWithDisability":"At St Hugh’s School we are committed to working together to provide an inspirational and exciting learning environment where all young people can develop an enthusiasm for life-long learning. \n\nWe believe that students and adults should feel happy, safe and valued so that they gain a respectful, caring attitude towards each other and the environment both locally and globally. \n\nOur accessibility plan is structured to complement and support the school’s equality objectives. Please visit our website.\n\nWe monitor all education and training activities under the Equality Act 2010 (and in particular schedule 10 regarding accessibility).\n\nSt Hugh’s School is committed to providing an environment that enables full curriculum access that values and includes all students, staff, parents and visitors regardless of their education, physical, sensory, social, spiritual, emotion and cultural needs. \n\nWe are committed to taking positive action in the spirit of the Equality Act 2010 with regard to disability and to developing a culture of inclusion, support and awareness within the school.\n\nSt Hugh’s School’s accessibility plan shows how access is to be maintained for disabled students, staff and visitors to the school within a given time frame. We will make reasonable adjustments to accommodate your needs where practicable.\n\nStudents with a wide range of disabilities and other needs have accessed training at St Hugh's and with our partner schools in the past.","accreditedBodies":[{"id":"b011427a-6dff-4a77-9df3-c85a54be605a","code":"Y75","name":"York St John University","description":"York St John University’s Initial Teacher Education Partnership prepares outstanding teachers who are committed to supporting pupil progress through inspiring training in creative school partnerships.\\r\\n\\r\\nThe key aim of the PGCE Primary Education School Direct programme is to deliver a high quality initial teacher education programme that is up-to-date with current developments in education and the primary curriculum and will equip you with the professional knowledge, understanding, skills and attributes to become outstanding Early Years practitioners and primary teachers."}],"createdAt":"2021-07-06T17:56:14.581Z","updatedAt":"2021-10-04T14:32:33.603Z"}