{"id":"6d68da9f-6219-46fe-93df-cb26b2fb518b","name":"Alliance of Leading Learning","code":"1HQ","type":"lead_school","isAccreditedBody":false,"urn":"136979","ukprn":"10007848","address":{"addressLine1":"Morda Road","town":"Oswestry","county":"Shropshire","postcode":"SY11 2AR"},"contact":{"website":"http://leadinglearning.co.uk","email":"kate.aspinall@leadinglearning.co.uk","telephone":"1691664455","fullName":"Kate Aspinall Training Manager"},"location":{"latitude":52.8519064,"longitude":-3.0593143},"trainWithUs":"The Marches School is a lead school for School Direct, it is the largest secondary school in Shropshire.\nThe school has over twenty years of experience in teacher training, offering innovative, successful programmes in all subjects and primary education. A world class education system requires world class teachers and this unique programme sets out to address this.\nThis programme is a way of training teachers which puts schools at the heart of the process. The Marches School and University of Chester, in partnership have designed and developed this school led teacher training programme, which is committed to training teachers to ensure that they have the potential to be outstanding at the end of the programme.\nTrainees receive a flexible and bespoke timetable which scaffolds their learning and offers substantial mentoring to ensure that lesson planning and delivery is of the highest standard. As a result of one to one and group support mentors are able to monitor ITTs closely and ensure high quality teaching and learning. We offer an on site Wellbeing Mentor to ensure that the ITTs are managing the demands of the course whilst maintaining a healthy body and mind. Trainees are offered additional bespoke training sessions according to the needs of individuals and the whole cohort. These may cover areas such as: Behaviour Management, SEN needs, Transactional Analysis, stress management etc. In addition, the training team have dedicated admin staff whose roles are to support the trainees with placements, stationery, IT requirements, travel and accommodation.","trainWithDisability":"As an alliance we are able to offer support to disabled applicants and students. This includes students with specific learning differences, long standing health conditions, mental health conditions, Autism/Asperger’s Syndrome and sensory impairments. Specialist staff at both the university and the school site will support students in identifying the most appropriate solutions to potential barriers to learning.\nAs a partnership we are keen to ensure all students benefit fully from the course and achieve their learning potential. Many of our schools can cater for students with limited mobility in fact in 2017-2018 we accommodated a student with muscular dystrophy who successfully studied in two different schools that we were able to source and accessed the site on a mobility scooter. We see it as a challenge to support applicants who we think have the potential to become outstanding teachers through the course and we will do so using as many strategies as we need.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:56:56.192Z","updatedAt":"2021-12-08T19:18:45.731Z"}
