{"id":"6e03b435-c3ed-4a63-9b5a-99cf8b6a60ac","name":"The Partnership Trust","code":"1UW","type":"lead_school","isAccreditedBody":false,"urn":"137493","ukprn":"10035038","address":{"addressLine1":"Fosse Way School","addressLine2":"Longfellow Road","town":"Radstock","county":"Bath","postcode":"BA3 3AL"},"contact":{"website":"http://www.thepartnershiptrustcpd.com","email":"training@thepartnershiptrust.com","telephone":"01761 412198","fullName":"School Direct (TBMPTS)"},"location":{"latitude":51.2832004,"longitude":-2.4721563},"trainWithUs":"The Partnership Trust offers a primary Initial Teacher Training programme. Fosse Way School, in Radstock, Bath and North East Somerset, has Outstanding OFSTED accreditation (2017) and is the South West co-ordinator and Bath and North East Somerset hub for the Autism Education Trust training programme for schools. Our ITT programme is a high-quality PGCE including QTS (qualified teacher status) with credits towards a Master’s degree. Trainees will spend a minimum of 120 days in schools and a minimum of 60 days training. This year we will be offering an SEND route. When completing your application please make it clear whether you would like to apply for Primary General or Primary General (SEN Specialism). The route you choose will need to be reflected in your personal statement when completing the application. Our work is characterised by excellent teachers taking the lead, working across traditional sector boundaries (primary and special) and across local authorities. The Partnership Trust runs a wide ranging programme of Continuing Professional Development opportunities including training for newly qualified teachers, events addressing current issues such as curriculum design, leadership development and many aspects of working with children with special educational needs and disabilities. Trainees will be offered full access to the CPD programme for teachers within The Partnership Trust. For further information please contact training@thepartnershiptrust.com or phone 01761 412198.","trainWithDisability":"The Partnership Trust's admissions policy conforms to that of Bath Spa University:-\n\"We value diversity and we recognise that different people bring different ideas, knowledge and culture, and that difference can bring strength, creativity and innovation.\nWe believe that discrimination or exclusion based on individual characteristics and circumstances, such as age; disability; caring or dependency responsibilities; gender or gender identity; marriage and civil partnership status; political opinion; pregnancy and maternity; race, colour, caste, nationality, ethnic or national origin; religion or belief; sexual orientation; socio-economic background; trade union membership status or other distinctions, represents a waste of talent and a denial of opportunity for self-fulfilment.\nWe recognise that patterns of under-representation and differences in outcomes at Bath Spa University can be challenged through positive action programmes.\nWe respect the rights of individuals, including the right to hold different views and beliefs. We will not allow these differences to be manifested in a way that is hostile or degrading to others.\nWe expect commitment and involvement from all our staff, students, partners and providers of goods and services in working towards to achievement of our vision.\"\n\nFor a more detailed policy please see the Bath Spa University website or follow the link below.\nhttps://www.bathspa.ac.uk/about-us/governance/policies/equality-policy/","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:52:48.804Z","updatedAt":"2021-09-08T20:43:29.871Z"}
