{"id":"6e68e4a3-ba8f-4d58-8310-e2a0df9a522c","name":"Forest Way Alliance","code":"1L8","type":"lead_school","isAccreditedBody":false,"urn":"137905","ukprn":"10036610","address":{"addressLine1":"Forest Way Alliance","addressLine2":"Warren Hills Road","town":"Coalville","county":"Leicestershire","postcode":"LE67 4UU"},"contact":{"website":"http://www.forestwaytsa.org/initial-teacher-training.html","email":"tsa@forestway.leics.sch.uk","telephone":"1530277363","fullName":"Helen Joy"},"location":{"latitude":52.7291717,"longitude":-1.3254923},"trainWithUs":"Training with Forest Way Alliance\nForest Way Alliance is based in the North West Leicestershire area and our accredited providers are University of Derby, University of Leicester and Loughborough University. We have over ten years experience of delivering both Primary and Secondary School Direct PGCE.\nYour placement will be at one of our Alliance schools. With 40+ primary, 5 secondary and 5 special schools, there is a huge array of expertise on hand which gives trainees a great breadth of opportunity.\nOur teacher training is led by our Programme Manager and a team of experienced practitioners offering a wealth of educational skills and knowledge, and are dedicated to the professional development of outstanding teachers. Working with our partners we have developed a programme which incorporates hands on work at schools, regular time at university and, where appropriate, practical, locally based training by skilled and experienced practitioners ‘doing the job’.\nOur Alliance is progressive and proactive with a major focus on career development – from Initial Teacher Training right though to headship. Training at FWA Hub takes place in our local training venue. Primary and Secondary students will undertake some joint training and will have the opportunity to network. For details of student facilities at our partner universities please see their individual websites.\nFor more information please see our website [www.forestwaytsa.org]( http://www.forestwaytsa.org/initial-teacher-training.html) or contact our Programme Manager - Sheila Dennis, Email: sdennis@forestway.leics.sch.uk","trainWithDisability":"Forest Way Alliance and our accrediting providers, University of Derby, University of Leicester and Loughborough University, are committed to Equal Opportunities for all trainees, and support is available for candidates who require it. Please make clear any support you may require.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:53:07.549Z","updatedAt":"2021-09-22T21:28:12.456Z"}
