{"id":"6e6c8aa3-8d77-4c7d-af3c-4c7912b1cc2a","name":"Two Mile Ash ITT Partnership","code":"T89","type":"scitt","isAccreditedBody":true,"ukprn":"10059102","address":{"addressLine1":"Two Mile Ash ITT Partnership, Fairfields Primary School","addressLine2":"Apollo Avenue, Fairfields","town":"Milton Keynes","county":"Bucks","postcode":"MK11 4BA"},"contact":{"website":"www.mkitt.co.uk","email":"info@mkitt.co.uk","telephone":"01908 533284","fullName":"Jane Cole (ITT Partnership Co-Ordinator)"},"location":{"latitude":52.0404586,"longitude":-0.8325251},"trainWithUs":"“Not all superheroes wear capes, some teach!” At Two Mile Ash Initial Teacher Training Partnership, we believe in pursuing superhero status for you during your journey to QTS. We don’t generally provide capes, but we do provide outstanding training opportunities with our growing partnership of committed schools and colleagues. Our 100% employment rate for the past 6 years demonstrates the success of our training and we have alumni who are now mentors, trainers and Head Teachers. 'The high quality of trainees, who demonstrate very high aspirations, develop quickly into good and outstanding teachers, and who often move on to leadership roles' Ofsted, 2013. As the most established primary (including EYFS and SEND) teacher training provider in Milton Keynes, we have 18 years’ experience in leading initial teacher training and have provided the region with hundreds of primary teachers. Being part of the Milton Keynes Teaching School Alliance, we provide CPD for teachers throughout their career, which gives our ITT team added expertise to bring to your training journey. We offer undergraduate and postgraduate SCITT, School Direct, Postgraduate Teaching Apprenticeships and Assessment Only pathways. We also validate QTS for other providers in the area and are delighted to work with the well-respected Birmingham City University for both our PGCE and our trail-blazing, school-based undergraduate route. We have a dedicated training space, where we have study facilities available every day during term time. We are pleased to provide you with a laptop to use during your training course.","trainWithDisability":"Our course is accessible to anyone with a disability, provided they meet the ‘Health and physical capacity to train to teach’ requirements, which are assessed by a reputable Occupational Health Service. Our training room is accessible to people with a physical disability and there is a lift in the training centre to avoid the use of stairs, if necessary. Some of our schools are more accessible than others to those with a disability and this would be considered, as necessary, when deciding which schools to place you in. We use electronic portfolios of documents and this has supported applicants in the past with dyslexia. Dyslexic applicants still have to meet the course entry requirements, including assessment of your fundamental English and Maths skills, and you should check what special arrangements we can make, if this applies to you. We pride ourselves on our pastoral care and bespoke attitude to teacher training. You are an individual and we aspire to train you to take your individuality into the classroom. This, combined with the knowledge, skills and understanding you will gain during your study with us, creates a happy teacher which is what we all want to be! We believe that happy teachers are teachers for years to come and retention of our alumni in the teaching profession is high after 5 years. We devote curriculum and tutorial time to encouraging you to look after your wellbeing as a teacher and the experienced and expert team are there to support you.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:51:55.961Z","updatedAt":"2021-09-07T21:55:40.655Z"}
