{"id":"6e77a3d0-c019-4c3a-ad0e-b84a6f5cdecb","name":"West Cumbria and North Lakes School Direct","code":"17X","type":"lead_school","isAccreditedBody":false,"address":{"addressLine1":"Secondary School Direct","addressLine2":"c/o Cockermouth School","town":"Castlegate Drive","county":"Cockermouth","postcode":"CA13 9HF"},"contact":{"website":"http://www.ctt.ac.uk/secondary-pgce-with-qts.html","email":"tinabeddoe@keswick.cumbria.sch.uk","telephone":"01900 606855","fullName":"Ruth Buxton"},"location":{"latitude":54.66709,"longitude":-3.350082},"trainWithUs":"The West Cumbria Teaching School Alliance (WCTSA) is a great place to work and learn. Our alliance of Secondary schools works closely with the Sheffield Hallam University and Cumbria Teacher Training to provide an outstanding opportunity to follow a largely school-based route towards Qualified Teacher Status (QTS) and a Post Graduate Certificate in Education (60 credits at Masters level).\nThe WCTSA is an outstanding partnership of schools and currently comprises of 12 schools.\nOur partner schools are all located on the Western and Northern fringes of the Lake District, adjacent to some of the most beautiful parts of the country. A strength of our programme is the opportunity for trainees to engage with a diverse range of teaching and training experiences. The school catchments are contrasting, with schools covering urban areas, small towns and very rural regions.\nOur alliance schools have significant levels of experience in Initial Teacher Training (ITT) and all have worked with PGCE courses for many years. We have excellent professional and subject mentors who are eager to share their skills, knowledge and practice and who have and a track record of supporting trainees effectively.\nWe also have an excellent record of employment.\nWe welcome students with disabilities or other needs. As we are a small organisation, we are able to cater for individual needs and provide support where necessary. You will be part of a well established Teaching School Alliance whose School Direct Programme is well respected and held in high esteem.","trainWithDisability":"All candidates including those with disabilities and other needs have an initial fit to work assessment and from these relevant support programmes can be implemented. \n\nAlthough accessibility does vary between different locations, every endeavour is made to accommodate an individual's needs.\n\nTrainees are supported throughout the course and if any issues or concerns arise they are dealt with promptly.","accreditedBodies":[],"createdAt":"2021-07-06T17:48:46.725Z","updatedAt":"2021-07-06T17:48:46.725Z"}