{"id":"6e7f844d-71e5-49be-a4d6-0211287d7480","name":"University College Birmingham","code":"B35","type":"hei","isAccreditedBody":true,"urn":"133785","ukprn":"10000712","address":{"addressLine1":"University College Birmingham","addressLine2":"Summer Row","town":"Birmingham","county":"West Midlands","postcode":"B3 1JB"},"contact":{"website":"http://www.ucb.ac.uk","email":"pg@ucb.ac.uk","telephone":"0121 604 1040","fullName":"School of Education, Health and Communit"},"location":{"latitude":52.4813851,"longitude":-1.9063332},"trainWithUs":"We are a small, friendly School of Education and Community within University College Birmingham, situated right in the heart of the UK's second largest city. More than 300 students study on our higher education courses in Early Years/ Childhood Studies and 95% of our newly-qualified teachers are employed in a teaching role within six months.\nWe enjoy an excellent reputation for supporting students thanks to a team of highly experienced full-time lecturers who draw on their practical knowledge of working in the early years sector. Staff are a key resource to help your successful progression through the course.\nAdditionally we have worked closely for many years with local schools and other providers to train those who work within the primary sector. Key senior staff from these establishments have helped us put together the year's training. This important factor ensures the courses have been written to meet the needs of schools and will improve employability within this sector.\nBesides achieving Qualified Teacher Status (QTS) graduates will also work for a Post Graduate Certificate in Education (PGCE) which is accredited by the University of Birmingham. The work for your PGCE is integrated within the QTS programme.\nThe course particularly focuses on three separate themes:\n- Managing Behaviour\n- Working with children with special educational needs and/or disabilities (SEND)\n- Working with children who use English as an additional language (EAL)","trainWithDisability":"We urge students to tell us about their disabilities or other needs so that we can put a support package in place. That help begins even before the course starts as we provide orientation support aimed at helping students get used to the UCB environment and finding their way around during induction sessions and taster days. We also provide mobility training for blind or partially-sighted people.\nThe help continues once the studies begin whether in the form of lecture notes and handouts provided in an alternative format, support workers or the loan of digital recorders to record lectures. We can also help manage the workload of studying with one-to-one mentor support sessions for students with autistic spectrum conditions, providing specialist equipment and software to enable independent learning and arranging alternative methods of assessment.\nWhen it comes to exams we can arrange for a number of solutions to help students from having extra time or rest/nutrition breaks to providing exam papers in alternative formats.\nUCB is committed to try and provide access for everyone to our facilities and our website now has a clear description of our premises which was carried out by an independent agency, DisabledGo.\nAlso. our Mental Health and Wellbeing Service is committed to helping students access the most appropriate support and information.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"createdAt":"2021-07-06T17:46:36.312Z","updatedAt":"2021-10-06T18:00:31.156Z"}
