{"id":"6e98194c-5d71-4ea1-93c1-1f30eda695f0","name":"Sheffield South East Learning Partnership (SSELP)","code":"1N7","type":"lead_school","isAccreditedBody":false,"urn":"142749","ukprn":"10005790","address":{"addressLine1":"Tinsley Meadows Primary Acadamy","addressLine2":"Five Rivers TSA","town":"Sheffield","county":"South Yorkshire","postcode":"S9 1SG"},"contact":{"website":"https://sselp.net/school_direct_work.aspx","email":"sselpsdlead@gmail.com","telephone":"07853 187221","fullName":"Fiona Heath"},"location":{"latitude":53.4138434,"longitude":-1.3977034},"trainWithUs":"Sheffield South East Learning Partnership (SSELP) School Direct is a collaboration of 18 schools situated in South East Sheffield, in partnership with Sheffield Hallam University. The lead school, Tinsley Meadows Primary Academy, is part of Five Rivers TSA. The schools work collaboratively to enhance ITT provision and to provide outstanding training and career opportunities. Our commitment to developing our teachers of the future ensures that our training is of an exceptionally high standard. Over the past seven years a hundred percent of our students have passed. A significant number of our graduates are now making a difference to our children every day.\nSSELP Schools are proud to represent a close geographical catchment of schools which provides a wide variety of contexts including Special schools; a breadth of special education needs and disabilities; schools with a significant high percentage of EAL and multicultural diversity; faith schools; a mixed social demographic; all phases of education from nursery to post 16. Many SSELP schools are recognised as centres of excellent practice, offering school to school support and leading on school improvement projects across Sheffield and beyond. Practice within our schools is firmly embedded in action research which informs and drives the continual professional development of our teams. We offer qualified teacher status (QTS) and PGCE qualifications with 60 Master's credits. SSELP SD offer:\nPrimary (5 - 11 years) Course code: 25YM\nPrimary with Early Years (3 - 7 years) Course code: 2SBT\nPrimary with PE specialism (5 - 11 years) Course code: 38P8","trainWithDisability":"SSELP is dedicated to respecting, valuing, and supporting all our trainees, colleagues and pupils. Every person within our community of schools is treated as an equal regardless of disability or need. We believe that everyone within our community has an important contribution to make to our schools whether that be in the classroom or in shaping the wider culture and ethos of our schools.\nYou have the choice whether you disclose your disability or need to SHU, SSELP School Direct or directly to your school. All disclosures are treated with sensitivity and confidentiality. Making a disclosure means that we then have the opportunity to put in the support you require to enable you to succeed and reach your full potential during your initial teacher training course.\nAll our schools are equal opportunities employers. Our schools are actively involved in implementing mental health and well-being strategies. This means that we will make reasonable adjustments to support and provide access during your course and you can receive further support through Sheffield Hallam University, if required.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:48:16.845Z","updatedAt":"2021-09-07T17:54:44.168Z"}
