{"id":"6ededb74-a80f-43e9-aa9a-52389aa1cf3f","name":"LEAF","code":"2JR","type":"lead_school","isAccreditedBody":false,"urn":"119055","ukprn":"10015449","address":{"addressLine1":"Five Acre Wood School","addressLine2":"Boughton Lane","town":"Maidstone","county":"Kent","postcode":"ME15 9QF"},"contact":{"website":"www.leaftrainingpartnership.co.uk","email":"leafadmin@five-acre.kent.sch.uk","telephone":"1622743925","fullName":"Sarah Costain"},"location":{"latitude":51.2496572,"longitude":0.533295},"trainWithUs":"LEAF “Leading Education and Achievement For all”. LEAF offers a unique opportunity for those looking to train as a mainstream primary teacher. Located in the Maidstone area LEAF has strong partnership links and works with a number of local, mainstream and special primary schools. We can offer aspiring teachers superb opportunities to train in excellent mainstream schools with the second teaching placement based in a special school. Our graduates will start their teaching journey with an unparalleled expertise in SEND, equipping them with the knowledge, qualities and skillset to begin their careers as proficient primary teachers who can meet the increasingly diverse needs of primary pupils. Graduates will be based in a mainstream primary school supported by excellent teachers and trained mentors. The second placement is in one of the local partnership special schools. You will have a wealth of opportunity to develop your skills in a range of areas including many of the day to day teacher responsibilities such as assessing, planning, learning and teaching, positive behaviour management, differentiation and the primary curriculum.\nOur graduates will benefit from a comprehensive programme of coaching and mentoring.","trainWithDisability":"Campuses vary, please contact LEAF directly to discuss how we can accommodate your needs.\n\nleafadmin@five-acre.kent.sch.uk","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-12T20:49:09.019Z","updatedAt":"2021-10-01T18:21:10.155Z"}
