{"id":"6f05bbdb-8665-44a9-bfc8-61ea96a9ef07","name":"Medway Valley Training Partnership","code":"1Q5","type":"lead_school","isAccreditedBody":false,"urn":"118923","ukprn":"10035084","address":{"addressLine1":"c/o The Thomas Aveling School","addressLine2":"Arethusa Road","town":"Rochester","county":"Kent","postcode":"ME1 2UW"},"contact":{"website":"www.mvtp.org","email":"office@mvtp.org","telephone":"01634 408425","fullName":"Andy Plank (School Direct Professional T"},"location":{"latitude":51.3641608,"longitude":0.5027328},"trainWithUs":"The Medway Valley Training Partnership (MVTP) comprises schools and academies from Primary to Secondary level. MVTP co-ordinate the recruitment of trainee teachers onto suitable SCHOOL DIRECT teacher training programmes for our partner schools. Due to our success, we have grown tremendously from our small partnership of five schools to a partnership of fifteen and counting. You will find our schools in both Medway Towns and Maidstone areas in Kent, linked by the pretty \"Medway Valley\" railway branch line which runs from Strood station through to Maidstone West and beyond. We offer a range of specialist secondary teacher-training courses alongside primary in a variety of school settings that will equip the successful trainee with the skills to be able to confidently teach anywhere in the country. Our unique position in Kent means that, where possible, trainees will experience not just Key Stage 3 and 4 GCSE training but also Key Stage 5, A -level. All of our School Direct teacher training courses are available at both Qualified Teacher Status (QTS) and Post- Graduate Certificate of Education (PGCE).\nWe have an excellent success rate with the vast majority of trainees completing the training course now employed in a school with over 90% in their home school or one of KMT's other partnership schools or academies.\nAll MVTP schools share one common goal;\nTo train teachers to not just pass the course but in preparing them for a long and successful career.","trainWithDisability":"We welcome applications from those with disabilities and regularly train and support students with dyslexia and mental health problems.\nWe, with our accreditation partners Kent and Medway Training, offer support and help with ensuring that you met the minimum standards required for Literacy and Numeracy. We teach strategies for ensuing that Spelling, Punctuation and Grammar are accurate in, especially, work that is handed out to school pupils.\nWe have introduced a programme of support for those with mental health conditions and the programme includes that offer of free further independent advice from dedicated specialists should you need it\nWe are proud of the support and guidance that we give to ensure that you are able to give of your best during your training year and we provide an environment in which you can feel comfortable in seeking support should you need it. MVTP now have two secondary schools within our partnership that have specialist visually and hearing impairment centres:- Thomas Aveling for hearing and Robert Napier for Visual impairment.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"757d0dca-c7a9-43c8-8c3b-96c0a81539b6","code":"K30","name":"Kent and Medway Training","description":"Kent and Medway Training is a Schools Centred Initial Teacher Training Provider (SCITT) which has been successfully training teachers for over 25 years.Our reputation for quality of our training has seen us grow tremendously from training 30 students a year to over 260 across our Kent-wide partnership of 115 schools. KMT offer training which leads to Qualified Teacher Status (QTS) and our partnership arrangement with The University of Leeds Beckett gives our trainees the opportunity to access a PGCE Top-Up qualification while they train or in the first two years of teaching. This offers Masters Level credits."}],"createdAt":"2021-07-06T17:46:32.718Z","updatedAt":"2021-09-17T16:18:06.141Z"}
