{"id":"6f88bf38-6cc5-4473-9619-496b9842af7b","name":"Redcar and Cleveland Teacher Training Partnership","code":"R16","type":"scitt","isAccreditedBody":true,"ukprn":"10005413","address":{"addressLine1":"Inspire 2 Learn","addressLine2":"Normanby Road","town":"South Bank","county":"Middlesbrough","postcode":"TS6 9AE"},"contact":{"website":"http://rcttp.org.uk/","email":"rcttpinfo@redcar-cleveland.gov.uk","telephone":"01642 513659","fullName":"Admin"},"location":{"latitude":54.5676107,"longitude":-1.1637704},"trainWithUs":"Redcar and Cleveland Teacher Training Partnership (RCTTP) is fully accredited initial teacher training provider. We were graded as Outstanding in all judgement areas following our most recent Ofsted Inspection.\nOur aim is to train reflective practitioners with the necessary skills to become committed, creative, enthusiastic and knowledgeable professionals, able to meet the demands of teaching in the 21st century.\nWhy Train with RCTTP?\n* We are a well established provider and have been successfully training teachers for over 15 years.\n* We are a small and highly supportive programme focussed on meeting the needs of the trainees.\n*We work with a network of primary and secondary schools in and beyond the Redcar and Cleveland area. * We have a very strong, mutually supportive relationship with our Partnership Schools.\n* Our high quality school-based training is underpinned by a comprehensive programme.\n* We have very high rates of employment with many of our trainees securing jobs within Redcar & Cleveland schools.\nFor more information about training with RCTTP please visit our [website](www.redcar-cleveland.gov.uk/gtp)","trainWithDisability":"Redcar and Cleveland Teacher Training Partnership welcomes all applications and would strive to meet any individual needs on a case by case basis.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:55:34.927Z","updatedAt":"2021-09-17T18:31:40.067Z"}
