{"id":"6fc9f92c-10dc-4967-854d-d379d4f0a39a","name":"Diverse Association for Professional Learning (formerly TVTSA)","code":"12K","type":"lead_school","isAccreditedBody":false,"urn":"137319","ukprn":"10034870","address":{"addressLine1":"Tuxford Academy","addressLine2":"Marnham Road","town":"Tuxford","county":"Nottinghamshire","postcode":"NG22 0JH"},"contact":{"website":"https://www.diverseassociation.org.uk/","email":"getintoteaching@diverse-ac.org.uk","telephone":"1777870001","fullName":"Elizabeth Rew"},"location":{"latitude":53.3186244,"longitude":-0.9604774},"trainWithUs":"Diverse Association for Professional Learning has been successfully running school direct programmes across primary and secondary phases since 2012. We have a number of secondary schools and over thirty five primary schools in the association, these are all quality assured by us and are located in and around Nottinghamshire, South Yorkshire and Lincolnshire.\nWe pride ourselves on a personal, tailored approach. We are a small, committed team who get to know you as individuals to support your journey into teaching. The choice of training school is led by you - you select the school for your training year, are interviewed in that school and hold relationships with your future team before your training even starts. We have well established relationships with all of the schools we work with and we collaborate with the understanding that the right choice of school is an essential and important part of the process. We are proud that some of our original cohort are now mentors for our current trainees. The employment rate for our trainees is high, with over half of each cohort being recruited directly into our partner schools. Please visit our website for more information - https://www.diverseassociation.org.uk/get-into-teaching/pathways-into-teaching/","trainWithDisability":"We welcome applications from all candidates, if you have a disability or other needs please add the information to the application form and we will strive to support you through the training year. There is a varying degree of disability access within our schools, If you would like to discuss this before applying please email getintoteaching@diverse-ac.org.uk There are no child care facilities at any of our schools however, many have nurseries close by.\nAll of the schools are accessible by car, many of the association schools are based near major towns and cities and so can be accessed by public transport.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:54:44.959Z","updatedAt":"2021-10-14T21:08:25.682Z"}
