{"id":"6fe22ffb-07ca-4ea5-9203-2d8d17aaa68d","name":"Oxford University","code":"O33","type":"hei","isAccreditedBody":true,"ukprn":"10007774","address":{"addressLine1":"Department of Education","addressLine2":"15 Norham Gardens","town":"Oxford","county":"Oxfordshire","postcode":"OX2 6PY"},"contact":{"website":"https://www.ox.ac.uk/admissions/graduate/courses/pgce?wssl=1","email":"pgce.admissions@education.ox.ac.uk","telephone":"1865274020","fullName":"PGCE Office"},"location":{"latitude":51.7636757,"longitude":-1.2557905},"trainWithUs":"The PGCE course at the University of Oxford’s Department of Education offers you the opportunity to train to teach the secondary age group in one of the leading educational establishments in the country. The Department has a long history in initial teacher education, dating back to 1892, with the current Internship Scheme operating for over a quarter of a century.\n\nThe Oxford Internship Scheme was rated Outstanding in its last Ofsted inspection. Oxford’s Department of Education is committed to providing high quality teacher education as well as being a centre for educational research. The University of Oxford has retained top spot for an impressive sixth consecutive year in the Times Higher Education World University Rankings 2022. Within the same metric the University of Oxford has also been ranked first for the subject of Education.\n\nWe pride ourselves on the intensive, flexible and personalised experience that we are able to offer. Our well-established partnership with local schools is recognised as a particular strength and there is joint responsibility for the planning, delivery and assessment of the programme. We recognise the different roles of university and schools in offering trainee teachers opportunities to learn and encourage the use of theory to interrogate practice and vice versa.\n\nTrainee teachers awarded the PGCE qualification are recommended for Qualified Teacher Status. In addition, successful completion of the PGCE at Oxford comes with 60 Master’s level credit points.","trainWithDisability":"The University as a whole supports over 3,000 students who have declared a disability, including specific learning difficulties (such as dyslexia and dyspraxia), long-term health conditions, mental health difficulties, mobility difficulties, sensory impairments and autism spectrum disorders.\nA range of support and reasonable adjustments are available to those with a declared disability or health condition on the PGCE course. This includes: finding appropriate college accommodation, considering travel times to placement schools and ease of movement around the school site, and having more regular tutor support meetings. Support with academic writing is also available if you have a specific learning difficulty.\nMore information is available from the [University’s Disability Advisory Service](https://www.ox.ac.uk/students/welfare/disability)","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"createdAt":"2021-07-06T17:49:49.727Z","updatedAt":"2021-10-04T16:36:15.663Z"}
