{"id":"70891310-458b-4fb9-aaa0-91349926edc6","name":"Penistone Area Partnership","code":"1X5","type":"lead_school","isAccreditedBody":false,"urn":"106653","ukprn":"10005790","address":{"addressLine1":"Huddersfield Road","addressLine2":"Penistone","town":"Sheffield","county":"South Yorkshire","postcode":"S36 7BX"},"contact":{"website":"http://www.penistone-gs.uk","email":"ite@penistone-gs.uk","telephone":"01226 762114","fullName":"Ian Richards"},"location":{"latitude":53.5355085,"longitude":-1.6389312},"trainWithUs":"The Penistone and Area Partnership is a fantastic place to work and learn. It provides a school-based learning opportunity in partnership with Sheffield Hallam University. This is an inspirational partnership of 12 primary schools and 5 secondary schools, many of which have achieved Good or better Ofsted ratings. In 2018 PGS achieved their best results with 81% of students achieving a grade 4 or above in English and Maths, with 62% grade 5 or above. In Science, 86% of students achieved 2 passes at grade 4 or above and 33% achieving grade 7 or above in both, placing PGS in the top 20% of schools nationally. The success continued in A Level with 47% of students achieving A*/A, an ALPs score of 2, putting PGS in the top 5% of providers in the country. 2019 saw the school continue with string progress with Post-16 placing top 10% in the country.\nThe vision, shared by all the schools, is straightforward but powerful – ‘the highest standards of education and care for all’. We try to create an environment in which staff, pupils and trainee teachers feel valued and supported.\nThe schools in the partnership have all worked with trainee teachers for many years and fully recognise how much vibrancy, enthusiasm and drive they can offer to a school community. A School Direct placement with us will provide an excellent experience, fully equipping you to excel in your ECF and beyond.","trainWithDisability":"We consider applications from everyone, if you wish to discuss your application further please don’t hesitate to contact the partnership.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:47:54.820Z","updatedAt":"2021-09-16T17:48:52.360Z"}
