{"id":"708e7649-8652-41ba-8b1f-a78a6f9ec3b0","name":"Washington and Chester le Street Teacher Training Alliance","code":"2W4","type":"lead_school","isAccreditedBody":false,"urn":"108818","ukprn":"10068929","address":{"addressLine1":"Vigo Lane","town":"Washington","county":"Tyne and Wear","postcode":"NE38 9EZ"},"contact":{"website":"www.rickletonprimary.co.uk/topic/train-to-teach","email":"alan.baker@rickletonprimary.co.uk","telephone":"1914155050","fullName":"Alan Baker"},"location":{"latitude":54.8786917,"longitude":-1.5514259},"trainWithUs":"Our partnership has been established to offer local people the chance to train to teach in local schools, who offer warm, friendly mentorship in the hope of creating an outstanding workforce for the future of our children.\nAll of the schools in our partnership are in the close vicinity of the Washington and Chester le Street area. The short distance between our schools means that support between trainees and our partnership of schools is always close at hand. Trainees truly become part of our training 'family' and benefit from the strong, local relationships this creates.\nTraining 'School Direct' is the most hands-on, practical way to gain qualified teacher status, ensuring that you become an integral part of your home school and see the life of a school from day 1 in September for the full academic year - perfect preparation for the year after when you go it alone as a qualified teacher. Future employment of trainees in their home school, partner schools or within the local area by word of mouth is the focus of our training.","trainWithDisability":"Our partnership of schools are supportive of equality and diversity, being keen to welcome any candidates who are committed to the profession and keen to learn from our experienced mentors.\n\nThe close proximity of our schools, and the university, ensures that trainees are easily supported and never presented with undue travel or access issues no matter which establishment they need to attend.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"926804ac-be7a-4f0a-97f9-a26a5f5f032a","code":"S84","name":"University of Sunderland","description":"By joining with the University of Sunderland Education Department, we offer our trainees access to high quality, theoretical training via a one day a week release and ongoing assessment through online evidencing, with an education department recently recognised for its quality by the Guardian University guide. \\r\\n\\r\\nA clear routine, in which trainees are based in their school from Monday to Thursday and released to the University each Friday, benefits pupils, staff and trainees in establishing clear working patterns."}],"createdAt":"2021-07-06T17:52:01.080Z","updatedAt":"2021-08-29T17:56:33.815Z"}
