{"id":"70a77e57-f3e3-4562-91e7-94b969caf179","name":"Godalming Learning Partnership","code":"2JT","type":"lead_school","isAccreditedBody":false,"urn":"125200","ukprn":"10003614","address":{"addressLine1":"The Headteacher, The Chandler CofE Junior School","addressLine2":"Middlemarch, Roke lane","town":"Witley","county":"Surrey","postcode":"GU8 5PB"},"contact":{"website":"https://www.getteaching.org/","email":"director@godalminglearning.org.uk","telephone":"7495879164","fullName":"Andrew Smith"},"location":{"latitude":51.1527684,"longitude":-0.6490721},"trainWithUs":"The Godalming Learning Partnership is a group of 13 schools (Infant, Junior and Primary) that serve the children (aged 3 – 11) and families of the Godalming area. We are a strong collaborative group with a long history of working closely together to achieve more for our young people, schools and community. Our work is based on teaching, learning and developing our staff and schools as fully as possible.\nIf you train to be a teacher with The Godalming Learning Partnership you will:-\n•\tJoin our wide diversity of successful schools.\n•\tBe educated and trained by experienced Headteachers and lead professionals from across our community of schools.\n•\tHave your programme guided and taught by a University provision rated ‘outstanding’ by Ofsted.\n•\tReceive your school based theory training through the modelling of Primary teaching methods.\n•\tLearn how to teach and become free thinking teachers through total immersion in our education community.\n•\tBenefit from access to job opportunities in all our schools.\n•\tWork with schools that understand the demands of the profession who will actively try to prepare teachers for the demands of the job, both in the initial training and in the early years of teaching.","trainWithDisability":"Your well-being is a top priority and we will do all we can to give you the chance to flourish and maximise your potential. In partnership with the University of Winchester there is a dedicated student support team to help with any questions or challenges you might experience during your studies. \n\nWe work with you to support your well-being and mental health, provide confidential advice and offer workshops to boost your academic skills. If you have a disability or learning difference, we encourage you to get in touch before you apply so we can discuss tailored support for your individual needs.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:48:48.047Z","updatedAt":"2021-09-16T20:51:00.888Z"}
