{"id":"71aaa47a-b3ed-423c-b8e8-14dca17f28ed","name":"MAITT (Merseyside Alliance Initial Teacher Training)","code":"168","type":"lead_school","isAccreditedBody":false,"urn":"104557","ukprn":"10003957","address":{"addressLine1":"Merseyside Alliance ITT","addressLine2":"Dingle Lane","town":"Liverpool","county":"Merseyside","postcode":"L8 9UB"},"contact":{"website":"http://www.maitt.org.uk","email":"l.bauress@matthewarnold.co.uk","telephone":"0151 539 0300","fullName":"Linzi Bauress"},"location":{"latitude":53.3787424,"longitude":-2.9614098},"trainWithUs":"Established in 2012, MAITT has a 9 year proven track record of working in partnership Liverpool John Moores University (OFSTED Outstanding) to develop outstanding newly qualified teachers (NQT). We offer both a tuition (PGDE) and a salaried route (PGCE) into general primary teaching and a tuition general primary with PE (PGDE)\nTrainees who complete the tuition route gain a Postgraduate Diploma in Education (PGDE) with QTS. This route includes 120 credits towards a Masters qualification. In 2021, 100% of our tuition trainees (PGDE) trainees and our salary trainees (PGCE) successfully completed our programme. We have strongly established partnerships with schools across Liverpool, which offer a diverse range of settings. Our experienced mentors are committed to developing highly skilled professionals. MAITT is committed to high quality teacher training. Our training programme is enhanced by the use of experienced and outstanding current practitioners to deliver subject knowledge and professional study sessions in our bespoke, modern training centre. Trainees are well supported through our programme, including preparation for securing an NQT position.\nAt MAITT we are committed to ensuring both our children and trainees have a fantastic school experience. We hold an annual matching day for our tuition trainees to match them with a placement school which will allow them to thrive and develop their ability to be an outstanding and reflective practitioner. [MAITT](https://maitt.org.uk/)","trainWithDisability":"LJMU is committed to Equality of Opportunity and proud of the help we offer. The Disability Advice Team will help you access the support you need. The best time to contact the Disability Advice Team is before you start your course. By contacting the team before you begin and disclosing your disability, you'll be able to receive support from when you arrive. Email: disability@ljmu.ac.uk Tel: 0151 231 3164/3165.\nIf you need an Individual Student Learning Plan (ISLP) which sets out the type of support you may need and who is responsible for ensuring your support is in place, this will be put in place by an LJMU Disability Adviser once you have met to discuss your needs. Once finalised, your plan will be sent to you via email. As soon as you have agreed the ISLP it will be sent to your Disability Coordinator and then, with your agreement, passed on to the relevant academic and support staff.\nAll trainees are encouraged to disclose any specific learning need that they experience, in order to make any adjustments, both at LJMU and within our Partner Schools. As part of the enrolment process to Teacher Training Programmes all students are required to complete a Health Questionnaire and some may be asked to attend a screening appointment with our Occupational Health Unit. This is designed to ensure that arrangements are in place, from the outset, to support any students who may need additional support or reasonable adjustments to be made.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"ec34b77c-cba3-4598-93be-23f0471adff1","code":"L51","name":"Liverpool John Moores University","description":"Our accredited body, Liverpool John Moores University has an established reputation for high quality Teacher Training. The LJMU Partnership’s 2019 OFSTED inspection outcomes were the best on Merseyside with Primary provision graded Outstanding and Secondary programmes judged to be Good. Our Partnership with LJMU ensures that our teachers develop a deep and research-informed understanding of subjects, the curriculum, learners and learning. The Postgraduate Award from LJMU is co-designed to ensure that teaching and assignments are embedded in classroom practice. There is significant academic and pastoral support from LJMU, whose staff also visit our students and their mentors on placement."}],"createdAt":"2021-07-06T17:50:41.462Z","updatedAt":"2021-10-01T19:04:09.941Z"}
