{"id":"71c8bb7d-fdb6-4856-bf37-5d9ff775b692","name":"Bowes Primary School","code":"189","type":"lead_school","isAccreditedBody":false,"urn":"143201","ukprn":"10057790","address":{"addressLine1":"Bowes Primary School","addressLine2":"Bowes Rd","town":"Arnos Grove","county":"London","postcode":"N11 2HL"},"contact":{"email":"michelle.williams@bowesprimaryelt.org","telephone":"07957 076602","fullName":"Kelly Hitchcock"},"location":{"latitude":51.6132359,"longitude":-0.1258114},"trainWithUs":"Bowes Primary School is a Lead School for Postgraduate Teaching Apprenticeships and School Direct (tuition fee) placements. We have a number of partnership schools working with us to deliver fantastic teacher training. We work in partnership with Middlesex University to grow our next round of future teachers and leaders. Bowes Primary School has worked with trainee teachers for over 15 years, with a large number of our previous School Direct and Graduate Teachers trainees now employed in middle and senior leadership roles. We currently have 8 trainees (2021-22) and had 10 trainees (2020-2021) in seven local partnership schools. We work very closely on Initial Teacher Training and are able to provide cross phase opportunities. The schools in our Trust offer a range of experiences, working alongside happy and friendly children, and hardworking and ambitious staff. All the schools have experience of teacher training and are able to coach and mentor trainees through the programme, producing good and outstanding trainees who go on to complete their ECT Induction with confidence.","trainWithDisability":"Within our partnership of schools and alongside Middlesex University we aim to provide an inclusive environment which caters for all trainees. We have supported trainees with disabilities and other needs, including dyslexia and mental health conditions. Accessibility varies between locations, including some schools which are located over three floors with no lift access. However, this can be discussed and appropriate locations identified.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:53:49.112Z","updatedAt":"2021-11-05T00:37:15.620Z"}
