{"id":"71fd55ea-8aac-4a09-b85e-0064c72f5be6","name":"Pennine Lancashire Alliance","code":"1FS","type":"lead_school","isAccreditedBody":false,"urn":"119767","ukprn":"10002921","address":{"addressLine1":"Broadway","addressLine2":"Haslingden","town":"Rossendale","county":"Lancashire","postcode":"BB4 4EY"},"contact":{"website":"http://www.haslingdenhigh.com","email":"schooldirect@haslingdenhigh.com","telephone":"01706 215726","fullName":"Sally Finney"},"location":{"latitude":53.6895984,"longitude":-2.3204818},"trainWithUs":"In partnership with the University of Cumbria the Pennine Lancashire Alliance offers an exciting, school based approach to Initial Teacher Training.\nAs a trainee on the School Direct Programme you will be working alongside expert practitioners in secondary schools within East Lancashire, spending more of your time in the classroom than on a traditional PGCE. You will be in school from the first day of the school year so you will feel part of the team and be fully immersed in all aspects of school life from day one. You will be trained in a highly supportive environment and will be given the opportunity to develop the professional knowledge, understanding and skills necessary for the challenge of teaching in the 21st century. As part of this you will benefit from the use of an iPad for the duration of the course and will learn how to use Apple technologies to enhance teaching and learning in the classroom.\nOur Alliance consists of a diverse partnership of secondary schools led by Haslingden High, a large successful 11-18 school, with a mixture of other large, small, urban, rural, faith and grammar schools. We provide a unique opportunity to experience a broad and contrasting range of teaching and training experiences. Our schools have a successful track record in providing high quality teacher training and share a commitment to developing outstanding teachers of the future.\nAll our trainees have gone on to secure teaching posts following successful completion of the PGCE.","trainWithDisability":"Applicants with disabilities and any special needs should let us know on their application so they can be considered for placements at appropriate schools and adjustments can be made.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:51:00.484Z","updatedAt":"2021-07-06T21:40:28.050Z"}
