{"id":"720894da-360a-4f7a-9835-7ce7beb3c6de","name":"Teaching London: LDBS SCITT","code":"L59","type":"scitt","isAccreditedBody":true,"ukprn":"10046787","address":{"addressLine1":"2 West End Lane","town":"London","county":"London","postcode":"NW6 4NT"},"contact":{"website":"www.teachinglondon.org","email":"admin@teachinglondon.org","telephone":"2079321126","fullName":"Enquiries"},"location":{"latitude":51.5383869,"longitude":-0.1931658},"trainWithUs":"An Outstanding provider (Ofsted: 2017), Teaching London: LDBS SCITT puts pupils at the heart of your training. The depth and breadth of our programme enables you to gain the confidence and competence to develop into a highly skilled, responsive and effective teacher. Exciting, interactive and rigorous centre-based sessions will inform and support your classroom practice, led by inspiring and experienced tutors. Your growth as a reflective practitioner is underpinned by the PGCE element, routed in school-based and current research. We are committed to your wellbeing during your training and support your future, with 100% of trainees gaining employment in the profession over the past 6 years.\nTeaching London has been training teachers for over 20 years and we are highly effective in our role, with 76% of trainees graded as Outstanding at the end of their training in 2017-18.","trainWithDisability":"The well-being of our trainees is paramount, which is why you will be automatically enrolled into the Employee Assistance Programme with the Education Support Partnership. This provides 24/7 individual support and counselling, in addition to our in-house advice and support.\n\nWe have experience in supporting trainees with a diagnosis of dyslexia and are able to offer specialist support on the course.\n\nOur centre has a degree of step-free access, but as our building was a Victorian school, we are unable to fully accommodate wheelchair access. We are always willing to discuss, and where possible, adapt to meet individual needs.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:56:04.021Z","updatedAt":"2021-07-28T01:05:26.040Z"}
