{"id":"728bdb90-941c-4a34-af32-02b501dff390","name":"Learning Futures Partnership","code":"1UY","type":"lead_school","isAccreditedBody":false,"urn":"138036","ukprn":"10037011","address":{"addressLine1":"Carr Lane","town":"Wigan","county":"Greater Manchester","postcode":"WN3 5NY"},"contact":{"website":"learningfuturespartnership.net","email":"enquiries@learningfuturespartnership.net","telephone":"01942 204640","fullName":"Tyldesley Primary School- Headteacher"},"location":{"latitude":53.5234288,"longitude":-2.6365075},"trainWithUs":"Teacher Training with Learning Futures Partnership, Wigan.\nOur mission is to recruit, develop and retain exceptional professionals by offering highly supportive initial teacher training in and around the Wigan area.\nLearning Futures Partnership are a collaboration of like-minded educational establishments: Byrchall High School ;Fred Longworth High School; Hawkley Hall High school; Kirkby High School; Winstanley college and Tyldesley Primary.\nLearning Futures partnership have high quality teacher training at their heart, we pride ourselves on our bespoke programme that responds to your needs. Our on site training is delivered by outstanding practitioners who are proven in Teaching and Learning. At Learning Futures Partnership we are invested in your development and will support you with your application from the very first time you contact us. We will arrange experience in your school of choice and provide advice regarding additional research and funding.\nLearning Futures Partnership offers 3 ITT routes:\nPrimary\nSecondary Secondary with FE\nApplicants that are hoping to teach a subject that is not sufficiently related to their first degree but have an A’level in this subject can complete a Subject Knowledge Enhancement course in one of the following subjects.\nbiology\nchemistry\ncomputing\ndesign and technology\nEnglish\nlanguages\nmathematics\nprimary mathematics\nphysics\nreligious education","trainWithDisability":"We are committed to supporting trainees with disabilities and other needs and aim to be an inclusive provider. We strive to support all our trainees in collaboration with the University of Cumbria. All Alliance schools provide access for students with mobility impairments. Specific mobility issues for the individual schools will be addressed in collaboration with you.\nDisabled Students’ Allowance(DSA) — students with a disability or specific learning difficulty may be eligible to receive help towards enabling costs; e.g. non-medical helper, specialist equipment etc.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"9be9f611-2d36-431a-9109-7fcbbfc88fc8","code":"C99","name":"University of Cumbria","description":"\\r\\nThe UOC is highly-rated by OFSTED as a provider of successful teachers. 9 /10 of graduates are in work/further study within 15 months of graduating (HESA Graduate Outcomes Survey 2020).Masters credits units receive highly personalised support from their university link tutor.\\r\\nAdditional bursaries are available e.g. assist with childcare costs.\\r\\nParents’ Learning Allowance/means-tested on household income. Maximum available £1,821. A maximum of 85% of your weekly childcare costs may be paid on your behalf/up to £62 per week for one child and £307.95 per week for two or more children. \\r\\n\\r\\nAdult Dependants’ Grant- means-tested on household income. Maximum available £3,190"}],"createdAt":"2021-07-06T17:47:11.890Z","updatedAt":"2021-07-18T21:17:58.215Z"}
