{"id":"72942f57-0ea8-4426-86fd-fa260f055e9d","name":"Valley Trust (formerly TRISIS)","code":"2HM","type":"lead_school","isAccreditedBody":false,"urn":"107580","ukprn":"10000880","address":{"addressLine1":"Brighouse High School","addressLine2":"Finkil Street","town":"Brighouse","county":"West Yorkshire","postcode":"HD6 2NY"},"contact":{"website":"http://www.brighouse.calderdale.sch.uk","email":"j.brierley@brighouse.calderdale.sch.uk","telephone":"1484710408","fullName":"Kath Jackson"},"location":{"latitude":53.713135,"longitude":-1.795992},"trainWithUs":"The Valley Learning Partnership has a strong focus on staff development and support. We pride ourselves in the bespoke provision offered to trainees and colleagues at differing stages of their careers and believe that life-long learning is the key to effective teaching and a happy workforce. The Valley Learning Partnership and its lead schools (Brighouse High School /The Brooksbank School) has a track record of developing skilled teachers who are fully equipped to enter the secondary phase of teaching, working with young people form the age of 11-18. If you are searching for a high quality, supportive and innovative school based route into teaching, The Valley Learning Partnership could very well be the place for you. The school and its partner schools are easily accessible from a wide area including Leeds and Manchester yet are at the heart of the local community and, on choosing us, you will become part of that team and our community. Beyond the school itself we have strong links and effective partnerships with schools in the local area and beyond and our work with The University of Huddersfield ensures that our trainees are always up to date with the latest developments in education and training. Our overarching aim is provide you with a route into one of the most rewarding professions and to ensure that your time training with us is memorable, enjoyable and equips you with the desire and the skills to become a key player in the next generation of teachers.","trainWithDisability":"We invite applications from suitably qualified persons from all backgrounds regardless of race, disability, religion, belief or sexual orientation. We are committed to supporting trainee teachers with a range of needs including specific learning difficulties, long-term medical conditions, mobility or physical disabilities or conditions, hearing impairments, visual impairments and social communication difficulties. Each of our partner schools has individual access arrangements but all schools in The Valley Learning Trust are Disability Discrimination Act (DDA) compliant and we endeavour to place you in a school that meets your needs.\nIn addition, The University of Huddersfield’s Wellbeing and Disability Service works with students with a range of disabilities and long-term conditions that have a significant impact on their ability to study. Their main aim is to work alongside you to get the right support in place at the right time as we believe that nothing should stop you achieving what you're capable of.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"791f82c8-19fd-4339-9c7b-301dee8067ce","code":"H60","name":"University of Huddersfield","description":"We are proud of the successful, close working relationship we have had with The University of Huddersfield as our provider over many years. The University of Huddersfield has been developing great teachers since 1947 and has a track record of producing highly skilled teachers for the early years, primary, secondary and lifelong learning (post-16) sectors. If you are looking to pursue a career in teaching and want high quality training, then working with The Valley Learning Trust and The University of Huddersfield could be the perfect choice."}],"createdAt":"2021-07-06T17:56:31.009Z","updatedAt":"2021-08-23T19:55:07.863Z"}
