{"id":"72b36754-3b31-4424-923d-398249ec84d2","name":"Riding Forward Education Alliance","code":"1PU","type":"lead_school","isAccreditedBody":false,"urn":"117889","ukprn":"10073374","address":{"addressLine1":"St. Leonard’s Road, Molescroft","addressLine2":"Molescroft","town":"Beverley","county":"East Riding of Yorkshire","postcode":"HU17 7HF"},"contact":{"website":"www.ridingforward.net","email":"jlines@molescroftprimary.net","telephone":"01482 679139","fullName":"Mrs Andrea Tonks"},"location":{"latitude":53.8525272,"longitude":-0.4421611},"trainWithUs":"We have developed exciting and effective programmes with an outstanding SCITT, Yorkshire Wolds Teacher Training.\nOur programmes last for the full academic year, during which time trainees are based in a host school with excellent experience in supporting with ITT, alongside attending professional studies sessions at the Yorkshire Wolds Teacher Training base.\nSchool Direct places are available in well regarded Early Years and Primary classrooms within the East Riding of Yorkshire.\nOur School Direct programmes have been designed to give trainees the necessary skills to become an effective classroom practitioner.\nOn successful completion of the training, trainees are awarded a PGCE with QTS.","trainWithDisability":"We're here to fully support you in achieving academic success.\nThe training base and school environment can sometimes present certain issues or challenges. We help students work together with staff to help to overcome any barriers to you reaching your best.\nIn some circumstances in may be necessary for successful applicants to undergo a fitness to teach assessment with Yorkshire Wolds Teacher training.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"4cc0d82a-c0fc-4661-b1e0-4080bc75b27b","code":"2EV","name":"Yorkshire Wolds Teacher Training","description":"Yorkshire Wolds Teacher Training (YWTT SCITT) was judged ‘Outstanding’ across all areas of its Ofsted report in October 2019.\\r\\n\\r\\nYWTT provides excellent training facilities with both primary and secondary simulated classrooms purposefully designed to enhance the programme delivery. YWTT provides a bespoke training experience for all our trainees and the Leadership has a wealth of experience and have a hands on approach to supporting all trainees to enable them to become the very best practitioners to ensure the next generation flourish."}],"createdAt":"2021-07-06T17:54:20.849Z","updatedAt":"2021-07-06T19:44:06.571Z"}
