{"id":"734e77d9-fc98-430c-b475-7264dd34be81","name":"South of Tyne Primary Alliance","code":"2JZ","type":"lead_school","isAccreditedBody":false,"urn":"144220","ukprn":"10007159","address":{"addressLine1":"South of Tyne Primary Alliance","addressLine2":"Well Bank Road","town":"Washington","county":"Tyne and Wear","postcode":"NE37 1NL"},"contact":{"website":"http://www.georgewashington.sunderlandschools.org/","email":"teachertraining@gwps.org.uk","telephone":"1914906453","fullName":"Bryony Parrish"},"location":{"latitude":54.9176861,"longitude":-1.5344825},"trainWithUs":"We are a cluster of dynamic primary schools south of the Tyne in Washington, Sunderland and Gateshead: George Washington, John F Kennedy, Valley Road, Highfield and Kibblesworth. Although diverse in location and context, we share high aspirations for all and are committed to personalised learning and development. Our schools have a proven record of high achievement in English and maths. We also have strengths in provision for vulnerable pupils including those with special educational needs and disabilities.\nOur experience of raising standards and closing the gap for disadvantaged children means that we can support trainees to provide the best experience for all children in their care. Well-established and effective systems for assessment mean that trainees will learn how to track and manage pupil progress. We promote the development of the whole child through enriching curriculums, music, art, performing arts and forest schools.\nOur schools are friendly and happy environments. We pride ourselves on being welcoming places to work and learn, ready to support trainees and ensure they gain the best possible preparation for life as a teacher. \"I had an excellent experience while on my alternate placement at George Washington Primary, receiving support from all members of staff.\" Michelle Anderson, SD trainee \"The support provided was invaluable. I really enjoyed being involved in all aspects of school life. George Washington provided the opportunity to build the skills and confidence needed for teaching, while Highfield helped me to apply these and develop different teaching strategies.\" Roxanna Bayat, SD trainee","trainWithDisability":"We celebrate and value the diversity of all students and staff, working to ensure that all are welcome in our school communities and do not face discrimination or encounter barriers with regard to their disability or mental health difficulty. The University of Sunderland Disability Support Team provides advice, information and guidance to students with a disability; students with mental illness or mental health difficulties; students with Specific Learning Difficulty (SpLD) such as dyslexia. On application please contact the Disability Support Team for disability-related queries:\nWebsite: Disability Services Email: disability.support@sunderland.ac.uk\nTel: 0191 515 2952","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"accreditedBodies":[],"createdAt":"2021-07-06T17:47:02.484Z","updatedAt":"2021-11-04T20:12:13.691Z"}
