{"id":"738ec0cb-f449-4ce9-b414-3f78a61c24b8","name":"The Beach","code":"2DT","type":"lead_school","isAccreditedBody":false,"urn":"144918","ukprn":"10065038","address":{"addressLine1":"The School House","addressLine2":"Selworthy Road","town":"Weston-super-Mare","county":"North Somerset","postcode":"BS23 3ST"},"contact":{"website":"https://www.sciltraining.co.uk/scitt/","email":"info@thebeach.extendlearning.org","telephone":"01934 427138","fullName":"Sarah Edwards"},"location":{"latitude":51.3357734,"longitude":-2.9667563},"trainWithUs":"The BEACH was founded by teachers, for teachers at Bournville Primary School in 2016 to offer support and deliver professional development opportunities to teachers and schools around the UK. We are part of the Extend Learning Academies Network Trust which is made up of eight primary schools based in the South West and are committed to providing high quality Initial Teacher Training encompassing:\n*training and hands on experience of working with disadvantaged pupils. *additional research based training encompassing pedagogy *behaviour management training *An accreditation for a two and a half day Learning Outside the Classroom course.\nYou will train in at least two good schools, getting the chance to learn 'on the job'. You'll be part of a team from the very start, receiving intensive support from experienced teachers and mentors.\nPlease contact us for an informal chat or to arrange a visit.\ninfo@thebeach.extendlearning.org Apply online and select The Beach Teaching School","trainWithDisability":"The Beach Teaching School provides teacher training across 8 schools. Accessibility in 3 of these schools is excellent for those with physical disabilities.\nWe are able to cater for candidates with a variety of different needs in a supportive and caring environment.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:46:52.598Z","updatedAt":"2021-11-01T21:33:38.547Z"}
