{"id":"73992eb0-6bc3-4724-ad76-41668c61a222","name":"Astra Aylesbury Hub","code":"2KM","type":"lead_school","isAccreditedBody":false,"urn":"136846","ukprn":"10032610","address":{"addressLine1":"Aylesbury High School","addressLine2":"Walton Road","town":"Aylesbury","county":"Buckinghamshire","postcode":"HP21 7SX"},"contact":{"website":"http://www.ahs.bucks.sch.uk/about-the-school/initial-teacher/","email":"sjeffreys@ahs.bucks.sch.uk","telephone":"1296388222","fullName":"Amanda Brigden"},"location":{"latitude":51.8125456,"longitude":-0.8029826},"trainWithUs":"At Astra, we see you as an individual and as a leader of the future. From the very beginning of your training year, you will be treated as a member of staff in your placement school, attending staff meetings, parents’ evenings and development days. Your main placement school will be in one of our wide networks across Buckinghamshire or Hertfordshire. See our website, www.astra-alliance.com, for a full list of our schools. Your professional studies training will take place every Wednesday and the sessions will be hosted either online or at local venues, including partnership schools. For unsalaried trainees doing the PGCE, six taught sessions take place across the year. During your training, you will also be assigned an in-school Mentor and an ITT Coordinator. Secondary trainees will also have a Subject Tutor. These colleagues, alongside a designated university tutor (for PGCE trainees), will monitor your progress and support you on your learning journey, framed around the government’s Core Content Framework. All Astra staff are experienced teachers and are required to undertake a regular and rigorous programme of professional development.","trainWithDisability":"Astra trainees will be assessed through our Occupational Health service before starting the course in order to ensure they meet the “Fitness to Teach” requirements. This is also to help us identify any additional needs which will require support during the programme. We are experienced in making necessary adjustments to help facilitate trainees with disabilities and other conditions, including dyslexia (eg making training slides available in advance where possible), physical, hearing and visual impairments (eg providing handouts on specific coloured paper; supporting the use of specific software); and mental health conditions, to ensure they are not disadvantaged in any way. If a preferred main location was not fully accessible for a trainee, we would find an alternative wherever possible. Astra gives all trainees full access to an Employee Assistance Programme which can provide access to counselling and other support and advice where appropriate.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"bc8e285b-005d-4ab8-b447-784ddf2f2657","code":"28E","name":"Astra SCITT","description":"The Astra SCITT is a diverse and supportive network of over 50 schools, founded on the principles of ‘Excellence; Collaboration; Innovation; Support’ and offering a talented and dedicated team of staff as well as a professional working environment and forward-looking technology systems. We are rated ‘Outstanding’ by Ofsted (2018) and we offer School Direct QTS salaried, bursary-led/unsalaried QTS or QTS \\u0026 PGCE full and part time programmes in a wide range of subjects and phases. \\r\\n\\r\\nAstra is also one of only 87 national Teaching School Hubs, accredited by the DfE to offer support within and beyond the training year."}],"createdAt":"2021-07-06T17:49:21.884Z","updatedAt":"2021-09-15T15:39:17.510Z"}
