{"id":"7418d067-7a21-4e3c-a61b-58cc91596a1e","name":"Stevenage Schools’ Partnership","code":"2C8","type":"lead_school","isAccreditedBody":false,"urn":"117530","ukprn":"10006765","address":{"addressLine1":"The Nobel School","addressLine2":"Mobbsbury Way","town":"Stevenage","county":"Herts","postcode":"SG2 0HS"},"contact":{"website":"http://thenobelschool.org/about-the-school/school-direct-training","email":"ITT@nobel.herts.sch.uk","telephone":"01438 222600","fullName":"Shelagh Mackey"},"location":{"latitude":51.9112272,"longitude":-0.1687404},"trainWithUs":"The Stevenage Schools’ Partnership has extensive experience of training teachers. We work with over 20 schools in Stevenage, including primary, secondary and special schools. We offer School Direct salaried and unsalaried teacher training routes across the full range of secondary curriculum subjects and primary phases. Our mentors receive excellent training in order to support you to become excellent practitioners. Alongside the University of Hertfordshire, our partnership schools work hard on supporting trainees to develop their academic subject knowledge as well as their understanding of pedagogy. You will be based at school for 4 days a week and spend one day of the week at university. In the spring term you will spend six weeks in another school.","trainWithDisability":"Each year the University of Hertfordshire welcomes a significant number of students who disclose a disability and/or have other needs. The University seeks to create a fair, inclusive culture where everyone feels valued and respected.\nThe University of Hertfordshire is committed to promoting equality of opportunity to ensure that it meets the needs of disabled people and has policies that are intended to support all students both in their studies and in developing their professional practice.\nIf you have a disability or other need we encourage you to disclose this and any other relevant information that could support your studies.\nThe School of Education at the University of Hertfordshire provides both academic and practice placement support for teachers in training with disabilities and other needs.\nOne key aspect of the PGCE course is to raise awareness of mental health and well-being and to support the removal of unnecessary workload. [University of Hertfordshire disability support](https://www.herts.ac.uk/life/student-support/disability-services)\n[University of Hertfordshire statement on disability disclosure by students](https://www.herts.ac.uk/life/student-support/disability-services/statement-on-disability-disclosure-by-students).","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:52:08.824Z","updatedAt":"2021-09-17T15:23:00.864Z"}
