{"id":"741b762e-b8eb-43ae-b93e-9ec2e43495bf","name":"George Abbot SCITT School Direct","code":"1OV","type":"lead_school","isAccreditedBody":false,"urn":"136906","ukprn":"10055368","address":{"addressLine1":"George Abbot School","addressLine2":"Woodruff Avenue","town":"Guildford","county":"Surrey","postcode":"GU1 1XX"},"contact":{"website":"www.georgeabbottraining.co.uk","email":"contactscitt@georgeabbot.surrey.sch.uk","telephone":"01483 888048","fullName":"Lyndsay Cameron"},"location":{"latitude":51.2524787,"longitude":-0.5453282},"trainWithUs":"George Abbot SCITT is a highly respected and well-established provider delivering school-based Initial Teacher Training (ITT) in a wide-range of schools across Surrey, Hampshire and West Sussex. We offer Primary and Secondary teacher training on a full-time basis or part-time basis. There is an option to specialise in Special Educational Needs (SEND).\nWith 20 years’ experience leading ITT, we offer practical training in a variety of schools, with experienced practitioners to mentor you through the course. Our provision across the partnership is rated as “Outstanding” by Ofsted, as well as by our past trainees. We pride ourselves on knowing our placement schools and our trainees well. We invest in finding a good match between our trainees and their placement school. We are also proud to say that we have high completion and employment rates at the end of our training programmes.","trainWithDisability":"George Abbot SCITT has trained teachers with a variety of individual needs. We are able to adjust our programme accordingly.\nShould you be invited to interview, you will be asked to disclose any needs you may have so that we can support you appropriately.\nIf you would like to discuss how we could support you during training with your needs, please do get in touch on 01483 888048.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:55:53.920Z","updatedAt":"2021-09-30T17:57:21.496Z"}
