{"id":"74257f90-0cf3-49f1-a882-3e50d9631d54","name":"Our Lady and St Hubert’s Catholic Primary School","code":"262","type":"lead_school","isAccreditedBody":false,"urn":"141926","ukprn":"10049319","address":{"addressLine1":"Moat Road","town":"Oldbury","county":"West Midlands","postcode":"B68 8ED"},"contact":{"website":"http://www.st-huberts.sandwell.sch.uk","email":"shape@st-huberts.sandwell.sch.uk","telephone":"01214 222629","fullName":"Michelle Crawford"},"location":{"latitude":52.4837403,"longitude":-2.0022409},"trainWithUs":"Our Lady & St Hubert’s Catholic Primary School is a place where, as quoted in our latest Ofsted report, ‘outstanding teaching happens every day’. A family atmosphere ripples throughout every aspect of our school days, underpinned by values which drive our Catholic life and ethos forward. You can view our latest inspection report [here](https://reports.beta.ofsted.gov.uk/provider/21/103999)\nIt gives an insight into the rapid and sustained progress children make and their outstanding behaviour. SHAPE is the name of our highly successful teaching school, driven through outstanding leadership to impact on teaching standards regionally, nationally and internationally. We lead a rigorous and supportive School Direct teaching programme, which includes Qualified Teacher Status. You will find a wealth of information on our [website]https://www.st-huberts.sandwell.sch.uk/)\nYou are welcome to contact us to arrange a personal visit to our school if you would like to see for yourself our outstanding environment, project based learning and meet welcoming staff team.","trainWithDisability":"We welcome applications from all , please visit our policies on our school website.\n\n[website]https://www.st-huberts.sandwell.sch.uk/)\n\nPlease feel free to call and speak to us if you wish to discuss specific needs.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:47:24.484Z","updatedAt":"2021-09-09T18:52:40.940Z"}
