{"id":"74499090-bd95-469a-b55a-35eed0e51a0d","name":"Oxfordshire Teacher Training","code":"1DE","type":"lead_school","isAccreditedBody":true,"urn":"70327","ukprn":"10046745","address":{"addressLine1":"Oxfordshire Teacher Training","addressLine2":"The Cherwell School North Site","town":"Marston Ferry Road","county":"Oxford","postcode":"OX2 7EE"},"contact":{"website":"(http://www.oxfordshireteachertraining.co.uk)","email":"info@ott-scitt.org.uk","telephone":"01865 518209","fullName":"Oxfordshire Teacher Training"},"location":{"latitude":51.7757449,"longitude":-1.2586363},"trainWithUs":"Oxfordshire Teacher Training is a dynamic, schools-led organisation that is committed to delivering exceptional and inspiring programmes to prepare people to be excellent new teachers. Our trainees are called Associate Teachers which indicates your status as someone starting out in this fantastic profession.\nOur programmes lead to Qualified Teacher Status and you also have the option to add a Master’s level PGCE to your programme. We have a 100% employment rate and the Headteachers who have employed our graduates have been unanimous in their agreement that our training ensures people are well prepared for the profession.\nAs an organisation we are big enough to offer a wide range of high-quality programmes, whilst also having a highly personalised approach and ethos which nurtures individuals. In December 2017 we were graded as Outstanding in all areas in our first [Ofsted ITT inspection] (https://oxfordshireteachertraining.co.uk/wp-content/uploads/2018/02/The-Cherwell-OTSA-SCITT-Ofsted-final-PDF.pdf) ‘The SCITT is outstanding. The central team are committed to excellence. Their clear moral purpose and drive have secured an excellent reputation for the partnership.’\nFor 2021-22 programmes we will be offering you a choice of three school-based locations for training - Banbury, Oxford and Henley. We work with a diverse partnership of nursery, primary, special and secondary schools across Oxfordshire and that means that you will be able to specify a preference of location for both training and placement schools. Please note that some elements will only be delivered in one location so you will need to travel at times, see our [website] (https://oxfordshireteachertraining.co.uk/) for further information.","trainWithDisability":"At Oxfordshire Teacher Training we are committed to equality of opportunity for youngsters in our schools and therefore equality of opportunity for those training to teach them, in order that we create a diverse and inclusive profession. We welcome all applications and are happy to discuss any specific needs or concerns with you at any stage.\nIn the early stages of training, you will be invited to dig deep and share your specific needs, core values and beliefs with the SCITT Team, who will then tailor bespoke support packages for you. This not only ensures accessible learning during all training opportunities - both in school and with peers in training - but also ensures each individual develops and strengthens their own particular teacher toolkit, for a sustained and mentally-healthy teaching career ahead. This means that Associate Teachers with, for example, profound hearing impairment, with processing or memory challenges or with a history of social anxiety will have the opportunity to observe highly-skilled practitioners with identical needs and discuss strategies to overcome traditional barriers and stigma. Our dedicated Wellbeing Team works hand-in-hand with Programme Leaders and partnership colleagues to construct a support package which emphasises guided independence, and prioritises self-care and increasing agency, in order to ensure that each graduate Associate Teacher leaves the programme knowing when and where to seek support and advice.\nThat so many of our alumni become mentors, buddies and partnership colleagues is testament to this pioneering approach to nurturing the whole teacher within mentally-healthy school communities.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:52:43.071Z","updatedAt":"2021-09-30T20:10:57.620Z"}
