{"id":"74c02a9b-401d-4dec-a17e-ac860541e9fb","name":"Cumbria Primary Teacher Training","code":"C97","type":"scitt","isAccreditedBody":true,"ukprn":"10048041","address":{"addressLine1":"Islay Place","addressLine2":"Workington","town":"Cumbria","county":"Cumbria","postcode":"CA14 3XB"},"contact":{"website":"http://www.ctt.ac.uk","email":"office@ctt.ac.uk","telephone":"01900 606855","fullName":"Cumbria Primary Teacher Training"},"location":{"latitude":54.6363694,"longitude":-3.5536677},"trainWithUs":"Cumbria Teacher Training offers excellent primary initial teacher training centered around an ambitious and research focused curriculum.\nPerhaps most importantly, our course is a School Centred Initial Teacher Training Course (SCITT) and is directed by head teachers who ensure your learning is completely focused on working with and in good and outstanding schools. Your learning is enhanced by being integrated with the training programmes of the Newcastle Research School, giving the benefits of current research in teaching. This places us at the cutting-edge of teacher training and is a direct cause of our levels of trainee satisfaction; and employment statistics being well above the sector averages.\nOur innovative School Integrated Learning systems ensure all your learning is focused and follows the ITE Core Content Framework. All of the mentors who will work with you are expert colleagues. We offer focused, subject and phase based mini-placements on both core and foundation subjects. The mini-placements are based around the curriculum delivery cycle, where training is delivered by expert colleagues, the Newcastle Research School, school based research/practice and review of learning. Further to this we offer 3 extended phase based placements in EYFS, Key Stage 1 and Key Stage 2.\nOur PGCE course is delivered here at CTT centre by Sheffield Hallam University and is purposefully integrated into our training and your school based learning.","trainWithDisability":"CTT is a growing course with a great reputation for friendliness and providing supportive, individualised learning. We welcome students with disabilities or other needs. As we are a small organisation, we are able to uniquely tailor support for your individual needs and provide support where necessary. At CTT, you will be part of a course whose experiences are tried and trusted.\nAll candidates including those with disabilities and other needs have an initial fit to work assessment and from these relevant support programmes can be designed and implemented. Although accessibility does vary between different locations, every endeavour is made to accommodate an individual's needs.\nTrainees are supported throughout the course and if any issues or concerns arise they are dealt with promptly.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:57:09.686Z","updatedAt":"2021-10-06T18:41:49.590Z"}
