{"id":"74d0e1b3-80ac-4a0e-b93d-f19cb6587144","name":"Kirklees and Calderdale SCITT","code":"1WK","type":"scitt","isAccreditedBody":true,"ukprn":"10003692","address":{"addressLine1":"Kirklees & Calderdale SCITT","addressLine2":"Leeds Old Road","town":"Heckmondwike","county":"West Yorkshire","postcode":"WF16 9BB"},"contact":{"website":"http://www.kcscitt.com","email":"cathyz.scott@kirklees.gov.uk","telephone":"01484 221177","fullName":"Kirklees & Calderdale SCITT"},"location":{"latitude":53.7205844,"longitude":-1.6679867},"trainWithUs":"We are an established and successful teacher training provider and have been training teachers across West Yorkshire since 2003, rated 'Good' in our Ofsted Inspection in 2015.\nAs a trainee you will benefit from experienced mentors in school, supporting you on a daily basis. This runs alongside highly regarded tutors and core team who ensure your training year is a positive and successful experience in becoming a qualified teacher.\nOur trainees are placed in a whole range of schools across Kirklees, Calderdale and Bradford which ensures a real diverse mix of schools, catering for our trainees as far as their location, strengths, needs and skills.\nYou will be based four days in school and one day at our central base for the core programme. On this day will benefit from the expertise of a range of trainers who have both local and national reputations, delivering sessions such as behaviour management, differentiation, planning, etc to ensure you develop as effective teachers. This also offers the opportunity for our trainees to network, share and support each other throughout the training year.\nIn addition to this, our Secondary trainees receive additional Subject knowledge days to enhance their confidence, knowledge and skills in their chosen subject.\nWe offer the option of either Qualified Teacher Status alone (QTS) or QTS with PGCE. This PGCE element equates to 60 Masters credits which we offer through the University of Huddersfield.\nFor more information visit our [website](http://www.kcscitt.com)","trainWithDisability":"The Kirklees & Calderdale SCITT is committed to Equality and Diversity. All partner organisations and all schools participating in the programme have clearly established policies, processes and systems for monitoring. All trainees will be introduced to their school’s policy through focused training by the host school.\nThe Kirklees & Calderdale SCITT is committed to the achievement of equal opportunities. This is central to our mission as a provider of school-based teacher training and have a proven track record of supporting trainees with additional needs.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:55:47.720Z","updatedAt":"2021-07-07T18:55:11.282Z"}
