{"id":"74d2166e-2572-4063-bb56-4f103d0fe715","name":"Forest Gate Community School, Community Schools Trust","code":"3T1","type":"lead_school","isAccreditedBody":false,"urn":"143274","ukprn":"10057636","address":{"addressLine1":"Forest Lane","addressLine2":"Forest Gate","town":"Newham","county":"London","postcode":"E79BB"},"contact":{"website":"Forest Gate Community School","email":"stephen.gillatt1@forestgatecst.org","telephone":"2085348666"},"location":{"latitude":51.5500029,"longitude":0.0229445},"trainWithUs":"Forest Gate Community School (FGCS) is an exceptional learning environment with a real community spirit. In 2019 Ofsted gave our school an \"Outstanding\" judgment for the second time in a row.\n\nWe offer places for trainees in Maths, Chemistry, Physics, Computer Science and Design Technology.\n\nWe are a co-educational 11-16 community school that provides students with a high degree of challenge combined with excellent support and as a result, our results are outstanding. Relationships between staff and students are excellent and discipline is extremely good. We treat each other with respect and understanding.\n\nEveryone at FGCS is committed to ensuring our young people progress to college, university and working life, fulfilling aspirations. We provide a first-rate education at FGCS because we equip our students with the skills, knowledge and attitude required to be good citizens and to succeed in the 21st century.\n\nWe aim to build a love of learning and a thirst for knowledge in all our students. We believe that by modeling behaviour, and by recognising and rewarding effort and achievement, we provide an environment where students are proud to present their work and strive for the highest standards.\n\nWe are a school with enormous strengths. Through the continuous hard work and co-operation of staff, students, parents and governors, we have built a reputation for academic success, as well as an excellent standard of pastoral care. We have outstanding success in our teacher training programs that provide bespoke support to all of our trainee teachers.","trainWithDisability":"We support all of our trainees to the highest standards possible. We know that trainees have a range of needs and we do everything in our power to ensure that they are successful. If a trainee has a disability or other needs we will create a plan to support them to ensure that they have full access to the training and support that we provide. This may be by making reasonable adjustments to deadlines, one-to-one coaching or more support where it is needed. We are a fully inclusive school that is committed to the success of all our students, staff and trainees, no matter what their starting point.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-10-12T20:57:02.605Z","updatedAt":"2021-10-18T21:09:08.467Z"}
