{"id":"757d0dca-c7a9-43c8-8c3b-96c0a81539b6","name":"Kent and Medway Training","code":"K30","type":"scitt","isAccreditedBody":true,"ukprn":"10052832","address":{"addressLine1":"Leigh Academies Trust - Strood Academy","addressLine2":"Carnation Road","town":"Rochester","county":"Kent","postcode":"ME2 2SX"},"contact":{"website":"http://www.kmtraining.org.uk","email":"stuart.russell@kmtraining.org.uk","telephone":"7729608117","fullName":"Course Director: Stuart Russell"},"location":{"latitude":51.398135,"longitude":0.466407},"trainWithUs":"KMT is one of the largest and longest established SCITTs in the whole of the South East. Currently working with over 100 schools across Primary and Secondary, KMT is able to offer you high quality teacher training both in schools and within regional training centres. *Please be aware that core places follow the non-salaried school direct programme.\nLife in school is busy and demanding, but hugely rewarding. A teacher's role is challenging and stimulating but never dull. Our trainees come from a wide variety of backgrounds and experience - some may be recent graduates from university, others may be bankers, IT specialists or experienced professionals looking for a change.\nWhatever your background you will leave us with the skills needed to be a successful teacher, ready to improve the life chances of children and young people.\nThe KMT approach\n* Outstanding teacher training in a range of subjects and ages\n* Individual support from subject specialist mentors and senior teachers\n* Guaranteed contrasting placements within our partner schools in North Kent, South East London, West Kent, East Kent and Medway\n*Dedicated support for all trainees\n* Exceptional record of employment for successful trainees\n* A high level of commitment to all our trainees and schools\n* Consistent high levels of outcomes and the award of QTS\nOur ethos is to recruit, train, employ and retain outstanding teachers within our consortium and the surrounding areas","trainWithDisability":"KMT and all of its partnership schools are totally committed to supporting candidates with disabilities or other needs. In fact, we would probably say that it is our biggest strength.When conditions and individual needs are shared with us at the application and interview stage, clear strategies are put in place so that everybody involved in your training is fully aware of your own bespoke needs so that you can be supported throughout the programme.\n\nWhilst accessibility to our schools for those with disabilities may vary, we would do absolutely everything we can to make your training experience as positive as possible\n\nOver recent years, a large number of trainees with disabilities and bespoke needs have trained with us and have gone on to be extremely successful in their teaching careers","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:57:06.759Z","updatedAt":"2021-07-21T21:08:47.406Z"}
