{"id":"75b2d323-eff7-41d1-bfc2-b6ce3db8f6b9","name":"William Shrewsbury Primary Partnership","code":"2FM","type":"lead_school","isAccreditedBody":false,"urn":"145097","ukprn":"10065446","address":{"addressLine1":"William Shrewsbury Primary P/Ship","addressLine2":"Church Road, Stretton","town":"Burton-on-Trent","county":"Staffordshire","postcode":"DE13 0HE"},"contact":{"website":"https://www.williamshrewsbury.staffs.sch.uk/","email":"headteacher@williamshrewsbury.staffs.sch.uk","telephone":"1283247490","fullName":"Headteacher"},"location":{"latitude":52.8371451,"longitude":-1.6200113},"trainWithUs":"The William Shrewsbury Primary Partnership consists of a diverse group of schools in and around Burton upon Trent that offer a range of exciting learning opportunities. Working with us means that trainees will learn to teach through hands-on experience with exceptional primary practitioners. We have many experienced and dedicated mentors who will model excellent practice, team teach alongside trainees and provide high quality developmental feedback.\n\nWe can offer expertise in many areas including: teaching and learning, assessment, inclusion and SEND, enquiry learning, PE and sport, PSHE and music.\n\nAs well as a keen focus on high academic achievement, the partnership is committed to the development of the whole child providing a wealth of opportunities for children to participate in a wide range of sporting activities, concerts and school visits. The schools often collaborate to provide such opportunities on a larger scale.\n\nWe offer enthusiastic children with excellent behaviour for learning and a real thirst for knowledge as well as a supportive group of parents and governors. We welcome trainees who share our passion and ethos to bring out the best in every child and to develop life-long learners.","trainWithDisability":"William Shrewsbury Primary Partnership welcomes applications from people with disabilities. William Shrewsbury, the lead school, has full access and facilities for people with disabilities.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"174b60fe-3dac-47c0-a65a-5691b6dda11c","code":"24V","name":"The John Taylor SCITT","description":"“The John Taylor SCITT has been a provider of ITE since 2014. Based in the charming Staffordshire village of Barton-under-Needwood, the SCITT is based in a bespoke Training Centre on the site of John Taylor High School, an outstanding school which enjoys a high reputation locally and nationally as a school with an enviable academic record based for inspirational teaching and exceptional pastoral care. As a SCITT we pride ourselves on the fact that as a relatively small provider we know all our trainees really well and can offer highly personalised support which enables our trainees to secure excellent outcomes.”"}],"createdAt":"2021-07-06T17:47:41.616Z","updatedAt":"2021-10-13T15:49:47.279Z"}
