{"id":"75bd7d1e-47d6-4b54-8d10-50d545b3f444","name":"Oakwood Academy","code":"2CM","type":"lead_school","isAccreditedBody":false,"urn":"138130","ukprn":"10037232","address":{"addressLine1":"Chatsworth Road","addressLine2":"Ellesmere Park","town":"Eccles","county":"Manchester","postcode":"M30 9DY"},"contact":{"website":"http://www.oakwoodacademy.co.uk","email":"enquiries@oakwoodacademy.co.uk","telephone":"1619212880","fullName":"Lisa Southwood"},"location":{"latitude":53.4953355,"longitude":-2.3360356},"trainWithUs":"Oakwood Academy is an Outstanding special school for pupils aged 9 - 19 years who have a range of moderate and/or complex learning difficulties.\nThe school has Visual Arts, Technology and Sport Specialist status.\nOur mission statement is \"We are united in the belief that together we can inspire all learners to dream, persevere and achieve so that we can change lives for the better now and for future generations to come.\"\nAt Oakwood Academy we encourage pupils to respect the fundamental British values of democracy, the rule of law, individual liberty and mutual respect and tolerance of those with different faiths and beliefs.\nWe became a Teaching School in 2016 and have grown our ITT allocations since this time.\nThe alliance has capacity to provide both primary and subject specific secondary places.\nWithin the primary school alliance, the following schools will have capacity to support trainees in their placements.\nSt Mary’s C.E Primary School St Mary’s R.C Primary School Eccles\nKingsway Primary School, Trafford\nGreen Lane Special School\nOakwood Academy Special School\nWithin our secondary alliance, the following schools will be able to provide capacity for our secondary placements. Oakwood Academy, The Canterbury Centre, Green Lane Special School, Ellesmere Park High School, St Patricks’s R.C High School and Great Sankey High School.\nWe have a long history of working in partnership with a wide range of schools. We have developed partnerships across authorities. We also work in close collaboration with Universities, especially MMU.","trainWithDisability":"At Oakwood Academy we welcome candidates with disabilities and other needs such as dyslexia, physical, hearing and visual impairments and mental health conditions.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:47:04.640Z","updatedAt":"2021-09-16T17:37:57.381Z"}
