{"id":"75f0fc2c-21c4-49e6-a53d-c6afaab51c31","name":"Pickwick Learning","code":"23Z","type":"lead_school","isAccreditedBody":false,"urn":"136630","ukprn":"10058663","address":{"addressLine1":"Pound Pill","town":"Corsham","county":"Wiltshire","postcode":"SN13 9YW"},"contact":{"website":"https://www.pickwickacademytrust.co.uk/initial-teacher-training-itt","email":"atapscott@pickwickacademytrust.co.uk","telephone":"01249 712387","fullName":"Fiona Allen"},"location":{"latitude":51.4289938,"longitude":-2.1821249},"trainWithUs":"The Pickwick Learning School Direct Partnership is committed to developing our trainees as effective learners and effective teachers. We provide a high quality and personalised programme for our trainee teachers who learn to teach ‘on the job’ in school from day one, observing and working alongside outstanding practitioners working within our large family of schools based across Wiltshire and the wider area. We are very keen to support you as much as we can in finding a placement that best suits your needs and preferences. Although we cannot guarantee that you will be placed in a school of your choice, we will ensure that placements are in schools within reasonable distance from your home. Placements are in our partnership schools which offer Primary focussed training in a range of contexts. Our partnership schools are passionate about the importance of outstanding provision for our children as they progress through their school lives. Training is delivered through personalised training with your own mentor and through central training sessions led by Specialist leaders, headteachers, deputy headteachers and classroom practitioners. Our staff are our most valuable resource with a proven track record for delivering high quality training and professional development. They are exemplary in their expectations and are eager to share their skills, knowledge and practice with the next generation of teachers. These practitioners are in the best position to prepare you for excellence in your own practice.","trainWithDisability":"We are an inclusive organisation. All potential applicants are considered on an equal basis. We will ensure that all candidates applying and securing a place to train with us will be provided, wherever possible, with the means to do so, by implementing reasonable adjustments as required which may include:\n* Ensuring access to training venues and schools\n* Providing additional time where required e.g. for PGCE assignments\n* Providing larger print and/or coloured paper\n* Additional support from School-based mentor / Teaching and Learning tutor\n* Ensuring all placement schools and venues are aware of any allergies and intolerances\n* Ensuring that candidates with hearing and/or sight impairments are seated appropriately to facilitate access to presentation content and instructions.\nPlease make us aware of any disabilities or other needs. We can assure you that all information will be treated in complete confidence.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"5d691db0-3d77-4a57-a4a2-5392b1ed8fc1","code":"24U","name":"North Wiltshire SCITT","description":"We work closely with our accrediting body, North Wiltshire SCITT, and the SCITT team at Bath Spa University (both outstanding organisations in their Ofsted Inspections) to provide a high quality programme. We work with them to rigorously evaluate our programme to ensure we offer the best experiences for our trainee teachers, both through their QTS and PGCE, preparing them for the demands of the role of a teacher."}],"createdAt":"2021-07-06T17:55:20.199Z","updatedAt":"2021-10-01T20:54:26.919Z"}
