{"id":"764347be-336c-427a-b049-34c7ade3d8db","name":"Chepping View Primary Academy","code":"138","type":"lead_school","isAccreditedBody":true,"urn":"137979","ukprn":"10036917","address":{"addressLine1":"Chepping View Primary Academy SCITT","addressLine2":"Cressex Road","town":"High Wycombe","county":"Bucks","postcode":"HP12 4PR"},"contact":{"website":"http://www.cheppingviewscitt.com","email":"dmaddox@cvpa.school","telephone":"1494535564","fullName":"CVPA SCITT Leader"},"location":{"latitude":51.615214,"longitude":-0.7747284},"trainWithUs":"Chepping View Primary Academy is an innovative and vibrant outstanding school in High Wycombe. We are the lead school of a partnership of schools in High Wycombe, Marlow, Aylesbury and across Buckinghamshire and an accredited provider of school-centred initial teacher training. Our SCITT team provides a formal and comprehensive training curriculum covering the primary phase for Key Stage 1 and Key Stage 2, as well as early years with our 3-7 programme. Our training and school placements lead to QTS, authorised by CVPA SCITT. The support and training offered by CVPA SCITT and our partnership schools prepare trainee teachers in the best way possible to become outstanding primary school teachers and school leaders of the future.","trainWithDisability":"Chepping View Primary Academy SCITT is committed to equal opportunities and will not discriminate on the grounds of colour, race, nationality, ethnic origin, sex or marital status or on the grounds of disability.\nWe encourage all potential applicants to discuss their needs in order that we can consider them individually and explore any adjustments that can reasonably be made to offer the best learning experience. Every effort will be made to support an individual’s needs with the successful management of their condition.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:47:52.619Z","updatedAt":"2021-07-12T19:50:08.547Z"}
