{"id":"76c55af9-5232-41bd-a308-9fc5a4270cdd","name":"Pennine Lancashire SCITT","code":"P38","type":"scitt","isAccreditedBody":true,"ukprn":"10014787","address":{"addressLine1":"The Hollins","addressLine2":"Hollins Lane","town":"Accrington","county":"Other","postcode":"BB5 2QY"},"contact":{"website":"http://www.plscitt.org.uk/","email":"stubbsl@thehollins.com","telephone":"1254233500","fullName":"Vicki Irving"},"location":{"latitude":53.7384225,"longitude":-2.3540058},"trainWithUs":"Ours is an Initial Teacher Training and Education partnership, founded on decades of highly successful teacher training experience and informed by the latest educational research. The core of our partnership comprises three strong schools plus a wider partnership with schools across East Lancashire. We work closely with Tor View Special School who lead on our primary programmes and on SEND. The Embrace Teaching School Hub is a strategic partner.\nThe Hollins, Accrington (the lead school)\nMarsden Heights Community College, Nelson Ribblesdale School, Clitheroe Tor View Special School, Haslingden\nEmbrace Teaching School Hub\nLeeds Beckett University- who have a proven track record in ITE Our Programme - has several key features: 38-week programme leading to Qualified Teacher Status, Post Graduate Certification and M Level credits worth around 30% of a Masters degree; a focus on Child Development that runs throughout the course, and which offers trainees experience in an Early Years setting, Primary School, Pupil Referral Unit, Special School and Sixth Form experience.\nKey aspects of our Professional Studies Programme: * In-depth subject specific pedagogy to equip you to teach your subject effectively in the classroom\n* Consistent focus on behaviour management strategies to give you the practical skills to teach\n* Substantial experience in a contrasting placement\n* Coverage of the national priorities of literacy, numeracy & EAL\n* Practical training on how the latest educational research and learning theory can be put into practice in the classroom. * close links to Research Schools with lecture delivered by ELEs","trainWithDisability":"See our website for more information on how we support candidates with disabilities and other needs.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:56:59.830Z","updatedAt":"2021-09-03T20:43:33.859Z"}
