{"id":"77791bf9-2640-454c-8c62-fad18e44e703","name":"Waverley School Direct","code":"1RH","type":"lead_school","isAccreditedBody":false,"urn":"139788","ukprn":"10042311","address":{"addressLine1":"Waverley School","addressLine2":"Yardley Green Road","town":"Birmingham","county":"West Midlands","postcode":"B9 5QA"},"contact":{"website":"http://www.waverley.bham.sch.uk","email":"claire.dugard@waverley.bham.sch.uk","telephone":"0121 566 6600 ext. 31062","fullName":"Claire Dugard"},"location":{"latitude":52.4759251,"longitude":-1.8298659},"trainWithUs":"Our partnership of schools work in areas of significant socio-economic disadvantage and, together with our university partners, we are passionate about providing high-quality teaching and learning opportunities to all the children in our care. We really make a difference and we work hard to recruit, train and retain talented new colleagues in our schools. We are now recruiting for our ninth cohort of aspiring teachers.\nKey features of our programme include:\n* A range of courses for Foundation/KS1, Primary and Secondary;\n* Full postgraduate PGCE award including 60 credits at Master's level;\n* A three year commitment to supporting your early career;\n* School-led sessions delivered by current primary and secondary teachers;\n* Extensive support provided by high-quality tutors, subject colleagues and School Direct staff;\n* High levels of employment for our trainees in local schools;\n* The option to develop a SEND focus or other area of interest;\n* Starting your teaching career in Birmingham: great diversity, social life and affordability!\nWhen designing our training programme we draw on some of the unique features of Waverley School, an all-through school housed in modern award-winning facilities. Please come and visit us to find out more!","trainWithDisability":"Trainees are encouraged to declare any additional needs that they might have through the initial application process and the Fitness to Teach process for successful applicants. Needs are also addressed through the nature of our individualised training programmes. Our aim is to enable trainees to participate fully in all aspects of their training. All trainees attend Waverley School (and other school sites) for school-led sessions plus the university provider for their course. Please see more information about each main site below.\nWaverley School provides lift access to all floors and numerous accessible toilet facilities. There is also step-free access to the Training facility via the car park should lifts not be in service.\nBirmingham City University is based at City South campus where all areas which require student access are accessible to wheelchair users. There is a full Disability Support Team available. Please see their [website.](www.bcu.ac.uk/about-us/maps-and-campuses/city-south-campus)","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"62d5803b-89ca-4e21-bb6f-5c74944c56ad","code":"B25","name":"Birmingham City University","description":"Birmingham City University (BCU) trains more teachers than anyone else in the region (HESA, 2016) and never gives up in its aspirations for tomorrow’s teachers. BCU graduates are very employable - 99% of all PGCE students were in employment or further study six months after graduating (DLHE 2016/17). The courses are taught by staff who are experienced professionals and maintain links with their sector to ensure the most up-to-date learning during your course. The School of Education is located at the City South Campus in Edgbaston, which has recently had a £41 million extension giving trainees excellent specialist facilities."},{"id":"4aa8177a-27b8-4566-b77a-c45515e46739","code":"N36","name":"Newman University","description":""}],"createdAt":"2021-07-06T17:56:20.964Z","updatedAt":"2021-11-15T19:45:57.342Z"}
