{"id":"77a44b00-3386-4d3f-a293-db762df43a68","name":"Victoria Academies Trust","code":"24Y","type":"lead_school","isAccreditedBody":false,"urn":"138033","ukprn":"10047333","address":{"addressLine1":"Victoria Park Primary Academy","addressLine2":"Ballot Street","town":"Smethwick","county":"West Midlands","postcode":"B66 3HH"},"contact":{"website":"https://victoriaacademiestrust.org/","email":"louise.fowler@victrust.org","telephone":"0121 558 8701","fullName":"Louise Fowler"},"location":{"latitude":52.4904635,"longitude":-1.9618802},"trainWithUs":"Victoria Academies Trust offers School Direct initial teacher training programme in partnership with the University of Birmingham. We work with the University in recruiting and selecting trainees and provide a high-quality primary teacher training programme which leads to the award of the Postgraduate Diploma in Education (PGDipEd) with Qualified Teacher Status (QTS). Applicants will undertake all their teaching placements within our family of schools.\nVictoria Academies Trust is a vibrant family of innovative schools, where you will see examples of immersive teaching embedded into a curriculum that is designed to be linked to real life, purposeful learning for the children. If you chose to train with us, you will have the opportunity to train among outstanding practitioners, committed to developing creative, innovative, passionate and knowledgeable teachers. We promise you will be strongly supported throughout your training by highly skilled mentors and tutors, with this goal in mind.\nFor more information about Victoria Academies Trust visit: www.victoriaacademiestrust.org","trainWithDisability":"Victoria Academies Trust welcomes applications from all candidates and endeavours to offer an inclusive learning environment; you are welcome to discuss any needs or disabilities with us at any time during the application process. Candidates who disclose a disability under the Disability Discrimination Act have the right to have reasonable adjustments made to enable them to fully access teaching and learning required during their training programme. \n\nWe will work with you to identify an individual plan detailing the reasonable adjustments you may need. Adjustments will be recommended on a case by case basis and are personalised and responsive to how your needs may change throughout your training time.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"accreditedBodies":[{"id":"c357e0fa-802e-471b-818a-d0cd1434f9cd","code":"B32","name":"University of Birmingham","description":"We are proud to work in partnership with the University of Birmingham. Together we provide a high-quality training programme which leads to the award of the Postgraduate Diploma in Education (PGDipEd) and QTS."}],"createdAt":"2021-07-12T20:48:33.099Z","updatedAt":"2021-11-05T23:22:18.758Z"}
