{"id":"77e24da0-3669-4976-adb8-0f105e8757c3","name":"Fareham and Gosport Primary SCITT","code":"25M","type":"scitt","isAccreditedBody":true,"ukprn":"10048033","address":{"addressLine1":"Fareham and Gosport Primary SCITT","addressLine2":"Harrison Primary School","town":"Harrison Road","county":"Fareham","postcode":"PO16 7EQ"},"contact":{"website":"http://www.farehamandgosportprimaryscitt.co.uk","email":"farehamandgosportprimaryscitt@harrison.hants.sch.uk","telephone":"01329 239584","fullName":"Sara Gmitrowicz"},"location":{"latitude":50.8572125,"longitude":-1.1799325},"trainWithUs":"By choosing Fareham and Gosport Primary SCITT’s PGCE programme for your teacher training year, you will be carrying out your course with an ‘Outstanding’ provider (Ofsted 2017). Ofsted report that “The Partnership is fully committed to and passionate about ‘growing their own teachers’, recruiting and training high-calibre trainees who aspire to become excellent primary school teachers.”\nYou will be immersed in school life from day one on our programme. You will gain valuable experience of creating an effective learning environment for pupils to support good progress in their learning, as well as building strong relationships with pupils and colleagues. You will spend the majority of your time in school but will also benefit from SCITT based training days and input sessions from the University of Roehampton for the PGCE assignment writing elements of the programme.\nYou will receive personal, professional and academic support throughout our programme to support the successful completion of your teacher training. As a trainee teacher with us you will receive high quality training and mentoring which will enable you to develop highly effective teaching skills and to develop into confident, reflective practitioners.\nOur highly effective collaboration with over fifty partner schools, the local authority, and the University of Roehampton ensures high-quality support for trainees as they enter the teaching profession. We work closely with schools, a local Teaching School Hub and the local authority to make sure you are well supported as an Early Career Teacher.\nFor more information, please visit our website at [www.farehamandgosportprimaryscitt.co.uk]","trainWithDisability":"At Fareham and Gosport Primary SCITT programme we strive to make all aspects of our programme accessible to everyone. Wherever possible we will make reasonable adjustments so that you are not disadvantaged by your disability.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:54:04.733Z","updatedAt":"2021-07-08T17:21:46.749Z"}
