{"id":"7812257d-7100-4b99-a51f-67b8f7afd57f","name":"Blessed Christopher Wharton Catholic Academy Trust","code":"13K","type":"lead_school","isAccreditedBody":false,"urn":"148256","ukprn":"10087141","address":{"addressLine1":"Blessed Christopher Wharton Catholic Academy Trust","addressLine2":"Ignis House","town":"Bradford","county":"West Yorkshire","postcode":"BD9 4BQ"},"contact":{"website":"https://www.bcwcat.co.uk/cspitt","email":"itt@bcwcat.co.uk","telephone":"1535607149","fullName":"Simon Gallacher"},"location":{"latitude":53.8577895,"longitude":-1.9147095},"trainWithUs":"We are The Blessed Christopher Wharton Catholic Academy Trust, a forward thinking and innovative Trust consisting of 17 Primary Schools. We are a passionate partnership of Catholic schools committed to sharing talent, faith, experience, leadership and excellent teaching to improve achievement in schools across Bradford, Keighley and beyond. We have a hugely successful Schools Direct Programme, working closely with Leeds Trinity University to provide high quality, authentic and bespoke training alongside teaching experience in a diverse range of Catholic schools across Bradford and Keighley. We grow our own teachers to make a difference to the lives of children in our care.\n\"Training with the BCW Trust has allowed me to experience teaching in amazing schools containing brilliant children. The support I received was outstanding and continuous. Working in a Catholic School provides an extremely supportive network within a family. The support continues from the Trust as an ECT. The Trust gives me support and allows me to ask for training in areas I feel I require to improve my career.\" Julie McGovern - School Direct Trainee 2017","trainWithDisability":"We are an inclusive partnership and welcome children and staff with a range of disabilities and additional needs. \n\nIf you would like to discuss your needs, please contact us directly.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"accreditedBodies":[],"createdAt":"2021-07-06T17:54:20.941Z","updatedAt":"2021-11-23T16:41:58.996Z"}
