{"id":"78e2ac24-5caa-4856-997f-d6987bb5268c","name":"The Federation of Boldmere Schools","code":"13B","type":"lead_school","isAccreditedBody":false,"urn":"103341","ukprn":"10071495","address":{"addressLine1":"Federation of Boldmere Schools","addressLine2":"Cofield Road","town":"Sutton Coldfield","county":"Birmingham","postcode":"B73 5SD"},"contact":{"website":"https://www.boldmere.bham.sch.uk/our-school/our-staff","email":"training@boldmere.bham.sch.uk","telephone":"0121 464 3656","fullName":"Carl Glasgow"},"location":{"latitude":52.5447609,"longitude":-1.8437663},"trainWithUs":"The Federation of Boldmere Schools is a partnership of outstanding and good schools in the North area of Birmingham. Boldmere Junior School was assessed and designated a Teaching school in March 2013- August 2021. During our designation we have trained over 90 students through our incredibly successful School direct route in to teaching. We are incredibly proud that 100% of our trainees on our previous cohorts have passed their academic award and also obtained Qualified Teacher Status (QTS), which is an essential element of our unique delivery.\nAll of our previous trainees have also secured their first teaching post by the end of our training programme, with 100% of our trainees securing full time employment as a Newly Qualified Teacher at the start of the academic year that they have applied for.\nOur partnership is made up of 20 extremely successful, unique and individual primary and special schools.\nThe training we provide will equip you with the educational knowledge, skills, understanding, high expectations, empathy, teamwork and resilience that characterises what is expected in teachers.\nWe have a proven track record of success and we will be recruiting students to our training programme who demonstrate a real hunger and passion for teaching. The academic demands of our programme require an ability to study at level 7, which is a higher requirement than most degree classifications.\nYou will be able to select your preferred route in to teaching as we are able to offer ages 3 to 7 or 5 to 11.","trainWithDisability":"Throughout your training with ourselves and BCU you will be formally supported in school by a proven designated class teacher/mentor and allocated school based tutor. All training providers have attended training to ensure consistency of provision for our trainees, whatever their individual needs may be. You will also be able to access support as and when required from BCU personal and partnership tutors. Access is also available to a less formal but a strong, effective and valuable network of support within in your home and second placement schools.\nPrevious School Direct trainees with disabilities and other needs have been successful on our route in to teaching, as we also encourage trainees to form very effective professional working relationships, which lead to bespoke support opportunities throughout the duration of your training.\nThe BCU School of Education is conveniently located in the centre of Birmingham and offers unrivalled facilities and excellent teaching informed by research and evidence for students of all disabilities and other needs. Trainees will also have access to the 'Student Academic Partners' scheme which teams up students and staff to find ways to make the teaching and learning provision even better at BCU. This support has been recognised and has won a Times Higher Education Award for 'Outstanding Student Support'.\nIn addition, you will receive weekly group training sessions provided by expert practitioners from our partnership schools. As facilitators they clearly understand the need to cater for all disabilities and any other needs to allow you to be successful.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:51:11.848Z","updatedAt":"2021-11-18T21:20:33.127Z"}
