{"id":"791f82c8-19fd-4339-9c7b-301dee8067ce","name":"University of Huddersfield","code":"H60","type":"hei","isAccreditedBody":true,"urn":"133822","ukprn":"10007148","address":{"addressLine1":"Queensgate","town":"Huddersfield","county":"Kirklees","postcode":"HD1 3DH"},"contact":{"website":"https://www.hud.ac.uk/the-university/teacher-training/","email":"sepd@hud.ac.uk","telephone":"01484 478249","fullName":"School of Education and Professional Dev"},"location":{"latitude":53.643727,"longitude":-1.7787888},"trainWithUs":"Whether you want to teach in early years, primary, secondary or lifelong learning, we’ll help you get the professional training and experience needed to become a confident and successful teacher. We operate strong and credible partnerships with local and national education providers, including leading The Education and Training Consortium consisting of 21 regional partners. So if you’re looking to pursue a career in teaching then we could be the perfect choice.\nWe combine the latest research and cutting-edge teaching practice to help ensure our trainees are able to equip themselves with the most relevant and up-to-date skills needed in the classroom.\nWe have excellent facilities in the School of Education and Professional Development including our mock classrooms for early years and primary practice, our science lab and music studio to support your preparation for the classroom. Our aim is to develop teachers who can transform the learning and life opportunities of the children, young people and adults they work with. Through inclusive practice, reflection and continuous personal development, our trainees are empowered to become autonomous practitioners who enable all learners to reach their potential. We have an excellent reputation both locally and nationally.\nBy choosing to study with the University of Huddersfield, you’ll join an inspiring, passionate and committed community focused on making your studies as enjoyable, rewarding and productive as possible. We look forward to welcoming you.","trainWithDisability":"Our Wellbeing and Disability Service works with students with a range of disabilities and long-term conditions that have a significant impact on their ability to study. This includes specific learning difficulties such as dyslexia, long-term medical conditions such as diabetes, mobility or physical disabilities or conditions, hearing impairments, visual impairments, social communication difficulties such as autistic spectrum conditions or mental health issues. Our main aim is to work alongside you to get the right support in place at the right time as we believe that nothing should stop you achieving what you're capable of. For more information please email disability@hud.ac.uk.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:47:39.291Z","updatedAt":"2021-09-21T16:41:38.492Z"}
