{"id":"7a6612c8-b4fe-425b-a63e-479e034a8257","name":"BBL Teacher Training","code":"4A7","type":"lead_school","isAccreditedBody":false,"urn":"119301","ukprn":"10067010","address":{"addressLine1":"Fouldrey Avenue","town":"Poulton-le-Fylde","county":"Lancashire","postcode":"FY6 7HE"},"contact":{"website":"https://bblteachertraining.co.uk/","email":"scitt@breck.lancs.sch.uk","telephone":"1253885319"},"location":{"latitude":53.8543705,"longitude":-2.9815922},"trainWithUs":"BBL Teacher Training is led by Breck Primary School and accredited by Bright Futures SCITT. Breck Primary School, Broughton-In-Amounderness Primary School and Lytham Hall Park Primary School are the three outstanding primaries that form the core group and are supported by a dynamic group of partner schools who share the same values, vision and ethos regarding initial teacher training. The schools partnered with BBL Teacher Training have a long established experience of successful ITT delivery models.\nBBL Teacher Training has a close relationship with its accreditor, Bright Futures SCITT, and we work together to promote excellence in all aspects of education through focused, central and school-based training activities. The Bright Futures SCITT is a partnership of primary and secondary schools, colleges, universities and organisations from across the North-West, who share their knowledge, skills, expertise and experience to achieve a common goal of continuous educational improvement.\nTogether we believe that every child deserves the very best start in life, irrespective of background or circumstance. We are committed to training teachers who can provide the next generation with the opportunity to develop happy and successful futures.\nKey elements of our training programme:\n* Training in school from the first day\n* Two contrasting schools experiences to prepare you for employment\n* A trained and dedicated mentor\n* Face to face subject knowledge training\n* Leads to Qualified Teacher Status (QTS)\n* Post Graduate Certificate of Education delivered by our partner, the University of Manchester","trainWithDisability":"It is the goal of BBL Teacher Training to recruit people of outstanding potential, irrespective of their background and to ensure that the admission process is transparent, has minimal barriers to entry, is based on merit and potential, and is fair with regards to diversity.\nBBL Teacher Training will not discriminate against a disabled person on the grounds of disability :\n* in the arrangements i.e. application form, interview or arrangements for selection for determining to whom a place should be offered; or\n* by refusing to offer, or deliberately not offering the disabled person a place for reasons connected with their disability.\nWherever possible, BBL Teacher Training will make reasonable adjustments to hallways, passages and doors in order to provide and improve means of access for disabled candidates. However, this may not always be feasible, if circumstances render such adjustments as being beyond what is reasonable.\nWe are committed to taking positive action to welcome people with disabilities who have met the requirements, and to enable them to meet their full potential\nConsideration will be given to all planned activities, resource allocation and procedures to ensure that we can enable disabled trainees full participation in all aspects of the academic, work-based and social activities of the course.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"yes","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-09-20T17:33:05.860Z","updatedAt":"2021-12-11T00:05:22.177Z"}
