{"id":"7b138fe3-4d57-4878-9f94-3ee1952b6ecb","name":"Yorkshire Special Education Partnership (YSEP)","code":"197","type":"lead_school","isAccreditedBody":false,"urn":"135228","ukprn":"10079948","address":{"addressLine1":"Netherlands Avenue","addressLine2":"Low Moor","town":"Bradford","county":"West Yorkshire","postcode":"BD6 1EA"},"contact":{"website":"http://www.chellowheightsschool.co.uk","email":"school.direct@chellowheightsschool.co.uk","telephone":"01274 679972","fullName":"Anne Slack"},"location":{"latitude":53.7590458,"longitude":-1.7660649},"trainWithUs":"We offer a unique programme which is school-centred. During the last academic year 100% of our students secured a teaching post within a special school. Training will allow you to develop a strong specialism in SEND.\nYou will be based in school for the full academic year with placements in two different settings. The first placement will be in a mainstream school in the Bradford area. The second placement will be in one of our primary special schools within Bradford. This provides greater experience and teaching practice, builds confidence and classroom excellence and will equip you well for the reality of your NQT year. The Yorkshire Special Education Partnership will provide a supportive and caring environment in which to train. All the partner schools involved in this programme have a strong inclusive ethos that cascades through all they do.","trainWithDisability":"We’re committed to ensuring that every student with potential, regardless of their background or circumstances, has the opportunity to benefit from higher education. If you have a disability or additional needs, Leeds Trinity University will endeavour to put in place reasonable adjustments to accommodate any additional requirements throughout your teacher training year.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"accreditedBodies":[{"id":"19a3446e-382d-4c14-83bb-a76563cef3c1","code":"L24","name":"Leeds Trinity University","description":"Leeds Trinity is a well-established and widely-respected institution with an excellent reputation for teacher education. Leeds Trinity staff are expert practitioners with recent experience teaching in secondary or further education. Employment rates for graduates of Leeds Trinity PGCE programmes are consistently above the national average with ex-students filling teaching posts in every corner of the UK."}],"createdAt":"2021-07-06T17:47:13.178Z","updatedAt":"2021-10-08T13:50:53.626Z"}
