{"id":"7c7d6af2-4991-4a36-9fb0-be730c036a33","name":"Rivington School Direct","code":"1JL","type":"lead_school","isAccreditedBody":false,"address":{"addressLine1":"Rivington Lane","addressLine2":"Horwich","town":"Bolton","county":"Bolton","postcode":"BL6 7RU"},"contact":{"website":"http://www.rbhs.co.uk","email":"nvelupillai@rbhs.co.uk","telephone":"1204333266","fullName":"Victoria Walmsley"},"location":{"latitude":53.6019729,"longitude":-2.5483752},"trainWithUs":"We are an alliance of Bolton based schools, which are wide, varied and unique in terms of their characteristics. We run a bespoke programme of professional enhancement sessions that are an integral part of our programme, delivered by experts from across the alliance. Our alliance consists of highly skilled, supportive Professional and Subject Mentors and schools that provide a wealth of experience and opportunities. Our programme enables you to gain experience within two contrasting placement schools and follows an AB model.\nWe believe that every child gets one chance and that we can make a difference to the lives of young people. We aim to inspire the next generation of leaders of learning, to challenge, support and develop individuals and to create outstanding practitioners who will shape and inspire future generations. It is our priority to develop individuals who are highly employable within and beyond the alliance.","trainWithDisability":"Rivington School Direct can offer support to trainees with disabilities or other specific needs. An assessment can be undertaken by Occupational Health or with Access 2 Work as appropriate and their recommendations for support /reasonable adjustments will be put in place wherever possible. Schools within the alliance currently provide support for employees with dyslexia through technology designed to support such conditions.","accreditedBodies":[{"id":"812b70c4-7fc4-46fc-975b-3e4d00f77dc4","code":"M40","name":"Manchester Metropolitan University","description":""}],"createdAt":"2021-07-06T17:47:19.388Z","updatedAt":"2021-07-06T17:47:19.388Z"}
