{"id":"7c856436-9fca-4528-9be6-a5038d315858","name":"White Woman Lane Junior School","code":"1MH","type":"lead_school","isAccreditedBody":false,"urn":"120914","ukprn":"10072966","address":{"addressLine1":"White Woman Lane","addressLine2":"Sprowston","town":"Norwich","county":"Norfolk","postcode":"NR6 7JA"},"contact":{"website":"http://www.whitewomanlane.norfolk.sch.uk","email":"enquiries@suffolkandnorfolkscitt.co.uk","telephone":"01473 265077","fullName":"Ashley Best-White, Headteacher"},"location":{"latitude":52.666205,"longitude":1.3101272},"trainWithUs":"White Woman Lane School has been a lead school offering tuition placements across our Partnership of Schools for a number of years. White Woman Lane School itself is part of the Nebula Federation which has six schools working together; a mixture of primary and junior schools, church and community schools, sharing strengths and resources and ensuring wider collective support for our schools. We are in partnership with the Suffolk & Norfolk Primary SCITT Tuition PGCE programme, which has an excellent local reputation for providing training of the highest quality. Suffolk & Norfolk SCITT is the biggest SCITT in the country. All trainees on this course will obtain the following qualification, QTS, and the PGCE with 60 Masters’ credits.","trainWithDisability":"Suffolk and Norfolk SCITT supports all trainees based on their individual needs. Recently this has included those with dyslexia, physical, hearing and visual impairments and mental health conditions. Plans are developed with trainees to ensure that they can fully access in centre training, operate effectively on school placement and complete written assignments.\n\nSuffolk & Norfolk Primary SCITT training venues in Ipswich and Norwich have full disabled access as do partnership schools. However, applicants who would benefit from disabled access should let us know on their application so that they can be considered for placements at the most appropriate schools.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"89831af6-535f-471b-aa97-098bd1a93291","code":"S13","name":"Suffolk and Norfolk Primary SCITT","description":"The Suffolk and Norfolk Primary SCITT programme is a personalised, relational and ethical training provider. Primary SCITT has very high attainment and employment outcomes for trainees. On average 95% of trainees are employed in local schools by the end of their training year. \\r\\n\\r\\nTrainees are supported by school mentors and SCITT Tutors who have a range of experience in schools as classroom practitioners and often headteachers or members of senior leadership teams, so have a wealth of experience to share with trainees. \\r\\n\\r\\nThe Primary SCITT course is a highly personalised course which offers a wide range of opportunities to trainees."}],"createdAt":"2021-07-06T17:56:15.345Z","updatedAt":"2021-09-23T16:54:01.549Z"}
