{"id":"7cae8fa2-3337-4628-a2b9-1765d272daaf","name":"Carlton Academy Trust Schools Direct","code":"3E0","type":"lead_school","isAccreditedBody":false,"urn":"147100","ukprn":"10083491","address":{"addressLine1":"Undercliffe Ln","town":"Bradford","county":"West Yorkshire","postcode":"BD3 0DU"},"contact":{"email":"N.Sutcliffe@carltonbolling.co.uk","telephone":"01274 633111","fullName":"Neil Sutcliffe"},"location":{"latitude":53.801712,"longitude":-1.7357759},"trainWithUs":"Carlton Bolling is an Outstanding school which has been on a rapid improvement journey over recent years, gaining an Ofsted “outstanding “rating (2017) less than two years after coming out of “special measures”. We achieved the World Class School Quality Mark in 2018 and in 2019 we were voted Pearson Secondary School of the year: Making a difference. These awards confirm our continuing commitment to move the school forward to the very highest levels with focused new initiatives and innovations.\nOur shared vision of “Excellence for All” runs through all aspects of school life and reflects our track record and commitment to ITT. The school has a long history of providing high quality teacher training and many of our current staffing team, were trainees at the school, keen to return to start their careers with us. As part of the SCITT training programme, you will practise your teaching skills in our school from day one of your course and will benefit from learning to teach alongside, and under the guidance of, our team of outstanding practitioners. You will be treated as a member of staff and potential employee of the school whilst benefiting from our bespoke CPD. We are proud to be the founding school in the Carlton Academy Trust and are already working with other schools on their journey to excellence. This provides an environment where talented teachers, new to the profession, have the opportunities to develop and progress their careers within our primary and secondary schools.","trainWithDisability":"We believe that teachers with disabilities, make an important contribution to schools both in the classroom and in shaping the wider culture and ethos of the schools they work in. We adhere to The Equality Act 2010 and Special Educational Needs and Disability Act 2001, which require teacher training providers to ensure they are not discriminating against applicants with disabilities or special educational needs (SEN). All our partner Schools value diversity and the unique contribution that all their staff and trainees bring.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"58e814cb-bf42-4d3d-9486-b3ea827fd9e2","code":"259","name":"Bradford Birth to 19 SCITT","description":"Bradford Birth to 19 (SCITT) offers a different way of training. Learn by listening to and observing good and outstanding teachers. Training involves practicing your teaching skills with groups of students. Supported effectively by a school mentor, you are treated as a member of the school staff, someone the school is often looking to potentially employ. \\r\\nWe aim to train the next generation of outstanding teachers. We are committed to providing the highest standard of education for our young people. We are keen to recruit student teachers who share the same commitment."}],"createdAt":"2021-07-06T17:54:58.237Z","updatedAt":"2021-09-30T20:23:34.877Z"}
