{"id":"7cb26c78-f71a-4cfb-8823-f8a8c2eff488","name":"Oasis Innovation","code":"1A2","type":"lead_school","isAccreditedBody":false,"urn":"137479","ukprn":"10035086","address":{"addressLine1":"Oasis Academy Limeside","town":"Third Avenue","county":"Oldham","postcode":"OL8 3SB"},"contact":{"website":"https://www.oclcareers.org/train-to-teach","email":"mary.flynn@oasislimeside.org","telephone":"0161 688 7535","fullName":"ITE Lead"},"location":{"latitude":53.518104,"longitude":-2.129169},"trainWithUs":"Oasis School Direct Alliance is working in partnership with The University of Manchester (an outstanding provider of Initial Teacher Training) to offer places on the Primary School Direct course. Throughout the year training is delivered by tutors from The University of Manchester and by outstanding teachers from across our training hub schools. Our small cohort means that you will benefit from intense, bespoke support as you develop in confidence in the classroom.\n\nAs a community of schools we support you in securing a teaching position once you have finished your PGCE year. You will receive extensive training helping you with job applications, interview techniques and other skills to aid you gaining employment. \n\nTo be an outstanding teacher takes energy, commitment and dedication. If you feel ready to train within the fast paced, professional environment of a busy school, then our School Direct route may be the best choice for you.","trainWithDisability":"Oasis is working towards equality of opportunity for all who apply for employment with the organisation. We are actively opposed to discrimination and want to ensure our processes support recruitment of the full diversity of people. We fully support the social model of disability and we recognise that people with different impairments or medical conditions can experience different barriers.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:47:45.475Z","updatedAt":"2021-10-20T16:41:37.632Z"}
