{"id":"7cdf0a26-446c-459d-8293-68a294150a3e","name":"Bohunt Education Trust","code":"1DP","type":"lead_school","isAccreditedBody":false,"urn":"136643","ukprn":"10033361","address":{"addressLine1":"Bohunt School","addressLine2":"Longmoor Road","town":"Liphook","county":"Hampshire","postcode":"GU30 7NY"},"contact":{"website":"www.bohunttrust.com","email":"SchoolDirect@bohunt.hants.sch.uk","telephone":"01428724324 ext 262","fullName":"Vicky Sands"},"location":{"latitude":51.0783327,"longitude":-0.8063705},"trainWithUs":"Bohunt Education Trust (BET)\nAt BET, we provide innovative, high-quality education for children aged four to 18. We are a multi-academy trust (MAT) of eight non-fee paying schools, working together with shared values and vision to ensure consistency and excellence for all our students. We set the highest expectations, and nurture students’ individual talents and interests to help them flourish and achieve their full potential.\nBohunt School is the lead training school (rated Outstanding in all categories by Ofsted in 2013 and ‘Overall School of the Year’ 2014), in close partnership with Camelsdale Primary School and schools across the South of England. We have a long experience of providing outstanding teacher training in Primary and Secondary. We are different to other Teaching Schools because we collaborate with several Universities including Chichester, Sussex, Winchester, Portsmouth, Brighton, Goldsmiths and St Mary’s. This allows us to offer applicants greater flexibility and choice because they can apply to their local University and, where possible, are hosted in a school within easy travelling distance. We want to get the right people into teaching as we know that the more we invest in you the better you can improve the life chances of children. If the above sounds for you then we’d love you to get in contact. Our Secondary partner schools include: Priory School (Portsmouth), The Petersfield School, Bohunt Liphook, Bohunt Wokingham, Bohunt Worthing, The Costello School (Basingstoke), Steyning Grammar School and others locally. Primary include Camelsdale and others within the Rother Valley.","trainWithDisability":"In alignments with university policies.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"yes","canSponsorStudentVisa":"yes"},"accreditedBodies":[{"id":"049fe65f-08dc-4686-9ac8-606dce490128","code":"G56","name":"Goldsmiths, University of London","description":""},{"id":"ef172d85-20e4-4aa2-96d0-9e3ae81f526d","code":"S64","name":"St Mary’s University, Twickenham","description":""},{"id":"d2ba71f2-c125-4d86-bb22-736e67043120","code":"B72","name":"University of Brighton","description":""},{"id":"3f5b1139-3651-4ee5-845c-54cd9e999b08","code":"C58","name":"University of Chichester","description":""},{"id":"5abccd25-3cfa-47a4-9f66-d30a662ae5d1","code":"P80","name":"University of Portsmouth","description":""},{"id":"4d4cceab-1516-4a6c-a9ab-5de0e32e1fe1","code":"S90","name":"University of Sussex","description":"Sussex Partnership course trainee teacher course outcomes are consistently high; \\r\\n\\r\\n100% of trainees achieve QTS on their first attempt, \\r\\n94% of trainees complete with a Distinction or a Merit \\r\\n98% of trainees secure a teaching post on completing the course \\r\\n99% of ex-trainees rated the Sussex Partnership course as ‘good’ or ‘very good'."},{"id":"3700fb02-7007-40c8-9127-b070e146d6cb","code":"W76","name":"University of Winchester","description":""}],"createdAt":"2021-07-06T17:50:49.447Z","updatedAt":"2021-10-19T18:04:55.328Z"}
