{"id":"7ce8999c-6a2f-468a-a9ce-a6bfd1be7ebb","name":"Inclusive Schools Trust","code":"2JE","type":"lead_school","isAccreditedBody":false,"urn":"144144","ukprn":"10064197","address":{"addressLine1":"Inclusive Schools Trust","addressLine2":"c/o Lionwood Infant and Nursery School, Telegraph Lane East","town":"Norwich","county":"Norfolk","postcode":"NR1 4AN"},"contact":{"website":"www.inclusiveschoolstrust.co.uk","email":"office@istnorfolk.co.uk","telephone":"1603516164","fullName":"Maria Cornish"},"location":{"latitude":52.6293194,"longitude":1.3152024},"trainWithUs":"Inclusive Schools Trust is based in Norwich, Norfolk. Our schools have a history of successfully training teachers and we have chosen SCITT as our main training provider due to its reputation for high quality tuition and support for students.\nAs part of our therapeutic arm called Lionwood Support School, we offer additional training sessions to enhance the excellent provision offered by SCITT. These hands-on training sessions aim to give practical advice and support for students in their placements and compliment the training provided. They include areas such as Speech, Language and Communication, Behaviour Management, Assessment and Data and Special Educational Needs and Disability. The sessions are run by specialists working within the Trust.\nWe also offer students the chance to visit our Trust schools, attend twilights where appropriate and provide support with applications for employment.","trainWithDisability":"Suffolk and Norfolk SCITT supports all trainees based on their individual needs. Recently this has included those with dyslexia, physical, hearing and visual impairments and mental health conditions. Plans are developed with trainees to ensure that they can fully access in centre training, operate effectively on school placement and complete written assignments.\nSuffolk & Norfolk Primary SCITT training venues in Ipswich and Norwich have full disabled access as do partnership schools. However, applicants who would benefit from disabled access should let us know on their application so that they can be considered for placements at the most appropriate schools.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"89831af6-535f-471b-aa97-098bd1a93291","code":"S13","name":"Suffolk and Norfolk Primary SCITT","description":"The Suffolk and Norfolk Primary SCITT programme is a personalised, relational and ethical training provider. Primary SCITT has very high attainment and employment outcomes for trainees. On average 95% of trainees are employed in local schools by the end of their training year. \\r\\nTrainees are supported by school mentors and SCITT Tutors who have a range of experience in schools as classroom practitioners and often headteachers or members of senior leadership teams, so have a wealth of experience to share with trainees. \\r\\nThe Primary SCITT course is a highly personalised course which offers a wide range of opportunities to trainees."}],"createdAt":"2021-07-06T17:48:07.173Z","updatedAt":"2021-09-23T19:41:19.039Z"}
