{"id":"7cf252b3-c098-46fb-9c61-851ec3c9dd25","name":"Bromley Schools’ Collegiate School Direct","code":"1C9","type":"lead_school","isAccreditedBody":false,"urn":"136644","ukprn":"10033362","address":{"addressLine1":"Hayes Secondary School","addressLine2":"West Common Road","town":"Hayes, Bromley","county":"Kent","postcode":"BR2 7DB"},"contact":{"website":"http://bscteach.co.uk","email":"administrator@gradteach.co.uk","telephone":"2083006566","fullName":"Gill Kendall"},"location":{"latitude":51.3740544,"longitude":0.0187867},"trainWithUs":"Main Site\tBromley Schools' Collegiate, Hayes, Bromley Kent, BR2 7DB Bromley Schools' Collegiate is a well established provider of initial teacher training with over 25 years experience. During this time we have trained over 1500 teachers. 100% of our trainees say they feel supported on their journey through their training year and prepared as they become Early Career Teachers (ECT) . What our last cohort of trainees say about us: *\tI know my confidence stems from the opportunities that have been provided by Bromley Schools' Collegiate * Support and guidance enables trainees to apply their knowledge skilfully in placement schools *\tSupport was consistent throughout and I have really benefited from learning as you go approach *\tI feel very lucky to have had 2 amazing placements with very, very supportive departments who would do anything they could to help *\tThe course is fantastic. There is a great emphasis on independence and freedom * Trainees know what leaders and mentors expect of them - the course was robust and intense! I feel very well prepared for my career as a teacher","trainWithDisability":"Bromley Schools' Collegiate is an all inclusive provider.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"2cb11a46-97d4-4ced-a702-0dc37f7d6ebb","code":"B91","name":"Bromley Schools Collegiate","description":"Bromley Schools’ Collegiate is a well established provider of initial teacher training with over 25 years experience. During this time have trained over 1500 teachers. \\r\\n\\r\\nAt the end of their training, trainees say they feel supported on their journey through their training year and prepared as they become Early Career Teachers (ECT) . \\r\\n\\r\\n* The programme has been developed to deepen trainee’s use of research informed practice. \\r\\n\\r\\n* Trainees will receive high quality training from experienced facilitators, many who are drawn from partnership schools, providing real-life context to the training."}],"createdAt":"2021-07-06T17:52:18.845Z","updatedAt":"2021-10-02T22:55:35.367Z"}
