{"id":"7d0c173d-d084-47d1-8aea-909930227991","name":"University of Sheffield","code":"S18","type":"hei","isAccreditedBody":true,"ukprn":"10007157","address":{"addressLine1":"The School of Education","addressLine2":"The University of Sheffield","town":"Western Bank","county":"Sheffield","postcode":"S10 2TN"},"contact":{"website":"https://www.sheffield.ac.uk/education/pgde","email":"education-admissions@sheffield.ac.uk","telephone":"0114 222 8177","fullName":"Admin"},"location":{"latitude":53.3813502,"longitude":-1.4884229},"trainWithUs":"The University of Sheffield has a long-standing reputation in Initial Teacher Education (ITE); we’ve been training teachers and educational professionals for well over 50 years. Our highly qualified team includes a blend of university-based tutors and seconded school-based staff, enabling us to offer outstanding teacher development.\nWe focus on training student teachers to use their powerful subject knowledge to create interesting, relevant and innovative teaching. Our students will develop the skills to become transformative teachers who make a positive impact on the outcomes of pupils and have the capacity to become future leaders in the profession.\nWe currently have over 40 schools in our partnership enabling us to offer an excellent range of school experiences.\nOur ITE course not only leads to Qualified Teacher Status (QTS), but also awards the Postgraduate Diploma in Education (PGDE), which is professionally and academically recognised. We aim to develop the ability of student teachers to think and act reflectively to a high level with both a theoretical and practical knowledge of how to teach.\nThe University of Sheffield is a world top-100 university. As a member of the UK's prestigious Russell Group of leading research-led institutions, Sheffield offers world-class teaching and research excellence. Our Students' Union has been voted best in the UK for the fourth year in a row by the Whatuni Student Choice Awards (2020, 2019, 2018, 2017).\nFind out more on our [website](https://www.sheffield.ac.uk/education/pgde).","trainWithDisability":"As a student teacher at The University of Sheffield you will have full access to support if you have a disability or additional needs. Full information is available [here]( http://www.shef.ac.uk/ssid/disability)\nAdditionally, we work closely with all our school partners to ensure that your needs are met whilst on placement, offering support and adaptations where necessary.\nThe more we know about your additional needs, the easier it is for us to support you to succeed in your development as a teacher.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"createdAt":"2021-07-06T17:51:13.832Z","updatedAt":"2021-09-22T14:54:38.640Z"}
