{"id":"7d226956-8115-42bb-81d9-2730ab356296","name":"North Tyneside SCITT","code":"N73","type":"scitt","isAccreditedBody":true,"ukprn":"10004714","address":{"addressLine1":"North Tyneside SCITT","addressLine2":"Langdale Centre, Langdale Gardens","town":"Wallsend","county":"Tyne and Wear","postcode":"NE28 0HG"},"contact":{"website":"https://ntscitt.org.uk/","email":"scitt@northtyneside.gov.uk","telephone":"0191 643 8855","fullName":"North Tyneside SCITT"},"location":{"latitude":55.006613,"longitude":-1.496986},"trainWithUs":"Our highly successful programme combines high quality, extensive classroom experience with expert guidance and continues to be judged as Outstanding by OFSTED (2015). \"Outstanding school and centre-based training, which draws on the passion and expertise of school-based colleagues and members of the local authority's school improvement service to ensure trainees are very well prepared for employment.\"(OFSTED 2015)\nIn our 2021 student satisfaction survey, all (100%) of our completing graduates said they would recommend the SCITT to others and were satisfied with the overall design, structure and content of our initial teacher education (ITE) curriculum and taught programme.\nThe course is constructed around a partnership of over 20 primary and first schools in North Tyneside and North Tyneside Council's School Improvement Service.\nThe Langdale Centre is a high quality, bespoke professional training and development centre and is the base for the School Improvement Team for North Tyneside’s Early Years and School Improvement Service. You will receive extensive training from our experienced and passionate experts in their field. In addition, the SCITT offers the following facilities to our trainees:\n* Free printing and photocopying\n* Free WiFi\n* Use of laptop and IT equipment for the duration of the course\n* SCITT common room * A high quality restaurant\n* Free parking","trainWithDisability":"North Tyneside SCITT welcomes applications from trainees with disabilities and other needs. The SCITT is committed to ensuring that all trainees have the same opportunities to access centre-based and school-based training and will receive tailored support in order to meet their needs.\nThe Langdale Centre where the SCITT is primarily based is equipped with disabled access and facilities.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:56:46.659Z","updatedAt":"2021-10-06T18:10:09.121Z"}
