{"id":"7d419a51-28e0-47f8-b0a2-462179e2370b","name":"Forest Learning Alliance","code":"1HW","type":"lead_school","isAccreditedBody":false,"urn":"109847","ukprn":"10068903","address":{"addressLine1":"Uplands Primary School and Nursery","addressLine2":"Albion Road","town":"Sandhurst","county":"Berkshire","postcode":"GU47 9BP"},"contact":{"website":"https://forestlearningalliance.org/train-to-teach/programme/","email":"cpowell@uplandsberkshire.org","telephone":"1252873069","fullName":"School Direct Co-ordinator"},"location":{"latitude":51.3479461,"longitude":-0.7987065},"trainWithUs":"Uplands Primary School and Nursery is the lead school for Forest Learning Alliance, working with Primary and special schools in the local area. We work in partnership with the Institute of Education, University of Reading who have an exceptional reputation in teacher training. As an alliance of 27 schools, we provide a high quality provision to deliver a well-rounded training programme. We offer the Early Career Framework (ECF), an opportunity for you to continue with us beyond the training year and undertake the two year training. Forest Learning Alliance is also a provider of National Programme Qualifications. You can undertake these as you progress in your career. We offer support, guidance and continued professional development throughout your career in teaching and leadership.\nWho are we looking for?\nWe are looking to offer places to inspirational people who have a proven track record of good communication skills and the ability to use their initiative and work under pressure in a demanding environment. School Direct (salaried) is aimed at graduate career changers who have three or more years’ work experience. Successful applicants who have proven at the point of application and at interview, they have skills, understand the role of the teacher and able to train whilst working in a school.\nSchool Direct (fee paying) route is also a school-based route into initial teacher training for applicants who are often undergraduates or who have limited experience of working in schools, leading classes, and taking responsibility for teaching on a regular basis.","trainWithDisability":"We aim to make any reasonable adjustment for applicants with a disability or other protected characteristics.","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"6439adcc-af64-4d3d-a1da-de045755db06","code":"R12","name":"University of Reading","description":"The Institute of Education is an established provider of high-quality training and research. It is ranked 10th in the UK for Education (The Guardian University League Table 2022) and is committed to developing caring, reflective, professional teachers thorugh its well-established partnerships with over 400 schools in Berkshire and the surrounding area.\\r\\n\\r\\nOfsted report that the “effective relationships with partner schools support the development of high-quality teaching and trainees that are well-prepared to work in the region’s schools.” (ITE inspection report, September 2016)."}],"createdAt":"2021-07-12T20:49:25.954Z","updatedAt":"2022-02-01T23:37:43.609Z"}
