{"id":"7d993440-a3ed-4ec7-9e83-a223d1832f00","name":"Caludon Castle School","code":"179","type":"lead_school","isAccreditedBody":false,"urn":"139292","ukprn":"10040289","address":{"addressLine1":"Axholme Road","addressLine2":"Wyken","town":"Coventry","county":"West Midlands","postcode":"CV2 5BD"},"contact":{"website":"www.castlephoenix.org.uk/School-Direct","email":"Lindsay.James@castlephoenixtrust.org.uk","telephone":"02476 444822","fullName":"Ann Rayns"},"location":{"latitude":52.4135709,"longitude":-1.4514674},"trainWithUs":"As the lead school in the Coventry East Alliance, we comprise secondary and primary schools in Coventry and Warwickshire. Applying for a School Direct place through us will guarantee an exceptional teacher training experience, either at Caludon Castle School or at one of our other successful partner schools. Caludon Castle is a very good school with an excellent record of teacher training: in 2020 – 2021, we trained over 20 potential teachers, through both the PGCE and School Direct routes, all achieving at least a ‘good’ grade by the end of their training year, with the majority being graded as outstanding. All of our trainee teachers have always been able to secure jobs in teaching by the end of their training years.\nOur partner provider, The University of Warwick, confirm the Alliance is ‘outstanding’\n“outstanding training provision for all trainees”\nPractical, school-based training takes place at the lead school and within the Alliance. We offer placements across most subject areas. Trainees are supported by experienced Subject Mentors: experts in their academic fields.\n“The feedback on placements is very positive, providing excellent training experiences for the trainees.” Director of Teacher Education, Warwick University.\nSchool Direct programmes in schools contain a core Professional Studies element and a series of Subject Studies sessions designed for the chosen specialism. Trainees will have a complementary experience in another secondary or primary school, immersing themselves in school life. Trainees, also, spend time gaining experience in Special Education within their own schools.","trainWithDisability":"The staff at Caludon Castle Alliance are committed to ensuring that all students and teachers develop their full potential. Therefore we aim to provide a caring and supportive environment for all of our students and staff and are committed to the active promotion of Equal Opportunities.\nThe school wishes to ensure that it complies with the requirements of the Disability Discrimination Act (as amended by the Special Educational Needs and Disability Act 2001 and 2005) and the Equality Act 2010 and the Children and Families Act 2014. We are committed to ensuring that disabled people, including those with learning difficulties, are treated fairly. All reasonable adjustments to provision will be made to ensure that disabled students and other disabled people are not substantially disadvantaged.\nThis Disability Statement supports the Trust’s drive towards inclusive learning.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:52:26.010Z","updatedAt":"2021-09-24T16:46:09.604Z"}
