{"id":"7dd0b9e5-a4fe-4256-bb69-a0e6534be174","name":"Orange Moon Education","code":"3A7","type":"lead_school","isAccreditedBody":false,"urn":"140417","ukprn":"10054833","address":{"addressLine1":"6 Sherwood Rise","town":"Nottingham","postcode":"NG7 6JF"},"contact":{"website":"https://www.orangemooneducation.co.uk","email":"pgta@omeducation.co.uk","telephone":"0115 7843981","fullName":"Barrington Oliver-Mighten"},"location":{"latitude":52.971091,"longitude":-1.1582617},"trainWithUs":"Orange Moon Education is a consortium of leading education specialists and training providers who share a common goal to improve outcomes for children by providing high-quality training to childcare and education practitioners.\n\nWe work in partnership with Bradford Birth to 19 SCITT to deliver a QTS accredited post-graduate apprenticeship with a PGCE option that blends pedagogic models and academic theory with practical on-the-job training and support.\n\nOrange Moon, established since 2010 and specialises in providing high-quality training solutions to Schools, Settings, Childcare providers and individuals across our six regions. \n\nOrange Moon has successfully trained over 700 apprentices and delivered over 3,200 qualifications. Our range of programmes has placed over 650 individuals into new employment in their chosen careers and up skilled many more, enabling them to progress along their existing career path or into new roles within their organisation. For some we have enabled a complete career change.\n\nOur tailored programme produces well-rounded and inspiring teachers, who have the school’s philosophy ingrained within their daily practices. Our programme is suitable for ambitious Teaching Assistants, staff employed in a non-teaching role, or any graduate looking to become a teacher. Our flexible teacher training programme enables you to enrol onto our work-based learning route to Qualified Teacher Status. \n\nOur unique blended learning model combines school-centred initial teacher training, classroom-based professional studies and online tuition.\n\nWe are keen to support the national drive to enable more BAME candidates become qualified Teachers. You can join our programme at any time during the year.","trainWithDisability":"We believe that teachers with disabilities make an important contribution to schools both in the classroom and in shaping the wider culture and ethos of the schools they work in, indeed we have 100% pass rate for trainees who have declared a disability. We adhere to The Equality Act 2010 and Special Educational Needs and Disability Act 2001, which require teacher training providers to ensure they are not discriminating against applicants with disabilities or special educational needs (SEN). All our partner Schools value diversity and the unique contribution that all their staff and trainees bring.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:54:56.999Z","updatedAt":"2021-10-13T18:38:59.752Z"}
