{"id":"7e1a6557-d36c-4f27-9fdc-d7d80ae06f33","name":"Taunton Teaching Alliance (Heathfield School)","code":"232","type":"lead_school","isAccreditedBody":false,"address":{"addressLine1":"School Road","addressLine2":"Monkton Heathfield","town":"Taunton","county":"Somerset","postcode":"TA2 8PD"},"contact":{"website":"http://www.heathfieldcommunityschool.com/","email":"pbayley@heathfieldcommunityschool.co.uk","telephone":"1823412396","fullName":"Jeremy Backhouse"},"location":{"latitude":51.0350019,"longitude":-3.0627718},"trainWithUs":"Through our programme of Initial Teacher Training, Taunton Teaching Alliance aims to draw in and retain the best graduates and strongest aspiring teachers to train in schools within the partnership, including in shortage subject areas.\nWorking with our partner ITT providers – the Mid-Somerset Consortium, Exeter University and the Somerset Primary SCIL (Somerset Centre for Integrated Learning) – we provide School Direct courses leading to PGCE where trainee teachers are nurtured and supported across our partner schools.","trainWithDisability":"The TTA welcomes all candidates and trainees with disabilities, health conditions, metal health conditions or learning difficulties and aims to support all candidates and trainees throughout the recruitment process and training course. We support trainees with their specific learning needs to achieve their dream of becoming a teacher and will ensure appropriate support throughout the recruitment process and training year. As an experienced provider of Initial Teacher Training, we are proud to have supported students with a variety of additional needs to become fantastic and successful teachers. We will aim to tailor our support to make sure that the course is both accessible and achievable. We encourage all candidates/trainees with any disability or health conditions to discuss this with the TTA/MSC. If you wish to discuss any of the above, please contact the office. We work closely with trainees and schools to ensure training is accessible and personalised to an individual's needs.","accreditedBodies":[{"id":"0fd2de51-736a-4516-81ce-94659d58951d","code":"M84","name":"Mid Somerset Consortium for Teacher Training","description":"The MSC has excellent outcomes; they were ranked 27/153 secondary trainers across the UK in the Good Teacher Training Guide 2017. It has successfully been training teachers in Somerset’s Secondary Schools for 11 years. \\r\\n\\r\\nIt trains between 35 and 50 trainees each year. School Direct Salaried trainees make up a small but significant proportion of these."},{"id":"be897ea1-5b41-4b40-8eaf-877a15ad688b","code":"S31","name":"Somerset SCITT Consortium","description":"School Centred Initial Teacher Training (SCITT) in Somerset began in 1997 in partnership with the University of Worcester. Somerset SCITT has continued to grow from strength to strength, providing high quality, local teacher training to benefit the education of young people across Somerset and the Southwest.\\r\\n\\r\\nIn 2017 Somerset SCITT was awarded Ofsted ‘Outstanding’ (in all areas). \\r\\n\\r\\nWe currently offer the following School Direct routes to Qualified Teacher Status (QTS)\\r\\n\\r\\n* School Direct Non-Salaried\\r\\n* School Direct salaried\\r\\n* Teaching Apprenticeship"}],"createdAt":"2021-07-06T17:49:19.037Z","updatedAt":"2021-07-06T17:49:19.037Z"}