{"id":"7efcb0f8-9d1c-4f9b-8083-660469763c02","name":"Creative Education Trust","code":"5A1","type":"lead_school","isAccreditedBody":false,"urn":"137781","ukprn":"10036161","address":{"addressLine1":"Ash Green School","addressLine2":"Ash Green Lane","town":"Coventry","county":"West Midlands","postcode":"CV7 9AH"},"contact":{"website":"https://www.creativeeducationtrust.org.uk","email":"teachertraining@creativeeducationtrust.org.uk","telephone":"7842314726","fullName":"Ian Harding"},"location":{"latitude":52.4605749,"longitude":-1.5084174},"trainWithUs":"Creative Education Trust is a network of 17 schools educating 13,500 children and young people. We are committed to providing excellent educational opportunities for children of all abilities and to building cultural capital through a wide range of co-curricular activities. Curricular innovation through our Knowledge Connected programmes promotes creative, integrated and pro-active thinking so that our students are equipped for the challenges of the 21st century. This thinking is evident across our ITT model and we ensure that all staff are supported, developed and nurtured. Creative Education Trust is committed to furthering your career and ensuring you have the best opportunities to grow and learn surrounded by supportive and experienced colleagues.","trainWithDisability":"Creative Education Trust is committed to supporting trainees with disabilities and other needs, so please let us know if you would like us to make any adjustments to support you during the application, interview process and throughout your programme.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"26797ebf-f835-47c8-9369-7d6d67fb2343","code":"C85","name":"Coventry University","description":"The National School of Education \\u0026 Teaching is a leading global provider of initial teacher training and postgraduate degrees in education and educational leadership. They are accredited by the Department for Education (DfE) in England to recommend the award of Qualified Teacher Status."},{"id":"ef09ce50-ccfc-4346-a0ce-43e840153dab","code":"W20","name":"University of Warwick","description":"The qualification gained on our School Direct programme is the same University of Warwick, Post Graduate Certificate in Education (PGCE) as that gained by students on the more traditional University-led teacher training programme and has judged to be Outstandingby Ofsted (2015) The University of Warwick has been placed 6th in the UK by the Guardian University Guide 2022 and has been named by the Sunday Times Good University Guide 2022 as the University of the year for Teaching Quality."},{"id":"b8bcaeed-f311-4867-a1e3-c0fde20809d6","code":"E14","name":"University of East Anglia","description":"UEA is a top UK university with an international reputation for excellence in teaching and research and are ranked among the top 182 universities in the world (Times Higher Education World University Rankings 2022).\\r\\n\\r\\nThe School of Education and Lifelong Learning is internationally recognised for the quality of its educational research. Our research has made a difference in schools across the country.\\r\\n\\r\\nAll UEA PGCE tutors have experience of school teaching and leadership, and all are specialists in particular areas of the curriculum. You will be well-supported throughout your PGCE, both during your time in school and on campus."}],"createdAt":"2021-07-06T17:46:27.265Z","updatedAt":"2021-12-20T20:13:00.799Z"}
