{"id":"7f05f8ba-b5c9-4dae-9e0e-abb480bdf07e","name":"Pan Enfield Alliance","code":"1KC","type":"lead_school","isAccreditedBody":false,"address":{"addressLine1":"Pan Enfield Alliance","addressLine2":"Highlands School, 148 World’s End Lane","town":"London","postcode":"N21 1QQ"},"contact":{"website":"www.panenfieldalliance.co.uk","email":"info@panenfieldalliance.co.uk","telephone":"020 8370 1166","fullName":"Schools Direct Administrator"},"location":{"latitude":51.6488658,"longitude":-0.109103},"trainWithUs":"The Pan Enfield Alliance is a very well-regarded and respected collaboration of schools, with a genuine and long-standing commitment to training the next generation of teachers. We have a strong track record of training School Direct colleagues in a diverse range of settings - with secondary schools, primaries, a special school and a tuition centre all contributing to teacher training. We frequently collaborate and share best practice and with over 90% of our trainees finding employment in a school of their choice, we are confident that we produce high quality teachers who are attractive to a range of prestigious employers. Equally, we are proud of our teacher retention rates as many of our trainees choose to remain with us to further their career within the Pan Enfield Alliance.","trainWithDisability":"We welcome and are committed to complying with our duties under the Equality Act 2010 and any subsequent legislation.\nUnder the Equality Act 2010, there are certain ‘protected characteristics’ that qualify for protection against discrimination. These are age, disability, gender reassignment, marriage and civil partnership, pregnancy and maternity, race, religion or belief, sex and sexual orientation.\nHighlands was built in 2000 and as such all facilities are accessible to staff with additional need. Interventions include lifts, wide corridors, coloured edges to steps, tactile edges on fire exits. Lifts have tactile buttons. Students who use wheelchairs can move freely around the school.","accreditedBodies":[{"id":"36425fae-da68-4e79-89de-8b41ea733c37","code":"K60","name":"King’s College London (University of London)","description":"Located in the heart of London, PGCE courses at King’s are rated Outstanding by Ofsted with excellent tutors on hand to support you through your training. In the last research assessment exercise, the department was rated second in the UK (REF. 2014). You will have the opportunity to work with experienced tutors who are actively engages in research in their subject and in pedagogy more widely. 94% of 2018 graduates who sought teaching posts were employed within 6 months of qualifying. In our 2019 student survey, 92% of trainees rated the quality of their training as very good or good."},{"id":"feecdec5-259c-45e3-b1cf-4e391936ee90","code":"H36","name":"University of Hertfordshire","description":"With a long history of working in the education and training of teachers and other professionals in the education sector, we are an established and dynamic School committed to developing excellence and confidence in teaching, learning and professional practice for individuals in a variety of contexts.\\r\\n\\r\\nOur underpinning values are:\\r\\nThe importance of scholarship, research and critical reflection.\\r\\nRespect and challenge for all learners including ourselves.\\r\\nThe significance of personal and professional development.\\r\\nA shared commitment to quality."}],"createdAt":"2021-07-06T17:56:43.971Z","updatedAt":"2021-07-06T17:56:43.971Z"}