{"id":"7f11aaed-7c3e-42c5-af7a-023d33b45fa3","name":"UCL, University College London","code":"U80","type":"hei","isAccreditedBody":true,"ukprn":"10007784","address":{"addressLine1":"University College London","addressLine2":"Gower Street","town":"London","county":"Greater London","postcode":"WC1E 6BT"},"contact":{"website":"https://www.ucl.ac.uk/ioe/courses/teacher-training","email":"teaching-admissions@ucl.ac.uk","telephone":"0208 059 0939","fullName":"Sarah West"},"location":{"latitude":51.5245592,"longitude":-0.1340401},"trainWithUs":"IOE, UCL's Faculty of Education and Society is a global leader in teacher education. Our programmes are recognised by Ofsted as 'outstanding' in every criterion across Primary, Secondary and Further Education (FE). - We'll support you with the skills and knowledge you'll need from the moment you step into a classroom, but we know that learning to teach is much more than that we'll prepare you to build a rewarding and fulfilling long-term career in education. - Our focus on quality means that whatever route you select, you will be taught by experts in your subject and education phase, many of whom are world leaders in their field. - We are committed to supporting education in London, where schools lead the country in performance and pupil progress. We work with around 500 London schools, including long-term partners who work with us to harness our wider research and expertise. - When you walk into IOE, you'll join a lively, friendly and diverse community of 8,000 students and more than 600 distinguished academics, committed to improving lives through education and promoting social participation to address local and global challenges.","trainWithDisability":"Please visit our [Student Support and Wellbeing website] (https://www.ucl.ac.uk/students/student-support-and-wellbeing/) for information about the services they offer to incoming students.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"createdAt":"2021-07-06T17:56:39.663Z","updatedAt":"2022-01-07T21:15:24.546Z"}
