{"id":"7f349baa-f4ef-4fd5-b228-fcc56247e9b9","name":"The OAKS (Ormiston and Keele SCITT)","code":"24P","type":"scitt","isAccreditedBody":true,"ukprn":"10055541","address":{"addressLine1":"Room CBA0.040","addressLine2":"Chancellor’s Building","town":"Keele","county":"Staffordshire","postcode":"ST5 5BG"},"contact":{"website":"https://theoaks.org.uk/","email":"k.a.pickin@keele.ac.uk","telephone":"+441782733130","fullName":"Rob Tweats"},"location":{"latitude":53.0020434,"longitude":-2.2809935},"trainWithUs":"The OAKS is an Ofsted Outstanding (2016) and innovative SCITT (School Centred Initial Teacher Training programme) which links Keele University and OAT (Ormiston Academies Trust) with a long established partnership of schools in five local authorities: Staffordshire, Stoke on Trent, Shropshire, Birmingham and Cheshire. Within the 5 regions are 5 hubs named:\nOSSMA (Stoke on Trent and surrounding areas)\nStafford Hub (Stafford and surrounding areas)\nBlackfriars Teaching Alliance (Newcastle, Shropshire and surrounding area schools)\nBrine Leas High School (East Cheshire Schools)\nFairfax Academy (Birmingham and surround areas)\nThe OAKS course is based in the beautiful green campus of Keele University and all trainees will qualify with a Keele University PGCE and QTS from The OAKS.\nYou are important to us and many support structures are in place for this challenging, but very rewarding course. It is our aim to produce highly motivated, creative, successful and reflective teachers. Such teachers, we know, will be in great demand both in the local region and nationally.\nYou will be placed in two placements, where you will put theory into practice. In addition, The OAKS also gives you the opportunity to observe teaching in alternative educational settings such as EAL, PRU, Special and Independent Schools. Programme Data from 2018/9 across all our hubs:\n94% successfully completed the programme, of which\n90% of our trainees gained employment\n100% of the cohort achieved ‘outstanding’ or’ good’\n96& of our trainees rated our programme as 'outstanding' or 'good'.","trainWithDisability":"We have a dedicated support tutor, who supports our trainees with disability or any other need. It is important to state that they do not assess your teaching performance, this gives you the opportunity to speak honestly about your needs, but also enables the support tutor to have the freedom to help you and visit you; whether you are in placement school or here at The OAKS. This includes signposting through to developing individualised learning plans which may extend beyond the course date to enable you to successfully complete the programme.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:47:26.267Z","updatedAt":"2021-09-27T18:13:18.897Z"}
