{"id":"802cf355-16a5-49dc-930b-6a18a520e373","name":"Beech HIll","code":"14G","type":"lead_school","isAccreditedBody":false,"urn":"144524","ukprn":"10063983","address":{"addressLine1":"Linhope Road","addressLine2":"West Denton","town":"Newcastle upon Tyne","county":"Newcastle-upon-Tyne","postcode":"NE5 2LW"},"contact":{"website":"http://www.beechhill.newcastle.sch.uk/website/school_direct/126800","email":"admin@beechhill.newcastle.sch.uk","telephone":"1912678113","fullName":"Jess Eatock"},"location":{"latitude":54.9942855,"longitude":-1.6918836},"trainWithUs":"With Beech Hill Primary as the Lead School, Creating Teachers for Tomorrow (CT4T) are delivering a dynamic, new Initial Teacher Training (ITT) programme based in Newcastle Upon Tyne. We work in partnership with Northumbria University offering full time Schools Direct tuition and salaried placements.\nYou would become part of a long established network of schools that work closely together and frequently share expertise. Our vision is simple yet powerful – The Best from all, for All and our aim is to equip every child with the skills and ambition to be a valued member of society and the wider world. Our partnership of schools is led by Beech Hill Primary School; a National Support School with an excellent track record of school improvement. We offer a wide variety of settings which include: small village schools, large two form entry schools with additional placements in a pupil referral unit; a specialist provision for children with autistic spectrum disorder and a school with a high proportion of EAL ensuring a wide and varied range of experiences. We provide support, expertise and an array of experiences, allowing trainees to fulfil their potential as excellent practitioners.\nSuccessful applicants will gain a full PGCE with Masters credits from Northumbria University. Trainees spend four days a week based in host and placement schools, with the fifth day dedicated to bespoke training and university support.\nStaff amongst the partnership are regarded as our greatest asset and you would become part of a very strong team.","trainWithDisability":"Students with disabilities and other needs will be fully supported by the partnership. Placements in schools are considered carefully taking physical and mental health conditions into account and accessibility issues will be addressed as necessary.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:52:29.721Z","updatedAt":"2021-09-24T15:02:56.233Z"}
