{"id":"8083b4a3-293b-4efc-9594-73f347e74fcd","name":"Pen Green Centre for Children and Their Families","code":"21P","type":"lead_school","isAccreditedBody":false,"urn":"131232","ukprn":"10034200","address":{"addressLine1":"Rockingham Road","town":"Corby","county":"Northamptonshire","postcode":"NN17 1AG"},"contact":{"website":"http://pengreen.org","email":"enquiries@pengreen.org","telephone":"01536 443435","fullName":"Holly Reilly"},"location":{"latitude":52.4982152,"longitude":-0.6882367},"trainWithUs":"Pen Green Nursery School and Early Years provision have been consistently judged Outstanding by Ofsted and in 2018 awarded ‘Overall School of the Year’ and ‘Early Years Provision of the Year’ by the Times Educational Supplement.\nOur Initial Teacher Training programme is accredited by the Two Mile Ash ITT Partnership and provides the opportunity for candidates to achieve Qualified Teacher Status (QTS) with a focus on the 3-7 year age group.\nCandidates have the option to achieve the Postgraduate Certificate Education (PGCE), a Level 7 academic qualification, alongside their QTS. The PGCE is accredited by Birmingham City University (BCU).","trainWithDisability":"All efforts are made to support candidates with disabilities and other needs and we encourage candidates to discuss any programme adjustments they need. Candidates need to identify their disability and other needs in their application. We request candidates who have existing Study Needs Assessments to include this with documents required at interview.\nFor candidates who do not have a Study Needs Assessment, we request a self-assessment checklist is completed prior to induction. If the score indicates the candidate may have additional needs, they will be given the opportunity to be assessed by a qualified specialist teacher who may make recommendations. Following this, a Study Needs Agreement is put in place, outlining what the trainee & teaching team will do to support their study. Candidates with a declared disability may be eligible for additional financial support through the student loans company. Eligibility may be assessed via a Disabled Students’ Allowance assessment centre.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"6e6c8aa3-8d77-4c7d-af3c-4c7912b1cc2a","code":"T89","name":"Two Mile Ash ITT Partnership","description":"Two Mile Ash ITT Partnership is the longest-running, most well-established primary teacher training provider serving Milton Keynes and its surrounding counties, with 19 years’ experience in leading initial teacher training.\\r\\n\\r\\nPlease note, this is a School Direct Tuition Fee programme, if you have the requisite experience and come with the financial backing of a school, then you can consider the Postgraduate Teaching Apprenticeship programme, which is available through Two Mile Ash ITT Partnership."}],"createdAt":"2021-07-06T17:53:24.638Z","updatedAt":"2021-09-29T17:04:05.267Z"}
