{"id":"81269e40-2116-4686-a687-2e30bf961839","name":"Woolwich Poly","code":"1HC","type":"lead_school","isAccreditedBody":false,"urn":"141163","ukprn":"10013305","address":{"addressLine1":"Hutchins Road","addressLine2":"Thamesmead","county":"London","postcode":"SE28 8AT"},"contact":{"website":"https://www.woolwichpoly.co.uk/about-us/91.html","email":"gillkendall@gradteach.uk","telephone":"0208 3006566","fullName":"Grace Odutola"},"location":{"latitude":51.5036883,"longitude":0.1080656},"trainWithUs":"Woolwich PolyMat are committed to providing an outstanding education to all children, of all ages in Thamesmead (South London) and the surrounding areas with a relentless focus on ensuring that our students achieve the very best outcomes in the pursuit of our vision ‘Success for Everyone’. The Trust is dedicated to meeting the needs of the young people within our community and supporting all stakeholders in that endevour. We believe in developing all within the PolyMAT community to become the best that they can; striving to co-ordinate the personal social and academic development of our young people to become well balanced young adults. We believe that partnership, collaboration and school to school support will make all schools in the MAT not only outstanding but exceptional! We welcome applications who are ready to make a difference to lives of young people in the community. We are proud to partner with Bromley Schools' Collegiate as our accredited provider who provide the training programme and assessment. Our partnership consists of Woolwich Poly School for Boys,Hutchins Road, Thamesmead, London, SE28 8AT and Woolwich Poly School for Girls 1 Birchdene Dr, London SE28 8SP (established 2019).","trainWithDisability":"Together with Bromley Schools' Collegiate Woolwich PolyMat are inclusive schools. Access to Employment Assistance Programme for confidential support is available to all. Trainees who require extra or personalised assistance are encouraged to discuss what is best for them with central staff.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"2cb11a46-97d4-4ced-a702-0dc37f7d6ebb","code":"B91","name":"Bromley Schools Collegiate","description":"Bromley Schools’ Collegiate is a well established provider of initial teacher training with over 25 years experience. During this time have trained over 1500 teachers. \\r\\n\\r\\nAt the end of their training, trainees say they feel supported on their journey through their training year and prepared as they become Early Career Teachers (ECT) . \\r\\n\\r\\n* The programme has been developed to deepen trainee’s use of research informed practice. \\r\\n\\r\\n* Trainees will receive high quality training from experienced facilitators, many who are drawn from partnership schools, providing real-life context to the training."}],"createdAt":"2021-07-06T17:49:31.376Z","updatedAt":"2021-10-01T21:17:12.922Z"}
