{"id":"812b70c4-7fc4-46fc-975b-3e4d00f77dc4","name":"Manchester Metropolitan University","code":"M40","type":"hei","isAccreditedBody":true,"urn":"133844","ukprn":"10004180","address":{"addressLine1":"Brooks Building","addressLine2":"Bonsall Street","town":"Manchester","county":"Greater Manchester","postcode":"M15 6GX"},"contact":{"website":"https://www.mmu.ac.uk/education/pgce/","email":"courses@mmu.ac.uk","telephone":"0161 247 6969","fullName":"Manchester Metropolitan University"},"location":{"latitude":53.4666748,"longitude":-2.2465299},"trainWithUs":"COULD YOU BECOME AN ORIGINAL INFLUENCER?\n\nAs one of the city’s most established providers – with almost 150 years training education professionals under our belts – we know teaching inside out.\n\nIn many ways, we think teachers are the original influencers. They inspire. They engage. They explain. And they have a lasting impact on the pupils they teach.\n\nWe’ve been educating teachers, practitioners and professionals since 1878. We’re proud of our history. We’re proud of our present. And we’re proud to be one of the largest teacher training establishments in the country. Each year, we welcome over 700 trainee teachers onto our PGCE courses. We have a partnership of over 1,500 regional schools, colleges and educational organisations. We adopt leading research into our teaching through our Education and Social Research Institute (ESRI). \n\nSHARING SELFIES TO SHARING KNOWLEDGE\n\nSharing selfies is fun, but there is real joy in sharing knowledge. It’s finding new ways to explain complex theories to students and inspiring a love of learning. Discovering innovative global teaching methods. Using research to make a difference in the classroom.\n\nYou might debate how pupils learn when they live below the poverty line or explore the effect of the growth mind-set. You might research ways to include bilingual students in your lessons or global methods of teaching maths and how this could help your class.\n\nWhichever subject you’re hoping to teach, we’ll help you to develop the practical skills you need to teach, to inspire and to engage your class.","trainWithDisability":"From study skills to dyslexia screenings - we've got it covered - https://www.mmu.ac.uk/student-life/wellbeing/disability/.\n\nIf you are a care leaver, estranged from your family, a carer, under 18 or pregnant, we have a dedicated Inclusion Service to help you through your studies - https://www.mmu.ac.uk/student-life/wellbeing/inclusion/.\n\nCome and visit our Open or Visit Days and speak to a member of staff from Disability Service - https://www.mmu.ac.uk/study/open-days.\n\nOr simply contact the Disability Service on 0161 247 3491 or (disability.service@mmu.ac.uk)","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"createdAt":"2021-07-06T17:54:41.761Z","updatedAt":"2021-09-13T17:36:47.838Z"}
