{"id":"816ef4e7-51c7-4211-828f-dbf6bb48bb6d","name":"Loughborough University","code":"L79","type":"hei","isAccreditedBody":true,"urn":"133834","ukprn":"10004113","address":{"addressLine1":"Loughborough University","town":"Loughborough","county":"Leicestershire","postcode":"LE11 3TU"},"contact":{"website":"https://www.lboro.ac.uk/departments/teacher-education/","email":"pg-ssehs@lboro.ac.uk","telephone":"1509226302","fullName":"Teacher Education Unit"},"location":{"latitude":52.7650814,"longitude":-1.2320534},"trainWithUs":"Loughborough University has a strong tradition of teacher education and a history of successfully producing teachers who are in great demand by schools and colleges in the UK and overseas.\nOur courses have been highly rated in Ofsted inspections and Loughborough has been assessed as a category 'A' provider, representing 'outstanding' provision, three consecutive times since 2005. Loughborough University is ranked 2nd in the top ten of higher education institutions in the 'Good Teacher Training Guide 2017' and has been ranked Top 10 for the past five years\nThe Loughborough Post-Graduate Certificate in Education course contributes towards half of a masters degree. Individuals wanting to complete the masters degree can do so on a part-time basis during their early teaching career.\nIf you are interested in training to teach Physical Education or Mathematics in secondary schools, you will find the information you need to get started on this site.","trainWithDisability":"The University encourages the development of an environment in which diversity is valued. An important part of putting this into practice is a commitment to prohibit discrimination on the grounds of disability in all employment matters, to increase employment opportunities for people who have a disability and to ensure that its recruitment and selection processes are fully accessible.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:56:30.250Z","updatedAt":"2021-09-17T18:04:01.909Z"}
