{"id":"8197a07f-5718-4fc9-be40-1dd29bae338e","name":"St Bede’s Catholic Comprehensive School and Sixth Form College, Lanchester","code":"1QB","type":"lead_school","isAccreditedBody":false,"urn":"138172","ukprn":"10037433","address":{"addressLine1":"St Bede’s Catholic School & Sixth Form College","addressLine2":"Consett Road","town":"Lanchester","county":"Co Durham","postcode":"DH 7 0RD"},"contact":{"website":"https://www.centreforteaching.com/contact-us/","email":"aherdman@stb.bwcet.com","telephone":"01207 520424","fullName":"Anna Herdman"},"location":{"latitude":54.8283727,"longitude":-1.7477169},"trainWithUs":"By choosing to do your training at St Bede’s you will be immersed in school life from the outset, interacting with students and learning first hand from outstanding teachers. We provide an innovative initial teacher training programme which will develop all aspects of your teaching repertoire and thoroughly prepare you for your NQT year. You will practise a broad range of skills in a bespoke training programme that will aim to develop you into an outstanding practitioner from the outset.\nYou will be allocated a subject mentor from our staff with vast experience to support you through the year. These outstanding classroom practitioners will introduce you to school life and help you to learn how to teach your subject and also provide you with regular feedback and guidance to improve.\nSt Bede’s works closely with Durham SCITT (School Centre Initial Teacher Training). \nYou will also complete a Primary placement and Placement B at a chosen Secondary School. \nBy choosing to train with St Bede’s, you will be working with other enthusiastic and talented trainees as well as outstanding staff.","trainWithDisability":"St Bede's Catholic School & Sixth Form College strives to ensure that their provision does not place applicants with declared disabilities at a disadvantage. We make anticipatory adjustments to promote positive equality of access for disabled applicants, including access to benefits, facilities and services. We provide as many opportunities as possible for applicants to identify any special arrangements they may require, for example when inviting them for interview and continue to provide this level of care throughout their journey with us.\nWe also ensure timely risk assessments are carried out to meet the needs of the individual.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:49:35.418Z","updatedAt":"2021-09-30T21:16:09.503Z"}
