{"id":"81f8bc12-af45-49a9-a58f-164d3d725f27","name":"The London-Exeter Partnership","code":"L10","type":"lead_school","isAccreditedBody":false,"urn":"131737","ukprn":"10073658","address":{"addressLine1":"Harry Gosling Primary School, Fairclough Street","town":"London","postcode":"E1 1NT"},"contact":{"email":"mwolfe1.211@lgflmail.org","telephone":"0207 481 1650","fullName":"Miriam Wolfe"},"location":{"latitude":51.5135199,"longitude":-0.0660985},"trainWithUs":"The London-Exeter Partnership offers a unique programme spanning Devon and the vibrant East London Borough of Tower Hamlets leading to a PGCE in primary education.\nWe offer a first term study module at Exeter University, a leader in Initial Teacher Training, consistently graded as outstanding in all areas by Ofsted and ranked 3rd amongst university providers of teacher training. You will then continue to train in your second and third terms in the high-performing London borough of Tower Hamlets. You will gain experience in successful primary schools who all share a common goal of exceptional education for children and a strong commitment to developing you as a future teacher.","trainWithDisability":"The University of Exeter provides comprehensive student services that include AccessAbility and Wellbeing teams, Student Learning Skills Service, Student Advice Unit, Counselling Service, Students’ Union Advisors, Student Health Centre, Family Centre and the Chaplaincy. For further details on the wealth of support available to you please go to Student Support Services (http://www.exeter.ac.uk/newstudents/supportandservices/yourhealthandwelfare/#a4). PGCE trainees can access the support of a Wellbeing Services Welfare Caseworker to discuss concerns, talk through options for support or understand more about how the University Wellbeing Services may be able to help. Alongside the support described above, every PGCE trainee is assessed by an Occupational Health provider as part of the admissions process to ensure they are fit to teach in a school setting. The Occupational Health provider can recommend ‘Reasonable Adjustments’, which will be put into place by the provider, providing they are logistically possible and reasonable.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"accreditedBodies":[],"createdAt":"2021-07-06T17:54:01.141Z","updatedAt":"2021-10-20T21:22:01.931Z"}
