{"id":"821a4820-4847-4f70-9872-2e630476bb30","name":"Dixons Academies Trust","code":"1EP","type":"lead_school","isAccreditedBody":false,"urn":"130909","ukprn":"10001992","address":{"addressLine1":"Dixons Teaching Institute","addressLine2":"Ripley Street","town":"Bradford","county":"West Yorkshire","postcode":"BD5 7RR"},"contact":{"website":"https://www.dixonsat.com/train-to-teach","email":"teachertraining@dixonsacademies.com","telephone":"01274 085441","fullName":"Helen Clarke"},"location":{"latitude":53.7808667,"longitude":-1.7571813},"trainWithUs":"By training with us, you will be part of something special.\nAt Dixons, our mission is to challenge educational and social disadvantage in the North and we welcome applications from people committed to making a difference in areas where it matters the most.\nWe are a well-established multi-academy trust serving the communities of Bradford and Leeds. We have 6 secondary academies, 3 primaries, 2 all-through academies and one sixth form academy. Soon, we will have two schools in Liverpool and a further two are in the pipeline in Manchester. We lead educational improvement in the region through our high performing academies which value diversity and maximise student achievement.\nWe offer a secondary School Direct programme and we are partnered with Leeds Trinity University. For primary, we are partnered with Bradford Birth to 19. You will benefit from excellent support and guidance from Dixons Teaching Institute and our partners so you develop into the best teacher you can be and make a difference to the lives of local children.\nWe are located in Dixons Teaching Institute, home of Bradford Research School.\nOur School Direct programme offers you a guarantee of a placement in our successful and aspirational academies; consequently, you will train to teach students who learn and behave exceptionally well. From the start of the course, you will work with students and be fully immersed in the life of a school. We are proud of providing excellent teacher training for more than 20 years.","trainWithDisability":"All our academies value diversity. We adhere to The Equality Act 2010 and Special Educational Needs and Disability Act 2001, which require teacher training providers to ensure they are not discriminating against applicants with disabilities or special educational needs (SEN).\nWe make suitable provision for disabled trainees, students and visitors on request. If invited to interview, any specific support required will be discussed with candidates. Please contact us for further or specific information.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"accreditedBodies":[],"createdAt":"2021-07-06T17:51:41.904Z","updatedAt":"2021-10-01T18:28:13.496Z"}
