{"id":"824ca597-a0d4-48f5-a7f9-241e05cc31bf","name":"Claremont Primary School","code":"1TP","type":"lead_school","isAccreditedBody":false,"urn":"118456","ukprn":"10069510","address":{"addressLine1":"Banner Farm Road","town":"Tunbridge Wells","county":"Kent","postcode":"TN2 5EB"},"contact":{"website":"https://claremont.kent.sch.uk/train-to-teach","email":"traintoteach@claremont.kent.sch.uk","telephone":"01892 531395","fullName":"Elaine Brooks"},"location":{"latitude":51.1264463,"longitude":0.2703145},"trainWithUs":"[Claremont Primary School](https://claremont.kent.sch.uk/train-to-teach) is the lead primary school for the SCITT. We are an Outstanding school, which has been designated as a Teaching School and National Support School. We work in partnership with [Teach Kent and Sussex](https://www.teachkentandsussex.org.uk/about-teach-kent-sussex/). Teach Kent and Sussex was recently rated OUTSTANDING in all areas by Ofsted. [Click here](https://files.ofsted.gov.uk/v1/file/50135014) to read the inspection report.\nThe Ofsted report stated that \"The overall effectiveness of this popular and rapidly growing partnership is outstanding. Trainees achieve excellent outcomes because their training course, informed by the most up-to-date research available, is carefully sequenced and expertly led. In addition, well-trained mentors provide trainees with strong support and challenge during their school placements.\"\nAs a Trainee Teacher, you will benefit from being part of a teaching and learning community that prides itself on being 'A hub of educational excellence and innovation, supporting and valuing everyone'.\nBy applying through us, you will train in any one of Teach Kent and Sussex's [partner schools](https://www.teachkentandsussex.org.uk/our-partner-schools/).","trainWithDisability":"We wish to ensure that every candidate can show their potential to become a great teacher. We work closely with candidates who declare a disability or additional need to ensure that reasonable adjustments are made at interview to ensure that all candidates have an equal chance to show their potential to teach.\n\nIf offered a place to train to teach, we will agree with you an independent support plan which is reviewed on a termly or more frequent basis if necessary. This helps to ensure that our provision is the best it can be. Such reviews have shown to be helpful and effective in the past and are an essential part of our provision.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"2b8fac2f-ed98-4278-a7fc-fa3f418dfbef","code":"2EZ","name":"Teach Kent & Sussex","description":"Teach Kent \\u0026 Sussex is an Ofsted Outstanding ITE Partnership dedicated to developing world-class teaching. We are passionate about providing training for teachers that transforms the opportunities young people have. Teachers who have been inspired by high-quality initial teacher training and professional development will inspire our students with their expert knowledge on how children can flourish. Nothing else is as important. \\r\\n\\r\\n[Click here](https://www.teachkentandsussex.org.uk/about-teach-kent-sussex/) to find out more."}],"createdAt":"2021-07-06T17:55:19.313Z","updatedAt":"2021-10-05T01:27:25.898Z"}
