{"id":"828d1c59-36a8-4678-9a60-662565ae7172","name":"The Cambridge Partnership","code":"C03","type":"scitt","isAccreditedBody":true,"ukprn":"10053421","address":{"addressLine1":"CMAT Swavesey Village College","addressLine2":"Gibraltar Lane, Swavesey","town":"Cambridge","county":"Cambridgeshire","postcode":"CB24 4RN"},"contact":{"website":"http://www.campartnership.org","email":"info@campartnership.org","telephone":"01223 491630","fullName":"Programme Administrator"},"location":{"latitude":52.2947667,"longitude":-0.0055253},"trainWithUs":"The Cambridge Partnership (TCP) has an excellent reputation for Initial Teacher Training, offering SCITT Core, SDTP and SDTP(salaried) courses across the whole of East Anglia; we are also pleased to consider applicants from further afield. We train in both primary and secondary phases and will consider applications for all subjects at secondary level. TCP also accepts trainees from the Researchers In Schools (RIS) programme and will be applying for provider status for the Apprenticeships programme during this year. We also offer, in partnership with an HEI, a PGCE element for those who want to take on extra study.\nOn the course you will be in school four days a week and follow a central training programme on Fridays, which augments your subject knowledge for teaching and your general professional development.\nDuring the course you will receive strong support from TCP in the form of a Subject Specialist Tutor (secondary) or a Phase Manager (Primary). Well-being of trainees is crucial and we have developed a strong mechanism to support trainees in this respect. A qualified counsellor is available at no cost to you.\nOver the course you will produce an e-portfolio of evidence, monitored by TCP and your school(s). You will also have assignments to complete and your teaching will be observed regularly, with feedback to ensure strong classroom practice.\nIn November 2017, TCP was graded “good” by Ofsted and we shall be pleased if you view our final report on the OfSTED website.","trainWithDisability":"The Cambridge Partnership (TCP) welcomes applications from candidates with disabilities. Once accepted on one of our courses, we will ask you to provide detail of your needs so that we can put in place bespoke support for each individual. At the same time, TCP considers trainee well-being and mental health as crucial in developing outstanding teachers. We have a Cause4Care programme, which provides extra support for trainees who might have temporary or longer term personal challenges that are preventing good progress. We also have a qualified counsellor available to trainees at no cost.\nTCP prides itself on its care for trainees with permanent or temporary disability. Quality Assurance data shows no difference in outcomes between trainees with disabilities and others.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:51:46.512Z","updatedAt":"2021-09-28T22:47:39.111Z"}
