{"id":"829f9f39-4a5b-416a-bf01-8673634f6164","name":"Newport Junior School","code":"175","type":"lead_school","isAccreditedBody":false,"urn":"116234","ukprn":"10064119","address":{"addressLine1":"Belle Vue Road","town":"Aldershot","county":"Hampshire","postcode":"GU12 4RZ"},"contact":{"website":"http://www.alderwood.hants.sch.uk","email":"c.desausmarez@alderwood.hants.sch.uk","telephone":"1252323494","fullName":"Clare de Sausmarez"},"location":{"latitude":51.2441602,"longitude":-0.7464069},"trainWithUs":"Alderwood School is an outstanding all-through 4-16 school. We formed in April 2017 following the amalgamation of Belle Vue Infant, Newport Junior and The Connaught Schools. Since then, our school has gone from strength to strength, offering a high standard of education for pupils in the surrounding area and we achieved an OFSTED 'good' rating in January 2020.\nWe work very closely with our excellent partner schools: St Michael's Infant and Junior Schools, Talavera Infant and Junior Schools, Park Primary and Wellington Primary. All schools in the partnership have a strong culture of high quality staff development and we have an excellent track record with NQTs and trainee teachers. Our schools are exciting and challenging places to work in. Our staff are highly motivated, committed and enthusiastic and there is a great team spirit within and between all the Aldershot schools. We can offer at least one School Direct training place in each school for September 2020 and are seeking to recruit ambitious trainees with high expectations.","trainWithDisability":"There is support available for candidates with disabilities and other needs. This can be arranged through the University of Winchester or through the individual schools in the partnership.\nAccessibility varies between locations and it is best to contact the Lead School to discuss this in advance to ensure that we can get the right match for each candidate.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-12T20:48:49.153Z","updatedAt":"2021-07-12T21:40:09.630Z"}
