{"id":"835967c9-a252-4902-8eed-7c4c86e5ba00","name":"Birkenhead North Schools Partnership","code":"2F7","type":"lead_school","isAccreditedBody":false,"urn":"105086","ukprn":"10074953","address":{"addressLine1":"Our Lady & St Edward’s Catholic Pri","addressLine2":"Price Street","town":"Birkenhead","county":"Merseyside","postcode":"CH41 8DU"},"contact":{"website":"http://www.ourlady-saintedwards.co.uk","email":"schooldirect@ourlady-saintedwards.wirral.sch.uk","telephone":"1516523366","fullName":"Head of Admissions"},"location":{"latitude":53.3998418,"longitude":-3.0409598},"trainWithUs":"Our Lady and St. Edward’s Catholic Primary Teaching School is the lead school within the Birkenhead North Schools Partnership. The partnership offers an exciting School Direct programme aimed at recruiting and training high quality aspiring primary school teachers.\nWorking in partnership with Liverpool Hope University, we provide our trainees with a strong school-centred postgraduate route into teaching but with the added benefit of studying for 60 credits at Masters level.\nOur students will receive direct training that will have the academic and theoretical underpinning to allow them to become outstanding practitioners within the field of education.\nStudents will spend the majority of their practical teaching time at our lead school but will also gain a range of experiences in our partner schools.\nWe aim to recruit high quality graduates and are seeking individuals who can demonstrate and apply the skills of organisation, flexibility, reflection, evaluation and action to all aspects of the course and their career.","trainWithDisability":"Wherever possible the Partnership will make changes suitable for all students, for example, good accessibility to buildings. \nAll partner schools have an accessibility plan which can be viewed on their website.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:53:00.660Z","updatedAt":"2021-07-16T23:09:04.612Z"}
