{"id":"8371a30d-8ee1-4e4a-911e-5002a73fdc99","name":"Fairfield Infant School","code":"1VQ","type":"lead_school","isAccreditedBody":false,"urn":"124582","ukprn":"10080422","address":{"addressLine1":"Fairfield Infant School","town":"Felixstowe","county":"Suffolk","postcode":"IP11 9JB"},"contact":{"website":"http://www.colneisjunior.co.uk","email":"office@fairfieldandcolneis.co.uk","telephone":"01394 283206","fullName":"Keith Rimmer"},"location":{"latitude":51.9683099,"longitude":1.3512112},"trainWithUs":"Fairfield Infant School is the Lead School of a partnership of six schools in and around Ipswich and Felixstowe. The partnership works with Suffolk & Norfolk Primary SCITT to provide School Direct Tuition Fee places.\n\nOur partnership of schools comprises a mixture of large and small, urban and rural, infant and junior. They are conveniently located along the East Coast of Suffolk and central Ipswich which means trainees can engage with more than one school in the partnership. We provide a unique opportunity to experience a diverse and contrasting range of teaching and training experiences.\n\nOur staff are our most valuable resource and have a proven track record in training and professional development. Our teachers are excellent practitioners with exemplary behaviour management skills and are eager to share their skills, knowledge and practice with the next generation of teachers.","trainWithDisability":"Suffolk and Norfolk SCITT supports all trainees based on their individual needs. Recently this has included those with dyslexia, physical, hearing and visual impairments and mental health conditions. Plans are developed with trainees to ensure that they can fully access in centre training, operate effectively on school placement and complete written assignments.\nSuffolk & Norfolk Primary SCITT training venues in Ipswich and Norwich have full disabled access as do partnership schools. However, applicants who would benefit from disabled access should let us know on their application so that they can be considered for placements at the most appropriate schools","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"89831af6-535f-471b-aa97-098bd1a93291","code":"S13","name":"Suffolk and Norfolk Primary SCITT","description":"The Suffolk and Norfolk Primary SCITT programme is a personalised, relational and ethical training provider. Primary SCITT has very high attainment and employment outcomes for trainees. On average 95% of trainees are employed in local schools by the end of their training year. \\r\\n\\r\\nTrainees are supported by school mentors and SCITT Tutors who have a range of experience in schools as classroom practitioners and often headteachers or members of senior leadership teams, so have a wealth of experience to share with trainees. \\r\\n\\r\\nThe Primary SCITT course is a highly personalised course which offers a wide range of opportunities to trainees."}],"createdAt":"2021-07-06T17:47:45.589Z","updatedAt":"2021-09-23T16:51:38.955Z"}
