{"id":"83c2a9fe-ca61-435e-a3a6-fb843ca2607b","name":"North West Learning Partnership","code":"13N","type":"lead_school","isAccreditedBody":false,"urn":"142161","ukprn":"10053591","address":{"addressLine1":"North West Learning Partnership Training Centre at St Mary & St Thomas C.E. Primary","addressLine2":"Barton Close","town":"St Helens","county":"Merseyside","postcode":"WA10 2HS"},"contact":{"website":"http://www.northwestlearningpartnership.co.uk/index.php/workstreams/school-direct","email":"kathy.carman@three-saints.org.uk","telephone":"7383094506","fullName":"Kathy Carman"},"location":{"latitude":53.4552981,"longitude":-2.7435394},"trainWithUs":"North West Learning Partnership School Direct is an established and successful School Direct Provider. As one of only 40 Maths Hubs in the country, we are able to provide outstanding training at the forefront of developments in Mathematics education. Our affiliation with North West Learning Partnership enables us to offer high quality training in all areas of the school curriculum and external audits have recognised this provision as \"Outstanding\". The one year in school training for graduates is provided by Serving Head Teachers, Senior Leaders, SLEs/ PDLs and other specialists in their field based at our Strategic Partner schools in close partnership with Liverpool John Moores University. Training with us also means that you will benefit from\n•\tHigh employment rates\n•\tOnly Good to Outstanding schools within our Partnership are used for placements\n•\tPlacement schools are across the North West including St Helens, Wigan, Bolton, Liverpool, Halton, Knowsley and Manchester.\n•\tHighly effective school based tutors. All of a senior level with a wealth of experience or are Specialist Leaders in their field of expertise (SLEs)\n•\tPersonal support structures in place.\nLarge enough to offer a good range of opportunities and experiences but small enough to provide personalised training and support.\n•\tProvision continues to be graded as ‘Outstanding\nNorth West Learning Partnership are committed to ongoing development to all trainees for at least 3 years. Trainees have access, free of charge, to our highly effective NQT and RQT programmes.\n[North West Learning Partnership]\n(http://www.northwestlearningpartnership.co.uk/index.php)\n(http://www.northwestlearningpartnership.co.uk/index.php/workstreams/school-direct)","trainWithDisability":"North West Learning Partnership is committed to Equality of Opportunity. All trainees are encouraged to disclose any specific learning need that they experience, in order to make any adjustments. Student support is available from both the partnership and the University.\nSupport will be put into place for any trainee teacher who may need additional support or reasonable adjustments. For example, we have a specialist in Dyslexia within our Specialist Leader in Education team within the partnership, who can provide support in developing coping strategies in day to day teaching. Your emotional well being and mental health is important to us. Therefore, support systems are embedded within our programmes.\nAs part of the enrolment process to Teacher Training Programmes all students are required to complete a Health Questionnaire.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"ec34b77c-cba3-4598-93be-23f0471adff1","code":"L51","name":"Liverpool John Moores University","description":"Our accredited body, Liverpool John Moores University has an established reputation for high quality Teacher Training. The LJMU Partnership’s 2019 OFSTED inspection outcomes were the best on Merseyside with Primary provision graded Outstanding and Secondary programmes judged to be Good. Our Partnership with LJMU ensures that our teachers develop a deep and research-informed understanding of subjects, the curriculum, learners and learning. The Postgraduate Award from LJMU is co-designed to ensure that teaching and assignments are embedded in classroom practice. There is significant academic and pastoral support from LJMU."}],"createdAt":"2021-07-06T17:49:26.706Z","updatedAt":"2021-10-01T21:14:56.857Z"}
