{"id":"83ea9389-1e92-4a90-bf1b-93c43bee334e","name":"White Rose Alliance","code":"196","type":"lead_school","isAccreditedBody":false,"urn":"121699","ukprn":"10003643","address":{"addressLine1":"White Rose Alliance","addressLine2":"King James’s School","town":"King James Road","county":"Knaresborough","postcode":"HG5 8EB"},"contact":{"website":"http://www.whiterosealliance.org.uk/","email":"schooldirect@king-james.n-yorks.sch.uk","telephone":"01423 866061","fullName":"White Rose Alliance Co-ordinator"},"location":{"latitude":54.0053154,"longitude":-1.4615954},"trainWithUs":"The White Rose Alliance works with partner school & university colleagues to develop outstanding teachers who are:\n* competent & confident professionals who learn that intellectual endeavour, criticality, & personal reflection are key to developing outstanding teaching\n* epistemic agents who act as independent thinkers, searching & critiquing a wide range of theories & research * able to engage in enquiry-rich practice & are intellectually curious about their work & receptive to new ideas\n* responsible professionals who embody high standards of professional ethics, recognising the social responsibilities of education\n* transformative & creative professionals who are highly motivated & committed\nWe are committed to delivering training that is current, relevant and research informed. Training that provides excellent opportunities for you to develop your knowledge and understanding of your subject and wider educational issues, so that you are well-equipped to be outstanding teachers and education leaders.\nKing James's School Knaresborough is the lead school for the White Rose Alliance which is a partnership of successful 11-18 schools which provide a variety of educational contexts across North and West Yorkshire. The White Rose Alliance is a well-established provider with a proven track record of bringing teachers into the profession through high quality Initial Teacher Training. We work in partnership with 3 universities in the region who accredit our courses. Across our previous 7 cohorts, 100% of trainees completing the course achieved graduating grades with 88% of trainees securing jobs of choice before or soon after graduating.","trainWithDisability":"For details about supporting candidates with disabilities and other needs, please see the websites of the respective university partner linked to the course you are interested in:\nLeeds Trinity University - (http://www.leedstrinity.ac.uk/student-life/student-support/dyslexia-and-disability-support)\nYork St John University - (https://www.yorksj.ac.uk/student-services/disability-advice-team/disability-support/)\nSheffield Hallam University - (https://www.shu.ac.uk/current-students/student-support/disability-support)","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"19a3446e-382d-4c14-83bb-a76563cef3c1","code":"L24","name":"Leeds Trinity University","description":"Leeds Trinity University has been synonymous with high quality teacher training since 1966, when they were founded as a Catholic teacher training college. \\r\\n\\r\\nOver the years, Leeds Trinity has diversified and expanded to become one of the UK’s top 15 universities for teaching quality and student experience*, but an unwavering commitment to outstanding teacher training has remained at the heart of what they do.\\r\\n\\r\\n*The Times and Sunday Times Good University Guide 2019"},{"id":"899178cc-20a7-4df5-951a-ee83c1b3d4d1","code":"S21","name":"Sheffield Hallam University","description":""},{"id":"b011427a-6dff-4a77-9df3-c85a54be605a","code":"Y75","name":"York St John University","description":"YSJ supports and trains student teachers who are intelligent risk takers who base their professional decisions on a deep-rooted understanding of pupil’s learning and effective pedagogies. \\r\\n\\r\\nInitial Teacher Education with York St John University in collaboration with the White Rose Alliance will provide you with high quality training that not only responds to the demands of the Teachers’ Standards and changes in the wider education landscape but also encompasses and embraces that which criticises and critiques current practice, encouraging, acknowledging and rewarding research-led reflection on pedagogy."}],"createdAt":"2021-07-06T17:49:54.602Z","updatedAt":"2021-09-14T15:45:10.992Z"}
