{"id":"846e9e8c-4a36-46b6-8e98-5f73fe47c794","name":"West Lakes Teaching School Alliance","code":"2HK","type":"lead_school","isAccreditedBody":false,"address":{"addressLine1":"West Lakes Teaching School Alliance","addressLine2":"Main Street","town":"Egremont","county":"Cumbria","postcode":"CA22 2DQ"},"contact":{"website":"http://www.westlakestsa.org.uk","email":"TSA@westlakesmat.org.uk","telephone":"1946820356","fullName":"Abby Deeks"},"location":{"latitude":54.484083,"longitude":-3.5305001},"trainWithUs":"West Lakes Teaching School Alliance is an alliance of secondary schools working together to provide high quality initial teacher training on the west coast of Cumbria. \n\nWe work in partnership with Durham University, an Ofsted Outstanding rated provider of ITT and a university with a strong tradition of engaging in cutting-edge educational research.\n\nThe Lead School in our alliance is West Lakes Academy, an Ofsted Outstanding rated school with a growing local and national reputation for providing high quality education for students and high quality professional development for staff as recognised in its accreditation as an SSAT Leading Edge school.\n\nStudents choosing to train with us will split their time between two placement schools in the west of Cumbria, and Durham University campus. This split, unique locally, ensures that our students have access to the highest quality academic training from Durham University alongside the experience of working in schools that really do make a difference to the lives of the students they serve.\n\nBeing located in the west of Cumbria means that our students have easy access to the Lake District National Park as well as to the bustling city of Carlisle. Our Teaching School is based in the market town of Egremont, found by a Royal Mail study in summer 2018 to be the best market town in Britain to live and work due to its good work-life balance, affordable housing and good schools. \n\n[Find out more.](http://www.westlakestsa.org.uk/)","trainWithDisability":"We arrange appropriate provision for disabled students.\n\nAcross our alliance schools, we are able to accommodate a range of disabilities and other needs.\n\nWe have experience of accommodating students with physical mobility needs, visual impairment, and dyslexia.","accreditedBodies":[{"id":"f3a93938-0208-4680-ac22-b564b18ff02b","code":"D86","name":"Durham University","description":"Durham University is one of the leading departments for education in the UK. Durham regularly features in the top five in national university league tables e.g. 3rd in the Guardian University Guide 2019. They also rate highly in the world rankings: 74th in the QS World University Rankings 2019.\\r\\n\\r\\nAs a department, the School of Education also lead the way in high quality research, 5th in the field of education nationally and joint 1st in the UK for world-leading research impact. They are a major contributor in the field of education.\\r\\n\\r\\nYou can be assured of high quality teaching."}],"createdAt":"2021-07-06T17:47:10.868Z","updatedAt":"2021-11-04T22:35:49.087Z"}