{"id":"85451f1d-964e-4f76-903b-884d31a63bec","name":"Mersey Boroughs ITT Partnership","code":"1X8","type":"scitt","isAccreditedBody":true,"ukprn":"10045107","address":{"addressLine1":"c/o St Mary & St Paul’s CE Primary School","addressLine2":"Bryer Road","town":"Prescot","county":"Liverpool","postcode":"L35 5DN"},"contact":{"website":"http://merseyboroughsitt.org.uk","email":"merseyboroughsitt@knowsley.gov.uk","telephone":"0151 443 2663","fullName":"Gill Makin"},"location":{"latitude":53.420575,"longitude":-2.8012507},"trainWithUs":"Working with our experienced and commited partnership of schools Mersey Boroughs ITT Partnership are proud to provide “High quality centre-based training equips trainees and NQTs extremely well with the subject and curriculum knowledge and practical skills required to be successful teachers.” – Ofsted.\nWe ensure that our trainees graduate with the knowledge, skills and personal attributes required to become an outstanding teacher. The programme results in the award of QTS with PGCE Masters credits. During your training year you will benefit from working within our close partnership of excellent schools on every aspect of our provision, “trainees spend more than the minimum required days working in schools. They have good opportunities to observe and learn from good and outstanding practitioners. Trainees also undertake helpful ’broadening experience visits’ and ‘mini placements’ in secondary, nursery and special schools.” – Ofsted. Our general primary programme offers a comprehensive schedule of subject and theoretical training, delivered by outstanding practitioners and experts from across our partnership in very practical, hands on class based sessions. The personalised nature of our programme ensures all our trainees are supported pastorally and professionally to develop their all round skills making them highly employable and fully prepared for a successful teaching career.","trainWithDisability":"Everyone in the Mersey Boroughs Partnership is committed to Equality of Opportunity and proud of the help we offer. Interviewees who would benefit from additional support are asked to contact our main office prior to the interview day to allow us to make extra time for any written tests or other appropriate arrangements in advance.\nPrior to registration trainees are encouraged to disclose any specific physical or learning needs that they have in order for us to make any necessary adjustments, both at our training venue and within our placement schools. As part of the pre course requirements potential ITT trainees are required to complete a Health Questionnaire and some may be asked to attend a screening appointment with our Occupational Health Unit. Our training venue has onsite parking facilities and is fully wheelchair accessible on one ground floor level.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:56:17.833Z","updatedAt":"2021-09-29T21:54:48.696Z"}
