{"id":"85855d6e-c9d4-4239-b9b4-d91634166eba","name":"West London Teaching School Alliance (Primary St Mary’s)","code":"2H3","type":"lead_school","isAccreditedBody":false,"address":{"addressLine1":"WLTSA Teaching School, Sacred Heart High School","addressLine2":"212 Hammersmith Road","town":"Hammersmith","county":"London","postcode":"W6 7DG"},"contact":{"website":"http://www.wltsa.org.uk/initial-teacher-training/primary-courses/","email":"pcurrey@sacredh.lbhf.sch.uk","telephone":"020 8748 7600 x466","fullName":"Alex Dijkhuis"},"location":{"latitude":51.493165,"longitude":-0.2228436},"trainWithUs":"WHO ARE WE? We are a large alliance of 60 schools spread across West London. We have formal partnership arrangements with three universities.\nThe designation of ‘Teaching School’ is being withdrawn by DfE in Sept 2021 for all Teaching Schools across the country. Our operational delivery will continue as before, simply with a new name the West London Teacher Training Partnership.\nOUR APPROACH TO TRAINEE RECRUITMENT\nWe pride ourselves in the support that we provide potential applicants and in the speed of our shortlisting. We have a detailed website which is a good place to start but we also run fortnightly information plus Q&A sessions. These explain the different qualifications; different routes into teaching; finance; and how it all works! Currently these sessions are online due to Covid restrictions. This may change over the course of the academic year. See how you can join one of these sessions here: ['WLTSA Information Sessions and Q&A](http://www.wltsa.org.uk/initial-teacher-training/online-info-and-q-a-sessions/) 'That’s the first time that I have ever properly understood it all. Brilliant!’ Our office is staffed full time with experts to talk to on the phone. You choose schools when you apply. If you perform well but fail to get a place at your preferred school, we continue to work with you, recommending you to other schools of your choice rather than rejecting you.\nWe place significant emphasis on getting a good fit between trainee and school because we are all keenly focused on recruitment for qualified teachers in our alliance schools the following year.","trainWithDisability":"WLTSA and all our partner universities are committed to supporting students with disabilities. Please contact us as early as possible in your application process so that your needs are met and support can be arranged.\nYou can also find support and information from the university accrediting the programme that you hope to apply for:\nST MARY'S UNIVERSITY: St Mary’s offer advice and support to their students who have requirements as a result of a disability, specific learning difficulty (e.g. dyslexia), medical condition or temporary disability, such as injury. St Mary’s Dyslexia and Disability Co-ordinator (DDC) works closely with the other members of the Student Services team, supporting students in their time at university assisting them to be proactive in their studies as an independent learner. [http://www.smuc.ac.uk/student-support/dyslexia-and-disability/](http://www.smuc.ac.uk/student-support/dyslexia-and-disability/)","accreditedBodies":[],"createdAt":"2021-07-06T17:55:28.188Z","updatedAt":"2021-08-11T17:54:36.439Z"}