{"id":"85fff496-4075-4cb3-9ad0-65e7958ea202","name":"West Essex SCITT","code":"2BB","type":"scitt","isAccreditedBody":true,"ukprn":"10067433","address":{"addressLine1":"The West Essex SCITT","addressLine2":"St John’s C of E Primary School","town":"High Road, Buckhurst Hill","county":"Essex","postcode":"IG9 5RX"},"contact":{"website":"http://www.westessexscitt.co.uk/About-Us/","email":"v.smullen@st-johns-buckhursthill.essex.sch.uk","telephone":"2033252809","fullName":"Vanessa Smullen"},"location":{"latitude":51.629587,"longitude":0.0332199},"trainWithUs":"The Department for Education accredits Epping Forest Schools Partnership Trust (EFSPT), operating as West Essex SCITT for the delivery of initial teacher training (ITT)\nWest Essex SCITT is an Outstanding Provider of Primary Initial Teacher Training - Ofsted 2018\nThe QTS only School Direct Training Programme is accredited by West Essex SCITT\nThe QTS with PGCE School Direct Training Programme is accredited by West Essex SCITT with PGCE validated by the University of Derby The West Essex SCITT Lead School is:\nSt John's CE Primary School\nSt John's CE Primary School, Epping Forest Schools Partnership Trust and our partnership schools, believe that teaching is an exciting, challenging and rewarding profession. Our vision is to offer the highest standard of education for all, both in our local community and the wider area.\nThe majority of our partnership schools are in the Epping Forest and Harlow areas and are accessible by Central Line Tube, Overground or major bus routes.\nOur teachers are excellent practitioners and are eager to share their skills, knowledge and vision with the next generation of teachers.\nWe pride ourselves on having a proven track record in training and professional development. All of our trainees who graduated from the course over the past three academic years have secured employment. Many of our School Direct trainees go on to secure full-time teaching positions within the Epping Forest Schools Partnership Trust. We work in collaboration with Saffron Teaching School Hub","trainWithDisability":"As a provider we are very aware of supporting our trainees and their individual needs. We see our trainees weekly at the training sessions. Student progress and their well-being is a priority. The School Based Educators, ITT co-ordinators and Professional Tutors are also there to support the trainees and monitor their progress and well-being. We include sessions on resilience and well-being, both of which are very important to us.. We take well-being very seriously. Our trainees have access to the well-being Services with the Schools Advisory Service. \n\nIf you would like to discuss how we support candidates with disabilities and other needs, please contact Susan Marbe by email for further information at: susan.marbe@efspt.org","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:46:36.241Z","updatedAt":"2021-08-02T20:37:55.334Z"}
