{"id":"86595f62-0f4f-4c9b-89bf-30c719d6ca89","name":"Hungerhill School","code":"298","type":"lead_school","isAccreditedBody":false,"urn":"137899","ukprn":"10036542","address":{"addressLine1":"Hungerhill Lane","addressLine2":"Edenthorpe","town":"Doncaster","county":"South Yorkshire","postcode":"DN3 2JY"},"contact":{"website":"http://www.hungerhillschool.com/","email":"kinghorn.k@hungerhillschool.com","telephone":"1302885811","fullName":"Rebecca Ward"},"location":{"latitude":53.5514808,"longitude":-1.0741717},"trainWithUs":"Hungerhill’s last OFSTED inspection was in October 2012, where we were acknowledged as being outstanding in all areas. At Hungerhill, we firmly believe that the School Direct route produces the strongest trainee teachers who are best prepared for their NQT year and career as a teacher. \n\nOur mission is to recruit high quality candidates into teaching and then retain them to meet the needs of our locality. Doncaster offers excellent opportunities for teacher training and for a continuing and rewarding career path in teaching. Our diverse alliance of schools is extremely experienced and has been involved in delivering high quality teacher-training for many years. \n\nAt Hungerhill we offer choice in terms of the type of school and location across the Doncaster area to train and work in: at the same time we remain small enough to know every trainee as an individual and meet your personal training needs. You will be at the heart of school life, learning from outstanding professionals. Our partnership schools see our ITT programme as an excellent way to find and develop their own future teachers and they are all fully committed to their trainees: they will invest in you as an integral and important member of their staff team.\n\nOur courses offer the opportunity to study for a PGCE during your ITT year through the University of Hull, or you can choose to take the QTS only route with us. For more information on each route and the benefits, please visit the Hungerhill website: https://www.hungerhillschool.com/page/?title=ITT+at+Hungerhill&pid=109","trainWithDisability":"We endeavor to meet the unique needs of every trainee, specifically by taking reasonable steps to ensure that disabled trainees and applicants are not put at a substantial disadvantage by comparison with trainees and applicants who are not disabled.\n\nWe encourage all our applicants to declare their disability on their application form and to discuss their requirements with us at interview. Whilst disabled access to our schools is good, in order to place trainees at the most suitable school to meet their needs, we would benefit greatly from knowing what these needs are.\n \nIn addition to one to one support from your mentors and subject leaders, we also provide all our trainees access to free membership of the 'Westfield Healthy Extras' emotional wellness support package to support you during your ITT year.\n\nThe Sheffield SCITT has a ‘Reasonable Adjustments Policy and Procedure’ which underpins our approach and is available on request by emailing admin@sheffieldscitt.org.uk","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"43920484-d42a-42ca-8071-74b1ff5e81cc","code":"S97","name":"The Sheffield SCITT","description":"We deliver School Direct Initial Teacher Training (ITT) in partnership with The Sheffield SCITT, which is owned and run by Notre Dame High School, Sheffield. Notre Dame is not only an outstanding school but is also a National Teaching School with a strong background in teacher training. \\r\\n\\r\\nHungerhill chose to be a lead school for the Sheffield SCITT because of their excellent teacher training programme and their high success rate in producing outstanding trainees who are well-equipped for the high demands of teaching."}],"createdAt":"2021-07-06T17:57:12.414Z","updatedAt":"2021-10-04T02:40:33.753Z"}
