{"id":"867142f1-4608-4b8c-9ef5-9d6710ec92a2","name":"Synergy","code":"2D5","type":"lead_school","isAccreditedBody":false,"urn":"146237","ukprn":"10080924","address":{"addressLine1":"Church Street","addressLine2":"Litcham","town":"King’s Lynn","county":"Norfolk","postcode":"PE32 2NS"},"contact":{"website":"http://www.litchamschool.net/","email":"atkins_k@litchamschool.net","telephone":"1328701265","fullName":"Kate Atkins"},"location":{"latitude":52.7230863,"longitude":0.794002},"trainWithUs":"Synergy Multi-Academy Trust comprises fifteen Norfolk schools serving children between the ages of 2 and 18. Our schools work collaboratively together to raise standards and provide education of the highest possible standard, offering the best of opportunities for pupils.\nThe Trust was initially established in 2015. We believe that all of our schools have strengths and areas to develop, and that all can improve through sharing expertise and wisdom. The Trust understands that there will be excellent practice in each school, and that every school will be able to contribute to the development of the Trust as a whole.\nWe focus on the development of leadership, teaching and people. We are supported through a range of strong partnerships to help us deliver this including the Norwich Research School, which aims to develop the use of effective research to further improve teaching and learning.\nAll schools in the Trust work together to:\n•\tImprove the quality of teaching and learning.\n•\tCollectively recognise and nurture the talents and aspirations of their staff.\n•\tAllow school leaders and teachers to share effective practice and work together rather than just talk together.\n•\tBe part of a formal support network with collective responsibility.\n•\tImprove efficiency through collaboration.\nWe have a long tradition of working with the UEA and other ITT providers to offer excellent training placements. We believe that it is important to share our ethos and values with the next generation of teachers and take pride in supporting the teaching profession.","trainWithDisability":"In Synergy MAT we operate an equal opportunities policy. Individual needs are catered for and can be discussed at interview or on task day.\nUEA operates an equal opportunities policy and welcomes applications from people with disabilities. All PGCE trainee teachers must meet the Secretary of State's requirements for physical and mental fitness to teach. All candidates offered a place are required to complete a health declaration form. If this reveals a need, UEA will consider reasonable adjustments, which may include particular school placements, and other support and monitoring during the course.\n[Find out more about the information and advice available through UEA's Wellbeing Service](https://www.uea.ac.uk/uea-life/student-support/wellbeing)","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"accreditedBodies":[{"id":"b8bcaeed-f311-4867-a1e3-c0fde20809d6","code":"E14","name":"University of East Anglia","description":"UEA’s School of Education and Lifelong Learning is one of the UK’s premier centres for teaching and research in professional education and training. The School’s research has made a difference in schools across the country, influencing approaches to managing classroom behaviour, understanding students’ motivation, and creating effective communities for learning.\\r\\n\\r\\nAll of our PGCE tutors have experience of school teaching and leadership, and all are specialists in particular areas of the curriculum. UEA’s expertise, together with our partner schools, means you'll be well-supported throughout your PGCE."}],"createdAt":"2021-07-06T17:50:30.459Z","updatedAt":"2021-10-15T16:18:08.976Z"}
