{"id":"87016e8d-d70d-4c8d-b412-522cd7002af7","name":"Bennett Memorial Diocesan School","code":"1KU","type":"lead_school","isAccreditedBody":false,"urn":"136603","ukprn":"10033233","address":{"addressLine1":"Bennett Memorial Diocesan School","addressLine2":"Culverden Down","town":"Tunbridge Wells","county":"Kent","postcode":"TN4 9SH"},"contact":{"website":"https://www.teachkentandsussex.org.uk/","email":"contact@teachkentandsussex.org.uk","telephone":"1892521595","fullName":"Richard Tyson"},"location":{"latitude":51.1429466,"longitude":0.2483522},"trainWithUs":"Bennett Memorial Diocesan School is a Church of England School, academically highly successful which sets great store in the development of character and values. Bennett has become one of the highest achieving state schools in the country attracting students from across Sussex and West Kent. The success of our students is due to the high quality teaching that they receive. By training with us you will learn alongside those expert teachers.\nThe school has a long track record of training teachers successfully. Bennett is the designated Teaching School Hub for Kent and is the founding school of Teach Kent & Sussex school centre for initial teacher training (SCITT). We therefore can draw upon considerable teaching and leadership expertise to help you grow and flourish as a new teacher. As a Teaching School Bennett leads a partnership of secondary schools in Kent & Sussex who work with us to train teachers. Therefore, in applying to us you may also train in one of those schools as well as or instead of Bennett. They include Hillview, Hugh Christie, The Malling School, Beacon Academy (Crowborough), St Gregory's Catholic School, Skinners' Kent Academy (both Tunbridge Wells), Trinity School (Sevenoaks), Uplands Community College, Heathfield Community College and Uckfield College.","trainWithDisability":"We wish to ensure that every candidate can show their potential to become a great teacher. We therefore work closely with candidates who declare a disability or additional need to ensure that reasonable adjustments are made at interview in order to ensure that all candidates have an equal chance to show their potential to teach. If offered a place to train to teach we agree with you an independent support plan which is reviewed on a termly or more frequent basis if necessary. This helps to ensure that our provision is the best it can be. Such reviews have shown to be helpful and effective in the past and are an integral part of our provision.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"2b8fac2f-ed98-4278-a7fc-fa3f418dfbef","code":"2EZ","name":"Teach Kent & Sussex","description":"Teach Kent \\u0026 Sussex School Centre for Initial Teacher Training (SCITT) was recognised by Ofsted as an ‘outstanding’ provider of initial teacher training in 2019. \\r\\n\\r\\nAs part of the Kent Teaching School hub Teach Kent \\u0026 Sussex provide Bennett and its partner schools with their evidence led, research rich professional development curriculum. This ensures that trainees are grounded with strong professional knowledge about the characteristics of effective teaching. \\r\\n\\r\\nIn addition, Teach Kent \\u0026 Sussex ensure that all mentors are trained, and receive ongoing training, in the principles of instructional coaching and effective mentoring."}],"createdAt":"2021-07-06T17:51:50.424Z","updatedAt":"2021-10-05T04:55:15.126Z"}
