{"id":"8795230d-a2ff-43ec-8a16-384a390e27f3","name":"Northern Lights SCITT","code":"255","type":"scitt","isAccreditedBody":true,"ukprn":"10057355","address":{"addressLine1":"Skipton Girls’ High School","addressLine2":"Gargrave Road","town":"Skipton","county":"North Yorkshire","postcode":"BD23 1QL"},"contact":{"website":"http://www.northernlightsscitt.com/","email":"smithh@northernlightstsa.org","telephone":"01756 707628","fullName":"Jill Smith"},"location":{"latitude":53.963357,"longitude":-2.0272043},"trainWithUs":"Northern Lights SCITT shapes committed, creative and passionate individuals into responsive, inspirational and highly skilled teachers. Together, we transform the lives of young people. We are very proud of our course. With us, you will benefit from an engaging research-based professional learning programme that is responsive to each Trainee’s professional needs. Your professional learning programme is embedded into every placement to ensure your learning is contextualised and meaningful.\nAt Northern Lights we have a strong team of outstanding practitioners committed to your professional development and personal wellbeing. Your Mentors are highly skilled, experienced teachers who will support and challenge you to be the best teacher you can be. Our team of Primary and Secondary Leads are experts in their areas and will support you to develop your subject knowledge and expertise. After you qualify with us, we want you to start your first teaching post prepared and confident. With the range of skills and experiences you gain from your training with us, we know you will be an asset to your future employer as you build your career. Many of our trainees secure their first teaching posts in our partner schools, who acknowledge the breadth and depth of training we provide. As an integral part of the course, trainees will study Masters’ level modules which will lead to a PGCE and can be used as 60 credits towards an MA from Leeds Trinity University.","trainWithDisability":"Northern Lights SCITT is committed to equality of opportunity and welcomes applications from all potential trainees regardless of age, gender, race, ethnic origin, marital or parental status, disability, political or religious belief or socio-economic class.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:56:15.461Z","updatedAt":"2021-10-05T14:24:18.971Z"}
