{"id":"87db698d-18c2-400a-9094-ec89ca5c1f50","name":"Halterworth Training School Partnership","code":"1A8","type":"lead_school","isAccreditedBody":false,"urn":"148216","ukprn":"10086663","address":{"addressLine1":"Halterworth Lane","town":"Romsey","county":"Hampshire","postcode":"SO51 9AD"},"contact":{"website":"www.halterworthtsp.co.uk","email":"training@halterworth.uwinat.co.uk","telephone":"01794 512028","fullName":"Jo Cottrell - Executive Headteacher"},"location":{"latitude":50.9880608,"longitude":-1.4705612},"trainWithUs":"Halterworth Training School Partnership [Halterworth Training School Partnership](https://www.halterworthtsp.co.uk/) is a well-established and popular provider of School Direct Initial Teacher Training in the South including the Isle of Wight. We offer school centred Primary and Secondary routes into teaching in conjunction with The University of Winchester. Our bespoke training recognises that people come from many different backgrounds and is tailored to suit individual needs. Halterworth TSP has an excellent track record of developing and supporting trainee teachers who are well-prepared for the profession and have an exceptionally high employment rate. Within our Partnership of over 30 schools, we can offer you the chance to work alongside outstanding, innovative and experienced teachers who are passionate about raising standards in teaching and transforming lives. From the outset you are fully immersed in the life of the school and are part of the team.","trainWithDisability":"Your wellbeing is a top priority and we will do all we can to give you the chance to flourish and maximise your potential. In partnership with the University of Winchester there is a dedicated student support team to help with any questions or challenges you might experience during your studies. We work with you to support your wellbeing and mental health, provide confidential advice and offer workshops to boost your academic skills. If you have a disability or learning difference, we encourage you to get in touch before you apply so we can discuss tailored support for your individual needs.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"3700fb02-7007-40c8-9127-b070e146d6cb","code":"W76","name":"University of Winchester","description":"The University of Winchester is recognised by Ofsted as an ‘Outstanding’ provider of teacher education at both Primary and Secondary level and has a long history of training teachers. Training with us means that you will have full access to the provision of Winchester University, including Library and Student Services."}],"createdAt":"2021-07-06T17:52:27.767Z","updatedAt":"2021-09-16T20:11:43.306Z"}
