{"id":"8832fbf6-34bb-42bd-8b92-3e32e40dec44","name":"Somerset SCITT - Oak Partnership","code":"5S2","type":"scitt","isAccreditedBody":false,"ukprn":"10082117","address":{"addressLine1":"C/O West Monkton CE Primary School","addressLine2":"Bridgwater Road, Bathpool","town":"Taunton","county":"Somerset","postcode":"TA2 7QP"},"contact":{"website":"https://www.sciltraining.co.uk/scitt/","email":"SCIL@somerset.gov.uk","telephone":"3001231967","fullName":"Julie"},"location":{"latitude":51.0354694,"longitude":-3.05617},"trainWithUs":"The Oak Partnership Multi Academy Trust was formed in 2019. Its founder member schools are three primary schools (Blackbrook Community Primary School, Ruishton CofE Primary School and West Monkton CofE Primary School) and one all-through Special School (Selworthy Special School). All four schools were inspected by Ofsted in 2018 and rated ‘Good’. A commitment to development attracts the best staff to work at The Oak Partnership. Our vision is to nurture and develop resilient and passionate individuals who are skilled in critical thinking. We believe this will create effective teachers who are ready to continue their pursuit of excellence. All trainees on the Oak Partnership School Direct and SCITT Programmes have the opportunity to work towards a PGCE, in partnership with Somerset SCITT, judged Outstanding by OFSTED in 2017, and accredited by the University of Worcester. Trainees will learn on the job in a supportive environment with a mentor throughout their placements. Experience in school progresses from observing and working alongside the class-teacher, to taking full responsibility, initially for individuals and groups, and later, for a whole class. Throughout this experience, trainees will acquire the skills, knowledge and understanding of the range of elements which make an outstanding teacher, as specified in the Teachers’ Standards; from developing good relationships with children that promote learning, with other colleagues to working within a framework and national/school policies to deliver the Curriculum. If you are interested in becoming part our thriving and successful teaching community, we offer places in conjunction with Somerset SCITT.","trainWithDisability":"We comply with the DDE requirements.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:47:29.933Z","updatedAt":"2021-10-13T17:13:39.073Z"}
