{"id":"88c3031f-2daf-486e-9131-f82d080ad9a7","name":"University of Chichester Academy Trust School Direct Partnership","code":"2DH","type":"lead_school","isAccreditedBody":false,"urn":"140182","ukprn":"10042780","address":{"addressLine1":"The University of Chichester Academy Trust","addressLine2":"Upper Bognor Road","town":"Bognor Regis","county":"West Sussex","postcode":"PO21 1HR"},"contact":{"website":"http://www.unicat.org.uk/school-direct","email":"unicatschooldirect@chi.ac.uk","telephone":"01243 816 444","fullName":"Jane Evans"},"location":{"latitude":50.8450307,"longitude":-0.7728918},"trainWithUs":"The University of Chichester Academy Trust School Direct Partnership provides an exciting opportunity for you to develop as a teacher within a Trust whose mission is ‘to create a vibrant, inclusive and aspirational family of academies, transforming life chances for pupils through excellent teaching and learning’. The Trust has schools in West Sussex, Portsmouth and Hampshire of different sizes and types and you will get the opportunity to visit many of them during your programme of training.\nOur School Direct training programme is delivered by both high quality teachers in our schools and experienced lecturers in the University who all teach and undertake educational research. Thus it provides a strong blend of practical application supported by academic rigour.\nThe academic award of Postgraduate Certificate in Education (PGCE Masters level) recognises and celebrates your development as a reflective practitioner at the forefront of your discipline, and provides you with pathways to both employment and further study.\nAcademies within the Trust Partnership have a longstanding commitment to supporting trainees. School-based mentors, who have all been trained by the University, will support you to achieve your potential.\nTrainees from previous School Direct programmes are now employed as teachers in Trust Academies.","trainWithDisability":"The Disability and Dyslexia service at The University of Chichester offers advice and support throughout a trainee’s programme. Further information is available on the university’s website.\n[DDS website](http://www.chi.ac.uk/study-us/student-services/disability-dyslexia-and-medical-condition)\nThis team would discuss with you any adjustments you may need whilst in school or attending university based sessions and agree any action required. This information would form part of the decision making with regard to the selection of placement schools.\nThe Trust schools are all inclusive environments and encourage participation from all students who they believe could benefit from their programme and can be successful as practicing teachers. Accessibility and specialist facilities in schools vary and we would seek to find an appropriate placement to meet a student’s individual needs.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:48:32.749Z","updatedAt":"2021-09-21T16:41:06.910Z"}
