{"id":"88e5549a-3fc5-4d67-8eec-eb68ea17a2ed","name":"Plymouth Teachers and Schools Alliance","code":"1T7","type":"lead_school","isAccreditedBody":false,"urn":"70131","ukprn":"10037449","address":{"addressLine1":"LAT Central Office","addressLine2":"Salisbury Road Primary School","town":"St Judes","county":"Plymouth","postcode":"PL4 8QZ"},"contact":{"website":"www.ptsa.uk","email":"info@ptsa.uk","telephone":"07766 942685","fullName":"PTSA"},"location":{"latitude":50.3728904,"longitude":-4.1275395},"trainWithUs":"Plymouth Teachers and School Alliance (PTSA) is an inclusive teaching school serving the schools of Plymouth and the region. The PTSA benefits from a mature ‘blended’ model of delivery alongside Plymouth Local Authority and Plymouth Learning Partnership Community Interest Company (PLP CiC). The two lead schools are High View Primary and Prince Rock Primary (Learning Academies Trust).\nIn addition to our inclusive values, we also seek to promote collaboration and evidence-informed practice. These values underpin our work. Evidence of this can be seen in the 50 schools that contribute to our teaching school alliance, our unique approach to CPD, and the wide-variety of collaborative partnerships and programmes that we offer.\nWe benefit from working alongside our partners in the Plymouth Local Authority, Plymouth Marjon University and Plymouth University. We also collaborate with our regional teaching school neighbours and access expertise at a national level.\nWe believe in a practitioner-led and school-led system and help facilitate this at all levels. We also strive to have training and support available to all educational professionals regardless of where they are in their career, from trainee teachers to CEOs.","trainWithDisability":"Training with disabilities and other needs can be supported.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:46:29.342Z","updatedAt":"2021-07-28T17:32:47.184Z"}
