{"id":"894dbbfd-63d0-46e7-870d-545d4cad5cd9","name":"St Anthony’s Girls’ Catholic Academy","code":"1BM","type":"lead_school","isAccreditedBody":false,"urn":"138054","ukprn":"10059634","address":{"addressLine1":"St. Anthony’s Girls’ Catholic Academy","addressLine2":"Thornhill Terrace","town":"Sunderland","county":"Tyne and Wear","postcode":"SR3 7JN"},"contact":{"website":"https://www.st-anthonys-academy.com","email":"enquiries@st-anthonys-academy.com","telephone":"0191 565 8904","fullName":"Samantha Ward"},"location":{"latitude":54.9003604,"longitude":-1.3913198},"trainWithUs":"St Anthony's is a Secondary Catholic Academy for girls aged 11-18, situated in the centre of Sunderland. It has a joint, mixed sixth form with St. Aidan's Catholic Academy. Our Academy was judged to be ‘Outstanding in all categories’ by OFSTED in 2013 and we offer many opportunities for teacher training and development. We have been delivering school-led teacher training for 19 years and have developed an excellent reputation for success. We provide high quality training for aspiring teachers in 14 subjects at secondary level (Art & Design, Biology, Chemistry, Design and Technology, English, Food, Geography, History, Mathematics, Modern Languages, Music, Physical Education, Physics and Religious Education) in a supportive and inspiring environment. We offer the latest educational facilities in our new school buildings and bright, well equipped classrooms. We are also part of the Bishop Chadwick Multi Academy Trust and work with our partner primary schools to offer high quality initial teacher training courses at primary level.\nSuccessful completion leads to Qualified Teacher Status (QTS), a Post Graduate Certificate in Education (PGCE) and 60 credits towards Masters accreditation.","trainWithDisability":"All Schools within the Carmel Teacher Training Partnership are fully accessible. Provision for additional support where needed is provided on site.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"5bce9a0d-f372-4667-b3ec-3d58d42a1345","code":"C23","name":"Carmel Teacher Training Partnership (CTTP)","description":"Carmel Teacher Training Partnership (CTTP) is an outstanding Initial Teacher Training Provider based at Carmel College Darlington. Our training programmes are Primary 5-11 years and Secondary 11-16. We pride ourselves on the bespoke level of training for all our trainees, focused on our high quality training provision from very experienced practitioners. The Partnership is made up of Catholic and non-Catholic, primary and secondary schools, widely spread across the North East of England. \\r\\nCarmel Teacher Training Partnership is a well-established Provider, offering a friendly, nurturing and supportive environment for all trainees."}],"createdAt":"2021-07-06T17:52:08.203Z","updatedAt":"2021-07-13T17:19:48.814Z"}
