{"id":"89831af6-535f-471b-aa97-098bd1a93291","name":"Suffolk and Norfolk Primary SCITT","code":"S13","type":"scitt","isAccreditedBody":true,"ukprn":"10006399","address":{"addressLine1":"University of Suffolk","addressLine2":"Thomas Slade Court, 120 Star Lane","town":"Ipswich","county":"Suffolk","postcode":"IP4 1JN"},"contact":{"website":"https://www.suffolkandnorfolkscitt.co.uk/primary-teaching/Primary-SCITT-Tuition-PGCE","email":"enquiries@suffolkandnorfolkscitt.co.uk","telephone":"01473 265077","fullName":"Lucinda James"},"location":{"latitude":52.0522615,"longitude":1.163448},"trainWithUs":"The Suffolk & Norfolk Primary SCITT programme is a personalised, relational and ethical training provider. Primary SCITT has very high attainment and employment outcomes for trainees. On average, 95% of trainees are employed in local schools by the end of their training.\nTrainees are supported by school mentors and SCITT Tutors who have a range of experience as classroom practitioners and often headteachers or members of senior leadership, so have a wealth of experience to share with trainees. Primary SCITT is a highly personalised course which offers a wide range of opportunities to trainees.","trainWithDisability":"Suffolk and Norfolk SCITT supports all trainees based on their individual needs. Recently this has included those with dyslexia, physical, hearing and visual impairments and mental health conditions. Plans are developed with trainees to ensure that they can fully access in centre training, operate effectively on school placement and complete written assignments.\nSuffolk & Norfolk Primary SCITT training venues in Ipswich and Norwich have full disabled access as do partnership schools. However, applicants who would benefit from disabled access should let us know on their application so that they can be considered for placements at the most appropriate schools.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:46:29.050Z","updatedAt":"2021-09-23T16:52:49.463Z"}
