{"id":"8a4d7094-c8dc-413e-93f2-2a6c2eee97df","name":"Uttoxeter Learning Trust Teaching School","code":"2J9","type":"lead_school","isAccreditedBody":false,"address":{"addressLine1":"Thomas Alleyne’s High School","addressLine2":"Dove Bank","town":"Uttoxeter","county":"Staffordshire","postcode":"ST14 8DU"},"contact":{"website":"http://www.ultteachingschool.org.uk","email":"goodwin@tahs.org.uk","telephone":"01889 561820","fullName":"Karen Goodwin"},"location":{"latitude":52.9010095,"longitude":-1.8624218},"trainWithUs":"Welcome to the Uttoxeter Learning Trust Teaching School. Driven by our ethos of Inspire, Lead, Transform, Grow we aim to recruit and train excellent teachers to meet local need and beyond. We offer teacher training at both primary and secondary phase, across our 3 tier system of first, middle and high schools. We work with partner schools in Uttoxeter and across Staffordshire. Our teaching training is rooted in excellent classroom practice. With a strong emphasis on developing teaching pedagogy, supporting all learners to achieve and developing outstanding subject knowledge at both primary and secondary phase. As a Lead School we work with the following providers. * Primary Teacher Training. Accredited by Keele and North Staffordshire Teacher Education.\n* Secondary PE. Accredited by Birmingham City University.\n* Secondary English, Maths, MFL, Physics, Biology, Chemistry, History and Geography. Accredited by The John Taylor SCITT. By choosing to train to teach with us, you will receive personalised and supportive programme. We are based at Thomas Alleyne's High School, where our team of teaching school staff have significant experience and expertise in teacher training. You will be working with leaders in teacher education who are driven to ensure that every child succeeds and who are outstanding teachers.\nThis is a truly exciting time for us at the ULTTS, if you are passionate about the education of every child and want to make a difference, come and join us on our journey. (www.ultteachingschool.org.uk)\nWe look forward to hearing from you.","trainWithDisability":"The Uttoxeter Learning Trust Teaching School welcomes applications from people with disabilities. We have have full access and facilities for people with disabilities.","accreditedBodies":[{"id":"62d5803b-89ca-4e21-bb6f-5c74944c56ad","code":"B25","name":"Birmingham City University","description":"At Birmingham City University’s School of Education and Social Work we never give up in our aspirations for tomorrow’s teachers. For us it’s about life chances. Our student teachers will be ‘the village’ it takes ‘to raise a child’. Training more teachers than anyone else in the region (HESA, 2016), we educate Birmingham, teaching generations of professionals to teach generations of young people.\\r\\n \\r\\nWe deal with the landscape around us, adapting to society today, not the way it was or the way we might wish it to be. We know perspiration and perseverance."},{"id":"34f0b949-839c-4292-88c3-5289076bd205","code":"24J","name":"Keele and North Staffordshire Teacher Education","description":"KNSTE is an outstanding provider (2017) who works in close partnership with their schools and school direct clusters. The programme is designed and managed by local headteachers and senior school leaders. They are relentless in pursing excellence in teaching so that the pupils in our school communities benefit from passionate and effective teaching. Evidence is used to inform and challenge school-based practice for the benefit of all. In this way your school and SCITT sessions are intertwined. We have been thrilled to employ previous trainees and are delighted that KNSTE has sustained its high recruitment, retention and employment rates."},{"id":"174b60fe-3dac-47c0-a65a-5691b6dda11c","code":"24V","name":"The John Taylor SCITT","description":"John Taylor High School SCITT - School Centred Initial Teacher Training is the accredited provider for the following secondary courses,\\r\\n* English\\r\\n* Maths\\r\\n* Physics\\r\\n* Biology\\r\\n* Chemistry\\r\\n* MFL (French)\\r\\n* History\\r\\n* Geography\\r\\n\\r\\n Based in Barton under Needwood, just 13 miles from Uttoxeter, we collaborate with the SCITT to deliver some of the secondary training. Rated Good by Ofsted, the SCITT has an excellent employment record and offers excellent training on all aspects of secondary teaching."}],"createdAt":"2021-07-06T17:46:27.817Z","updatedAt":"2021-07-06T17:46:27.817Z"}