{"id":"8a5b36ac-745a-4b67-aa4e-8a4bed0ad0df","name":"Woodloes Teaching Partnership","code":"2HS","type":"lead_school","isAccreditedBody":false,"urn":"147855","ukprn":"10048958","address":{"addressLine1":"Woodloes Primary School, Deansway","addressLine2":"Woodloes Park","town":"Warwick","county":"Warwickshire","postcode":"CV34 5DF"},"contact":{"website":"http://www.woodloes.com/website/training_teachers_in_2019/366571","email":"catts@thepolesworthschool.com","telephone":"01827 702205","fullName":"Andrew Mitchell"},"location":{"latitude":52.2941347,"longitude":-1.5885631},"trainWithUs":"Each of the schools in the Woodloes Teaching Partnership has its own distinctive character, reflecting its local community and history, but all share the same commitment to the partnership's ethos.\n\nOutstanding Teaching\n\nWe believe strongly in the personal growth of all staff within the school and take professional development seriously.\n\nDuring your initial year of training with us you will receive rigorous and regular professional development so that you can progress to being an outstanding teacher.\n\nOur Young People\n\nWe believe all young people have the potential to achieve great things. Intelligence can be developed regardless of emotional and social background, given appropriate teaching and bespoke, individualised support. They should be equipped with a crucial sense of possibility based on a well-developed self-awareness and ambition, not only for themselves but for the communities in which they live and work.\n\nOur Values extend to how we challenge, support and work with each other. All staff (non-teaching and teaching) play a crucial role in the education of young people. We all understand how our work has a direct influence on the life chances of the young people in our care. In the same way that we all have a duty of care to them, we have a duty of care to each other and have regard for each other's professional and personal well-being.","trainWithDisability":"Working closely with our partner schools and with our University partners, reasonable adjustments can be put in place for students with a disability or specific learning differences, to ensure they can successfully complete their course and get the most out of their time with us.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:51:30.230Z","updatedAt":"2021-07-09T21:00:10.616Z"}
