{"id":"8a5cc782-40d0-417a-ae85-ff9241a5c64d","name":"Eatock School Direct","code":"2GV","type":"lead_school","isAccreditedBody":false,"urn":"105202","ukprn":"10070107","address":{"addressLine1":"St George’s Avenue","addressLine2":"Westhoughton","town":"Bolton","county":"Lancashire","postcode":"BL5 2ER"},"contact":{"website":"http://www.eatock.bolton.sch.uk","email":"greenr@eatock.bolton.sch.uk","telephone":"1942634672","fullName":"Rebecca Green"},"location":{"latitude":53.539546,"longitude":-2.526981},"trainWithUs":"* Eatock is currently ranked in the top 2% of schools nationally for children's progress from entering school to leaving in Year 6. * We are also rated as 'Outstanding' in every area of our most recent Ofsted inspection.\n* Eatock holds the Gold award for 'Learning outside the Classroom' and this is an area we are particularly keen for our School Direct students to experience. * We are a one form entry primary school with a nursery. * For the past two years 100% of our School Direct students have gained employment on the completion of their studies. * Eatock has a very experienced staff team and a designated School Direct Lead to work with students throughout the twelves months of the School Direct course. * Within the Eatock Cluster there are schools offering the opportunity to teach in a wide variety of settings in the Bolton and Wigan Boroughs. * Eatock is a Centre of Excellence for the Inclusion Quality Mark. * Eatock has four Specialists in Education employed at school who work with students during Enhancement days and on their placements. * Visit Eatock's website (http://www.eatock.bolton.sch.uk/)","trainWithDisability":"* Eatock is a all-inclusive school and welcomes applications from students with disabilities. *Eatock has been awarded the 'Dyslexia Award'. * Eatock is a purpose built all-inclusive school with wheelchair access all around the school premises. * Eatock is a recognised Centre of Excellence - this award recognises our commitment to ensuring all pupils achieve their full potential. * At Eatock we deliver a creative curriculum and the outdoor learning that takes place promotes good mental health and well being. We have a high focus on the mental health and well being of our staff and students.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:48:00.786Z","updatedAt":"2021-07-22T20:40:06.435Z"}
