{"id":"8aad4802-e56e-4cdf-b931-bf55efb1767b","name":"Arden Alliance","code":"2BU","type":"lead_school","isAccreditedBody":false,"urn":"136333","ukprn":"10031562","address":{"addressLine1":"Arden Academy","addressLine2":"Station Road","town":"Solihull","county":"West Midlands","postcode":"B93 0PT"},"contact":{"website":"https://sites.google.com/arden.solihull.sch.uk/ats/home","email":"traintoteach@arden.solihull.sch.uk","telephone":"1564732610","fullName":"Christine Robinson"},"location":{"latitude":52.3846284,"longitude":-1.7389819},"trainWithUs":"Training To Teach with Arden Alliance…\n•\tArden Alliance is a made up of a group of Primary and Secondary schools predominately based in and around Solihull •\tWe work with the University of Warwick, a highly prestigious Russell Group University, who have been graded ‘Outstanding’ in all categories of their teacher training provision Why Train With Us?\n•\tYou will be trained by outstanding practitioners •\tWe provide a highly personalised and targeted approach to draw upon your existing strengths and facilitate a plan to improve areas for development\n•\tThere will be a focus on subject pedagogy which results in high-calibre trainees who are very well prepared to meet the learning needs of their students\n•\tYou will gain Qualified Teacher Status (QTS), a requirement to teach in the state school system as an Early Career Teacher (ECT), along with the academic qualification of a PGCE\n•\tOur Alliance Days are designed to complement the training provided by the University of Warwick and are bespoke to the needs of all trainees year on year\nWhat sets the Arden Alliance apart is our commitment to rigorous and supportive training that develops you as an individual to be a well-rounded member of the teaching profession and enhances your future employability. Our delivery of subject specific pedagogy by outstanding teachers in their field is unique and research shows that this is the most effective form of professional development.","trainWithDisability":"Arden Alliance and The University of Warwick welcomes candidates with disabilities and under the Disability Discrimination Act. Those candidates who disclose their disability have the right to have reasonable adjustments made to enable them to train to teach.","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"ef09ce50-ccfc-4346-a0ce-43e840153dab","code":"W20","name":"University of Warwick","description":"(https://warwick.ac.uk/fac/soc/cte/)"}],"createdAt":"2021-07-06T17:53:10.160Z","updatedAt":"2021-09-09T17:49:39.481Z"}
