{"id":"8b223ef9-e4d9-4045-b442-47888f1ef66c","name":"Cornerstone Academy Trust","code":"1M2","type":"lead_school","isAccreditedBody":false,"urn":"15879","ukprn":"10058322","address":{"addressLine1":"School Lane","addressLine2":"Broadclyst","town":"Exeter","county":"Devon","postcode":"EX5 3JG"},"contact":{"website":"https://www.tcts.education/en/teacher-training","email":"alexandra.pulfer@tcat.education","telephone":"01392 304168","fullName":"Nina Rothery"},"location":{"latitude":50.7676905,"longitude":-3.442165},"trainWithUs":"School Direct at Cornerstone allows the trainee the security of knowing that they will be spending the lion's share of their course working in effective schools alongside highly-trained and supportive teachers. The amount of time spent in class allows you to gain further experience of residential trips, training days, continuity through the academic year and a feeling of total inclusion as an important member of the teaching staff. The Masters modules are taught through distance learning, requiring the trainee to be very well-organised and self-motivated. School Direct trainees are given one day of each week to complete their university tasks.","trainWithDisability":"The University of Exeter provides comprehensive student services that include AccessAbility and Wellbeing teams, Student Learning Skills Service, Student Advice Unit, Counselling Service, Students’ Union Advisors, Student Health Centre, Family Centre and the Chaplaincy. For further details on the wealth of support available to you please go to Student Support Services (http://www.exeter.ac.uk/newstudents/supportandservices/yourhealthandwelfare/#a4). PGCE trainees can access the support of a Wellbeing Services Welfare Caseworker to discuss concerns, talk through options for support or understand more about how the University Wellbeing Services may be able to help. Alongside the support described above, every PGCE trainee is assessed by an Occupational Health provider as part of the admissions process to ensure they are fit to teach in a school setting. The Occupational Health provider can recommend ‘Reasonable Adjustments’, which will be put into place by the provider, providing they are logistically possible and reasonable.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:54:19.376Z","updatedAt":"2021-10-12T22:00:06.099Z"}
