{"id":"8c1b173d-7a58-4a5d-af75-98ad57a06ddb","name":"AIM Alliance Schools","code":"2FR","type":"lead_school","isAccreditedBody":false,"urn":"134798","ukprn":"10016231","address":{"addressLine1":"Spur Road","town":"Edgware","county":"London","postcode":"HA8 8DE"},"contact":{"website":"www.aimallianceschools.org","email":"a.phillips@londonacademy.org.uk","telephone":"0208 238 1100 x1252","fullName":"Amanda Phillips"},"location":{"latitude":51.6227881,"longitude":-0.2902603},"trainWithUs":"Aim Alliance Schools is a collaborative Alliance of schools made up of both Primary and Secondary Schools. London Academy is the lead school for School Direct within the Alliance. We train and develop teachers in north London, working in partnership with Middlesex University, Hertfordshire University and e-Qualitas. We provide experienced mentors within the classroom and Lead Phase mentors provide additional support throughout the year. We are small (a cohort of 30 this year) but concentrate on quality with 100% pass rate of our cohort last year. Our schools work closely together in partnership with our training providers to ensure you receive a quality, tailored programme of learning and support. You can find out lots of information from our Aim Alliance Schools website (https://www.aimallianceschools.org).","trainWithDisability":"Aim Alliance Schools is always willing to support applications from candidates with disabilities. The Alliance will try to accommodate all trainees with disabilities and other needs. Individual needs will be assessed on application and our lead phase mentors will discuss with individuals how their needs can be supported.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"9188f17a-79c4-43a9-b459-4952815b739a","code":"M80","name":"Middlesex University","description":"In Partnership with our Alliance School Direct trainees achieve consistently high outcomes and the majority graduate as excellent practitioners. This is a result of the strong partnerships that we have with Middlesex University and our shared commitment to providing high quality training for all primary and secondary ITT courses.\\r\\n\\r\\nThere are many reasons why you could choose Middlesex but the main one is that they genuinely work in partnership with our alliance. This means that together, we train the teachers of the future that become qualified staff in local schools."},{"id":"feecdec5-259c-45e3-b1cf-4e391936ee90","code":"H36","name":"University of Hertfordshire","description":"The University of Hertfordshire is an accredited Initial Teacher Training provider working in partnership with schools across:\\r\\n\\r\\n* Hertfordshire\\r\\n* Bedfordshire\\r\\n* Buckinghamshire\\r\\n* Essex\\r\\n* the North London Boroughs\\r\\n\\r\\nWe offer School Direct routes for those training in early years, primary or secondary settings, including Special Schools."},{"id":"252d7e03-741e-4453-b6a8-3d361e6c9d1b","code":"E69","name":"e-Qualitas","description":"e-Qualitas has been an ITT provider for over 15 years. \\r\\n\\r\\nThey support School Direct (salaried) and (tuition fee) places in primary and all secondary subjects. Most of the schools they work with are in London and the Home Counties, but we can cover a much wider area including East Anglia, the West Country and into the Midlands. \\r\\n\\r\\nThey also support teacher apprenticeship training through a school-based programme, supported by distance learning resources for independent study, a half-termly one-day visit by one of our specialist tutors, and 10-15 training days in central London (about 10 compulsory plus additional optional days)."}],"createdAt":"2021-07-06T17:49:12.931Z","updatedAt":"2022-01-20T18:37:19.726Z"}
