{"id":"8c5a22f0-6307-44c9-91d6-7422b76db7e8","name":"East One Partnership","code":"E1P","type":"lead_school","isAccreditedBody":false,"urn":"107249","ukprn":"10078399","address":{"addressLine1":"Fagley Primary School","addressLine2":"Falsgrave Avenue","town":"Bradford","county":"West Yorkshire","postcode":"BD2 3PU"},"contact":{"website":"www.eastonepartnership.co.uk","email":"CSutcliffe@fagley.bradford.sch.uk","telephone":"1274771124","fullName":"Vicky Rutherford"},"location":{"latitude":53.8100063,"longitude":-1.7179656},"trainWithUs":"East One Partnership consists of a group of schools within the Bradford East area. As a cluster of highly-successful schools, we have developed strong links across the partnership and have a number of skilled professionals on-hand to develop your skills and experience. We offer a PGCE (5-11) Teacher Training Programme.\nThe school direct programme offers a highly effective route into becoming a confident and successful practitioner. It consists of three placements across two settings. You will be placed in one of our partnership schools, working alongside good and outstanding teachers. With the support of trained mentors and experienced class teachers, on-going feedback and training will ensure you reach your full teaching potential.\nYou will receive teaching from Leeds Trinity University and training from East One Partnership. You will have access to Specialist Leaders of Education, who will contribute to your continuous training and professional development. We are eager to recruit trainees who share the same values and vision to inspire, challenge and motivate learners. Following a year of successful training, you will be awarded QTS. When applying for jobs at the end of the course, we will support you through the application process.","trainWithDisability":"We are fully committed to equality and diversity and welcome applications from candidates with disabilities and other needs. All partner organisations and schools participating in the programme have clearly established policies, processes and systems in place. If you have a disability or additional needs, East One Partnership will ensure reasonable adjustments are in place to accommodate any additional requirements.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:52:02.388Z","updatedAt":"2021-07-22T16:36:53.900Z"}
