{"id":"8cc8541b-d2cf-46bf-b6be-1cf604eae901","name":"Richard Hale School/The Sele School Partnership","code":"1N6","type":"lead_school","isAccreditedBody":false,"urn":"139873","ukprn":"10042280","address":{"addressLine1":"Richard Hale School","addressLine2":"Hale Road","town":"Hertford","county":"Hertfordshire","postcode":"SG13 8EN"},"contact":{"website":"http://www.richardhale.herts.sch.uk","email":"pca@richardhale.co.uk","telephone":"1992583441","fullName":"Philip Camm"},"location":{"latitude":51.7923687,"longitude":-0.0780927},"trainWithUs":"The Richard Hale/Sele School Partnership has a long and successful track record of training teachers across a range of subjects. We work in close partnership with the University of Hertfordshire to provide a high quality training experience which prepares teachers well for the challenge of working in education. Both schools are located in the county town of Hertford, in close proximity to each other. Richard Hale School is a boys 11-18 school (with girls in the sixth form) and The Sele School is a mixed 11-18 school. Both schools are well-regarded in the local area and provide ample opportunity for working with a wide range of student profiles. Our programme of 'Professional Studies' runs throughout the year, providing hands on training workshops to support trainees' development, alongside their subject studies at the University.","trainWithDisability":"Each year the University of Hertfordshire welcomes a significant number of students who disclose a disability and/or have other needs. The University seeks to create a fair, inclusive culture where everyone feels valued and respected.\nThe University of Hertfordshire is committed to promoting equality of opportunity to ensure that it meets the needs of disabled people and has policies that are intended to support all students both in their studies and in developing their professional practice.\nIf you have a disability or other need we encourage you to disclose this and any other relevant information that could support your studies, both at the University and at the school.\nThe School of Education at the University of Hertfordshire provides both academic and practice placement support for teachers in training with disabilities and other needs.\nOne key aspect of the PGCE course is to raise awareness of mental health and well-being and to support the removal of unnecessary workload. [University of Hertfordshire disability support](https://www.herts.ac.uk/life/student-support/disability-services)\n[University of Hertfordshire statement on disability disclosure by students](https://www.herts.ac.uk/life/student-support/disability-services/statement-on-disability-disclosure-by-students).","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"feecdec5-259c-45e3-b1cf-4e391936ee90","code":"H36","name":"University of Hertfordshire","description":"The University of Hertfordshire is a leading regional provider of Initial Teacher Education (www.go.herts.ac.uk/schooldirect). \\r\\n\\r\\nThe School of Education has an excellent record of employment for trainees on their Initial Teacher Education programmes.\\r\\n\\r\\nAfter completing Initial Teacher Education there are opportunities to continue your studies through the [MA Education Framework] (https://www.herts.ac.uk/study/schools-of-study/education/postgraduate-courses-education/ma-education-framework).\\r\\n\\r\\nThe University of Hertfordshire has achieved the top gold ranking in the Government’s [Teaching Excellence Framework 2018] (https://www.herts.ac.uk/about-us/learning-and-teaching/tef-teaching-excellence-framework)."}],"createdAt":"2021-07-06T17:56:50.900Z","updatedAt":"2021-12-02T22:29:14.382Z"}
