{"id":"8cda030c-d039-427c-86dc-f50fe83a22d6","name":"St Mary’s School Direct Partnership Programme","code":"2C5","type":"lead_school","isAccreditedBody":false,"urn":"146241","ukprn":"10007811","address":{"addressLine1":"Boston St Mary’s RC Primary Academy","addressLine2":"Ashlawn Drive","town":"Boston","county":"Lincolnshire","postcode":"PE21 9PX"},"contact":{"website":"http://www.bostonstmarys.co.uk/","email":"Lisa.gleed-thornley@bostonstmarys.co.uk","telephone":"01205 362092","fullName":"Lisa Gleed-Thornley"},"location":{"latitude":52.9836494,"longitude":-0.0123827},"trainWithUs":"St Mary's is a lead school in partnership with 10 other schools along the East coast. We can offer a bespoke training package to meet the needs of the student. Aspiring teachers on our School Direct programme have the opportunity to work and train within a partnership of schools with diversity at its core. Our alliance of schools is dedicated to making a difference to the lives of some of the most disadvantaged young people in the area. We work with you to create a tailored package to support you through your teacher training, included school based learning and training, as well as specific placements to help you achieve your goals.\nSt Mary's Teaching Partnership works in union with Bishop Grosseteste University to offer our School Direct programme for Initial Teacher Training (ITT) across all primary school phases. This school-led programme enables successful trainees to achieve Qualified Teacher Status (QTS), a Post Graduate Certificate in Education (PGCE) and 60 credits towards a Masters level qualification.\nBGU has been commended in 2015 as a good provider for all its school-based ITT provision. If you are ambitious, enthusiastic and passionate about teaching and working with young people, we want to hear from you!","trainWithDisability":"We really care about all of our trainees and aim to support them all of the way through their studies, from application to graduation. Here at BGU we recognise that trainees may require additional assistance to engage fully with their studies due to a range of access needs. Student Advice plays a key role in co-ordinating services available to BGU’s disabled and sensory impaired students, and/or with specific learning differences or other access needs before and during their studies. In order to assess the level of support trainees may require, we use the legal definition of disability, which is wide ranging but includes:\n•\tSpecific learning differences including dyslexia\n•\tPhysical mobility difficulties\n•\tHearing impairments\n•\tVisual impairments\n•\tPersons requiring personal care\n•\tAutistic Spectrum Disorders including Asperger’s Syndrome\n•\tMental health difficulties\n•\tMedical conditions such as epilepsy, diabetes or asthma\nPlease note that this is not an exhaustive list – trainees may have access needs that are not listed above. If you are unsure whether you have access needs which are covered by disability legislation, please contact Student Advice – we will be happy to offer advice and guidance.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:47:56.899Z","updatedAt":"2021-10-22T19:04:31.837Z"}
