{"id":"8d43a74c-fad7-484d-b0c0-3a00f9387899","name":"Co-op Academies Trust","code":"2X4","type":"lead_school","isAccreditedBody":false,"urn":"136102","ukprn":"10030216","address":{"addressLine1":"Westport Road","town":"Tunstall","county":"Stoke-on-Trent","postcode":"ST6 4LD"},"contact":{"website":"https://www.coopacademies.co.uk/co-op-academies-trust-itt/","email":"andy.gibson@coopacademies.co.uk","telephone":"0161 250 6241"},"location":{"latitude":53.4878205,"longitude":-2.2372221},"trainWithUs":"Co-op Academies Trust believes in changing the lives of young people through empowering teachers and young people to work together for a better education and a better community.\nThe Trust brings together expertise from across Primary, Secondary, Special and Further Education in an aim to promote excellence in all aspects of education. Trainees benefit from focused, central and school-based training, working in our partner schools across our 4 geographical areas for the duration of the programme:\n- Greater Manchester\n- Merseyside\n- Staffordshire\n- West Yorkshire\nKey elements of our training programme\n- In school training from the first day\n- Two contrasting teaching placements across our trust to prepare you for employment\n- Cross-phase training experiences throughout the course\n- Trained mentors supporting every aspect of your professional development\n- Evidence-informed professional studies sessions facilitated by outstanding practitioners\n- Meetings with other associate teachers from a wide trainee network - Gaining Qualified Teacher Status (QTS), a PGCE, and Masters level credits\n- A dedicated well-being provision","trainWithDisability":"It is the goal of Co-op Academies Trust to recruit people of outstanding potential, irrespective of their background or needs, and to ensure that the admission process is transparent, has minimal barriers to entry, is based on merit and potential, and is fair with regards to diversity.\n\nPlease contact us if there is anything in particular you would like to discuss.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-11-25T18:58:58.869Z","updatedAt":"2022-01-25T17:17:33.755Z"}
