{"id":"8db689b4-c5c1-4d0f-8006-fac189046535","name":"Canterbury and Swale Teacher Training Alliance","code":"1CR","type":"lead_school","isAccreditedBody":false,"urn":"136324","ukprn":"10031570","address":{"addressLine1":"Canterbury and Swale Teacher Training Alliance","addressLine2":"c/o Fulston Manor School","town":"Brenchley Road","county":"Sittingbourne","postcode":"ME10 4EG"},"contact":{"website":"https://www.castta.org/","email":"enquiries@castta.org","telephone":"01795 412629","fullName":"Claire Banks"},"location":{"latitude":51.3328095,"longitude":0.7360578},"trainWithUs":"School Direct at Canterbury and Swale Teacher Training Alliance (CASTTA) provides school based learning opportunities with exceptional levels of support and guidance for all our trainees. We operate out of Fulston Manor School (Sittingbourne), but offer training across all age ranges with our partners, Blean (Canterbury) and Queenborough (Isle of Sheppey) Primary schools. We create an environment in which staff, pupils and trainee teachers all feel valued and supported and this leads to a school culture of enthusiasm, commitment and outstanding achievement.\nThe wider partnership of schools comprises a mixture of large and small, urban and rural, and both secondary and primary schools. We provide a unique opportunity to experience a diverse and contrasting range of teaching and training experiences.\nOur staff have a proven track record in providing training and professional development. All our trainees receive the highest level of continual support throughout the programme and beyond. This covers all aspects of teaching life from behaviour management skills, subject knowledge, professional enrichment, AEN, inclusion and pastoral care (we uphold a specific focus on workload and well being across our partnership). All trainees have the opportunity to work closely with an experienced mentor and will become part of the school ethos from the first day of entry.","trainWithDisability":"Applicants who would benefit from disabled access or have any special requirements should make CASTTA aware on the application form . Or alternatively can contact The CASTTA team prior to application to obtain further information and guidance.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:55:48.665Z","updatedAt":"2021-09-21T17:46:28.770Z"}
