{"id":"8dd269b3-7447-4f81-b265-176ccb949209","name":"Redhill SCITT – Inspiring Leaders Teacher Training","code":"2A5","type":"scitt","isAccreditedBody":true,"ukprn":"10032224","address":{"addressLine1":"The Redhill Academy","addressLine2":"Arnold","town":"Nottingham","county":"Nottinghamshire","postcode":"NG5 8GX"},"contact":{"website":"http://www.inspiringleadersscitt.com or http://www.redhillhub.org.uk","email":"Redhillscitt@theredhillacademy.org.uk","telephone":"0115 9261481 ext 182","fullName":"Clare Hearn-Palmer"},"location":{"latitude":53.0092294,"longitude":-1.13029},"trainWithUs":"The Redhill Academy Trust and Teaching Hub provide high-quality secondary teacher training across a wide variety of subjects. Our programme leads to QTS and PGCE. We are especially interested in applications to Maths, English, Science, Languages and Humanities as there is a general shortage of teachers in these subjects locally. Our programme is accredited by Inspiring Leaders, an outstanding SCITT, based in the East Midlands.\nOur teacher training offers trainees an exceptional level of support, tailored to individual needs and delivered by trained mentors and coaches. Trainees have the opportunity to learn from classroom teachers and practitioners who are experts in their field. A commitment to train future teachers and leaders sits at the heart of our core purpose and ethos as a Trust. Our schools are based in Nottinghamshire, Derbyshire, Leicestershire and Lincolnshire and the wide range of settings and contexts enables us to provide a diverse range of experiences for all our trainees.\nFor more information visit our websites:\nhttps://www.inspiringleadersscitt.com\nhttps://www.redhillhub.org.uk\nCall us on 0115 9261481 (ext 3) 07483331520 or email us at s.haslam@theredhillacademy.org.uk or enquiries@redhillhub.org.uk\nOr alternatively contact Inspiring Leaders on 0116 3184066 or email info@iltt.org.uk","trainWithDisability":"As an equal opportunities provider we are well equipped to support trainees with additional needs. For more information please feel free to contact us and we will do our best to support your application.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:47:21.054Z","updatedAt":"2021-10-08T22:08:45.488Z"}
