{"id":"8e41cff5-0364-4118-a0fd-4c823154c746","name":"East London Early Years and Schools Partnership","code":"25U","type":"lead_school","isAccreditedBody":false,"address":{"addressLine1":"East London Early Years and Schools","addressLine2":"Partnership, Elkington road,","town":"Plaistow","county":"London","postcode":"E13 8LH"},"contact":{"website":"http://www.eleysp.co.uk","email":"kate.fallan@ekotrust.org.uk","telephone":"020 8325 4585","fullName":"Kate Fallan"},"location":{"latitude":51.521288,"longitude":0.0270019},"trainWithUs":"We are delighted you are interested in teacher training with the East London Early Years and Schools Partnership.\nWe think that every child deserves a great education, and in particular, we must do everything possible to give children living in social and economic disadvantage the best start in life and learning. This means that we want to find the very best people and help them to become effective and inspirational teachers. People like you.\nOur specialisms include:\n* learning about the Early Years, in outstanding Nursery Schools as well as in Primary Schools\n* Working with a wide range of local Primary schools (all rated outstanding or good by Ofsted)\n* Developing trainees' understanding of how to make the best curriculum for all, regardless of ability.\nAnd because we work so well as an alliance of schools, we're able to draw on high levels of expertise to ensure that you get the personalised support, mentoring and input you need so that you can be the very best teacher you can be.\nWe also offer the unique opportunity to spend time in a contrasting location - the Lake District - observing practice and taking part in teaching in our partner school there.\nWe look forward to welcoming you to East London.","trainWithDisability":"Our schools aim to meet their obligations under the public sector equality duty by having due regard to the need to:\n*Eliminate discrimination and other conduct that is prohibited by the Equality Act 2010;\n*Advance equality of opportunity between people who share a protected characteristic and people who do not share it;\n*Foster good relations across all characteristics - between people who share a protected characteristic and people who do not share it.\nHigh quality tutoring by the University of East London ensures that individual needs are identified and communicated and structured plans are put into place, quickly and effectively. This means that trainees' needs are well met and responded to in a timely way.","accreditedBodies":[{"id":"2e1ce675-b5df-42ab-bb63-1e0435ef5722","code":"E28","name":"University of East London","description":"We're proud to work in partnership with the University of East London, who have an excellent reputation for preparing teachers to work in multi-ethnic and multilingual urban schools and successfully train up to 600 teachers every year.\\r\\n\\r\\nYou'll benefit from the excellent core learning from The University of East London, delivered by experienced and expert practitioners, as well as individual tutoring to ensure you stay on track and get the support you need to succeed."}],"createdAt":"2021-07-06T17:51:15.220Z","updatedAt":"2021-07-06T17:51:15.220Z"}