{"id":"8e7b34fd-6945-45d5-a282-b14615fc5b7b","name":"Ellison Boulters Church of England Primary School","code":"19X","type":"lead_school","isAccreditedBody":false,"urn":"138753","ukprn":"10038692","address":{"addressLine1":"Sudbrooke Road","addressLine2":"Scothern","town":"Lincoln","postcode":"LN2 2UZ"},"contact":{"website":"http://www.ellison-boulters.lincs.sch.uk/","email":"Clare.hauton@ellison-boulters.lincs.sch.uk","telephone":"01673 862392","fullName":"Amy Wells"},"location":{"latitude":53.2814776,"longitude":-0.4489103},"trainWithUs":"Ellison Boulters Church of England Academy is a Lead School for the School Direct programme. We work alongside other Lead Schools, our SCITT provider (Lincolnshire SCITT) and the University of Lincoln to offer a PGCE alongside Qualified Teacher Status (QTS). \n\nThe Lincolnshire SCITT provides a dynamic, supportive and school centred environment in which to train to teach within both the primary and secondary phases. We offer a highly regarded training programme, with expert and committed staff eager to share their skills, experience and practice with the next generation of teachers.\n\nOperating within the city, county and borders of Lincolnshire, the SCITT works with a number of lead and placement schools experienced in the field of teacher training. Schools in our partnership subscribe to the same ethos and value the contribution enthusiastic trainees can bring to our schools and pupils. Within a caring and stimulating atmosphere, trainees are supported in their journey to qualify to teach.\n\nTo enable professional practice to be set within the context of academic and evidence-based research, The University of Lincoln co-delivers the taught programme and assesses trainees for a Post Graduate Certificate of Education (PGCE) with 60 Masters’ credits.","trainWithDisability":"Lincolnshire SCITT recognises the needs of all its trainees and will implement a support plan for trainees with disabilities and other needs. As an organisation we value the personal pastoral care that we put in place for each of our trainees and will work collaboratively to ensure that full support is given from the central team and school-based staff. In addition, all trainees are students of the University of Lincoln and as such have access to the full range of support offered by the university.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"8dfae1fb-865e-4906-a241-4e872f0388cc","code":"25G","name":"Lincolnshire SCITT","description":"Our trainees have valued being part of a school from the beginning of their training. With the support of our experienced central team and school-based staff, trainees are given every opportunity to meet and exceed the Teachers’ Standards and so be awarded Qualified Teacher Status (QTS). \\r\\nLincolnshire SCITT also believes that professional practice is enhanced by academic research. The University of Lincoln co-delivers on our training programme and on the successful completion of academic assignments trainees are also awarded a Post Graduate Certificate of Education (PGCE) with 60 Masters’ credits."}],"createdAt":"2021-07-06T17:48:41.508Z","updatedAt":"2021-09-29T20:43:20.437Z"}
