{"id":"8e7d52e9-0f3a-4baa-9cbc-2355e052c443","name":"Marlbrook Collaboration of Schools","code":"1Y2","type":"lead_school","isAccreditedBody":false,"urn":"116684","ukprn":"10070800","address":{"addressLine1":"Marlbrook Primary School","addressLine2":"Green Croft","town":"Hereford","county":"Herefordshire","postcode":"HR2 7NT"},"contact":{"website":"www.marlbrookschool.com","email":"mreid@marlbrook.hereford.sch.uk","telephone":"01432 266643","fullName":"Tracey Kneale CBE"},"location":{"latitude":52.0401888,"longitude":-2.7251068},"trainWithUs":"Why Train With Us?\nLead School\nMarlbrook Primary school is at the heart of its community, with a clear vision for the future. We currently have over 650 pupils on role and we are now a three form entry school. We are collaborated with two local schools, Little Dewchurch C of E Primary School and St Martin's Primary School. The outstanding practice has been recognised nationally and the Headteacher (Tracey Kneale CBE) is a designated National Leader of Education and OFSTED inspector and mentor. The school delivers the Outstanding Teacher Programme and The Improving Teacher Programme to teachers locally to improve practice. The outstanding teachers across our schools are used as models of outstanding practice throughout all training packages delivered. We work closely with the Local Authority to deliver and organise conferences, NQT training, school to school support, curriculum and SEND networks and Moderation across the county for KS1 and KS2.\nAs a lead school we can offer placements at a range of Primary schools in Herefordshire within our partnership.","trainWithDisability":"At Marlbrook Primary School we are committed to meeting the needs of candidates with a range of disabilities and other needs. We have successfully trained (and employed) School Direct students in the past with additional needs. We would be happy for candidates to contact us if they would like to discuss this at any point during the application process.\nDisability Access\nPlease contact Marlbrook Teaching school to discuss your individual needs.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:55:03.327Z","updatedAt":"2021-12-17T23:54:40.689Z"}
