{"id":"8ea72c4a-84f2-4076-9688-c4acd829957a","name":"North Devon Teaching School Alliance","code":"17H","type":"lead_school","isAccreditedBody":false,"address":{"addressLine1":"NDTSA, Woolacombe National Support and Teaching School,","addressLine2":"Beach Road","town":"Woolacombe","county":"Devon","postcode":"EX34 7BT"},"contact":{"website":"www.ndtsa.org","email":"info@ndtsa.org","telephone":"01271 440898","fullName":"Carole Gentle"},"location":{"latitude":51.1718631,"longitude":-4.201924},"trainWithUs":"Choosing Schools Direct through the North Devon Teaching School Alliance is the entry point to North Devon's best Primary and Secondary Schools. We offer a one year school-based programme where trainees are part of a school team from day one. Please note that some of our courses follow the @Exeter School Direct route, i.e. Biology, Chemistry, English, History, Mathematics, Modern Languages, Physical Education, Physics and Religious Education.\nSchool Direct trainees benefit from a full 40-week schedule. Complementing their time learning the job in school trainees receive HEI lecturers, and a contrasting second school Key Stage experience. For secondary, subject specialism days have been developed across our schools to support subject and pedagogy specialisms. Shared training across the Alliance gives complete and contrasting experiences. Trainee teachers who successfully complete all modules are awarded a P.G.C.E. Post Graduate Certificate of Education (including up to 60 Masters credits) with Qualified Teacher Status. School Direct is designed to give experienced professionals and higher class degree students an alternative pathway to a career as a teacher, whilst enabling schools to develop exactly the teachers they need.\nOur combination of expert school based practitioners and University partners brings teacher education pedagogy and up to date research within a school based setting. We nurture our talent and provide the essential classroom experiences that allow trainees to put theory into practice as they develop into an outstanding practitioner.","trainWithDisability":"We will assess individual needs on a one to one basis to enable them fair access to our programmes.\nThe University of Exeter provides comprehensive student services that include AccessAbility and Wellbeing teams, Student Learning Skills Service, Student Advice Unit, Counselling Service, Students’ Union Advisors, Student Health Centre, Family Centre and the Chaplaincy. PGCE trainees can access the support of a Wellbeing Services Welfare Caseworker to discuss concerns, talk through options for support or understand more about how the University Wellbeing Services may be able to help.\nAlongside the support described above, every PGCE trainee is assessed by an Occupational Health provider as part of the admissions process to ensure they are fit to teach in a school setting. If the Occupational Health provider recommends any adjustments, the University’s Partnership Office will ensure you are placed in schools where these adjustments can be made, providing they are logistically possible and reasonable.","accreditedBodies":[{"id":"d41a1821-e35b-48eb-bf02-4842872b04a2","code":"E84","name":"University of Exeter","description":"We work with the University of Exeter who offer our secondary phase School Direct PGCE provision :\\r\\n\\r\\nTrainees are based entirely in schools for the academic year. They are registered with the university and are eligible for training bursaries and student loans. The Masters modules are delivered by distance learning, through two online 30-credit modules, plus other online tools.\\r\\n\\r\\nWe can offer the following subjects:\\r\\n\\r\\nBiology\\r\\nChemistry\\r\\nComputing\\r\\nDesign \\u0026 Technology\\r\\nDrama\\r\\nEnglish\\r\\nGeography\\r\\nHistory\\r\\nMathematics\\r\\nModern Languages\\r\\nMusic\\r\\nPhysical Education\\r\\nPhysics\\r\\nReligious Education"},{"id":"d8b99dc6-52c0-4d80-925e-28c11c305477","code":"P60","name":"University of Plymouth","description":"Our Primary Schools Direct provision is offered in partnership with the University of Plymouth. \\r\\n\\r\\nTrainees are based entirely in schools for the academic year. They are registered with the university and are eligible for training bursaries and student loans. The Masters modules are delivered by distance learning, through two online 30-credit modules, plus other online tools."}],"createdAt":"2021-07-06T17:46:44.905Z","updatedAt":"2021-12-22T02:02:59.275Z"}