{"id":"8eaad1be-be05-4b10-b15d-02ba86607a43","name":"Saint John Southworth Enterprise and Research Alliance","code":"15O","type":"lead_school","isAccreditedBody":false,"urn":"141931","ukprn":"10049304","address":{"addressLine1":"The Cardinal Vaughan Memorial School","addressLine2":"89 Addison Road","town":"London","postcode":"W14 8BZ"},"contact":{"website":"www.cvms.co.uk","email":"Kehoen@cvms.co.uk","telephone":"2076038478","fullName":"Nicholas Kehoe"},"location":{"latitude":51.503966,"longitude":-0.2116333},"trainWithUs":"If you are looking for a teacher training course in which you spend most of your time in-school while you study, this course may be for you.\nYou work with experienced teachers, first of all observing and team teaching, then teaching independently. You are will be based in one of the schools within the Saint John Southworth Enterprise and Research Alliance during your training, with a placement of about 6 weeks in a contrasting school. A key feature of the programme is the individual support provided to candidates. A recent candidate noted that \"The support provided to the trainees within the school is excellent at every level. This includes - but is by no means limited to - a mentor from the department who meets with you on a weekly basis; my lead school trainer, who oversees the more general assessment and evaluation of progress; and the added support system of the department and HOD, all of whom are always highly approachable. The programme provides trainees with ample in-class experience; opportunities to observe colleagues of various age groups, abilities and subjects and offers weekly INSET seminars which hone practical skills and help to clarify many aspects of training which may appear less accessible or relatable to ‘real life’ classroom teaching. Every tutor is vastly experienced, supportive, welcoming, and most of all, an outstanding teacher in their own right.\"","trainWithDisability":"Schools generally have good disability access to their site. However, candidates should check this with the school prior to your visit and interview, if you are shortlisted.\nPlease contact the school or eQ office for a discussion of your needs if they are not related to mobility, so that we can identify what additional support might be appropriate for you.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"ef172d85-20e4-4aa2-96d0-9e3ae81f526d","code":"S64","name":"St Mary’s University, Twickenham","description":""},{"id":"252d7e03-741e-4453-b6a8-3d361e6c9d1b","code":"E69","name":"e-Qualitas","description":""}],"createdAt":"2021-07-06T17:49:37.317Z","updatedAt":"2021-10-01T13:18:20.937Z"}
