{"id":"8f51ccf6-68a8-4fb3-9199-7cf1427ecd53","name":"Future Stars TSA","code":"1BR","type":"lead_school","isAccreditedBody":false,"address":{"addressLine1":"Future Stars TSA","addressLine2":"Queensbridge Primary School","town":"Queensbridge Road","county":"Hackney, London","postcode":"E8 4ET"},"contact":{"website":"http://www.futurestarstsa.co.uk/","email":"swood@queensbridge.hackney.sch.uk","telephone":"0207 254 1186","fullName":"Sophie Wood"},"location":{"latitude":51.5398487,"longitude":-0.0704498},"trainWithUs":"Future Stars Teaching School Alliance is led by Queensbridge Primary School an 'Outstanding' primary school with a fantastic record of training high calibre students. As a National Teaching School we work closely with the DFE to support schools nationally and our Head Teacher, Sarah Bailey OBE, is a National Leader of Education. We are actively engaged in researching the best practice to underpin our pedagogy and we are proactive in disseminating this to our colleagues in other schools. Many of our teachers began their careers as school direct teachers themselves and have gone on to develop expertise in specialist fields. We currently have SLEs in the following areas: Reading/Restorative Justice/Early Years/MFL/Maths/Computing and Dialogic Teaching.\nOur Alliance consists of a network of like-minded schools; Our partner universities, UCL Institute of Education, Goldsmiths University and London Metropolitan University have longstanding global reputations and a proven track record for excellence in teacher training. We offer a range of school direct courses and apprenticeships that all lead to qualified teacher status (QTS) in some cases a PGCE as well. Our courses are all school-led which means that the majority of your time will be spent based in school learning from experienced colleagues and gaining first hand experience of teaching. Students are based in class alongside an experienced teacher/mentor who will offer practical advice, regular meetings, observation opportunities, and a listening ear when needed.\nA strong collaboration between school and university supports quick progress and students are well supported throughout their training year.","trainWithDisability":"We are a highly inclusive, equal opportunities setting and have trained staff that are happy to discuss any applicant's needs individually with them.","accreditedBodies":[{"id":"049fe65f-08dc-4686-9ac8-606dce490128","code":"G56","name":"Goldsmiths, University of London","description":"Goldsmiths has been educating teachers since 1904, and is renowned as a leader in the field of teacher education supporting the development of exceptional teachers for world class schools. \\r\\nThe PGCE (QTS) programme at Goldsmiths has been designed to: \\r\\n•\\tPromote Reflection: a strong sense of identity built upon research and experience. \\r\\n•\\tRecognise Inclusivity and Diversity: rights respecting and recognising political, social, economic and cultural dimensions of practice. \\r\\n•\\tCelebrate Creativity: using imaginative and innovative strategies to support learning.\\r\\n•\\tDevelop Confidence and Engagement: steering the course of the profession both locally, nationally and globally.\\r\\n Further information at: https://www.gold.ac.uk/pgce/primary/"},{"id":"7f11aaed-7c3e-42c5-af7a-023d33b45fa3","code":"U80","name":"UCL, University College London","description":"UCL Institute of Education (IOE) is a global leader in teacher education. Their programmes are recognised by Ofsted as “outstanding” in every criterion across Primary and Secondary Education.”\\r\\n\\r\\nAll UCL School Direct students have full access to UCL student support services and facilities.\\r\\n\\r\\nFurther information about the Primary Salaried route can be found at:\\r\\nhttps://www.ucl.ac.uk/ioe/courses/teacher-training"}],"createdAt":"2021-07-06T17:53:28.657Z","updatedAt":"2021-07-06T17:53:28.657Z"}