{"id":"8fdb4c6d-b0a5-4370-870e-b5a9845e4a72","name":"The Yorkshire Rose Teaching Partnership","code":"13R","type":"lead_school","isAccreditedBody":false,"urn":"137424","ukprn":"10035145","address":{"addressLine1":"Batley Girls High School","addressLine2":"Windmill Lane","town":"Batley","county":"Batley","postcode":"WF17 0LD"},"contact":{"website":"https://yrta.co.uk/","email":"erodrigues@batleygirls.co.uk","telephone":"01924 350080","fullName":"Emma Rodrigues"},"location":{"latitude":53.732307,"longitude":-1.64532},"trainWithUs":"The Yorkshire Rose Teaching Partnership is a consortium of schools which offers high quality primary and secondary teacher training to graduates in a range of subjects. Our partnership is committed to providing the highest standard of education in diverse and relatively disadvantaged urban communities. We transform lives, both of trainee teachers and the students within the local schools; we do not merely educate or train. We will provide training of the highest quality, delivered by outstanding practitioners in a diverse and stimulating range of local schools. We aim to deliver a bespoke training package, making the most of your knowledge and skills. You will be placed in two of the Partnership schools and, after a year’s successful training, you will achieve a PGCE with QTS. As a partnership, we are committed to helping you develop professionally, by providing an extensive programme of Continuing Professional Development. The Director of The Yorkshire Rose Teaching Partnership is also a strategic lead for the Early Career Framework with the Calderdale and Kirklees Teaching School Hub. This means we have a detailed and up to date understanding of the 'Golden Thread' that runs from ITT to the ECF to the new NPQs. Support will continue even when The Yorkshire Rose Teaching Partnership trainees become Early Career Teachers. In addition, Batley Girls' High School has been graded Outstanding by OFSTED. It is our aim to train the next generation of outstanding teachers in West Yorkshire. If you share our vision for education, visit our website (https://yrta.co.uk/).","trainWithDisability":"The Yorkshire Rose Teaching Partnership prides itself on being an equal opportunities ITT provider committed to delivering personalised teacher training to all prospective teachers. We pride ourselves on supporting a diverse and inclusive range of trainees through an individual support package. This does not stop once trainees have become teachers – The Yorkshire Rose Teaching Partnership will follow on with advice, support and contact into the early stages of your teaching career to sustain resilience and well being to ensure that you become the best teacher possible. The Yorkshire Rose Teaching Partnership is committed to ensuring that every student with potential, regardless of their background or circumstances, has the opportunity to train to become a teacher. If you have a disability or additional needs, we will endeavour to put in place reasonable adjustments to accommodate any additional requirements throughout your teacher training year. We’re able to support with conditions such as: -\tDyslexia\n-\tSpecific learning difficulties\n-\tAsperger syndrome/autism\n-\tVisual/hearing impairments\n-\tPhysical and mobility restrictions\n-\tLong-term medical conditions\n-\tMental health conditions We will develop a Learning Support Plan tailored to your specific needs. There is additional support from Leeds Beckett University and Leeds Trinity University which could include assessment adjustments, extended library loans, specialist one-to-one study skills, dyslexia screening and assessments, learning materials provided in alternative formats and alternative assessments.\nWith your permission, we will inform the placement schools so they can discuss how to best support you during your school-based training.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"accreditedBodies":[],"createdAt":"2021-07-06T17:49:24.558Z","updatedAt":"2021-12-02T18:21:56.537Z"}
