{"id":"90199de5-4a8c-47de-b9cf-423b7a9021d5","name":"Altius Teacher Training","code":"24R","type":"scitt","isAccreditedBody":true,"ukprn":"10054410","address":{"addressLine1":"Cheadle Hulme High School","addressLine2":"Woods Lane","town":"Cheadle Hulme","county":"Cheshire","postcode":"SK8 7JY"},"contact":{"website":"http://www.altiusteachertraining.org.uk","email":"enquiries@altiusteachertraining.org.uk","telephone":"0161 485 7201","fullName":"Mrs Ann Wilson"},"location":{"latitude":53.3662392,"longitude":-2.1876591},"trainWithUs":"Altius Teacher Training provides a school-led route which ‘ensures that trainees have the opportunity to hone their practical teaching skills in an intellectually rigorous context. Training balances conceptual understanding with the practical toolkit trainees need to teach in schools.’ (Ofsted 2017)\nAltius is a partnership of primary and secondary schools across Greater Manchester, Stockport and Cheshire. In 2017 Altius was judged to be an outstanding provider of Initial Teacher Training by Ofsted. Cheadle Hulme High School,(11-18), is the lead Altius school and is a consistently high performing state school and judged outstanding in all areas by Ofsted in two successive inspections. Trainees who successfully complete their training are recommended for qualified teacher status (QTS) 11-16 (secondary) or 5-11 (primary). All gain a postgraduate certificate in education (PGCE),(SCITT), with 60 Masters credits, from our partner Manchester Metropolitan University.\nSecondary trainees undertake at least one of their assessed placements in a Laurus secondary school. Primary trainees undertake their assessed placements in two of our partnership primary schools.\nChoose to train with us if you want ‘a robust and rich school-led programme that demands high expectations alongside offering opportunity and challenge.’ (Ofsted 2017)\nPlease be aware we are not eligible to sponsor student visas.","trainWithDisability":"Altius Teacher Training is committed to Equal Opportunities for all our applicants. If you have any specific requirements we would be pleased to discuss them with you.\nThere are schools within Altius which have full disability access.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:54:30.839Z","updatedAt":"2021-10-07T19:18:57.484Z"}
