{"id":"9029719b-df7c-45be-8177-d3a56458d041","name":"John F Kennedy Special School","code":"2GJ","type":"lead_school","isAccreditedBody":false,"urn":"141255","ukprn":"10047148","address":{"addressLine1":"Essex & Thames SCITT","town":"Essex","county":"Essex","postcode":"EX5 5EX"},"contact":{"website":"www.etpscitt.co.uk","email":"info@etpscitt.co.uk","telephone":"01268 380025","fullName":"Jo Palmer-Tweed"},"location":{"latitude":51.6230633,"longitude":0.5235606},"trainWithUs":"We are a large dynamic partnership of schools with 21 years of experience behind us. Our excellent training is supported by expert practitioners in more than100 good and outstanding primary schools throughout the East of England. Due to the outstanding reputation we hold locally for the provision of rigorous and effective training 100% of our trainees gain employment each year, often within partner schools (86% in 2019). Our course has one of the highest long-term retention rates in the country, currently approximately 30% higher than the national average.\nProgrammes\nNot only will you gain Qualified Teacher Status (QTS) by training with us, but you will also receive professional training in educational theory leading to a PGCE award with masters level credits (validated by Canterbury Christ Church University). As a result, you will begin your teaching career with excellent practical teaching skills and a deep understanding of the underpinning educational theory enabling you to work effectively across the whole primary phase of education. ‘Training is carefully tailored to meet the needs of all trainees.’ Ofsted.\nSupport\nWe pride ourselves on offering bespoke support and guidance through your Personal Tutors and School-Based Mentors during your training and we continue this into your first year of teaching with our NQT support team. Visit www.etpscitt.co.uk to hear what our trainees and schools say about us.","trainWithDisability":"Training with a disability We value diversity and encourage applications for places from disabled trainees. Many trainees with a wide range of disabilities have successfully completed our course; many leaving us to go on and become outstanding teachers. What happens if you have additional needs? Each year we recruit trainees with a wide range of additional needs and we regularly work in partnership with other agencies to ensure we provide everyone with the best possible support. The SCITT employs the services of a specialist in Occupational Health, and working together, we can accommodate the needs of any applicant we feel has the potential become a good teacher and therefore an asset to our schools. Dyslexia and Dyspraxia\nWe accept trainees every year with dyslexia and /or dyspraxia and have a number of specialist mentors in our schools who can provide bespoke advice and guidance. All trainees with disabilities will have allocated sessions with a centre-based tutor who can ensure that any reasonable adjustments are made to your training.\nMental Health\nWe pride ourselves on our approach to trainee wellbeing. We work extensively with other services to ensure that we provide you with the best possible support. We are able to offer coaching and access to counselling services as needed. All our staff are trained mental health first aiders. Taught sessions include mindfulness, stress management and resilience training. If you need adjustments to be made at interview, or wish to discuss any aspect of access in more detail please email admin@etpscitt.co.uk","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:47:52.480Z","updatedAt":"2022-01-14T20:43:35.039Z"}
