{"id":"909c1ac0-5583-468d-b4cb-33048bf86113","name":"Staniland Academy","code":"27O","type":"lead_school","isAccreditedBody":false,"urn":"138752","ukprn":"10038704","address":{"addressLine1":"Venture House","addressLine2":"Enterprise Way","town":"Boston","county":"Lincs","postcode":"PE21 7TW"},"contact":{"website":"http://www.voyage-education.org/teacher-training/","email":"claire.needham@voyage-education.org","telephone":"01205 337028","fullName":"Rachel Creasey"},"location":{"latitude":52.9736733,"longitude":-0.0370558},"trainWithUs":"Voyage Education Partnership works in partnership with Lincolnshire SCITT (School Centred Initial Teacher Training) to provide a dynamic and supportive environment in which to learn to teach in both the primary and secondary sectors. Lincolnshire SCITT works with a number of academy trusts, Lead schools and placement schools to offer a highly regarded training programme, where trainees are supported by experienced and committed staff.\nSchools who host Lincolnshire SCITT trainees are committed to continued professional development and see the initial training of teachers as the first step on the journey to becoming an outstanding teacher. Beyond the training year structured induction and development programmes are offered in our schools.\nOperating within the city, county and borders of Lincolnshire, the SCITT works with a number of lead and placement schools experienced in the field of teacher training. Schools in our partnership subscribe to the same ethos and value the contribution enthusiastic trainees can bring to our schools and pupils. Within a caring and stimulating atmosphere, trainees are supported in their journey to qualify to teach.","trainWithDisability":"Lincolnshire SCITT recognises the needs of all its trainees and will implement a support plan for trainees with disabilities and other needs. As an organisation we value the personal pastoral care that we put in place for each of our trainees and will work collaboratively to ensure that full support is given from the central team and school-based staff. In addition, all trainees are students of the University of Lincoln and as such have access to the full range of support offered by the university.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:49:36.071Z","updatedAt":"2021-10-13T22:06:10.360Z"}
