{"id":"910ed43d-7633-4513-8617-7cb494dc9a6d","name":"Polaris","code":"2GW","type":"lead_school","isAccreditedBody":false,"urn":"121653","ukprn":"10080313","address":{"addressLine1":"St Mary’s Catholic Primary School","addressLine2":"Highfield Road","town":"Malton","county":"North Yorkshire","postcode":"YO17 7DB"},"contact":{"website":"http://www.polarisalliance.org.uk","email":"jwheldon@smm.smccat.org.uk","telephone":"01653 692274","fullName":"David Harrison"},"location":{"latitude":54.1415278,"longitude":-0.7877081},"trainWithUs":"Our PGCE School Direct programme is school-led - you will learn from highly skilled teachers in the classroom. We place trainees in more than 20 primary schools across North Yorkshire, York and East Riding, offering an impressive breadth of experience, from town and city schools to village primaries, faith and community schools.\nThe course is full time from September to June. You will specialise in either the 3-7 or the 7-11 age phase, although you will gain experience and be qualified to teach across both. Whilst the majority of our training is school-based, you will receive 34 days’ education and training from specialist curriculum leaders at our local hub in Malton and also from tutors at York St John University.\nWe offer lots of flexibility within our programme to suit your needs: we place you in schools that match your interests and we use a blended approach to training and support.\nWe have an excellent team of school-based mentors who are committed to supporting you through the programme. We pride ourselves on our responsiveness to any obstacles you might meet along the way.\nOur motivation for running the programme is to supply our schools with brilliant, ‘home-grown’ teachers – we are invested in making you the best teacher you can be. We support our new teachers through every stage in their career – from NQT to Headship; we see your teacher-training year as just the first step in your career.\nFind out more on our website: https://www.polarisalliance.org.uk/","trainWithDisability":"We are fully committed to equal opportunities for all of our trainees and we welcome diversity. In recent years, we have successfully supported trainees with specific learning needs such as dyslexia, and also with additional physical and medical needs. Our training facility is based in St. Mary’s Primary school Malton, which is a fully-accessible primary school. All our placement schools are accessible and we work closely with partners to ensure every placement meets the needs of the trainee. \n\nOur HEI partner, York St John University is an inclusive university and has a range of support services for students with disabilities and other needs. YSJU has a dedicated Disability Advice Team and a strong track record of supporting all students, enabling them to complete their studies successfully.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"b011427a-6dff-4a77-9df3-c85a54be605a","code":"Y75","name":"York St John University","description":"Polaris and York St John University partnership is a community of practice.\\r\\nWe work together to deliver high quality teacher training and education, leading to a PGCE with QTS. Our last Ofsted inspection rated the partnership as ‘highly respected in our region, with outstanding leaders who have clear vision, relentless drive and well-targeted actions. The university, teaching school alliances and schools demonstrate a common vision and shared commitment to teacher training …. The university provides strong institutional support for initial teacher education’.\\r\\nWe have a strong employment record and contribute to the local and national teaching community."}],"createdAt":"2021-07-06T17:54:01.217Z","updatedAt":"2021-10-04T20:41:17.088Z"}
