{"id":"9138510b-fbf9-4764-8d56-664aeb05c9f3","name":"Benfield Primary School","code":"2FH","type":"lead_school","isAccreditedBody":false,"urn":"114412","ukprn":"10072137","address":{"addressLine1":"Benfield Primary School","addressLine2":"255, Old Shoreham Road","town":"Brighton","county":"Sussex","postcode":"BN41 1XS"},"contact":{"website":"sussexcoastsa.co.uk","email":"sussexcoastsa@benfield.brighton-hove.sch.uk","telephone":"01273 294974","fullName":"Helen Horsley"},"location":{"latitude":50.8376095,"longitude":-0.2094359},"trainWithUs":"Benfield Primary School is a lead school for the Sussex Coast School Alliance in Brighton and Hove and East and West Sussex. We are a group of 39 schools who are committed to high quality school based experience ensuring our children are provided with the best possible teachers.\nInitial teacher training is at the heart of everything we do and we continue to invest in all our teachers through a continuum of professional development.\nWe provide a training programme which is school based for 4 days a week with a further one day at the University of Sussex. As professionals, we firmly believe this is an excellent way to become a teacher with intensive, supported practice in the classroom.\nTrainees are supported by an experienced mentor who is an excellent practitioner. We expect all our trainees to be an active member of our schools community, fully participating in all aspects of school life. We consider our trainees to be an essential part of our team.\nIn addition to classroom practice, all our trainees take part in professional learning led by colleagues across the alliance. This enables trainees to collaborate with other schools in sharing and embedding good practice.\nWe have recruited from the majority of our trainees over the past few years and many of these are now developing as teachers and leaders across the Alliance.\nWe are a Delivery Partner for the Early Career Framework and for the NPQs for UCL. Our development continues for all colleagues.","trainWithDisability":"Our support for candidates with disabilities reflects our inclusive approach to our children. We are proud on being an inclusive community and are constantly looking to see how we can better provide for all our learners, whether they are children or staff.\nWe welcome applicants with diverse needs and work in partnership with the University to try to ensure we avoid barriers for anyone wishing to become a teacher.\nAt interview and on acceptance of a place, we discuss with candidates any needs\nMany of our schools are suitable for colleagues with mobility conditions and include ramps and/or lifts.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"4d4cceab-1516-4a6c-a9ab-5de0e32e1fe1","code":"S90","name":"University of Sussex","description":"The University of Sussex is an outstanding provider and we work in partnership with them in many aspects of our work. \\r\\nAll interviews are conducted with the university and we try to conduct these in schools to give us a better view of how potential candidates interact with children.\\r\\nTrainees attend the University for one day a week working through an excellent developmental programme which fully supports their practice in school. Trainees are encouraged to be creative and reflective practitioners and this is evident in their work in schools."}],"createdAt":"2021-07-06T17:53:48.813Z","updatedAt":"2021-10-07T22:47:39.844Z"}
