{"id":"91613652-0b18-4453-818d-68222f2fb4c2","name":"WCPSD","code":"2A4","type":"lead_school","isAccreditedBody":false,"urn":"106460","ukprn":"10078715","address":{"addressLine1":"Lisa Hobden @ St Patrick’s","addressLine2":"Hardybutts","town":"Wigan","county":"Lancashire","postcode":"WN1 3RZ"},"contact":{"website":"http://www.wcpsd.uk https://www.saintpatricks.wigan.sch.uk","email":"enquiries@wcpsd.uk","telephone":"1942244361","fullName":"Wigan Catholic Primary School Direct"},"location":{"latitude":53.544754,"longitude":-2.6209651},"trainWithUs":"Why train with us?\nThe schools of ‘Wigan Catholic Primary School Direct’ are committed to providing an outstanding Catholic education to all of the pupils they serve. Wigan Catholic Primary School Direct is a large partnership of twenty-three Catholic primary schools spread across the Wigan Local Authority. WCPSD is made up of a range of developing, successful and outstanding primary schools with varying contexts, all of which have a shared common goal of training high quality teachers, with a vision for excellence. Working in partnership with Liverpool Hope University we are able to develop direct training that will have the academic and theoretical underpinning to allow trainees to become outstanding practitioners within the field of education. The Catholic Church provides schools to:\n*Assist in its Mission of making Christ known to all people.\n*Assist parents in the education and religious formation of their child.\n*To be at the service of the local Church and be of service to society.\n*In order for Catholic schools to fulfil this Mission they need staff of the highest calibre who know, understand and value the teachings of Christ and “have the duty and privilege to ensure that the students receive instruction in Catholic doctrine and practice”.\nWe will offer a unique training programme in conjunction with the developed expertise and pedagogical skills within the context of direct work experience in a Catholic school.","trainWithDisability":"Disability or specific learning difficulty does not preclude application to study for qualifications in teaching . However, students who choose these courses are required to comply with the Fitness to Practise policies of the bodies which govern the respective professions (Department for Education).\nThe Department for Education and Employment place a responsibility upon education and training providers to make sure that everyone who is registered as a Teacher is ‘physically and mentally fit’ to undertake the work they are training to do. Applicants are thus required to declare conditions which could be viewed as having a potential impact on their fitness to practice. Advice, guidance and support for applicants and students is available from the Education Department and also the Learning Support Team at Liverpool Hope University.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:53:24.826Z","updatedAt":"2021-09-21T17:37:37.308Z"}
