{"id":"917facc1-82bb-4a00-a765-a1522edcb916","name":"Sacred Heart Newcastle SCITT","code":"2BA","type":"scitt","isAccreditedBody":true,"ukprn":"10059424","address":{"addressLine1":"Fenhall Hall Drive","town":"Fenham","county":"Newcastle upon Tyne","postcode":"NE4 9YH"},"contact":{"website":"https://www.newcastlescitt.co.uk/","email":"joanne.smith@shhs.org.uk","telephone":"0191 2747373","fullName":"Joanne Smith"},"location":{"latitude":54.9836554,"longitude":-1.6572924},"trainWithUs":"Sacred Heart Newcastle SCITT is a partnership of over 30 Primary and Secondary schools. Our schools are located in Newcastle, Gateshead and nearby towns of County Durham and Northumberland. We are passionate about recruiting, developing and employing the very best graduates into the profession. We offer a unique, bespoke training programme which blends the best of both worlds; on the job experience and high-quality academic study. Train with us and you’ll be based in a school that cares about your future. From day 1 you’ll be treated like a member of staff, whilst also having the benefits of university life through our integrated ePGCE programme with Newcastle University. In choosing to train with us, you will be joining an organisation of expert practitioners with a track record of supporting and producing the very best teachers. As a Sacred Heart Newcastle SCITT trainee you will have a tailored training programme based on your past experience and needs. Our in-school Mentors and Professional Tutors will always be on hand to offer advice and monitor your progress. We see the success and employment of our trainees as key to improving the life chances for all students in the region.","trainWithDisability":"Sacred Heart SCITT welcomes applications from candidates with disabilities and other needs. Following a successful application process, we would discuss a bespoke support programme with a potential trainee. All our schools in the partnership have access arrangements for people with disability. Advice to potential applicants: Teaching is a very rewarding but challenging career (especially in the early years). If you are currently under a medical professional, we recommend that you consult them for advice ahead of applying. Our experience shows that trainees who are open about their needs and therefore supported from day 1, are far more likely to be successful.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:52:25.352Z","updatedAt":"2021-07-19T22:28:47.641Z"}
