{"id":"9188f17a-79c4-43a9-b459-4952815b739a","name":"Middlesex University","code":"M80","type":"hei","isAccreditedBody":true,"ukprn":"10004351","address":{"addressLine1":"Middlesex University","addressLine2":"The Burroughs","town":"Hendon","county":"London","postcode":"NW4 4BT"},"contact":{"website":"http://www.mdx.ac.uk","email":"enquiries@mdx.ac.uk","telephone":"020 8411 5555","fullName":"Admissions: Susie King"},"location":{"latitude":51.5901102,"longitude":-0.228922},"trainWithUs":"The education department has been involved in teacher training since the 1950s and has a long-established reputation for the provision of high quality teacher training. The department is based at the Hendon campus in London. We are committed to developing excellence in all areas of teaching, learning and professional practice in a wide range of contexts. We have high expectations of all our training teachers and work tirelessly to ensure that each individual reaches their full potential and becomes confident and highly employable. As a result, rates of employment are high across the partnership and many of our trainees stay within the partnership for their first teaching post. During the last Ofsted inspection, inspectors commended the strong support for current and former trainees and the skilful way in which tutors tailor their work to meet the individual needs of trainees, providing challenge and support as required. Trainees are encouraged to develop their own support networks with peers, sharing resources and ideas. As a result, trainees are confident and able to seek advice and help during and after they have completed training.","trainWithDisability":"We aim to provide an inclusive teaching and learning environment which caters for all trainees. We work closely with the Middlesex University Dyslexia and Disability Service to ensure that we are able to provide the appropriate support.\nFor more information, see;\n[mdx.ac.uk](https://unihub.mdx.ac.uk/support/disability-and-dyslexia)\nWe endeavour to ensure that each trainee is supported on an individual basis, dependent on their needs. We strive to build resilience, and we prepare trainees for the potential pressure points on the course with bespoke ‘well-being' sessions and provide individual personal support for trainees experiencing stress or anxiety.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:46:49.529Z","updatedAt":"2021-10-26T18:46:04.327Z"}
