{"id":"91c32fdc-4e37-4d1a-8957-1129876c4bd7","name":"Glenthorne High School","code":"17J","type":"lead_school","isAccreditedBody":false,"urn":"136914","ukprn":"10034150","address":{"addressLine1":"270 Sutton Common Road","town":"Sutton","county":"Surrey","postcode":"SM3 9PS"},"contact":{"website":"http://www.suttonteach.org.uk","email":"rfa@glenthorne.sutton.sch.uk","telephone":"020 8410 0006","fullName":"Duncan Gillies"},"location":{"latitude":51.3808519,"longitude":-0.2002411},"trainWithUs":"Sutton SCITT comprises of over 25 high-performing, local, yet diverse primary and secondary schools, all of which have high expectations of students and view training and development of staff as key to future success. Sutton and Merton schools are consistently some of the most successful schools in London.\nThe SCITT has extremely high standards and aspirations for all of its trainees and as a result employment, completion and attainment of trainees is very high. In June 2021 the SCITT was inspected by Ofsted for a second time and again was judged to be ‘outstanding’ in all areas; quality of education and training, leadership and overall . The inspection report praised how well prepared trainees were for their ECT years, their training and the support trainees received from colleagues in the SCITT.\nOur training is school-led, school-based and school-focused so you will be recruited by schools, based in schools and trained within our partnership of schools. We anticipate the vast majority of our trainees will go on to teach in our schools; we invest in you because we know our schools and children will benefit. Equally, our training equips you to teach in any school you choose, so if you do not wish to teach in Sutton or Merton you will be able to secure employment elsewhere. All our tutors are experienced school leaders who still work in our schools as teachers. Consequently, our programme is rooted in the reality of the classroom as well as the educational theory and literature.","trainWithDisability":"We are fully committed to training all candidates who have the potential to make a difference to young people in school and we take into consideration all trainees with additional needs. Wherever possible we will make reasonable adjustments for any disability. All our trainees are required to undertake a fitness to teach prior to commencing the programme and personalised support is arranged accordingly. All of our schools have access arrangements for people with disabilities although some parts of the school may be less accessible than others. We are not a university and therefore do not have a student support, mental health or medical service on site at any of our schools and instead we use external consultants to assess and support trainees where necessary.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"9257a6b9-5797-476a-ae73-6821f1e0b27e","code":"1ZW","name":"Sutton SCITT","description":""}],"createdAt":"2021-07-06T17:48:43.219Z","updatedAt":"2021-09-22T21:09:23.061Z"}
