{"id":"926804ac-be7a-4f0a-97f9-a26a5f5f032a","name":"University of Sunderland","code":"S84","type":"hei","isAccreditedBody":true,"urn":"133881","ukprn":"10007159","address":{"addressLine1":"Edinburgh Building","addressLine2":"City Campus","town":"Chester Road","county":"Sunderland","postcode":"SR1 3SD"},"contact":{"website":"http://www.sunderland.ac.uk","email":"student.helpline@sunderland.ac.uk","telephone":"0191 515 3000","fullName":"Admissions"},"location":{"latitude":54.9044149,"longitude":-1.3916013},"trainWithUs":"The University of Sunderland is an ambitious university with a global reach. We have 20,000 students at our four campuses worldwide – two in Sunderland on the North East coast, one in London and our newest in Hong Kong. The University has been awarded Silver in the Teaching Excellence Framework which demonstrates our high-quality teaching, learning and outcomes for our students.\nThe School of Education have been voted 2nd in the U.K (1st in England) for it's Undergraduate Education courses according to the Guardian University League Tables, 2020. We are extremely proud of this accolade, but it doesn't stop there! Recently, the University of Sunderland has been named University of the Year for Social Inclusion by The Times and Sunday Times Good University Guide 2021.\nAccording to our most recent Ofsted report, some key strengths of our provisions are strong communication and positive relationships between the University and its partner schools, and the commitment of trainers in partnership schools to the all-round development of the trainees. Our comprehensive courses will give you the skills needed to make a real difference in educating the next generation, as well as thrive on a personal level with a rewarding career. With 110 years-worth of experience of training teachers we are highly regarded in the local area, with links to 230 schools and colleges.\n• All our Primary and Secondary ITT courses are accredited by the Teacher Regulation Agency (TRA ) for QTS (Post Compulsory Education and Training does not award QTS)","trainWithDisability":"We celebrate and value the diversity of all students and staff, working to ensure that all are welcome in our community and do not face discrimination or encounter barriers with regard to their disability.\n\nPlease contact the Disability Support Team for disability-related queries:\n\nEmail: disability.support@sunderland.ac.uk\nTel: 0191 515 2952","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"createdAt":"2021-07-06T17:48:30.506Z","updatedAt":"2021-07-16T15:22:00.721Z"}
