{"id":"93047184-b62a-43bc-b7d5-16e9c65b0ded","name":"Salop Teaching Partnership","code":"1Q6","type":"lead_school","isAccreditedBody":false,"urn":"138216","ukprn":"10059785","address":{"addressLine1":"The Priory School","addressLine2":"Longden Road","town":"Shrewsbury","county":"Shropshire","postcode":"SY3 9EE"},"contact":{"website":"http://https://www.salopteachingpartnership.co.uk/get-into-teaching/school-direct/","email":"stp@tpstrust.co.uk","telephone":"01743 284000","fullName":"Enquiries"},"location":{"latitude":52.696061,"longitude":-2.767875},"trainWithUs":"The Salop Teaching Partnerhsip is a Shropshire and Telford and Wrekin based partnership of successful and outstanding schools working in collaboration with both local authorities.\nOur vision is to deliver an outstanding school-centred PGCE programme based in local schools. Trainees and graduates studying with us will be exposed to the highest quality teaching and learning strategies delivered by leading practitioners building on the latest educational research and national developments.\nOur unique combination of secondary schools and sixth form colleges will ensure that all trainees experience teaching in a variety of contexts and key stages, thus making them more appealing to future employers.","trainWithDisability":"The Priory School, the lead school in the teaching partnership, has disabled access to all parts of its site and buildings. This is the case for some of our partner schools, but not all and applicants may want to bear this in mind when applying to us.\nThe disability and inclusion team at the University of Chester provides confidential information, advice and guidance to disabled students. This includes students with specific learning differences, long-standing health conditions, mental health difficulties, Autistic Spectrum Disorder and sensory impairment. Staff will support students in identifying the most appropriate solutions to potential barriers to learning","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"e843cb68-d310-478c-8dba-cf9633fea086","code":"C55","name":"University of Chester","description":"We are proud to work in close partnership with the University of Chester, who are rated Outstanding by Ofsted for their primary and secondary teacher education programmes."}],"createdAt":"2021-07-06T17:54:36.583Z","updatedAt":"2021-12-14T18:16:55.988Z"}
