{"id":"93403f90-42d5-495f-b569-c58b45daebd7","name":"Harvills Hawthorn Primary School","code":"1R5","type":"lead_school","isAccreditedBody":false,"urn":"131591","ukprn":"10076705","address":{"addressLine1":"Harvills Hawthorn Primary School","addressLine2":"Wolseley Road","town":"West Bromwich","county":"West Midlands","postcode":"B70 0NG"},"contact":{"website":"https://harvillshawthorn.co.uk/","email":"jennie.hall@harvillshawthorn.co.uk","telephone":"1215571034","fullName":"Wendy McNeil"},"location":{"latitude":52.5353912,"longitude":-2.0221101},"trainWithUs":"\"A course that feels like you are part of a family\" PGCE student\nHarvills Hawthorn Primary prides itself on its caring and nurturing approach to training our student teachers. You will become part of 'our family' of schools who all care passionately about the education and opportunities for the children in our area. We are an outstanding school in Sandwell and offer student teachers bespoke, personalised training and development throughout the year long PGCE programme.\nWe pride ourselves on the fact that we have an extremely high pass and employment rate. \"I've enjoyed being part of an amazing group of people who all help and support one another. I have had unconditional support from mentors, staff and the course lead. Thank You!\" PGCE student","trainWithDisability":"Harvills Hawthorn Primary is a caring institution that aims to ensure that all provision, teaching, documentation, conditions and circumstances are presented in a way that is unbiased and which promotes harmony. We endeavour to ensure that, where possible, no-one is barred from accessing our PGCE programme for reasons of ethnicity, disability, sexual orientation, religion or race. All of our provision promotes and supports both Harvills Hawthorn Primary School, Haybridge Teaching Hub's and the University of Birmingham's, Equality and Diversity Policies. To support this, all sites have wheelchair access and there are a variety of support and advice systems that the university can provide to support student teachers with their learning. Depending on your individual needs, you may be eligible for this additional support. The Student Support and Wellbeing Team can talk to you about additional support that may be available. We work closely with these support systems to ensure that our provision enables each of our student teachers to succeed and thrive.","accreditedBodies":[],"createdAt":"2021-07-06T17:54:35.317Z","updatedAt":"2021-12-06T20:19:54.092Z"}