{"id":"9350f256-339d-4110-a60f-6fef570ee65e","name":"South Worcestershire and ITT Consortium","code":"1Y6","type":"lead_school","isAccreditedBody":false,"urn":"136469","ukprn":"10032987","address":{"addressLine1":"Prince Henry’s High School","addressLine2":"Victoria Avenue","town":"Evesham","county":"Worcestershire","postcode":"WR11 4QH"},"contact":{"website":"https://www.princehenrys.worcs.sch.uk/scitt","email":"ad@princehenrys.worcs.sch.uk","telephone":"1386765588","fullName":"Andy Duffy"},"location":{"latitude":52.0990414,"longitude":-1.9415985},"trainWithUs":"Special Features.\nThe South Worcestershire ITT Consortium's School Direct Programme in partnership with the Prince Henry's and South Worcestershire SCITT will meet your needs. Working in partnership with the University of Worcester we have the ability to shape our course to ensure that trainee teachers receive a first class programme which will allow them to develop their subject knowledge, learn the craft of the classroom and experience a good range of classes. Our outcomes for trainees over the past 5 years is a 100% pass rate at good or outstanding. All the trainees have secured a teaching post either within the consortium or within Worcestershire. Prince Henry's High School is the accredited provider for the partnership, and our expertise across the partner schools is excellent and the support trainees receive is of the highest quality. Why train with us?\nThe South Worcestershire ITT Consortium, (SWITT) along with its partner Accredited Provider of Prince Henry's and South Worcestershire SCITT, are already established education institutions with vast experience in delivering and supporting Initial Teaching Training (ITT) courses and placements. Across the consortium of schools we train no more than 40 trainees a year working in partnership with HEI institutions to support and train the next generation of teachers. Our aim is simple. We wish to continue to raise standards through effective teaching and learning, whilst simultaneously providing the highest quality of Initial Teacher Training and producing the next generation of 'outstanding practitioners'. Why train with us?\nhttps://www.princehenrys.worcs.sch.uk/scitt/apply","trainWithDisability":"Our equal opportunities and accessibility to training allows all trainees to apply and be trained through the SCITT. Extensive support from both the SCITT administration team, subject lead tutors and mentors have provided trainees with extra support and guidance if needed. We have trained trainees who have been diagnosed with dyslexia and they have been given extra support with the PGCE assignments through the University and also further considerations with planning and marking by the partner schools and mentors. have a trainee 2018-19 who has visual impairments and again extra support with templates, assignments lesson planning, marking will be given throughout the year.\nWe are constantly aware of the demands of the course on any person’s health and well- being and we provide pastoral support through our internal verifier and pastoral support colleague within the SCITT. This provides an extra avenue for trainees to access to share concerns and issues if they are finding difficulties with the course.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:55:29.366Z","updatedAt":"2021-09-21T02:35:30.041Z"}
