{"id":"93a46200-d7b3-4314-9097-00e4955fd0d4","name":"St Bede’s Deanery Teaching Alliance","code":"2FC","type":"lead_school","isAccreditedBody":false,"address":{"addressLine1":"St Cuthbert’s RC Primary School","addressLine2":"Grindon Lane","town":"Sunderland","county":"Tyne and Wear","postcode":"SR4 8HP"},"contact":{"website":"www.stcuthbertsprimaryschool.co.uk","email":"louise.mcgill@stcuthbertsprimaryschool.co.uk","telephone":"0191 5285094","fullName":"Jane Ward"},"location":{"latitude":54.8916684,"longitude":-1.4322896},"trainWithUs":"St. Cuthbert’s is a designated Teaching School, leading the St. Bede’s Deanery Alliance which is made up of the Sunderland Catholic Primary Schools. St. Cuthbert’s works with Leeds Trinity University to offer Initial Teacher Training (ITT) following the non salaried post graduate Schools Direct route. There are many different routes you can take to begin your Teacher Training, however our programme is a school led training programme which allows you to gain your qualification in school based environments- actually doing the job that you will qualify for.\nYou’ll train in at least two good schools over the course of an academic year, gaining the valuable experience you will need to succeed in the classroom. We arrange these placements on your behalf and you will be part of a team from the very start, receiving intensive support from experienced teachers and mentors.","trainWithDisability":"Training with disabilities and other needs\tWe’re committed to ensuring that every student with potential, regardless of their background or circumstances, has the opportunity to benefit from higher education. If you have a disability or additional needs, Leeds Trinity University will endeavour to put in place reasonable adjustments to accommodate any additional requirements throughout your teacher training year. We’re able to support with conditions such as: -\tDyslexia\n-\tSpecific learning difficulties\n-\tAsperger syndrome/autism\n-\tVisual/hearing impairments\n-\tPhysical and mobility restrictions\n-\tLong-term medical conditions\n-\tA mental health condition. If you register with our Disability Service, a member of the team will develop a Learning Support Plan tailored to your specific needs. The support within this plan could include exam adjustments, extended library loans, specialist one-to-one study skills, dyslexia screening and assessments, learning materials provided in alternative formats and alternative assessments.\nWith your permission, they’ll share this plan with your University-based personal tutor so that they know how to best support you during your University-based training. They can also share this plan with the School Partnerships team, who are able to inform the host schools for your placements so they can discuss how to best support you during your school-based training.","accreditedBodies":[],"createdAt":"2021-07-06T17:52:31.901Z","updatedAt":"2021-07-06T17:52:31.901Z"}