{"id":"94053090-d012-4ed5-8845-e93bfbd6a3cd","name":"The Buckingham Partnership (School Direct)","code":"258","type":"lead_school","isAccreditedBody":false,"urn":"137344","ukprn":"10035071","address":{"addressLine1":"Units A and B - Bourton Business Park","addressLine2":"Bourton Road","town":"Buckingham","county":"Buckinghamshire","postcode":"MK18 7DS"},"contact":{"website":"http://www.bpscitt.uk/","email":"olewis@royallatin.org","telephone":"01280 852040","fullName":"Lizana Oberholzer"},"location":{"latitude":51.9958275,"longitude":-0.9648821},"trainWithUs":"Trainees are based in school from day one, learning alongside their Mentor in the classroom. Professional Studies training takes place weekly throughout the year at our dedicated SCITT training centre in the heart of the Royal Latin School. Sessions are delivered by an expert range of speakers every Wednesday and Thursday in the first half term, followed by every Wednesday for the remainder of the course. Sessions include: Behaviour management, lesson planning, safeguarding, time management and legal obligations of the teacher. We also offer bespoke SEN training, planned in collaboration with National and Local experts.​\nTrainees have daily support from their Mentor, in addition, the Professional Tutor in school oversees their training needs and wider pastoral support. Every trainee is allocated a Quality Assurance Tutor who will visit them termly to monitor progress and ensure support is consistent and of the highest quality.","trainWithDisability":"We work closely with all students that have both physical and mental health disabilities. A team of expert welfare specialists work along side us to support our trainees. \n\nAll trainees have direct access to the welfare specialists in addition to the support we offer within the Buckingham Partnership office.\n\nWe have had trainees with various disabilities and or specialist needs in the past and we pride ourselves in always working closely with them to be able to offer the best possible service.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:48:51.034Z","updatedAt":"2021-09-16T21:34:18.489Z"}
