{"id":"945dc2da-c348-47cc-ad40-66ce17596e81","name":"Bannockburn Primary School","code":"2E2","type":"lead_school","isAccreditedBody":false,"urn":"100113","ukprn":"10078056","address":{"addressLine1":"Plumstead High Street","town":"London","postcode":"SE18 1HE"},"contact":{"website":"http://www.bannockburnprimaryschool.com/","email":"admin@teachinglondon.org","telephone":"2079321126","fullName":"Chloe Bethell"},"location":{"latitude":51.4871738,"longitude":0.0946181},"trainWithUs":"Bannockburn is a unique and diverse learning community that provides the best possible support in enabling pupils to achieve their best. The school is on two sites in Plumstead. We are a school with very high aspirations for pupils, where children are given the opportunity to achieve their very best. We pride ourselves on providing the highest quality learning experiences; we make learning fun, practical, and engaging.\nPupils and staff are highly motivated and firmly believe in learning together, in partnership with families. Pupils are given confidence and self-belief, leaving us ready to play a significant part in the local and global communities. We have an extensive menu of extra-curricular clubs and classes, including Spanish, Emerging English, Football, Netball, Theatre Arts, LAMDA, music and choir. We provide breakfast and after school clubs and offer additional support for any vulnerable groups of pupils.","trainWithDisability":"Bannockburn is a partial access school: High Street: 1 disabled toilet and no access between floors.\nManor Way: 1 disabled toilet on each floor and a lift that goes to the first floor but not all floors. Candidates with particular requirements are encouraged to get in touch.\nTeaching London: LDBS SCITT has a degree of step-free access, but as the building was a Victorian school, we are unable to fully accommodate wheelchair access. We are always willing to discuss, and where possible, adapt to meet individual needs.\nThe well-being of our trainees is paramount, which is why you will be automatically enrolled into the Employee Assistance Programme with the Education Support Partnership. This provides 24/7 individual support and counselling, in addition to our in-house advice and support.\nWe also have experience in supporting trainees with a diagnosis of dyslexia and are able to offer specialist support on the course.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:54:39.043Z","updatedAt":"2021-07-27T23:51:34.686Z"}
