{"id":"94713f9e-e25f-44b0-9817-d34ffd1e39d4","name":"Cuckoo Hall Academies Trust (CHAT)","code":"1X1","type":"lead_school","isAccreditedBody":false,"address":{"addressLine1":"Cuckoo Hall Lane","town":"Edmonton","county":"London","postcode":"N9 8DR"},"contact":{"website":"http://www.chat-edu.org.uk","email":"hr@chat-edu.org.uk","telephone":"020 8804 4126","fullName":"Maricris Cariaga"},"location":{"latitude":51.6364904,"longitude":-0.044246},"trainWithUs":"We are part of CHAT Academies, established in 2010. CHAT currently runs 5 academies in North London, educating some 2,200 pupils. Growth plans will increase this to around 3,000 by 2020. Our vision and values\nOur goal is to provide outstanding education and life changing opportunities for all our children. We want to be recognised for academic excellence and having a reputation for giving pupils the critical skills and knowledge necessary to be successful in education, employment and life.\nAcademic Excellence\nWe aspire to excellent academic results, with year on year improvements, achieved through the first-class teaching of a broad based curriculum, by highly motivated and trained staff, who are supported by strong school leadership trams, a dedicated and experienced Board of Trustees and active local governing bodies.\nPupils will succeed at our academies regardless of background. We treat all children as individuals and give them an education that prepares them for their lives ahead. Building respect and character, with principles, virtues and values, is at the heart of everything we do at CHAT.\nThe challenge to our staff\nWe will engender a core philosophy throughout our organisation to make sure every member of staff understands and feels able to play a role in the success of our academies. All staff, regardless of role or grade, have an important role to play in ensuring outcomes for children our outstanding.","trainWithDisability":"We support candidates with disabilities and other needs. For example candidates with:\n-Dyslexia\n-Physical, hearing and visual impairments\n-Mental health conditions","accreditedBodies":[{"id":"ef09ce50-ccfc-4346-a0ce-43e840153dab","code":"W20","name":"University of Warwick","description":""}],"createdAt":"2021-07-06T17:53:51.376Z","updatedAt":"2021-07-06T17:53:51.376Z"}
