{"id":"9484a380-db46-4996-8a17-57646ee92bb8","name":"The Augustine Partnership","code":"2L1","type":"lead_school","isAccreditedBody":false,"urn":"141063","ukprn":"10052836","address":{"addressLine1":"South Birmingham SCITT","addressLine2":"Solihull Sixth Form College","town":"Widney Manor Road","county":"Solihull","postcode":"B91 3WR"},"contact":{"website":"www.southbirminghamscitt.org.uk","email":"carol.lewis@southbirminghamscitt.org.uk","telephone":"1217042581","fullName":"Tony Quinn"},"location":{"latitude":52.4057992,"longitude":-1.77257},"trainWithUs":"The Augustine Partnership is committed to achieving personal and academic excellence for all students. Through the partnership we aim to develop and support future teachers in becoming the next generation of outstanding practitioners. We aim to provide new teachers with the opportunity to learn, develop and practise the skills needed to be successful in a highly supportive environment. The students' wellbeing and achievement is at the centre and drives all that we do.\nUnder the School Direct programme we work in partnership with The South Birmingham SCITT and are proud to be working together to provide an innovative and creative route into teaching. *\tPrimary and Secondary Teacher Training\n*\tSchool–Led (SCITT and School Direct)\n*\tLearn from real teachers in real classrooms\n*\t100% employment rates\n*\tBespoke programme offering high levels of support enabling you to reach your full potential\n*\tQualified Teacher Status and Post Graduate Certificate in Education (MA Level7 x 60)\n*\t1 day in training, 4 days in placement\n*\t50+ exciting and innovative schools in Birmingham and surrounding areas\n*\tStrategic partners of a number of Teaching Schools securing individuals' early career entry and opportunities into leadership\n*\t18 years’ experience training teachers\n*\tRecognised locally and nationally for strong provision\n* The West Midlands provider of Future Scholars and Researchers in Schools Programmes\n*\tHighly skilled practitioners to ensure high quality learning for the trainee *\tNQTs consistently rate us in the top 10 providers via the Good Teacher Training Guide","trainWithDisability":"A condition of your offer will be the successful completion of an Occupational Health Check to satisfy the requirements for Fitness to Teach. We endeavour to meet the needs of trainees with disabilities and you are welcome to discuss any needs or disabilities with us at any time during the application process. If you are disabled or have a specific learning difficulty, all reasonable adjustments will be made.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:52:28.905Z","updatedAt":"2021-10-04T05:50:07.236Z"}
