{"id":"94fb1806-73c6-412f-b58f-21be36b200d8","name":"Teach Central, formerly RSA Academies’","code":"26A","type":"lead_school","isAccreditedBody":false,"urn":"138505","ukprn":"10038446","address":{"addressLine1":"Milestone Lane","town":"Handsworth","county":"West Midlands","postcode":"B21 0HN"},"contact":{"website":"https://centralregionschoolstrust.co.uk/teach-central/","email":"twilson@teachcentral.co.uk","telephone":"0121 523 1960","fullName":"Teresa Wilson"},"location":{"latitude":52.5491433,"longitude":-2.0482772},"trainWithUs":"Teach Central, formerly RSA Academies' and Birmingham City University are proud to be working together to provide an innovative and creative route into teaching. We provide opportunities for you to become creative and inspirational leaders of learning, who will motivate and engage all learners, thus producing highly skilled graduate teachers who have an in-depth knowledge and understanding of teaching and learning, You will enjoy a bespoke programme of training, designed to build your confidence and subject knowledge, as well as providing you with the necessary skills to become an effective classroom practitioner. We strongly believe in school-led training because we can support you to become the very best practitioners, thus transforming outcomes for young people and bringing about positive social justice through exceptional schools. We provide one-to-one support and a comprehensive CPD programme, which ensures you are fully supported during your training year and your professional development.\nWorking within our schools, brings endless opportunities and unique benefits. There is strong encouragement and support for teachers as researchers, who are encouraged to try out new things and share their findings. Teach Central, part of Central Region Schools Trust, is led by good and outstanding schools. Our schools are located in different areas across the Midlands; we can offer training in Birmingham, Dudley, Redditch (South Birmingham), Worcestershire and Warwickshire. Our training facilities in each of our schools are leading edge and comprehensive to ensure all training needs are met. 100% trainees passed at Grade 1 and 2\nWhy train with us- https://youtu.be/4eB0wRVQvE4","trainWithDisability":"We provide one-to-one support and access to a comprehensive and tailored CPD package, which will ensure you are fully supported during your training year and for your professional development.\nTeach Central support equal opportunities in recruitment of our trainees.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"62d5803b-89ca-4e21-bb6f-5c74944c56ad","code":"B25","name":"Birmingham City University","description":""},{"id":"0ab5238e-606a-4f42-9aea-90d321ad7dc8","code":"2B3","name":"Haybridge Alliance SCITT","description":""}],"createdAt":"2021-07-06T17:48:58.480Z","updatedAt":"2021-10-05T17:45:02.404Z"}
