{"id":"95a86878-fff5-4b62-ae22-50cba5e030ed","name":"Plume Community Teaching Partnership","code":"1XB","type":"lead_school","isAccreditedBody":false,"urn":"137790","ukprn":"10035963","address":{"addressLine1":"Plume School","addressLine2":"Fambridge Road","town":"Maldon","county":"Essex","postcode":"CM9 6AB"},"contact":{"website":"https://www.plume.essex.sch.uk/teachertraining","email":"itt@plume.essex.sch.uk","telephone":"01621 854681","fullName":"Plume Community Teaching Partnership"},"location":{"latitude":51.7300098,"longitude":0.6757352},"trainWithUs":"The Plume Community Teaching Partnership consists of a consortium of schools in South Essex, all within a twenty minute drive of the Lead School, Plume Academy in Maldon.\nWorking together, we are committed to providing excellent teacher training in primary and secondary placements, developing outstanding teacher practice and supporting aspirant future leaders. Candidates must have a desire to work with young people, a passion for their subject and a commitment to raising pupil achievement.\nAs part of our successful ITT programme, candidates will receive excellent training from experienced staff working in association with TES Institute. The unique blended learning programme combines school based training and online learning materials facilitated by a network of experienced subject specialists. The training experience is also further enhanced through the organization of a number of visits to other educational establishments, such as special schools, primary schools and schools in an urban environment. We celebrate the quality of teaching and learning which takes place across the partnership. This provides excellent role models from within the teaching staff and opportunities to observe outstanding teaching. The pupils in these schools are a credit to each individual school and enjoy good relationships with their teachers to create a positive environment for learning. Each school aspires to engender an 'appetite for learning' within its pupil community, both in the classroom and within the range of extra-curricular activities it provides.","trainWithDisability":"TES Institute and Plume Community Teaching Partnership are committed to promoting access for people with disabilities and additional needs. We support and enable students with physical disabilities, sensory impairments, specific learning difficulties, special psychological needs and medical conditions that can have an impact on day-to-day activities, to participate in TES Institute programmes, as far as is reasonably practicable and within any constraints laid down by relevant professional bodies.\nTES Institute will:\n•\tEncourage applications from people with disabilities\n•\tSeek to provide information in suitable formats\n•\tAssess applicants who disclose disabilities or specific needs solely on the basis of their academic potential and suitability to train to teach\n•\tInvite applicants with a disability or specific need to contact TES Institute to discuss how their requirements can be accommodated\n•\tProvide additional support or resources at application to enable the applicant to complete the application process including attending interview where applicable\n•\tOffer additional provision to ensure no disadvantage compared with other applicants\n•\tWork towards the earliest possible assessment of needs and offer of reasonable accommodations where required\n•\tMake reasonable accommodations in assessment where applicable and without impacting the learning outcomes to be assessed\n•\tProvide educational support services as appropriate for eligible students\n•\tTake steps to encourage students with progressive conditions, or who become disabled during their programme of study, to continue their studies\n•\tPromote an inclusive environment and attitude at TES Institute and endeavour to provide appropriate training to staff where required","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:46:52.253Z","updatedAt":"2021-09-24T14:32:26.771Z"}
