{"id":"961bbfdd-f6c8-4205-8e3a-4bceacc1ed76","name":"Rushey Mead Academy","code":"1MW","type":"lead_school","isAccreditedBody":false,"urn":"141916","ukprn":"10053880","address":{"addressLine1":"Rushey Mead Academy","addressLine2":"Melton Road","town":"Leicester","county":"Leicestershire","postcode":"LE4 7AN"},"contact":{"website":"http://www.leicestershiresecondaryscitt.org","email":"AdminSCITT@rushey-tmet.uk","telephone":"0116 268 9734","fullName":"Jackie Gair"},"location":{"latitude":52.661843,"longitude":-1.111195},"trainWithUs":"School-based training provides the greatest opportunity to spend time in the classroom, learning from current practicing teachers and seeing exactly how they teach. You will find out how these experts are able to change children’s lives through their role and develop the skills required to start doing so yourself.\n\nOur course provides holistic training, covering the areas you need to feel completely prepared to enter your NQT classroom. You will cover keys stages 2 to 5 and have an in-depth knowledge of how the practices develop through these age ranges. You will complete 5 placements and spend 186 days training to become an effective and impactful teacher. During this time, you will earn both your QTS (Qualified Teaching Status) and PGCE (Post Graduate Certificate in Education) and develop your knowledge of how academic theory underpins your classroom practice. The course is tailored to your needs and you begin teaching when you are ready. This bespoke approach allows you the time required to embed the theory learned into your practice and explore how an effective teacher utilises cognitive science, pedagogical teaching strategies and experience to refine their teaching.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"yes","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"554ca5b2-7f5a-4a4a-b9a4-956bc1e880de","code":"L33","name":"Leicestershire Secondary SCITT","description":"Teachers Training Teachers and Changing Children’s Lives...\\r\\n\\r\\nLeicestershire Secondary SCITT is a school-based teacher training provider. You train in the best place to learn, in schools. In addition, you work with the University of Leicester, to gain a PGCE, so you are getting the best of both worlds; the academic rigour of a university and hands-on school-based training.\\r\\n\\r\\nIt’s a great time to train as a teacher, with significant job prospects and career progression opportunities. Trainees receive bursaries of up to £28,000, so you focus on becoming a great teacher and really changing lives!!!\\r\\n\\r\\nA great opportunity to change lives!!"}],"createdAt":"2021-07-06T17:56:29.737Z","updatedAt":"2021-09-13T15:17:54.810Z"}
