{"id":"964657c0-043a-4280-8e2a-df4210748a8a","name":"Bournemouth Poole & Dorset Teacher Training Partnership","code":"B52","type":"scitt","isAccreditedBody":true,"ukprn":"10055369","address":{"addressLine1":"The Grange School","addressLine2":"Redvers Road","town":"Christchurch","county":"Dorset","postcode":"BH23 3AU"},"contact":{"website":"www.bpdscitt.org.uk","email":"scitt@twynhamschool.com","telephone":"1202402790","fullName":"SCITT Admissions Office"},"location":{"latitude":50.741088,"longitude":-1.756336},"trainWithUs":"The Bournemouth Poole & Dorset Teacher Training Partnership is a consortium of 16 secondary schools working in close partnership. Our partnership schools extend from Swanage in the west to Lymington on the edge of the New Forest in the east. The Partnership is led by Twynham Learning, located in the historic harbour town of Christchurch. The Partnership offers a full-time one-year course running from September-July. Successful completion of this course brings with it the award of QTS (Qualified Teacher Status) with a PGCE (Post-Graduate Certificate in Education) validated by the University of Winchester A distinctive feature of the BPD course is the focus on carefully staged and appropriately supervised practical classroom experience within two secondary schools, which is further supported by academic and professional study via central training. All partner schools have experience of Initial Teacher Training and a good record of pupil progress and achievement. Currently the BPD Partnership offers SCITT training in the following subject areas: English, Mathematics, Biology, Chemistry, Physics, MFL, Design & Technology, Geography, History, Computer Science, Music, Physical Education, Art & Design, Religious Education, Business Studies, Drama & Dance/Performance. If you are looking for a training course which is grounded in practical classroom experience then the school-centred route is ideal for you.\nOur trainees have a very high success rate in completion and moving onto employment, with the majority of those gaining employment working in the local area where many gain rapid promotion.","trainWithDisability":"There is access for people with disabilities, although not all schools offering placements are able to cater for people with disabilities in all subjects due to the architecture and layout of school departments. Please contact the Partnership Office if you wish to discuss this aspect further.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:49:44.398Z","updatedAt":"2021-07-08T04:42:08.609Z"}
