{"id":"9648ada6-05fa-4f95-8370-81ec02b3be7f","name":"The Shire Foundation","code":"S25","type":"scitt","isAccreditedBody":true,"ukprn":"10046141","address":{"addressLine1":"The Shire Foundation, Hillborough Junior School, Hillborough Road","town":"Luton","county":"Bedfordshire","postcode":"LU1 5EZ"},"contact":{"website":"https://www.theshirefoundationscitt.org","email":"tmurphy@shirefoundation.co.uk","telephone":"1582522121","fullName":"Julie Darmody - ITT Training Manager"},"location":{"latitude":51.8724543,"longitude":-0.4251093},"trainWithUs":"The Shire Foundation is a well established (since 1994), school-centred teacher training provider working with primary, nursery and special schools, mainly within the Luton area. Ofsted (March 2013) judged the provision as Good with many Outstanding features. Our training in mathematics and behaviour management was in particular cited as Outstanding. Trainee course evaluations demonstrate a very high level of satisfaction. Our lead school, Hillborough Junior School has been judged to be Outstanding by Ofsted. This partnership has built up an excellent reputation in teacher training in the local area, and trainees consistently rate the quality of the course and support as very high. We have a consistently excellent NQT employment rate (95 - 100% in recent years), with a high percentage of trainees securing a teaching job within one of their placement schools.\nShire utilises a range of outstanding current primary practitioners to lead training sessions.","trainWithDisability":"Accommodation at the Hillborough Junior School base and the partner schools has appropriate disability access. Each year we work successfully with trainees with disabilities and other needs. Our personalised approach to training ensures that support and provision is tailored to each trainee's particular needs, in order to facilitate success during all aspects of the training year.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:51:09.974Z","updatedAt":"2021-09-20T18:21:52.540Z"}
