{"id":"965d27c0-e543-4729-91d5-65f039c4662f","name":"The Wonder Training School","code":"2HT","type":"lead_school","isAccreditedBody":false,"urn":"143588","ukprn":"10062312","address":{"addressLine1":"School House","addressLine2":"92 Kilnwick Road","town":"Pocklington","county":"East Yorkshire","postcode":"YO42 2LL"},"contact":{"website":"learningpartnership.education","email":"jchapman@learningpartnership.education","telephone":"1759302395","fullName":"Irie Grant"},"location":{"latitude":53.931585,"longitude":-0.765571},"trainWithUs":"At the Learning Partnership Teaching School Alliance our aim is simple: we want to inspire our teachers, trainees and children with a love of learning that lasts for life. Our people-centred approach to teacher training means that, like our pupils, you will be known and cared for as an individual. We are passionate about providing a high-quality, innovative programme that will inspire and fully equip trainees to become outstanding teachers.\nTraining with us means you will benefit from the combination of excellent teacher-mentors, substantial school-based experience in outstanding classrooms, and high quality professional studies sessions led by a team of experienced academics at Leeds Beckett University. Throughout your time with us, you will be supported and challenged to achieve your best by caring mentors who have a wealth of experience of outstanding practice. Training in our Teaching School Centre will be delivered by dedicated trainers and we will aim to provide a personalised but extensive package to get the most from your skills, knowledge and interests.\nOur Partnership prides itself on its holistic approach to the development and education of young people and teachers alike. If you share our vision and people-centred focus, we’d love to hear from you.\nPlacements are across our Partnership including in Pocklington, Melbourne, Stamford Bridge and Beverley.","trainWithDisability":"We have supported many teachers and trainees with disabilities or other needs in the past. Please get in touch to find out more about how we can support your particular needs.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:47:18.805Z","updatedAt":"2021-10-05T19:13:41.318Z"}
