{"id":"96d04bd6-9826-4863-8996-b4a213d03e56","name":"Swale Academies Trust","code":"14H","type":"lead_school","isAccreditedBody":false,"urn":"136286","ukprn":"10031371","address":{"addressLine1":"Westlands Avenue","addressLine2":"Sittingbourne","county":"Kent","postcode":"ME10 1PF"},"contact":{"email":"schooldirect@westlands.kent.sch.uk","telephone":"07496 972 623","fullName":"Elizabeth Frost"},"location":{"latitude":51.3430263,"longitude":0.7112365},"trainWithUs":"We have a long history of training teachers within the Trust and have developed a rigorous and robust training programme. This consists of a combination of practical and theoretical elements delivered by a dedicated team. We recognise that trainees come with varying levels of previous school experience and our training is therefore tailored to the individual. Those who have plenty of relevant classroom experience have the opportunity to begin teaching whole classes early on in the programme. Those with less relevant experience will receive more guidance at the beginning, to build a firm foundation on which to base their classroom practice.\nOur belief in the importance of trainees having sufficient time to work with more experienced staff means our aim is to make School Direct appointments supernumerary. This provides time for trainees to work closely with mentors and others to develop high level skills before being given full responsibility for classes.\nSwale Academies Trust is committed to safeguarding and promoting the welfare of children and young people and expects all staff to share this commitment. School Direct positions are subject to an enhanced DBS check.","trainWithDisability":"Over recent years, schools and academies have (in line with other institutions and public bodies) been working towards an improved understanding of the diverse nature of their communities. Much of the work is in response to new legislation that places an increased duty on schools, academies and other settings to tackle radicalisation and to establish a positive ethos of British Values. Legislation requires schools and academies both to eliminate direct or indirect discrimination, victimisation or harassment and to promote equalities for students, staff and others who use their facilities.\nIn our Trust we work to ensure that there is equality of opportunity for all members of our community who hold a range of protected characteristics as defined by the Equality Act 2010, as well as having regard to other factors which have the potential to cause inequality, such as, socio-economic factors.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"1165d5fd-11f4-4dab-99c9-47b309481463","code":"C10","name":"Canterbury Christ Church University","description":"Please see Canterbury Christ Church University website."},{"id":"d2ba71f2-c125-4d86-bb22-736e67043120","code":"B72","name":"University of Brighton","description":"Please see the University of Brighton website."},{"id":"4d4cceab-1516-4a6c-a9ab-5de0e32e1fe1","code":"S90","name":"University of Sussex","description":"Please see the University of Sussex website."}],"createdAt":"2021-07-06T17:53:55.099Z","updatedAt":"2021-09-21T20:00:07.932Z"}
