{"id":"96d90282-3ce7-4fc7-aa60-e03d7bf8a0f1","name":"Thorpe St Andrew School and Sixth Form","code":"1ZN","type":"lead_school","isAccreditedBody":false,"urn":"143278","ukprn":"10057638","address":{"addressLine1":"Laundry Lane","addressLine2":"Thorpe St Andrew","town":"Norwich","county":"Norfolk","postcode":"NR7 0XS"},"contact":{"website":"http://thorpestandrewschool.org.uk","email":"jgallon8nr5@yare-edu.org.uk","telephone":"1603497711","fullName":"Janet Gallon"},"location":{"latitude":52.6359148,"longitude":1.35642},"trainWithUs":"Our motto is ‘Success for All’.\nOfsted judged our school as being outstanding, providing a very positive environment for learning which successfully supports the excellent academic and personal development of our students. We are very proud that they recognised not only the outstanding academic success but also our belief that the education for each student extends far beyond this, as they grow as individuals.","trainWithDisability":"We are committed to supporting trainees with disabilities in partnership with our Accrediting Providers Suffolk and Norfolk Secondary SCITT and UEA . Please [contact](www.suffolkandnorfolkscitt.co.uk/contact) Suffolk and Norfolk SCITT directly to discuss any access requirements for the courses that we offer with them.\nUEA operates an equal opportunities policy and welcomes applications from people with disabilities. All PGCE trainee teachers must meet the Secretary of State's requirements for physical and mental fitness to teach. All candidates offered a place are required to complete a health declaration form. If this reveals a need, UEA will consider reasonable adjustments, which may include particular school placements, and other support and monitoring during the course.\n[Find out more about the information and advice available through UEA's Wellbeing Service](https://www.uea.ac.uk/uea-life/student-support/wellbeing)","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"accreditedBodies":[{"id":"d8370001-6f2b-4624-b30c-27ddc5beebfc","code":"S14","name":"Suffolk and Norfolk Secondary SCITT","description":"Suffolk \\u0026 Norfolk SCITT is one of the largest SCITTs in the country. All trainees on this course will obtain QTS and PGCE with 60 Masters’ credits on successful completion.\\r\\nOur aim is to train you not as a teacher for a specific school but as a future member of the teaching profession.\\r\\nTrainees are supported by school mentors and SCITT Tutors who have a have a wealth of experience to share with trainees. The Secondary SCITT Tuition course is a highly personalised course which offers a range of opportunities to trainees."},{"id":"b8bcaeed-f311-4867-a1e3-c0fde20809d6","code":"E14","name":"University of East Anglia","description":"UEA’s School of Education and Lifelong Learning is one of the UK’s premier centres for teaching and research in professional education and training. The School’s research has made a difference in schools across the country, influencing approaches to managing classroom behaviour, understanding students’ motivation, and creating effective communities for learning.\\r\\n\\r\\nAll of our PGCE tutors have experience of school teaching and leadership, and all are specialists in particular areas of the curriculum. UEA’s expertise, together with our partner schools, means you'll be well-supported throughout your PGCE."}],"createdAt":"2021-07-06T17:49:45.647Z","updatedAt":"2021-10-07T21:16:32.642Z"}
