{"id":"972f7d6c-496f-4c6b-873c-477e4ff2285d","name":"Felsted Primary School","code":"14R","type":"lead_school","isAccreditedBody":false,"urn":"114875","ukprn":"10072099","address":{"addressLine1":"Watch House Green","addressLine2":"Felsted","town":"Dunmow","county":"Essex","postcode":"CM6 3EB"},"contact":{"email":"admin@felsted-pri.essex.sch.uk","telephone":"01371 820215","fullName":"Lawrence Garside"},"location":{"latitude":51.8628083,"longitude":0.4517418},"trainWithUs":"Essex Primary SCITT's primary teacher training programme was recognised as outstanding in all categories by Ofsted in November 2017. Two quotes from our inspection report help to summarise what we do which is to train the very best teachers for our schools. We are 'recognised by local head teachers as providing well trained trainees who help school raise standards.' and our 'trainees make strong progress as the result of highly effective school-based and central training.' The final line of our report reads - 'typical of their comments was one trainee who said the training programme is 'the best thing I have done in my life.''\nTrainees are encouraged to make the most of every opportunity that our strong partnership of schools offers throughout this unique training year and are well supported and challenged to achieve the very best outcomes that prepare them well for the start of their teaching careers.","trainWithDisability":"Over the years Essex Primary SCITT has supported trainees with disabilities and other needs to achieve at least good and often outstanding outcomes by the end of their training by taking in to account their individual needs and tailoring their training accordingly. This includes trainees with dyslexia, dyspraxia, dyscalculia, hearing impairments, ME and other long standing illnesses who have successfully completed their training. For 2020-21 12% of our primary cohort and 5% of our EYITT cohort have disabilities.\nTrainee well-being is at the heart of all we do and we work hard to ensure that all trainees have a successful training experience with us.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"61eb688f-5816-4b91-988f-d0dde46e1c26","code":"E73","name":"Essex Primary SCITT","description":"We have worked with Essex Primary SCITT for many years. The students on this course are excellent and schools in our partnership are keen to employ students from this provider."}],"createdAt":"2021-07-06T17:53:35.994Z","updatedAt":"2021-10-05T15:59:53.651Z"}
