{"id":"97b2248c-a0d3-43e8-ae12-cd916e83b3d5","name":"Lampton Academy","code":"1P8","type":"lead_school","isAccreditedBody":false,"urn":"136341","ukprn":"10031352","address":{"addressLine1":"Lampton School","addressLine2":"LWA SCITT","town":"Lampton Avenue","county":"Hounslow","postcode":"TW3 4EP"},"contact":{"website":"http://www.lwascitt.org.uk","email":"nassi@lampton.org.uk","telephone":"020 8538 4790","fullName":"Narinder Assi"},"location":{"latitude":51.4772543,"longitude":-0.3676363},"trainWithUs":"We have been leading innovation and developing expertise in initial teacher training for 16 years and our programme is led by a team of highly expert practitioners who are also established researchers in the field of education and teacher development. Our intensive training programme is at the cutting edge, with enhanced professional studies to enable you to be creative practitioners ready for the challenges of teaching in the 21st century. This secondary programme will prepare you to teach young people in the 11-16 age phase. You will also benefit from opportunities to develop your ability to teach at sixth form level and from learning about pupil experience of the primary curriculum. Begin your journey into the profession with us!\nYou can achieve Qualified Teacher Status and a Post Graduate Certificate in Education with Masters level credits when you train with us. We offer a PGCE using the expertise of our partner Roehampton University who provide our research based subject studies.\nWe will also support you in developing your subject knowledge for teaching. Our subject mentors are effective teachers and in addition they are required to undertake a training programme, based on most effective practice, ready to support you on your entry into the profession.\nWe have an excellent employability record, with excellent employment outcomes","trainWithDisability":"Individual needs are identified through application and interview process to ensure appropriate and reasonable adjustments are made to accommodate the candidate prior to starting the course. Throughout the course trainees are assigned to one of the lead members of the central team with whom they have regular one to one check ins. This means those with particular needs can be regularly monitored and early support can be put in place where necessary and in conjunction with appropriate agencies when needed.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"4dbcd8ea-d273-432a-8aaf-02e6e6bae4de","code":"2AY","name":"Lampton LWA SCITT","description":""},{"id":"33037eab-f75d-4350-b1e2-967c41e9d4c6","code":"R48","name":"Roehampton University","description":""},{"id":"ef172d85-20e4-4aa2-96d0-9e3ae81f526d","code":"S64","name":"St Mary’s University, Twickenham","description":""}],"createdAt":"2021-07-06T17:56:31.585Z","updatedAt":"2021-09-17T22:06:20.520Z"}
