{"id":"97b7d049-ddeb-466a-af09-3277b759f3a5","name":"i2i Teaching Partnership","code":"24X","type":"scitt","isAccreditedBody":true,"ukprn":"10058582","address":{"addressLine1":"Weydon School","addressLine2":"Weydon Lane","town":"Farnham","county":"Surrey","postcode":"GU9 8UG"},"contact":{"website":"http://www.i2ipartnership.co.uk","email":"ktaylor@i2ipartnership.co.uk","telephone":"01252 725 052","fullName":"Tammy Cresswell"},"location":{"latitude":51.2025197,"longitude":-0.8146681},"trainWithUs":"The i2i Teaching Partnership is an alliance of highly successful secondary schools in Surrey, Hampshire, Middlesex and Berkshire delivering a first class highly supportive and responsive School Centred Initial Teacher Training (SCITT) programme leading to both QTS and PGCE.\nOur programme provides high quality school-led and centre-based training, enabling all trainees to develop into confident and competent professionals. Our programme will immerse you in a school setting right from the start, with expert Mentors to guide and support you. Employment rates are high, and career progression and continuing professional development is embedded into our culture.\nOur broad network of [partnership schools](http://www.i2ipartnership.co.uk/27/i2i-partnership-schools) present exciting, varied training possibilities, including six schools with a sixth form, two special needs schools, and two training hubs; Weydon School in Farnham and Reigate School in Reigate.\nAt i2i we feel that it is not just about \"what\" we do, but also \"why\" we do it. Our vision for training teachers is about ensuring that the education system in this area, and further afield, has highly skilled teachers who can support the progress, love of lifelong learning and life chances of all the young people they work with. By supporting you in your training year, and beyond, we know that you will help us achieve our vision and transform the lives of the next generation.\nWe are proud of our supportive approach and strong reputation, and invite you to visit our [website] (https://www.i2ipartnership.co.uk/) to learn more about what we believe is a truly exceptional programme.","trainWithDisability":"Our partner schools are all committed to equal opportunities. As school sites differ, those applicants with physical disabilities should contact the SCITT Administrator for details of the partner schools best suited to their needs. All our partner schools have the expertise to support applicants with learning disabilities.\nIf required, any Trainees with additional needs are given extra, appropriate support through our own Risk Assessment system. This is a confidential support mechanism, tailored to the needs of the individual.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:50:23.603Z","updatedAt":"2021-10-04T16:12:56.294Z"}
