{"id":"980b01c8-0cf3-4f9c-8896-54a2b0ae7a05","name":"Blue Kite Academy Trust","code":"2HL","type":"lead_school","isAccreditedBody":false,"urn":"142546","ukprn":"10061050","address":{"addressLine1":"Ferndale Primary and Nursery School","addressLine2":"Wiltshire Avenue","town":"Swindon","county":"Wiltshire","postcode":"SN2 1NX"},"contact":{"website":"https://thebluekitetrust.wixsite.com/inspire","email":"inspire@bluekitetrust.org.uk","telephone":"1793332425","fullName":"Sarah Jerman"},"location":{"latitude":51.5722649,"longitude":-1.7911228},"trainWithUs":"Inspire Professional Development works in partnership with North Wiltshire SCITT and Bath Spa University. We offer School Direct PGCE/QTS places for applicants wishing to train in the primary sector, in Swindon and the surrounding area. Our ITT programme has been designed to support trainees from varying starting points; whether you are new into education or if you have worked in the industry for many years. Throughout your training, you will embark on a pathway suitable to your individual professional needs, gaining invaluable experience in the classroom.\nTrain to be a teacher at Inspire Professional Development and benefit from a tailored programme of training and support from outstanding, experienced professionals. Our package will provide you with theory, subject knowledge and classroom practice. In joining our programme, you will train in two schools, across two different key stages. Our vision is to produce outstanding teachers, who are passionate in shaping the minds of young children, helping them to thrive in all aspects of education.\nThe Blue Kite Academy Trust is a growing trust with a mix of established and new schools. Our schools are vibrant, friendly places where the children are at the heart of everything we do. Our team of experienced and dedicated practitioners will be able to guide, support and help develop your professional practice. Inspire will provide you with weekly training and you will benefit from opportunities to meet with other trainee teachers, creating a valuable learning community to share ideas and practice.","trainWithDisability":"We are an inclusive organisation. All potential applicants are considered on an equal basis.\n\nWe will ensure that all candidates applying and securing a place to train with us, will be provided with, wherever possible, the means to do so, by implementing reasonable adjustments as required.\n\nWe support trainees with disabilities and other needs, including support with:\n - Dyslexia\n - Physical, hearing and visual impairments\n\nAccess for applicants with physical disabilities varies from school to school, please enquire for more details.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"5d691db0-3d77-4a57-a4a2-5392b1ed8fc1","code":"24U","name":"North Wiltshire SCITT","description":"The recommendation for QTS certification is made by North Wiltshire SCITT (NWSCITT) and the PGCE (with 60 Masters credits) is awarded by Bath Spa University."}],"createdAt":"2021-07-06T17:56:58.633Z","updatedAt":"2021-10-13T17:51:57.455Z"}
