{"id":"98454838-ceb8-4138-96a2-7effabb15f51","name":"Durham Schools Together","code":"2DP","type":"lead_school","isAccreditedBody":false,"urn":"114080","ukprn":"10072165","address":{"addressLine1":"Cornforth Lane","addressLine2":"Coxhoe","town":"Durham","county":"Durham","postcode":"DH6 4EJ"},"contact":{"website":"http://www.coxhoe.durham.sch.uk","email":"j.bartle102@durhamlearning.net","telephone":"1913770294","fullName":"Jayne Bartle"},"location":{"latitude":54.7108578,"longitude":-1.5096263},"trainWithUs":"Coxhoe Primary School is an outstanding school as rated by Ofsted and we are proud to be the lead school for Durham Schools Together. As a lead school, we work collaboratively with a further 4 strategic schools who are highly committed to providing and delivering a wide range of high quality, bespoke and innovative training. You will be part of a team from the very start where you will receive intensive support from experienced mentors and teachers. Throughout the course, you will be provided with a balance of university input where you can learn the pedagogy of teaching as well as extensive hands-on experience in schools where you will learn theory through your placements.","trainWithDisability":"We follow the University of Sunderland Diversity Statement:\n“We celebrate and value the diversity of all students and staff, working to ensure that all are welcome in our community and do not face discrimination or encounter barriers with regard to their disability. “\nThe University of Sunderland Disability Support Team provides advice, information and guidance to students with a disability; students with mental illness or mental health difficulties; students with Specific Learning Difficulty (SpLD) such as dyslexia. \nOn application please contact the Disability Support Team for disability-related queries:\nWebsite: Disability Services Email: disability.support@sunderland.ac.uk\nTel: 0191 515 2952","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"926804ac-be7a-4f0a-97f9-a26a5f5f032a","code":"S84","name":"University of Sunderland","description":"We are proud to work in Partnership with the University of Sunderland. The University has successfully trained teachers for over 100 years making a difference in educating the next generation of learners.\\r\\nThrough our partnership with the University our Trainee Teachers benefit from the support of our Primary Tutor Team who are experts in their subject fields and related pedagogies. The School of Education is world leading in research according to the latest Research Excellence Framework. Trainees are allocated a Personal Tutor from the university who will work with their School Mentor to give academic, pastoral and placement support."}],"createdAt":"2021-07-06T17:57:19.019Z","updatedAt":"2021-09-22T19:21:40.389Z"}
