{"id":"9910f3b7-6ba0-4ff7-a27c-54f5ee5df585","name":"The Rural Schools Alliance","code":"2EN","type":"lead_school","isAccreditedBody":false,"urn":"116424","ukprn":"10017713","address":{"addressLine1":"New Road","addressLine2":"Swanmore","county":"Southampton","postcode":"SO32 2RB"},"contact":{"website":"https://ruralschoolsalliance.co.uk/","email":"school.direct@swanmore-sec.hants.sch.uk","telephone":"1489892256","fullName":"School Direct Administrator"},"location":{"latitude":50.9394981,"longitude":-1.1876984},"trainWithUs":"The Rural Schools Alliance is a Teaching School Partnership comprising six Hampshire secondary Schools, all Ofsted rated \"Good\" schools who have been recognised for our drive and determination to deliver high quality comprehensive education, whilst observing, celebrating and actively promoting traditional values.\nOur partnership covers vasts belts of rural communities across the county of Hampshire, whilst remaining accessible to the key urban areas of Andover, Fareham, Waterlooville, Winchester, Southampton and Portsmouth.\nAll student teachers are initially registered for the Professional Graduate Certificate in Education (PGCE). This is a course of 120 credits at Level 6. In December, student teachers may apply to be registered on the Postgraduate Certificate In Education (PGCE-M) where up to 60 M-level credits can be gained from subsequent work. Therefore the PGCE-M will result in 60 credits at Level 6 and 60 at Level M. All students completing the School Direct course will also gain NQT (Newly Qualified Teacher) status.\nOur accredited provider is the University of Winchester which is recognised by Ofsted as an 'Outstanding' provider of teacher education at both primary and secondary level and has a long history of training teachers.\nEducation should be fun, awe-inspiring, life-changing and life-enhancing: it should be borrowed and nurtured by a generation to pass on boldly and proudly to the next.\nThis is the ethos that underpins the Rural Schools.","trainWithDisability":"We are committed to supporting pupils and staff with specific needs and are committed to creating a community that recognises and celebrates difference within a culture of respect and cooperation. We are a wheelchair friendly site.\nYour well-being is a top priority and we will do all we can to give you the chance to flourish and maximise your potential. In partnership with the University of Winchester there is a dedicated student support team to help with any questions or challenges you might experience during your studies. We work with you to support your well-being and mental health, provide confidential advice and offer workshops to boost your academic skills. If you have a disability or learning difference, we encourage you to get in touch before you apply so we can discuss tailored support for your individual needs.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:51:20.814Z","updatedAt":"2021-10-04T14:34:41.497Z"}
