{"id":"99185cf6-08b6-4194-8ca4-626a89f3b107","name":"The Roseland Academy","code":"4B2","type":"lead_school","isAccreditedBody":false,"urn":"136572","ukprn":"10033262","address":{"addressLine2":"Tregony","town":"Truro","county":"Cornwall","postcode":"TR2 5SE"},"contact":{"website":"www.theroseland.co.uk","email":"ITE@theroseland.co.uk","telephone":"1872530583"},"location":{"latitude":50.2715266,"longitude":-4.9064038},"trainWithUs":"The Roseland Academy is the highest performing school in Cornwall, one of the highest non-selective state schools in the South West. It has been in the top 100 of schools nationally since 2015. The Roseland Academy achieved the designation of ‘Outstanding’ in all categories in the 2017 Ofsted inspection. The Roseland Academy is part a Trust comprising three secondary schools and two primary schools. The Roseland Academy, as a lead school for school direct programme, and Cornwall SCITT, the accredited body, are established and successful organisations. At The Roseland Trust (TRT) our vision is to inspire a love of learning within environments that are happy, respectful and challenging, where everyone feels valued and able to reach their full potential. Your mentor will be experienced colleagues supporting you on your learning journey. You will access the central Education + Profession Studies Programme (EPS). Also, the professional studies programme in your placement will be extensive and personalised, featuring a Trust-wide input from dedicated colleagues sharing outstanding practice. You will be able to develop strategies related to the latest educational developments and research. At TRT we never stay still and continue developing quality first teaching for all students. When training with TRT you will also access Trust-wide CPD. You will forge links with colleagues across the Trust and deepen your competencies. The Roseland Academy is a designated Teaching School Hub for East Cornwall and with us you will explore opportunities for your development to navigate your future professional journey.","trainWithDisability":"The Roseland Trust (TRT) is founded on the principles of equality and inclusion. Our leadership teams, all our staff, including professional tutors and school-based mentors strive to ensure the best possible outcomes for all student teachers. Prior to the start of the course all student teachers undertake a health and physical capacity to teach check. The Roseland Trust collaborates very closely with Cornwall SCITT to maintain the equality and inclusion throughout the entire course of the training.\nFor those with additional learning needs, every student teacher receives bespoke support from a dedicated academic tutor who can provide support with assignment writing. Students can also access additional support through Student Finance's Disabled Learning Allowance Scheme. We carefully select placement schools for those with physical needs to optimise any reasonable adjustments that may be required. Mentors and subject leaders can provide support to those with visual and hearing difficulties to develop impairment-friendly strategies within the classroom.\nOur personalised approach to learning allows those with mental health needs to develop their practice with support from the central management team. We offer an empathic dialogue to provide an appropriate balance of support and challenge throughout the programme.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-08-18T03:50:43.456Z","updatedAt":"2021-10-14T20:22:16.226Z"}
