{"id":"992b9d4a-bdcf-44e8-9296-fb1fe3bb3315","name":"University of Bristol","code":"B78","type":"hei","isAccreditedBody":true,"ukprn":"10007786","address":{"addressLine1":"University of Bristol","addressLine2":"School of Education, 35 Berkeley Square","town":"Bristol","county":"Bristol","postcode":"BS8 1JA"},"contact":{"website":"http://www.bristol.ac.uk/education/students/ite/","email":"pgce-admissions@bristol.ac.uk","telephone":"0117 3314492","fullName":"School of Education"},"location":{"latitude":51.4584172,"longitude":-2.6029792},"trainWithUs":"Our Partnership offers subject-specialist training in 8 secondary subjects. We are currently rated ‘Outstanding’ by Ofsted and our programme was ranked in the Top 5 of the Good Teacher Training Guide 2017. As a designated 11-19 provider you are guaranteed experience of A level teaching as part of your programme. Our curriculum is ambitious, research-informed and carefully planned to ensure that you develop an excellent understanding of how to teach your specialist subject as well as of generic areas such as behaviour management and working with pupils with SEND. Throughout the year, you will be supported by a subject specialist university tutor, as well as dedicated mentors in partnership schools. The support that we offer is highly praised by our student teachers, and last year, 98% of student teachers rated the quality of their training with us as good or very good. You are also able to take advantage of being part of a research-intensive university with access to cutting edge research in areas such as neuroscience and education. As part of the University’s Green Apple Project, we encourage our student teachers to focus on ‘sustainable education’ for the future. Typically, over 50% of those qualifying with us choose to remain in the Bristol area and many secure teaching posts within our partnership schools. Our student teachers often progress quickly in their careers, taking on roles such as subject leader and head of year. A number have gone beyond this, joining senior leadership teams.","trainWithDisability":"We welcome applications from candidates with disabilities and other needs and, within the context of University of Bristol support structures, we make reasonable adjustments to ensure that the programme is accessible to all. When a specific need is declared, offer holders are assessed by the University’s Occupational Health department and recommended to liaise with our Disability Service to ensure a Learning Support Plan can be put in place\nMany lectures are audio-recorded and are made available via our VLE. When possible, lecture slides and handouts are made available to the whole cohort at least 24 hours in advance of the session. All University buildings are accessible including ramp/lift access. In cases where student teachers are required to move around the University campus to attend lectures, provision is made to support them, as appropriate. The University works closely with placement schools to ensure that needs are met whilst on teaching practice. For example, a student teacher with hearing disabilities was placed in a school that could provide carpeted classrooms\nThe University has a comprehensive support structure to support students with a wide range of medical conditions, including mental health. This includes support from the University Tutor, the Senior Tutor and Programme Director, Professional Services staff as well as department-based Student Welfare Advisors. If appropriate, student teachers can be referred to the University’s specialist Counselling Service or Occupational Health team. Further information on student wellbeing can be found here: [Student health and wellbeing] (http://www.bristol.ac.uk/students/wellbeing/)","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"createdAt":"2021-07-06T17:47:27.075Z","updatedAt":"2021-09-14T20:53:48.518Z"}
