{"id":"992ef501-0c7a-45de-b5cb-6747af563dcb","name":"City Excellence in Teaching","code":"1CW","type":"lead_school","isAccreditedBody":false,"urn":"143629","ukprn":"10061562","address":{"addressLine1":"Mulberry School for Girls, Richard Street","addressLine2":"Commercial Road","town":"London","county":"Greater London","postcode":"E1 2JP"},"contact":{"website":"http://www.cityexcellenceinteaching.co.uk/","email":"cet@mulberryschoolstrust.org","telephone":"2077906327","fullName":"Jo Skelhorne"},"location":{"latitude":51.5143568,"longitude":-0.0602177},"trainWithUs":"City Excellence in Teaching is an innovative school-based initial teacher education (ITE) programme devised and facilitated by a cluster of fifteen schools with an excellent history of high quality ITE provision. We offer you the experience of working within a thriving and successful inner city context. Our schools are mostly in Tower Hamlets with one school in Southwark and another in Greenwich. We work in partnership with UCL Institute of Eduction, Kings College London and EQualitas who we register our school direct trainees with, and with whom you will gain your accreditation. We work with different providers for different subjects and phases in order to ensure the highest quality provision. Our mission is to ensure high quality teacher education with a specific focus on teaching in a global inner city context. We are incredibly proud of the education we provide for young people in Tower Hamlets and are keen to work with trainee teachers who share our passion and commitment to ensure the best for inner city children. We offer supplementary training through our ‘Enhanced Professional Studies’ programme. This is an addition to training provided by your placement school and our partner HEIs and SCITT. These sessions bring trainees together from across our cluster and builds a network of professionals who have chosen to begin their career in inner London. We ensure that you are prepared to meet the challenges, and make the most of the opportunities, that this unique context brings. For more information please see our website: www.cityexcellenceinteaching.co.uk","trainWithDisability":"The central aim of City Excellence in Teaching is to provide the highest quality training experience for all in order to secure the best experience for all participants and as a consequence ensure the best educational opportunities for all pupils. As such, we are committed to an Equal Opportunity policy which enables all trainees to feel secure and confident, and to succeed to the best of their abilities.\nCity Excellence in Teaching has a commitment to placing the promotion of equality and diversity at the centre of every aspect of its work. We will implement all legal and local requirements, but also go beyond this to ensure our trainees needs are met. If you would like to discuss specific needs with us, then please do contact us at cet@mulberryschoolstrust.org","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:53:52.815Z","updatedAt":"2021-10-12T21:07:16.305Z"}
