{"id":"99d7311e-6bc7-4ef3-a36b-72a3ff429155","name":"Durham SCITT","code":"D87","type":"scitt","isAccreditedBody":true,"ukprn":"10067657","address":{"addressLine1":"The Work Place","addressLine2":"Heighington Lane","town":"Newton Aycliffe","county":"Co Durham","postcode":"DL5 6AH"},"contact":{"website":"www.durhamscitt.co.uk","email":"info@durhamscitt.co.uk","telephone":"01325 308918","fullName":"Mr M Longstaff"},"location":{"latitude":54.596066,"longitude":-1.5756916},"trainWithUs":"Durham SCITT has been training teachers since 2005. It’s the personal attention we give to our trainees which makes this a great place to learn. We pride ourselves on the personal approach. We know there is no such thing as a “typical trainee” so we don’t provide a one-size-fits-all course. We will help you to grow and become a great teacher. Our secondary Subject Specialist programme (SSP) was recognised by Ofsted as outstanding and highly innovative practice.\nSecondary trainees will have the opportunity to gain experience in 11-16/11-18 comprehensive schools/academies; special schools (EBD); a school with BESD status; Sixth Form colleges and primary schools. Trainees undertake substantial placements in at least 2 Partnership Schools. On each main placement you will be allocated a Subject Tutor and a School Tutor who will support and guide you through the school based training. We have 2 primary hubs; 1 based in St Michael's, Bishop Middleham and 1 based in Benedict Biscop Academy, Sunderland. Primary trainees will be allocated a 'home school' but will also do a second placement in one of the other primary partnership schools. On each placement you will be allocated a Mentor who will support and guide you through the school based training. All trainees have access to our purpose built learning centre in Newton Aycliffe. High quality trainees, impressive employment rates and effective partnerships with schools, mean we are in the position to offer outstanding teacher training.","trainWithDisability":"Durham SCITT prides ourselves on the personal approach and fully supports candidates with disabilities during the interview process and throughout the course. Corazon Health Service provides an assessment and advisory service on the occupational health aspects of trainees. As part of the recruitment process, you will be required to complete a health questionnaire and, if any needs are identified, will be followed up. Any necessary recommendations will be put in place. All of our buildings are fully accessible.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:56:20.321Z","updatedAt":"2021-08-05T19:46:36.982Z"}
