{"id":"9aa67012-b776-4027-89f4-5531efb3a9d2","name":"University of Gloucestershire","code":"G50","type":"hei","isAccreditedBody":true,"ukprn":"10007145","address":{"addressLine1":"University of Gloucestershire","addressLine2":"Pittville Campus","town":"Cheltenham","county":"Gloucestershire","postcode":"GL52 3JG"},"contact":{"website":"http://www.glos.ac.uk","email":"teachertraining@glos.ac.uk","telephone":"01242 714510","fullName":"PGCE Admissions"},"location":{"latitude":51.9057022,"longitude":-2.0806661},"trainWithUs":"At the University of Gloucestershire, practice in the School of Education and Humanities is based on a clearly defined set of values; the transformational potential of education, the centrality of social justice to our actions, the value of community and a belief that diversity enriches learning. We are committed to helping our trainee teachers to take the next step in their education so that together we can make a difference in the lives of others.\nBased at the historic Francis Close Hall campus, just a few minutes’ walk from Cheltenham town centre, we have been making a significant contribution to education for over 150 years. Leading the way in high quality research, teaching and professional education, we have earned an excellent reputation in terms of student satisfaction and our graduates are caring and successful.\nIf you engage with us as an aspiring teacher, you will become part of a close-knit community characterised by exceptional support, specialist subject expertise and a network of diverse schools for first-rate placement opportunities. The University of Gloucestershire is committed to safeguarding and promoting the welfare of children and expects all our trainees to share this commitment.","trainWithDisability":"The disability, dyslexia and learning support service offers confidential, one-to-one support to students with disabilities, learning difficulties and medical conditions. We can help with:\n* advisory visits to the university before you submit your application\n* advice on diagnosing specific learning difficulties, such as dyslexia, dyspraxia or dyscalculia\n* support with applying for the Disabled Students’ Allowance (DSA) * advice on disability access\n* awareness training\n* liaison with academic staff and student services regarding support needs\nThe university’s halls of residence have accessible rooms at all facilities. These rooms tend to be larger than other rooms in halls with enhanced bathroom facilities and flexible interiors to suit the level of need required.\nLocal buses provide low-level access for people with mobility difficulties. Some disabled students may also be entitled to an accessible parking permit. There are accessible parking bays on each campus.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:47:41.700Z","updatedAt":"2021-09-30T19:05:28.904Z"}
