{"id":"9ba5c3cb-fe1f-4fff-94a6-cad7a40fdb4b","name":"Stourport SCITT","code":"S95","type":"scitt","isAccreditedBody":true,"ukprn":"10058732","address":{"addressLine1":"Wyre Forest House","addressLine2":"Fine Point Way","town":"Kidderminster","county":"Worcestershire","postcode":"DY11 7WF"},"contact":{"website":"http://www.stourportscitt.com","email":"fgreen@saet.co.uk","telephone":"01562 542574","fullName":"Mrs Sara Peace"},"location":{"latitude":52.35985,"longitude":-2.269717},"trainWithUs":"Welcome to the Stourport School Centred Initial Teacher Training (SCITT) programme (code S95).\nYou have chosen to be part of the next generation of teachers, shaping the future of our young people. Teaching and learning is our core business and we are excited to share our knowledge with you, so you are fully prepared to teach!\nBeing a SCITT is very important to us. We apply cutting edge approaches to teaching and learning - rather like being a teaching hospital. Not only do we constantly explore new ideas and techniques for making learning exciting, engaging and fun, we also train you to be the teachers of tomorrow. The teachers in our schools are trained as mentors - guiding, supporting and assessing trainee colleagues as they move towards achieving Qualified Teacher Status and a PGCE. We work with a number of local secondary and primary schools to provide an experience like no other.\nWhy train to be a teacher with Stourport SCITT?\n- Comprehensive training and support programme\n- Outstanding employment rate\n- Receive a tax free bursary for many subjects\n- Work hand in hand with local schools across Worcestershire, Herefordshire and Shropshire","trainWithDisability":"We are a wholly inclusive training provider. We have worked with and supported trainee teachers with a range of needs and disabilities. We pride ourselves on meeting individual needs with a bespoke support package and mentoring guidance. Each trainee will be assessed on a individual basis. Your health and well being is most important to us. We are proud of the occupational health and wellbeing support we provide.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:57:08.315Z","updatedAt":"2021-09-10T22:09:25.944Z"}
