{"id":"9be9f611-2d36-431a-9109-7fcbbfc88fc8","name":"University of Cumbria","code":"C99","type":"hei","isAccreditedBody":true,"ukprn":"10007842","address":{"addressLine1":"Admissions Office","addressLine2":"(Lancaster Carlisle London)","town":"Fusehill Street, Carlisle","county":"Cumbria","postcode":"CA1 2HH"},"contact":{"website":"http://www.cumbria.ac.uk","email":"pgadmissions@cumbria.ac.uk","telephone":"0845 606 1144","fullName":"University of Cumbria"},"location":{"latitude":54.890876,"longitude":-2.922234},"trainWithUs":"We are the University of Cumbria, where people are at the heart of all we do. We inspire, engage and add value to people’s lives: we know the things we teach will be the things that change lives. The university was recently ranked 28th out of 131 higher education institutions in the student-informed survey ‘WhatUni’; the university has increased its standing annually since 2015. Our focus on providing our students with the skills and real-life work experience means nine out of ten of all of our graduates are employed or in further study within six months of graduation, and of those, 82% are in graduate-level jobs or study. These accolades make us one of the fastest improving universities in the UK.\nOur lecturers have a wealth of school experience, many still practising in school, and lead internationally significant research, which means our students get to explore the very latest thinking in their subject. As one of the leading providers of education courses and School Direct partnerships in England, we are at the leading edge of teacher education, working with more than 20 school alliances to give our students the option to spend the majority of their teacher training in a real school setting.\nHere at the University of Cumbria, lives are enriched so individuals can become the world changers of tomorrow; a place where you can find your calling, your career and find your place. Find out more (www. cumbria.ac.uk)","trainWithDisability":"We will ensure you have everything you need to succeed, supporting you to be your best. We are open and believe that everyone has the right to learn. We are committed to widening participation and provide a range of services to enable those with disability or specific learning difficulty (SpLD) to access their chosen course, including adjustments to formal timed examinations, digital recorders, assistance in the library and an individualised disability/SpLD action plan. Access to a range of non-medical help services such as practical support, note taking, specialist mentoring and study skills is also offered. Counselling and therapy can give you time to explore what is going on in your life in a safe setting. Our Psychological Wellbeing Service incorporates counselling, therapy and mental health mentoring. Our psychological therapists offer confidential support and advice on a wide range of issues including how to access services provided by the NHS and Social Services, as well as support for disabled students.\nAll of our campuses have accessible learning and teaching spaces and adapted residential accommodation. The university provides a variety of assistive software and has collated more than 100 free accessibility apps for general use, and provides specialist hardware such as larger keyboards and mice, and adjustable height desks. We provide a supportive and nurturing environment where we know you as an individual, not a number, ensuring you are treated equally, fairly and with respect, whatever your needs.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"createdAt":"2021-07-06T17:48:14.360Z","updatedAt":"2021-07-30T21:13:23.349Z"}
