{"id":"9c34b3ce-eec7-4e5c-ab35-be2d85eb9355","name":"Arch Alliance - All Souls’ CE Primary","code":"1XK","type":"lead_school","isAccreditedBody":false,"urn":"105811","ukprn":"10068561","address":{"addressLine1":"C/O All Souls’ CE Primary School","addressLine2":"Rye Street","town":"Heywood","county":"Greater Manchester","postcode":"OL10 4DF"},"contact":{"website":"http://www.allsoulsce.rochdale.sch.uk/","email":"lpearson@allsoulsce.rochdale.sch.uk","telephone":"01706 360027","fullName":"Edge Hill University & Arch Teaching All"},"location":{"latitude":53.597134,"longitude":-2.2053874},"trainWithUs":"The Arch Alliance comprises of two outstanding primary teaching schools based in Heywood, Rochdale. All Souls’ Church of England Primary School leads the school direct partnership in conjunction with Edge Hill University. The Arch Alliance offers a one year School Direct with PGCE route into primary teaching and we are committed to providing quality teachers for our pupils.\nWith a proven track record in delivering excellent teacher training the Arch Alliance offers a more personalised approach to your school based training. We are a National Teaching School and have an excellent Professional Development Programme which we encourage all trainees to access during their training year. This commitment to your professional development does not end with your PGCE training; we continue to be committed to supporting your teaching career. Our former trainees can access bespoke training as they develop into effective teachers and progress to leadership at all levels, should they so wish.\nOur partnership of primary schools provide a diverse range of teaching experiences for our trainees. All of our schools are based in the Rochdale area and their Head Teachers work collaboratively to ensure we have outstanding teachers in our local schools. We currently have thirteen primary schools within our partnership and we are proud to say that six of our schools are Ofsted graded ‘Outstanding’ proving excellence is at the heart of everything we do.","trainWithDisability":"The Inclusion Team provide information, guidance and support to applicants and students who have disclosed any of the following: Autism Spectrum Conditions (ASC), Mental Health, Sensory Impairment, Mobility difficulties or a medical condition e.g. Epilepsy, Diabetes, Heart Condition, Asthma and we work closely with academic and support staff across the University. We encourage disabled applicants to make contact with us early in the application process to enable us to plan for support you may need right from start of your university course. We provide a friendly and professional service and applicants and students can discuss individual requirements in complete confidence. Our highly experienced team are here to advise you about:\nImpact of disability/health condition and potential impact on study\n•\tSupport available including 1-1 sessions, group support and study skills sessions\n•\tThe benefits of a Student Support Plan\n•\tDisabled Students Allowance (DSA) and eligibility\n•\tReasonable adjustments to support your study\n•\tExam modifications and alternative assessments\n•\tRights and Responsibilities\n•\tSupport whilst on placement (e.g. access and transport)\n•\tDisclosure and Confidentiality\n•\tRights and Responsibilities\n•\tPEEPs and Emergency Action Plans\nOne of our priorities is to ensure safe environment for all students. If you have Epilepsy, Diabetes, Asthma or another serious health condition, which may require First Aid, we strongly recommend that you complete one of our Emergency Action Plans. We can discuss this with you when you come to see us.","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"d8c030de-91f2-420d-9ff7-4286c7f913fa","code":"E42","name":"Edge Hill University","description":"Edge Hill University is ranked as Gold in the Teaching Excellence Framework (TEF), the government’s evaluation of excellence in teaching quality, learning environment and student outcomes. The Faculty of Education has a national reputation for the delivery of high quality Initial Teacher Training. \\r\\nThe PGCE will train you to teach across the 5-11 age range in Key Stages 1 and 2 and achieve the Teachers’ Standards. You will receive a high quality training experience and learn the latest approaches and strategies necessary to fully prepare you for your first year as a Newly Qualified Teacher (NQT)."},{"id":"812b70c4-7fc4-46fc-975b-3e4d00f77dc4","code":"M40","name":"Manchester Metropolitan University","description":"Manchester Met has experience of developing education professionals for over 100 years.\\r\\nThe faculty work in partnership with over 1,500 regional schools, colleges and a range of other settings across the education, community, charity, arts and business sectors. The Faculty is also home to a UK leading Education and Social Research Institute (ESRI), an internationally recognised centre of excellence for applied educational research and evaluation\\r\\nDesigned for graduates and professionals with knowledge across a variety of educational settings, our courses focus on education as a multi-layered and challenging field of study."}],"createdAt":"2021-07-06T17:52:01.270Z","updatedAt":"2021-10-01T22:57:44.613Z"}
