{"id":"9c4f2fd2-2049-4a64-b9f9-ca4a155d2377","name":"Agnus Dei Catholic Schools","code":"2BD","type":"lead_school","isAccreditedBody":false,"urn":"102787","ukprn":"10006280","address":{"addressLine1":"Boleyn Road","addressLine2":"Forest Gate","town":"London","postcode":"E7 9QD"},"contact":{"email":"agnusdei@stbons.org","telephone":"0208 472 3844","fullName":"Katie Smith"},"location":{"latitude":51.5388875,"longitude":0.0245491},"trainWithUs":"Agnus Dei Teaching Schools’ Alliance is an outstanding place to work and learn. It provides a supportive and tailored learning opportunity in partnership with St Mary’s University, University of East London, Roehampton University and the Institute of Education (UCL).\nThe Alliance is a partnership of 15 Catholic secondary schools across South, East, North East London, and Essex, many of whom have achieved an outstanding rating and all of whom have considerable experience of training teachers. Our staff are professional and talented practitioners who regularly share their knowledge, skills and expertise with trainee teachers in their own schools and across the Alliance. Our partnership of secondary schools is led by St Bonaventure’s School and incorporates the following schools:\n-Bishop Challenor Catholic Federation\n-Brentwood Ursuline Convent High School, Brentwood\n-Cardinal Pole, Hackney\n-De La Salle, Basildon\n-Holy Family, Walthamstow\n-New Hall Independent School, Chelmsford\n-Notre Dame School, Southwark\n-Sacred Heart of Mary, Upminster\n-St Angela’s Ursuline School, Forest Gate\n-St Benedict’s College, Colchester\n-St John’s, Chigwell\n-St John Payne, Chelmsford\n-St Thomas More, Leigh-on-Sea\n-The Campion School, Upminster\n-The Palmer Catholic Academy, Seven Kings\n-Ursuline Academy, Ilford\nOur vision is that staff and students feel valued, experience success and enjoy learning. We aim to recruit, train and retain the very best Catholic school teachers and develop them into the best Catholic school leaders. Our programme is open to applicants from all faiths, not just Catholics but we expect applicants to be sympathetic to the Catholic ethos of our partner schools.","trainWithDisability":"UCL:\nSchool Direct students are entitled to support from the UCL Student Support and Wellbeing (SSW) team. You can find more information here:- (https://www.ucl.ac.uk/students/disability-support) Roehampton:\nThe University of Roehampton welcomes students with disabilities and offers flexible support services tailored to your needs. Our Disability and Dyslexia Services are on the main campus, Digby Stuart, along with our Access Centre: Access@SW15.\nFor more information on support for students please see here: (https://www.roehampton.ac.uk/disability-services/) St. Mary's:\nSt Mary's aims to provide an inclusive environment for all students, including students with additional support requirements.\nWe offer advice and support to our students who have requirements as a result of a disability, mental health condition, specific learning difficulty (such as dyslexia), medical condition or temporary disability, such as injury.\nFor more information about student support please see here:\n(https://www.stmarys.ac.uk/student-support/wellbeing/dyslexia-and-disability/registering.aspx) UEL:\nThe Disability & Dyslexia Team provides a completely confidential service and any information such as diagnostic reports, medical evidence or DSA Needs Assessments that are received on your behalf will be held confidentially in line with the University’s Data Protection Policy.\nFor more information on training with disabilities and other needs please go to: (https://www.uel.ac.uk/undergraduate/studentsupport/disability/arrange-support)","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"accreditedBodies":[],"createdAt":"2021-07-06T17:57:10.658Z","updatedAt":"2021-11-02T23:00:20.378Z"}
