{"id":"9cc75795-727f-4b1a-9e01-f01f7c024bbd","name":"Bingley Grammar School Direct","code":"2BP","type":"lead_school","isAccreditedBody":false,"urn":"107439","ukprn":"10000697","address":{"addressLine1":"Bingley Grammar School","addressLine2":"Keighley Road","town":"Bingley","county":"West Yorkshire","postcode":"BD16 2RS"},"contact":{"website":"http://www.bingleygrammar.org/","email":"schooldirect@bingleygrammar.org","telephone":"1274807700","fullName":"Ben McGregor"},"location":{"latitude":53.8559904,"longitude":-1.8461186},"trainWithUs":"Bingley Grammar School is steeped in history, a large, friendly comprehensive school with students from all backgrounds as a school of first choice. It is one of the lead schools in the Bradford Birth to 19 SCITT, with a proud tradition of educating young people and Teachers of the future.\nSchools Direct offers a different way of training to become a teacher. Learn by listening to and observing good and outstanding teachers. Training involves practising your teaching skills with groups of students. Supported effectively by a school mentor, you are treated as a member of the school staff, someone the school is often looking to potentially employ. This route ensures you are working in your class from day one of the course.\nWe aim to train the next generation of outstanding teachers. We are committed to providing the highest standard of education for our young people. We are keen to recruit student teachers who share the same commitment. If you share our vision for education, we want to hear from you. We will provide highest quality training, delivered by outstanding practitioners through a bespoke training package, to make the most of your knowledge and skills. After a year's successful training, you will achieve Qualified Teacher Status. As a School Direct Lead School, we are committed to helping you develop professionally, beyond your training and Early Career Framework programme by means of an extensive programme of Continuing Professional Development opportunities.","trainWithDisability":"We believe that teachers with disabilities, make an important contribution to schools both in the classroom and in shaping the wider culture and ethos of the schools they work in.\nWe adhere to The Equality Act 2010 and Special Educational Needs and Disability Act 2001, which require teacher training providers to ensure they are not discriminating against applicants with disabilities or special educational needs (SEN).\nAll our partner Schools value diversity and the unique contribution that all their staff and trainees bring.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"58e814cb-bf42-4d3d-9486-b3ea827fd9e2","code":"259","name":"Bradford Birth to 19 SCITT","description":"We believe that teachers with disabilities, make an important contribution to schools both in the classroom and in shaping the wider culture and ethos of the schools they work in. We adhere to The Equality Act 2010 and Special Educational Needs and Disability Act 2001, which require teacher training providers to ensure they are not discriminating against applicants with disabilities or special educational needs (SEN). All our partner Schools value diversity and the unique contribution that all their staff and trainees bring."}],"createdAt":"2021-07-06T17:50:37.295Z","updatedAt":"2021-09-30T20:45:13.791Z"}
