{"id":"9cee8e15-050e-425c-83e6-ad4aa549729f","name":"South Thames Early Education Partnership & Goldsmiths University (STEEPtsa)","code":"21K","type":"lead_school","isAccreditedBody":false,"urn":"100668","ukprn":"10002718","address":{"addressLine1":"Chelwood Nursery School","addressLine2":"Chelwood Walk","town":"Brockley","county":"London","postcode":"SE4 2QQ"},"contact":{"website":"www.steep.org.uk","email":"STEEPcontact@gmail.com","telephone":"020 7639 2514","fullName":"Nikki Oldhams"},"location":{"latitude":51.4566562,"longitude":-0.1905644},"trainWithUs":"The South Thames Early Education Partnership are six like-minded London Nursery Schools sharing principles of practice, but unique in identity.\n\n- Our shared understanding of pedagogy and principles guides our early years practice with children and their families.\n\n- With Goldsmiths have co-constructed a teacher education program to specialise in the teaching of children early years of their education.\n\n- Proud of our secure and established Early Years specialism, and the high level of expertise and experience amongst our staff; teachers, nursery nurses and support staff. \n\n- We share a passion for the importance of putting the needs of the children first and ensuring high quality early education for all our children.\n\n- We know from experience that children thrive and achieve when the staff who work with them are specialist early years practitioners, who are well qualified in this field and have high levels of expertise, a robust understanding of the development of young children, a knowledge of how young children learn most effectively, and a tireless commitment to put the needs of the child and family, at the heart of their work.\n\n- Committed to well qualified children's workforce we are proud to play our part in training the teachers and support staff of the future\n\n‘ there cannot be a compromise on quality and we must be relentless in our desire to improve experiences for young children.’\nCathy Nutbrown in her review of Early Education and Childcare Qualifications.","trainWithDisability":"STEEP and Goldsmiths University are committed to supporting students, and will make reasonable adjustments to allow you to concentrate on your academic studies and support your independence.\nGoldsmiths has a dedicated Disability Team, which is part of Student\nServices. The team is responsible for the co-ordination of support for\ncurrent and prospective disabled students. The Goldsmiths campus is accessible to students with limited mobility.\nSTEEP works in partnership with Goldsmiths to make reasonable adjustments to allow students with additional needs or disabilities to participate in Initial Teacher Training and to access their placement schools.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"049fe65f-08dc-4686-9ac8-606dce490128","code":"G56","name":"Goldsmiths, University of London","description":"Goldsmiths have a strong pedigree in teaching practice – training teachers since 1904 – and have gained recognition from Ofsted for our ‘outstanding contribution’ to widening participation in Initial Teacher Education. This means that as a student here you have the chance to start or continue your studies into primary and secondary teaching including PGCE through a range of routes.\\r\\n\\r\\nYou will be encouraged to be reflective in your learning and engaging in research, and take \\u2028part in conversations that inform group learning, so you can explore education not just from afar but in relation to your own experience."}],"createdAt":"2021-07-06T17:54:15.168Z","updatedAt":"2021-10-06T20:18:40.487Z"}
