{"id":"9d175761-732d-477a-b9dd-0d85e70db7ef","name":"St James’ Partnership","code":"1VN","type":"lead_school","isAccreditedBody":false,"address":{"addressLine1":"Old Jamaica Road","town":"Bermondsey","county":"London","postcode":"SE16 4SU"},"contact":{"website":"http://stjamesschoolbermondsey.com","email":"headteacher@st-james.southwark.sch.uk","telephone":"2072373111","fullName":"Helena Moore"},"location":{"latitude":51.4974031,"longitude":-0.0679291},"trainWithUs":"St James’ C of E Primary, based in Bermondsey, is the Lead School for the St James’ Partnership. We aim to offer bespoke training to suit each trainee teacher in order to provide a great start to their teaching career. Throughout our School Direct programme, you will be based in our school or one of our partner schools, gaining first-hand experience of life as a teacher. Supported by your mentor and training sessions, you will develop your own teaching practice so that you are fully prepared to start your teaching career. Our training sessions are all based in schools, delivered by current practitioners and educational consultants, and we work with you, the trainers and mentors to ensure that they have direct impact on the teaching and learning in your classroom. Engaging with research is a celebrated method of improving teaching practice and this is promoted through your own small research project which you undertake in the final term of your training.","trainWithDisability":"We look to support candidates with disabilities and other needs, however the lead school and some of our partner schools are based in 3+ storey, Victorian buildings without lifts.","accreditedBodies":[{"id":"d6961000-f4b7-41cb-9dbd-4da057d9057d","code":"K84","name":"Kingston University","description":"Kingston University are our education provider. They offer access to their extensive online library. Mentor courses are run in partnership with the university. The university regularly monitors the programme delivery, and visits to quality assure the programme and the work of the students, and mentors."}],"createdAt":"2021-07-06T17:52:18.592Z","updatedAt":"2021-07-06T17:52:18.592Z"}