{"id":"9d791d87-7a2e-4438-b333-9999e8c0af17","name":"Stamford ITE Cluster","code":"2E9","type":"lead_school","isAccreditedBody":false,"urn":"137680","ukprn":"10059417","address":{"addressLine1":"Empingham Road","town":"Stamford","county":"Lincolnshire","postcode":"PE9 2SR"},"contact":{"website":"http://www.malcolmsargentschool.co.uk","email":"enquiries@malcolmsargent.lincs.sch.uk","telephone":"01780 756056","fullName":"Tim Cox"},"location":{"latitude":52.654644,"longitude":-0.50614},"trainWithUs":"Malcolm Sargent Primary is a vibrant school in the pleasant Georgian town of Stamford, offering a tremendous team ethos, in a friendly, dynamic and supportive environment. We have 650 pupils, organised in year groups of 90 (3 classes), well supported by a team of teachers and teaching assistants that work closely together to plan the curriculum opportunities and day to day running of the the year group. Senior Leaders and Pastoral Leads also support each year group by overseeing welfare, wellbeing and special needs. We pride ourselves on our excellent standards of education for children, and training for staff. We have been training teachers for over 10 years, and have an excellent track record in developing trainee teachers.\nStudents are integrated into the whole school teaching team from their first day, as highly valued members of the school team. They work alongside their teacher mentors very closely, and are involved in all aspects of school life. Our aim is not only to ensure students have a positive and well supported experience, but also leave with the highest possible outcomes they can achieve, establishing not only the skills to teach, but also, employability and an aptitude and understanding of how to do well in this rewarding profession.","trainWithDisability":"We really care about all of our trainees and aim to support them all of the way through their studies, from application to graduation. Therefore, applicants with disabilities and other needs are encouraged to apply. The School Direct Route makes the most of in-school mentoring, offering close support for trainees. We recognise that trainees may require additional assistance to engage fully with their studies due to a range of access needs. Student Advice plays a key role in co-ordinating services available to BGU’s disabled and sensory impaired students, and/or with specific learning differences or other access needs before and during their studies. In order to assess the level of support trainees may require, we use the legal definition of disability, which is wide ranging but includes:\n· Specific learning differences including dyslexia\n· Physical mobility difficulties\n· Hearing impairments\n· Visual impairments\n· Persons requiring personal care\n· Autistic Spectrum Disorders including Asperger’s Syndrome\n· Mental health difficulties\n· Medical conditions such as epilepsy, diabetes or asthma\nThis is not an exhaustive list – trainees may have access needs that are not listed above. If you are unsure whether you have access needs which are covered by disability legislation, please contact Student Advice – we will be happy to offer advice and guidance.\nAdjustments, where necessary, become part of daily inclusive practice in school. Further support, including for wellbeing, is available to all trainees through our Student Advice team. Clusters welcome any questions or enquiries throughout the application process.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"1d95b6cb-0e08-4485-848a-0e304d71102a","code":"B38","name":"Bishop Grosseteste University","description":"Bishop Grosseteste University (BGU) has been educating students in Lincoln for over 150 years.\\r\\n\\r\\nOver the past 150 years, BGU’s commitment to first-class teacher training has remained consistent - they continue to provide schools with highly-skilled graduates.\\r\\n\\r\\nThe latest Graduate Outcomes survey shows that BGU is 3rd in the UK for graduate employability when compared to non-specialist universities. High satisfaction was also found across the entire student experience leading to an 85% satisfaction rate.\\r\\n\\r\\nAdditionally, the university is ranked eighth in the country for teaching quality, further supporting the University’s Gold ranking in the latest Teaching Excellence Framework (TEF)."}],"createdAt":"2021-07-06T17:53:48.739Z","updatedAt":"2021-09-10T20:31:28.134Z"}
