{"id":"9dd13fde-6d4c-4725-824d-ceff8ab189a9","name":"The Holy Cross School","code":"1MO","type":"lead_school","isAccreditedBody":false,"urn":"138459","ukprn":"10038104","address":{"addressLine1":"The Holy Cross School","addressLine2":"25 Sandal Road","town":"New Malden","county":"Surrey","postcode":"KT3 5AR"},"contact":{"website":"http://www.holycross.kingston.sch.uk","email":"lgordo2@holycross.kingston.sch.uk","telephone":"2083954225","fullName":"Lynn Gordon"},"location":{"latitude":51.3979204,"longitude":-0.2616342},"trainWithUs":"The Holy Cross School was founded in 1931 by the Congregation of the Holy Cross, it is a voluntary aided Roman Catholic School for girls aged between 11-18. At Key Stage 5 the school has worked in curriculum partnership with our local boys school, Richard Challoner, for the past thirty years and post 16 lessons are co-ed. The school was a specialist Science College and converted to Academy status in August 2012. The school is proud to be acknowledged by the SSAT as being in the top 5% of all schools nationally for progress made from Year 7 to 11. The school currently has 940 students on roll and employs over 100 staff.","trainWithDisability":"Schools generally have good disability access to their site. Check this with the school prior to your visit and interview, if you are shortlisted.\nAlso contact the eQ office for a discussion of your needs if they are not related to mobility so that we can identify what additional support might be appropriate for you.\nAll trainee teachers must also meet the Secretary of State's requirements for physical and mental health. In practice, few health problems preclude applicants from teaching, and so we welcome applications from people with disabilities.\nMore information - Further advice on any aspect of the entry requirements and teacher training with e-Qualitas is available from the Programme Director at the e-Qualitas office.\nTelephone 01892 513881 or email initialteachertraining@e-qualitas.co.uk","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"252d7e03-741e-4453-b6a8-3d361e6c9d1b","code":"E69","name":"e-Qualitas","description":"\\r\\nYou work with experienced teachers, first of all observing and team teaching, then teaching independently. This is complemented by a placement of about 6 weeks’ teaching in another school plus various other visits. Your study is based on the distance learning resources on the eQ virtual learning environment (VLE). Training sessions are provided by experienced school staff, and you attend some training days run by eQ (up to about 10 days, mostly held in a venue in central London). You also have a subject-specialist visiting tutor from eQ."}],"createdAt":"2021-07-06T17:47:04.343Z","updatedAt":"2021-07-12T13:54:57.322Z"}
