{"id":"9dfcb731-1c17-4722-add3-ed6ac0da7edb","name":"Dover, Deal and Sandwich Partnership","code":"1CG","type":"lead_school","isAccreditedBody":false,"urn":"136317","ukprn":"10032210","address":{"addressLine1":"Sandwich Technology School","town":"Sandwich","county":"Kent","postcode":"CT13 0FA"},"contact":{"website":"https://ddspartnership.org","email":"schooldirect@sandwich-tech.kent.sch.uk","telephone":"01304 610102","fullName":"Mark Beaman DDS School Direct Coodinator"},"location":{"latitude":51.2636376,"longitude":1.3373475},"trainWithUs":"The Dover, Deal and Sandwich Partnership is a group of like-minded schools that work together for the good of the students in our community. We believe in giving our young people access to first class teachers and, collectively, are committed to investing in the teachers of the future. A training course within our partnership includes:\n* A placement at the school of your choice\n* An induction programme based on your own training needs\n* Classroom experience at two contrasting schools within the Partnership\n* Support from fully trained mentors and experienced teachers\n* A fully comprehensive and up to date curriculum studies and professional studies programme enabling you to meet regularly with other Partnership student teachers\n* Access within your training to a range of teaching styles and methodology\n* Continued support to achieve QTS\nAn overview of the schools within our partnership can be found on our website [DDSPartnership.org] (https://ddspartnership.org)","trainWithDisability":"As a partnership we are committed to equal opportunities and supporting both students and staff with disabilities and learning needs. Each of our partner schools will be happy to discuss any requirements you may have to ensure a successful training experience.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:54:39.761Z","updatedAt":"2021-09-27T15:32:27.994Z"}
