{"id":"9e16b352-794f-4031-9d55-75820dbb8699","name":"Bridging the Tamar Learning Alliance","code":"165","type":"lead_school","isAccreditedBody":false,"urn":"137257","ukprn":"10059114","address":{"addressLine1":"School Road","addressLine2":"Landrake","town":"Saltash","county":"Cornwall","postcode":"PL12 5EA"},"contact":{"website":"http://www.sir-robert-gefferys.cornwall.sch.uk","email":"head@sir-robert-gefferys.cornwall.sch.uk","telephone":"1752851362","fullName":"Julie Cutis"},"location":{"latitude":50.422763,"longitude":-4.2877106},"trainWithUs":"Sir Robert Geffery's School and Ermington School work together to provide high quality learning for their students. We suggest you look at both schools' websites and we are happy to talk to you at any stage during the application process. Working together, we can support placements in Devon or Cornwall.\nAs a small provider we can bespoke the training to meet the needs of individual students.\nStudents work along outstanding practitioners at Ofsted rated outstanding schools where a broad balanced curriculum is maintained. Contrasting placements are available, so that you can complete your training with a CV that will help successful job applications. with experience to make your training successful. As well as training provided by Marjons we use our own Specialist Leaders in Education to run additional curriculum courses and we support the teaching application process.\nBoth Ermington and Sir Robert Geffery's have been recognised in numerous ways over many years, holding Artsmark awards, Eco School awards, International Schools awards, Basic Skills Quality Mark and Sports awards. The extra curricular experiences offered enhance the creative curriculum delivered in both schools.\nRing to visit we would love to consider you for our course.","trainWithDisability":"The schools will work in partnership with students to meet their individual needs as required.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"a4e84530-e1f1-47c6-b57e-ec693d629637","code":"P63","name":"Plymouth Marjon University","description":"Plymouth Marjon University is celebrating 180 years of teacher training.\\r\\nThe school led programmes are designed to train trainee teachers to become highly reflective teachers. The Guardian ranks them 6th best university in the UK for education courses, out of 80 universities, and 1st in Devon and Cornwall. At Plymouth Marjon learning and teaching is underpinned by research, policy and practice. \\r\\n \\r\\nComplete University guide 2019 stated ‘Plymouth Marjon University has long-established expertise in teacher training reflected in the numbers of postgraduate students choosing to study at the university.'"}],"createdAt":"2021-07-06T17:54:58.706Z","updatedAt":"2021-10-26T16:12:34.088Z"}
