{"id":"9e30a2ef-61ee-4ffb-8862-b6ea936ff561","name":"Prince Henry’s High School & South Worcestershire SCITT","code":"2ET","type":"scitt","isAccreditedBody":true,"ukprn":"10032987","address":{"addressLine1":"Prince Henry’s High School","addressLine2":"Victoria Avenue","town":"Evesham","county":"Worcestershire","postcode":"WR11 4QH"},"contact":{"website":"https://www.princehenrys.worcs.sch.uk/scitt","email":"ad@princehenrys.worcs.sch.uk","telephone":"1386765588","fullName":"Andy Duffy"},"location":{"latitude":52.0990414,"longitude":-1.9415985},"trainWithUs":"Why train with us?\nPrince Henry's and South Worcestershire SCITT along with its partnership of schools have extensive experience of working with Initial Teacher Training, both School Direct and PGCE Core. Across the partnership of schools we train no more than 40 trainees a year working in partnership with HEI institutions to support and train the next generation of teachers. Our partnership and family ethos would support the view of Ofsted in our inspection in 2019 when they stated:'\tStrong relationships and family ethos and not giving up on trainees' Click here for full Ofsted report: https://files.ofsted.gov.uk/v1/file/50134799\nTrainees choosing to train with the Prince Henry's and South Worcestershire SCITT will be trained by outstanding practitioners across a partnership of schools in the south of the county with one clear aim: Providing the highest quality of Initial Teacher Training producing the next generation of outstanding practitioners in order to continually raise standards and pupil achievement. We work with Worcester University to award the PGCE and to gain Masters Credits throughout the year\nTrainees identified the following features of the SCITT Partnership:\n* Strong and clear leadership from the SCITT Team\n* Support and advice provided by the SCITT Director\n* High expectations and aspirations across the SCITT with a focus on excellence\n* Commitment to trainee wellbeing\n* Very good communication within the placement schools\nExternal Examiner 2020.\nWhere to Find Us\n(http://www.princehenrys.worcs.sch.uk/ )\nWhy train with us?\nhttps://www.princehenrys.worcs.sch.uk/scitt/apply","trainWithDisability":"Our equal opportunities and accessibility to training allows all trainees to apply and be trained through the SCITT. Extensive support from both the SCITT administration team, subject lead tutors and mentors have provided trainees with extra support and guidance if needed. We have trained trainees who have been diagnosed with dyslexia and they have been given extra support with the PGCE assignments through the University and also further considerations with planning and marking by the partner schools and mentors. We had a trainee 2018-19 who had visual impairments and again extra support with templates, assignments lesson planning, marking will be given throughout the year.\nWe are constantly aware of the demands of the course on any person’s health and well- being and we provide pastoral support through our internal verifier and pastoral support colleague within the SCITT. This provides an extra avenue for trainees to access to share concerns and issues if they are finding difficulties with the course.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:54:18.093Z","updatedAt":"2021-09-13T01:55:54.741Z"}
