{"id":"9ec60260-34be-4513-9681-17557a3f521e","name":"Cornwall Teaching School","code":"19U","type":"lead_school","isAccreditedBody":false,"ukprn":"10007063","address":{"addressLine1":"Truro and Penwith College","addressLine2":"College Road","town":"Truro","county":"Cornwall","postcode":"TR1 3XX"},"contact":{"website":"http://www.cornwallteachingschool.org.uk","email":"scitt@truro-penwith.ac.uk","telephone":"01872 305728","fullName":"Course Administrator - Initial Teacher T"},"location":{"latitude":50.2630357,"longitude":-5.1006316},"trainWithUs":"Cornwall Teaching school aims to generate and maintain a sustainable model for developing local teachers and leaders and to secure outstanding practice in all phases of learning. [Visit the Cornwall Teaching School website](www.cornwallteachingschool.org)","trainWithDisability":"Cornwall SCITT is founded on the principles of equality and inclusion. Our management team, academic tutors, subject leaders and school-based mentors strive to ensure the best possible outcomes for all student teachers. Prior to the start of the course all student teachers undertake a health and physical capacity to teach check. \n\nFor those with additional learning needs, every student teacher receives bespoke support from a dedicated academic tutor who can provide support with assignment writing. Students can also access additional support through Student Finance's Disabled Learning Allowance Scheme. \n\nWe carefully select placement schools for those with physical needs to optimise any reasonable adjustments that may be required. Mentors and subject leaders can provide support to those with visual and hearing difficulties to develop impairment-friendly strategies within the classroom.\n\nOur personalised approach to learning allows those with mental health needs to develop their practice with support from the central management team. We offer an empathetic dialogue to provide an appropriate balance of support and challenge throughout the programme.","accreditedBodies":[{"id":"0f3abdaf-7b36-422e-a700-046f8a641c60","code":"C79","name":"Cornwall School Centred Initial Teacher Training. (Cornwall SCITT)","description":"Cornwall Teaching School works closely with the well-established Cornwall SCITT partnerships which offer initial teaching opportunities in early years, primary and secondary phases along with the Truro and Penwith College post 16 training. The teaching school will be working with school partners to develop School Direct opportunities for high quality trainees and will continue to respond to national and local needs for subject specialist trainees and cross phase priorities."}],"createdAt":"2021-07-06T17:48:57.227Z","updatedAt":"2021-11-04T22:33:51.180Z"}