{"id":"9f06154d-1fed-4ea4-bdce-0c0d8528e463","name":"Wealden Partnership","code":"1Z2","type":"lead_school","isAccreditedBody":false,"urn":"114587","ukprn":"10002980","address":{"addressLine1":"Heathfield Community College","addressLine2":"Cade Street","town":"Old Heathfield","county":"East Sussex","postcode":"TN21 8RJ"},"contact":{"website":"http://www.heathfieldcc.co.uk/?page_id=566097","email":"jsheldon@heathfieldcc.co.uk","telephone":"1435866066","fullName":"Rebecca Lynch"},"location":{"latitude":50.9674109,"longitude":0.2775428},"trainWithUs":"The Wealden Partnership offers high quality teacher training by dedicated professionals in a supportive and inspirational environment. We have worked with trainee teachers from our local universities for many years and value the enthusiasm, skills and qualities they can offer to a school community. We believe that teaching is a wonderful career and that this is a successful, innovative and vibrant group of schools to work with. Our partnership of schools is led by Heathfield Community College and comprises three other large secondary schools, Uckfield College, Uplands Community College and Beacon Academy. All four schools are highly successful and popular 11 – 18 mixed comprehensives situated in semi-rural communities in the north-eastern corner of East Sussex, within commuting distance of the South Coast. The schools are conveniently located within 10 miles of each other and this enables trainees to attend joint training sessions across all schools.\nIn addition to collaborating on teacher training, the partnership runs joint training sessions for all staff and provides a range of CPD opportunities for individual staff at various stages of their career development. All schools are committed to raising the quality of teaching and learning through raising standards. Pupils in the partnership schools are happy, friendly and well-motivated and their welfare and progress lie at the heart of everything we do.\nOur teachers are innovative and enthusiastic practitioners eager to share their expertise with the next generation of teachers.","trainWithDisability":"Our partnership consists of 4 mainstream schools who all have a fully inclusive approach to education and recruitment. \n\nAny additional support required can be discussed during the interview process and support can be put in place if needed.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"d2ba71f2-c125-4d86-bb22-736e67043120","code":"B72","name":"University of Brighton","description":"Our training is supported by the University of Brighton, which has a long and successful tradition in teacher education. \\r\\n\\r\\nThe university works with us to provide quality input on how to teach and assess in secondary \\u0026 primary schools and and also provides a comprehensive programme of professional studies which complements the sessions offered in our partnership."},{"id":"4d4cceab-1516-4a6c-a9ab-5de0e32e1fe1","code":"S90","name":"University of Sussex","description":"Our training is supported by the University of Sussex, which has a long and successful tradition in teacher education. \\r\\n\\r\\nThe university works with us to provide quality input on how to teach and assess in secondary schools and also provides a comprehensive programme of professional studies which complements the sessions offered in our partnership."}],"createdAt":"2021-07-06T17:50:47.295Z","updatedAt":"2021-09-22T21:54:30.368Z"}
