{"id":"9fe9e10a-d88e-4a59-8127-9ef5a96c4b35","name":"Tyne Valley Alliance","code":"16B","type":"lead_school","isAccreditedBody":false,"urn":"122242","ukprn":"10078829","address":{"addressLine1":"The Sele","town":"Hexham","county":"Northumberland","postcode":"NE46 3QZ"},"contact":{"website":"http://www.selefirst.org","email":"Brooke.Phillips@sele.northumberland.sch.uk","telephone":"1434602808","fullName":"Brooke Phillips"},"location":{"latitude":54.9726937,"longitude":-2.1057279},"trainWithUs":"Successful applicants will work across schools in the TVTSA, providing trainees with the opportunity to work alongside outstanding practitioners, developing the rigour, professional knowledge, understanding and skills to become inspirational, creative and purposeful practitioners.\nThe programme aims to deliver the skills of the classroom progressively. Training begins with observations progressing to taking more responsibility as confidence develops. By the end of the first placement trainees teach 50% of the timetable, by the end of the second placement they teach 80%.\nWe have worked with trainee teachers from three HE institutions for many years, being one of the first schools to offer School Direct training.\nTVTSA comprises of the following schools across four local authorities; Sele First Hexham, Prudhoe West Academy, Shilbottle Primary Alnwick, Mickley First Northumberland, Ovingham First Northumberland, Throckley Primary, Newcastle , Lobley Hill Primary Gateshead, St. Augustine’s RC Primary Gateshead, Bensham Nursery Gateshead, Marine Park North Tyneside and Rickleton Primary Sunderland. We have also recently started to work with Smart Academies across Newcastle including Kenton Bar Primary.\nPartnerships comprise a mixture of large/small, urban/rural, primary, first and faith schools. We work in partnership with Northumbria University and Gateshead SCITT, enabling trainees to access additional training. We recruit Specialist Leaders in Education who play a vital role in our training programme. Trainees are trained in a supportive and aspirational environment, developing the skills and tools needed to meet the professional standards for teachers.\nAll schools have a thorough Covid Risk Assessment which will be shared with you beforehand.","trainWithDisability":"All trainees will be helped to develop their full potential within our schools. We are committed to making adjustments to support and facilitate specific access needs as stated in Northumbria Universities support policies. These can be found by following the link below.\nhttps://www.northumbria.ac.uk/study-at-northumbria/support-for-students/disability-and-dyslexia-support/\nFor example, we have supported a trainee in a previous cohort with dyslexia; they were supported by both their in school mentor and their academic mentor at Northumbria University.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:49:54.380Z","updatedAt":"2021-09-30T21:06:03.196Z"}
