{"id":"9ffe6faa-48ed-47f1-a444-78af1e44b16f","name":"Shiremoor Primary School Partnership School Direct","code":"1EV","type":"lead_school","isAccreditedBody":false,"urn":"108579","ukprn":"10078378","address":{"addressLine1":"Shiremoor Primary School","addressLine2":"Stanton Road","town":"Newcastle upon Tyne","county":"Tyne and Wear","postcode":"NE270PW"},"contact":{"website":"www.shiremoor-primary.co.uk","email":"office@shiremoor-primary.co.uk","telephone":"1912524188","fullName":"Mrs Barbara Middleton"},"location":{"latitude":55.0331945,"longitude":-1.5094675},"trainWithUs":"Shiremoor Primary works with an alliance of schools from North East England with a long history of involvement in Initial Teacher Training. A team of highly skilled practitioners including regional system leaders and National Leaders of Education lead the training programme which ensures a range of opportunities for all trainees to broaden the skills knowledge and understanding of primary education. Throughout the course opportunities are also provided to visit a range of settings ensuring participants have many chances to network with a range of professionals and gain further experiences. There are high rates of employment for graduates of the programme who are well-regarded due to the high quality training, mentoring and support they have received. Shiremoor Primary offer placements in a range of primary schools. Our bespoke programme has some further particularly appealing features such as schools with real specialisms for example forest and beach schools, STEM, behaviour management, physical education and ICT. All our trainees receive competent guidance and support through it the on year training programme so that they exit the course with high levels of confidence and independence ready to be part of the teaching profession. All trainees are given a laptop to use throughout the year and have access to IT support weekly.","trainWithDisability":"Shiremoor Primary School Alliance works alongside Northumbria University to offer additional support and advice where an applicant or participant identifies an additional need or special circumstance.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:47:34.027Z","updatedAt":"2021-10-07T15:22:55.377Z"}
