{"id":"a03e3f52-0708-4475-9f13-8f6f3edad28a","name":"Colchester Teacher Training (CTTC)","code":"2DB","type":"lead_school","isAccreditedBody":false,"urn":"137515","ukprn":"10035498","address":{"addressLine1":"Colchester Teacher Training","addressLine2":"Colchester County High School","town":"Norman Way","county":"Colchester","postcode":"CO3 3US"},"contact":{"website":"http://www.colchesterttc.org.uk","email":"enquiries@colchesterttc.org.uk","telephone":"01206 364728","fullName":"Carole Cansdale"},"location":{"latitude":51.8853779,"longitude":0.8753132},"trainWithUs":"Established in 2003, CTTC is an outstanding provider in all areas (Ofsted Nov 2017), offering a School-Centred Initial Teacher Training Programme. Our strong partnership of over 60 schools and colleges across North Essex and South Suffolk provides diversity and choice for trainees. The training hubs are located in both Colchester and Ipswich to serve the local schools. Our schools offer a wide range of educational experiences including grammar school, sixth form colleges and specialist SEND placements. Our programmes are run in collaboration with our partner schools and were judged outstanding across all areas by Ofsted. In 2021, 100% of trainees commended the quality of CTTC’s curriculum and programme. Our Primary and Secondary School Direct programmes offer high quality training and support, leading to the award of Qualified Teacher Status (QTS) and a Postgraduate Certificate in Education (PGCE), including 60 Masters level credits validated by the University of Greenwich.\nLocal schools are keen to employ trainees from the partnership and many ECT and former trainees move quickly into leadership and management roles. We host events and school experience taster sessions throughout the year, further details are published on our website and on social media.","trainWithDisability":"Trainees value the strong pastoral support and mentoring that they receive on the programme. Support for trainees’ health and wellbeing is embedded across the programme.\nBespoke support is provided for trainees with a variety of needs. Examples include:\n* Personal tutor for the PGCE\n* Resources to allow easier access on computer applications if required\n* Expert pastoral care\n* All school placements allow for trainees with access requirements","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:55:51.256Z","updatedAt":"2021-09-28T21:34:17.903Z"}
