{"id":"a042cf59-a725-4c12-9d22-2405a50c0251","name":"Axbridge C of E First School Academy","code":"3J9","type":"lead_school","isAccreditedBody":false,"urn":"138763","ukprn":"10058347","address":{"addressLine1":"Moorland Street","town":"Axbridge","county":"Somerset","postcode":"BS23 2UX"},"contact":{"website":"https://www.sciltraining.co.uk/scitt/","email":"lmrichardson@educ.somerset.gov.uk","telephone":"01934 732391","fullName":"Lorna Richardson"},"location":{"latitude":51.2857397,"longitude":-2.8172187},"trainWithUs":"We are a family of 13 schools, in close proximity across the Cheddar Valley area, with children at the heart of our school system. Our closeness in locality and partnership working will offer effective and supportive placements for you as a student. The Cheddar Valley is a three tier system, from 2-18 years. As such, we plan opportunities for you to be exposed to year groups beyond your PGCE that would further enhance your qualification and experience. Joint training opportunities are also planned throughout the year through INSET days and networking opportunities. Each placement would offer you high quality, school-based experience and training in partnership with Somerset SCITT (School Centred Initial Teacher Training) supported by a proven track record of excellent ITT provision.\nOur professional tutors/teachers are excellent practitioners who are eager to share their knowledge skills and effective practice with the next generation of teachers. The course will provide QTS (Qualified Teacher Status) as well as a PGCE (Post Graduate Certificate in Education). The Wessex Hub aims to create a pathway of the highest quality training and possible succession opportunities for trainees in its partner schools. All schools are judged as Good or Outstanding in their recent Ofsted inspections and have a strong record of working with ITT providers. There is a vast array of expertise in the group of schools. Somerset SCITT are our accredited ITT partner, and judged as Outstanding by Ofsted in 2017. The University of Worcester provide the necessary accreditation for your qualification.","trainWithDisability":"We comply with the DDE requirements.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:56:58.893Z","updatedAt":"2021-10-13T17:12:38.019Z"}
