{"id":"a069ce50-5616-48f3-823f-8b57d6b8baaf","name":"The Academy at Shotton Hall","code":"1OT","type":"lead_school","isAccreditedBody":false,"urn":"136451","ukprn":"10032958","address":{"addressLine1":"(Formally Shotton Hall SCITT)","addressLine2":"Passfield Way","town":"Peterlee","county":"County Durham","postcode":"SR8 1AU"},"contact":{"website":"http://www.northeastscitt.co.uk","email":"leanne.storr@nelt.co.uk","telephone":"1915180222","fullName":"Lydia Burnett"},"location":{"latitude":54.7497909,"longitude":-1.3529502},"trainWithUs":"If you're thinking about training to be a primary or secondary school teacher in north east England, Ofsted rated 'outstanding' North East SCITT (Formally Shotton Hall SCITT) - part of The Academy at Shotton Hall in Peterlee - is one of the most well respected and successful school-centered teacher training providers in the region. Whether you're a new graduate, about to graduate or you are considering a change of career, our high-quality school-based initial teacher training courses, alongside a PGCE from Durham University, will give you the foundation you need for a great career in teaching.\nAt North East SCITT, you will be at the heart of school life, learning from outstanding practitioners. You will practise in a broad range of schools within the North East SCITT Teaching School Alliance, spanning across north east England, gaining experience and expertise in different areas including SEN, behaviour management and phonics, and maths mastery (for primary only). You will be allocated a subject mentor from a team of specialists with vast experience. They will introduce you to school life and help you to learn how to teach your subject as you work your way through the Teacher Standards with lesson planning, weekly meetings and assessments within your school. Your training will lead to qualified teacher status (QTS) and masters level accreditation, equivalent to a postgraduate certificate of education (PGCE), from Durham University.","trainWithDisability":"At North East SCITT (Formally Shotton Hall SCITT) we strive to offer all inclusive, personalised and highly supportive training for all trainees. We are experienced in supporting trainees with a variety of needs to ensure that training is accessible for all. Training sessions are carefully planned so as to support any trainees with dyslexia, physical, hearing and visual impairments, as well as offering one-to-one support for those who wish to access that. In addition, we have a wide and comprehensive mental health and wellbeing programme that has grown from strength to strength over the past 6 years. We offer whole cohort and individual support training and guidance on managing work load and work life balance, as well as providing intensive support where needed to ensure that all trainees feel fully supported. Alongside our support sits support from Durham University, who we gain our PGCE accreditation from. The University provides access for our trainees to utilise their Student Welfare and Support Service; this includes counselling and support for trainees with disabilities.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:56:43.257Z","updatedAt":"2021-10-13T19:05:46.112Z"}
