{"id":"a09765d9-afba-463e-b0d0-7031691cbe42","name":"Ashton on Mersey School SCITT","code":"24L","type":"scitt","isAccreditedBody":true,"ukprn":"10055366","address":{"addressLine1":"Cecil Avenue","town":"Sale","county":"Cheshire","postcode":"M33 5BP"},"contact":{"email":"aomscitt@aom.trafford.sch.uk","telephone":"0161 9731179","fullName":"Sam Buckley"},"location":{"latitude":53.4189389,"longitude":-2.3394249},"trainWithUs":"The aim of Ashton on Mersey SCITT is to develop the teachers of tomorrow, those who will make a difference in the lives of the pupils they teach and to the colleagues they work with. The School is one of the only schools nationally to have been deemed outstanding by Ofsted five consecutive times. Our Ethos is\nEvery trainee matters - our programme allows trainees to personalise learning through enrichment opportunities.\nTeam of high quality partner schools, mentors and quality improvement leads working collaboratively on all elements of the programme.\nHolistic course with school and centre based learning dovetailed through five clear learning themes linked to the Teachers’ Standards. Outstanding practice to allow you to develop your full potential as a trainee.\nSpecialist facilitators from partner schools deliver the centre based learning ensuring current educational practice is at the forefront of all learning.\nThe Ashton on Mersey SCITT Ofsted inspection noted;\n“Well-structured, cohesive and innovative training programmes enable trainees to gain the skills and knowledge to be successful teachers.”\n“Trainees and NQTs from this partnership share a number of notable characteristics. They are thoughtful, buoyant and enthusiastic.\"\n“Trainees are fulsome in their praise of the SCITT. NQTs echo these positive views time and time again.”\n“A highly effective, cohesive and ambitious leadership team accounts for the successful establishment of Ashton on Mersey SCITT. They share the same reflective qualities as the trainees they nurture. They seek out advice, listen to feedback and take immediate action to bring about positive change.”","trainWithDisability":"If you have any special needs please contact us so that we can discuss your requirements and how these can be met. Applicants who would benefit from disabled access should let us know on their application so that they can be considered for placements at the appropriate schools.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:55:49.656Z","updatedAt":"2021-07-21T16:21:21.899Z"}
