{"id":"a0b888f7-429d-4021-8fd9-6ad1c301136c","name":"Sheringham Community Primary School Partnership","code":"1A5","type":"lead_school","isAccreditedBody":false,"urn":"120851","ukprn":"10072540","address":{"addressLine1":"Cooper Road","addressLine2":"Off Holway Road","town":"Sheringham","county":"Norfolk","postcode":"NR26 8UH"},"contact":{"website":"http://sheringhamprimary.norfolk.sch.uk","email":"rcarter2nrq@nsix.org.uk","telephone":"01263 823848","fullName":"Rachael Carter"},"location":{"latitude":52.9350151,"longitude":1.2016833},"trainWithUs":"We are a large Primary School situated in North Norfolk but our partnership spreads throughout the area and we have had trainees placed across the region from King's Lynn to Great Yarmouth and from Cromer to Thetford with everywhere in between!\nWe have been involved with school direct for a number of years and are very experienced and knowledgeable in this field; we work closely with our providers to ensure high standards of training are achieved.\nOnce recruited we allocate schools from our alliance partners to individuals based on location and age range required. Successful applicants all know where their main school placements will be in July.","trainWithDisability":"SCITT: We support all trainees based on their individual needs. Working with our providers this has included those with dyslexia, physical, hearing and visual impairments and mental health conditions. Plans are developed with trainees to ensure that they can fully access in centre training, operate effectively on school placement and complete written assignments.\nAll of our providers have full disabled access as do all the schools in the partnership. However, applicants who would benefit from disabled access should let us know on their application so that they can be considered for placements at the most appropriate schools. UEA: UEA operates an equal opportunities policy and welcomes applications from people with disabilities. All PGCE trainee teachers must meet the Secretary of State's requirements for physical and mental fitness to teach. All candidates offered a place are required to complete an Occupational Health questionnaire. If this reveals any additional needs, UEA will consider reasonable adjustments at the University and in school placements\n[Find out more about the information and advice available through UEA's Wellbeing Service]https://portal.uea.ac.uk/student-support-service/wellbeing","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:51:03.268Z","updatedAt":"2021-09-24T19:27:15.386Z"}
