{"id":"a0dd345f-8a0e-4329-9048-6eb076ed0f1b","name":"Bishop Challoner Training School","code":"1K2","type":"lead_school","isAccreditedBody":false,"urn":"103560","ukprn":"10000722","address":{"addressLine1":"Challoner House","addressLine2":"21 Institute Road","town":"Kings Heath","county":"Birmingham","postcode":"B14 7EG"},"contact":{"website":"http://www.bctsa.org/Apply-For-School-Direct","email":"c.taylor@bishopchalloner.bham.sch.uk","telephone":"1214416175","fullName":"Chris Taylor"},"location":{"latitude":52.4330497,"longitude":-1.8904939},"trainWithUs":"Bishop Challoner Training School Alliance (BCTSA) consists of over 60 schools, including 30 primaries, mainly located across the Birmingham area with some schools situated in the surrounding areas of Solihull, Dudley, Walsall and Worcestershire.\nBeing a large TSA, with a long and proven track record of training teachers, we can offer a large number of subjects and primary places all through the School Direct PGCE route. Having a large Alliance means that the majority of trainees are employed in Alliance schools after completing their training year. There are experienced mentors in Alliance schools who will support you. They undertake training for their role every year with the University and with BCTSA. We have an ITT Support Team, which consists of experienced mentors from Alliance Schools who visit schools/trainees at least 3 times a year. This is in addition to the support provided by the University.\nTo teach within our Alliance means that you will have a unique opportunity of an individualised leadership development programme throughout your career, from trainee to senior leadership and beyond.\nCome and train to teach with us and 'Inspire : Teach : Excel'\n(http://www.bctsa.org/Apply-For-School-Direct)","trainWithDisability":"Within our Alliance of schools, BCTSA hopes to be able to provide a welcoming, accessible route into teaching for candidates with disabilities and other needs. The caring, nurturing focus of our mentors and trainers aims to look after those who are keen to progress through the programme and become classroom teachers. The University also provides a range of academic and professional support.\nPreviously we have supported trainees with a range of physical impairments, including timetabling of lessons to ground floor classrooms for those who cannot use the stairs; extra preparation time for those with dyslexia and autism, and extra support for those with mental health conditions.\nBy seeing our trainees as individuals, no two types of support are the same. By encouraging a caring and supporting ethos within our partner schools, we work with individuals to work out the best way to help them gain the most from their School Direct year and to start their teaching careers confident and ready to teach.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"62d5803b-89ca-4e21-bb6f-5c74944c56ad","code":"B25","name":"Birmingham City University","description":""},{"id":"4aa8177a-27b8-4566-b77a-c45515e46739","code":"N36","name":"Newman University","description":""},{"id":"ef09ce50-ccfc-4346-a0ce-43e840153dab","code":"W20","name":"University of Warwick","description":""}],"createdAt":"2021-07-06T17:54:53.498Z","updatedAt":"2021-10-04T05:00:39.960Z"}
