{"id":"a17da5c9-8a1c-4e20-a511-9854b0b1e6bb","name":"Wandle Teaching School Hub","code":"13V","type":"lead_school","isAccreditedBody":false,"urn":"145280","ukprn":"10066360","address":{"addressLine1":"Wandle Teaching School Alliance","addressLine2":"Dagnall Street","town":"LONDON","county":"London","postcode":"SW11 5DT"},"contact":{"website":"http://www.wandletsa.com","email":"dwallace@chestnutgrove.org.uk","telephone":"020 76221619 ext 4","fullName":"Mr Denys Walace"},"location":{"latitude":51.473673,"longitude":-0.1566157},"trainWithUs":"Train to become a teacher with the Wandle Teaching School Alliance ( WTSA) and benefit from a tailored programme of personal development and support from outstanding, experienced professionals. Our aim is to always keep you at the centre of everything we do. Our programmes are high challenge and high support as we believe in preparing you to become the best possible teacher you can be.\nOur Alliance of over forty members, based in south and south west London, offers a unique opportunity to train within a wide range of schools, Primary, Secondary and Special.\nTraining with us will enable you to gain an in-depth experience of all aspects of teaching and learning within a secure and caring environment.\nWe offer additional workshops throughout the year to develop your professional learning and practice to the highest level, for example, you will be able to take part in the Child Exploitation and Online Protection training, leading to the CEOPS certificate.\nWe are a dynamic and collaborative learning community and we look forward to you starting your teaching career with us.","trainWithDisability":"Wandle TSA aims to create an environment that enables anyone to participate fully in the mainstream of school life.\nWe address disability, as defined by the Equality Act 2010:\n•\tmobility and sensory impairments\n•\tmental health issues\n•\tspecific learning difficulties (SpLD), including the autistic spectrum and Aspergers Syndrome\n•\tmedical conditions which may have an impact on day-to-day activities\nAll our partner universities have well established student support services. Wandle TSA proactively works with our partner’s student services in meeting the needs of our PGCE students. A wide range of support services is available to students through the universities with reference to all of the above.\nWe encourage you to make contact with us as early in the application process as possible so as we can work with the university in identifying services appropriate to your individual needs. In the first instance you should contact the Director of the Teaching School, Mr Denys Wallace on dwallace5.212@lgflmail.org .\nOur aim is to ensure that there as few barriers as possible to prevent you studying successfully. We therefore work closely with the university tutorial teams to customise programmes as necessary.\nThe universities will provide ICT enabling support and our schools will help you understand, use and customise the accessibility options built-in to your devices\nAlliance schools provide access for students with mobility impairments and have dedicated car parking allocated for the duration of school placements. Specific mobility issues for the individual schools will be addressed in collaboration with you.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:53:53.436Z","updatedAt":"2021-10-29T17:59:29.223Z"}
