{"id":"a1c2e812-9ff8-4714-8782-51ece5b8d788","name":"Bishop’s Stortford Education Trust (BSET) SCITT","code":"13E","type":"lead_school","isAccreditedBody":false,"urn":"137156","ukprn":"10059068","address":{"addressLine1":"BSET SCITT","addressLine2":"Leventhorpe School","town":"Cambridge Road","county":"Sawbridgeworth","postcode":"CM21 9BY"},"contact":{"website":"http://BSETSCITT.co.uk","email":"ejs@leventhorpe.net","telephone":"01279 603 104","fullName":"Jennifer Austin"},"location":{"latitude":51.8206729,"longitude":0.1491952},"trainWithUs":"We are a partnership of schools in the Bishop's Stortford, Sawbridgeworth and Harlow area who collaborate to provide teacher training for graduates who would like to teach in either the primary or secondary schools.\nOur aim is to spot and nurture the outstanding teachers of the future, giving them the best possible training and support in their early career. Our training is led exclusively by serving practitioners in our family of schools and training takes place entirely in school settings.\nWe offer training in a wide range of secondary school subjects and primary age groups leading to Qualified Teacher Status (QTS). Our training pathways are tailor made, with salaried and fee-paying options to gain QTS and the possibility of gaining experience in a second subject area to improve employability. You can depend on the best support in BSET schools. Training is hard work and you will need the support of an excellent mentor. All of our Teacher and Subject Mentors are excellent practitioners and they are very experienced as we are used to working with over fifty teacher trainees every year. You will also get to work with fantastic, positive young people - our area is culturally diverse and educational aspirations are high amongst young people and their parents. Our BSET placement schools are some of the highest achieving in the country.\nVisit our website for further details -[http://www.bsetscitt.co.uk/]","trainWithDisability":"Our SCITT welcomes all with out prejudice and as such caters for a wide range of trainee disability. The SCITT recognises it has a duty to make reasonable adjustments to prevent a disabled person from being placed at a substantial disadvantage by any physical feature of the premises, or by any provision, criterion or practice of the school. Provision is made through occupational health referral for Trainees who need additional support.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:50:35.999Z","updatedAt":"2021-09-16T19:30:53.636Z"}
