{"id":"a334a6f9-3905-4953-9079-44974a2e0f6d","name":"Gateway Alliance (Midlands)","code":"23E","type":"lead_school","isAccreditedBody":false,"urn":"125507","ukprn":"10071189","address":{"addressLine1":"c/o Mortimer Road","town":"Kenilworth","county":"Warwickshire","postcode":"CV8 1FS"},"contact":{"website":"https://gatewayalliance.co.uk/train-to-teach/","email":"info@gatewayalliance.co.uk","telephone":"02476 347697","fullName":"Gateway Alliance"},"location":{"latitude":52.3351813,"longitude":-1.5789184},"trainWithUs":"The Gateway Alliance specialise in supporting primary and special school teacher trainees and have led a School Direct Programme, in partnership with the University of Warwick, since 2012.\n\"The support I have received from Gateway Alliance has been invaluable in helping me to complete my training year and to secure employment as an NQT. They offer a supportive package and provide brilliant training opportunities to help you develop and flourish. I would highly recommend Gateway Alliance.\" Carrie - School Direct Trainee 2019-2020.\nYou’ll be part of a school based teaching team, in one of our 30+ partner schools, from the very start; receiving intensive support from experienced teachers and mentors. You have the opportunity to become immersed in school life through your training year, which means when you begin your first job as a teacher you are better prepared for life in school. You will access an outstanding academic programme of study at the University of Warwick which will support you to understand the theory behind teaching whilst developing and practising your skills in school.\nThe Gateway Alliance School Direct Partnership is made up of a wide range of schools from across the Warwickshire, Coventry and surrounding areas and we work together with the University of Warwick, to offer the best possible teacher training experience. Through the training year we make full use of the strengths of our partnership and offer trainees access to a wide range of experiences and learning opportunities across a range of our partner schools.","trainWithDisability":"The Gateway Alliance are an inclusive alliance and pride ourselves on supporting all of our trainees to reach there full potential regardless of any disabilities or other needs.\nWe welcome candidates with disabilities and, under the Disability Discrimination Act, those candidates who disclose their disability have the right to have reasonable adjustments made to enable them to train to teach.\nFor more information please contact us on info@gatewayalliance.co.uk","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:50:05.222Z","updatedAt":"2021-09-30T20:12:19.172Z"}
