{"id":"a3914a46-f8b6-4615-8b9d-aff2176ea909","name":"Devonport High School for Boys","code":"2LB","type":"lead_school","isAccreditedBody":false,"urn":"136496","ukprn":"10033019","address":{"addressLine1":"Devonport High School for Boys","addressLine2":"Paradise Road","town":"Plymouth","county":"Devon","postcode":"PL1 5QP"},"contact":{"website":"http://www.dhsb.org","email":"schooldirect@dhsb.org","telephone":"1752208787","fullName":"ITT Admissions"},"location":{"latitude":50.3740359,"longitude":-4.16228},"trainWithUs":"Devonport High School for Boys, a happy and vibrant grammar school for boys aged 11-18 with a co-educational sixth form. Our vision, whatever your role in the school or personal ambition, is that ‘Everyone Succeeds’.\nWe provide a disciplined, caring environment in which students achieve levels of excellence that reflect their tremendous potential and our high expectations. Examination results and university entrance records are among the best in the country. In addition, we provide a remarkable range of co-curricular activities.\nMission statement:\nWe inspire confidence so that all achieve the highest possible standard of academic success.\nWe develop talents so that everyone is enriched.\nWe support individuals in our school community to enhance their prowess and shape their future.\nAs a student teacher at DHSB we commit to provide you with the experiences and support necessary to flourish and qualify as a teacher in your chosen subject area. You will also be given opportunity to develop your understanding and experience of pastoral care. We aim to do this by providing you with a school based subject tutor and in addition a school mentor from outside of your subject area who will provide support with pedagogy and non subject specific aspects of learning to teach.","trainWithDisability":"We welcome applications from candidates with disabilities and other needs and with our HEI partners make reasonable adjustments to ensure that the training programme is accessible to all.\nPlease find detailed information about the support we provide in conjunction with our HEI partner below. University of St Mark and St John (Marjons) :(https://www.marjon.ac.uk/student-life/student-support-/disability--inclusion-advice-service/)","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:48:19.400Z","updatedAt":"2021-07-15T05:30:19.107Z"}
