{"id":"a4188ef6-7f3a-49e0-b54f-40a3b6e631d9","name":"Teach London South East","code":"2GP","type":"lead_school","isAccreditedBody":false,"urn":"70275","ukprn":"10035578","address":{"addressLine1":"Teach London South East","addressLine2":"The Highway Primary, The Highway","town":"Orpington","county":"Kent","postcode":"BR6 9DJ"},"contact":{"website":"http://www.teachlondonsoutheast.co.uk","email":"tlse@highway.bromley.sch.uk","telephone":"1689827990","fullName":"Clare Hallett"},"location":{"latitude":51.3599142,"longitude":0.1110766},"trainWithUs":"Teach London South East offers a School Direct Teacher Training Programme at Primary level for people who want to train to be an inspirational teacher in a vibrant school environment. With a balanced approach to practical teaching and theory, you will gain the skills to become a reflective and forward thinking practitioner and ultimately an outstanding teacher. We offer a fantastic opportunity to learn alongside truly inspirational teachers in London, in exciting and diverse learning environments. From the start of the year, the programme allows you to quickly become immersed in school life and be part of the Teach London South East Community. We aim to offer a superb pathway into career development with on-going support. Our partnership includes several schools in the London Borough of Bromley, with The Highway Primary School as the lead school. You will train in a main school and then have an additional, contrasting placement to give you a rounded programme. We have a focussed programme of training sessions which are led by experts from across our partnership schools. Each Trainee is supported by an in school mentor as well as a TES pathway tutor; these highly experienced teachers will guide and focus you throughout the programme and beyond. Please visit our website- www.teachlondonsoutheast.co.uk","trainWithDisability":"Tes Institute is committed to promoting access for people with disabilities and additional needs. Tes Institute supports and enables students with physical disabilities, sensory impairments, specific learning difficulties, special psychological needs and medical conditions that can have an impact on day-to-day activities, to participate in and successfully complete Tes Institute programmes, as far as is reasonably practicable and within any constraints laid down by relevant professional bodies.\n\nTo this end, Tes Institute will:\n\n-Encourage applications from people with disabilities\n-Seek to provide information in suitable formats to accommodate individual needs\n-Judge applicants who disclose disabilities or specific needs solely on the basis of their academic potential\n-Invite applicants with a disability or specific need to contact Tes Institute to discuss how their requirements can be accommodated\n-Provide additional support or resources at the application stage to enable the applicant to complete the application process including attending interview where applicable\n-Offer additional provision to ensure there is no disadvantage compared with other applicants\n-Work towards the earliest possible assessment of needs and offer of reasonable accommodations where required\n-Make reasonable accommodations in assessment where applicable and without impacting the learning outcomes to be assessed\n-Provide educational support services as appropriate and applicable for eligible students\n-Take steps to encourage students with progressive conditions, or who become disabled during their programme of study, to continue their studies\n-Promote an inclusive environment and attitude at Tes Institute and endeavour to provide appropriate training to staff and faculty where required","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:52:18.268Z","updatedAt":"2021-10-14T17:41:32.564Z"}
