{"id":"a4afc8f8-2c1b-48c0-91f3-351640495498","name":"Wandsworth Primary Schools Consortium","code":"W14","type":"lead_school","isAccreditedBody":true,"urn":"101001","ukprn":"10046788","address":{"addressLine1":"Wandsworth SCITT","addressLine2":"St Mary’s RC Primary School","town":"7 St Joseph’s Street","county":"London","postcode":"SW8 4EN"},"contact":{"website":"http://www.scitt.co.uk","email":"wpsc@scitt.wandsworth.sch.uk","telephone":"0203 488 2805","fullName":"Sam Steward"},"location":{"latitude":51.4768385,"longitude":-0.1466679},"trainWithUs":"Established in 1996, Wandsworth Primary Schools' Consortium has built up great expertise in school-based initial teacher training. Working with over twenty diverse local primary schools, three maintained nursery schools and a range of specialist settings, we provide valuable experience for trainees and prepare them exceptionally well for their teaching career.\nWe offer a gradual and well-supported entry into teaching with a blend of centre-based training and school experience. Ofsted (2017) noted that “trainees rapidly build up a wealth of knowledge, skills and experience [enabling] them to be well-prepared... confident and professional NQTs.” 100% of graduates rated the overall quality of the programme as good or excellent in our 2021 survey. Students rate the pastoral support available on our programme highly. \"To be successful and confident during your PGCE you need support. I doubt you will find a teacher training course with better support than Wandsworth SCITT\" (Oscar, Trainee).","trainWithDisability":"Based in a new-build school, we have lift access to our training centre and the space is wheelchair friendly. Our group size is small, never exceeding 28. The course director and administrator get to know individual students well from the early stages of the recruitment process. We are on-hand to support and adapt the learning experience accordingly in light of any pre-existing needs or needs that arise during the training period.\nWe work closely with our Dyslexia Ambassador; a successful maths leader and Key Stage 1 class teacher with dyslexia. He offers practical guidance on how to prepare for school experience and feel confident in the classroom. We work closely with Kingston University and dyslexic students can access support from their specialist team.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:57:04.939Z","updatedAt":"2021-10-07T20:35:26.589Z"}
