{"id":"a4e84530-e1f1-47c6-b57e-ec693d629637","name":"Plymouth Marjon University","code":"P63","type":"hei","isAccreditedBody":true,"ukprn":"10037449","address":{"addressLine1":"Derriford Road","town":"Plymouth","county":"Devon","postcode":"PL6 8BH"},"contact":{"website":"http://www.marjon.ac.uk","email":"admissions@marjon.ac.uk","telephone":"01752 636 890","fullName":"Admissions Office"},"location":{"latitude":50.4197618,"longitude":-4.1104325},"trainWithUs":"Plymouth Marjon University is celebrating 180 years of teacher training and is still dedicated to preparing the next generation of teachers for the best profession in the world.\nOur University led and school led programmes are designed to train trainee teachers to become highly reflective teachers. The Guardian ranks us 6th best university in the UK for education courses, out of 80 universities, and 1st in Devon and Cornwall. At Plymouth Marjon learning and teaching is underpinned by research, policy and practice. The Complete University Guide 2021 No. 1 in England for student satisfaction. and the National student survey 2021 ranks us as number 1 in England for Learning Community\nVision of Excellence: We will build on a unique and long standing heritage through the development of a values-based collaborative partnership that ensures excellent outcomes for pupils, trainees and teachers. Plymouth Marjon is a small university with a green and spacious campus, and world-class facilities in a spectacular part of the world. With strong support and an ambitious community, its students achieve more than they ever thought possible. Complete University guide 2019 stated 'Plymouth Marjon University has long-established expertise in teacher training reflected in the numbers of postgraduate students choosing to study at the university.' The University's aim is to support you during your NQT period and beyond. Leo Data 2018 shows Marjon teachers are 6th highest earners in England and Wales 5 years after qualifying, showing they are not just job ready but also promotion ready.","trainWithDisability":"The University has an experienced team providing information, guidance and support to prospective and current students, relating to all forms of disability and medical conditions and specific learning difficulties, including dyslexia. The Disability Team is able to advise you prior to applying and through the application process. Prospective students are encouraged to make early contact with the Disability Team and also to disclose their disability at the application stage. Disability & Inclusion Advice Service provides appropriate information, advice, guidance and support relating to inclusion issues including a wide range of disabilities, medical and mental health conditions and formally diagnosed specific learning difficulties (SPLD's) such as dyslexia and dyspraxia. We are available to talk or meet with prospective students (see contact details below). All Marjon students who are eligible can apply for appropriate support from DIAS\nPre-entry information, advice and guidance For eligible students, guidance in applying for DSA's (Disabled Students Allowances)\nAppropriate liaison with Academic Departments relating to on course support Wider liaison where appropriate with other areas of Marjon\nWe offer:\nA confidential service\nAppointments to meet individual support needs\nArrangement of one to one support where funding permits specialist study tuition (for students with SpLDs and/or other communication disorders), non-medical assistance and specialist mentoring.\nContact the DIAS team, find out if your are entitled to any one to one support.\nIf you have other needs re placements e.g you have dependents and need to be in a specific area we encourage you to apply early in the cycle.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"createdAt":"2021-07-06T17:57:01.139Z","updatedAt":"2021-09-01T17:35:30.504Z"}
