{"id":"a55a1c70-d33a-4443-94e6-8a7d62da51af","name":"Kirkbie Kendal School","code":"1HZ","type":"lead_school","isAccreditedBody":false,"urn":"136671","ukprn":"10033386","address":{"addressLine1":"Kirkbie Kendal School","addressLine2":"Lound Road","town":"Kendal","county":"Cumbria","postcode":"LA9 7EQ"},"contact":{"website":"http://www.kirkbiekendal.cumbria.sch.uk/school-direct/271.html","email":"nclarke@kksa.co.uk","telephone":"01539727422 (ext 221)","fullName":"PGCE Co-ordinator"},"location":{"latitude":54.3175449,"longitude":-2.7410441},"trainWithUs":"Since September 2011, Kirkbie Kendal School (KKS) and University of Cumbria (UoC) have worked in partnership to provide a unique school-based PGCE course. The course contains both KKS School Direct (SD) trainees and UoC 'core' trainees that are taught together as one cohort at KKS. Our cohort (typically 12-14 trainees), is small enough to allow us to know each trainee’s individual strengths and developmental needs.\nOutcomes for trainees are exceptionally high: 97% of trainees have completed the course and achieved both their Post Graduate Certificate in Education (PGCE) and Qualified Teacher Status (QTS) since the course commenced in 2011. 98.5% of these have been graded as either outstanding or good.* *Figures do not include the 2019-20 cohort as these trainees were not graded at the end of their course due to Covid-19.\nKKS is part of the South Lakes Federation teaching school alliance. We work in partnership, and place our trainees, with these and many other schools from a wider geographical area; from North Cumbria to North Lancashire. All of our partnership schools aim to maximize the potential and training opportunities for our trainee teachers on placement. KKS is located in the market town of Kendal. Situated at the Gateway to the Lake District, it is only six miles from junction 36 of the M6 Motorway. Oxenholme Lake District main line west coast station is only a mile from the school’s campus.","trainWithDisability":"The school works closely with the university's SEN/D and occupational health teams to support candidates who may have disabilities or other learning needs.\nIn the past, this has included supporting a trainee with a hearing impairment by adapting the teaching pedagogy employed and carefully selecting the most appropriate teaching placement schools.\nIt should be noted however, that due to the physical infrastructure of the lead school, it is not possible to have trainees in wheelchairs on the course.","accreditedBodies":[{"id":"9be9f611-2d36-431a-9109-7fcbbfc88fc8","code":"C99","name":"University of Cumbria","description":""}],"createdAt":"2021-07-06T17:53:57.255Z","updatedAt":"2021-07-06T17:53:57.255Z"}