{"id":"a56784f7-c2a4-4576-b40f-c90e1f59c7cf","name":"Challoners High Bucks Hub","code":"2FX","type":"lead_school","isAccreditedBody":false,"urn":"137219","ukprn":"10034632","address":{"addressLine1":"Dr Challoner’s High School","addressLine2":"Cokes Lane","town":"Little Chalfont","county":"Buckinghamshire","postcode":"HP7 9QB"},"contact":{"website":"https://www.challonershigh.com/train-to-teach","email":"ITTbuckshub@challonershigh.com","telephone":"01494 763296","fullName":"Kate Brown"},"location":{"latitude":51.6672689,"longitude":-0.5701499},"trainWithUs":"The Challoner's High Bucks Hub forms part of 'The Partnership' comprising schools within Danes Educational Trust, Dr Challoner's High School partners, and Herts and Bucks Challenge Partners Hub. As a conglomerate of schools, we have considerable experience training teachers and both recognise and value the contribution these practitioners make to our respective communities. We offer School Direct salaried and unsalaried teacher training routes across the full range of curriculum subjects. The training programme is structured to allow trainees to develop the skills required by teachers to teach the subject that they are training in and to develop specific expertise for making a distinctive contribution in their settings. A Subject and Teacher Mentor directs the development of subject knowledge for teaching in school settings. All schools within 'The Partnership' employ a Professional Mentor to oversee and quality assure the provision of training within the school. The programme enables trainees to have a clear understanding of learning theories and child development and how this impacts on student learning and informs their own development as a teacher. Trainees will have the opportunity to spend time in at least one of the other partnership schools to ensure a contrasting and comprehensive experience. As well as first class mentoring in school, trainees will participate in full-day conferences and shared professional studies sessions. These sessions can be tailored to the strengths and development needs of each individual. Feedback from trainees is extremely positive with all trainees securing Newly Qualified Teaching roles for the following academic year.","trainWithDisability":"Training to be a teacher can be very rewarding, but also tiring and, at times, frustrating. We are here to assist trainees through both the \"peaks and troughs\" of their school placements and hope that the experience is enjoyable, professionally satisfying and personally fulfilling. Schools within 'The Partnership' are committed to making reasonable adjustments for disabled staff and to ensure that the needs of disabled staff are accommodated in the school environment, as far as is reasonably practical. Throughout the trainee’s time at school the Teacher Mentor will provide professional support and guidance and will have weekly scheduled meetings with the trainee. This process will be overseen by the Professional Mentor. In addition to the more formal aspects of the training, however, it is hoped that the trainee will regard both the Teacher Mentor and the Professional Mentor as confidantes and that they will be able to turn to both should difficulties arise. Please contact the Lead Schools for further advice and guidance on an individual basis.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"feecdec5-259c-45e3-b1cf-4e391936ee90","code":"H36","name":"University of Hertfordshire","description":"The School of Education at University of Hertfordshire (UH) offers strong ongoing partnerships with local schools, excellent support throughout teacher-training and outstanding levels of employment to a first teaching post.\\r\\n\\r\\nUH is among the top 25% of providers by the Department for Education and has been consistently rated good (Ofsted 2005-6, 2010-11, 2013-14) in Ofsted inspections.\\r\\n\\r\\nGraduate employability is amongst the highest in the country; many student teachers secure employment in our Partnership Schools. UH works with over 300 schools across Herts, Beds, Bucks, and Cambs."}],"createdAt":"2021-07-06T17:53:38.880Z","updatedAt":"2021-09-29T19:20:47.167Z"}
