{"id":"a56b6aa1-6635-4c32-8ec3-fcd752cb7968","name":"AA Teamworks West Yorkshire SCITT","code":"2AT","type":"scitt","isAccreditedBody":true,"ukprn":"10032342","address":{"addressLine1":"West Vale Primary School","addressLine2":"Stainland Road, Greetland,","town":"Halifax","county":"West Yorkshire","postcode":"HX4 8LS"},"contact":{"website":"https://aateamworksscitt.org/","email":"enquiries@teamworkstsa.org","telephone":"7828886534","fullName":"Jo Pearson"},"location":{"latitude":53.6896047,"longitude":-1.8706233},"trainWithUs":"Training with AA Teamworks is a great way to kick start your teaching career; we are very proud of the quality of our partnership, our curriculum and our pastoral support.\nFrom the start of the programme trainees are fully immersed into school life, building up their confidence and school contact time as they go on. We offer both primary and secondary training in a wide range of subjects and work with a collection of schools in West Yorkshire and East Lancashire. We offer diverse teaching placements (including time in special schools), ensuring trainees have experience in different types of school environments, preparing you for when you complete the programme and begin your ECT year. AA Teamworks is one of only 33 schools to be awarded research school status by the Education Endowment Fund (EEF) & The Department for Education (DfE) giving our trainees access to the latest evidence-based practices . Out teaching team are dedicated and experienced educators who work to create a personalised learning experience. Once training is complete we recommend you for QTS status and a PGCE is awarded from The University of Huddersfield. Working with The University of Huddersfield also provides our trainees with full access to all their facilities. Applicants who do not qualify for a DfE bursary are awarded a bursary of £500 and all trainees are provided with a laptop through the programme.\nAA Teamworks cannot sponsor study visas and all applicants need to have the right to study in the UK on application","trainWithDisability":"At AA Teamworks we are fully committed to supporting every student; identifying and addressing barriers are central to provision. Our training facilities also comply with the current accessibility legislation. We provide a laptop and can add assistive technology to support students with writing and the production of assessments. For academic assignments learning support services are available vis our HEI partner. All training materials are hosted online to access during and after sessions.\nWe provide all trainees with additional support for wellbeing from the Education Support Charity, which gives them all access to free counselling for personal and financial issues. All trainees have a personal tutor who is there to support pastoral care and well being.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:49:23.646Z","updatedAt":"2021-09-28T15:03:55.359Z"}
