{"id":"a58030f9-9701-4856-859f-feca6405ddd6","name":"St Stephen’s CofE Primary School","code":"2E4","type":"lead_school","isAccreditedBody":false,"urn":"101142","ukprn":"10073995","address":{"addressLine1":"91-99 Westbourne Park Road","town":"London","postcode":"W2 5QH"},"contact":{"website":"https://www.st-stephensprimary.co.uk/","email":"admin@teachinglondon.org","telephone":"2079321126","fullName":"Simon Atkinson"},"location":{"latitude":51.5190811,"longitude":-0.1957376},"trainWithUs":"Our school has been serving the community in Westbourne Park for over 150 years. Today we are proud to serve a diverse neighbourhood and welcome children and families of many cultures and heritages. Within our Victorian façade you will find a welcoming, bright, happy and thriving school environment where children enjoy their learning and strive for the very best.\nSt Stephen’s is a Church of England Voluntary-Aided primary school that offers an education in an inclusive environment. Children and staff are of all faiths and everyone is welcome at our school, where we aim to promote understanding, tolerance and mutual respect.\nTrainee teachers are welcomed as part of our team and we strive to support their progress and development towards becoming outstanding practitioners.","trainWithDisability":"St Stephen’s is housed in an historic school building which has been added to over many years. This places constraints on the movement around the building which is by many stairs. There are accessible schools within the partnership though, so candidates are encouraged to get in contact if they have particular requirements. Teaching London: LDBS SCITT has a degree of step-free access, but as the building was a Victorian school, we are unable to fully accommodate wheelchair access. We are always willing to discuss, and where possible, adapt to meet individual needs.\nThe well-being of our trainees is paramount, which is why you will be automatically enrolled into the Employee Assistance Programme with the Education Support Partnership. This provides 24/7 individual support and counselling, in addition to our in-house advice and support.\nWe also have experience in supporting trainees with a diagnosis of dyslexia and are able to offer specialist support on the course.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:53:39.711Z","updatedAt":"2021-07-28T01:08:55.680Z"}
