{"id":"a64cca18-10ce-40af-b3b4-423d792e1ada","name":"Spiral Partnership Trust","code":"2E7","type":"lead_school","isAccreditedBody":false,"urn":"139159","ukprn":"10046090","address":{"addressLine1":"Fleetville Junior School","addressLine2":"228 Hatfield Road","town":"St Albans","county":"Herts","postcode":"AL1 4LW"},"contact":{"website":"https://www.spiral.herts.sch.uk/","email":"exechead@spiral.herts.sch.uk","telephone":"01727 519220","fullName":"Amanda Godfrey"},"location":{"latitude":51.7514886,"longitude":-0.3146468},"trainWithUs":"We believe that teaching is an exciting, challenging and rewarding profession. Our training programmes is delivered in partnership with Forest Independent Primary Collegiate. Spiral Trainees join their 'home school' teaching team, working with excellent teachers who support and develop their skills and knowledge as they progress to QTS. Trainees regularly meet together to train and learn - sharing experiences and developing a network to support them. At the end of the training year we hope all of our trainees will stay with us and join our schools as Newly Qualified Teachers, well prepared for life in the classroom and looking forward to successful careers as primary teachers.\nThis is a challenging programme but our experience shows that it is the best way to prepare for real-life in the classroom. During the year trainees have a placement in a school which provides a contrasting setting, throughout the year they are supported by their mentor and professional tutor. Our growing training partnership of primary schools in and around St Albans, Hemel Hempstead, Welwyn and east Herts provide the opportunity to work in different schools during the training year.\nWe are looking for candidates who have a true vocation to be a teacher, who naturally enjoy working with children, are fascinated by how children learn and have the resilience and determination to deal with the challenges the job brings whilst appreciating the inspiring reward that making a difference to a child's life can bring.","trainWithDisability":"Spiral is proud to be an inclusive provider, meeting the needs of children and adults. We welcome applications from candidates with special educational needs and disabilities. We aim to meet the challenge of all declared disabilities and other needs placing candidates in our diverse range of schools, all our locations are all DDE compliant. We are committed to supporting the full inclusion of individuals ensuring their needs are met.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:47:26.969Z","updatedAt":"2021-10-04T18:14:06.845Z"}
