{"id":"a6a60029-f606-42b6-b526-48360b61890c","name":"Partnership London SCITT (PLS)","code":"2B1","type":"scitt","isAccreditedBody":true,"ukprn":"10053276","address":{"addressLine1":"c/o Sydney Russell School","town":"Dagenham","county":"---","postcode":"RM9 5QT"},"contact":{"website":"www.partnershiplondonscitt.com","email":"info@partnershiplondon.com","telephone":"2039599900","fullName":"Jenny Wake"},"location":{"latitude":51.5486077,"longitude":0.1340839},"trainWithUs":"‘Inspiring today’s learners to be tomorrow’s leaders’. We see teaching as a vocation and we aim to recognise and respond to the talents and needs of every trainee and provide the best means of developing their full potential. We aim to recruit, train and retain the very best teachers. A key part of our philosophy is that we ensure equality of opportunity and welcome, value and respect all who train with PLS.\nWe aim to build a learning community based on justice and a sense of personal responsibility. Central to our philosophy is promoting dialogue and cooperation with the wider community and encouraging a commitment to life-long learning.\nPLS is led by two East London schools, Sydney Russell in Dagenham and St Angela’s Ursuline in Newham both with long track records of outstanding teacher training. Now, as a SCITT, we're in the position to offer you top class training from outstanding professionals in a vibrant teaching atmosphere. The perfect start to your career.\nFrom the outset you will be part of the school staff. You will be seen by colleagues and students as a member of staff and not a ‘trainee’ who arrives later in the year. This seemingly small point makes a huge difference to your standing in school and provides a firmer platform from which you can develop your teaching skills. Our courses give you the very best of both worlds: theory, practice, professional development and placements with colleagues who really want to make you an outstanding teacher.","trainWithDisability":"All PLS partner schools are compliant with disability access","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:56:41.671Z","updatedAt":"2021-09-28T23:10:16.069Z"}
