{"id":"a6adab46-9f62-4450-a020-27998aa416f7","name":"Preston Primary and Secondary Alliance","code":"12V","type":"lead_school","isAccreditedBody":false,"urn":"119759","ukprn":"10015259","address":{"addressLine1":"Preston Primary and Secondary Alliance","addressLine2":"Broughton High School","town":"Woodplumpton Lane","county":"Broughton, Preston","postcode":"PR3 5JJ"},"contact":{"website":"http://www.prestontsa.org.uk","email":"williamsj@broughtonhigh.co.uk","telephone":"1772863849","fullName":"School Direct Programme Leader - Jackie"},"location":{"latitude":53.8081696,"longitude":-2.7278167},"trainWithUs":"The Preston Primary and Secondary Alliance, which consists of a variety of primary, secondary and special schools all in and around the Preston area, will provide you with the opportunity of being part of a school team from the very beginning. Working in partnership with the University of Cumbria, the Preston Primary and Secondary Alliance programme provides graduates with a direct route into teaching leading to a PGCE with QTS. We work together to ensure that our School Direct training programme is of the highest quality, providing our trainee teachers with the support and resources that they will need to enable them to develop into the outstanding teachers of the future. As part of the programme you will work alongside excellent practitioners and mentors in schools that have a proven track record in providing outstanding teacher training and professional development opportunities.\nOur trainees are trained in a highly supportive environment where, through an exciting and innovative curriculum which we have designed, you will develop your professional knowledge, understanding and skills. We have a long and successful track record of teacher training and the majority of our trainees are now employed in our own or in other schools in the Preston area.\nFeedback from our previous and current School Direct trainees has been consistently outstanding with appreciation for the welcome and support received in their host schools and high-quality, popular training from our school specialists on our Conference Days.","trainWithDisability":"We are committed to ensuring that our trainees are able to participate effectively in all aspects of the course. The University of Cumbria defines disability broadly, including mobility impairments, sensory impairments, medical conditions, autism (ASD), specific learning difficulties (SpLDs such as Dyslexia or Dyspraxia) and mental health conditions. Here at the Preston Primary and Secondary Alliance we recognise that if we provide a fully inclusive working and studying environment, we will enable everyone to perform to the best of their ability.\nThe University has a disability statement that details the adjustments that are available to you. The adjustments detailed in the statement are part of the basic offer and other adjustments are available dependent on your needs. Support is available to you at interview and on your academic course such as additional time and the University has various specialist advisers who have a range of different roles. On application do make us aware of any particular accessibility needs in order that we can accommodate these during training and on school placements.\nAll our students have access to University of Cumbria support as well as that offered by our school direct partners. Much of this university-based support is available online and electronically and so accessible at a distance.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-12T20:49:22.875Z","updatedAt":"2021-10-05T20:10:24.883Z"}
