{"id":"a6f3d97f-bfe0-4a8a-a4f0-1e40ab598574","name":"The Lion Alliance","code":"1K1","type":"lead_school","isAccreditedBody":false,"urn":"136963","ukprn":"10034651","address":{"addressLine1":"Finham Park School","addressLine2":"Green Lane","county":"Coventry","postcode":"CV3 6EA"},"contact":{"website":"https://thelionalliance.co.uk/","email":"admin@thelionalliance.co.uk","telephone":"2476418135","fullName":"Nicola Baker"},"location":{"latitude":52.379793,"longitude":-1.526653},"trainWithUs":"The Lion Alliance is committed to providing excellent training for teachers at every stage of their career from Initial Teacher Training through to developing school leaders. Our priority is to develop and support you to become the most effective practitioner you can be. Training with us gives you access to a wide range of highly experienced professionals, all at different stages of their career, who will help in your journey to qualify and enter the teaching profession. Our Alliance consists of a growing number of primary and secondary schools, located across Coventry and Warwickshire, meaning that we are able to offer you the opportunity to develop your practice and classroom craft in different schools, in different key phases and in different settings. We offer exceptional support to all of our trainee teachers. Once qualified, training and support doesn’t stop there; we believe in the importance of Continuing Professional Development and use the expertise of colleagues within The Lion Alliance and strategic partners to deliver a range of CPD courses, career stage professional development, as well as bespoke training and CPD.","trainWithDisability":"The Lion Alliance welcomes applicants with disabilities. We collaborate with highly experienced professionals in each school who always ensure the training year is flexible and inclusive to all. We would welcome working alongside trainees in making necessary adjustments to ensure the day to day environment is as accessible as possible.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"62d5803b-89ca-4e21-bb6f-5c74944c56ad","code":"B25","name":"Birmingham City University","description":"Birmingham City University (BCU) is the second university partner that we have engaged with and has meant we have been able to expand our reach across the Coventry and Warwickshire area as well as the range of courses on offer. \\r\\n\\r\\nTheir program is extremely flexible with trainees spending more time with the university to learn academic and subject pedagogy before starting their placements with us in the Lion Alliance. This allows trainees to come into schools and have a deeper understanding of the different ways in which they can teach through self-reflective learning and development."},{"id":"26797ebf-f835-47c8-9369-7d6d67fb2343","code":"C85","name":"Coventry University","description":"Coventry University has a local and world renowned reputation as an institution of excellence. They have now begun to offer varied teacher training courses, which are an area of growth across the United Kingdom, and have already developed a strong programme of study in Initial Teacher Training.\\r\\n\\r\\nTheir programme is hugely flexible, with seminar content being delivered virtually. This means there is less time spent at the university and more time for trainees to listen, reflect and learn. They also offer several start dates throughout the academic year, again offering more flexibility."},{"id":"ef09ce50-ccfc-4346-a0ce-43e840153dab","code":"W20","name":"University of Warwick","description":"The University of Warwick has been our longest standing partner. They provide high-quality support to students whether they’re at the university or learning in role in one of our Lion Alliance schools.\\r\\n\\r\\nTheir programme of learning is rooted in innovation and creativity and its supportive central team share the belief that a good education is the key to a successful life. They are extremely passionate about their students and ways in which they can support them, and have clear processes that both partners and students follow so that they can get the most from their training."}],"createdAt":"2021-07-06T17:54:10.864Z","updatedAt":"2021-10-01T20:13:58.745Z"}
