{"id":"a74e16c5-d5e0-447f-ab88-d716e0a42d68","name":"Swale Academies Trust - East Sussex ITE","code":"4T8","type":"lead_school","isAccreditedBody":false,"address":{"addressLine1":"Langney Primary Academy","addressLine2":"Chailey Close","town":"Eastbourne","county":"East Sussex","postcode":"BN23 7EA"},"contact":{"email":"louise.hopkins@swale.at","telephone":"7946075608","fullName":"Louise Hopkins"},"location":{"latitude":50.7983645,"longitude":0.3147142},"trainWithUs":"The Swale Academies Trust based in Kent came into being in September 2010 as one of the first few Academy Converter Schools based around Westlands School in Sittingbourne. As a National Support School and an Academy Sponsor Westlands and Swale Academies Trust have developed into one of the South East’s leading Academy Sponsors with currently six secondary schools and ten primary schools within the Trust. Swale Academies Trust is constituted as a multi-academy trust (MAT).\nA glance at the most recent Ofsted reports will all point to the effectiveness of the Trust in bringing about change, providing and enabling excellent leadership. \nWe don’t seek to develop clone schools that deliver education in a regimented manner, we value the development in our schools of a spirit of enquiry and action research that provides the best possible education that is right for pupils in a local setting. We do however collectively value and strive for all pupils to produce beautiful work which showcases their development over time of which they, their teachers and support staff and parents can be really proud. We are proud of our schools and we strive for a sense of shared pride in the achievements of all of our students. Our ambition is driven by enabling schools and children to succeed. \nThe Trust is an organisation which is driven by the belief that all children deserve a good quality education where they are seen as special, unique and above all are exceptionally well cared for.","trainWithDisability":"We will endeavor to support any candidates with any disabilities or additional needs wherever possible.","accreditedBodies":[],"createdAt":"2021-07-06T17:47:18.063Z","updatedAt":"2021-10-06T19:13:44.642Z"}