{"id":"a75b62b0-5048-4e6d-8b2d-d29c8d002f0a","name":"St. Mary’s Learning Alliance","code":"2BJ","type":"lead_school","isAccreditedBody":false,"urn":"125194","ukprn":"10076290","address":{"addressLine1":"St. Marys CoE Primary School","addressLine2":"Silkham Road","town":"Oxted","county":"Surrey","postcode":"RH80NP"},"contact":{"website":"https://stmarysprimary.org/","email":"s.davison@stmarysprimary.org","telephone":"01883 712817","fullName":"Sarah Lewis"},"location":{"latitude":51.262561,"longitude":-0.0072832},"trainWithUs":"The St Marys Learning Alliance is a Primary Learning Alliance based in Tandridge, Surrey\nIn order to work effectively as a Teaching School, we work with a partnership of local schools in order to ensure that our Teaching School offer is broad, that it draws upon the expertise from a range of schools and school leaders and that it supports the system-led model of school improvement. These partners are essential for the range, depth and quality of our work and offer.\nAlthough a small Alliance you will see the breadth of our offer which clearly demonstrates our commitment to the professional development of all who work within schools, and our desire to ensure every child receives high quality teaching and learning.\nAll our partner schools work together, ensuring that we provide training, support and learning in our locality. All our schools are vibrant and inclusive offering the very best education and support for their local communities. We have been successfully offering ITT courses for the past five years linking with both the University of Brighton and Canterbury Christ Church University.\nWe also link with the Surrey South Farnham SCITT Partnership for Teacher Training - https://www.south-farnham.surrey.sch.uk\nFor more information please look at our website (www.stmarysprimary.org) or through our main site https://stmarysprimary.org/","trainWithDisability":"Choosing to undertake a postgraduate qualification is an important decision– whether you are currently in full-time or part-time study, pursuing your chosen career and aiming to boost your potential, considering a career in academia or simply want to immerse yourself in a subject, you are passionate about.\nWe welcome all applicants. We will support all applicants fully as a Learning Alliance linking with the training University as appropriate.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"1165d5fd-11f4-4dab-99c9-47b309481463","code":"C10","name":"Canterbury Christ Church University","description":"Canterbury Christ Church University has received a prestigious Silver award for teaching excellence, ‘exceeding’ national quality requirements for UK universities.\\r\\n\\r\\nWe are delighted that the TEF panel has rated our undergraduate teaching as Silver. The rating demonstrates that our students ‘achieve excellent outcomes in employment or further study’ and indicate ‘high levels of student satisfaction’.\\r\\n\\r\\nIt also reflects our strong commitment to ensuring students of all abilities, and from all backgrounds, succeed and reach their full potential"},{"id":"d2ba71f2-c125-4d86-bb22-736e67043120","code":"B72","name":"University of Brighton","description":"Become a teacher and inspire the next generation – there’s no better place to train than the University of Brighton. \\r\\n\\r\\nWe’re ranked in the top 20 for education courses in England, Complete University Guide 2022, and in the top 15 in the UK, The Times League Tables 2021.\\r\\nWe offer undergraduate and postgraduate routes into teaching primary, secondary and further education\\r\\n\\r\\nWe were rated ‘outstanding’ by Ofsted in our most recent inspection for early years, primary and secondary initial teacher training and ‘good’ for further education\\r\\n\\r\\nOur graduates consistently enjoy above sector average rates of employment"}],"createdAt":"2021-07-06T17:49:58.292Z","updatedAt":"2021-11-23T22:34:36.476Z"}
