{"id":"a782d090-8a18-4519-85a9-a8e6e8598ce5","name":"Yorkshire Schools Alliance","code":"15X","type":"lead_school","isAccreditedBody":false,"urn":"137139","ukprn":"10034857","address":{"addressLine1":"St Aidan’s CE High School","addressLine2":"Oatlands Drive","town":"Harrogate","county":"North Yorkshire","postcode":"HG2 2JR"},"contact":{"website":"yorkshiresa.co.uk","email":"admin@yorkshiresa.co.uk","telephone":"01423 818512","fullName":"Administrator"},"location":{"latitude":53.9865944,"longitude":-1.5252071},"trainWithUs":"Yorkshire Schools Alliance is a partnership of Yorkshire Secondary Schools working alongside three of the top Universities in the region. Together we provide an outstanding School Direct PGCE programme for prospective teachers.\nWe are driven by a moral purpose motivated by our desire to ensure young people have the best educational opportunities in life.\nOur alliance is underpinned by relationships built on trust, care and the consideration of individual contexts,in order to provide support within a sustainable framework, in which everyone feels valued. We work with Universities in both Leeds and York so our trainees can apply to a training programme as convenient to them as possible.\nDrawing on our partnerships, we are able to provide expertise from a variety of different school and university educational contexts. As an alliance we strive for excellence built on an academic foundation that draws on the best in educational research and long standing collaboration.\nAt the centre of our work is our priority to develop teaching and learning in order to make a tangible impact on young people by developing teachers and leaders of the future. We value good relationships with all our trainees and this is reflected in our retention rates with over 95% of our students successfully completing the course each year. For the last two years over 75% of our trainees have found employment before the end of their training year.\n[http://yorkshiresa.co.uk/itt/why-choose-us/]\nadmin@yorkshiresa.co.uk","trainWithDisability":"The YSA and all our University Partners are committed to offering opportunities and training inclusively to all candidates including those with disabilities and other needs. St Aidan's, our Lead School in Harrogate has a large and well respected learning support department which means that as a site (and as a school) we are familiar with accommodating at range of needs and have the facilities to be able to do this without difficulty. All our partner universities and schools are also familiar with working with trainees with a range of different needs or disabilities and all of our Universities have occupational health departments on hand for additional support where necessary.","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"accreditedBodies":[{"id":"154509e2-743e-4f0b-9d99-396393aa57ff","code":"L27","name":"Leeds Beckett University","description":""},{"id":"19a3446e-382d-4c14-83bb-a76563cef3c1","code":"L24","name":"Leeds Trinity University","description":"We work with Leeds Trinity University to offer a number of our school direct course. LTU is a widely respected institution with an excellent reputation for training teachers.\\r\\n\\r\\nOur PGCE courses with LTU lead to QTS and the award of a level 7 Postgraduate Certificate in Education (PGCE).\\r\\n\\r\\nThese courses are open for applications from October 2021 to begin studies in September 2022."},{"id":"3117eaa6-b483-49de-92a2-ee4ead1b0903","code":"Y50","name":"University of York","description":"Our School Direct UOY programme offers training across the 11-16 years age range. Training covers Professional Teacher studies and curriculum areas. This is a full time course lasting one year with a Post-16 Enhancement to provide trainees with a range of experiences to develop skills for teaching at Post 16.\\r\\nOur PGCE courses with UOY lead to QTS and the award of a level 7 Postgraduate Certificate in Education (PGCE).\\r\\nThese courses are open for applications from October 2021 to begin studies in September 2022."}],"createdAt":"2021-07-06T17:49:11.556Z","updatedAt":"2021-09-16T18:41:55.834Z"}
