{"id":"a7b4e077-ce5d-4ec3-ab33-404615fd0e6d","name":"School Direct at The Great Schools Trust","code":"2R7","type":"lead_school","isAccreditedBody":false,"urn":"138562","ukprn":"10058757","address":{"addressLine1":"c/o Kings Leadership Academy Warrington","addressLine2":"Hillock Lane","town":"Warrington","county":"Cheshire","postcode":"WA1 4PF"},"contact":{"website":"https://www.greatschoolstrust.org/schooldirect","email":"s.perrie@kingswarrington.com","telephone":"01925 817939","fullName":"Andrew Reay"},"location":{"latitude":53.4024887,"longitude":-2.5389275},"trainWithUs":"The Great Schools Trust is a values led Multi Academy Trust. Our motto ‘Credimus’, underpins our collective belief that a ‘great’ education must serve as a cornerstone for enhanced social and geographical mobility. We offer the same aspirational, social and cultural advantages, including the academic performance standards, of an independent education, we do so for free, without selection, and most critically, serve some of our most disadvantaged communities. Leadership is the trust’s specialism taught to all students through a structured weekly programme of character and leadership development. The trust’s first academy, King’s Leadership Academy Warrington became the National School of Character in 2015 and is recognised globally as a leader in this field. Rated by Ofsted as Outstanding in 2019, it is home to the trust’s teaching & leadership centre, the Institute of Character and Leadership, is presently the highest performing secondary school in Cheshire and in the top 10 highest performing free schools nationally. At the heart of our outstanding outcomes is outstanding teaching, delivered in a values based, calm and purposeful ethos. We devote 2.5 hours every week to personalised CPD and leadership development for every teacher. A high expectations, research informed culture permeates every classroom where teachers are not interrupted for a single minute by low level disruption. Behaviour and professional standards in the trust’s academies are impeccable and in nine years, King’s Warrington has not issued a single fixed term exclusion, whilst attendance and punctuality standards place it in the top 10 of all schools nationally.","trainWithDisability":"Great Schools Trust - We endeavour to provide an inclusive learning and teaching environment, in which all students can achieve their potential. The Great Schools Trust and Cumbria University are committed to Equality of Opportunity and making reasonable adjustments to support all potential candidates in applying and succeeding in teacher training. We have a dedicated support tutor, who supports our trainees with disability or any other need.\nThe university of Cumbria - We are all different and each have our own unique ways of learning, at the University of Cumbria we offer students an individualised SPLD action plan designed to give you the extra support you need to excel in your studies.\nWe aim to provide a supportive environment that allows all individuals to flourish, and actively encourage applications from disabled people. We are committed to widening participation and provide a range of services to enable those with disability or specific learning difficulty (SpLD) to access their chosen course.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"9be9f611-2d36-431a-9109-7fcbbfc88fc8","code":"C99","name":"University of Cumbria","description":"As a student at the University of Cumbria, you are part of an inclusive learning community that recognises diversity. You will have opportunities to learn by interacting with others in a collegiate, facilitative and dynamic learning environment. Teaching, assessment and student support will allow equal and equitable opportunities for you to optimise your potential and develop autonomy.\\r\\n\\r\\nUniversity of Cumbria seek to create a stimulating and innovative community of learning, whether encountered on campus or at a distance, or on placement. Facilitated by our expert practitioner staff, you will experience a learning environment that is well equipped, flexible, and stimulating."}],"createdAt":"2021-07-06T17:49:32.510Z","updatedAt":"2021-09-16T15:15:29.935Z"}
