{"id":"a7f99f95-5c50-476f-882d-d79e366cddb3","name":"Northampton School for Boys","code":"16G","type":"lead_school","isAccreditedBody":false,"urn":"136299","ukprn":"10031382","address":{"addressLine1":"Northampton School for Boys","addressLine2":"Billing Road","town":"Northampton","county":"Northamptonshire","postcode":"NN1 5RT"},"contact":{"website":"http://nsb.northants.sch.uk","email":"jdruker@nsb.northants.sch.uk","telephone":"1604230240","fullName":"Mr M Edwards"},"location":{"latitude":52.2392573,"longitude":-0.8672386},"trainWithUs":"Northampton School for Boys, an Ofsted 'Outstanding' school (Nov 2014) is the Lead School for our SCITT - Northampton Teacher Training Partnership (NTTP) which is an Ofsted 'Outstanding' ITE Provider (2018). Your training will be with NTTP, a School-Centred Teacher Training provider based on the school site. We offer a one year full-time Secondary (11-16) teacher training course with a Post Graduate Certificate in Education validated by Newman University. Many of the partnership schools have ex-trainees as members of staff, some of whom work as School Based Tutors for us. The partnership is comprised of schools which offer a wide range of different experiences for our trainees.\nThe vast majority of trainees who successfully achieve both QTS and an academic award, gain employment in local schools, which is a huge strength of the partnership together with an excellent completion and retention rate. Our Key Strengths are: * Trainees professionalism - trainees develop good relationships with staff and pupils encouraging high expectations of the learners.\n*The pivotal role of administrative support - facilitating excellent communication across the partnership that benefits support for and attainment of the trainees.\n*Consistently good quality school placements, providing a range of contrasting experiences and carefully match them to the individual needs of the trainees.\n*The expertise of school-based tutors in coaching the trainee towards improvement\n* Strong shared ethos of pastoral care facilitating swift and effective intervention and support for trainees.","trainWithDisability":"We encourage applications from all spheres of the community regardless of age, race, disability, religion and gender.\nWe support trainees with a wide variety of needs both during centre-based training and on school placements. The programme is personalised to be supportive and challenging for each trainee. We work closely with Newman University (PGCE Validating body) to ensure that trainee needs are met.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:53:09.296Z","updatedAt":"2021-09-29T21:37:28.966Z"}
