{"id":"a85d1731-bf24-4734-9a72-5719cd94584c","name":"Gipsy Hill Federation","code":"1BC","type":"lead_school","isAccreditedBody":false,"address":{"addressLine1":"Kingswood Primary School Upper Site","addressLine2":"188 Gipsy Road","county":"London","postcode":"SE27 9RD"},"contact":{"website":"http://www.ghfteachingschool.london","email":"teachingschool@ghf.london","telephone":"020 8670 3576","fullName":"Saleh Ahmed"},"location":{"latitude":51.4270921,"longitude":-0.0909446},"trainWithUs":"Kingswood Primary School is the lead school for Gipsy Hill Federation (GHF), a group of 6 primary schools across the boroughs of Lambeth and Southwark. All our schools provide an optimum learning environment in which high achievement, positive self-esteem, respect and educational excellence are valued by everyone in a caring and supportive atmosphere.\n\nAs a School Direct student you will be enriched with maximum peer support across our 6 schools and receive full support from a strong leadership team. You will be based in a class where you will receive support from an experienced class mentor a well as a school based mentor, University supervisor and academic advisor. You will benefit from contributing to a large and experienced team and being a part of a family of schools that provide an outstanding education. We have one mission and that is to provide a world class education to all our children.","trainWithDisability":"Disability & Dyslexia Support (DDS) is a dedicated service for students who have a disability, mental health condition, medical condition or specific learning difficulties (including dyslexia).\nDDS provide advice on available support and will help coordinate your support to ensure that there are no barriers to your learning, enabling you to get the most out of your time at LSBU. We understand that every student is different and that each person’s disability can affect them in different ways. By discussing your needs and tailoring an individual support plan, we aim to help you achieve the success you’re capable of.\nIf you want to declare a disability, discuss the support that might be available to you, or just find out a little more, you can call us 0207 815 6454, email us at disability@lsbu.ac.uk or come and find us at the Student Life Centre helpdesk in the Student Centre.","accreditedBodies":[],"createdAt":"2021-07-06T17:51:16.944Z","updatedAt":"2021-07-06T17:51:16.944Z"}