{"id":"a8941d3d-10de-4d07-84f8-ba1391d1d958","name":"Saffron Walden County High School","code":"5A7","type":"lead_school","isAccreditedBody":false,"urn":"136776","ukprn":"10033783","address":{"addressLine1":"Audley End Road","town":"Saffron Walden","county":"Essex","postcode":"CB11 4UH"},"contact":{"website":"https://www.swchs.net/page/?title=Teacher+Training+Opportunities&pid=38","email":"phaslam@swchs.net","telephone":"1799513030"},"location":{"latitude":52.0172822,"longitude":0.2307005},"trainWithUs":"Saffron Walden County High School offers school-centred teacher training as a lead school with the accredited provider Cambridge Teaching Schools Network, CTSN SCITT, who train across the Eastern Region.\n* As a lead school, we endeavour to place trainees within our local network. However, to ensure high quality placements for all trainees, we may draw on training placements across the wider CTSN SCITT network.\n* All applicants are able to choose whether they attend the Core Training in Cambridge or Bury St Edmunds.\n* There is a wide range of placement schools across the CTSN SCITT network.\n* Most trainees get jobs working in local schools. * Course tutors are expert teachers, which means that our training is not only evidence-based, but also informed by current practice. * Non salaried (tuition fee) routes lead to QTS plus PGCE, with the Anglia Ruskin University.\n* Salaried routes are also available, leading to QTS.\nPlease see [CTSN SCITT](https://ctsnscitt.info) or more information.","trainWithDisability":"Teachers with disabilities make an important contribution to schools both in the classroom and in shaping the wider culture and ethos of the schools they work in. Schools value diversity and the unique contribution that all their staff and trainees bring. If you have a disability, you shouldn’t be dissuaded from applying. If you are invited to attend an interview, and have any special requirements, please let us know beforehand so that we may make reasonable adjustments for you. We want all interview candidates to have an equitable and enjoyable experience, regardless of any disability. Full details are on the Department for Education website.\nAll trainees are required to complete a medical check when they receive the offer of a training place. This will identify if there are adjustments required. As a training provider, CTSN will make such adjustments in our training. We encourage all trainees to disclose all relevant information with their placement schools as this will enable them to make suitable provision. Schools have experience of making provisions for their own students and are therefore well placed to offer similar adjustments for trainee teachers. If you receive an offer, but have not yet disclosed a disability or other need, you can disclose at any time.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"16075b74-df88-4bcc-b3ce-6e42f63261d5","code":"1WO","name":"The Cambridge Teaching Schools Network, CTSN SCITT","description":"The Cambridge Teaching Schools Network Training Partnership (Marketing name: The Cambridge Teaching Schools Network, CTSN SCITT) offers school-centred teacher training across the Eastern Region."}],"createdAt":"2021-08-18T17:53:25.606Z","updatedAt":"2021-10-14T20:19:20.598Z"}
