{"id":"a905ee5d-6d8f-4a5f-966f-e1def5bf12e6","name":"Fairfax Academy","code":"9J3","type":"lead_school","isAccreditedBody":false,"urn":"136908","ukprn":"10055541","address":{"addressLine1":"Room CBA 0.040","addressLine2":"Chancellor’s Building, Keele University,","town":"Newcastle-Under-Lyme","county":"Staffordshire","postcode":"ST5 5BG"},"contact":{"website":"https://theoaks.org.uk/","email":"c.j.brown@keele.ac.uk","telephone":"01782 733830","fullName":"Rachel Clarke"},"location":{"latitude":52.5619363,"longitude":-1.7981158},"trainWithUs":"Fairfax Academy is a popular 11-18 comprehensive school in Sutton Coldfield. Fairfax Academy’s values are built around hard work and opportunity; we believe that every child attending Fairfax will have the chance to thrive in an atmosphere where high expectations meet endless possibilities. The Academy’s staff are knowledgeable and skilled and ensure that every child, regardless of starting point, is supported to optimize his/her academic achievements. The Academy aims to promote a sense of pride in students, through students taking personal responsibility in delivering excellence! We are Fairfax and we are proud of it!\nAchieving excellence in teaching and learning is at the forefront of all professional development at Fairfax. All teachers and support staff have the opportunity to develop their profession, through coaching, mentoring, targeted CPD and training. We are pleased to be in partnership with The OAKS to deliver Initial Teacher Training to the teachers of tomorrow.\nWe work with a hub of schools across the West Midlands region which are: George Salter Academy in West Bromwich; Ormiston Forge Academy in Cradley Heath; Ormiston NEW Academy in Wolverhampton; Ormiston Sandwell Academy in Oldbury; Ormiston Shelfield Academy in Walsall; Ormiston SWB Academy in Bilston; Tenbury High Ormiston Academy in Tenbury Wells; Wodensborough Ormiston Academy in Birmingham\nProgramme Data from last year:-\n*94% of trainees successfully completed the programme\n*90% of our trainees gained employment *100% of the cohort achieved ‘outstanding’ or’ good’\n*96% of our trainees rated our teacher training programme as ‘outstanding’ or ‘good’","trainWithDisability":"We have a dedicated Support Tutor, who supports our trainees with a disability or any other need. It is important to state that they do not assess your teaching performance. This gives you the opportunity to speak honestly about your needs, but also enables the Support Tutor to have the freedom to help you and visit you; whether you are in placement school or here at The OAKS. This support includes signposting to services who can help you, through to developing individualised learning plans which may extend beyond the course date to enable you to successfully complete the programme.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"7f349baa-f4ef-4fd5-b228-fcc56247e9b9","code":"24P","name":"The OAKS (Ormiston and Keele SCITT)","description":"We are The OAKS (Ormiston and Keele SCITT), an Ofsted Outstanding Secondary Initial Teacher Training provider based at Keele University in Newcastle-under-Lyme, North Staffordshire.\\r\\n\\r\\nOurs is an innovative and intensive one year course during which trainees will complete both the Teaching Standards, gaining QTS certification and obtain a Keele University PGCE at either level 6 or 7.\\r\\nWe believe that we provide a course that is both supportive and enjoyable, with outstanding success rates well above the national average for the Initial Teacher Training sector."}],"createdAt":"2021-07-06T17:48:48.146Z","updatedAt":"2021-09-27T16:58:13.426Z"}
