{"id":"aa023df3-b71e-4249-b9c4-41fca8bd135e","name":"University of Derby","code":"D39","type":"hei","isAccreditedBody":true,"urn":"133811","ukprn":"10007851","address":{"addressLine1":"University of Derby","addressLine2":"Kedleston Road","town":"Derby","county":"Derbyshire","postcode":"DE22 1GB"},"contact":{"website":"www.derby.ac.uk","email":"admissionsadvisor1@derby.ac.uk","telephone":"01332 591167","fullName":"Admissions"},"location":{"latitude":52.9378882,"longitude":-1.4971764},"trainWithUs":"You’re on the threshold of making one of the most important decisions of your life - to teach!\nTrain to teach at Derby and you’re on your way to a worthwhile, rewarding and enjoyable career in Teaching, one where you can truly make a difference. With a rich heritage of teacher training dating back 165 years, we’re a major provider of newly qualified teachers in the East Midlands.\nWe have a strong reputation for nurturing successful, confident and forward-thinking teachers. Our teaching courses are highly regarded, with Ofsted awarding us an ‘Outstanding’ rating for our Primary and Further Education and Skills provision. We are also currently ranked as a Top 25 institution for our Education courses. Practical teaching experience lies at the heart of all of our teacher training courses. High-quality placements in different educational settings will build your skills in the classroom and you’ll benefit from the support of expert mentors throughout. We have partnerships with over 400 schools, so we’ll arrange your placements for you.\nAt Derby, you’ll discover exciting teacher training courses which will prepare you to teach the age group of your choice - primary, secondary and post-14 learners. Whether you’re embarking on your first degree, or you’re ready to study one of our PGCE courses, we offer a choice to suit you.","trainWithDisability":"Our on-site Wellbeing Centre provides information and guidance to help you look after your wellbeing during your time at University. Here, you can book appointments with our specialist advisers or contact the service through the dedicated helpline available during the week. There’s also a free counselling service and unique workshops that you can sign up to throughout the year‌.\nFor general enquiries and appointment booking:\nTel: +44 (0)1332 593000\nE: studentwellbeing@derby.ac.uk\nE: psychologicalwellbeing@derby.ac.uk","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"createdAt":"2021-07-06T17:51:17.064Z","updatedAt":"2021-09-06T16:15:04.099Z"}
