{"id":"aa2902fe-fb2a-4c2b-80f4-d436b3239b8b","name":"King Edward’s Consortium","code":"K50","type":"scitt","isAccreditedBody":true,"ukprn":"10065300","address":{"addressLine1":"KEVI Camp Hill Girls’ School","addressLine2":"Vicarage Road","town":"Kings Heath","county":"Birmingham","postcode":"B14 7QJ"},"contact":{"website":"http://www.teachkec.org.uk","email":"office@teachkec.org.uk","telephone":"0121 441 6680","fullName":"Mrs Louise Leigh, Director of ITT"},"location":{"latitude":52.4310647,"longitude":-1.9029747},"trainWithUs":"Become a teacher, change lives with the King Edward’s Consortium. We care about the people we train and have high aspirations for them all. The King Edward’s Consortium is an exceptional school-centred initial teacher training provider (SCITT) in Birmingham. Established in 2004, we are a partnership of 22 excellent, and very varied, secondary [schools](http://www.teachkec.org.uk/About-Us/KEC-Schools/). The mixture of comprehensive, selective, mixed, single-sex, 11-16 and 11-18 schools in the partnership is a key strength.\nThe Consortium is rated the no.1 SCITT in the country in The Good Teacher Training Guide, 2017. We offer secondary fee-paying routes in the following subjects: Art and Design, Biology, Chemistry, Classics (Latin and Ancient Greek), Computer Science, Drama, English, Geography, History, Languages (French, German, Spanish), Mathematics, Music, Physics and Religious Education. Trainees train in the 11-16 phase; in addition we guarantee A' Level experience in at least one of the two placement schools. Trainees work towards a PGDE (PGDipEd (QTS)) which carries 120 credits and can later be converted to an MA in Teaching Studies. Accredited by the University of Birmingham, the PGDE is taught in-house by Consortium staff who are also Recognised Lecturers of the University. As well as providing our trainees with a stimulating and challenging programme of study, this represents excellent value for money. Find out more on our [website](http://www.teachkec.org.uk).","trainWithDisability":"We welcome applicants with special educational needs and/or disabilities. So that our trainees can flourish, we make every effort to provide reasonable adjustments at our training centre and in our schools. Please make us aware of your needs/access requirements via your application. You may also be able to access funding such as the disabled students' allowance. For more information click [here](https://www.gov.uk/disabled-students-allowances-dsas/overview).","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:52:56.717Z","updatedAt":"2021-09-16T16:12:57.806Z"}
