{"id":"aa8f69eb-d5ae-4ee3-8c1f-0ba2f8062469","name":"Teach Heart Alliance","code":"1D8","type":"lead_school","isAccreditedBody":false,"urn":"105243","ukprn":"10074951","address":{"addressLine1":"Sacred Heart R.C. Primary School","addressLine2":"Central Drive","town":"Westhoughton","county":"Bolton","postcode":"BL5 3DU"},"contact":{"website":"https://www.sacred-heart.bolton.sch.uk/initial-teacher-training-school-direct/","email":"fureyb@sacred-heart.bolton.sch.uk","telephone":"01942 634683","fullName":"Martin Johnson"},"location":{"latitude":53.5526392,"longitude":-2.5208092},"trainWithUs":"Sacred Heart is a high achieving, aspirational, innovative and creative place for children to learn. This is because of our highly dedicated team who work in partnership with our families to ensure an up to date curriculum is offered, enhanced by our unique attributes. We are an outstanding school. Many of our staff work as System Leaders to promote the common good in education across our Alliance and beyond.\nOur Specialist Leader in Cultural Education leads our ITT provision, along with our National Leader of Education, focused on developing and promoting high standards and successful teaching and learning.\nEffective peer-peer staff coaching programme to ensure all our team ‘shine’.\nOutdoor learning & environmental areas to engage all learners and promote active and experiential learning opportunities across the curriculum.\nExcellent online communication tools and computing hub/maker space, promoting STEaM, cross-curricular collaboration and problem-solving.Established and successful networking with partners through a range of activities and partnerships.\nThis alliance promotes innovation and creativity, aiming for excellence in all we do. In addition to home school placements, you will have three main placements during the course of the year in varied and inspiring schools, providing experience in different environments and thereby allowing you to make an informed decision when applying for posts. The Alliance, whilst not offering or guaranteeing employment for any graduate, has agreed to look first at our own talented pool if a vacancy arises.","trainWithDisability":"Sacred Heart is an all-inclusive school and welcomes applications from trainees with disabilities and other needs.\nWe are an IQM (Inclusion Quality Mark) School 2017/18\nSacred Heart is a modern purpose built school with wheelchair access throughout the school premises.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"9be9f611-2d36-431a-9109-7fcbbfc88fc8","code":"C99","name":"University of Cumbria","description":"The University of Cumbria is one of the country’s leading and biggest providers of teacher education and School Direct partnerships. \\r\\n\\r\\nThe success of our PGCE course is underpinned by both an academic teaching philosophy and the practical skills of real school-based learning.\\r\\n\\r\\n 96% of our graduates are in work or further study within 15 months of graduating.\\r\\n \\r\\nYour training will be delivered by both University of Cumbria tutors and experienced teachers from Teach Heart Alliance. With the practitioner and academic expertise of the university and school staff at your disposal, you can become an outstanding, critically reflective teacher."}],"createdAt":"2021-07-06T17:49:24.468Z","updatedAt":"2021-09-22T21:40:03.113Z"}
