{"id":"ab2852f6-dd4d-4c11-a0a6-ba8587722ed9","name":"Skipton Girls’ High School","code":"1QP","type":"lead_school","isAccreditedBody":false,"urn":"136664","ukprn":"10033380","address":{"addressLine1":"Skipton Girls’ High School","addressLine2":"Gargrave Road","town":"Skipton","county":"North Yorkshire","postcode":"BD23 1QL"},"contact":{"website":"http://www.northernlightsscitt.com/our-programmes/","email":"smithh@northernlightsa.org","telephone":"1756707628","fullName":"Jill Smith"},"location":{"latitude":53.963357,"longitude":-2.0272043},"trainWithUs":"Northern Lights SCITT shapes committed, creative and passionate individuals into responsive, inspirational and highly skilled teachers. Together, we transform the lives of young people. Northern Lights has designed an exciting programme, throughout which trainees benefit from the very best “hands on” training and high quality professional development delivered by experienced members of staff from our Alliance schools. The SCITT is led by an outstanding school at the forefront of teaching and learning, Skipton Girls’ High School, at the gateway to the Yorkshire Dales and the other. Partner schools in rural North Yorkshire, Lancashire, the spa town of Harrogate, and the vibrant city of Bradford are subject hubs and offer teaching placements. To develop their subject and curriculum knowledge, trainees will work in subject specific groups coming together periodically at Skipton Girls’ High School for the professional studies programme. These sessions will offer relevant, practical and up to date guidance for the classroom, whilst encouraging trainees to become reflective practitioners committed to improving teaching and learning in our schools.\nTrainees who successfully complete the course will be recommended for the award of Qualified Teacher Status. As an integral part of the course, trainees will study Masters’ level modules which will lead to a PGCE and can be used as 60 credits towards an MA from Leeds Trinity University.\nThe Northern Lights ethos of reflective and collaborative professional development will seek to support our newly qualified teachers as they build their careers and move into leadership roles","trainWithDisability":"Northern Lights SCITT is committed to equality of opportunity and welcomes applications from all potential trainees regardless of age, gender, race, ethnic origin, marital or parental status, disability, political or religious belief or socio-economic class.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"8795230d-a2ff-43ec-8a16-384a390e27f3","code":"255","name":"Northern Lights SCITT","description":""}],"createdAt":"2021-07-06T17:57:09.751Z","updatedAt":"2021-11-02T16:29:08.638Z"}
