{"id":"ab49d14f-e05f-45e0-b1e0-d97eba66f093","name":"Josie Thirkell Institute of Education","code":"1GW","type":"lead_school","isAccreditedBody":false,"urn":"141563","ukprn":"10048068","address":{"addressLine1":"Digital Media Centre","addressLine2":"County Way","town":"Barnsley","county":"South Yorkshire","postcode":"S70 2JW"},"contact":{"website":"www.jtioe.org.uk","email":"traintoteach@jtioe.org.uk","telephone":"01226 720758","fullName":"schooldirect@positiveregardtsa.co.uk"},"location":{"latitude":51.5229173,"longitude":-0.1279273},"trainWithUs":"Josie Thirkell Institute of Education offers teacher training across the Yorkshire and Lincolnshire region\nWe are a values driven alliance and we believe relationships do make a difference. Through School Direct, we recruit, nurture and develop new and exciting talent to the profession as part of our drive to promote outstanding teaching and learning in our schools.\nOur Alliance comprises of a range of Primary, Secondary and Special School partners including PRU provisions. Therefore, we can offer you a wide and contrasting range of teaching and training opportunities. We are committed to ensuring that your training experience provides you with tailored support, thereby maximising your chances for success. Many of our trainees have gone on to secure employment in our schools.\nWe aim to better meet the social and academic learning needs of our students, thereby enhancing and improving their life chances in society and the world of work.","trainWithDisability":"Disability Support at interview:\nIf you have a sensory or physical disability, dyslexia, a mental health or medical condition, please let us know if you need some support during the selection process. We recommend you contact both ourselves and University Admissions within three days of receiving an invite to interview so we can arrange (for example) extra time in order to complete reading or written tasks if required; a sign language interpreter; a note taker; materials in a different format; wheelchair access. We will try to accommodate your requests so that you can fully participate in the interview without any disadvantage.\nDisability Access\nAll training venues and schools must meet statutory requirements for access, but individual needs will be accommodated wherever possible.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"1d95b6cb-0e08-4485-848a-0e304d71102a","code":"B38","name":"Bishop Grosseteste University","description":""},{"id":"ce25b950-14e6-4c21-a215-d140b58e2d5c","code":"2B6","name":"East of England Teacher Training","description":"East of England Teacher Training are a SCITT consisting of a group of experienced educational professionals who lead high quality, school based Teacher Training, leading to the award of QTS (Qualified Teacher Status), with a PGCE (optional). \\r\\n\\r\\nThey are passionate about what they do and about making a difference to the lives of the children within our schools. The SCITT is ‘highly ambitious and is driven to ensure ‘high-quality local teachers that teach successfully within local schools’. (Ofsted 2018)"},{"id":"e5b8e187-ccc1-4253-9dd0-376d6abf7e66","code":"2EY","name":"Exceed SCITT","description":"Exceed SCITT is part of Exceed Academies Trust in Bradford and is an accredited provider of Qualified\\r\\nTeacher Status, we hold an Ofsted rating of Outstanding, a recognition of the quality training we\\r\\nprovide. We work closely with our School Direct partners in Bradford, Keighley and Leeds. Our\\r\\nunique programme maximises the time spent in school and access to tutors with up to date\\r\\nprofessional practice and expertise drawn from their work in schools. We have an excellent track\\r\\nrecord of supporting trainees in completing the programme for QTS and gaining employment as a\\r\\nNewly Qualified Teacher"},{"id":"899178cc-20a7-4df5-951a-ee83c1b3d4d1","code":"S21","name":"Sheffield Hallam University","description":"Sheffield Hallam University are the School Direct Provider with Josie Thirkell Institute of Education being the Lead School. In 2017 The Sheffield Institute of Education (SIoE) received their first ever ‘Outstanding’ rating from Ofsted for early years’ teacher training – alongside an ‘Outstanding’ rating for their Primary teacher training and ‘Good’ ratings for Secondary/Post-16.\\r\\n\\r\\nOn completion of the course you will receive a Postgraduate Certificate of Education (PGCE) including 60 masters credits as well as Qualified Teacher status (QTS)."}],"createdAt":"2021-07-06T17:50:57.643Z","updatedAt":"2021-10-11T16:39:03.891Z"}
