{"id":"ac2470ca-d0f3-42cc-b1e3-7c75db159f9d","name":"Chellaston Academy","code":"1ED","type":"lead_school","isAccreditedBody":false,"urn":"148639","ukprn":"10088466","address":{"addressLine1":"PO Box 8540","town":"Derby","county":"Derbyshire","postcode":"DE65 9EL"},"contact":{"website":"www.dtsa.org.uk","email":"Deborah.Outhwaite@dtsa.org.uk","telephone":"07712 674 474","fullName":"Claire Sutton"},"location":{"latitude":52.8664207,"longitude":-1.4393978},"trainWithUs":"Developing Teachers, Schools and Academies (DTSA) is a broad and inclusive alliance of schools and other partners. We are a not for profit Charitable Trust. We work together to train the next generation of outstanding teachers through the Schools Direct route. Every member of DTSA involved in Schools Direct is totally committed to giving student teachers the very best support and training. The main advantage of applying to DTSA School Direct is that our close partnership with the University of Derby and local schools in Derby and Derbyshire offer a broad range of experiences combined with high quality academic input and access to resources. Other benefits include:\n•\tBeginning your teaching career in a school where career progression through ITTE, as a Newly Qualified Teacher (NQT) and a Recently Qualified Teacher (RQT) are well-developed\n•\tGreat links between schools across the Alliance from all phases allowing you to experience a range of Key Stages; Special School experience and Early Years experience\n•\tLocal professionally facilitated networking with other DTSA School Direct students; access to a range of local curriculum forums and links with Newly Qualified Teachers training and events.","trainWithDisability":"Our partnership with the University of Derby means you will be joining a community committed to creating an inclusive and equitable teaching and learning environment to the benefit of all students.\nSpecialist services provide student-led support to enable disabled students to flourish as independent learners. Support is available from different teams depending on your need:\n•\tAcademic Support\n•\tDisability Support\n•\tWelfare support\n•\tWell-Being Centre\nYou can meet with staff from DTSA to ensure that your individual training needs are well-met, and you will be well-supported by DTSA staff; University Link Tutors and Mentors.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:47:16.958Z","updatedAt":"2021-10-18T15:28:22.693Z"}
