{"id":"ac275662-0220-4b3f-83ec-8db2eb5da7a6","name":"Burnham Teaching Partnership","code":"1MT","type":"lead_school","isAccreditedBody":false,"urn":"137564","ukprn":"10035483","address":{"addressLine1":"Burnham Grammar School","addressLine2":"Hogfair lane","town":"Burnham","county":"Slough","postcode":"SL17HG"},"contact":{"website":"https://www.burnhamgrammar.org.uk/919/train-to-teach","email":"pbainbridge@burnhamgrammar.org.uk","telephone":"1628604812","fullName":"Paul Bainbridge"},"location":{"latitude":51.5324429,"longitude":-0.6536332},"trainWithUs":"The Burnham Teaching Partnership is comprised of grammar, secondary and primary schools in the Burnham locality. Burnham Grammar School leads this partnership of schools. Our schools offer a welcoming, supportive and rewarding place to train. We offer a comprehensive training package for our trainees and the opportunity to work in a truly diverse range of schools. We offer a wealth of experience and are committed to providing a tailor made training experience.\nOur partnership of schools, are all situated within a few miles of each other and provide a diversity of educational experiences. We will provide you with a subject specific mentor, with whom you will have allocated meetings on a weekly basis to discuss your progress. You will also be allocated to a pastoral mentor, with whom you can develop your pastoral care in preparation for your role as a form tutor. In addition to this we have a comprehensive training programme for all of our trainees and NQTs, this consists of a weekly training session presented by a variety of our teaching staff, whereby they deliver specific training in their particular area of expertise. We encourage you to share your individual interests and skills in our comprehensive range of extra-curricular activities and will provide opportunities for you to be involved with educational visits.\nBurnham Grammar School works collaboratively with it's university partners to ensure that it's trainees receive the best of what School-based and University-based training has to offer. For more information about visit our website https://www.burnhamgrammar.org.uk/919/train-to-teach","trainWithDisability":"The Burnham Teaching Partnership and our affiliated universities welcomes all students.\nWe encourage applications from the right candidates regardless of age, disability, gender identity, sexual orientation, religion, belief or race.\nhttps://www.reading.ac.uk/education/equality-diversity-and-inclusion/ioe-edi-support-for-students.aspx","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:57:05.410Z","updatedAt":"2021-09-14T16:30:52.600Z"}
