{"id":"acb1b7cf-6d1b-4bdd-943d-49c097ea9277","name":"Abbey Infants’ School","code":"153","type":"lead_school","isAccreditedBody":false,"urn":"136988","ukprn":"10034923","address":{"addressLine1":"Federation of Abbey Schools","addressLine2":"Cleveland Terrace","town":"Darlington","county":"Co. Durham","postcode":"DL3 8JA"},"contact":{"website":"http://www.abbeyfed.darlington.sch.uk","email":"jbriggs@abbeyfed.darlington.sch.uk","telephone":"01325 380748","fullName":"Head of School"},"location":{"latitude":54.5218773,"longitude":-1.5759175},"trainWithUs":"The Federation of Abbey Schools and Sedgefield Hardwick Primary are the lead schools in the Teesside and Darlington region. This is an ideal location to train to teach if you live in this area. The two schools work together to support and nurture the trainees who live in the area; trainees are interviewed in the Hub School and will spend the majority of their year at the Hub and Satellite schools attached to the Hub.\nTraining is delivered by a blended approach of both face-to-face and remote learning by our experienced Subject Learning Leads and Hub Learning Leads. As a School Direct trainee teacher, you will also be enrolled as a Northumbria University distance learner student. You will have full access to Northumbria University facilities and site. Although you will not be required to visit the site as part of the programme as all of your training will take place within the school partnership, you may choose to access the library facilities to support the PGCE element of the programme.","trainWithDisability":"High Force is committed to equality of opportunity for all and does not discriminate on the grounds of race, gender, sexual orientation, age, disability, religion or socio-economic circumstances. For specific information and guidance on support, provision available and/or facilities for trainees with learning difficulties or disabilities, please contact the ITT Deputy Director on 01833 630487. We produce a separate Disability Statement, outlining facilities for disabled learners. This is available on request. We have a dedicated pastoral lead who can provide additional support when needed.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"dae8b113-3556-416a-8da0-57eb5aaff9e2","code":"H38","name":"High Force Education (SCITT)","description":"High Force Education is a an Ofsted Outstanding provider. We are a small provider who are passionate about nurturing and supporting you to become a highly skilled Early Career Teacher. We get to know all of our trainees and can personalise the course to reflect your needs. \\r\\n\\r\\nOur programme aims to prepare you to become an effective teacher capable of making a significant contribution to the workplace, both during and after the programme. You will spend the majority of the programme in the classroom and have a dedicated Hub Learning Lead to teach you from our ‘Learn to Curriculum.'."}],"createdAt":"2021-07-06T17:56:04.589Z","updatedAt":"2021-10-04T19:01:31.729Z"}
