{"id":"acbb1d89-aae8-48fa-b3cd-cb4865b6a521","name":"Hampshire SCITT Partnership (School Direct)","code":"16P","type":"lead_school","isAccreditedBody":false,"urn":"136715","ukprn":"10033571","address":{"addressLine1":"Thornden School","addressLine2":"Winchester Road","town":"Chandlers Ford","county":"Hampshire","postcode":"SO53 2DW"},"contact":{"website":"www.hampshirescitt.org.uk","email":"info@hampshirescitt.org.uk","telephone":"2380246950","fullName":"Mrs Sian Taggart"},"location":{"latitude":50.994409,"longitude":-1.3631275},"trainWithUs":"The Hampshire SCITT Partnership was judged Outstanding by Ofsted in November 2016: “This is an outstanding provision. At every level and in every way, highly effective leaders have created a teacher training programme which regularly produces extremely proficient teachers who ‘hit the ground running’ when they begin their careers as NQTs.”\nIf you complete the course successfully, you will be awarded Qualified Teacher Status (QTS) and a Postgraduate Certificate in Education (PGCE) at Masters level.\nFor the preparation and award of the PGCE, we are in partnership with the University of Reading which has a well established and excellent record of initial teacher training. We are training to employ teachers for Hampshire as well as nationally. Each year, 100% of our trainees gain full-time teaching posts, typically about 85% in our partner schools. Our partner schools are skilled in identifying future leaders and some of our trainees gain promotion in the first two years of their teaching.\nWe are linked with The HISP Research School which is also based at Thornden School in Chandlers Ford, Eastleigh. As one of the new Research Schools in the national network, HISP Research School aims to work collaboratively with schools to help bridge the gap between research evidence and classroom practice. If you train with us, you will benefit from the very best of evidence-based practice.","trainWithDisability":"Our partner schools are all committed to equal opportunities. One of the strengths identified in our Ofsted report is“the focused care and support provided for any trainees facing personal challenges which enable them to complete the programme successfully.” The report goes on to comment, “Leaders also ensure that any trainee or NQT finding themselves in need of care or support is provided with it quickly. This contributes to the extremely high completion rates. It also means that trainees are fiercely proud of and affectionate towards the programme. As school sites differ, those applicants with physical disabilities should contact the SCITT Administrator for details of the partner schools best suited to their needs. All our partner schools have the expertise to support applicants with learning disabilities.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:50:25.093Z","updatedAt":"2021-10-04T17:39:13.855Z"}
