{"id":"ae32e7cd-13d7-420b-80f6-dd787ed28b38","name":"Brunel University London","code":"B84","type":"hei","isAccreditedBody":true,"ukprn":"10000961","address":{"addressLine1":"Brunel University","addressLine2":"Kingston Lane","town":"Uxbridge","county":"Middlesex","postcode":"UB8 3PH"},"contact":{"website":"https://www.brunel.ac.uk/education/postgraduate-programmes/ite-pgce-programmes","email":"education-admissions@brunel.ac.uk","telephone":"01895 265265","fullName":"Admissions Office"},"location":{"latitude":51.5324044,"longitude":-0.4729931},"trainWithUs":"Ranked 3rd in London (Guardian League Table 2021) and an outstanding provider of Initial Teacher Education (Ofsted, 2015).\nEducation at Brunel offers an unrivalled experience for developing education professional or for your education training. We are one of the longest established Education departments in the country and leading research centre for work in supportive education. We regularly receive high ratings from the UK's leading benchmarks such as Ofsted. All our education courses have been developed in collaboration with partnership schools and the requirements of the Teaching Regulation Agency (TRA). This ensures the highest possible quality of provision and relevance in national and school-level priorities in Education. You'll learn in lectures, seminars, and workshops and by modelling classroom practice. Teaching will be a blend of on campus (subject to social distancing restrictions) and online delivery. The latter will include interactive, face-to-face sessions and pre-recorded sessions, supported with access to a range of learning resources. We invite guest speakers to contribute to the taught sessions and arrange school visits, for example, to pupil referral units and special schools. A Brunel PGCE with recommendation for QTS is a recognised symbol of high-quality Initial Teacher Education. You'll benefit from our partnerships with educational institutions and local schools. Many of our students go on to work in our partner schools and many more are employed in schools where they undertook a placement.","trainWithDisability":"Our campus and facilities are recognised as some of the best in the country for disabled students.\nWe offer advice and support to disabled students, including those with dyslexia and other specific learning difficulties, mental health conditions, Asperger syndrome, mobility and sensory impairments and unseen disabilities such as epilepsy, diabetes, arthritis and sickle cell anaemia.\nOur disability advisers will help make you access the support or specialist equipment you need to make the most of your studies. We arrange support individually with each students and the service is confidential. We only use your details, with your consent, to help you get the best support. For more information, you can contact Brunel's Disability and Dyslexia Service: disability@brunel.ac.uk; www.brunel.ac.uk/disability\nAssistive Technology Centre - this provides software and hardware to support disabled students. It also runs a loan scheme of key equipment such as digital recorders and assistive listening devices. www.brunel.ac.uk/assistive-technology","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"createdAt":"2021-07-06T17:48:48.906Z","updatedAt":"2021-09-29T15:48:14.903Z"}
