{"id":"af388cc3-644a-4fd3-bd71-55503b74fc21","name":"University of Bedfordshire","code":"B22","type":"hei","isAccreditedBody":true,"ukprn":"10007152","address":{"addressLine1":"University of Bedfordshire","addressLine2":"Polhill Avenue","town":"Bedford","county":"Bedfordshire","postcode":"MK41 9EA"},"contact":{"website":"http://www.beds.ac.uk","email":"pgce.admissions@beds.ac.uk","telephone":"01582 743500","fullName":"Admissions Office"},"location":{"latitude":52.1414835,"longitude":-0.4430177},"trainWithUs":"Aspirational partnership, inspirational teaching Rated in the top 25% of ITT providers by the Department for Education (DfE) in 2017/18, with outstanding employment rates\nOur Initial Teacher Education (ITE) Partnership We are proud of our excellent reputation in training teachers, which spans over 100 years, and of our strong and effective partnership with over 250 schools across the region. This strong relationship is reinforced by working with a number of School Direct partners in both the primary and secondary phases.\nOur ITT Ofsted grades Grade 2 (Good) for our ITE provision\nGrade 1 (Outstanding) for the quality of leadership & management across the partnership for Secondary. QTS Secondary Phase Ofsted Report “The high standard of trainees’ and NQTs’ personal and professional conduct, which leads to a positive reputation within schools in the region and high employment rates for NQTs.”\n“The leadership and management of the Secondary partnership is outstanding.”\n“There has been a sustained, uncompromising and successful drive to improve outcomes so that the large majority of Secondary trainees attain outcomes at the highest levels”\nQTS Primary Phase Ofsted Report “Trainees become highly professional teachers who establish positive and productive relationships, and effectively promote the learning of all pupils”\n“Leaders share a very evident passion to ensure that they are constantly improving the provision to produce the best possible teachers”\n“There are strong partnerships with schools and local authority colleagues, who express trust in the provider to work with them to produce good teachers”. Fulfil your teaching aspirations with us.","trainWithDisability":"We take particular care to ensure that the individual needs of all students are met, and encourage all students to reach their potential in a supportive environment.\n\nThe University of Bedfordshire is an inclusive and empowering university. Those with specific needs should view disability access information on the University of Bedfordshire website for further details.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"createdAt":"2021-07-06T17:50:09.682Z","updatedAt":"2021-10-06T16:23:43.901Z"}
