{"id":"af5b5b1e-a874-4ac6-ab44-9a9bdf84bcce","name":"BTSA (Bart’s Training and Support Alliance)","code":"14D","type":"lead_school","isAccreditedBody":false,"urn":"136549","ukprn":"10007851","address":{"addressLine1":"Sussex Place","addressLine2":"Longton","town":"Stoke-on-Trent","county":"Staffordshire","postcode":"ST3 4TP"},"contact":{"website":"https://www.btsa.org/school-direct/","email":"ecerioni@btsa.org","telephone":"1782486350","fullName":"Eva Cerioni"},"location":{"latitude":52.977602,"longitude":-2.1265284},"trainWithUs":"BTSA (Bart's Training and Support Alliance) is an alliance of schools, and other partners, who are working together to train the next generation of outstanding teachers. At BTSA, we are clear about what we are doing, and more importantly why. This is encapsulated in our aim and vision: “Releasing Potential.”\nBelgrave St. Bartholomew’s Academy is the lead school for BTSA. We work across the West Midlands Region and beyond, centred in and around Stoke-on-Trent, Staffordshire, Cheshire East and Shropshire. At BTSA, we are committed to improving educational outcomes for children and young people wherever we can. Our mission is to collaborate with other organisations and work with educational professionals to develop the best trained and supported workforce possible.\nOur strapline is Releasing Potential. By “Releasing Potential” within our staff, at each stage of their professional careers, we aim to provide an excellent all round education to the children in our care. We believe that we have a moral imperative to continue this work by identifying and equipping teachers and support staff to be excellent practitioners at every stage of their career, through initial teacher training, ongoing CPD, research and leadership development.\nOur School Direct Primary teacher training programme is an excellent opportunity for graduates and career changers to join the teaching profession. The School Direct teacher training route is led by BTSA, working in partnership with local schools and The University of Derby.","trainWithDisability":"Our School Direct teacher training programme is inclusive and responsive to the needs of our trainees. School placements are tailored to meet the needs of trainees with disabilities and other needs. Due to the nature of this professional course, where reasonable adjustments can be made, we aim to support all trainees through their school placements. The University of Derby also provides support for all trainees with regards to their professional and academic studies.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:49:14.849Z","updatedAt":"2021-10-05T23:06:18.230Z"}
