{"id":"af6a0ce4-b1f9-40ad-9a5d-4d757dfa753e","name":"Bishop Luffa","code":"1PE","type":"lead_school","isAccreditedBody":false,"urn":"140472","ukprn":"10060653","address":{"addressLine1":"Westgate","town":"Chichester","county":"West Sussex","postcode":"PO19 3HP"},"contact":{"website":"http://bishopluffa.org.uk","email":"Teachingschool@bishopluffa.org.uk","telephone":"01243 832768","fullName":"Mrs Louise Watson"},"location":{"latitude":50.838843,"longitude":-0.798094},"trainWithUs":"Bishop Luffa School is committed to excellence in Teaching & Learning and Leadership through collaboration, recognising that we are all responsible for our young people in our area, and that no single institution can meet all the needs of all its pupils on its own.\nAt least 85% of the placement year will be spent in schools, in readiness for your first job. Trainees will benefit from working with an experienced mentor, qualified staff and senior colleagues from across the partnership. Leaders take extra care when introducing trainees to the classrooms. Timetables and commitment are set in consultation with the trainee to ensure quality support provision at every step. In addition to the timetabled training programme, Bishop Luffa will offer bespoke professional and personal subject study support, where required.\nWe welcome applicants from a variety of academic backgrounds, and encourage and offer opportunities for flexible Subject Knowledge Enhancement courses to support our trainees.\nOur partnership is committed to safeguarding and promoting the welfare of children and young people and expects all staff and volunteers to share this commitment.","trainWithDisability":"Having worked with dyslexic trainees in the past, we are well equipped to support their needs and adapt our practice as required.\nWe are an accessible site with all relevant Health and Safety practices in place. We work closely with all schools and trainees to ensure needs are met. We value staff mental health and well being, with an open, professional working relationship with all trainees, allowing for effective communication.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:52:57.305Z","updatedAt":"2021-11-22T19:30:17.972Z"}
