{"id":"af6c4cd8-c90a-4412-869d-50f8a47f901f","name":"West Essex SCITT (St John’s C of E Primary School)","code":"15D","type":"lead_school","isAccreditedBody":false,"urn":"145599","ukprn":"10067433","address":{"addressLine1":"West Essex SCITT","addressLine2":"Office Address - St. John’s CE Primary School","town":"High Road","county":"Buckhurst Hill, Essex","postcode":"IG9 5RX"},"contact":{"website":"http://www.westessexscitt.co.uk/","email":"smarbe@efspt.org","telephone":"020 3325 2809","fullName":"Mrs Susan Marbe"},"location":{"latitude":51.629587,"longitude":0.0332199},"trainWithUs":"St. John's CE Primary School is the Lead School for West Essex SCITT.\nThe Department of Education accredits Epping Forest Schools Partnership Trust (EFSPT), operating as West Essex SCITT for the delivery of initial teacher training (ITT).\nAt EFSPT, St John's CE Primary School and across our partnership schools, we believe that teaching is an exciting, challenging and rewarding profession. Our vision is to offer the highest standard of education for all, both in our local community and the wider area.\nSt John's CE Primary School is located in Buckhurst Hill, on the edge of Epping Forest, which is London's largest open space of approximately 6,000 acres. The forest is of national and international conservation importance, with two thirds designated as a Site of Special Scientific Interest and a Special Area of Conservation, providing a great place to work and live. St. John's CE Primary School is close to Buckhurst Hill station on the Central Line with a 20 minute access to central London. We pride ourselves on having a proven track record in training and professional development. Our teachers are excellent practitioners and are eager to share their skills, knowledge and vision with the next generation of teachers.\nMany of our School Direct trainees go on to secure full-time teaching positions within EFSPT.\nhttps://www.efspt.org/\nWe work in collaboration with Saffron Teaching School Hub https://www.saffronteachingschoolhub.net/\nPlease visit the West Essex SCITT website, shown below, for more information:\nhttp://www.westessexscitt.co.uk/School-Direct-ITT","trainWithDisability":"As a provider we are very aware of supporting our trainees and their individual needs. We see our trainees weekly at the training sessions and their well-being is a priority. The School Based Educators, ITT co-ordinators and Professional Tutors are there to support the trainees and monitor their progress and well-being. We include sessions on resilience and well-being, both of which are very important to us.. We take well-being very seriously. Our trainees have access to the Wellbeing Services offered by the Schools Advisory Service (SAS).\n\nIf you would like to discuss how we support candidates with disabilities and other needs, please contact Susan Marbe by email for further information at: smarbe@efspt.org","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"85fff496-4075-4cb3-9ad0-65e7958ea202","code":"2BB","name":"West Essex SCITT","description":"The Department of Education accredits Epping Forest Schools Partnership Trust (EFSPT), operating as West Essex SCITT for the delivery of initial teacher training (ITT)\\r\\n\\r\\nWest Essex SCITT is an Outstanding Provider of Primary Initial Teacher Training - Ofsted 2018"}],"createdAt":"2021-07-06T17:50:38.779Z","updatedAt":"2021-09-27T22:21:58.528Z"}
