{"id":"b0223445-3531-47a6-81b0-839f90b8335b","name":"Huddersfield Horizon SCITT","code":"2EX","type":"scitt","isAccreditedBody":true,"ukprn":"10058690","address":{"addressLine1":"Brambles Primary Academy","addressLine2":"Cemetery road","town":"Huddersfield","county":"West Yorkshire","postcode":"HD1 5NF"},"contact":{"website":"https://huddersfieldhorizon.com","email":"emilybeach@huddersfieldhorizon.com","telephone":"7590881459","fullName":"Emily Beach"},"location":{"latitude":53.6530891,"longitude":-1.7938849},"trainWithUs":"The Huddersfield Horizon SCITT, part of South Pennine Academies has been graded by Ofsted as OUTSTANDING in all four areas.\n\"Leaders know trainees 'inside out'. Leaders really go above and beyond in every respect, including helping to maintain good well-being\".\nThe Huddersfield Horizon SCITT is based at the BRAND NEW MULTI MILLION POUND BUILD that is Brambles Primary Academy, and works with secondary and primary schools, based around West Yorkshire, Oldham and Calderdale. Our Partnership includes a range of settings from semi-rural to inner city schools to provide our trainees with a diverse teaching experience. Our trainees cited that their host schools were supportive, always willing to help and \"were given all the tools they needed to ‘be a teacher’.\" Each trainee is provided with a highly experienced mentor, and also a personal visiting tutor to guide both trainee and mentor through the ITT process. The tutor will visit their trainee at least ONCE every HALF term to ensure they are thriving. The Partnership also provides weekly core training from facilitators who are ‘’inspirational’’ and that encourage our trainees to feel safe taking risks and to develop a fluent teaching style. We pride ourselves on our bespoke and ‘round the clock’ support for each individual trainee so they have the confidence and competence to flourish not only in their first year of teaching but in years to come. We consider that our trainees will be life changers and leaders of the future and we will support YOU beyond your training.","trainWithDisability":"The Huddersfield Horizon SCITT is committed to providing an environment that enables full curriculum and training access that values and includes all regardless of their physical, sensory and emotional needs. We are committed to taking positive action in the spirit of the Equality Act 2010 with regard to disability and to developing a culture of inclusion, support and awareness within the Partnership.\nOur Accessibility Plan shows how access is to be planned for trainees within a given timeframe and anticipating the need to make reasonable adjustments to accommodate their needs where practicable. Our training centre caters for trainees who are physically disabled. We have a lift facility and the training is contained within one area. Our catering facilities are exceptional with specialist cooking and washing facilities to meet the needs of wheelchair users. When placing trainees within our partnership schools we will take into consideration the specific needs of the individual and make reasonable adjustments.\nOn our Campus we have a Visual Impairment Unit which can adapt resources accordingly. Equally we are able to source resources which may be of benefit to any trainee with dyslexia in-order to support them in their study and school based training.\nOur trainees’ wellbeing is of the upmost importance to us. Our trainees complete a Wellbeing Plan which is used to shape the support we offer our trainees. When necessary, and with the trainee’s consent, we will seek additional resources eg mental health counsellors to cater for the needs of our trainees.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:47:53.276Z","updatedAt":"2021-09-08T19:44:26.232Z"}
