{"id":"b0661fea-19bc-4a44-b3a1-d521ca9a7608","name":"Catholic Teaching Alliance (North)","code":"1GB","type":"lead_school","isAccreditedBody":false,"urn":"119779","ukprn":"10016881","address":{"addressLine1":"Catholic Teaching Alliance (North)","addressLine2":"St Anthony’s Drive","town":"Fulwood","county":"Preston","postcode":"PR2 3SQ"},"contact":{"website":"http://www.catholic-teaching-alliance.org","email":"CTAschooldirect@olchs.lancs.sch.uk","telephone":"01772 326931","fullName":"School Direct ITT Programme Leader"},"location":{"latitude":53.7801417,"longitude":-2.7254255},"trainWithUs":"‘Aspirational training to achieve inspirational teachers with pupils’ learning and well-being at the heart of our partnership’\n\nOur unique approach to fostering a positive environment where each trainee is known to us as an individual remains one of our greatest strengths and one of the main reasons prospective trainees choose us. \n\nThe Catholic Teaching Alliance (North) is underpinned by a shared passion to train and develop outstanding and inspirational teachers who are highly employable and dedicated professionals. We aim to deliver the Catholic school leaders of tomorrow. You do not have to be a Catholic to train with us, though you will be expected to uphold the Catholic values of our family of schools. The Catholic Teaching Alliance (North) is a partnership of over 60 primary, secondary and post 16 establishments based mainly in the Dioceses of Lancaster, Liverpool and Salford. The lead school is Our Lady’s Catholic High School in Preston, ‘Outstanding’ in all categories from Ofsted in 2012.\n\nSchool Direct [placements across the partnership](https://drive.google.com/open?id=11i44ZWQK3rUBHTZix8OZ4bwz7z8KE0BH&usp=sharing) ensure that trainees work alongside outstanding practitioners within high performing Catholic schools. We use the best qualified staff with existing expertise to deliver a quality assured training programme to support trainees based upon the Teachers’ Standards. By doing so, we are confident in ensuring quality training at all levels. Typically, 100% of our trainees graduate with Good or Outstanding grades.\n\nWe can offer support and guidance with your application at our frequent ['Drop - in' information sessions](https://www.catholic-teaching-alliance.org/itt-drop-in-sessions.html).","trainWithDisability":"All our students have access to University of Cumbria support as well as that offered within our school direct alliance. Much of this university-based support is available online and electronically and so is accessible at a distance.\nLibrary and Student Services (LiSS) at the University of Cumbria supports your learning, teaching and research needs by providing pro-active, academically focused services, innovative learning spaces and modern facilities. LiSS is responsible for libraries, information advice and guidance, careers guidance and employability, enhancement and information, academic skills development, student health and wellbeing, disability services and student development. For more details please refer to [www.cumbria.ac.uk/liss](https://www.cumbria.ac.uk/student-life/student-support/).","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:57:19.567Z","updatedAt":"2021-10-02T16:16:39.561Z"}
