{"id":"b078ae49-5184-4104-9a4f-b61bd5a591be","name":"Devon Moorland Schools Partnership","code":"28A","type":"lead_school","isAccreditedBody":false,"urn":"113479","ukprn":"10037449","address":{"addressLine1":"St. Andrew’s C.E. (Aided) Primary","addressLine2":"Buckland Monachorum","town":"Yelverton","county":"Devon","postcode":"PL20 7NA"},"contact":{"website":"http://www.standrewscofe.co.uk/","email":"erookes@standrewscofe.co.uk","telephone":"01822 853153","fullName":"Esther Rookes"},"location":{"latitude":50.4957719,"longitude":-4.131643},"trainWithUs":"Our Moorland School Partnership (MSP) are recruiting students to train in our many schools. We are also part of a wider network of schools across Devon, Plymouth and Europe as part of Erasmus+.\nSt Andrew’s C.E. (Aided) Primary School is situated in the centre of the picturesque village of Buckland Monachorum, on the edge of Dartmoor National Park.\nOur aim is to provide a living, Christian school environment, where the full potential of each child is realised through personal, social, academic and spiritual development. ‘Learning together what is good and right.’\nJob 34: 4\nWe are a Church of England School that is required to be distinctly Christian and inclusive. This means that we welcome those who have a Christian faith, those who have no faith and those of other faiths.\nOur core Christian values are embedded at the heart of the school and this has a positive effect on children’s behaviour and attitudes to learning and the relationships of pupils and adults in the school. At St Andrew’s we believe that character education is about devel-oping people who can flourish in all areas of their lives and for this reason our values are taught with a coherent and rigorous sense of purpose based on a firm Christian foundation.","trainWithDisability":"We welcome applications from candidates with disabilities and other needs and with our HEI partners make reasonable adjustments to ensure that the training programme is accessible to all.\nPlease find detailed information about the support we provide in conjunction with our HEI partner below. University of St Mark and St John (Marjons) :(https://www.marjon.ac.uk/student-life/student-support-/disability--inclusion-advice-service/)","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:52:31.831Z","updatedAt":"2021-11-05T19:08:52.234Z"}
