{"id":"b0ac70c9-a96a-42e7-9784-362e4cf70588","name":"Northern Education Trust","code":"1UR","type":"lead_school","isAccreditedBody":false,"urn":"139405","ukprn":"10035411","address":{"addressLine1":"Dyke House College","addressLine2":"Mapleton Road","town":"Hartlepool","county":"County Durham","postcode":"TS24 8NQ"},"contact":{"website":"https://www.educate-group.co.uk/teacher-training/","email":"itt@educate-group.co.uk","telephone":"7973286995","fullName":"Dyke House College Administration"},"location":{"latitude":54.9722987,"longitude":-1.7741951},"trainWithUs":"Northern Education Trust (NET) offers the opportunity for you to train and gain QTS with PGCE through a practical, 'hands-on', school-led route. Within NET there are training opportunities available in a range of academies based across the North of England. This route is for those who have the confidence and commitment to work alongside expert practitioners, in a strong partnership of schools, to develop teaching skills on a daily basis and to meet the professional Teachers' Standards over the course of the year. Successful applicants to the School Direct QTS programme also study for a PGCE, validated by Leeds Beckett University, which accumulates 60 Master's credits; all as part of a framework which combines academic study with direct classroom application. Through this programme trainees enjoy the advantage of an 'on the job' experience, where the realities of life as a teacher are fully explored and understood. The majority of time is spent in one school, where trainees are supported by school based trainers, individual mentors and a personal link tutor. In addition to this, trainees attend school-led and centre-based training sessions, on specific subject knowledge and general classroom practice, which supplement the incomparable first-hand experience that is gained from being a full member of a school community for a year. Please note that, although Dyke House Academy is the named school for the consortium, your placements will be organised by the NET staff college and you may be placed at any of the academies within our Trust.","trainWithDisability":"Educate Group - Initial Teacher Training has a designated tutor for trainees with disabilities and other needs. We take steps, before the programme begins, to fully assess the needs of trainees so that all aspects of the course are accessible to them and personal requirements accommodated.\nEducate has, in the past, supported trainees with dyslexia, physical impairment and mental health conditions to successfully complete their course. We take a collaborative approach to ensure that study needs assessment reports, school partners and university colleagues are consulted to design a complete package of personal support.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"4808c596-11e0-4586-8cb4-116a1d9838b3","code":"E65","name":"Educate Group Initial Teacher Training","description":"Educate Group is a large, National SCITT provider, with a long-standing reputation for successful Primary and Secondary QTS programmes.\\r\\n\\r\\nProgramme leaders are highly sensitive to the well-being of their trainees. They ensure that they provide timely and appropriate support to those trainees whose personal circumstances require it. Trainees appreciate this support'(Ofsted, 2018). \\r\\n\\r\\nTraining sessions on specific subject knowledge and classroom practice supplement the first-hand experience in school. Contrasting placements means that trainees gain an appreciation of a range of ages, curricula, teaching strategies, inclusion, diversity and SEND. Employment rates following this programme are consistently high."}],"createdAt":"2021-07-06T17:49:01.278Z","updatedAt":"2021-09-09T15:50:24.197Z"}
