{"id":"b1367bab-7945-439d-8705-4c5b51ff06e1","name":"Palmerston School","code":"1AE","type":"lead_school","isAccreditedBody":false,"urn":"104748","ukprn":"10016906","address":{"addressLine1":"Palmerston School","addressLine2":"Minehead Road","town":"Liverpool","county":"Merseyside","postcode":"L17 6AU"},"contact":{"website":"www.palmerstonschool.co.uk","email":"s.caines@palmerston.liverpool.sch.uk","telephone":"0151 4282128","fullName":"Lis Burbage"},"location":{"latitude":53.3679958,"longitude":-2.9307913},"trainWithUs":"Palmerston School Direct has a proven track record of developing inspiring, child focussed, well prepared teachers. This is done through a broad range of SEND specific training days as well as placements in a number of different special and mainstream schools. Palmerston School Direct graduates are qualified to work in both special and mainstream schools.\nThere is 100% pass rate and excellent rates of employment, predominantly in special schools. Palmerston is an graded 'outstanding' by Ofsted and uses current research and student feedback to inform and evolve our initial teacher training provision. The small size of our cohorts allows us to build excellent relationships and respond quickly and specifically to the changing needs of our trainees alongside our trusted partners Liverpool John Moores University.\nJP – “School Direct teacher training route through Palmerston School offer training in Special Educational Needs that is of an exceptionally high standard. All the SEN training has been useful and beneficial for my professional development. As the group of trainee teachers is small, everyone gets to know each other really well, tutors and trainees included, and it is a very supportive environment to train in. AW – “As an employer, I look for someone who has relevant experience, skills, and confidence of working with pupils with SEND. The School Direct trainees have all of this by the end of their training. I have observed the trainees in our school growing in confidence and ability and would not hesitate to employ a School Direct trainee again.”","trainWithDisability":"Training takes place at Palmerston School, which is fully accessible. We are fully committed to inclusion, supporting both students and pupils with a range of needs to be fully included is fundamental to our ethos.\nWe are experienced and flexible and have supported students with a range of needs to sucessfully complete the course and enter employment.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"ec34b77c-cba3-4598-93be-23f0471adff1","code":"L51","name":"Liverpool John Moores University","description":"We are proud to work in partnership with Liverpool John Moores University, whom Ofsted ranked ‘outstanding’, noting that the University and partner schools are dedicated to training a supply of ‘well-qualified, committed and socially engaged teachers who are prepared to make a positive difference to the life chances of pupils across Merseyside and beyond’.\\r\\n\\r\\nLiverpool John Moores is a dynamic, responsive university which makes them an excellent, cohesive partner, focused on excellent student experience."}],"createdAt":"2021-07-06T17:56:33.672Z","updatedAt":"2021-10-05T18:23:40.877Z"}
