{"id":"b1bf806c-26df-45e7-8ae0-ba8f521429e1","name":"Wilson Stuart School","code":"1DW","type":"lead_school","isAccreditedBody":false,"urn":"138281","ukprn":"10037705","address":{"addressLine1":"Perry Common Road","town":"Erdington","county":"West Midlands","postcode":"B23 7AT"},"contact":{"website":"wilsonstuart.co.uk","email":"j.hocknull@wilsonstuart.co.uk","telephone":"1213734475","fullName":"Joy Dawson"},"location":{"latitude":52.5325996,"longitude":-1.8686384},"trainWithUs":"Wilson Stuart School is a 6 times consecutive Ofsted Outstanding all age (2 – 25 years) Special School which provides “Outstanding” education for up to 310 pupils and young people who have physical disabilities, and/or complex medical conditions. In our last Ofsted in March 2019, we were graded as outstanding in every single aspect of the inspection. We are a lead school who are partnered with a range of Birmingham based Outstanding/Good special and mainstream schools to provide an invaluable training experience. We work in close partnership with UCB to deliver our teacher training programme delivering School Direct for 6 years. As a training provider we are a small partnership who offers an individualised programme for each of our training teachers. Our employment figures to date after completion of the course has been 100%, many of which are still successfully teaching within the partnership. Retention figures show that those completing School Direct route with our partnership remain in teaching with past candidates going on to complete middle leadership courses. Over 90% of our teachers finish with a teaching grade of Outstanding. To complete the course you will need to have completed a degree with a classification of 2:2 or higher, c or above in English, Maths, Science GCSE and some experience of working with children; this could be in a range of setting such as before or after school clubs, Teaching Assistant or Sports groups .","trainWithDisability":"Our partnership specialises in teaching pupils with special educational needs. As an Outstanding school who works with pupils with a range of physical, medical and learning needs we are in a position to offer support and encouragement for all those who endeavour to become outstanding teachers. Many of our schools are fully accessible and can accommodate training teachers who require adapted facilities including ramp access, automatic doors and disabled bathroom facilities. We see training teachers with additional needs as an opportunity to provide role models to our own pupils. We have staff who work with us who have registered disabilities and have used access to work funding to provide additional resources or support where required. We have also worked with young adults at a school for the visually impaired to support work experience opportunities. When attending lectures at UCB you are based within McIntyre house which was built in 2014 and has lift access to all the floors. UCB also has a Disability Advisor who can support with many areas of access to the course.","accreditedBodies":[{"id":"6e7f844d-71e5-49be-a4d6-0211287d7480","code":"B35","name":"University College Birmingham","description":"University College Birmingham and Wilson Stuart School have worked very closely over several years to provide a bespoke Initial Teacher Education experience, with a large focus on improving the understanding of teachers in the area of Special Educational Need and Disabilities.\\r\\nBy only taking a small number of candidates onto the programme, Wilson Stuart School and UCB can provide a highly individualised training experience for every candidate, gaining outstanding results since the beginning of the partnership in 2014."}],"createdAt":"2021-07-06T17:53:02.129Z","updatedAt":"2021-07-06T17:53:02.129Z"}