{"id":"b1c7a726-d28a-48b1-8003-5e51384c773d","name":"Bristol Cathedral","code":"2HN","type":"lead_school","isAccreditedBody":false,"urn":"135575","ukprn":"10058233","address":{"addressLine1":"Bristol Cathedral Choir School","addressLine2":"1, College Square","town":"Bristol","county":"Bristol","postcode":"BS1 5TS"},"contact":{"website":"http://www.cathedralschoolstrust.org/teaching-school/initial-teacher-education/","email":"teachingschoolalliance@cathedralschoolstrust.org","telephone":"0117 205 1605","fullName":"ITT Admissions"},"location":{"latitude":51.4512133,"longitude":-2.601378},"trainWithUs":"Welcome to a unique opportunity to train in the heart of historic Bristol. We offer a range of schools in both the primary and secondary phases, including exceptional Sixth Form provision. We proudly serve a diverse community that represents the City of Bristol. We are a highly inclusive organisation that welcomes children of all faiths and none. We offer the unsalaried School Direct route to PGCE, providing placements in one of our nine academies. Successful applicants are welcomed into the CST family through a well-established induction programme. You will be treated as a professional colleague from the beginning.\nA significant number of our trainee teachers go on to take up their first post in one of Cathedral Schools Trust's academies.","trainWithDisability":"We welcome applications from candidates with disabilities and other needs, including but not restricted to: dyslexia; physical, hearing and visual impairments; mental health conditions.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"992b9d4a-bdcf-44e8-9296-fb1fe3bb3315","code":"B78","name":"University of Bristol","description":"Cathedral Schools Trust works with the University of Bristol for Secondary English, Maths, Science, Geography, History, Modern Foreign Languages, Music \\u0026 Religious Education. \\r\\n\\r\\nIn 2018, OFSTED reported: A large and increasing proportion of trainees complete the course to a very high standard and swiftly secure employment.\\r\\n\\r\\nWell-trained, highly committed school-based mentors ensure that trainees are well supported through their training year, assess progress accurately and challenge trainees to be the best.\\r\\n\\r\\nPlacements are of a consistently high quality. Decisions to place trainees in schools are thought through with care and are planned well to ensure that trainees experience contrasting schools."},{"id":"da8e5252-e14a-470a-8247-00b835a79010","code":"B80","name":"University of the West of England, Bristol","description":"Cathedral Schools Trust works in partnership with the University of the West of England (Primary phase and Secondary Art, Computer Science, D\\u0026T \\u0026 PE) . \\r\\n\\r\\nThe Department of Education and Childhood at UWE Bristol is a vibrant community with a mission to advance human flourishing and social justice through education and lifelong learning.\\r\\n\\r\\nWe have a long-term commitment to providing high-quality learning, teaching and research. We achieve this through partnerships with a range of local schools, colleges and other organisations."}],"createdAt":"2021-07-06T17:47:30.135Z","updatedAt":"2021-10-07T19:47:34.149Z"}
