{"id":"b22cbff4-7ea1-48ce-8b17-554045d0bc10","name":"Hursthead Junior School Alliance","code":"27X","type":"lead_school","isAccreditedBody":false,"urn":"140925","ukprn":"10046173","address":{"addressLine1":"Kirkstead Road","town":"Cheadle Hulme","county":"Cheshire","postcode":"SK8 7PZ"},"contact":{"website":"http://www.hursthead-jun.stockport.sch.uk","email":"headteacher@hursthead-jun.stockport.sch.uk","telephone":"0161 439 6961","fullName":"Eleanor Losse"},"location":{"latitude":53.3614204,"longitude":-2.18024},"trainWithUs":"Our alliance is led by Hursthead Junior School, a three-form entry Junior School in the south Manchester suburb of Cheadle Hulme. The school is committed to sharing best practice and leading the training of the teachers of the future. We are a close-knit alliance of primary schools in the South Manchester area, who individually have substantial experience of working with trainees and a strong track record of producing high quality teachers. We are proud that many of our trainees have gained teaching posts within our alliance schools, after successfully completing the course.\nPartner schools in the alliance are:\n* Hursthead Junior School (SK8 7PZ) [http://www.hursthead-jun.stockport.sch.uk/]\n* Hursthead Infant School (SK8 7PZ)\n[http://hurstheadinfant.co.uk/]\n* Oak Tree Primary School (SK8 5HH)\n[http://www.oaktree.stockport.sch.uk/]\n* Handforth Grange Primary School (SK9 3NG)\n[http://www.handforthgrange.com/]\n* Bradshaw Hall Primary School (SK8 6AN)\n[http://www.bradshawhall.stockport.sch.uk/]\n* Heald Place Primary School (M14 7GG)\n[http://www.healdplace.manchester.sch.uk/]\nWhilst each school has its own unique ethos, we all share a passion for developing teachers who are committed to delivering creative and fun teaching and learning opportunities.\nSuccessful applicants to our alliance will become part of a family, which offers mentoring from highly experienced practitioners across the full range of primary phases and which will help you to learn and grow in confidence within stimulating environments.","trainWithDisability":"Equal Opportunities\n\nThe Hursthead Junior School Alliance confirms its commitment to a comprehensive policy of equal opportunities for trainees and prospective trainees in: its admissions policy; all aspects of its teaching and assessment; its counselling of trainees; the way it affords access to any of its benefits, facilities and services. \n\nThe aim of this commitment is to ensure that no trainee or prospective trainee receives less favourable treatment directly or indirectly on grounds of race, colour, nationality, ethnic origins, gender, sexuality, marital or parental status, disability, creed, political belief, social or economic class.\n\nPractical support and advice for applicants is available from the Disability Advisory and Support Service. \n\nEmail: dass@manchester.ac.uk","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"9d03acb4-95ce-41e1-8458-0b4bec147b6b","code":"M20","name":"University of Manchester","description":"The alliance offers School Direct places in partnership with the University of Manchester, who validate the course with a PGCE qualification and QTS.\\r\\n\\r\\nThe university-taught course is judged by Ofsted to be ‘Outstanding'. Of particular note:\\r\\n* ‘The high quality and challenge of the training, most especially in mathematics and science.'\\r\\n* ‘The wide range of school-based experiences and the tailored use of practitioners from within the partnership to plan and deliver training.'\\r\\n* ‘The regular auditing of trainees’ progress and their views, with a timely response to identified needs so that trainees benefit quickly from improvements and amendments.'"}],"createdAt":"2021-07-06T17:47:21.968Z","updatedAt":"2021-09-21T17:41:42.515Z"}
