{"id":"b24136ee-0da8-4c10-8c33-8c99b569462d","name":"Campus Stockton Teaching Alliance","code":"2JJ","type":"lead_school","isAccreditedBody":false,"urn":"143063","ukprn":"10057507","address":{"addressLine1":"Campus Stockton Teaching Alliance, C/O Egglescliffe School, Urlay Nook Road,","addressLine2":"Eaglescliffe","town":"Stockton on Tees","postcode":"TS160LA"},"contact":{"website":"www.stocktonteachingalliance.org.uk","email":"caitkin@stocktonteachingalliance.org.uk","telephone":"01642 352570","fullName":"Chris Aitkin"},"location":{"latitude":54.516562,"longitude":-1.359445},"trainWithUs":"Campus Stockton Teaching Alliance and York St John University have a long history of working in partnership to deliver quality teacher training and education which leads to a PGCE with QTS.\nWe work with York St John University because they have been involved in training and educating teachers since 1841 and are committed to working in partnership and collaboration with schools.\nThe partnership work together to provide education and training that is current and relevant and underpinned by high quality research and evidence. Campus Stockton Teaching Alliance offers fantastic training opportunities. The schools provide a variety of educational contexts with students coming from a wide range of socio economic backgrounds and circumstances.\nCampus Stockton Teaching Alliance staff have a wealth of experience of training high quality primary and secondary teachers. Each school has trained professional and subject mentors who will support you through every step of your training.\nThe Partner Schools for primary are:\nJunction Farm, Kirklevington, Layfield, Whinstone, Levendale, The Links, The Village, Bewley, Bader, Levendale, Barleyfields, Durham Lane, St Mary’s, Chandlers Ridge, Salturn, Egglescliffe and Teesside High Independent School Partner Schools for secondary are:\nConyers (11-18), Egglescliffe (11-18), Northfield, All Saints, Ian Ramsey, Trinity, St Peters and Teesside High Independent School. Stockton Sixth Form College also offer 16-19 enhancement. Abbey Hill Academy also offer enhanced experience working in specific SEND setting.\nDetailed information about Campus Stockton Teaching Alliance Partners, the training programme, student teacher evaluations, and general information for applicants, can be found on our comprehensive website:\n[stocktonteachingalliance.org](www.stocktonteachingalliance.org.uk)","trainWithDisability":"Campus Stockton Teaching Alliance and York St John University is an inclusive partnership and has a range of support services for students with disabilities and other needs. We have a dedicated Disability Advice Team and PGCE programmes have a strong track record of supporting all students to enable them to complete their studies successfully.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"b011427a-6dff-4a77-9df3-c85a54be605a","code":"Y75","name":"York St John University","description":"The key aim of the PGCE programme is to deliver a high quality current and relevant programme of training and education that equips you with the professional knowledge, understanding, skills and attributes that you need to become highly effective teachers (and leaders) with both a strong subject and wider professional identity. The programme combines school experience with taught academic sessions in order to achieve this.\\r\\n\\r\\nThe combination of experienced university, school based and other external colleagues working in partnership, makes a powerful and inspiring teaching team for you."}],"createdAt":"2021-07-06T17:46:22.922Z","updatedAt":"2021-07-12T16:48:52.528Z"}
