{"id":"b2926794-2a43-4596-adc8-bf6876e6bf29","name":"Christ Church Primary School, Hampstead","code":"1VM","type":"lead_school","isAccreditedBody":false,"urn":"100028","ukprn":"10074742","address":{"addressLine1":"Christ Church Primary School","addressLine2":"Christ Church Hill","town":"Hampstead","county":"London","postcode":"NW3 1JH"},"contact":{"website":"https://christchurchschool.co.uk/about-us/teacher-training/","email":"admin@teachinglondon.org","telephone":"2079321126","fullName":"Katy Forsdyke"},"location":{"latitude":51.5596747,"longitude":-0.1763079},"trainWithUs":"We are an Outstanding, one-form entry, voluntary-aided Church of England School, with close links with our parish church. We respect and value each individual’s contribution to our school community. We work to inspire our children with a love of learning and to strive for excellence in all aspects of life. We aim to make everyone’s time at Christ Church School an enjoyable and rewarding experience. We run a unique and inspirational arts project, aiming to develop the skills of both children and staff across a wide range of art forms. Our school is a happy and welcoming place to work and we have longstanding and successful experience of supporting those training to teach.","trainWithDisability":"Christ Church has limited access for those with physical disabilities due to the limitations of our building and site. However, we would be very happy to discuss how we could meet the needs of a trainee with any access requirements.\nTeaching London: LDBS SCITT has a degree of step-free access, but as the building was a Victorian school, we are unable to fully accommodate wheelchair access. We are always willing to discuss, and where possible, adapt to meet individual needs.\nThe well-being of our trainees is paramount, which is why you will be automatically enrolled into the Employee Assistance Programme with the Education Support Partnership. This provides 24/7 individual support and counselling, in addition to our in-house advice and support.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"720894da-360a-4f7a-9835-7ce7beb3c6de","code":"L59","name":"Teaching London: LDBS SCITT","description":"An Outstanding provider (Ofsted: 2017), Teaching London puts pupils at the heart of your training. The depth and breadth of our programme enables you to gain the confidence and competence to develop into a highly skilled, responsive teacher. Exciting, interactive and rigorous centre-based sessions will inform your classroom practice, led by inspiring and experienced tutors. Your growth as a reflective practitioner is underpinned by the PGCE element, routed in school-based and current research. \\r\\n\\r\\nTraining teachers for 20+ years, we are highly effective in our role with 76% of trainees graded as Outstanding at the end of their training in 2017-18."}],"createdAt":"2021-07-06T17:52:18.364Z","updatedAt":"2021-07-28T00:01:03.810Z"}
