{"id":"b3681bbc-2e2a-49c3-aa4e-e453a8d0e4a5","name":"University of Greenwich","code":"G70","type":"hei","isAccreditedBody":true,"ukprn":"10007146","address":{"addressLine1":"Avery Hill Campus","addressLine2":"Southwood Site","town":"Avery Hill Road","county":"Eltham, London","postcode":"SE9 2UG"},"contact":{"website":"http://www.gre.ac.uk","email":"courseinfo@gre.ac.uk","telephone":"020 8331 9000","fullName":"Faculty of Education and Health"},"location":{"latitude":51.4458905,"longitude":0.0796007},"trainWithUs":"University of Greenwich is committed to ensuring sustainability across all phases of teacher education and provides initial teacher education across the early years, primary, secondary and further education and skills sector. Located at the university's Avery Hill Campus, the university has been training teachers for over a century. (Early Years Teacher Status is delivered at Maritime Campus)\nOfsted rated the quality of Initial Teacher Training as ‘Outstanding’ for Primary Education (Ofsted Report 2016) and ‘Good’ Secondary, Further Education and Early Years Initial Teacher training. Our expert staff are active researchers as well as being trained teachers. During the programme, you will be allocated a personal tutor who will support your studies. Your tutor will be on hand to offer both personal career and academic guidance. Individual support and designated workshops are tailored to meet the needs of each of our individual students in order to ensure high quality outcomes.\nIf you are studying for your PGCE Early Years Teacher Status, your tuition fees will be covered by a DfE and your employer will receive up to £7,000 to cover your release. The Teachers’ Standards (Early Years) support the training, assessment and award of EYTS. As part of your PGCE, you will have the opportunity to gain 60 Masters-level credits and gain Qualified Teacher Status.","trainWithDisability":"The Student Wellbeing Service (https://www.gre.ac.uk/student-services/support/student-wellbeing) provides information, guidance and support to students with a disability, including physical and mental health difficulties, long-term medical conditions and specific learning difficulties. This service is open to individuals who work and study at the University of Greenwich, and to those who aspire to do so. We also support students from disadvantaged backgrounds and students who are carers.\nBefore you join the University, you can speak to the *STAART team (https://www.gre.ac.uk/study/support/disability/staart#:~:text=The%20STAART%20Team%20is%20a,concerns%20about%20going%20to%20university.) about any concerns on entering higher education and adapting to university life. Once you're a student, we can provide further information and support, such as advice on assistive technology requirements and Disability Allowance Needs Assessors to help you access any financial help you may be entitled to.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:52:21.462Z","updatedAt":"2021-09-14T20:50:53.272Z"}
