{"id":"b384b008-59e2-461e-a15f-3551d1165c1e","name":"University of Northumbria at Newcastle","code":"N77","type":"hei","isAccreditedBody":true,"ukprn":"10001282","address":{"addressLine1":"Pandon Building","addressLine2":"Northumbria University","town":"Newcastle upon Tyne","county":"Tyne and Wear","postcode":"NE2 1XE"},"contact":{"website":"http://www.northumbria.ac.uk","email":"bc.applicantservices@northumbria.ac.uk","telephone":"0191 406 0901","fullName":"Admissions"},"location":{"latitude":54.9777316,"longitude":-1.6044697},"trainWithUs":"Northumbria University in Newcastle upon Tyne,(https://www.northumbria.ac.uk) a 'new kind of excellent University' has a long history of Teacher Education. Situated at the Coach Lane Campus you will be training in a professional environment with students from a range of other disciplines such as Nursing, Occupational Therapy and Social Work.\nWe are ranked 6th in the country for Undergraduate Teacher Training and in the top 20 for Post Graduate Teacher Training in the Smithers (2017) Good Teacher Training Guide, and 9th in the Guardian University Guide and are an Ofsted Good Initial Teacher Training Provider. We offer the following PGCE Initial Teacher Training programmes\nPGCE Primary Education. This is an intensive programme over one year with at least 120 days spent in school and approximately 45 days training in University. School based training is based in one of our Partnership Schools (around 700 from Berwick to the Tees) The age focus is 5-11 years.\nPGCE Early Primary Education\nA 2 year, part-time, distance learning programme. This programme can enable students to continue to work of fulfil caring responsibilities while training. Wed-based materials, bi-yearly study weekends and school based experiences support your training. The age focus is 3-7 years.","trainWithDisability":"As part of a large University all students have access to a wide range of support services and specialist advice and guidance while studying. The University has a Student Support and Wellbeing Team All who have a remit to support students whatever their need. Students who have a specific long term additional need can be assessed via the DSSR process. This ensures that the tutors who work with you know about your needs and are able to make adjustments to ensure that potential barriers to you reaching your potential are reduced or removed.\nThe following are examples of support that students have been able to access\n(* ) extra time for exams, presentations and extensions to hand-in dates\n(* ) material in large font\n(* ) permission to make a audio recording of lectures\nThe following video highlights the main features of the University Student Support and Wellbeing Services and gives a flavour of the services offered (https://youtu.be/02aSoqvTJI0) In the past students with physical, visual and hearing impairments, students with dyslexia and dyscalculia, and students with a range of mental health issues have all been supported to complete their training successfully.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"createdAt":"2021-07-06T17:51:40.344Z","updatedAt":"2021-09-24T20:04:15.075Z"}
