{"id":"b3c401bb-2537-4a17-9df1-c05f21038699","name":"Excalibur @ St John’s","code":"2BO","type":"lead_school","isAccreditedBody":false,"urn":"138623","ukprn":"10038597","address":{"addressLine1":"St John’s Marlborough","addressLine2":"Granham Hill","town":"Marlborough","county":"Wiltshire","postcode":"SN8 4AX"},"contact":{"website":"https://www.stjohns.excalibur.org.uk/about-us/recruitment/train-to-teach/","email":"admintsa@stjohns.excalibur.org.uk","telephone":"01672 519575","fullName":"Excalibur TSA Admissions"},"location":{"latitude":51.4142785,"longitude":-1.730024},"trainWithUs":"The Excalibur@St John’s School Direct Initial Teacher Training programme is delivered through a partnership of schools in Bristol, West Berkshire & Wiltshire, based at St John’s Marlborough, an outstanding academy. We work in collaboration with Bath Spa University to develop and deliver cutting-edge teacher training programmes.\nOur flexible approach to teacher training enables us to meet your needs and interests in both rural and urban locations across a range of secondary schools.\nOur placement schools are situated in excellent geographical locations, close to the M4 and with access to the thriving cities of Bristol, Reading and Swindon. This enables us to offer a unique blend of town and rural educational experiences. We offer Secondary level School Direct ITT training as well as the opportunity to experience Key Stage 2/3 cross-phase and Sixth Form teaching.\nWe are passionate about the development and training of new teachers within our educational settings. You will be able to learn first-hand from our team of outstanding and experienced teachers and ITT mentors who will support you on your journey to PGCE with QTS status and onto the Early Career Framework as an Early Career Teacher.\nIf you would like to discuss your own situation and aims, and find out more about our programme, please email AdminTSA@stjohns.excalibur.org.uk or call us on 01672 519575 for an informal, friendly chat.\nRead more on our website https://www.stjohns.excalibur.org.uk/about-us/recruitment/train-to-teach/","trainWithDisability":"Excalibur Teaching School Alliance is committed to supporting trainees with disabilities. Contact us if you would like to make any adjustments during your application, interview process and training programme.\n\nTrainees will be recruited on the basis of their ability, qualifications and suitability for the position in which they have applied. All applicants will be considered equally and consistently.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:50:14.752Z","updatedAt":"2021-10-20T20:49:05.729Z"}
