{"id":"b41936eb-ac2d-426e-81d8-cb21efb43890","name":"West Jesmond Primary","code":"2FQ","type":"lead_school","isAccreditedBody":false,"urn":"131203","ukprn":"10001282","address":{"addressLine1":"West Jesmond Primary","addressLine2":"Tankerville Terrace, Jesmond","town":"Newcastle-upon-Tyne","county":"Tyne and Wear","postcode":"NE2 3AJ"},"contact":{"website":"http://www.westjesmondprimary.org.uk","email":"office@westjesmond.newcastle.sch.uk","telephone":"1912810000","fullName":"Rebecca McVittie"},"location":{"latitude":54.9910185,"longitude":-1.6087909},"trainWithUs":"Our School Direct programme is firmly embedded within a unique group of Primary Schools who are within the Ouseburn Learning Trust or the Gosforth Schools' Trust . All of our schools are conveniently situated in close proximity to Newcastle City Centre. We work collaboratively to empower young people to excel as individuals and contribute to society. These outcomes are achieved by the outstanding quality of teaching which is responsive in meeting the individual needs of our children. Highly skilled mentors will support you in your rewarding and fulfilling journey towards Qualified Teacher Status ensuring your developmental needs are fully addressed along the way. Our commitment to ongoing professional development ensures that we remain at the forefront in curriculum development and innovative new initiatives.\nEach trainee will be assigned a supportive and motivated mentor within their host school. A contrasting placement will allow a breadth of experience and enable trainees to really discover the exciting variety that primary teaching offers. Our training plan is tailored to the needs of our trainees and is fluid throughout the year. Successful trainees will achieve:\n• Qualified Teacher Status (QTS)\n• a Post Graduate Certificate in Education (PGCE)\n• 60 credits towards a Masters degree from two assignments completed at Level 7\nWe hope that we will be your next step as you embark on your journey to become a primary school teacher. For further information about our programme please contact:\nHelen Sykes on 0191 281 0000 hsykes@westjesmond.newcastle.sch.uk","trainWithDisability":"We have the flexibility to place trainees in the best location to suit their requirements, safe in the knowledge that all schools have in place robust policies and systems to support disabilities and additional needs.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:56:25.657Z","updatedAt":"2021-10-12T15:45:24.319Z"}
