{"id":"b4523d06-8c31-4fb3-b201-a7806c18bb0d","name":"Bury Schools Alliance","code":"274","type":"lead_school","isAccreditedBody":false,"urn":"144408","ukprn":"10063961","address":{"addressLine1":"Bury Schools Alliance","addressLine2":"Christ Church Primary, Church Street","town":"Bury","county":"Lancashire","postcode":"BL8 3AX"},"contact":{"website":"www.ccmat.co.uk","email":"BSA@bury.gov.uk","telephone":"07964332750 07964332749","fullName":"Jo Seddon BTSA Coordinator"},"location":{"latitude":53.6034451,"longitude":-2.338554},"trainWithUs":"Bury Schools Alliance (formally Bury Teaching Schools Alliance) was formed in 2014 by two National Teaching Schools: Christ Church CE Primary School and Elms Bank Specialist Arts College. \n\nThe BSA is a joint venture by primary, special and secondary schools in Bury. We work in partnership with Manchester Metropolitan University to identify and grow our next generation of teachers and future leaders.\n\nWe work very closely with a number of Bury Schools on ITT and are able to provide cross phase opportunities in a range of school settings, eg all students will spend some time within a special school as part of their course. For those with an interest in working in special education we are able to offer placements in a special school context within certain subjects.\n\nThe partnership schools in our alliance offer a range of experiences, working alongside happy and friendly children and hardworking and ambitious staff. All the schools have experience of teacher training and are able to coach and mentor trainees through the programme, producing good and outstanding trainees. In addition to what is offered by MMU, we provide an extensive CPD programme delivered by Local, National and Specialist Leaders of Education. \n\nWe are proud that all BSA Graduates secured employment for their NQT year and a large majority remain within Bury schools. We offer structured career pathway opportunities, building upon the foundations laid in your Initial Teacher Training, and many of our former students now hold middle and senior leadership roles in our schools.","trainWithDisability":"BSA welcomes applications from all candidates. If you have what we are looking for then we want to meet you! We will do everything that we can to make the process smooth for you and ask you to let us know if we can assist in any way. We have and continue to support trainees with various disabilities and other needs (for example, physical disabilities, dyslexia and other needs). If you have any requirements that will assist you in the recruitment process please do not hesitate to contact us. We endeavour to make the process as smooth as possible for all our applicants!","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:55:11.708Z","updatedAt":"2021-11-16T18:35:00.885Z"}
