{"id":"b4d00a08-4aa8-488a-9bf9-33183814d606","name":"LiFE MAT and Partners School Direct","code":"1A4","type":"lead_school","isAccreditedBody":false,"urn":"137969","ukprn":"10036928","address":{"addressLine1":"Bosworth Academy","addressLine2":"Leicester Lane","town":"Desford","county":"Leicestershire","postcode":"LE9 9JL"},"contact":{"website":"https://www.lifemultiacademytrust.org.uk/schooldirect/","email":"bwhite@lifemultiacademytrust.org.uk","telephone":"01455 822841","fullName":"Mandy Bearne"},"location":{"latitude":52.6267018,"longitude":-1.2870334},"trainWithUs":"LiFE MAT and Partners School Direct is a unique partnership of nine schools in Leicestershire with access to 11-19 provision. We offer a range of experiences where you will develop your potential as a teacher. Our vision is: *To develop outstanding teachers of the future and guide them on a career path within our partnership schools. *To enhance and support trainees' professional development.\n*To provide our trainees with outstanding support and development in a positive and caring environment. We offer you: * An expectation that successful graduates of this programme will be considered for employment in our partnership of schools *The maximum possible amount of time working with students and developing the skills to become an outstanding teacher. *The earliest possible opportunity to get into classrooms and make a difference to students. * Access to the opportunities provided by the LiFE MAT. - which includes 6 of our partnership schools.\nOur partnership of schools allows us to be small enough to care and know each trainee really well so that we can identify needs and target support. We encourage our trainees and staff to identify aspirational improvement goals in a supportive workplace culture. Our goal is to create life-long educators who are passionate about the profession and committed to young people.","trainWithDisability":"Wheelchair access is available on our sites. Please let us know if you have any specific requirements that would support you during your training.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:48:21.516Z","updatedAt":"2022-01-07T16:21:54.164Z"}
