{"id":"b506ae4a-ae1b-46cb-9964-0bc1fc269157","name":"Teach Manchester","code":"1HJ","type":"lead_school","isAccreditedBody":false,"urn":"131880","ukprn":"10017302","address":{"addressLine1":"St Peter’s RC High School","addressLine2":"Kirkmanshulme Lane","town":"Manchester","postcode":"M12 4WB"},"contact":{"website":"https://teachmanchester.com/","email":"schooldirect@teachmanchester.com","telephone":"0161 248 1550","fullName":"Michelle Ames - Assistant Headteacher"},"location":{"latitude":53.4599858,"longitude":-2.1927584},"trainWithUs":"Teach Manchester is an experienced School Direct Alliance of primary, secondary, specialist and sixth form schools and colleges based in central Manchester, working in partnership to offer innovative and exciting Initial Teacher Education. We are committed to providing an outstanding programme of support to training teachers so that they develop into confident and competent teachers who can contribute to the culture of excellence across the alliance and beyond.\nWe work in partnership with Manchester Metropolitan University, University of Manchester and University of Cumbria to offer innovative and exciting Initial Teacher Education across primary, primary with SEND and secondary subject specialisms. Our programme equips new teachers with the skills and knowledge to be outstanding teachers and is delivered by our Specialist Leaders of Education, School Leaders and colleagues from our university partners. Upon successful completion of our programme you will be awarded both Qualified Teacher Status and up to 60 Masters Level Credits as a Postgraduate Certificate in Education (PGCE) by our partner universities.\nEvery child should be taught by an outstanding teacher.","trainWithDisability":"All successful applicants are required to undergo a Fitness to Teach assessment as a condition of offer. These are undertaken by the Occupational Health contractor of the partner university. We encourage all applicants with disabilities and other needs to talk to us individually regarding their needs and how we can best support them during the period between accepting an offer and the start of the course to ensure that we can make appropriate arrangements. We will use information from the applicant and from professional referrals (for example GPs, Occupational Health, Education Psychologist) as appropriate to provide support on an individual basis. We work collaboratively with our accrediting universities to support students; and services such as counselling are available through the partner university. We work with Manchester University, Manchester Metropolitan University and University of Cumbria across our programme suite. Do check the course description to find out the partner university for the course that you are interested in.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:48:07.242Z","updatedAt":"2021-12-10T19:52:18.873Z"}
