{"id":"b545fea3-2858-462b-9584-dfdfe3acb99f","name":"Ash Field Academy School Direct","code":"194","type":"lead_school","isAccreditedBody":false,"urn":"138094","ukprn":"10037053","address":{"addressLine1":"Broad Avenue","addressLine2":"Evington","town":"Leicester, Leicestershire","county":"East Midlands","postcode":"LE5 4PY"},"contact":{"website":"http://www.ashfield.leicester.sch.uk/get-into-teaching-ash-field-","email":"admin@leics-scitt.co.uk","telephone":"0116 254 3187","fullName":"Ash Field Teaching Alliance"},"location":{"latitude":52.6291998,"longitude":-1.0862023},"trainWithUs":"Ash Field Academy is an outstanding special school in Evington, Leicester with pupils ranging from 4-19 years old. Ash Field is also a National Teaching School with one of their key responsibilities being to promote and develop `best’ practice’ in Initial Teacher Training. The school is passionate about supporting the highest quality training for new teachers and has chosen to work with the [Leicester and Leicestershire Primary SCITT]( http://www.leics-scitt.co.uk) and Leicestershire Secondary SCITT.\nThe [Ash Field SD primary programme](https://leics-scitt.co.uk/our-courses/) is for trainees with an interest in special education and SEN and all primary trainee teachers attend the [full training programmes](https://leics-scitt.co.uk/our-courses/) provided by the L&L SCITT and are managed through the SCITT management team. Trainees are supported by tutors with specialist SEN knowledge and placed in primary SCITT partnership schools across the City and County, in addition to a final placement in a special school.\nThe Ash Field SD Secondary English programme is managed through [Leicestershire Secondary SCITT]( https://www.leicestershiresecondaryscitt.org/)\nAll SCITT trainees on both the primary and secondary programmes are also full students at the University of Leicester, gaining an internationally recognised PGCE, with Masters level credits.","trainWithDisability":"Education and training providers have a duty under the Equality Act 2010 to anticipate the adjustments that disabled students may need. The SCITT is committed to actively promoting equal opportunities in employment and to encouraging participation by disabled people in public life. If you would describe yourself as having a disability, in accordance with the Equality Act (2010), and need any adjustments made to promote equality of opportunity, please contact us, as soon as possible, so we can discuss your requirements. The best place for you to do this is on your UCAS form. However, you can also do it at any time during your studies, either by telling a member of SCITT Management. As we are partnered with the University of Leicester, our students can access the Student Support Services offered. The AccessAbility Centre offers support and advice for students with dyslexia or other specific learning difficulties as well as working with students who have sensory disabilities, mobility difficulties; mental health conditions and autism. The Centre offers study skills support. [The AccessAbility Centre](https://www2.le.ac.uk/offices/accessability)","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:54:59.480Z","updatedAt":"2021-09-24T19:44:30.281Z"}
