{"id":"b6a911a2-d2a2-4f78-be05-6642494fc592","name":"St. Edward’s Teacher Training Partnership","code":"1EG","type":"lead_school","isAccreditedBody":false,"urn":"102769","ukprn":"10079503","address":{"addressLine1":"Green Street","town":"Upton Park","county":"London","postcode":"E13 9AX"},"contact":{"website":"http://www.st-edwardsteachingalliance.co.uk/","email":"ko.poon@st-edwards.newham.sch.uk","telephone":"2084724337","fullName":"St Edward's Catholic Primary School"},"location":{"latitude":51.5326912,"longitude":0.0372303},"trainWithUs":"The School Direct (salaried) route is an employment based route into teaching for high quality graduates with three or more years’ career experience. As a trainee you will be employed as an unqualified teacher by a school. St. Edward’s Teacher Training Partnership works with the Partnership London SCITT (PLS) to provide School Direct ITT in Newham and its neighbouring boroughs.\nWe offer training for 5-11 age ranges. Weekly sessions are delivered a range of schools including Sydney Russell Secondary School and St. Angela's Secondary School which includes professional studies and subject related sessions. This programme provides opportunities for trainees to observe outstanding teaching and learning across a variety of settings and develop networks of local peer support.","trainWithDisability":"All St. Edward's Teacher Training Partnership schools are compliant with disability access.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"a6a60029-f606-42b6-b526-48360b61890c","code":"2B1","name":"Partnership London SCITT (PLS)","description":"Partnership London SCITT is based in the heart of east London. PLS distinguishes itself from other local providers by its unique ethos and mix of schools and academies, long history of teacher training activity, geographical spread and commitment to a diverse workforce in a multi-cultural environment.\\r\\n\\r\\nPLS aims:\\r\\nRecognise and respond sensitively to the talents and needs of every trainee teacher and provide developing their full potential\\r\\nEnsure equality of opportunity is available to all\\r\\nWelcome, value and respect all who train in PLS\\r\\nProvide opportunities for experiencing the fullness educational life while developing a spirit of tolerance \\u0026 understanding"}],"createdAt":"2021-07-06T17:50:14.687Z","updatedAt":"2021-10-11T19:24:32.236Z"}
