{"id":"b6d44f7c-44cb-4edc-a0fd-f726cc82d1b5","name":"Ashbourne Dove Valley Federation ITT","code":"2BE","type":"lead_school","isAccreditedBody":false,"urn":"112847","ukprn":"10074888","address":{"addressLine1":"Osmaston C of E Primary School","addressLine2":"Moor Lane, Osmaston","town":"Ashbourne","county":"Derbyshire","postcode":"DE6 1LW"},"contact":{"website":"www.teachashbourne.com","email":"Farrs@osmaston.derbyshire.sch.uk","telephone":"01335 343140","fullName":"Susan Farr"},"location":{"latitude":52.9925959,"longitude":-1.7050641},"trainWithUs":"Ashbourne Dove Valley Federation -ITT is a thriving provider of Teacher Training and recruitment being at the forefront of its success! • The ADVF-ITT (formally Ashbourne Dove Valley Teaching School Alliance)has recruited and successfully trained 53 School Direct Primary Teacher Trainees (unsalaried) from 2017 to 2021. All trainees gained a PGCE with QTS and have secured teaching positions. 15 have recently completed their NQT year, of which 5 currently support on professional aspects of the programme, for new trainees. • There are currently 35 schools who have actively engaged with the ADVF-ITT. Many schools approached the ADVF -ITT to join it's high quality teacher training programme.\n• ADVF-ITT are excited about training another 12 School Direct Primary Trainees (unsalaried) from September 2021.\n• ADVF-ITT works in true collaboration with placement schools, as it believes that investing in the School Direct Programme, will contribute positively towards the education of young children.\nADVF-ITT will give you academic input and professional studies from our HE partner Derby University, leading to qualified Teacher Status (QTS) with Post Graduate Certificate of Education (PGCE) and 60 Master credits. Trainee Feedback (2019-21):\n\"Can I take this opportunity to thank you all for your efforts throughout the training year. I have absolutely loved every minute of my training. Every week I look forward to our Alliance Training Day as I gain so much knowledge from them. All the teachers are brilliant during these training days and provide us with so much support.\"","trainWithDisability":"We provide a wide range of support for all students; this will vary, according to need. Placement schools are carefully selected to accommodate the needs of each individual trainee. All trainees will be allocated an experienced teacher as a mentor. Derby University will also allocate a University Link Tutor. The mentor and tutor will work together to ensure that all trainees, regardless of disability or needs, are supported and guided through all aspects of their training. Sue Farr (ADVF-ITT Leader) closely networks with Headteachers to ensure that the trainees well-being and growth is carefully overseen. Trainee Feedback (2019-21):\n\"I just want to say a big thank you to you for all the hard work and dedication over the year. I am extremely grateful that you made the decisions you did because it has definitely worked out for the best and I appreciate the experiences I have had. Looking back, I never thought I was going to get to the place I am today and I am very proud of how I have turned it around and become the teacher I am today.\"\n\"I just want to say thank you for everything this year, for all the support and for always believing in me. Itʼs been a pleasure to be a part of the alliance!\"","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-12T20:48:10.111Z","updatedAt":"2021-09-27T19:26:57.812Z"}
