{"id":"b7671104-4799-47f1-89d3-f8f0be7c908f","name":"Alton Schools Teaching Alliance","code":"2BY","type":"lead_school","isAccreditedBody":false,"urn":"116337","ukprn":"10071550","address":{"addressLine1":"School Road","addressLine2":"c/o Rowledge C oF E Primary School","town":"Rowledge","county":"Hampshire","postcode":"GU10 4BW"},"contact":{"website":"http://www.altonschools.com","email":"info@altonschools.com","telephone":"01252 792346","fullName":"Patricia Snook"},"location":{"latitude":51.1834047,"longitude":-0.8268549},"trainWithUs":"The Alton Schools Teaching Alliance offers you something different. Our Initial Teacher Training has small, carefully chosen cohorts with outstanding support and pastoral care.\nAs part of the Alton Schools Teaching Alliance, our Alton cluster comprises 15 schools across East Hampshire. The lead school for the ITT programme is Rowledge Primary School - Ofsted rated as Good.\nOur schools offer a wide range of teaching experiences in Good and Outstanding; rural and town; infant, junior and all-through primary. We have worked closely for over 10 years and we are bonded by one common goal: to provide exceptional education and opportunities for every child. Mentors within our Alliance are excellent teachers, passing on their skills through feedback, coaching and classroom observation. This will prepare you to teach creatively and effectively across the whole primary curriculum and early years foundation stage. Opportunities with us do not stop at the end of your PGCE year. Possibility of employment within the Alliance will be available for the very best candidates, with future career progression including Middle and Senior Leadership. 90% of our 17/18 and 18/19 students have secured employment within our Alliance or other local schools.\nFor more information visit:\n[www.altonschools.com](https://www.altonschools.com)","trainWithDisability":"Your well-being is a top priority and we will do all we can to give you the chance to flourish and maximise your potential.\nIn partnership with the University of Winchester, there is a dedicated student support team to help with any questions or challenges you might experience during your studies. \nWe work with you to support your well-being and mental health, provide confidential advice and offer workshops to boost your academic skills. If you have a disability or learning difference, we encourage you to get in touch before you apply so we can discuss tailored support for your individual needs.\n[Winchester.ac.uk](https://winchester.ac.uk/accommodation-and-winchester-life/student-life/student-support/wellbeing/)","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:50:41.079Z","updatedAt":"2021-10-11T14:10:23.941Z"}
