{"id":"b78a6c0d-9694-4a77-8b8e-1e38cafdd4f5","name":"Tidal Education Alliance","code":"1OL","type":"lead_school","isAccreditedBody":false,"urn":"117814","ukprn":"10044816","address":{"addressLine1":"Spring Cottage Primary School, Dressay Grove","town":"Hull","county":"Kingston-upon-Hull","postcode":"HU8 9JH"},"contact":{"website":"https://tidalschools.co.uk/school-direct/","email":"office@tidalschools.co.uk","telephone":"1482794183","fullName":"Joanne Rozenbroek"},"location":{"latitude":53.7803018,"longitude":-0.2936378},"trainWithUs":"Tidal Education Alliance is a partnership of highly successful schools in Hull and the East Riding.\nSchools in the partnership range from the ethnically diverse and inner city, to rural and market town, but share a common attribute in that they offer an outstanding professional training experience for graduates new to teaching.\nSecondly, where teaching opportunities within the partnership arise, outstanding qualified teachers who have trained with us have the strongest chance of gaining employment.\nOur PGCE Initial Teacher Training Programme will:\n• Be based predominantly around school experience, with outstanding training delivered at the host and alternative placement schools, from September you are in school 4 days out of 5.\n• Lead to full PGCE with QTS and Masters Credits (linking to your Continuing Professional Development within the partnership).\n• Lead to a planned career path within our partnership, provided we are able to offer you a position.\nIn 2020/21 100% of Tidal graduates were successful in gaining employment. For 2022/23 Tidal will be offering Primary (5-11) and EYFS (3-7) focussed School Direct routes to gaining a postgraduate teaching qualification:\nFor 2022-2023 we are partnering with Yorkshire Wolds Teacher Training to offer an outstanding training programme, with an accredited PGCE from Sheffield Hallam University.","trainWithDisability":"All schools in the partnership have up to date accessibility plans and are continually working to ensure all needs are accommodated in our schools.\n\nAny candidates with additional needs receive additional time when completing University skills tests as part of the recruitment process.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"accreditedBodies":[],"createdAt":"2021-07-06T17:53:41.320Z","updatedAt":"2021-09-23T14:49:41.830Z"}
