{"id":"b7eed63e-bb08-4445-bb7a-a3ea2eae9a58","name":"St Joseph’s College SCITT","code":"1WJ","type":"scitt","isAccreditedBody":true,"ukprn":"10032965","address":{"addressLine1":"St Joseph’s College","addressLine2":"London Road","town":"Trent Vale","county":"Stoke-on-Trent","postcode":"ST4 5NT"},"contact":{"website":"https://www.sjcscitt.co.uk/","email":"adavies3@stjosephsmail.com","telephone":"01782 418211","fullName":"Angela Davies"},"location":{"latitude":52.9879544,"longitude":-2.1990396},"trainWithUs":"St Joseph's College SCITT offers high quality, school-based Initial Teacher Training within the primary and secondary phase leading to the award of QTS. As an established accredited provider of ITT, we have a track record of supporting trainees to reach high standards who have enjoyed excellent outcomes and employment prospects that beat national benchmarks. As a trainee on this programme you will experience a truly school centred approach to your training that will enable you to acquire rapidly the skills needed to become a highly effective classroom practitioner. The programme covers either the 11-16 (secondary) or 5-11 age range (primary), however we are also able to offer all secondary trainees an additional post-16 enhancement through St Joseph's College Sixth Form, and primary experience. For primary trainees we are able to offer secondary experience and EYFS enhancement.\nSt Joseph's College has been graded by OFSTED as outstanding in every category and is a National Teaching School. We work as part of the St Joseph's College Stoke Secondary Partnership and The Potteries Teaching School Alliance to deliver the SCITT/School Direct programme and this partnership includes lead schools from across Stoke-on Trent and the locality. This is a diverse area whose community the partnership serves to ensure the best possible outcomes for our young people. Our delivery draws on expertise from across our partner schools and this enables us to deliver high quality placements supported by expert subject and professional mentoring.","trainWithDisability":"We welcome applications from all sections of the community. Applicants who would benefit from disabled access should let us know on their application so that they can be considered for placements at appropriate schools.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:56:58.962Z","updatedAt":"2021-10-12T17:44:37.057Z"}
