{"id":"b823d15e-cd99-4395-ae4d-581c5d1215d6","name":"Tudor Grange SCITT","code":"T87","type":"scitt","isAccreditedBody":true,"ukprn":"10031583","address":{"addressLine1":"Tudor Grange Academy Solihull","addressLine2":"Dingle Lane","town":"Solihull","county":"West Midlands","postcode":"B91 3PD"},"contact":{"website":"https://teachingschool.tgacademy.org.uk/","email":"teachingschool@solihull.tgacademy.org.uk","telephone":"1217038250","fullName":"Head of Admissions"},"location":{"latitude":52.404461,"longitude":-1.79326},"trainWithUs":"Tudor Grange SCITT is a provider with a long established track record. We have strong relationships with our partner schools across Solihull, Warwickshire, Birmingham, Coventry, and Worcestershire.\nThis results in a wide range of options being available when considering which placement school will work best for you logistically and to enable your progress. We are part of a very successful Multi-Academy Trust, and as such are able to offer a diverse and bespoke experiences. Consistently, over the past three years nearly 20% of our cohort have been recruited into roles within the Trust. Last year this increased to nearly 25% across both primary and secondary phases.\nOur primary and secondary cohorts have opportunities to collaborate during their training, and this further enriches trainees’ understanding of overall childhood development. Trainees focus on the phases which they are training for, but can do so with an applied knowledge of pupils experiences in education prior to or following on from their phase.\nWe work closely with local partners, including recruitment consultants, to enable trainees to understand the job market and help them develop their confidence and knowledge of how to make successful applications. This includes support in writing personal statements and a ‘mock’ interview, with written and verbal feedback.\nWe firmly believe that the quality of training, alongside a focus on enhancing employment prospects contributes to our strong track record in supporting trainees secure jobs. We also continue to offer a wide range of support to our alumni.","trainWithDisability":"Tudor Grange SCITT is committed to promoting equal opportunities in recruitment to the program. All candidates will receive equal treatment regardless of age, disability, gender reassignment, marital or civil partner status, pregnancy or maternity, race, colour, nationality, ethnic or national origin, religion or belief, sex or sexual orientation.\nIf you require any arrangements to be made in terms of the recruitment process please get in contact.\nIf you would like to discuss ways in which we may be able to support you personally, please feel free to contact us to make a telephone or personal appointment. Please be reassured we will treat such information with respect and discretion. Please refer to our Tudor Grange Academies Trust Equal Opportunities Policy for further information;\n[https://www.tgacademy.org.uk/files/mdocs/equalopportunitiespolicy.pdf]","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:53:28.730Z","updatedAt":"2021-10-04T19:55:33.195Z"}
