{"id":"b8bc8017-5082-470e-ab1c-39057b1144f0","name":"Celtic Cross Education","code":"HG8","type":"lead_school","isAccreditedBody":false,"urn":"140027","ukprn":"10042941","address":{"addressLine1":"Unit 15, Victoria Trading Estate","town":"Roche","county":"Cornwall","postcode":"PL26 8LX"},"contact":{"website":"https://www.celticcross.education/topic/initial-teacher-training","email":"ITT@celticcross.education","telephone":"1208590150","fullName":"Kim Southey"},"location":{"latitude":50.4211769,"longitude":-4.8288266},"trainWithUs":"We can offer you: All CCE schools adhering to the Celtic Cross Education Vision NURTURE LEARN\nACHIEVE\nA range of 12 schools – from large urban schools, smaller village schools to one of the smallest rural schools in Cornwall. Schools near the coast, moor or town. Schools isolated by location from others, or within close proximity to other local Trust schools. Schools with a range of class, year and phase structures from single aged classes, mixed aged classes to whole key stages. Church School ethos across all twelve schools with a Christian Distinctiveness Lead across the Trust. Focus weeks in Outdoor Education, SEND including Nurture provision and Christian Distinctiveness. Dedicated and experienced school leaders and mentors who have ITT experience. Training delivered in our schools and at our Trust Training Centre led by Trust staff and specialist providers.","trainWithDisability":"Applicants with disabilities and other needs should inform us of this on their application so that they can be considered for placements at appropriate schools. Please find detailed information about the support we provide in conjunction with Plymouth Marjon University below: University of St Mark and St John (Marjons) :www.marjon.ac.uk/student-life/student-support-/disability--inclusion-advice-service","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:53:01.000Z","updatedAt":"2021-10-14T15:26:43.538Z"}
