{"id":"b9755659-0a1a-434a-aaaa-da996c16a78b","name":"Whiteknights Primary School","code":"4W2","type":"lead_school","isAccreditedBody":false,"urn":"109839","ukprn":"10081272","address":{"addressLine1":"Fair Lawn Green, Shinfield Rise","town":"Wokingham","county":"Berkshire","postcode":"RG28EP"},"contact":{"website":"https://www.whiteknights.wokingham.sch.uk/","email":"head@whiteknights.wokingham.sch.uk","telephone":"0118 987 2588"},"location":{"latitude":51.4291164,"longitude":-0.9420924},"trainWithUs":"Over several years Whiteknights Primary School has worked to develop an excellent teaching team. Together they have worked to become one of the best performing primary schools in the country. https://www.getreading.co.uk/news/local-news/whiteknights-primary-school-8444356\nThe schools passion for developing the best possible curriculum and developing the strongest pedagogy based on the latest research has been a significant contributor to the success experienced.\nWhiteknights works in partnership with the Bel Vue Place Multi Academy Trust ( https://www.bpet.co.uk/) and a collaboration of schools called the Schools Learning Alliance ( https://schoolslearningalliance.org/). Together we offer a rich training experience across our partner schools and work to help others step in to the classroom and succeed.\nOur collective strengths are complemented by the close working relationship we have with our local Maths Hub ( https://mobius.greenhousecms.co.uk/Our-Region/ ), English Hub ( https://www.whiteknightsenglishhub.org.uk/ )and newly appointed Teaching School Hub ( https://www.lgs.slough.sch.uk/page/?title=Teaching+School+Hub&pid=324)\nOur philosophy is underpinned by our slogan 'Growing Greatness', which embraces the belief that every pupil can and must make strong progress. This philosophy is extended to our trainees who are empowered with knowledge and experiences which position them for success as they step into one of the most rewarding career options.","trainWithDisability":"Where candidates require support in accessing training, a risk assessment is undertaken before a placement is agreed to ensure that the candidate is able to succeed.","accreditedBodies":[],"createdAt":"2021-09-13T23:58:25.375Z","updatedAt":"2021-10-14T20:20:22.675Z"}