{"id":"b998b5d3-81fe-4510-b505-557f21141349","name":"Sussex Teacher Training Partnership","code":"E37","type":"scitt","isAccreditedBody":true,"ukprn":"10002131","address":{"addressLine1":"Robsack Wood Primary Academy","addressLine2":"Whatlington Way","town":"St Leonards-on-Sea","county":"East Sussex","postcode":"TN38 9TE"},"contact":{"website":"http://www.sussexttp.org.uk/","email":"enquiries@sussexttp.org.uk","telephone":"01424 853521","fullName":"Kirsty Wilson"},"location":{"latitude":50.8694548,"longitude":0.5283},"trainWithUs":"We are committed to developing outstanding teachers, helping to close the gap between disadvantaged pupils and their peers and providing opportunities for all pupils to excel. If you have a passion for igniting the potential of children, which should be at the heart of great education, this is the programme for you!\nThe programme is accredited through the University of Brighton Academies Trust and is managed jointly by Lead Schools. Robsack Wood Primary Academy is the Lead training school. Training covers the whole primary 5 - 11 age range. We train with schools across Sussex, Brighton & Hove and Kent. We offer both full time (one year) and part time (up to two years) programmes, leading to Qualified Teacher Status (QTS). During your training you will train alongside experienced teaching staff, building up your teaching practice as the programme progresses.\nThe Sussex Teacher Training Partnership will be running virtual information events over the year ahead. Visit our website for more information or find us on Facebook and Twitter.","trainWithDisability":"Sussex Teacher Training Partnership welcomes applications from all sections of the community, and recognises and values the diversity of trainees recruited to the programme including those with a disability.\nWe want to ensure that all the attributes, talents and skills available throughout the community are recognised and our principle is that training places should be filled by those best able to fulfil the requirements of the programme.\nWith partnership schools, the programme will support with adjustments to training to assist trainees with a disability.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:48:28.538Z","updatedAt":"2021-09-17T18:57:58.661Z"}
