{"id":"b9b841c1-3215-4eee-8904-feb11400b7af","name":"Star Teachers SCITT","code":"2A6","type":"scitt","isAccreditedBody":true,"ukprn":"10048788","address":{"addressLine1":"Star Institute","addressLine2":"Star Academies","town":"Shadsworth Road","county":"Blackburn","postcode":"BB1 2HT"},"contact":{"website":"http://www.starinstitute.org.uk","email":"mehroonnisha.mulla@staracademies.org","telephone":"0330 313 9876","fullName":"Star Teachers"},"location":{"latitude":53.7409442,"longitude":-2.4515764},"trainWithUs":"If you are considering a career in teaching, the outstanding Star Teachers SCITT programme provides the best possible chance to become an outstanding teacher. The Star Teachers route includes time spent training in at least two schools and leads to Qualified Teacher Status (QTS). The optional award of a PGCE is also available via our university partner. We focus on you as an individual, working with you to design a pathway personalised to your specific needs and circumstances. You will be supported to systematically develop a teaching toolkit based on a deep knowledge and understanding of how children learn. You will be placed in some of the best schools in the country, where the attainment and achievement of children and young people are outstanding and where the teaching is consistently excellent. Highly skilled professional mentors, in school and from the central team, will coach you throughout the programme, helping you to understand the theory of teaching and apply the skills you develop in classroom contexts. Your progress will be assessed in a variety of ways, all of which will support your development as a reflective practitioner and outstanding teacher. As a Star Teacher graduate, we will work with you to secure a role in our growing network of outstanding Star schools where you can enjoy a range of enhanced benefits and outstanding training and development opportunities. In choosing to complete Initial Teacher Training with Star, you also begin a journey of continuous professional development with us.","trainWithDisability":"The Star Teachers SCITT programme welcomes applications from a diverse range of backgrounds, which includes trainees with specific learning needs. We have coached trainees with diagnosis’ in dyslexia and visual impairments who have gone on to become good and outstanding teachers. At Star we assess the potential to train to teach using the Teachers’ Standards and will make reasonable adjustments, working alongside trainees and our school partners, for the right candidates to enter the teaching profession. We make full use of IT and VLE facilities to enhance learning opportunities for all our trainees. Our mentors and tutors at centre-based training venues and within our schools work hard to ensure that training is accessible for all.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:51:26.269Z","updatedAt":"2022-01-07T22:46:44.815Z"}
