{"id":"ba982f15-581b-43c8-a188-08b0480bd19d","name":"Chester Diocesan Academies Trust","code":"3C5","type":"lead_school","isAccreditedBody":false,"urn":"147810","ukprn":"10045107","address":{"addressLine1":"Church House 5500","addressLine2":"Daresbury Park","town":"Daresbury","county":"Warrington","postcode":"WA4 4GE"},"contact":{"website":"https://cdat.co.uk","email":"office@cdat.co.uk","telephone":"7488812724","fullName":"Neil Dixon"},"location":{"latitude":53.3312763,"longitude":-2.6436804},"trainWithUs":"We believe that the School Direct programme run by Chester Diocesan Academies Trust (CDAT) provides a high-quality and distinctive route to becoming a primary school teacher. Over the course of a school year, trainees spend the vast majority of their time in school, learning from high-quality classroom practitioners. This time in school is supplemented with a comprehensive training programme, again delivered by successful serving practitioners, and masters-level input from our partner university. At the end of the programme, trainees leave with both QTS and a PGCE.\nCDAT is a successful, growing multi-academy trust stretching across the Diocese of Chester - including schools in Cheshire East and West, the Wirral, Stockport and Tameside. Our schools provide varied training opportunities – from larger schools with 350+ pupils to smaller ones with fewer than 50, and from diverse, urban areas to village and rural locations. It is this great variety that gives CDAT’s School Direct programme a special flavour. While all of the schools in the trust itself are Church of England schools – another distinctive feature of our programme – CDAT works more broadly with other faith and community schools and a range of specialist providers.\nWe promise to provide:\nPlacements in schools that offer strong mentoring and support.\nHigh quality training delivered by expert current classroom practitioners.\nQuality Masters-level input from our university partner.\nTop quality support from experienced tutors and the programme team.","trainWithDisability":"Both CDAT and the Mersey Boroughs Partnership are committed to equality of opportunity and proud of the help we offer.\nInterviewees who would benefit from additional support are asked to contact us prior to the interview day: for example, to allow us to make extra time for or adjustments to any written tests or to put other appropriate arrangements in place.\nTrainees are also encouraged to disclose any specific physical or other needs that they have in order for us to make any necessary adjustments, both at our training venues and within our placement schools. Our schools are typically accessible and have on-site parking.\nAs part of the pre course requirements potential ITT trainees are required to complete a Health Questionnaire and some may be asked to attend a screening appointment with our Occupational Health provider.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-09T20:34:38.159Z","updatedAt":"2021-10-05T22:33:11.417Z"}
