{"id":"bb7039c6-8e6c-4007-a44f-e3ae6b0163d0","name":"Moor End Academy","code":"1A1","type":"lead_school","isAccreditedBody":false,"urn":"137500","ukprn":"10034559","address":{"addressLine1":"Moor End Academy","addressLine2":"Dryclough road","town":"Huddersfield","county":"West Yorkshire","postcode":"HD4 5JA"},"contact":{"website":"https://www.moorend.org","email":"rthompson@edu.moorend.org","telephone":"1484503112","fullName":"Teaching School Coordinator"},"location":{"latitude":53.629761,"longitude":-1.810458},"trainWithUs":"Moor End Academy, is an Outstanding Secondary School in the Huddersfield area. As lead school for the School Direct programme, it has a very clear vision for its students:\n\"Be the best - become the leaders of tomorrow!\"\nWe passionately believe that, as educators, we have the power and responsibility to inspire our students to be the best they can be - to enable our learners to pursue their dreams and become the leaders of tomorrow.\nWhilst this vision and clear ethos is directed towards the students, equally this is the vision for our trainee teachers. We will train you within our partnership schools so that you will be the best and become the leaders of tomorrow.\nWe are the Outstanding school within the South pennine Academies Trust. The Trust works across Kirklees, Calderdale and Oldham, having three Secondary schools, six Primary schools and two Pre-Schools. Two of the Primary schools are brand new Free schools, with Beaumont Primary Academy based in a multi million pound school and Brambles due to be in a brand new build by September 2019.\nWe are a strategic partner of the Pennine Teaching School and we work closely with many of the schools in the Alliance, using their schools (in addition to our own Trust schools) to train and mentor our trainees. The Teaching School also organises the Special Educational needs placement which our trainees have as part of their school based experience.","trainWithDisability":"As Lead School, Moor End Academy is committed to providing an environment that enables full curriculum and training access that values and includes all trainees regardless of their physical, sensory and emotional needs. We are committed to taking positive action in the spirit of the Equality Act 2010 with regard to disability and to developing a culture of inclusion, support and awareness within the Partnership.\nOur training centre caters for trainees who are physically disabled. The Centre has a lift facility and the training is contained within one area. The catering facilities are exceptional with specialist cooking and washing facilities to meet the needs of wheelchair users. When placing trainees within our partnership schools we will take into consideration the specific needs of the individual and make reasonable adjustments as required.\nOn our Campus we have a Visual Impairment unit which is able to cater for the needs of the trainees and can adapt resources accordingly. Equally we are able to source resources which may be of benefit to any trainee with dyslexia in-order to support them in their study and school based training.\nAs part of the SCITT's training, our trainees complete a Wellbeing Plan which is used to shape the support we offer our trainees. When necessary, and with the trainee’s consent, we will seek additional resources eg mental health counsellors to cater for the needs of our trainees.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"b0223445-3531-47a6-81b0-839f90b8335b","code":"2EX","name":"Huddersfield Horizon SCITT","description":"The Huddersfield Horizon SCITT accredits our School Direct trainees, awarding them with Qualified Teacher Status, whilst Sheffield Hallam works in tandem with the SCITT to deliver the Post Graduate Certificate of Education.\\r\\n\\r\\nOur trainees attend the brand new multi million pound Partnership Training centre at least once a week to support their four days in school.\\r\\nThe Partnership provides weekly core training from facilitators who are ‘’inspirational’’ and that encourage trainees to feel safe taking risks and to develop a fluent teaching style. \\r\\nThe SCITT prides itself on its bespoke and ‘round the clock’ support for each individual trainee."}],"createdAt":"2021-07-06T17:46:38.706Z","updatedAt":"2021-09-08T21:26:51.617Z"}
