{"id":"bc44648d-e0e6-4afe-9ce2-0dbfdb96c45d","name":"Heronsgate Primary School","code":"1EE","type":"lead_school","isAccreditedBody":false,"urn":"100158","ukprn":"10078039","address":{"addressLine1":"Heronsgate Primary School","addressLine2":"Whinchat Road","town":"London","county":"London","postcode":"SE28 0EA"},"contact":{"website":"https://www.heronsgate.greenwich.sch.uk/teacher-training","email":"ea@heronsgate.greenwich.sch.uk","telephone":"020 8317 0809","fullName":"Steven Connors- Executive Headteacher"},"location":{"latitude":51.493498,"longitude":0.083585},"trainWithUs":"Heronsgate Primary School (rated Outstanding in March 2019 by Ofsted), take a leading role in co-ordinating teacher training.\nWe host a number of School Direct places each year in partnership with the University of Greenwich. This path into teaching is a great way to gain the qualifications and practical skills you need to become a teacher. We offer the School Direct tuition-fee funded route into teaching. Heronsgate are also now working with Royal Borough of Greenwich Apprenticeships Plus and the University of Greenwich to offer postgraduate teaching apprenticeships.\nWith our outcomes for children and young people improving each year, Royal Greenwich is a great place to grow up, work and visit. We know teachers can transform lives and whatever their background, we want every child, living in this Royal Borough in a fantastic capital city, to be able to take full advantage of the opportunities available on their doorstep.\nWe hope our trainees will go on to work locally and take advantage of our career-long training opportunities.","trainWithDisability":"We welcome applications from disabled people and are committed to helping disabled trainees succeed. Advice and guidance is based on your individual needs and long-term medical conditions.\nOur courses aim to remove all unnecessary barriers for trainees from recruitment, induction and throughout courses, trainees are encouraged to inform us of their needs and discuss any concerns so that reasonable adjustment can be put in place to ensure equality of access to learning and assessment.\nAll placements offer mentor support. Trainees employed in Royal Greenwich schools can access RBG staff support and can also access support through their university.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"b3681bbc-2e2a-49c3-aa4e-e453a8d0e4a5","code":"G70","name":"University of Greenwich","description":"University of Greenwich programmes equip students with skills, knowledge and understanding to enter the profession with enthusiasm, confidence and the ability to motivate and inspire young learners. \\r\\n\\r\\nThe University has a long history of teacher training, going back over 100 years at the Avery Hill Campus.  The University’s lecturers are all experienced classroom practitioners with an enviable record of success in teacher training.\\r\\n\\r\\nIn 2017, the University was rated Ofsted Outstanding for its Primary Partnership programme. The report said: “The extremely strong relationship between the university and its partner schools ensures that there is a shared vision for future developments.”"}],"createdAt":"2021-07-06T17:55:29.934Z","updatedAt":"2021-07-07T19:06:17.550Z"}
