{"id":"bc521f39-a325-4273-9604-4d07338970be","name":"Inspiration Teacher Training","code":"2H7","type":"scitt","isAccreditedBody":true,"ukprn":"10060032","address":{"addressLine1":"Inspiration Teaching School Hub","addressLine2":"256 Hall Road","town":"Norwich","county":"Norfolk","postcode":"NR1 2PW"},"contact":{"website":"https://www.inspirationtrust.org/33/teacher-training-with-inspiration","email":"teaching@inspirationtrust.org","telephone":"01603 733446","fullName":"Bethan Whitbread"},"location":{"latitude":52.6094049,"longitude":1.2897355},"trainWithUs":"Inspiration Teacher Training has been born out of the Inspiration Trust, one of the country's most influential and dynamic academy groups. Formed in 2012, the trust has been at the forefront of radical new approaches to improve education. It has built up an impressive track record in improving existing schools and launching high-quality new provision.\nOur Teaching School Hub is in Norwich and our placement schools are in East Anglia. East Anglia is a fantastic place to live and work, with unspoilt countryside, vibrant communities, and easy access to London.\nWe think that what makes you special is your knowledge of, and passion for, the subject you teach. We want to help you share this knowledge and passion with children. One of the most exciting things about training as a teacher is the need to broaden your knowledge - there is always something more to learn! This is a philosophy that runs to the core of our training programmes. As a trainee with Inspiration Teacher Training, you will have a unique, tailored, and special journey through your training year. We have recruited a central team of subject specialist leads with exceptional reputations in their fields who will be leading your programme.\nWe guarantee that your mentor will be a subject specialist who has read the same course materials that you have. You will have allocated time every week with your mentor focused on discussing readings, setting targets, and reviewing your progress.","trainWithDisability":"We do not discriminate against trainees on the basis of age; race; sex; disability; sexual orientation; gender reassignment; marriage and civil partnership; pregnancy and maternity; religion, faith or belief. (Equality Act 2010 protected characteristics). The principles of non-discrimination and equality of opportunity also apply to the way in which staff and Governors\ntreat visitors, volunteers, contractors and former staff members.\n\nIf you are disabled or become disabled, we encourage you to tell us about your condition so that we can support you as appropriate. Please be aware that such information will be treated confidentially but on the basis of need as some staff will need to know in order for them to provide support. If you experience difficulties during your training, reasonable adjustments can be made to help overcome or minimise the difficulty. We may wish to consult with you and your medical adviser(s) about possible adjustments, Occupational Health will be arranged as appropriate to give advice on reasonable adjustments. We will consider the matter carefully and try to accommodate your needs. If we consider a particular adjustment would not be reasonable we will explain our reasons and try to find an alternative solution where possible.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:55:53.133Z","updatedAt":"2021-10-04T19:32:44.042Z"}
