{"id":"bd30bad3-f7a2-4ed2-9cb0-5e103d9806e5","name":"Co-op Academies Trust School Direct - Primary","code":"27V","type":"lead_school","isAccreditedBody":false,"address":{"addressLine1":"9 Stanley Road","town":"Leeds","county":"West Yorkshire","postcode":"LS9 7AX"},"contact":{"website":"https://www.coopacademies.co.uk/colleagues/get-into-teaching/","email":"schooldirect@oakwood.coop","telephone":"0113 2359164","fullName":"Rebecca Ingram"},"location":{"latitude":53.80819,"longitude":-1.515739},"trainWithUs":"The Co-operative Academies Trust, acting as the sponsor, has a strong moral purpose and is responsible for twenty five academies all of which are committed to the co-operative values and principles. The Trust expects all of its academies to have these core values at the centre of their work, working together to achieve the best personal and educational outcomes for the children and young people in the communities in the North of England where they have presence, in particular Leeds. The Trust has a strategic objective to make their academies the first choice for young people, parents and carers in the community, and to be acknowledged as a high-quality provider of education for children and young people in some of the most disadvantaged communities in the north of England. It anticipates that staff will be supported and encouraged to progress up the career ladder ‘within the Trust and beyond’ providing a secure starting point for trainees and newly qualified teachers.\nAll partner schools are situated in a close geographical area of significant social and economic need, serving a diverse multicultural community. The Trust is committed to developing a programme of training and development that will support the recruitment of high quality teachers and future leaders to help serve the needs of the Trust schools. “The Trust works very effectively with the academy. It has offered high-quality training, support and helpful advice that has led to improvements in the quality of leadership and teaching across the academy” (Woodlands OfSTED report)","trainWithDisability":"Cooperative Academies Trust Schools are inclusive of a range of disabilities. Most of our schools are all on one level providing good access with one school having a lift. We will accommodate the individual needs of each student working with Leeds Trinity and our schools to ensure you can access the course and placements successfully.","accreditedBodies":[],"createdAt":"2021-07-06T17:46:24.173Z","updatedAt":"2022-01-28T19:09:02.693Z"}