{"id":"bd7507b5-fbd7-425d-bea0-0be02a292a19","name":"Waldegrave Training Alliance","code":"1FP","type":"lead_school","isAccreditedBody":false,"urn":"138461","ukprn":"10037849","address":{"addressLine1":"Waldegrave School","addressLine2":"Fifth Cross Road","town":"Twickenham","county":"Middlesex","postcode":"TW2 5LH"},"contact":{"website":"http://www.waldegrave.richmond.sch.uk","email":"wta@waldegravesch.org","telephone":"2088943244","fullName":"Head of Teaching School"},"location":{"latitude":51.4389119,"longitude":-0.3516216},"trainWithUs":"All Richmond upon Thames borough schools and the Waldegrave Training Alliance (WTA) are great places to Train to Teach. If you apply to WTA we will provide you with a supportive and tailored learning opportunity in partnership with Roehampton and St Mary's Universities and our alliance schools. Our vision for WTA is that staff and students feel valued and enjoy teaching and learning in schools across the borough of Richmond upon Thames. We are very proud of the partnerships we have with all schools in the borough, including our long established secondary schools to the newer free and faith schools.\nWaldegrave Training Alliance is led by Waldegrave School, an 11-16 Girls school with a co-educational Sixth Form. OFSTED reported us as an outstanding school in 2017. Waldegrave was awarded comprehensive school of the year in 2016 by the Sunday Times. Prior to that we were in the top 11-16 schools in the country in the Sunday Times Parent Power tables. Our results show that we are in the top 10% of schools nationally each year.\nWe work closely with all our alliance schools to provide the best placements in fantastic departments with excellent outcomes for students. Schools Direct trainees will have access to great subject specialists and dedicated mentors as well as a full training programme through our universities and partnership schools. Our trainees will benefit from placements in contrasting schools across the borough including single sex, co-educational (boys and girls), faith and free schools.","trainWithDisability":"Waldegrave Training Alliance welcomes applications from candidates with disabilities or additional needs. Applicants who would benefit from disabled access should let us know on their application so they can be considered for placement at appropriate schools.\nAccessibility varies between schools and locations and WTA will seek to facilitate placements at appropriate settings where they are available.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:48:03.876Z","updatedAt":"2021-10-12T22:32:48.404Z"}
