{"id":"be4c78ed-a87b-48af-a907-3de8e397c058","name":"Dartford Grammar School","code":"29N","type":"lead_school","isAccreditedBody":false,"urn":"136359","ukprn":"10032228","address":{"addressLine1":"Dartford Grammar School","addressLine2":"West Hill","town":"Dartford","county":"Kent","postcode":"DA1 2HW"},"contact":{"website":"http://www.dartfordgrammarschool.org.uk/","email":"nkemp@dartfordgrammarschool.org.uk","telephone":"01322 223039","fullName":"John Fitzpatrick"},"location":{"latitude":51.4442133,"longitude":0.2050778},"trainWithUs":"Dartford Grammar School (DGS) is a vibrant Lead School which works collaboratively to enable schools in the community to recruit quality teachers. DGS and our partner schools have been working in partnership with Kent and Medway Training (KMT) for many years to ensure that we meet the needs of schools in our community. We provide excellent-quality teacher training to ensure our pupils are taught by the best educators. This partnership has helped to nurture huge numbers of successful teachers, many of whom are now progressing into school management.\nDGS as a Lead School is recruiting on behalf of a variety of secondary schools and primary schools and is growing. This variety of settings provides our trainees with opportunities to work in different educational environments. With KMT, you have a Home school where you will be working for most of the year; however, you are also provided with a contrasting placement to allow you to widen your experience and develop your teaching skills in a variety of school contexts.\nWe welcome candidates from a variety of backgrounds who are dedicated people and wish to become inspirational classroom teachers. The training is delivered by a team of experienced practitioners. There are several layers of support available within KMT and schools. The combination of high quality support and training justifies the excellent success rates in both passing the course and gaining employment.","trainWithDisability":"As an inclusive partnership, we welcome candidates with disabilities and other additional needs. If you are keen to teach, we will find a way to ensure that your requirements can be accommodated.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"757d0dca-c7a9-43c8-8c3b-96c0a81539b6","code":"K30","name":"Kent and Medway Training","description":"Kent and Medway Training (KMT) is a highly regarded and successful Schools Centred Initial Teacher Training Provider (SCITT) which has been successfully training teachers for over 25 years. With School Direct our reputation has seen us grow tremendously KMT offer training which leads to Qualified Teacher Status (QTS) and our partnership arrangement with The University of Leeds Beckett gives our trainees the opportunity to access a PGCE Top-Up qualification while they train or in the first two years of teaching. This offers Masters Level credits."}],"createdAt":"2021-07-06T17:53:49.218Z","updatedAt":"2021-08-30T16:37:46.592Z"}
