{"id":"be65f25b-9dac-4884-81dc-25b139351319","name":"Inspire Multi Academy Trust Teaching Alliance","code":"2JG","type":"lead_school","isAccreditedBody":false,"urn":"142996","ukprn":"10057110","address":{"addressLine1":"Burnside Estate","town":"Houghton le Spring","county":"Tyne and Wear","postcode":"DH4 5HB"},"contact":{"website":"http://www.burnsideacademy.co.uk/","email":"leona.kelly@inspiremultiacademytrust.co.uk","telephone":"1915120466","fullName":"Leona Kelly"},"location":{"latitude":54.8465385,"longitude":-1.4797637},"trainWithUs":"Inspire Multi Academy Trust is a unique group of five primary schools located in Sunderland. Our vision is to create a family of outstanding schools with clear purpose, direction and objectives. The major aim of each school is to create and foster a culture of high aspiration to enable and empower pupils to achieve to the highest levels regardless of their social or economic background. These outcomes are achieved by high quality teaching which is responsive in meeting the individual needs of our children.\nOur School Direct Programme can offer you:\n* highly skilled and motivated mentors able to address your developmental needs\n* contrasting placements across the Trust allowing a breadth and variety of teaching experiences\n* a training plan tailored to your needs which is fluid throughout the year\nBurnside Academy is the Lead School for the Alliance working in conjunction with Sunderland University.","trainWithDisability":"We follow the University of Sunderland Diversity Statement:\n“We celebrate and value the diversity of all students and staff, working to ensure that all are welcome in our community and do not face discrimination or encounter barriers with regard to their disability. “\nThe University of Sunderland Disability Support Team provides advice, information and guidance to students with a disability; students with mental illness or mental health difficulties; students with Specific Learning Difficulty (SpLD) such as dyslexia. On application please contact the Disability Support Team for disability-related queries:\nWebsite: Disability Services Email: disability.support@sunderland.ac.uk\nTel: 0191 515 2952","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:56:56.095Z","updatedAt":"2021-10-04T18:19:57.059Z"}
