{"id":"be910803-8849-4a51-8edb-9437052c53c9","name":"The Rutland and District School Federation","code":"1F1","type":"lead_school","isAccreditedBody":false,"urn":"136530","ukprn":"10033296","address":{"addressLine1":"RDSF","addressLine2":"Catmose College, Huntsmans Drive","town":"Oakham","county":"Rutland","postcode":"LE15 6RP"},"contact":{"website":"http://www.rutlandfederation.com/school-direct/","email":"kbarrett@catmosecollege.com","telephone":"1572770066","fullName":"Laura Hollick"},"location":{"latitude":52.673828,"longitude":-0.7418041},"trainWithUs":"The Rutland and District Schools’ Federation are delighted to announce School Direct training opportunities in partnership with Nottingham Trent University.\n\nThe School Direct Training Programme is school-led initial teacher training, offering a training route to achieving qualified teacher status (QTS).\n\nDuring the Secondary School Direct year, trainees will gain experience in Key Stages: 3 (years 7-9), 4 (years 10-11), and 5 (Years 12-13). It is a requirement to have taught a minimum of two key stages in your training year.\n\nA requirement of the course is that trainees complete two days in a primary school. This provides an invaluable insight into the importance of transition from primary to secondary. Trainees will be allocated a tutor group to gain an understanding of the importance of the pastoral role in education.\n\nThe year is designed to help trainees build up to the equivalent teaching requirements of an Early Career Teacher (ECT). Trainees will have a mentor in both a base school and second placement. The mentor is there for day-to-day support, help with planning and suggestions for university tasks, and will conduct regular observations and provide structured feedback. Trainees will have a University Link Tutor who will conduct visits during the year and provide feedback and support. \n\nOver the last 5 years, 100% of Rutland Teaching Alliance trainees* have been in employment contracts as NQTs by the end of the course . 98% of trainees starting the course gained QTS in the last 3 years (National 90%).\n \n* those actively seeking employment","trainWithDisability":"The Rutland and District Schools' Federation are committed to promoting equality and diversity, providing an inclusive and supportive environment for all. Together with Nottingham Trent University, we will:\n* ensure that people are treated solely on the basis of their abilities and potential, regardless of race, religion or belief, age, gender reassignment, marital status or civil partnership, sexual orientation, disability, pregnancy or maternity, sex or any other inappropriate distinction;\n* promote diversity and equality for all staff and value the contributions made by individuals and groups of people from diverse cultural, ethnic, socio-economic and distinctive backgrounds;\n* promote and sustain an inclusive and supportive study and work environment which affirms the equal and fair treatment of individuals in fulfilling their potential and does not afford unfair privilege to any individual or group.\nIf you have any specific questions, please contact the [Rutland Teaching Alliance](https://www.rutlandta.com/contact-us/) or visit the [Nottingham Trent University support page](https://www.ntu.ac.uk/life-at-ntu/support).","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:55:14.346Z","updatedAt":"2021-09-29T20:21:22.554Z"}
