{"id":"bed96ffb-ddf2-4d78-a6cf-13b533b714df","name":"Hull SCITT","code":"25O","type":"scitt","isAccreditedBody":true,"ukprn":"10055359","address":{"addressLine1":"Hull SCITT","addressLine2":"Dorchester Primary School","town":"Dorchester Road","county":"Hull","postcode":"HU7 6AH"},"contact":{"website":"http://www.hullscitt.com","email":"training@hullscitt.com","telephone":"01482 308650","fullName":"Training"},"location":{"latitude":53.7805228,"longitude":-0.318031},"trainWithUs":"Hull SCITT (School Centred Initial Teacher Training) works passionately to train the best teachers for Hull and beyond. The clue is in the title ‘School Centred’; our trainees are in school on day one learning and developing alongside our experienced mentors and school based coordinators. School based provision is supported by core training delivered by Specialist Leaders of Education (SLEs). “Centre-based training draws effectively on the expertise of SLEs from partnership schools, ensuring that it reflects current educational thinking” Ofsted 2017\nWhen asked to identify the most beneficial aspects of our programmes previous trainees frequently refer to our “hands on approach”. We deliver a personalised programme that builds upon trainee’s previous experience, strengths and learning styles. We carefully select and match trainees to the school and mentors with whom they will be working. “Leaders are determined to put trainees first to ensure that they have a successful start to their teaching career” Ofsted 2017 Employment rates for the last 2 years have ben 100%, teachers trained by Hull SCITT are sought-after by employing head teachers. The nature of our programme ensures a smooth transition into the teaching profession. Our partnership with Hull Collaborative Teaching School and the University of Hull further support ongoing professional development. “Head teachers are delighted that NQTs (Newly Qualified Teachers) ‘hit the ground running’ and commented that graduates of the SCITT need little support in their transition to employment because of the breadth of their training” Ofsted 2017","trainWithDisability":"We work closely with our Occupational Health partners to ensure support is put into place as needed.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:56:14.516Z","updatedAt":"2021-09-09T03:24:29.559Z"}
