{"id":"bf021103-5dc6-4332-b557-32d1c883d6e8","name":"Chorus Education Trust and Sheffield Teacher Training Alliance","code":"1N5","type":"lead_school","isAccreditedBody":false,"urn":"139167","ukprn":"10039996","address":{"addressLine1":"Sheffield Teacher Training Alliance, Silverdale School","addressLine2":"Bents Crescent","town":"Sheffield","county":"South Yorkshire","postcode":"S11 9QH"},"contact":{"website":"https://www.sheffieldtsa.org/","email":"enquiries@sheffieldtta.org","telephone":"1142357980","fullName":"Teaching School Director"},"location":{"latitude":53.3509698,"longitude":-1.5285331},"trainWithUs":"The Sheffield Teacher Training Alliance (STTA) is led by Silverdale Secondary School (rated 'Outstanding' by Ofsted) and is part of Chorus Education Trust. The alliance is part of the South Yorkshire Teaching Hub (SYTH) one of only 87 DfE designated national centres of excellence, supporting all schools and educational providers in the Sheffield and Rotherham area. Our 1-year School Direct courses run from September 2022 and provide comprehensive Initial Teacher Training. Places are available in an excellent and varied network of 70+ schools across Sheffield and the Peak District. The schools who are partnered with the Alliance offer high quality training for trainees who wish to train to teach in Primary or Secondary Phases and we also support colleagues wishing to work in special schools. As a well-established Teaching Hub, we have a strong track record of supporting our trainees through their course, into their first jobs and beyond. Now, as the training arm of the SYTH, we continue to offer professional development, advice and support throughout their career. Our destination data is very positive with between 80-100% securing their first teaching post during or shortly after completion of the course. Find out more at www.sheffieldtsa.org","trainWithDisability":"As a training provider we will do everything we can to meet your needs. We work in full partnership with Sheffield Hallam University or The University of Sheffield where you are a fully enrolled student with access to all of their facilities. If you have a disability, including long term medical conditions, specific learning difficulties (such as dyslexia, dyspraxia and A(D)HD) and mental health conditions, you can access additional support for your academic studies with the university. As a student with Sheffield Hallam University you will have access to an on-site assessment Centre, the Sheffield Regional Assessment Centre, where a range of disability specialists can carry out Study Needs Assessments, they also run daily drop in sessions - no appointment needed. Further information can be found [here](https://www.shu.ac.uk/current-students/student-support/disability-support)\nAs a student at The University of Sheffield you will have full access to support if you have a disability or additional needs. Full information is available [here](https://www.sheffield.ac.uk/ssid/disability/index)\nAdditionally, we work closely with all our school partners to ensure that your needs are met whilst on placement, offering support and adaptations where necessary.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:50:30.880Z","updatedAt":"2021-10-04T19:41:57.517Z"}
