{"id":"bf3e7945-a19a-4d47-9f51-1df9f5dc5d05","name":"Geoffrey Field Junior School","code":"1QL","type":"lead_school","isAccreditedBody":false,"urn":"109781","ukprn":"10079852","address":{"addressLine1":"Geoffrey Field Junior School","addressLine2":"Exbourne Road","town":"Reading","county":"Berkshire","postcode":"RG 2 8RH"},"contact":{"website":"https://www.geoffreyfieldjuniorschool.co.uk/","email":"eberry@geoffreyfield-jun.reading.sch.uk","telephone":"0118 9375475","fullName":"Charlie Clare"},"location":{"latitude":51.4219373,"longitude":-0.961783},"trainWithUs":"Geoffrey Field Junior School has been a lead school for the School Direct programme since 2013. In this time we have successfully trained 6 excellent teachers for our own school. We have a long held partnership with the University of Reading through various other teaching programmes that we have worked with such as PGCE, BAed and the School Direct predecessor the GTP course. We are very proud to provide the School Direct course as we believe that it provides the right balance between classroom based experience and the theory and subject knowledge teaching provided by our esteemed colleagues at The University of Reading. As a lead school our role is to recruit schools and trainees to the programme and to then support both through the training year. As a lead school we also run an additional CPD (continued professional development) programme for the trainees in ours and another School Direct group. This training programme has been designed and reconfigured every year to suit the needs of the trainees and to compliment and support the central training provided by The University of Reading. Sessions take place at the lead school and are full of practical ideas that can be taken back to the classroom. It is also an opportunity to meet other trainees, share and discuss practice as well as the highs and lows of life as a trainee teacher!","trainWithDisability":"As a fully inclusive school we are able to support pupils and staff members with disabilities and additional needs. Our school has some facilities for disabled people and we are happy to discuss how we can support any other additional needs.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"6439adcc-af64-4d3d-a1da-de045755db06","code":"R12","name":"University of Reading","description":"We are very proud to work alongside The University of Reading to train excellent teachers in school. They play a vital role in the support of the trainee as well as providing excellent tailored training to our trainee teachers. Your university based central training will take place over blocked weeks and on a Friday during the first term. This is where you will learn about professional values, teaching theory and the subject knowledge of the curriculum that you will be teaching."}],"createdAt":"2021-07-06T17:46:29.652Z","updatedAt":"2021-11-23T05:03:52.216Z"}
