{"id":"bf7c5b93-5368-4baa-9514-cb500cccc68c","name":"Hereteach Alliance","code":"22V","type":"lead_school","isAccreditedBody":false,"urn":"143929","ukprn":"10062355","address":{"addressLine1":"Hereford Sixth Form College","addressLine2":"Folly Lane","town":"Hereford","county":"Herefordshire","postcode":"HR1 1LU"},"contact":{"website":"www.hereford.ac.uk/the-college/hereteach-schools-direct","email":"hereteachITT@hereford.ac.uk","telephone":"1432355166","fullName":"Kate Mayglothling"},"location":{"latitude":52.0622748,"longitude":-2.699173},"trainWithUs":"Hereteach Initial Teacher Training Alliance is a partnership of secondary schools and post 16 institutions in Herefordshire. Hereford Sixth Form College and delivery partner St Mary's Roman Catholic High School (both of whom have been rated \"Outstanding\" by OFSTED), work alongside our accrediting Higher Education Institute, Worcester University. You will have two placements, usually in two local schools: we do our best to take into account travel and match you up with the right school for you. Our core partnership schools are Bishop of Hereford’s Bluecoat School, Earl Mortimer College, Fairfield High School, Hereford Sixth Form College, John Kyrle High School and Sixth Form Centre, Kingstone High School, Lady Hawkins’ School, Newent Community School and Sixth Form Centre, St Mary's RC High School, The Hereford Academy, The Hereford Cathedral School, The Steiner Academy, Weobley High School, Westfield School (Special School), Whitecross Hereford High School and Specialist Sports College, and Wigmore High School.\nOur School Direct Programme leads to a PGCE with QTS. Once recruited, trainees will work both collaboratively and independently and there is a strong focus on individual support. Trainees engage with their school from the beginning of September, developing relevant professional skills from the wealth of experience that exists within the schools and the University. Trainees can access experience in post 16 and special school establishments as part of their training.\nExpectations are very high and the learning environment is fun, yet challenging. High quality one-to-one guidance and support will be available for trainees to become exceptional teachers.","trainWithDisability":"Hereteach is committed to advancing equality and celebrating diversity, so we can talk about your specific needs at any time before and during the course. Careful consideration is given to specific disabilities and other protected characteristics, in line with the Equality Act. Hereteach Alliance follows Hereford Sixth Form College's Equality, Diversity and Inclusion Policy and Accessibility Plan.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"62d5803b-89ca-4e21-bb6f-5c74944c56ad","code":"B25","name":"Birmingham City University","description":""},{"id":"6019b3ce-f2f6-4b0e-b2a9-5813d74c4d54","code":"W80","name":"University of Worcester","description":"The University of Worcester is one of the country’s major providers of education, training and research for the children’s workforce.\\r\\n\\r\\nFounded in 1946 as a teacher training college, the University of Worcester has been training inspirational teachers for over 70 years. The School of Education has built on this legacy to develop a reputation for the highest quality provision, partnership working and delivery."}],"createdAt":"2021-07-06T17:52:12.869Z","updatedAt":"2022-01-04T20:27:57.192Z"}
