{"id":"bf87ad55-6567-4202-81ff-68267b401d20","name":"Hillingdon Primary School (The Elliot Foundation Teaching School)","code":"3E7","type":"lead_school","isAccreditedBody":false,"address":{"addressLine1":"Hillingdon Primary School","town":"Uxbridge","county":"Middlesex","postcode":"UB10 0PH"},"contact":{"website":"http://www.hillingdon.hillingdon.sch.uk/page/?title=Initial+Teacher+Training+%2D+Trainees&pid=177","email":"clerk@hillingdonprimaryschool.org.uk","telephone":"01895 590087","fullName":"Louise Clerk"},"location":{"latitude":51.5314815,"longitude":-0.4506551},"trainWithUs":"Hillingdon Primary School is an outstanding academy in the London Borough of Hillingdon. The school was accredited as a Teaching School in 2017 and has been successfully supporting trainee teachers to be outstanding, passionate practitioners ever since. Our school motto is Learning and Achieving Together: we apply this not only to our students, but all of the adults we work with. We understand that teachers are always learning, just as children do, and are proud to provide opportunities for professional development to teachers at all stages in their career, from those just starting out on their teaching journey to those looking to take on senior leadership posts. We are a Lead School for Hillingdon SCITT, an Ofsted Outstanding Provider in all categories for teacher training, and recruit trainees for carefully selected primary partner schools throughout Hillingdon and neighbouring London Boroughs, including community schools, academies and faith schools. We work closely with Hillingdon SCITT to ensure that our trainees feel supported and valued from day one. Your wellbeing is important to us: we care that you have a good work-life balance as we understand that this is when teachers perform at their best and children benefit the most. Visit our website to learn more, or alternatively drop us an email if you have a specific question: we are always happy to hear from potential teachers and will do our best to help.","trainWithDisability":"Hillingdon Primary School is an inclusive school, committed to supporting trainees with disabilities and other needs. Please let us and Hillingdon SCITT know if you would like us to make any adjustments to support you during the application, interview process and throughout your programme.","accreditedBodies":[],"createdAt":"2021-07-06T17:48:17.701Z","updatedAt":"2021-11-04T22:33:25.008Z"}