{"id":"bf8e02bc-30d4-4795-89cc-81414fafc908","name":"Achieve with TELA","code":"1R3","type":"lead_school","isAccreditedBody":false,"urn":"138527","ukprn":"10038162","address":{"addressLine1":"Station Road","addressLine2":"Broughton Astley","town":"Leicester","county":"Leicestershire","postcode":"LE9 6PT"},"contact":{"website":"www.telaonline.co.uk","email":"tela@thomasestley.org.uk","telephone":"01455 283 263 ext 3206","fullName":"Jo Robotham"},"location":{"latitude":52.5298145,"longitude":-1.2225208},"trainWithUs":"Achieve with TELA school provides school based initial teacher training in primary and secondary education. We are an established programme with a successful track record of recruiting the best and providing a high-quality experience. Our ethos is to train, employ and grow our own teachers and future leaders in Leicestershire and surrounding areas.\n“The experience and opportunities you will receive are invaluable” English Trainee\nYou will learn from practicing teachers and university specialists. You will develop your knowledge of how academic theory underpins your classroom practice. Our course structures cover the areas you need to feel completely prepared to enter your early career teacher classroom. “The training sessions were relevant and pragmatic. As well as the content it was always great to meet up with other Achieve trainees” Science Trainee\nWe work with a community of local schools and many of our graduates find employment within our alliance. Our school based provision includes high quality teaching placements with experienced, supportive mentors in schools. “A very supportive alliance. Talented staff with a passion to teach people how to teach” Drama Trainee\nOur course partners include the Leicestershire SCITT, University of Leicester and Warwick University. All courses lead to Qualified Teacher Status (QTS), Post Graduate Certificate in Education (PGCE) and Masters Credits.\n“Getting to experience a number of different schools during training was incredibly worthwhile “ Math's Trainee\nChildren and young adults are at the heart of everything we do, - Achieve with TELA are with you every step of the way.","trainWithDisability":"We are happy to receive applications from candidates with disabilities and other needs. Reasonable adjustments will be made to accommodate the candidates needs across the alliance.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:48:19.680Z","updatedAt":"2021-09-14T15:10:21.485Z"}
