{"id":"bffddf6a-937a-439e-9d24-f0c1bd63d290","name":"West Midlands Consortium","code":"W53","type":"scitt","isAccreditedBody":true,"ukprn":"10006894","address":{"addressLine1":"Thomas Telford School (Lead School)","addressLine2":"Old Park","town":"Telford","county":"Shropshire","postcode":"TF3 4NW"},"contact":{"website":"https://wmc.ttsonline.net/","email":"ssplant@ttsonline.net","telephone":"01952 200000","fullName":"PGCE Course Administrator"},"location":{"latitude":52.6777801,"longitude":-2.4583959},"trainWithUs":"“It has been an absolute pleasure to be a WMC student. The support right from the word go has been relentless and confirmed why I wanted to train through WMC. I have truly been a part of a family and I am sad to go. However, I go knowing that I have been provided with high quality training that is reflected in my standard of teaching. I feel privileged to have been trained by WMC.” WMC Associate Teacher\nWest Midlands Consortium has effectively and successfully led and managed School Centred Initial Teacher Training Courses (SCITT) for over 20 years. We are a well-established leading provider for teacher training based at Thomas Telford School, the top performing non-selective comprehensive in England. Our wide range of primary and secondary training courses are highly effective in nurturing the talents of future generations of outstanding teachers and we have a proven track record of high employment, retention and career progression. We strongly believe in fostering reflective, forward-thinking self-assured practioners who are confident in questioning and rationalising their progress and impact.\nWe pride ourselves on being a small provider with a big reputation. As a West Midlands Consortium Associate Teacher, you will be more than just a number – you will be a member of a select team. You will receive fantastic individualised support from your Course Leader and Mentor and have access to expert advice and guidance from members of the WMC Team and from within our extensive range of Consortium partner schools.","trainWithDisability":"If you have a disability or other specific need, please contact the WMC Administrator to discuss how we are best able to support with your particular individual requirements. For more detailed information, please see our Diversity and Equal Opportunities Policy which can be found on the WMC website.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:51:54.969Z","updatedAt":"2021-07-08T18:07:25.509Z"}
