{"id":"c0a0becb-89dd-4f19-b72b-3bac4db1e876","name":"Futures Teaching","code":"2KR","type":"lead_school","isAccreditedBody":false,"urn":"140248","ukprn":"10043454","address":{"addressLine1":"President Kennedy School","addressLine2":"Rookery Lane","town":"Coventry","county":"West Midlands","postcode":"CV6 4GL"},"contact":{"website":"http://www.futuresteachingalliance.co.uk","email":"admin@futuresteachingalliance.org.uk","telephone":"2476661416","fullName":"Admissions"},"location":{"latitude":52.4497135,"longitude":-1.5206725},"trainWithUs":"The Futures Teaching is committed to recruiting and training outstanding, enthusiastic individuals, passionate about becoming exceptional teachers. With our partner schools we cover a wide area of the West Midlands including Coventry, Hinckley, Leamington Spa, Warwick, Rugby and South Warwickshire. This geographical diversity provides opportunity for trainees to experience teaching in a wide variety of settings.\nWithin the Alliance there are a range of schools in diverse contexts, including OFSTED 'Outstanding Providers', a 'World Class School' and another awarded 'Transforming' status by the SSAT within the Framework for Exceptional Education. Futures Teaching seeks to 'Build Brighter Futures Together'. Our values are based on the core principles of 'Students First; No Barriers; It's About Learning'. Our ITT Director, Aidan Jenkins, was awarded an Honorary Fellowship within the Centre for Teacher Education at Warwick in recognition of his outstanding partnership work over a number of years.\nDuring your training you will have specialist help from our Professional and Subject Mentors and develop your practical skills in the classroom, whilst gaining a theoretical understanding of teaching and learning. There will also be a complementary placement in another of our alliance schools.\nOn finishing your training you will be awarded Qualified Teacher Status (QTS). You will also be awarded a Postgraduate Certificate in Education and 90 or 60 Masters credits, depending on which university you choose as your accredited body. Please visit our website: [FUTURESTEACHINGALLIANCE.CO.UK](https://www.futuresteachingalliance.co.uk) By applying to FTA you consent to us sharing your data with interested schools within our alliance.","trainWithDisability":"We encourage applications across the community regardless of race, age, disability, religion and gender.\nWe support trainees with a wide variety of needs both during centre-based training and on school placements. The programme is devised and personalised to be supportive to each trainee. We work closely with our universities (our PGCE validating bodies) to ensure trainee needs are met.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"4aa8177a-27b8-4566-b77a-c45515e46739","code":"N36","name":"Newman University","description":"Newman’s Primary and Secondary PGCE courses offer you strong partnerships with Futures Teaching schools in the West Midlands and South Warwickshire. You will be taught by qualified practitioners who are able to link different perspectives of primary and secondary teaching to the development of your practical skills in the classroom.\\r\\n\\r\\nAll PGCE routes at Newman will provide two opportunities, either:\\r\\n\\r\\n*A Professional Graduate Certificate of Education which will prepare \\r\\n applicants for teaching and offers full QTS, or\\r\\n*A Postgraduate Certificate of Education which will include 60 credits at \\r\\n Masters level and full QTS."},{"id":"ef09ce50-ccfc-4346-a0ce-43e840153dab","code":"W20","name":"University of Warwick","description":"Futures Teaching and The University of Warwick have a long and successful partnership in primary and secondary teacher training. The University offers a mixture of academic and practical learning. \\r\\n\\r\\nOn the course you will develop a secure subject knowledge base, and the ability to plan and teach so that all pupils learn and make good progress. You will also learn how to assess and evaluate learning and develop your teaching to ensure progress for all pupils.\\r\\n\\r\\nAll our courses, when successfully completed, lead to a Postgraduate Certificate in Education (PGCE) with 90 Level 7 (Masters) credits, and Qualified Teacher Status."},{"id":"3e6c62a3-5d34-4a91-9c23-01c7409fd909","code":"L34","name":"University of Leicester","description":"The University of Leicester has a long and proud history of training outstanding primary and secondary school teachers with excellent employment prospects\\r\\n\\r\\nWith great opportunities for career progression and the chance to make a real difference to children’s lives, becoming a teacher can be wonderfully rewarding - indeed, some say it’s the best job in the world.\\r\\n\\r\\nAll our courses, when successfully completed, lead to a Postgraduate Certificate in Education (PGCE) with 90 Level 7 (Masters) credits, and Qualified Teacher Status."},{"id":"6019b3ce-f2f6-4b0e-b2a9-5813d74c4d54","code":"W80","name":"University of Worcester","description":"Worcester is a campus-based university with plentiful student parking and on-site accommodation. This allows you to safely and conveniently access the world class facilities.\\r\\n\\r\\nWorcester itself is a beautiful, safe, university city within easy reach of Birmingham. It’s the perfect place to gain a teaching qualification and take your career further.\\r\\n\\r\\nWhichever age group and training route you choose, all our courses result in the award of qualified teacher status."}],"createdAt":"2021-07-06T17:51:57.376Z","updatedAt":"2021-10-13T15:55:31.803Z"}
