{"id":"c0cf97e1-5edc-4fba-8e9f-a97f674d5899","name":"St Polycarp’s Educational Partnership","code":"2EG","type":"lead_school","isAccreditedBody":false,"urn":"147429","ukprn":"10084196","address":{"addressLine1":"St Polycarp’s Educational Partnership","addressLine2":"Waverley Lane","town":"Farnham","county":"Surrey","postcode":"GU9 8BQ"},"contact":{"website":"http://www.stpolycarps.surrey.sch.uk/Train-to-Teach/","email":"traintoteach@stpolycarps.surrey.sch.uk","telephone":"01252 716307","fullName":"Ann Gunn"},"location":{"latitude":51.211091,"longitude":-0.7881955},"trainWithUs":"Welcome to the St Polycarp’s Educational Partnership, a unique and nurturing partnership of schools in Surrey and Hampshire whose aim is to support aspiring teachers into the rewarding career of teaching. We are very proud to have a proven history of high quality teacher training which prioritises the needs of the learner. Supported by a range of inspiring and committed teachers within our schools, many of whom are specialist leaders in their subject areas. Once you start your journey with us, you will become part of this experienced, motivated team, working together in a friendly environment to make you feel supported every step of the way. We work with Reading University to offer you a choice of courses that suit the individual needs of each applicant. Please see the enclosed information and timetables to enable you to make an informed choice. This is a personalised programme which allows you to receive invaluable training in at least two of our partnership schools. If you are considering a career in teaching and value every child's learning to be at the centre of this decision then St Polycarp’s is the right place for you. Applications codes are:\nSt Polycarp's: 2EG\nReading 3CHN PGCE, QTS only 3D28 and salaried route 3DZX\nPlease note that salaried funding has been withdrawn so these places are very limited and open to the strongest of candidates. Please contact Charlotte Carr on traintoteach@stpolycarps.surrey.sch.uk if you have any questions.","trainWithDisability":"Both Reading University and St Polycarp's Educational Partnership support all candidates with a willingness to learn and support the needs of children. The courses are personalised in approach and able to provide the reasonable adjustments required for candidates with disabilities and other needs. Reading university has a student services facility available with the knowledge and support required to assist any candidates who may require additional help.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:52:24.837Z","updatedAt":"2021-10-02T00:01:44.381Z"}
