{"id":"c0eea843-9328-4ac7-a441-56564fb379a0","name":"Redriff Primary School","code":"1U2","type":"lead_school","isAccreditedBody":false,"urn":"137648","ukprn":"10034551","address":{"addressLine1":"Redriff Primary School","addressLine2":"Salter Road","town":"Rotherhithe","county":"London","postcode":"SE16 5LQ"},"contact":{"website":"http://www.redriff.southwark.sch.uk/","email":"schooldirect@redriff.co.uk","telephone":"0207 237 4272","fullName":"Chris Miller"},"location":{"latitude":51.5016432,"longitude":-0.0368417},"trainWithUs":"Redriff is a dynamic, vibrant and friendly school in a diverse and multicultural area. In 2011, OFSTED recognised the school as being an 'outstanding’ school. We are looking for trainee teachers with passion and determination, who love working with children to join our team of dedicated staff. Redriff provides an excellent training programme for the students on the schools direct course. We help with their professional development as well as their knowledge of primary education. Our welcoming, friendly staff are committed to supporting students in their training year and we have a wealth of expertise working within the school, to gain advice and support from. We are a two-form entry school with positive, happy children, hardworking staff and supportive parents and governors. We are a fully inclusive school and have a resource base, The Boathouse, for children with autism. Redriff has been a training school for a number of years and has trained many students successfully through the Schools Direct Programme. We ensure that we personalise the programme for each individual who trains with us to ensure they can become the best teacher they can be.\nIf you would like further information about the school, please visit our website:\nhttp://www.redriff.co.uk/","trainWithDisability":"The school is committed to equality and diversity in employment practice and service delivery.\nSchool Direct students are entitled to support from the UCL Student Support and Wellbeing (SSW) team.\nYou can find more information here:-\nhttps://www.ucl.ac.uk/students/disability-support","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:57:05.318Z","updatedAt":"2021-10-03T18:35:06.644Z"}
