{"id":"c22a7b3a-cd32-4364-a7f8-f95ce2f386a8","name":"Sidney Stringer Academy","code":"18K","type":"lead_school","isAccreditedBody":false,"urn":"136126","ukprn":"10030456","address":{"addressLine1":"Sidney Stringer Academy","addressLine2":"2 Primrose Hill Street","town":"Coventry","county":"West Midlands","postcode":"CV1 5LY"},"contact":{"website":"http://www.coventryscitt.org.uk/","email":"info@coventryscitt.org.uk","telephone":"2476251756","fullName":"Nuala Berry"},"location":{"latitude":52.412718,"longitude":-1.502854},"trainWithUs":"The Coventry SCITT is run by teachers and senior leaders in over 25 schools across Coventry. We opened in 2016 and are committed to the very best outcomes for trainees and pupils. The purpose of the Coventry SCITT is to train the very best teachers to improve life chances for Coventry pupils. Training with The Coventry SCITT is a great way to kick start your teaching career. From the start of the programme trainees are fully immersed into school life, building up their confidence and school contact time as they go on. We offer both primary and secondary training in a wide range of subjects.. We offer diverse teaching placements (including time in special schools), ensuring trainees have experience in different types of school environments, preparing you for when you complete the programme and begin your ECT year.\nThe bespoke high quality training is written and delivered by current practitioners. We know that learning how to teach does not just happen overnight, it takes time and support and that is what The Coventry SCITT will give to you. You can expect the following from The Coventry SCITT:\n•\tBy the end of the year you will have QTS and a PGCE with 60 master credits.\n•\tExcellent training venues and facilities, hosted by our partner schools where you can speak to other trainees, gain advice from mentors or simply plan your lessons.\n•\tWe are committed to providing many layers of support to ensure that you flourish.","trainWithDisability":"The Coventry SCITT is an inclusive teacher training programme and all schools are committed to providing bespoke training for any candidate including those with disabilities and other needs.\nInterviews are held in accessible locations and specific needs can be catered for during the interview process. Any candidate who requires additional time to complete any section of the interview is supported with this in advance.\nThe SCITT team provide excellent pastoral support to all trainees and tailored one to one support for any candidate or trainee with a disability or other need.\nThrough-out the course, if trainees require any additional support a plan is produced in consultation with all relevant parties, to ensure the trainee succeeds.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:55:59.787Z","updatedAt":"2021-07-22T20:22:07.055Z"}
