{"id":"c26b7b32-c2b7-47a3-a6bd-e64c4446f175","name":"North East Schools Teaching Alliance","code":"1ZA","type":"lead_school","isAccreditedBody":false,"urn":"138845","ukprn":"10039055","address":{"addressLine1":"Nunthorpe Academy","addressLine2":"Guisborough Road","town":"Nunthorpe","county":"Middlesbrough","postcode":"TS7 0LA"},"contact":{"website":"northeastschoolsteachingalliance","email":"nsmith@nunthorpe.co.uk","telephone":"01642 310561 ext. 1048","fullName":"Nicki Smith"},"location":{"latitude":54.527198,"longitude":-1.16955},"trainWithUs":"The North East Schools Teaching Alliance offers School Direct Primary and Secondary ITT places. The Secondary subjects include English, Maths, Physics, Chemistry, Biology, Geography, History, MFL (German, French, Spanish), Art and Design and Design Technology. We aim to recruit up to 20 trainees - 10 Primary and 10 Secondary. We work in partnership with Northumbria University and the course leads to QTS and PGCE qualifications.\nTrainees must have GCSEs at Grade C / Level 4 in English and Maths for Primary and Secondary teaching. Primary trainees also need Grade C / Level 4 in Science. Trainees also need an Honours degree preferably in the subject they wish to teach (if this is in the Secondary phase). If your degree is not in the subject you wish to teach you must have an A Level in that subject as a minimum qualification and complete an 8 week Subject Knowledge Enhancement course. 3rd class degrees are not acceptable.\nWe are a small provider who offer excellent support and guidance throughout the training year and beyond. We have an excellent record of trainees completing and passing the course and gaining NQT positions, often within the Alliance.\nIf you are interested in this course please contact Nicki Smith who will invite you into the Alliance base at Nunthorpe Academy for a chat about your next steps to becoming a qualified teacher.","trainWithDisability":"We would be delighted to consider applicants with disabilities and other needs. Please contact Nicki Smith nsmith@nunthorpe.co.uk if you wish to discuss this further.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"b384b008-59e2-461e-a15f-3551d1165c1e","code":"N77","name":"University of Northumbria at Newcastle","description":"Our accrediting body is Northumbria University who deliver some of the Friday training sessions. The majority of these will be conducted remotely with only a couple of sessions taking place at Northumbria University’s Coach Lane Campus. The University provide excellent training and support - they lead on the PGCSE element of the course which entails trainees completing 3 assignments. One is an essay, one a piece of action research written up as a Power Point presentation and one is a collection of evidence to show that the Teachers Standards have been met."}],"createdAt":"2021-07-06T17:47:11.128Z","updatedAt":"2021-11-23T18:30:43.322Z"}
