{"id":"c2a89d22-9561-4189-b62d-0cb88cc9cb9d","name":"Connect Teaching Partnership","code":"2K1","type":"lead_school","isAccreditedBody":false,"urn":"138611","ukprn":"10007146","address":{"addressLine1":"Crofton Infant School","addressLine2":"Towncourt Lane","town":"Petts Wood","county":"Kent","postcode":"BR5 1EL"},"contact":{"website":"www.connectschoolsacademytrust.com","email":"training@crofton-jun.bromley.sch.uk","telephone":"01689 821716","fullName":"Claire Ellis"},"location":{"latitude":51.3817087,"longitude":0.0797208},"trainWithUs":"Connect Teaching Partnership works with the University of Greenwich as the registered training provider for the School Direct Programme. The university has a long history of teacher training, going back over 100 years at the Avery Hill Campus. Employment rates are consistently above national and London averages. Training is delivered by highly effective teachers from both the Trust and also from the university. The training programme will be personalised to the individual's professional needs but will include training on the following areas: teaching and learning, curriculum, assessment, working with parents and the community. All training is closely aligned to support the trainee achieve the Teachers’ Standards. The schools in our partnership are all graded Good or Outstanding and offer trainees the chance to teach in a range of contrasting schools and locations. Both our School Direct courses are tailored to meet the needs of the trainee and the training and expertise available in our organisation allows trainees to develop their teaching to a high level.","trainWithDisability":"We welcome applications from disabled people and are committed to helping disabled students succeed. The University of Greenwich has a Disability and Dyslexia Centre which can provide assistance at any stage in your application process and at any point in your studies. Advice and guidance is based on your individual needs and long-term medical conditions.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:51:09.879Z","updatedAt":"2021-10-05T16:12:06.505Z"}
