{"id":"c39d03d3-577e-4f3d-a382-19eab99ba840","name":"Waterton Academy Trust","code":"2EL","type":"lead_school","isAccreditedBody":false,"urn":"141799","ukprn":"10060843","address":{"addressLine1":"Waterton Academy Trust Centre for Excellence","addressLine2":"The Grove","town":"Wakefield","county":"West Yorkshire","postcode":"WF2 6LD"},"contact":{"website":"http://www.watertonacademytrust.org","email":"ITT@watertonacademytrust.org","telephone":"01924 240767","fullName":"Glyn Bishop"},"location":{"latitude":53.6479935,"longitude":-1.4602977},"trainWithUs":"Waterton Academy Trust is made up of a dynamic group of Primary Schools in the Wakefield and Barnsley Districts. Within our schools we offer placements, training, support and further opportunities to develop the knowledge and skills to become great teachers. What Waterton can offer:\n* Proven track record of bringing teachers into the profession through high quality Initial Teacher Training\n* Expertise and enthusiasm across the cluster in the professional development of all education staff\n* Opportunities for trainees to learn about and experience the special features of each partner school through School Experience Days\n* Experienced mentors and tutors who will provide personalised support across the placements\n* Opportunities to develop as a group of Waterton trainees during all training and placements\nBy choosing to train within a close partnership such as ours, you will benefit from being treated as part of our family from day one. We are committed to training great teachers as a key block in building great schools for our pupils and community. In 2019 80% of our trainees who successfully completed their PGCE went on to become full-time teachers in our schools.\nCome and visit us at our stand at the [PGCE Open Days] (http://www.leedstrinity.ac.uk/courses/open-days/pgce)\nTo find out more visit our [website] (http://www.watertonacademytrust.org/joiningus-itt.php)\nIf you are considering starting a rewarding career in teaching where you can make a real difference in the lives of young children, come and find our what Waterton can offer you!","trainWithDisability":"In Partnership with Leeds Trinity, we can provide advice and additional support to students with a range of disabilities. These include:\n* dyslexia or other specific learning difficulties\n* medical conditions\n* visual and hearing impairments\n* physical or mobility difficulties\n* mental health conditions\nAll of our school sites are fully accessible for wheel chair users. The campus buildings at Leeds Trinity ​ have been developed to include:\n* platform lifts for wheelchair users\n* automatic doors\n* adapted fire alarms for students with hearing impairments\nOur partnership is committed to supporting all colleagues with any mental health conditions, providing access to appropriate mentoring and counselling. We will signpost colleagues to professional support in health services and ensure appropriate and reasonable adaptations are considered and applied where necessary.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"accreditedBodies":[],"createdAt":"2021-07-06T17:48:36.599Z","updatedAt":"2021-10-07T22:04:14.841Z"}
