{"id":"c411e9fb-4112-47c0-8169-81c447442f82","name":"The de Ferrers Trust","code":"1E2","type":"lead_school","isAccreditedBody":false,"urn":"136414","ukprn":"10032605","address":{"addressLine1":"St Marys drive","addressLine2":"Burton on trent","town":"Burton-on-Trent","county":"Staffordshire","postcode":"DE13 0LL"},"contact":{"website":"http://www.deferrers.com","email":"bparker.pingle@deferrerstrust.com","telephone":"01283 247700","fullName":"Andy Jones - Assistant Princpial"},"location":{"latitude":52.8295195,"longitude":-1.6413786},"trainWithUs":"The de Ferrers Trust is a mixed multi-academy trust based in Staffordshire and South Derbyshire. The trust currently consists of seven schools (three secondaries: The de Ferrers Academy, The Pingle Academy and Granville Academy, and four primaries: Eton Park Junior, Horninglow Primary, Lansdowne Infants and Richard Wakefield C.E. Primary Academy). The trust educates approximately 5000 children and young people between the ages of 3 and 19 and employs 600 members of staff. The Trust exists to ensure that all the children and young people in our care have the opportunity to fulfil their potential through achieving highly, regardless of their ability or background.\nWithin the Trust we have received both national and international recognition for the work we are currently doing on transforming teaching and learning through the use of Apple technology. The de Ferrers Academy is an Apple Regional Training Centre (RTC) and trainees from within the Trust will be provided with outstanding opportunities to access and develop their teaching in modern, forward thinking Academies. The de Ferrers Trust has a vision that all students within our care will eventually have access to a 1:1 iPad scheme.\nTeacher training within The de Ferrers Trust affords a wide range of experiences. Our teacher training experience ensures that you receive the highest quality of training and support at school and Trust level. Throughout your training at The de Ferrers Trust you will be working with a dedicated, hard-working team and you can expect a fully comprehensive induction and support programme.","trainWithDisability":"We do not discriminate any candidate who has any form of disability. If successful we would make the necessary adjustments to facilitate employees to be able to carry out their role, examples such as:\n- lessons on the ground floor\n- support of appointments with external agencies\n- use of sound field system\nApplicants should be aware that the de Ferrers Academy is a split site Academy and to access all of the required teaching experience to achieve QTS, inter-site travel is necessary during the school day. We have staff who have a variety of disabilities, all these staff receive support through HR.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:49:10.488Z","updatedAt":"2021-10-05T00:07:13.737Z"}
