{"id":"c442d44a-4328-42dc-b564-61e5d2d9b3be","name":"Wycombe High School","code":"1CH","type":"lead_school","isAccreditedBody":false,"urn":"136723","ukprn":"10033583","address":{"addressLine1":"The National Mathematics and Physics SCITT at Wycombe High School","addressLine2":"Marlow Road","county":"High Wycombe","postcode":"HP11 1TB"},"contact":{"website":"http://www.nmapscitt.org.uk","email":"enquiries@nmapscitt.org.uk","telephone":"01494 897330","fullName":"NMAPS Administrator"},"location":{"latitude":51.6200519,"longitude":-0.762828},"trainWithUs":"[Wycombe High School](https://www.whs.bucks.sch.uk/) (based in High Wycombe, Buckinghamshire) is the designated Lead School for [The National Mathematics and Physics SCITT (NMAPS)](http://www.nmapscitt.org.uk/). We will be offering School Direct training (Salaried and Non-Salaried) with NMAPS, but ONLY for trainees on the [Researchers in School (RiS) Programme](https://researchersinschools.org/), who will have a PhD. NMAPS offers high quality specialist teacher training, led by outstanding, practising, teachers of Mathematics and Physics, in a unique collaboration between the state and independent sectors, and in partnership with subject associations such as The Institute of Physics, The Mathematical Association and the National Centre for Excellence in the Teaching of Mathematics (NCETM).\nBecause we only offer training in Maths and Physics, you will benefit from a bespoke programme focused on your subject, with enhanced specialist subject knowledge and pedagogical training to ensure your career gets off to a flying start. NMAPS trainees learn 'on the job' from the very beginning and benefit immediately from the insight into what teaching involves. The NMAPS programme begins with a 3 day residential Induction Course at Headington School in Oxford in late August to prepare you for the year ahead.","trainWithDisability":"The National Mathematics and Physics SCITT (NMAPS) is committed to equal opportunities and is able to support trainees with additional needs. We will work with trainees to arrange a suitable placement school that can accommodate their needs.","accreditedBodies":[{"id":"8fc9b0c3-acaf-447c-adb7-dd93bf530a8e","code":"2H8","name":"The National Mathematics and Physics SCITT","description":""}],"createdAt":"2021-07-06T17:48:49.222Z","updatedAt":"2021-07-06T17:48:49.222Z"}