{"id":"c55debfc-8b74-469b-9b88-1f0e2c2d4c4f","name":"Catholic Schools Teaching School Alliance School Direct","code":"2C9","type":"lead_school","isAccreditedBody":false,"urn":"120221","ukprn":"10080885","address":{"addressLine1":"Christ the King Catholic Voluntary Academy","addressLine2":"Glenfield Road","town":"Leicester, Leicestershire","county":"East Midlands","postcode":"LE3 6DG"},"contact":{"website":"https://www.lctsa.org/Initial-Teacher-Training/","email":"admin@leics-scitt.co.uk","telephone":"1162543187","fullName":"Judy Beer"},"location":{"latitude":52.6380896,"longitude":-1.1750168},"trainWithUs":"Christ the King’s School Direct programme is ideal for trainees who want to share their faith with their pupils. Christ the King [(CTK)](http://www.ctkleicester.co.uk) is an Outstanding primary school, [(Ofsted Nov 2014)](http://www.ctkleicester.co.uk/docs/performance___inspections/Our_most_recent_Ofsted_Report.pdf) which was subsequently designated a [Teaching School](https://www.lctsa.org/Initial-Teacher-Training/). It is located in a multi-cultural area, with varying rates of socio-economic deprivation. This School Direct programme will be delivered by the Leicester and Leicestershire SCITT which has been an Outstanding Primary Teacher Training provider for the last 10 years [(Ofsted 2016)](https://files.api.ofsted.gov.uk/v1/file/2535240). Over two-thirds of the teachers at CTK have been trained by the SCITT and the Early Primary course is based on their infant site. All trainees gain an internationally recognised PGCE, worth 60 Masters level credits, awarded by the University of Leicester alongside QTS. In [‘The Real Schools Guide’ (2019)](https://leics-scitt.co.uk/wp-content/uploads/2019/09/TOP-ten-schools-2019.pdf) 7 out of 10 of Leicestershire’s top rated primary schools are SCITT partnership schools who currently employ many SCITT trained teachers. [Teaching placements](https://leics-scitt.co.uk/our-courses/) are carefully organised by course management for trainees, to support their individual development needs in teaching across three contrasting schools – one of which is guaranteed to be within a faith school within Leicestershire.\nMost importantly, 95% of trainees have graded the quality of training as ‘Very Good’.\nWhat our trainees say:\n* “It has been such a valuable and rewarding experience. I would recommend this course to anyone who wants to pursue a career in primary school teaching” (Erin, RQT)","trainWithDisability":"Education and training providers have a duty under the Equality Act 2010 to anticipate the adjustments that disabled students may need. The SCITT is committed to actively promoting equal opportunities in employment and to encouraging participation by disabled people in public life. If you would describe yourself as having a disability, in accordance with the Equality Act (2010), and need any adjustments made to promote equality of opportunity, please contact us, as soon as possible, so we can discuss your requirements. The best place for you to do this is on your UCAS form. However, you can also do it at any time during your studies, either by telling a member of SCITT Management.\nAs we are partnered with the University of Leicester, our students can access the Student Support Services offered. The AccessAbility Centre offers support and advice for students with dyslexia or other specific learning difficulties as well as working with students who have sensory disabilities, mobility difficulties; mental health conditions and autism. The Centre also offers study skills support. [The AccessAbility Centre](https://www2.le.ac.uk/offices/accessability)","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"6cbdc52f-08fc-47e9-b2ee-831ac14e2d98","code":"L35","name":"Leicester & Leicestershire SCITT","description":"In the most recent [`Good Teacher Training Guide’]( https://www.buckingham.ac.uk/wp-content/uploads/2017/04/GTTG17fin.pdf) the SCITT is in the top five Initial Teacher Training (ITT) providers nationally and is the top primary provider in the East Midlands. \\r\\n\\r\\nThe SCITT prides itself on the unrivaled, personalised support it offers all trainees, leading to the highest percentage of trainees gaining Qualified Teacher Status in Leicester and Leicestershire. [DfE performance profiles](https://leics-scitt.co.uk/wp-content/uploads/2019/09/ITTPP2019_Provider_tables_East-West-Mids.xlsx)\\r\\n\\r\\nThe SCITT believed in me from day one, even before I believed in myself.Steven, NQT, 2019"}],"createdAt":"2021-07-06T17:56:14.658Z","updatedAt":"2021-09-30T15:58:19.259Z"}
