{"id":"c5ede260-f452-441e-aaef-bd06722397ab","name":"Eastgate Academy","code":"2H2","type":"lead_school","isAccreditedBody":false,"urn":"140663","ukprn":"10045437","address":{"addressLine1":"Eastgate Academy","addressLine2":"Littleport Terrace","town":"King’s Lynn","county":"Norfolk","postcode":"PE30 1QA"},"contact":{"website":"https://eastgateacademy.co.uk/","email":"Linda.Hothersall@ega.eastern-mat.co.uk","telephone":"1553773088","fullName":"Linda Hothersall"},"location":{"latitude":52.7556957,"longitude":0.403616},"trainWithUs":"At Eastgate Academy we are committed to the academic, personal, social and emotional development of all of our pupils. We promote an engaging environment where successful and inspiring teaching and enthusiastic learning, tolerance and mutual respect towards others is valued above all else. Trainees at Eastgate Academy can look forward to a unique and enriching experience. All staff at our Outstanding Academy refer to their colleagues as ‘family’. You will find that staff are friendly, supportive, approachable and encouraging.\nWe firmly believe that there is no ‘silly’ questions and enjoy the opportunities to use our experience and ability to reflect in order to foster professional dialogue. We also fully understand the personal and emotional stresses involved in teacher training and you will find us more than willing to listen and offer support should you need to share.\nIn pursuit of excellence we will always endeavour to demonstrate best practice in order to promote the spiritual, moral, cultural, mental and physical developments of pupils in our school. We also aim to prepare pupils in our school to be well equipped to embrace the opportunities, responsibilities and experience of later life. All pupils will experience a broad and balanced curriculum, which supports, challenges and extends their self discipline, motivation and self esteem in order to achieve excellence in learning. In working closely with pupils, parents and the wider community we will encourage the children to develop into confident, successful, responsible, independent beings who have an appropriate sense of Citizenship.","trainWithDisability":"We really care about all of our trainees and aim to support them all of the way through their studies, from application to graduation. Here at Eastgate Academy we recognise that trainees may require additional assistance to engage fully with their studies due to a range of access needs. Student Advice plays a key role in co-ordinating services available to BGU’s disabled and sensory impaired students, and/or with specific learning differences or other access needs before and during their studies. In order to assess the level of support trainees may require, we use the legal definition of disability, which is wide ranging but includes:\n* Specific learning differences including dyslexia\n* Physical mobility difficulties\n* Hearing impairments\n* Visual impairments\n* Persons requiring personal care\n* Autistic Spectrum Disorders including Asperger’s Syndrome\n* Mental health difficulties\n* Medical conditions such as epilepsy, diabetes or asthma\n* Please note that this is not an exhaustive list – trainees may have access needs that are not listed above. If you are unsure whether you have access needs which are covered by disability legislation, please contact Student Advice – we will be happy to offer advice and guidance.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"1d95b6cb-0e08-4485-848a-0e304d71102a","code":"B38","name":"Bishop Grosseteste University","description":"Bishop Grosseteste University (BGU) has been educating students in the historic heart of Lincoln for over 150 years. Our campus is located just a few minutes’ walk from Lincoln Cathedral, Castle and the old Roman city.\\r\\nOver the past 150 years, our commitment to first-class teacher training has remained consistent and we continue to provide schools across the country with highly-skilled graduates who are equipped to teach the next generation of young learners. \\r\\nLife after BGU is also extremely important to us, we offer many different methods of support for our trainees as they begin their teaching careers. \\r\\n\\r\\n\\r\\n."}],"createdAt":"2021-07-12T20:49:03.627Z","updatedAt":"2021-11-02T21:19:15.636Z"}
