{"id":"c6016000-be48-4c31-bbd1-285e09e318fa","name":"Omega Teaching Partnership","code":"1L2","type":"lead_school","isAccreditedBody":false,"urn":"139152","ukprn":"10040008","address":{"addressLine1":"Omega Teaching Centre","addressLine2":"Lingley Green Avenue","town":"Great Sankey","county":"Warrington","postcode":"WA5 3ZJ"},"contact":{"website":"http://www.omegateachingpartnership.co.uk","email":"schooldirect@omegamat.co.uk","telephone":"1925988330","fullName":"Andy Day, Director of Great Sankey TSA"},"location":{"latitude":53.4017561,"longitude":-2.6635287},"trainWithUs":"Join Omega Teaching Partnership and be welcomed to our learning community, supported to train as either a Primary or Secondary teacher from day one.\n\nLocated in Warrington with excellent access to Manchester and Liverpool, our partnership consists of 3 large secondary schools, 12 primary schools and a special school.\n \nWhy complete your PGCE with us? \n\n* Supportive mentoring; experienced and trained mentors who are committed to developing the next generation of outstanding teachers\n* High employment; schools in our partnership want to recruit outstanding teachers from our programme\n* Excellent facilities and opportunities; dedicated training centre and innovative programme design supports professional and leadership development with enrichment opportunities in a local special school\n* School-based training programme with University tutors travelling to support professional conferences\n\nOur School Direct programme enables you to spend the vast majority of your year in a highly supportive school environment where you will train alongside dedicated professionals. Their expertise will help you to develop the rigour, professional knowledge, understanding and skills necessary to become a teacher, able to plan and deliver creative, purposeful and challenging lessons.","trainWithDisability":"We are an inclusive provider and all of our partnership Schools are welcoming to trainees with disabilities and other needs. Our trainees have access to the full range of University of Cumbria support as well as that offered within our School Direct partnership. Much of the university-based support is available online and electronically and so accessible at a distance.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"9be9f611-2d36-431a-9109-7fcbbfc88fc8","code":"C99","name":"University of Cumbria","description":"University of Cumbria are one of the largest providers of teacher training in the UK and joint first in the UK for students completing their PGCE Secondary programme. In the last 10 years they have trained over 10,000 new teachers.\\r\\n\\r\\nWhilst you will receive all the benefits of having such an accrediting body, you will rarely have to travel to the Lancaster campus as the training is mainly delivered locally. Those on the Primary School Direct programme are supported by a visiting University tutor and the Secondary programme attend 12 days of subject specific training at the Lancaster campus."}],"createdAt":"2021-07-06T17:50:13.934Z","updatedAt":"2021-10-05T14:31:29.716Z"}
