{"id":"c60f7f80-8e3b-4cf1-950f-db247bcd7eb1","name":"John Spence Community High School","code":"25W","type":"lead_school","isAccreditedBody":false,"urn":"108644","ukprn":"10003503","address":{"addressLine1":"John Spence Community HS","addressLine2":"Preston Road","town":"North Shields","county":"Tyne & Wear","postcode":"NE29 9PU"},"contact":{"website":"http://www.nepscitt.co.uk","email":"sarah.ramsden@johnspence.org.uk","telephone":"0191 2961432","fullName":"Jonathan Heath (Head Teacher)"},"location":{"latitude":55.0220564,"longitude":-1.4509305},"trainWithUs":"If you want to be a primary school teacher with a PE specialism, train with the North East Partnership SCITT through John Spence Community High School.\n* We are the only provider of this unique course in the North East of England and one of only a few in the country. * The current political climate advocates the development of PE and sport in primary schools and provides funding to schools to develop this area. * Research indicates that there is a need for PE specialists in primary schools.\n* Since the start of the course our trainee outcomes have been exceptionally high; completion rates, attainment grades and employment. * You will have the opportunity to work with experts in all areas of the primary curriculum, including; all three core subjects, physical education and the foundation subjects.\n* Training is completely school-centred. We work with 21 schools in the North East of England and a significant number of these support the programme delivery. * We have exceptionally strong support mechanisms. In each placement school you will have will have a class teacher and a PE mentor plus a link tutor. In addition, a cohort of 14 means that you are never working in isolation.\n* You will exit the course with QTS and a PGCE which includes 60 Masters Credits.","trainWithDisability":"We are committed to providing an environment in which you are treated fairly and with respect. Disabilities are catered for on a case by case basis. Any trainee with an impairment or health condition (physical or mental), which may affect their ability to train to teach will be referred to occupational health and any reasonable adjustments will be made for their training year. We acknowledge that some of you might find the academic side of the course a little challenging, especially if you have been out of full-time education for a while or suffer from dyslexia, and provide a range of support to cater for this.\nIn addition, we have a mental health and well-being officer who works with you throughout your training year.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:47:35.048Z","updatedAt":"2021-07-23T16:09:29.714Z"}
