{"id":"c616964c-a4bb-4341-9dc0-d3edfa65134f","name":"John Taylor High School","code":"1L6","type":"lead_school","isAccreditedBody":false,"urn":"136323","ukprn":"10032188","address":{"addressLine1":"John Taylor High School","addressLine2":"Dunstall Road, Barton under Needwood","town":"Burton on Trent","county":"Staffordshire","postcode":"DE13 8AZ"},"contact":{"website":"https://jtscitt.co.uk/","email":"l.axten@jths.co.uk","telephone":"1283247813","fullName":"School Direct Administrator"},"location":{"latitude":52.765731,"longitude":-1.716944},"trainWithUs":"John Taylor High School, based in the charming Staffordshire village of Barton under Needwood, is an Outstanding school (Ofsted 2014) and the lead school for the John Taylor SCITT. We currently work with 15 secondary schools, 35 primaries and 3 special schools. Most of our partner schools are located north of Birmingham, predominantly in Staffordshire and South Derbyshire. We are well located, being less than 5 minutes from the A38. A bespoke training centre, on the John Taylor High School site, is the main training venue for all Professional Studies and Subject Development training.\nAs a Teaching School Hub we aspire to train and recruit the very best teachers to our local area and beyond and regard the ITE year as stage one of our teacher recruitment and development process. For trainees who secure employment locally, we offer access to a programme of tailored professional development: Our Early Career Teacher programmes build seamlessly on our ITE programmes and ensure that as an ECT you continue to be supported and developed. Talent management and succession planning are high on our agenda and our CPD and training opportunities reflect this, with opportunities for aspirant middle leaders and senior leaders to engage in tailored programmes to support the career progression of good teachers.[http://jttshub.co.uk](http://jtscitt.co.uk)","trainWithDisability":"The John Taylor SCITT is an inclusive provider and welcomes applications from people with disabilities. John Taylor High School, the lead school, has full access and facilities for people with disabilities.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"174b60fe-3dac-47c0-a65a-5691b6dda11c","code":"24V","name":"The John Taylor SCITT","description":"The John Taylor SCITT has been a provider of ITE since 2014. Based in the charming Staffordshire village of Barton-under-Needwood, the SCITT is based in a bespoke Training Centre on the site of John Taylor High School, an outstanding school which enjoys a high reputation locally and nationally as a school with an enviable academic record based on inspirational teaching and exceptional pastoral care. As a SCITT we pride ourselves on the fact that as a relatively small provider we know all our trainees really well and can offer highly personalised support which enables our trainees to secure excellent outcomes."}],"createdAt":"2021-07-06T17:55:30.264Z","updatedAt":"2021-09-28T18:16:23.693Z"}
