{"id":"c644aef8-7f9a-437e-b449-f5a8b6dcd134","name":"Eden Learning Trust","code":"2LW","type":"lead_school","isAccreditedBody":false,"urn":"138717","ukprn":"10067657","address":{"addressLine1":"Eden Learning Trust c/o Ferryhill Business and Enterprise College","addressLine2":"Merrington Rd","town":"Ferryhill","county":"County Durham","postcode":"DL17 8RW"},"contact":{"website":"https://www.edenlearningtrust.co.uk","email":"info@durhamscitt.co.uk","telephone":"01325 308198","fullName":"d.coates@woodham.org.uk"},"location":{"latitude":54.6841746,"longitude":-1.5756336},"trainWithUs":"The Eden Learning Trust is a newly established Multi Academy Trust based in South West Durham. Its aim is to provide the strongest possible education opportunities, in an environment where every one of our children really matters. Our banner of ‘Achievement for all’ is testament to this aim and has supported the founding schools in good stead over the past 5 years.\n“A great trust is about great people and within the Eden Learning Trust our staff are most definitely, our greatest asset. Their skills, unwavering professionalisms and good humour are at the core of what makes education great. We are driven to support our staff in their development, to help them to become great at ever part of their role. We believe that a successful staff, make successful learners and a happy and successful school.”\nEden Learning Trust (ELT) was formed in July of 2018 and has been founded through established local working relationships between one primary school, Chilton Academy and two secondary schools, Ferryhill Business & Enterprise College and Woodham Academy.\nDurham SCITT is the accrediting provider for Eden Learning Trust.","trainWithDisability":"Eden Learning Trust prides ourselves on the personal approach and fully supports candidates with disabilities during the interview process and throughout the course.\nThe Occupational Health Service provides an assessment and advisory service on the occupational health aspects of trainees. As part of the recruitment process, you will be required to complete an Occupational Health questionnaire and, if any needs are identified, will be followed up. Any necessary recommendations will be put in place. All of our buildings are fully accessible.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:53:16.802Z","updatedAt":"2021-07-13T19:46:08.309Z"}
