{"id":"c6a3e493-f9eb-4285-9456-1558fb9b818e","name":"Bradford College","code":"B60","type":"scitt","isAccreditedBody":true,"ukprn":"10000840","contact":{"website":"https://www.bradfordcollege.ac.uk/apply/degrees/","email":"admissions@bradfordcollege.ac.uk","telephone":"1274088008","fullName":"Registrar Services"},"location":{"latitude":53.7916688,"longitude":-1.7607719},"trainWithUs":"As Bradford’s leading ITE provider, the School of Teacher Education at University Centre Bradford College offers a wide range of ITE programmes covering Primary, Secondary and Post-secondary (14 – Adult) teacher training, at both undergraduate and postgraduate level. Our PGCE with QTS programmes include Primary (covering 3-7, 5-11 or 7-11 age routes) and Secondary Education in a range of subjects. We have Post-secondary Education and Training (PSET) courses available as pre-service or in-service, full or part-time options, leading to the award of Qualified Teacher Learning and Skills. We also offer the Assessment Only route to QTS and Secondary Subject Knowledge Enhancement courses. Our students enjoy a tailored learning experience extremely well supported by a dedicated team of tutors and school/college based mentors. We work in partnership with a wide range of schools across the region, encompassing varying socio-economic backgrounds, to give trainees opportunities to practise their teaching skills and to experience the different conditions faced by school colleagues. We have a very strong tradition of producing effective practitioners grounded in educating children and adults in a multi-ethnic world, with excellent employability rates for our graduates. In our most recent Ofsted inspection (2018) we received a ‘Good’ grade for the quality of our provision. We have dedicated Higher Education learning and social spaces with good facilities designed to enable trainees to reap the benefits of studying with peers.","trainWithDisability":"Students have access to Bradford College Disability Services and Learning Support, which provides support to learners with a range of disabilities and/or learning difficulties at all college sites. Learning Support is available to all students with a disclosed disability, or learning difficulty, provided they meet the entry requirements of their course, and can access their chosen course with the help of “reasonable adjustments” (subject to resources.)\nStudents with disabilities and/or learning difficulties meeting the requirements are entitled to:\n(i) a Learning Support Agreement outlining the support agreed between the student and the Learning Support Tutor or Advisor at College;\n(ii) their Learning Support Agreement being followed by teaching and support staff, who may need to make adjustments;\n(iii) be able to speak in confidence to staff about their support needs. This information will not be passed on to other staff or external bodies without their signed consent, unless there is a risk to their safety or that of other students and staff;\n(iv) a risk assessment being undertaken, where attendance on their chosen course may pose a risk to themselves or others;\n(v) access arrangements in exams, and during entry tests, if appropriate evidence is produced in advanceto enable these arrangements to be provided;\n(vi) a Learning Support Tutor from the Learning Support Team to oversee and review their support and whom they can contact if difficulties arise.\n(vii) decline the support offered to them, unless there is a risk to their safety or that of other students and staff;","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:56:38.854Z","updatedAt":"2022-02-03T16:35:17.334Z"}
