{"id":"c6cc9d00-9dc5-4e23-959d-d2be40dd4aed","name":"Primary Catholic Partnership SCITT (PCP SCITT)","code":"P85","type":"scitt","isAccreditedBody":true,"ukprn":"10045987","address":{"addressLine1":"c/o Holy Family Catholic Primary School","addressLine2":"Mansel Road West","town":"Southampton","county":"Hampshire","postcode":"SO16 9LP"},"contact":{"website":"http://www.pcp-scitt.org.uk","email":"admin@pcp-scitt.org.uk","telephone":"023 8077 9753","fullName":"Director - Paul Haslam"},"location":{"latitude":50.9321675,"longitude":-1.4669876},"trainWithUs":"The Primary Catholic Partnership (PCP) SCITT has offered local initial teacher training for nearly twenty years and has been consistently graded Outstanding by Ofsted since 2011. Our lead school, Holy Family Catholic Primary, is also rated Outstanding by Ofsted, as is the primary teacher training provision of our partner, Bath Spa University. In collaboration with our school and university partners, we offer a supportive training environment to around 40 trainees each year. Our inclusive ethos is central to our vision of training teachers who are confident, dynamic and creative professionals. PCP graduates endorse the high quality of our programme: 100% of respondents to our 2020 survey rated the quality of their training as good or better. Employment prospects are also strong, as our ‘rates of completion and employment are consistently higher than national figures’ (Ofsted 2018). PCP SCITT offers a tuition fee PGCE route into teaching, and also works with the CTSA to offer School Direct and Apprentice training places. Our successful alliance consists of over 30 schools in Hampshire, Dorset, Wiltshire and IOW. PCP SCITT offers successful applicants the training opportunity that meets their individual needs, in a location near them. Located in purpose-built accommodation within the grounds of Holy Family Primary School, Southampton, the SCITT offers a well-equipped learning environment with two teaching rooms, a library and a spacious social area with catering facilities. The centre is accessible by car or public transport.","trainWithDisability":"As an inclusive provider, PCP SCITT welcomes all candidates who meet the entry requirements, including those with disabilities or other needs. We work with trainees to offer individualised support according to their needs to allow each person the opportunity to reach their teaching potential.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:47:29.558Z","updatedAt":"2021-10-18T21:06:32.945Z"}
