{"id":"c74e13a6-22cf-4fbd-88e9-682aabd7391a","name":"Carmel College","code":"1KF","type":"lead_school","isAccreditedBody":false,"urn":"137622","ukprn":"10055116","address":{"addressLine1":"Carmel College","addressLine2":"The Headlands","town":"Darlington","postcode":"DL3 8RP"},"contact":{"website":"www.carmelteachertraining.com","email":"thonnartm@carmel.bhcet.org.uk","telephone":"01325 523460","fullName":"Mike Shorten"},"location":{"latitude":54.5244598,"longitude":-1.585727},"trainWithUs":"Carmel Teacher Training Partnership (CTTP) is an outstanding Initial Teacher Training Provider based at Carmel College Darlington, an outstanding 11-18 college. Our training programmes are Primary 5-11 years and Secondary 11-16. We pride ourselves on the bespoke level of training for all our trainees, focused on our high quality training provision from very experienced practitioners. The Partnership is made up of Catholic and non-Catholic, primary and secondary schools, widely spread across the North East of England. The CTTP School Centred Initial Teacher Training course aims to promote excellence in all aspects of education. This is achieved through high quality central and school-based training activities, regular observations with developmental feedback, to secure progress throughout the training programme. Central training takes place in clusters around our Lead Schools. Our overarching aim is to provide the most skilled and competent practitioners for our schools, improving the outcomes and life chances for young people. A very high percentage of trainees on our programme either gain employment in their placement schools, or within our Partnership of schools. Carmel Teacher Training Partnership is a well-established Provider, offering a friendly, nurturing and supportive environment for all trainees. Successful completion leads to Qualified Teacher Status (QTS), a Post Graduate Certificate in Education (PGCE) and 60 credits towards Masters accreditation, which is completed via the flying faculty of St. Mary’s University Twickenham but delivered at Carmel College.","trainWithDisability":"All Schools within the Carmel Teacher Training Partnership are fully accessible. Provision for additional support where needed is provided on site. Please contact Claire Hutton on huttonc@carmel.bhcet.org.uk with any specific disability access requirements.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:54:59.570Z","updatedAt":"2021-10-04T21:01:34.177Z"}
