{"id":"c76d7988-1268-427c-ab85-b44a3041a0cf","name":"Ventrus Training school","code":"2BF","type":"lead_school","isAccreditedBody":false,"urn":"140078","ukprn":"10043022","address":{"addressLine1":"The Duchy School","addressLine2":"Bowley Meadow","town":"Exeter","county":"Devon","postcode":"EX5 4RF"},"contact":{"website":"https://www.sciltraining.co.uk/scitt/","email":"cbarnett@ventrus.org.uk","telephone":"01392 256020","fullName":"Ventrus Teaching School Alliance"},"location":{"latitude":50.8221466,"longitude":-3.4278216},"trainWithUs":"Ventrus is a dynamic and exciting group of schools that puts learning and people development at its core. We believe in investing in our staff to become great teachers who in turn provide the very best for the pupils in our care. We are a large group of 15 primary schools and a large Community College situated across Devon. We offer a rich diversity of training settings from small rural village schools to large City schools, from South Brent near Plymouth, Exeter and surrounding area, Tiverton, Bickleigh, Sidbury, Hemyock and Barnstaple. We work closely with both Plymouth and Exeter University. Ventrus Teaching School collaborates with a number of South West partner organisations with a proven track record of;\n*excellent school to school support *rich CPD *leadership training for all career stages. We have considerable expertise and success in ITT. Our partner provider for our School Direct placements is Somerset SCITT, an OFSTED rated OUTSTANDING provider, with whom we have a long and established relationship of quality training.\nVentrus has developed strong and exciting school networks to support our early career teachers as well as provide leadership pathways to middle and senior posts, being committed to supporting our trainees beyond their PGCE year. We pride ourselves on nurturing supportive and exciting pathways into teaching and knowing our students and individuals. We are a ‘can do’ organisation offering you the best start to your career into the best profession ever!","trainWithDisability":"We welcome all students whatever your needs and will work with you and support you fully as an individual to achieve your best outcomes whilst training to be a teacher.\nTeachers with disabilities, make an important contribution to schools both in the classroom and in shaping the wider culture and ethos of the schools they work in. We value diversity and the unique contribution that all their staff and trainees bring. If you have a disability, you shouldn’t be dissuaded from applying – we’ve put together some information on the support available while you train to teach. It’s a personal choice if you want to inform your school and/or university of your disability. The advantage of disclosure is that it enables support and reasonable adjustments to be put in place. In addition, specialist equipment, extra funding and support, can help you achieve your ambition of becoming a teacher.\nThe Equality Act 2010 and Special Educational Needs and Disability Act 2001, requires teacher training providers to ensure they are not discriminating against applicants with disabilities or special educational needs (SEN). We comply fully with this legislation\nThe Equality Act 2010 also sets out that disability is a ‘protected characteristic’. This means we will work with you to make reasonable adjustments. Common reasonable adjustments include:\nmaking modifications to buildings where possible\noffering flexible working hours\nproviding specialist equipment","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:47:53.727Z","updatedAt":"2021-10-13T17:16:54.520Z"}
