{"id":"c7c9c216-0840-460c-b6f4-d273506cfabc","name":"Bourne Westfield Primary Academy","code":"23G","type":"lead_school","isAccreditedBody":false,"urn":"120402","ukprn":"10058447","address":{"addressLine1":"The Deepings SCITT","addressLine2":"The Deepings School","town":"Deeping St James","county":"Lincolnshire","postcode":"PE6 8NF"},"contact":{"website":"www.deepingscitt.org","email":"ddimeloe@deepings.anthemtrust.uk","telephone":"01778 342159","fullName":"Mrs N Benjamin"},"location":{"latitude":52.674841,"longitude":-0.296964},"trainWithUs":"Bourne Westfield is the lead school for School Direct training places for The Deepings SCITT which provides a range of school-based programmes in both Primary and Secondary phases for South Lincolnshire. We sit just North of Peterborough and serve North Cambridgeshire and South Lincolnshire having ‘migrated’ from the CfBT SCITT and moved down to Deeping St James, from Lincoln, in 2015. Since then we have had 100% pass rate and our most recent end-of-year survey data saw trainees rate both Primary and Secondary programmes as ‘outstanding.’ Our School Direct ITT programmes include a PGCE option awarded by the University of Hull. This delivery takes place at The Deepings and the PGCE comes with 60 Masters Credits. We are a small local provider; with 20-25 trainees in each phase every year, we very much value our 'family ethos.' We always aim for exceptional results in terms of the quality of the training and the career prospects of our trainees. Ofsted last rated us as 'good' in every category (June 2013,) describing our, \"effective recruitment and rigorous selection of highly suitable trainees and consistently high rates of employment.\"","trainWithDisability":"Applications are welcomed from trainees with disabilities. Our training venues offer disabled access as do some of our host schools. On interview, a short Health Survey determines whether or not a referral to Occupational Health Services is necessary in order to ensure that we can meet your needs. Amongst our successes have been trainees with dyslexia, dyspraxia, epilepsy and arthritis.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:50:57.009Z","updatedAt":"2021-08-10T18:33:11.081Z"}
