{"id":"c7decfe1-be56-4515-a0ca-0a9e6c8dee33","name":"St Andrews CE Primary School","code":"1VA","type":"lead_school","isAccreditedBody":false,"urn":"100613","ukprn":"10074731","address":{"addressLine1":"Kay Road","town":"London","postcode":"SW9 9DE"},"contact":{"website":"https://www.standrewsprimaryschoolstockwell.org/","email":"admin@teachinglondon.org","telephone":"2079321126","fullName":"Jayne Mitchell"},"location":{"latitude":51.4679382,"longitude":-0.1222418},"trainWithUs":"St Andrew's is a small, successful and happy church primary school, recognised by Ofsted as good with an outstanding curriculum.\nWe are a very welcoming school and we are known for our friendly, family atmosphere.\n\nWe have excellent relationships with our families and know our children very well – one of the many advantages of being a small school. Our aim is to ensure that every pupil enjoys their time at St Andrew’s and develops a lively and enquiring mind. We value each and every child as an individual and encourage their unique development whilst emphasising the importance of respect, team work, responsibility and hard work.","trainWithDisability":"Teaching London: LDBS SCITT has a degree of step-free access, but as the building was a Victorian school, we are unable to fully accommodate wheelchair access. We are always willing to discuss, and where possible, adapt to meet individual needs.\nThe well-being of our trainees is paramount, which is why you will be automatically enrolled into the Employee Assistance Programme with the Education Support Partnership. This provides 24/7 individual support and counselling, in addition to our in-house advice and support.\nWe also have experience in supporting trainees with a diagnosis of dyslexia and are able to offer specialist support on the course.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"720894da-360a-4f7a-9835-7ce7beb3c6de","code":"L59","name":"Teaching London: LDBS SCITT","description":"https://www.teachinglondon.org/"}],"createdAt":"2021-07-06T17:52:18.727Z","updatedAt":"2021-09-14T19:53:44.433Z"}
