{"id":"c7f67537-c233-40cb-917a-f1dd0c29475d","name":"Thorndown Primary School","code":"2LV","type":"lead_school","isAccreditedBody":false,"urn":"136814","ukprn":"10072300","address":{"addressLine1":"Thorndown Primary School","addressLine2":"Hill Rise","town":"St Ives","county":"Cambridgeshire","postcode":"PE27 6SE"},"contact":{"website":"http://www.thorndownprimaryschool.co.uk/","email":"itt@thorndown.cambs.sch.uk","telephone":"1480375103","fullName":"Admissions"},"location":{"latitude":52.3363365,"longitude":-0.0882647},"trainWithUs":"Thorndown Primary School in collaboration with the HE provider University of Bedfordshire, are pleased to offer School Direct places for Initial Teacher Training.\nOur training will provide trainees with a Post Graduate Certificate in Education (PGCE) and Qualified Teacher Status (QTS) from the University of Bedfordshire.\nPlaces are available in an excellent and varied network of schools across the Huntingdon and St Ives area. The schools who are partnered with the Thorndown will offer high quality training for trainees who wish to train to teach in Primary Phases. You will be assigned an experienced mentor in your placement school to support you through your day to day and also a link tutor to guide and assess you through each stage. Your wellbeing and success is our priority.","trainWithDisability":"We value inclusion and are committed to equitable treatment and elimination of discrimination in all its forms at all levels and throughout all programs and training.\nAll schools within the schools offering School Direct placements have full disabled access.\nApplicants who would benefit from disabled access should let us know on their application so they can be considered for placements accordingly.\nFor more information please view disability access information on the University of Bedfordshire website.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"af388cc3-644a-4fd3-bd71-55503b74fc21","code":"B22","name":"University of Bedfordshire","description":"This course is designed for you spend four days in the classroom and one day a week in the University"}],"createdAt":"2021-07-06T17:57:25.256Z","updatedAt":"2021-09-28T23:10:24.004Z"}
