{"id":"c801c7dd-8bf1-46f6-b176-25230bbf229a","name":"The Bay Church of England Primary","code":"1XF","type":"lead_school","isAccreditedBody":false,"urn":"136013","ukprn":"10072313","address":{"addressLine1":"The Bay CE School","addressLine2":"Winchester Park Road","town":"Sandown","county":"Isle of Wight","postcode":"PO36 9BA"},"contact":{"website":"www.bayceschool.org","email":"schooldirect@bayceschool.org","telephone":"01983 403284","fullName":"Duncan Mills"},"location":{"latitude":50.657378,"longitude":-1.1587376},"trainWithUs":"We are delighted to be part of the School Direct Teacher Training Programme and look forward to working with trainees who are enthusiastic about a career within the classroom. We firmly believe that it is an excellent way to learn and qualify to become a teacher. The School Direct Programme is a unique, employment-based route into teacher training, available to high-quality graduates with some experience within a school environment.\nEvery student is allocated a mentor who is a highly-experienced teacher and will offer personalised support throughout the year. Weekly meetings will focus on targets (short and long-term) as well as reviewing your progress. You will attend staff meetings and school training sessions and feel a valued member of the team. As your confidence grows, you will deliver parts of lessons on your own, taking on more responsibility until you are teaching full lessons. You will be assigned a host school for the autumn and summer term and in the spring you will spend a minimum of 6 weeks in another school to gain experience within a different key stage. The training programme will build your confidence and subject knowledge and give you the necessary skills to become an effective classroom practitioner. We are extremely proud that we have a strong track record and 100% of our School Direct trainees have passed this course and subsequently found employment within schools on the island.","trainWithDisability":"We strongly encourage skilled and talented applicants from a variety of backgrounds, including those with a disability.\nPlacements are carefully chosen to ensure that the specific needs of an individual can be met within the setting and this includes accessibility for trainees with a physical disability.\nIf you have a disability or other need you’d like to discuss before applying to our training programme, please contact us so we can discuss your specific requirements in more detail and answer questions you may have.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:53:33.912Z","updatedAt":"2021-10-05T16:29:22.468Z"}
