{"id":"c82c243b-e495-49a3-b79f-154b3cfe56bf","name":"Three Counties Alliance SCITT","code":"T29","type":"scitt","isAccreditedBody":true,"ukprn":"10034549","address":{"addressLine1":"Minsthorpe Community College","addressLine2":"Minsthorpe Lane,","town":"Pontefract","county":"West Yorkshire","postcode":"WF9 2UJ"},"contact":{"website":"http://ytcascitt.co.uk/","email":"ytca@minsthorpe.cc","telephone":"1977657604","fullName":"SCITT Programmes Lead"},"location":{"latitude":53.6023892,"longitude":-1.2903856},"trainWithUs":"\"YTCA has been fantastic. The support I have received has been second to none. Without the personal, approachable nature of the staff, mentors and other trainees I would not have progressed as much as I have. The course provides a wealth of training, experiences, opportunities and personalised support. Its smaller size is just one of its greatest strengths. I have had an incredible year!\"\nSecondary Trainee 2018-19\nThe YTCA SCITT has a highly successful track record of developing great teachers. As a relatively small provider, we are able to personalise our training and offer the support our trainees deserve.\nStudents in our schools have a right to the best education and learning opportunities by being taught by outstanding teachers. Therefore we ensure that our context, our schools, our children and our trainees remain at the heart of all we do. Our programme is tailored to our community's needs and our vision remains to produce outstanding, dedicated teachers that will make a difference to the life chances of children in our Yorkshire schools.\nWe strive for excellence and are achieving this by:\n* Providing a challenging, stimulating and inspirational training programme run by expert practitioners;\n* Working with partners who are committed to providing a welcoming, encouraging and professional learning environment;\n* Supporting our trainees to work at Masters Level for a PGCE;\n* Preparing our trainees for future leadership roles within the teaching profession and education sector.\nTo find out more please [visit our website.](http://ytcascitt.co.uk/)","trainWithDisability":"The YTCA SCITT has a commitment to equality of opportunity for all, and welcomes candidates from diverse ethnic backgrounds regardless of age, gender, disability, religious or social contexts.\nWe seek to challenge racism, sexism, ageism or homophobia and to remove obstacles facing people with disabilities or from particular socio-economic backgrounds. It is required of everyone in our partnership to reflect these values at all times.\nDisability Access\nIn the past we have worked successfully with many trainees with learning disabilities such as dyslexia and ADHD, as well as those with physical disabilities and mental health challenges.\nIf you have special needs you wish to discuss with us prior to interview, please don't hesitate to contact us so that we can discuss your requirements and how these can be met. Pastoral Support\nWe offer various forms of pastoral support for trainees:\n* We run a 'Healthy Mind, Healthy You!' strand through our Core Training Programme. This looks at how to maintain well-being and build resilience as a trainee;\n* Placement school mentors have responsibility for ensuring the welfare of trainees placed with them;\n* Each trainee will also have a designated member of the YTCA SCITT team to support their well-being during the course. The support will take the form of regular contact via email/phone, half-termly meetings and can also include additional support where required.\nIf you have any specific queries or concerns please do not hesitate to [contact us](http://ytcascitt.co.uk/contact-us/) to discuss them further.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:56:38.081Z","updatedAt":"2021-10-06T20:23:40.540Z"}
