{"id":"c838d473-15e7-4557-9337-ba68d3aca9ed","name":"Hillborough Junior School","code":"18H","type":"lead_school","isAccreditedBody":false,"urn":"109578","ukprn":"10046141","address":{"addressLine1":"The Shire Foundation, Hillborough Junior School, Hillborough Road","town":"Luton","county":"Bedfordshire","postcode":"LU1 5EZ"},"contact":{"website":"https://www.theshirefoundationscitt.org/","email":"tmurphy@shirefoundation.co.uk","telephone":"01582 522121","fullName":"Julie Darmody"},"location":{"latitude":51.8724543,"longitude":-0.4251093},"trainWithUs":"Hillborough Junior School has been judged to be Outstanding by Ofsted. The School Direct (Salaried) training is accredited by the Shire Foundation which is a well-established (since 1994) school-centred teacher training provider working with schools (nursery, primary and special), within a 30 mile radius of Luton. This partnership has built up an excellent reputation in teacher training in the local area, and trainees consistently rate the quality of the course and support as very high. We have a consistently excellent NQT employment rate (95- 100% in recent years), with a high percentage of trainees securing a teaching job within their placement school.\nYou will be employed in a school which is approved for training by the Hillborough Junior School/ Shire Foundation Alliance and your school will work in partnership with us to provide your training and support your professional development.","trainWithDisability":"Accommodation at the Hillborough Junior School base and the partner schools has appropriate disability access. Each year we work successfully with trainees with disabilities and other needs. Our personalised approach to training ensures that support and provision is tailored to each trainee's particular needs, in order to facilitate success during all aspects of the training year.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:56:50.549Z","updatedAt":"2021-09-20T17:45:46.171Z"}
