{"id":"c846f1d3-90ce-4583-bf34-d5f9657c1172","name":"Chadsgrove Training School","code":"17A","type":"lead_school","isAccreditedBody":false,"urn":"117062","ukprn":"10015201","address":{"addressLine1":"Chadsgrove School","addressLine2":"Meadow Road","town":"Bromsgrove","county":"Worcestershire","postcode":"B61 0JL"},"contact":{"website":"http://www.chadsgroveschool.org.uk/web/initial_teacher_training/205751","email":"courses@chadsgrove.worcs.sch.uk","telephone":"01527 871511","fullName":"Deb Rattley"},"location":{"latitude":52.3609833,"longitude":-2.062589},"trainWithUs":"For those seeking the rewarding experience of teaching in special schools, Chadsgrove Training School offers an exceptional opportunity to qualify as a primary teacher, but with additional enhanced skills to effectively teach pupils with SEND in both mainstream and specialist settings.\nYou will train in vibrant schools, alongside supportive colleagues with specialist skills and knowledge. Employment rates on completion of the course are extremely high, with all previous trainees completing the course successfully and progressing to Early Career Teachers (ECT's) in both special and mainstream schools.\n[Our course](https://www.chadsgroveschool.org.uk/web/initial_teacher_training/205751) integrates whole day sessions at the University of Birmingham (which involve a blend of lectures, subject workshops, seminars, tutorials or group work sessions) with school-based training and teaching experience in both mainstream primary school and special school settings, enabling you to gain Primary Qualified Teacher Status (QTS) with particular expertise in special educational needs and disabilities (SEND).\nWe aim to equip teachers of the future with exemplary skills to meet the needs of learners with Special Educational Needs, through providing the highest quality of training experiences to nurture excellent practitioners.\nSchool-based training days focus on a range of topics including curriculum subject teaching and planning, assessment, and understanding of specific SEND. All sessions are delivered by highly experienced practitioners and nationally acknowledged experts in their field.\nOur training partners include a number of special schools and specialist bases, and mainstream primary schools covering south Birmingham, Worcestershire, Sandwell, and South Staffs.","trainWithDisability":"We believe a person is only disabled when confronted by adverse attitudes and environmental barriers, and we aim to provide a positive, supportive and inclusive learning environment. Adults with disabilities are under-represented in the teaching profession and we welcome applications from everyone with a passion and commitment to becoming a teacher.\nWe see training teachers with additional needs as an opportunity to provide role models to our own pupils. Our programme is hosted by schools teaching pupils with a range of physical, medical, sensory and cognitive special educational needs and disabilities.\nAll teacher training providers have a responsibility to ensure equality of access, whilst at the same time ensuring that trainees have the health and physical capacity to teach and will not put children and young people at risk of harm, and a condition of acceptance onto the course will therefore be to satisfy the requirements for Fitness to Teach. Applicants will need to be able to travel independently to the university campus in Edgbaston and to the training schools.\nEvery individual will have different circumstances and needs, and for this reason we welcome confidential discussion of any special arrangements you may need for interview or subsequent school placement.\nEach of our partner schools will be able to provide specific accessibility information for their sites. Information about disability access for postgraduate students at the University of Birmingham can be found [here](http://www.birmingham.ac.uk/students/support/disability/index.aspx)","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-09T20:20:45.807Z","updatedAt":"2021-09-17T15:13:25.841Z"}
