{"id":"c8c19866-6d7e-4e45-9461-9379e4ca53b0","name":"Barr Beacon SCITT","code":"2AX","type":"scitt","isAccreditedBody":true,"ukprn":"10053216","address":{"addressLine1":"Barr Beacon SCITT","addressLine2":"Old Hall Lane","town":"Walsall","county":"West Midlands","postcode":"WS9 0RF"},"contact":{"website":"http://bbscitt.co.uk/","email":"info@bbscitt.co.uk","telephone":"0121 366 6600","fullName":"Kevin Shilton"},"location":{"latitude":52.561104,"longitude":-1.915301},"trainWithUs":"Welcome to Barr Beacon SCITT. We are an Ofsted Outstanding provider of Initial Teacher Training with a thriving partnership of secondary and primary schools in the West Midlands and Warwickshire. We aim to develop the very best classroom practitioners who will go on to inspire, influence and shape the lives of future generations for years to come. This aim underpins everything about our training programme and we're incredibly proud of what we do. At Barr Beacon SCITT we know what it takes to make a great teacher. We offer a well-established training, mentoring and professional development programme which leads to recommendation for QTS and a PGCE with the opportunity to gain up to 60 masters credits. Our Secondary Training:\n* is a full-time secondary training programme. * consists of a main and contrasting placement school, a primary school experience, a carousel week with bespoke training by our partner schools and our up-to-date and detailed training curriculum. * The University of Worcester delivers the PGCE sessions on site at Barr Beacon SCITT enabling you to gain a PGCE with up to 60 masters credits. Our Primary Training:\n* is run in partnership with Ryders Hayes School. * offers full-time 3-7 and 5-11 programmes.\n* includes a main and contrasting placement school, a secondary school experience, bespoke training opportunities tailored to you and our up-to-date and detailed training curriculum.\n* The PGCE is awarded by Birmingham City University and is delivered on site enabling you to gain up to 60 masters credits","trainWithDisability":"Barr Beacon SCITT is committed to promoting and practicing equality of opportunity, valuing diversity and eliminating harassment and discrimination. We are an inclusive organisation which welcomes and treats both staff and trainees fairly and equally regardless of age, gender, sexual orientation, disability, race, ethnic origin or nationality. Our workforce should be representative of the communities we serve. At Barr Beacon SCITT we provide opportunities for applicants who are attending an assessment day to identify any special arrangements that they may require in advance of this day. It is important that communication is made by applicants in advance of assessment days so that appropriate time and resources can be discussed and made available. Details of how this is done can be found on Page 7 of the assessment day invitation pack that applicants are sent. Trainees can be assured that reasonable adjustments to the assessment process, the course and the documentation will be made to ensure that those trainees with a disability are not disadvantaged.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:48:37.554Z","updatedAt":"2021-10-14T16:50:04.361Z"}
