{"id":"c9b7962a-9ed3-447e-9ca5-7d06b9d50760","name":"Devon and Cornwall Cooperative Alliance","code":"2HG","type":"lead_school","isAccreditedBody":false,"urn":"145336","ukprn":"10037449","address":{"addressLine1":"Crowndale Road","town":"Tavistock","county":"Devon","postcode":"PL19 8DD"},"contact":{"website":"http://tavistockcollege.org","email":"p.ruse@tavistockcollege.org","telephone":"1822614231","fullName":"Philip Ruse"},"location":{"latitude":50.5304798,"longitude":-4.1595082},"trainWithUs":"The Devon and Cornwall Cooperative Alliance (DACCA) is part of the Dartmoor Teacher Training Partnership, run by the Dartmoor Multi Academy Trust. Working in collaboration with Plymouth Marjon University, we have many years of experience of offering a high-quality secondary education training route in a wide range of subjects. With our route you can train while you teach to earn your PGCE and Qualified Teacher Status (QTS). Our programme is aimed at nurturing the teachers of tomorrow and the leaders of the future.\nThe Dartmoor Multi Academy Trust is a forward-thinking family of 17 schools. We are a cross phase Trust of both primary and secondary schools with over 5000 children and young people and over 720 staff. Our mission is to provide the highest possible quality of education for local children and young people, in order to ensure that all pupils, regardless of their background, are able to succeed and flourish. As a Trust we are committed to the development of all our staff; with opportunities for everyone connected to the Trust to grow and develop and therefore fulfil their ambitions. The co-operative values, as defined by the international co-operative alliance, underpin the work in all of our schools. Learn more about our Trust by visiting our website: https://www.dartmoormat.org.uk/\nBy training to teach with us, you'll be joining a forward-thinking, collaborative network of teachers across our partnership of schools.","trainWithDisability":"Schools within our partnership have disabled access and a fully inclusive environment would be guaranteed for all potential trainee teachers. DACCA and Dartmoor Multi Academy Trust are committed to removing barriers so that all people can achieve and succeed in our schools, whether that is students, teachers, support staff or trainee teachers. Candidates are supported as appropriate when learning needs have been disclosed.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"a4e84530-e1f1-47c6-b57e-ec693d629637","code":"P63","name":"Plymouth Marjon University","description":"Plymouth Marjon has been training teachers for over 180 years. It has links with over 600 schools giving a broad and varied input into teacher training, and giving you an amazing choice of placements and experiences.\\r\\n\\r\\nFive years after graduating, Plymouth Marjon students typically earn around £2000 more than education graduates at other universities in the South West and Wales.\\r\\n\\r\\nThe Guardian ranks Plymouth Marjon the 6th best university in the UK for education courses, out of 80 universities, and 1st in Devon and Cornwall."}],"createdAt":"2021-07-06T17:56:58.105Z","updatedAt":"2021-09-22T22:08:05.685Z"}
