{"id":"c9e18ca5-0918-4d19-b3be-76c64166d9e6","name":"The Primary First Trust","code":"2A3","type":"lead_school","isAccreditedBody":false,"urn":"140320","ukprn":"10043923","address":{"addressLine1":"The White House","addressLine2":"Clifton Marine Parade","town":"Gravesend","county":"Kent","postcode":"DA11 0DY"},"contact":{"website":"https://www.theprimaryfirsttrust.co.uk","email":"hr@theprimaryfirsttrust.co.uk","telephone":"01474 565903","fullName":"Sheena Hamilton"},"location":{"latitude":51.4455696,"longitude":0.3574636},"trainWithUs":"Welcome to The Primary First Trust, a Trust that truly celebrates and nurtures the diversity and distinctiveness of its partner schools. We are a growing network of 10 individual primaries across Bexley, Gravesham and Medway. All are at different points in their journey - each with a unique context, considerable strengths and specific opportunities. Our refreshingly collaborative way of working, enviable track record and deep understanding of primary-based learning gives us an unmistakeable edge in driving up standards in every area of school life.\nWe can offer: - Access to excellent practice in teaching and learning - Access to a diverse range of school settings - Excellent support from trained and experienced mentors School Based Training - The majority of your training will take place within the Trust’s schools. The training programme will be personalised to the individual's professional needs but will include training on the following areas: teaching and learning, curriculum, assessment, working with parents and the community. All training is closely aligned to support the trainee achieve the Teachers’ Standards and is delivered by highly effective teachers from both the Trust and also from the university.\nCandidates will have the opportunity to work alongside experienced outstanding teachers. Support and mentorship will be given by senior teachers. Although candidates will have a base school, there will be many opportunities for cross-school training and will include teaching experience within another school in the Trust.","trainWithDisability":"We recognise the value of diversity within the community and our workforce and the contribution made by people from different backgrounds.\nWe uphold our values, ensuring our employment is accessible to everyone and that we actively value and celebrate the wide variety of lifestyles and cultures within the community.\nWe believe we have a strong moral and social duty to recognise any\nunlawful discrimination, take steps to challenge prejudice and discrimination and promote equality.\nWe welcome applications from disabled people and are committed to helping disabled students succeed. The University of Greenwich has a Disability & Dyslexia Centre which can provide assistance at any stage in your application process and at any point in your studies. Advice and guidance is based on your individual requirements, and includes support for students with mental health needs and long-term medical conditions.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"b3681bbc-2e2a-49c3-aa4e-e453a8d0e4a5","code":"G70","name":"University of Greenwich","description":"The Primary First Trust works with the Royal Borough of Greenwich in partnership with the University of Greenwich as the registered training provider for the Apprenticeship Teacher programme. The university, which has been rated outstanding by Ofsted. has a long history of teacher training, going back over 100 years at the Avery Hill Campus. Employment rates are consistently above national and London averages. Training is delivered by highly effective teachers from both the Trust and also from the university.\\r\\nThrough the University based sessions, you will acquire a deep understanding of the primary curriculum and how children learn."}],"createdAt":"2021-07-06T17:53:54.906Z","updatedAt":"2021-09-15T18:01:36.939Z"}
