{"id":"ca0b393d-20ff-4534-b4bf-b26c5992f16d","name":"School Direct Reading Area","code":"4F9","type":"lead_school","isAccreditedBody":false,"address":{"addressLine1":"Dee Road","addressLine2":"Tilehurst","town":"Reading","county":"Berkshire","postcode":"RG30 4BE"},"contact":{"website":"www.englishmartyrs.reading.sch.uk/key-information/school-direct-at-english-martyrs","email":"head@englishmartyrs.reading.sch.uk","telephone":"0118 9375466","fullName":"Catherine Doberska"},"location":{"latitude":51.4536906,"longitude":-1.0198992},"trainWithUs":"We are an established School Direct cluster, which was previously based at Christ the King Catholic primary school in Reading. Our cluster is made up of a group of primary schools in the Reading area. We want our trainees to become the very best teachers they can possibly be, so we offer a programme of supplementary training to complement the training provided by Reading University. This is mainly in the Autumn term, for half a day a fortnight. All trainees need to work in at least two schools over the year and our group is both large enough and varied enough for everyone to have a worthwhile contrasting experience. For example, if the main school is a large faith school in an urban environment, the second placement might be a small community school in a rural location. Since the cluster started, we have successfully trained more than 30 teachers who have gone on to work in local schools, often in the school in which they trained. We are committed to helping our trainees prepare well for long and happy careers.\nOur accredited body is Reading University. The University works closely with its schools. It devises its programme of training, as well as the pattern of its delivery, in consultation with the headteachers of the lead schools in the partnership.","trainWithDisability":"Our cluster is committed to supporting trainees with disabilities. We will do our utmost to ensure all candidates are treated fairly and equally in both the selection process and on the training programme. While acknowledging that teaching can be physically and mentally demanding we welcome applications from candidates with restricted mobility, with visual or hearing impairments and with conditions like dyslexia and autism. We have successfully worked with dyslexic and autistic trainees in the past as well as others who have had mental health needs. If you have what it takes to be a teacher we would like to support you.","accreditedBodies":[],"createdAt":"2021-07-06T17:54:19.226Z","updatedAt":"2021-07-06T17:54:19.226Z"}