{"id":"ca89585b-587b-41d7-9432-e554c0410970","name":"Think North East School Direct Partnership","code":"4B4","type":"lead_school","isAccreditedBody":false,"urn":"147670","ukprn":"10005732","address":{"addressLine1":"Sedgefield Community College","addressLine2":"Hawthorn Road","town":"Sedgefield","county":"County Durham","postcode":"TS21 3DD"},"contact":{"website":"www.think-northeast.com","email":"enquiries@think-northeast.net","telephone":"01740 617 777","fullName":"Sarah Armstrong"},"location":{"latitude":54.6574211,"longitude":-1.4430023},"trainWithUs":"Think North East is a teacher training partnership comprising five schools located across County Durham, Sunderland and Newcastle upon Tyne. The partnership is led by Sedgefield Community College, working alongside Academy 360, Durham Johnston Comprehensive School, Excelsior Academy, and Wellfield School.\nAs our name suggests, we are a partnership with a shared commitment to giving careful thought to all aspects of our initial teacher training programme. We strive to develop teachers who are able to think critically and creatively about their practice in order to make rapid progress in their role as a teacher.","trainWithDisability":"Admission to the course is subject to a satisfactory medical report as you are required to meet the standards for 'Fitness to Teach'. It is important that you disclose any medical condition or disability so that we can look at the best way of supporting you if you are offered a place to train with us.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"accreditedBodies":[{"id":"f3a93938-0208-4680-ac22-b564b18ff02b","code":"D86","name":"Durham University","description":"All of our ITT programmes are accredited by Durham University, which is one of the leading departments for education in the UK and regularly features in the top five in national university league tables and rates highly in world rankings.\\r\\n\\r\\nDurham’s School of Education leads the way in high quality research and is joint first in the UK for world-leading research impact. Together with their OFSTED outstanding rated Initial Teacher Training provision, they are a major contributor in the field of education."}],"createdAt":"2021-07-06T17:49:53.399Z","updatedAt":"2021-10-12T18:07:06.427Z"}
