{"id":"caf4e278-c55d-4658-9f69-a5ededf53bc1","name":"Ormiston Sir Stanley Matthews Academy","code":"1UV","type":"lead_school","isAccreditedBody":false,"urn":"136145","ukprn":"10030652","address":{"addressLine1":"OSSMA","addressLine2":"Beaconsfield Drive","town":"Blurton","county":"Stoke-on-Trent","postcode":"ST3 3JD"},"contact":{"website":"http://www.ormistonsirstanleymathewsacademy.co.uk","email":"k.a.pickin@keele.ac.uk","telephone":"01782 882200","fullName":"Head of Admissions"},"location":{"latitude":52.974568,"longitude":-2.16427},"trainWithUs":"Ormiston Sir Stanley Matthews Academy (OSSMA) is judged to be a ‘good’ school and are committed to teaching future professionals. We work within a hub of schools which include:\nThe Co-operative S-o-T Academy, Endon High School, Haywood Academy, Ormiston Horizon Academy, Ormiston Meridian Academy, Trentham Academy and Thistley Hough Academy.\nData from last year\n94% successfully completed the programme\n90% gained employment 100% of the cohort achieved ‘outstanding’ or’ good’\n96% of our trainees rated our teacher training programme as ‘outstanding’ or ‘good’\nWe work closely with The OAKS as our accredited provider. This is a genuine partnership between our hub of schools, The OAKS and Keele University, which ensures relevant and up to date training. The OAKS and the Stoke hub of schools believes that we are an extremely caring and friendly organisation and will, at all times, provide help, encouragement and support, whenever it is needed. At the end of the programme you will obtain QTS from The OAKS and a PGCE Academic Award from Keele.\nYou are important to us and many support structures are in place for this challenging, but very rewarding course. It is our aim to produce highly motivated, creative, successful and reflective teachers. Such teachers, we know, will be in great demand both in the local region and nationally.\nYou will be placed in two placements, where you will put theory into practice, including observation teaching in alternative educational settings such as EAL, PRU, Special and Independent Schools.","trainWithDisability":"We have a dedicated support tutor, who supports our trainees with disability or any other need. It is important to state that they do not assess your teaching performance, this gives you the opportunity to speak honestly about your needs, but also enables the support tutor to have the freedom to help you and visit you; whether you are in placement school or here at The OAKS. This includes signposting through to developing individualised learning plans which may extend beyond the course date to enable you to successfully complete the programme.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"7f349baa-f4ef-4fd5-b228-fcc56247e9b9","code":"24P","name":"The OAKS (Ormiston and Keele SCITT)","description":"The OAKS is an Ofsted Outstanding (2016) and innovative SCITT (School Centred Initial Teacher Training programme) which links Keele University and OAT (Ormiston Academies Trust) with a long established partnership of schools in five local authorities: Staffordshire, Stoke on Trent, Shropshire, Birmingham and Cheshire.\\r\\n\\r\\nThe OAKS course is based in the beautiful green campus of Keele University and all trainees will qualify with a Keele University PGCE and QTS from The OAKS.\\r\\n\\r\\nOur programme was rated 17th out of over 200 Teacher Training providers across the country in the Good Teacher Training Guide 2017."}],"createdAt":"2021-07-06T17:48:26.862Z","updatedAt":"2021-09-28T18:54:56.461Z"}
