{"id":"cb186f5f-146a-47ce-be65-3f0af812532c","name":"Littleton CofE Infant School","code":"2HR","type":"lead_school","isAccreditedBody":false,"urn":"125231","ukprn":"10079622","address":{"addressLine1":"Littleton CE Infant School","addressLine2":"Rectory Close","town":"Shepperton","county":"Surrey","postcode":"TW17 0QE"},"contact":{"website":"http://www.littleton.surrey.sch.uk","email":"admin@teachinglondon.org","telephone":"2079321126","fullName":"Rachel Barton"},"location":{"latitude":51.4067579,"longitude":-0.4609073},"trainWithUs":"We are a small infant school underpinned by our Christian ethos and core values. We are a ‘Learning Community,’ striving at every level to be reflective and committed to improving and growing. We have high aspirations for all our children both academically and pastorally. We place great emphasis on ‘Learning to Learn’, equipping our children to leave with the skills to meet the challenges ahead. We have an exciting enquiry based curriculum that engages and stimulates all our children. We offer a Forest School curriculum, working with our community to enrich the children’s learning experiences. As a small school, we nurture and develop each child as a unique individual and develop effective relationships with parents/carers. As a Lead school we work with a diverse range of general primary schools in varying locations, to support our trainees.","trainWithDisability":"Littleton CE Nursery and Infant School is an inclusive school and learning community. We welcome all applicants and we will make all reasonable adjustments to accommodate trainees. We are a school all on one level with good disability access.\nTeaching London: LDBS SCITT has a degree of step-free access, but as the building was a Victorian school, we are unable to fully accommodate wheelchair access. We are always willing to discuss, and where possible, adapt to meet individual needs.\nThe well-being of our trainees is paramount, which is why you will be automatically enrolled into the Employee Assistance Programme with the Education Support Partnership. This provides 24/7 individual support and counselling, in addition to our in-house advice and support.\nWe also have experience in supporting trainees with a diagnosis of dyslexia and are able to offer specialist support on the course.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"720894da-360a-4f7a-9835-7ce7beb3c6de","code":"L59","name":"Teaching London: LDBS SCITT","description":"An Outstanding provider (Ofsted: 2017), Teaching London puts pupils at the heart of your training. The depth and breadth of our programme enables you to gain the confidence and competence to develop into a highly skilled, responsive teacher. Exciting, interactive and rigorous centre-based sessions will inform your classroom practice, led by inspiring and experienced tutors. Your growth as a reflective practitioner is underpinned by the PGCE element, routed in school-based and current research. \\r\\n\\r\\nTraining teachers for 20+ years, we are highly effective in our role with 76% of trainees graded as Outstanding at the end of their training in 2017-18."}],"createdAt":"2021-07-06T17:56:39.499Z","updatedAt":"2021-07-28T00:32:53.537Z"}
