{"id":"cb360fcd-0c3a-4fc2-a4df-521e9475cd1c","name":"Bright Futures SCITT","code":"G65","type":"scitt","isAccreditedBody":true,"ukprn":"10046414","address":{"addressLine1":"c/o AGGS","addressLine2":"Cavendish Road","town":"Bowdon","county":"Altrincham","postcode":"WA14 2NL"},"contact":{"website":"http://www.bfet.co.uk/scitt/","email":"admin@scitt.bfet.uk","telephone":"0161 823 7073","fullName":"K Hodgson"},"location":{"latitude":53.381169,"longitude":-2.359779},"trainWithUs":"The Bright Futures SCITT is a partnership of primary and secondary schools, colleges, universities and organisations from across the North-West, who share their knowledge, skills, expertise and experience to achieve a common goal of continuous educational improvement. \n\nThe Bright Futures SCITT aims to promote excellence in all aspects of education through focused, central and school-based training activities. Trainees are based in our partner schools for the duration of the programme.\n\nWe believe that every child deserves the very best start in life, irrespective of background or circumstance. We are committed to training teachers who can provide the next generation with the opportunity to develop happy and successful futures.\n\nTrainees who complete our programme are “regarded as an asset by employment schools because they are well prepared to begin their career in teaching” (Ofsted 2017). \nOn average 95% of trainees gain employment at the end of the programme and are able to make a difference to young people in schools across the country.\n\nKey elements of our training programme\n* Training in school from the first day\n* Two contrasting schools experiences to prepare you for employment\n* A trained and dedicated mentor\n* Face to face subject knowledge training\n* Leads to Qualified Teacher Status (QTS)\n* Post Graduate Certificate of Education delivered by our partner, the University of Manchester\n\nFind out more about the Bright Futures SCITT http://www.bfet.co.uk/scitt/","trainWithDisability":"It is the goal of the Bright Futures SCITT to recruit people of outstanding potential, irrespective of their background and to ensure that the admission process is transparent, has minimal barriers to entry, is based on merit and potential, and is fair with regards to diversity.\nThe Bright Futures SCITT will not discriminate against a disabled person on the grounds of disability :\n* in the arrangements i.e. application form, interview or arrangements for selection for determining to whom a place should be offered; or\n* by refusing to offer, or deliberately not offering the disabled person a place for reasons connected with their disability.\nWherever possible, The Bright Futures SCITT will make reasonable adjustments to hallways, passages and doors in order to provide and improve means of access for disabled candidates. However, this may not always be feasible, if circumstances render such adjustments as being beyond what is reasonable.\nWe are committed to taking positive action to welcome people with disabilities who have met the requirements, and to enable them to meet their full potential\nConsideration will be given to all planned activities, resource allocation and procedures to ensure that we can enable disabled trainees full participation in all aspects of the academic, work-based and social activities of the course.\nRead our [Equal Opportunities Policy]( http://www.bfet.co.uk/wp-content/uploads/2021/07/BF_SCITT-Equal-Opportunities-Policy.pdf","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:48:13.829Z","updatedAt":"2021-10-13T20:20:36.327Z"}
