{"id":"cb55fc52-1e77-49ce-b7c7-de75c76b13a1","name":"Shepway Teacher Training","code":"1NG","type":"lead_school","isAccreditedBody":false,"urn":"118505","ukprn":"10073318","address":{"addressLine1":"Sandgate Primary School","addressLine2":"Coolinge Lane","town":"Folkestone","county":"Kent","postcode":"CT20 3QU"},"contact":{"website":"www.shepwayts.co.uk","email":"office@shepwayts.co.uk","telephone":"01303 257280","fullName":"Mr Matt Dickenson"},"location":{"latitude":51.079905,"longitude":1.1516943},"trainWithUs":"Why Train with Shepway Teacher Training?\nWe look for candidates with the following strengths:\n* a passion for learning and an interest in/knowledge of education\n* excellent communication skills (both written and verbal)\n* the ability to stay calm and deal with stressful situations\n* a drive to succeed and resilience in the face of difficulty\n* the ability to be an equal part of a team\n* experience of managing teams and other adults\n* a sense of humour and the charisma to inspire and motivate our pupils\n* reflective practitioners who respond positively to feedback\n* interests outside of education\nWe are interested in those potential trainees who are motivated by a desire to see children thrive in their education and a commitment to see things through.\nWe offer a one-year, full-time, teacher training programme - a distinctive and practical school-centred pathway into the profession of teaching. You will work alongside experienced teachers, who will act as mentors. You will have the opportunity to work in two good and outstanding schools in the Shepway district or sometimes further afield where this matches your needs as a trainee.","trainWithDisability":"All reasonably practicable steps will be taken to ensure that problems relating to access or equipment do not debar disabled applicants from employment. Candidates who indicate a disability on their application form and are invited to a recruitment and selection day will be contacted in advance to discuss whether any particular access or other requirements are required, such as large print documents or wheelchair access.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:47:13.322Z","updatedAt":"2022-01-19T22:16:01.730Z"}
