{"id":"cb7a6a44-a0ab-4db1-83e9-b580d249dea6","name":"Teach North: County Durham","code":"2G9","type":"lead_school","isAccreditedBody":false,"urn":"139823","ukprn":"10042412","address":{"addressLine1":"Outwood Conference Centre - Tees Valley, Outwood Academy Acklam","addressLine2":"Hall Drive","town":"Middlesbrough","county":"North Yorkshire","postcode":"TS5 7JY"},"contact":{"website":"https://teachnorth.com/","email":"teachnorth@oie.outwood.com","telephone":"01642 811000","fullName":"Nina Catalfamo"},"location":{"latitude":54.5420546,"longitude":-1.2440453},"trainWithUs":"Teach North offers a School Direct programme that strives to develop, support and celebrate excellent trainee teachers who are well-prepared for the profession. \n\nWe are an integral part of a high-performing multi-academy trust, Outwood Grange Academies Trust. We embrace the opportunity to ensure that all children, irrespective of their starting point, receive an excellent education.\n\nWe relish the opportunity to be part of the much needed regeneration of the areas we work in. We are serious about the part we have to play in regenerating the areas we serve by placing an outstanding school at the heart of the community. \n\nTo do this, we ensure that:\n\n- students are always at the forefront of what we do, so we can help them to reach their potential\n- that all our staff strive to be experts in our respective fields\n- together, as a trust, we are obsessive about attaining the highest standards, thereby enhancing children’s life-chances.\n\nQuite simply, we want to be known for placing:\n\nStudents first; raising standards and transforming lives.","trainWithDisability":"We offer disabled access across our family of schools and invite all applicants to discuss their individual needs with us so that we can place you in the most appropriate schools and academies for your training year.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:52:19.903Z","updatedAt":"2021-10-03T12:33:03.186Z"}
