{"id":"cc291444-fd22-49ae-9190-c74d20e10083","name":"Loreto School Direct Alliance","code":"1H2","type":"lead_school","isAccreditedBody":false,"urn":"138464","ukprn":"10038100","address":{"addressLine1":"Dunham Road","town":"Altrincham","county":"Cheshire","postcode":"WA14 4AH"},"contact":{"website":"https://www.loretogrammar.co.uk/","email":"abaker@loretogrammar.co.uk","telephone":"1619283703","fullName":"Enquiries"},"location":{"latitude":53.3886614,"longitude":-2.3567018},"trainWithUs":"Loreto Grammar is an all-girls, high-achieving Catholic grammar school with academy status in Altrincham, in the borough of Trafford. Pupils are from the top 50% of the ability range in and beyond Trafford. The school serves pupils from the dioceses of Shrewsbury and Salford from a wide range of social backgrounds. It is an outstanding Catholic school whose values are rooted in those of its founder, Mary Ward. Her words 'Women in time to come will do much' provide the motto of the school. The most recent Ofsted judged our school as 'outstandingly effective' and noted its 'excellent atmosphere in which girls are challenged to think and learn'. The Loreto education nurtures the whole person, recognised in Ofsted's comment that 'the students' enjoyment is palpable'.\nThe Professional Mentor has many years' experience in leading the School Direct programme. The Subject Mentors work as a team, resulting in an excellent, well-organised and supportive programme, as is evidenced in previous trainees' evaluations.","trainWithDisability":"At Loreto Grammar School, we take pride in the inclusive and supportive nature of our learning environment: there are no barriers to learning; each student is challenged and supported to achieve her personal best; different gifts are recognised and diversity is celebrated. Loreto Grammar School aims to provide an inclusive learning environment. We currently support girls with: • Cognition and learning needs, such as dyslexia; • Communication and interaction needs, such as Autistic Spectrum Condition;\n• Sensory needs, such as hearing or sight impairments; • Physical disabilities; • Social, emotional and mental health needs, such as Attention Deficit Hyperactivity Disorder (ADHD) and anxiety; • Medical needs which may be considered SEND due to their impact on learning and provision, such as Type 1 Diabetes.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:56:50.201Z","updatedAt":"2021-10-11T21:34:01.351Z"}
