{"id":"cc6609d9-1db9-4a79-bb76-a1f1471a7f1d","name":"The Northworthy Alliance","code":"1L7","type":"lead_school","isAccreditedBody":false,"address":{"addressLine1":"Long Eaton School","addressLine2":"Thoresby Road","town":"Long Eaton","county":"Nottingham","postcode":"NG10 3NP"},"contact":{"website":"http://www.northworthytrust.org.uk/alliance","email":"teachertraining@northworthytrust.org.uk","telephone":"0115 973 2438","fullName":"Initial Teacher Training Coordinator"},"location":{"latitude":52.8922933,"longitude":-1.2804243},"trainWithUs":"The Northworthy Alliance is a fantastic place to work and train with an excellent reputation for teacher training. We provide bespoke school based training in collaboration with the University of Derby. Our Alliance has a straightforward, but powerful vision – ‘Nurture, Challenge, Aspire'.\nWe have a strong record in training teachers; last year 100% of our trainees completed the year as ‘good’ or ‘outstanding’ teachers with high levels of employment and around 1/3rd securing employment across the trust.\nYou would spend most of the programme in a main placement school, where you gradually take on classes, supported by an experienced mentor and the school coordinator. You are given membership to your subject professional association and also allocated a Subject Specialist Expert, who leads sessions on the best approaches to teaching your subject. The weekly training day alternates between the university and alliance hub base at Long Eaton; the perfect blend of academic rigour and practical classroom practice.\nWe offer a range of school placement experiences across our alliance in Derby City and Derbyshire. The schools vary in size and student profile, enabling us to match you with the right school. We also offer contrasting and enhanced placements, so that you have a rounded experience, such as teaching in alternative provision, primary, SEN schools and even overseas!\nFor more information, please visit our website [Northworthy Trust Teacher Training](http://www.northworthytrust.org.uk/teacher-training)","trainWithDisability":"Accessibility varies from site to site, please contact us directly if you would like to discuss your requirements and how we can meet them.","accreditedBodies":[{"id":"aa023df3-b71e-4249-b9c4-41fca8bd135e","code":"D39","name":"University of Derby","description":"Our School Direct course is delivered in collaboration with the University of Derby. For more information, please visit the University of Derby Website:\\r\\n\\r\\n[Secondary School Direct](https://www.derby.ac.uk/postgraduate/teacher-training-courses/pgce-secondary-school-direct/)"}],"createdAt":"2021-07-06T17:48:54.072Z","updatedAt":"2021-07-06T17:48:54.072Z"}