{"id":"cc8f0934-26f1-4204-8e16-276b0678f4ff","name":"Aireborough Partnership","code":"2JF","type":"lead_school","isAccreditedBody":false,"urn":"107809","ukprn":"10073040","address":{"addressLine1":"Rawdon St. Peter’s Primary School","addressLine2":"Town Street","town":"Rawdon","county":"Leeds","postcode":"LS19 6PP"},"contact":{"email":"e.bevan@rawdonstpeters.co.uk","telephone":"1132504201","fullName":"Emily Bevan"},"location":{"latitude":53.8500804,"longitude":-1.6704895},"trainWithUs":"The Aireborough Partnership comprises of 7 Primary schools situated locally to each other. These schools include:\n* Rawdon St. Peter's C/E Primary School\n* Yeadon Westfield Infant School\n* Yeadon Westfield Junior School\n* Ss. Peter and Paul Catholic Primary School\n* Queensway Primary School\n* Rawdon Littlemoor\n* Hawksworth C/E Primary School\nAs a group of schools, we pride ourselves on the ethos of our schools, the strong links we have developed with each other, and the supportive nature of the staff in our teams. Schools Direct offers a highly effective route to becoming a successful Primary School practitioner. All schools pride themselves in providing high quality education for their pupils. Supported effectively by a school based mentor, you are treated as a member of the school staff team from day one. You will work with good and outstanding teachers in an assigned class, learning through observation and obtaining ongoing feedback to make sure you reach your full potential during the course of your placements, supporting your individual needs and ongoing professional development. We are keen to recruit trainees who share the same commitment and vision for excellence and enjoyment in education. After a year's successful training, you will achieve Qualified Teacher Status. We will support you through the application process when applying for jobs at the end of the course. We also deliver bespoke training throughout the year delivered by practitioners with up to date pedagogy.","trainWithDisability":"We believe that teachers with disabilities make an important contribution to schools, both in the classroom and in shaping the wider culture and ethos of the school they work in. We adhere to The Equality Act 2010 and Special Educational Needs and Disability Act 2001, which require teacher training providers to ensure they are not discriminating against applicants with disabilities or special educational needs (SEN).\n\nAll of our partnership schools value diversity and the unique contribution that all their staff and trainees bring.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"154509e2-743e-4f0b-9d99-396393aa57ff","code":"L27","name":"Leeds Beckett University","description":"Leeds Beckett University is a well established University who have been involved in training teachers of the future for many years. They provide trainees with the theory of teaching which pairs perfectly with the hands on school experience we provide. Through masters modules and assignments, trainees also qualify from the course with a third of a masters. Credits can be built upon in subsequent years so that a full masters degree can be obtained."}],"createdAt":"2021-07-06T17:55:23.672Z","updatedAt":"2021-10-06T16:35:37.560Z"}
