{"id":"cca26a08-0948-4523-ac77-893f7de1821e","name":"Ilkley All Saints’ Teacher Training Partnership","code":"2DX","type":"lead_school","isAccreditedBody":false,"urn":"107309","ukprn":"10068642","address":{"addressLine1":"Easby Drive","town":"Ilkley","county":"West Yorkshire","postcode":"LS29 9BE"},"contact":{"website":"https://www.allsaintsilkley.bradford.sch.uk/teacher-training/","email":"cwhitehead@allsaintsilkley.bradford.sch.uk","telephone":"1943607852","fullName":"Christopher Whitehead"},"location":{"latitude":53.9272155,"longitude":-1.8327398},"trainWithUs":"Unique teacher training programme like no other offered at All Saints' Primary School, Ilkley. We look to embrace innovations in teacher training to make sure the next generation of teachers have the most up to date skills to enter the classroom.\nWe offer two Teacher Training programmes; PGCE Primary (3-7) and PGCE Primary (5-11). Both courses provide you with supported, school-based experiences, organised into three teaching placements. Your first placement will be in a host school, followed by a second and third placement which will be in a home school. These placements will give you the training experiences and access to specialist support that will develop your confidence for the start of your teaching career. You will receive teaching from the university academic staff and training under the direction of the All Saints’ Primary School Teacher Training Partnership. Through our partnership, you will have access to specialist leaders who will contribute to your professional development. We have a range of professionals who can develop your skills and practice in specific areas, including: EYFS, Computing, SEND, Growth Mindsets and Assessment. In addition, you will supported by an experienced Lead Mentor and outstanding practitioners.","trainWithDisability":"We welcome applications from candidates with disabilities and other needs.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"accreditedBodies":[],"createdAt":"2021-07-06T17:51:07.242Z","updatedAt":"2021-10-08T15:22:58.180Z"}
