{"id":"ccbef326-7973-4a3b-b5ee-25fdbb74efe8","name":"East Lindsey ITT Partnership","code":"4E2","type":"lead_school","isAccreditedBody":false,"urn":"145527","ukprn":"10052840","address":{"addressLine1":"East Lindsey ITT Partnership","addressLine2":"Coningsby St Michael’s CofE Primary School, School Lane","town":"Coningbsy","county":"Lincolnshire","postcode":"LN42ET"},"contact":{"website":"www.eoettc.com","email":"traintoteach@eoettc.com","telephone":"7379404767","fullName":"Jenny Hutchinson"},"location":{"latitude":53.1040361,"longitude":-0.1754747},"trainWithUs":"The East Lindsey Schools ITT Partnership work with a range of schools within the local area.\nWe strongly believe that the best place to train to be a teacher is in a school (it seems obvious!), so we work with local schools to ensure that our trainees receive the BEST in school training, to ensure they are fully prepared to be an amazing teacher. We will guarantee that each of your placements will be in your local area, as having a work life balance and time with your family matters to us.\nThe course is a fantastic opportunity to be trained and supported by experienced teachers in outstanding and supportive school environments - teachers training teachers! The diversity of our partnership of schools can offer you many different experiences: working in both small and large rural primary schools, church and community schools. Previous trainees have stated that they feel very well supported and extremely well prepared for their NQT year, as a result of the range of experiences and training they undertake; see testimonials here: https://www.eoettc.com/about-us/testimonials Also read East of England's Teacher Trainings recent Ofsted report which outlines the impact of the Outstanding Leadership within the partnership: https://www.eoettc.com/ofsted-report;they are the only teacher training provider within the region with an Ofsted outstanding rating.","trainWithDisability":"We have a strong track record in successfully working with trainees with a wide range of disabilities and additional needs. During our recent Ofsted Inspection, one of the findings was that: ‘Leaders pay close and extensive attention to the welfare of trainees. They respond rapidly and effectually to those needing support’ (Ofsted 2018). After recruitment, we ask trainees to complete a ‘Fitness to Teach’ questionnaire which asks if any adjustments are required, we also require trainees to be assessed by an occupational health specialist. If appropriate, a ‘Wellbeing Plan’ will be created which is bespoke to the trainee’s needs; this will be regularly reviewed. We will then work closely with the trainee to make adjustments where we possibly can (for example, PowerPoint presentations in advance or printed on coloured paper). Declaring any disabilities will not disadvantage trainees and their application; we make any appropriate adjustments and make sure that trainees are placed in a supportive training environment.\nWe regularly ensure that these adjustments are maintained and re-assessed, to ensure that needs are continually met. Disability access and provision are in accordance with legal requirements in all our settings. Some settings have further specialist provision and further details can be acquired by contacting the individual setting via their website contact details.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:49:42.893Z","updatedAt":"2021-09-03T22:12:10.939Z"}
