{"id":"cd45e2ae-fa2f-4863-8dbf-33eb0a279bde","name":"Oriel ITT Partnership","code":"2LR","type":"lead_school","isAccreditedBody":false,"urn":"134042","ukprn":"10016856","address":{"addressLine1":"Matthews Drive","addressLine2":"Maidenbower","town":"Crawley","county":"W Sussex","postcode":"RH10 7XW"},"contact":{"website":"https://www.oriel.w-sussex.sch.uk/","email":"heveritt@oriel.w-sussex.sch.uk","telephone":"01293 880350","fullName":"Helen Everitt"},"location":{"latitude":51.1065268,"longitude":-0.1582535},"trainWithUs":"Do you aspire to be an outstanding teacher? Do you want the opportunity to train alongside exceptional teachers in successful and innovative schools? The Oriel High School ITT Partnership is seeking to appoint highly motivated and qualified graduates with a passion for their subject, who are committed to training to teach in the classroom through the school based training route, School Direct.\nSchool Direct training places are available in the following partner schools\n*Oriel High School\n*The Forest School\n*The Holy Trinity Church of England School\n*Ifield Community College\n*Oakwood School\n*Oathall Community College\nOur programmes offer:\n*The chance to train alongside, and work in partnership with experienced and innovative current practitioners.\n* A dedicated school based mentor who, alongside other teachers based in your chosen school and tutors at the University of Brighton, will provide targeted feedback and guidance throughout the programme.\n* The opportunity to train with like-minded individuals who demonstrate the same enthusiasm and motivation for teaching and can provide peer support and professional dialogue.\n* Both subject specific training and wider school professional development as part of the School Direct Professional studies programme. This programme combines school based learning with training delivered by the University of Brighton. * The opportunity at the end of the programme for successful students to continue their professional journey within the best schools in West Sussex.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"d2ba71f2-c125-4d86-bb22-736e67043120","code":"B72","name":"University of Brighton","description":"University of Brighton:\\r\\n\\r\\nThe University of Brighton is one of the UK’s largest providers of education and teacher training. It has a long-established reputation for high quality courses and has been educating teachers and other professionals for over 100 years. The University of Brighton ITE Partnership was rated ‘outstanding’ by Ofsted in 2018 for early years, primary and secondary initial teacher training."}],"createdAt":"2021-07-06T17:50:11.821Z","updatedAt":"2021-10-06T20:32:11.427Z"}
