{"id":"cd6bd3b1-62dd-438b-9784-4b7405f92129","name":"Leicestershire and Leicester SCITT (School Direct)","code":"1AP","type":"lead_school","isAccreditedBody":false,"urn":"147148","ukprn":"10046132","address":{"addressLine1":"Abbey Mead Primary Academy","addressLine2":"109 Ross Walk","town":"Leicester, Leicestershire","county":"East Midlands","postcode":"LE4 5HH"},"contact":{"website":"http://www.leics-scitt.co.uk","email":"admin@leics-scitt.co.uk","telephone":"1162543187","fullName":"Jennie Henson"},"location":{"latitude":52.6525522,"longitude":-1.1244242},"trainWithUs":"Abbey Mead Primary Academy are a large multi-cultural primary school off Melton Road. The school is part of the Management Board of the L&L SCITT and is passionate about supporting the highest quality training for new teachers. All trainee teachers recruited through the Leicester and Leicestershire School Direct programmes, offered by Abbey, attend the full [training programmes](https://leics-scitt.co.uk/our-courses/) provided by the L&L SCITT and are managed through the SCITT management team. Trainees are placed in SCITT partnership schools across the City and County and tuition fee trainees are also members of the University of Leicester undertaking a full primary PGCE with the University. The [Leicester and Leicestershire SCITT](http://www.leics-scitt.co.uk) has been consistently rated by [Ofsted]( https://reports.ofsted.gov.uk/inspection-reports/find-inspection-report/provider/ELS/70163) as Outstanding since 2009. In the most recent [`Good Teacher Training Guide’](https://www.buckingham.ac.uk/wp-content/uploads/2017/04/GTTG17fin.pdf) the SCITT is in the top five Initial Teacher Training (ITT) providers nationally and is the top primary provider in the East Midlands. All SCITT trainees are also students at the University of Leicester, gaining an internationally recognised PGCE, with Masters level credits.\nAbbey are proud to be part of TMET (The Mead Educational Trust) and benefit from working closely with other primary and secondary schools within the Trust and The Mead TSA.\nAbbey works closely with the SCITT and collaborates closely with four other local Teaching School Alliances (TSAs).   As a result many of the Abbey students are employed in these TSAs, enjoying excellent access to the TSA NQT and career development programmes from the very start of their teaching careers.","trainWithDisability":"Education and training providers have a duty under the Equality Act 2010 to anticipate the adjustments that disabled students may need. The SCITT is committed to actively promoting equal opportunities in employment and to encouraging participation by disabled people in public life. If you would describe yourself as having a disability, in accordance with the Equality Act (2010), and need any adjustments made to promote equality of opportunity, please contact us, as soon as possible, so we can discuss your requirements. The best place for you to do this is on your UCAS form. However, you can also do it at any time during your studies, either by telling a member of SCITT Management. As we are partnered with the University of Leicester, our students can access the Student Support Services offered. The AccessAbility Centre offers support and advice for students with dyslexia or other specific learning difficulties as well as working with students who have sensory disabilities, mobility difficulties; mental health conditions and autism. The Centre offers study skills support. [The AccessAbility Centre](https://www2.le.ac.uk/offices/accessability)","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:48:41.743Z","updatedAt":"2021-10-01T19:54:57.631Z"}
