{"id":"cd6b0737-60ec-4903-8006-6a2d87f0a8b7","name":"The Evolve Trust","code":"1BO","type":"lead_school","isAccreditedBody":false,"urn":"137763","ukprn":"10035981","address":{"addressLine1":"Brunts Academy","addressLine2":"Park Avenue","town":"Mansfield","county":"Nottinghamshire","postcode":"NG18 2AT"},"contact":{"website":"http://www.brunts.evolvetrust.org","email":"CAtkin@evolvetrust.org","telephone":"01623 623149","fullName":"Helen Taylor"},"location":{"latitude":53.1526702,"longitude":-1.1870704},"trainWithUs":"The Evolve Trust places pupils and students at the heart of everything we do and our aim is to nurture and develop resilience and potential in every child, making it possible for them to lead productive and successful lives. We want our students to strive for ambitious futures, leaving a positive mark on our and their communities as a whole.\nThe Evolve Trust is a values-driven organisation with an unwavering vision “to open minds, creating opportunities for all to believe in themselves, achieve their potential and develop the skills needed to succeed and enjoy life”. Our Trust is unique with the combination of mainstream and special schools, enabling staff to beneﬁt greatly from collaborative learning. Professional development, challenge and support are at the core of our school improvement strategy ensuring that all our staff are well-developed and have the opportunity to engage in the latest pedagogical research.\nThe Evolve Trust is ambitious and inclusive, and we are proud of what we have already achieved, gaining national recognition for our work. We have a proven success in delivering rapid and sustained improvement across all phases of education through our model of collaborative convergence and we believe that there is genuine strength in partnership. It is often said that each child gets one chance of education and here at Evolve we ensure that our children are given every possible opportunity to realise the vision.","trainWithDisability":"The Evolve Trust is an equal opportunities employer. Support will be provided to candidates with a disability or other need in line with the Trust's policy.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:49:33.325Z","updatedAt":"2021-09-19T21:18:20.511Z"}
