{"id":"cd761c54-aba9-4b6f-a46e-ff357c80f655","name":"Blackburn Team Alliance","code":"1UC","type":"lead_school","isAccreditedBody":false,"urn":"139514","ukprn":"10040981","address":{"addressLine1":"Blackburn TEAM Alliance School Direct","addressLine2":"Wensley Fold CE Primary Academy, Manor Road","town":"Blackburn","county":"Lancashire","postcode":"BB2 6LX"},"contact":{"website":"http://www.wensleyfold.co.uk/school-direct/","email":"y.emam@wensleyfold.blackburn.sch.uk","telephone":"01254 667449","fullName":"Donna Simpson"},"location":{"latitude":53.7480125,"longitude":-2.5067962},"trainWithUs":"We are a well established alliance consisting of a lead school who works in partnership with other high performing schools within the borough. Our aim is to deliver outstanding ITT provision in our PGCE General Primary (5 - 11) delivered by experienced practitioners. We have a strong commitment to providing a stimulating, challenging and rewarding training experience which is a rich mix of both educational theory and classroom practice.\nAll trainees are trained in the principles of 'Quality First' teaching whilst benefitting from high quality coaching and mentoring throughout their training journey.\nWe pride ourselves on our commitment to training outstanding teachers to teach in the local authority and beyond. We have an exemplary employment record as a result of supporting our trainees through every step of the job hunting process and into their first teaching post.\nEvidence from our course completion exit survey shows that our trainees are very happy with the training delivered . Quotes from our trainees include:\n'I am so pleased I chose Blackburn TEAM Alliance as from Day 1 I was straight into school life and very quickly gained a full understanding of the challenges and expectations of the job'.\n'I am very excited to begin my first teaching post and feel very prepared following a thorough and rigorous course with the highest expectations from Blackburn TEAM Alliance'.\nQuotes from Head Teachers include:\nThe students we have had have been of such a high calibre and the course has prepared them so well.","trainWithDisability":"Full support will be given to those trainees with a learning difficulty, disability and/or a medical condition that affects their learning, so they are not substantially disadvantaged. Each trainee will be assessed on an individual basis to ensure all partners involved in the training are fully aware of any additional needs and how best to support the trainee through the different stages of the course.\nThe university also offer individual assessment of specific needs so that all trainees are supported in their academic study if needed.\nPlease ensure that we know what you need so that we can make all reasonable adjustments to help you succeed.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"9be9f611-2d36-431a-9109-7fcbbfc88fc8","code":"C99","name":"University of Cumbria","description":"We work in partnership with the University of Cumbria who deliver our MA level credits. All of this is delivered through face to face training at our lead school - Wensley Fold CE Primary Academy.\\r\\n\\r\\nAll MA level training is based on theory which is then applied in classroom practice. All trainees are encouraged to become active researchers who are able to apply theory to everyday life in the classroom.\\r\\n\\r\\nModules studied include: Building Professional Understanding, Enhancing Professional Practice and Developing Subject Knowledge and Pedagogy"}],"createdAt":"2021-07-06T17:53:38.666Z","updatedAt":"2021-10-04T19:13:35.526Z"}
