{"id":"cd7c6bd8-2750-4475-86c6-0e06a476b95d","name":"Springboard","code":"2HX","type":"lead_school","isAccreditedBody":false,"urn":"131570","ukprn":"10003861","address":{"addressLine1":"Shire Oak CE Primary School","addressLine2":"Wood Lane","town":"Leeds","county":"West Yorkshire","postcode":"LS6 2DT"},"contact":{"website":"https://www.shireoak.org/about1-c5zx","email":"springboard@shireoak.leeds.sch.uk","telephone":"1132755890","fullName":"Jane Astrid Devane or Marcelle Maver"},"location":{"latitude":53.8221988,"longitude":-1.5740195},"trainWithUs":"If you are planning to train as a primary school teacher and want to combine the academic rigour and grounding of a university course with the real-life hands on practice of working in schools, then the School Direct route might well be for you. It is particularly suited for candidates with relevant experience of working with children who are wishing to find teaching jobs for autumn 2020 in the local area, as our schools prioritise recruitment from the Springboard Cluster and recommend their students to other schools in the local area. Our graduates are very successful at finding jobs in Leeds due to the quality of the course, school links in the area and the track record of Leeds Beckett University, our higher education partner. The Springboard Cluster is situated in north Leeds primary schools. It is led by Shire Oak Primary School in Headingley. One advantage of the Springboard Cluster is the diversity of its members and therefore the contrasting teaching experiences that student teachers benefit from on their two placements and on our enhancement days. We have small schools, three form entry schools, schools with high numbers of EAL speakers, schools with a very varied socio-economic profile and different cultural backgrounds. All are schools that are committed to meeting the needs of their young learners and supporting the next generation of teachers to do the same. Each school has an experienced tutor/mentor as well as supportive classroom teachers.","trainWithDisability":"Although you do not have to disclose any disabilities to us, if you do it can help us to support you fully. This could include choosing mentors with the right experience to help you, adjusting your working hours and finding placements in the most accessible buildings or asking schools to make reasonable adjustments to their environment.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"154509e2-743e-4f0b-9d99-396393aa57ff","code":"L27","name":"Leeds Beckett University","description":"Leeds Beckett University are one of the leading teacher training providers in England with an excellent track record in training teachers. \\r\\n\\r\\nOn campus, close to the cluster, trainees study in their new Carnegie Teacher Education Building which includes spaces which mimic real-life nursery and primary school settings. All the classrooms have been designed to model primary and early-years learning environments, which allows our students to investigate the impact of environment on learning, teaching and assessment."}],"createdAt":"2021-07-06T17:52:18.490Z","updatedAt":"2021-10-04T18:07:38.402Z"}
