{"id":"cdcd3d62-fd73-45fb-92c2-41c54a4828da","name":"St John’s Church of England First School, Wimborne","code":"225","type":"lead_school","isAccreditedBody":false,"urn":"113771","ukprn":"10048991","address":{"addressLine1":"Wimborne Academy Trust","addressLine2":"c/o Allenbourn Middle School","town":"Wimborne","county":"Dorset","postcode":"BH21 1PL"},"contact":{"website":"http://www.wimborneteachingschool.co.uk","email":"schooldirect@colehillfirstschool.net","telephone":"01202 822506","fullName":"Liz West"},"location":{"latitude":50.8033104,"longitude":-1.9860452},"trainWithUs":"St John’s CE First School is the Lead school for Wimborne Teaching School and is also part of Wimborne Academy Trust (WAT). The Trust consists of eight First Schools, four Middle Schools and QE Upper School. All schools provide excellent environments in which to train teachers and trainees will be placed in schools across the Trust with St John’s taking the lead in the co-ordination having successfully supported trainees since 2006. In July 2009, St John’s was judged by Ofsted to be ‘Outstanding’ in all areas. In 2014 St John’s was awarded Teaching School status; we work closely with Allenbourn Middle School under the name Wimborne Teaching School. In 2015 both schools academised, together with 5 other first and middle schools in the Wimborne area, to form Wimborne Academy Trust. All 13 schools within the Trust are now part of the Wimborne Teaching School Alliance. Our School Direct courses are designed by practising teachers for trainees wishing to teach pupils in the 5-11 age range. It offers practical teaching experience in a wide range of local schools both urban and rural, excellent support throughout the course and beyond, Qualified Teacher Status and a PGCE (Masters level) validated by The University of Winchester.\nWe aim to provide a welcoming and inclusive atmosphere where all partners work together to create a supportive, collaborative learning environment. All trainees are given the opportunity to achieve their full potential through a high quality, well planned and rigorously monitored programme.","trainWithDisability":"Your wellbeing is a top priority and we will do all we can to give you the chance to flourish and maximise your potential. In partnership with the University of Winchester there is a dedicated student support team to help with any questions or challenges you might experience during your studies. We work with you to support your wellbeing and mental health, provide confidential advice and offer workshops to boost your academic skills. If you have a disability or learning difference, we encourage you to get in touch before you apply so we can discuss tailored support for your individual needs.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:49:45.218Z","updatedAt":"2021-10-01T22:04:51.625Z"}
