{"id":"cdd7b762-efe3-4663-b9f1-f7289982f311","name":"The Leigh Academy","code":"24Q","type":"lead_school","isAccreditedBody":false,"urn":"135964","ukprn":"10052832","address":{"addressLine1":"Leigh Academies Trust Head Office","addressLine2":"Carnation Road","town":"Rochester","county":"Kent","postcode":"ME2 2SX"},"contact":{"website":"https://leighacademiestrust.org.uk/train-to-teach/welcome-to-teacher-training/","email":"talent@latrust.org.uk","telephone":"01634 412 240","fullName":"Olivia Couzins"},"location":{"latitude":51.398135,"longitude":0.466407},"trainWithUs":"Identified as one of the most successful multi-academy trusts in the UK, Leigh Academies Trust (LAT) is a medium-sized trust who make a positive impact on over 20,000 student's lives in the Kent and South East London areas. The Leigh Academy, the founding school of LAT, has worked in partnership with Kent and Medway Training (a School Centred Initial Teacher Training provider) for many years and have achieved great successes together, training more and more teachers every year. KMT now work with over 40 secondary and 40 primary schools in Kent, making them the largest training provider in our area. At present, 31 of the schools KMT work with are part of LAT. We have a fantastic mix of primary, secondary and SEN schools across Greenwich, Dartford, Medway and Maidstone. All applications are handled by LAT's central Recruitment Team and from working with you closely to assess your needs, skills and location, we partner you with the academy who will offer you the best training. Our training programme is available for recent graduates, career changers, teaching assistants and unqualified teachers with a degree who share the same goal; to become a qualified teacher.\n* 100% trainees were graded at a high standard (2018, 2019, 2020, 2021)\nTraining with LAT allows you to be part of what we do best; collaborate. Working with your highly skilled mentor and education experts, you'll receive recent and relevant information to the education sector which you can put into practice.","trainWithDisability":"KMT and LAT welcome applications from and are supportive of those with disabilities, including mental, physical and/or learning-related. Every year, we have great success with trainees who have a variety of disabilities and our flexible approach lends itself well to this. For those with dyslexia and other similar disabilities, we teach strategies for ensuring that spelling, punctuation and grammar are accurate, especially in work that is handed out to pupils or in correspondence with parents.\nWe have also introduced a programme of support for those with mental health conditions and further advice as to where to gain specialist support should you need it. Leigh Academies Trust put staff well-being at the heart of everything we do and have a number of strategies to mitigate stress in the workplace. We want you to thrive in every way possible. We are proud of the support and guidance that we give to ensure that you are able to give of your best during your training year and we provide an environment in which you can feel comfortable in seeking support should you need it.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"757d0dca-c7a9-43c8-8c3b-96c0a81539b6","code":"K30","name":"Kent and Medway Training","description":"At KMT, we believe that our school-centred approach to initial teacher training within a strong community of schools results in a programme that prepares our associate teachers effectively for their early careers and beyond. Our hub-based model ensures that trainee teachers receive personalised training suitable for their local context.\\r\\n\\r\\nEach hub provides you with the opportunity to further enhance your training experience in a variety of educational settings. As a result of KMT’s evidence-informed, carefully-sequenced, ambitious curriculum, associate teachers emerge fully prepared for the profession and equipped with the knowledge, skills and attributes needed to continue to develop and thrive."}],"createdAt":"2021-07-06T17:57:25.363Z","updatedAt":"2021-09-15T17:43:58.573Z"}
