{"id":"ce25b950-14e6-4c21-a215-d140b58e2d5c","name":"East of England Teacher Training","code":"2B6","type":"scitt","isAccreditedBody":true,"ukprn":"10052840","address":{"addressLine1":"East of England Teacher Training C/O Hartsholme Academy","addressLine2":"Carrington Drive","town":"Lincoln","county":"Lincolnshire","postcode":"LN6 0DE"},"contact":{"website":"www.eoettc.com","email":"enquiries@eoettc.com","telephone":"7379404767","fullName":"Charissa Spence"},"location":{"latitude":53.212893,"longitude":-0.5797059},"trainWithUs":"EOE Teacher Training is an experienced teacher training provider who works with a large number of schools in Lincolnshire and North Lincolnshire to offer high quality Initial Teacher Training. Our course is heavily school based, meaning that you get to spend long periods of time in school, practising being a teacher and training alongside your mentor, before you qualify. As a result of this, our trainees always feel well prepared as they enter the profession and our employment rates are high. We will guarantee that each of your placements will be in your local area, as having a work life balance and time with your family matters to us.\nThe course is a fantastic opportunity to be trained and supported in local schools by experienced teachers - teachers training teachers is the best way to learn! EOE Teacher Training works with schools in: Lincolnshire, South Lincolnshire and North East Lincolnshire. The course leads to the award of QTS (Qualified Teacher Status), with a PGCE (optional).\nOur partnership is diverse and can offer you many different experiences: working in small rural primary schools, large inner city primary schools and junior and infant schools. Previous trainees have stated that they feel very well supported and extremely well prepared for their NQT year, as a result of the range of experiences and training they undertake; see testimonials here: https://www.eoettc.com/about-us/testimonials Also read our Ofsted report which outlines the impact of Outstanding Leadership within the partnership: https://www.eoettc.com/ofsted-report","trainWithDisability":"We have a strong track record in successfully working with trainees with a wide range of disabilities and additional needs. During our recent Ofsted Inspection, one of the findings was that: ‘Leaders pay close and extensive attention to the welfare of trainees. They respond rapidly and effectually to those needing support’ (Ofsted 2018). After recruitment, we ask trainees to complete a ‘Fitness to Teach’ questionnaire which asks if any adjustments are required, we also require trainees to be assessed by an occupational health specialist. If appropriate, a ‘Wellbeing Plan’ will be created which is bespoke to the trainee’s needs; this will be regularly reviewed. We will then work closely with the trainee to make adjustments where we possibly can (for example, PowerPoint presentations in advance or printed on coloured paper). Declaring any disabilities will not disadvantage trainees and their application; we make any appropriate adjustments and make sure that trainees are placed in a supportive training environment.\nWe regularly ensure that these adjustments are maintained and re-assessed, to ensure that needs are continually met. Disability access and provision are in accordance with legal requirements in all our settings. Some settings have further specialist provision and further details can be acquired by contacting the individual setting via their website contact details.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:50:26.090Z","updatedAt":"2021-07-13T22:09:41.005Z"}
