{"id":"cf768993-ee90-457e-96db-057c593ac1d3","name":"Flying High Futures SCITT – Inspiring Leaders Teacher Training","code":"24H","type":"scitt","isAccreditedBody":true,"ukprn":"10088528","address":{"addressLine1":"Hucknall Flying High Academy","addressLine2":"Hurricane Road","town":"Hucknall","county":"Nottinghamshire","postcode":"NG15 6WU"},"contact":{"website":"http://inspiringleadersscitt.com/","email":"abarton@flyinghightrust.co.uk","telephone":"0115 9891915","fullName":"Jo Venables"},"location":{"latitude":53.0189037,"longitude":-1.2246976},"trainWithUs":"Inspiring Leaders Teacher Training (ILTT), is an Ofsted 2017 'Outstanding' rated School Centred Initial Teacher Training (SCITT) provider, formed by four teaching schools across Nottinghamshire, Derbyshire and Leicestershire working with Nottingham Trent University/University of Leicester. We specialise in 3 – 11 education, providing only Primary and Early Years courses.\nThe Flying High Partnership - with 4Derbyshire, who oversee the Nottinghamshire/Derbyshire course, and in whose schools you will be based, aspire for our schools to be the best in the universe. To achieve this we need to recruit, support and invest in teachers with the passion and determination to provide outstanding opportunities and experiences for our children. We are offering much more than just a training year, supporting you through training year, into employment as an NQT and offering a bespoke package of support that will ensure you maximise your potential. We restrict the size of our intake to ensure that we can personalise training to suit your emerging needs. We are determined to support you to become the best you can be and to change the lives of our children. For more information visit:\n(https://www.inspiringleadersscitt.com)\nCall us on 0115 9891915 or email us at info@iltt.org.uk\nFollow us @ilscitt or visit us on Facebook page Inspiring Leader’s Teacher Training . Please be aware that the welfare of our children is our highest priority and all offers of training places are subject to DBS, identity and reference checks.","trainWithDisability":"We are an equal opportunities provider and provide support for all our students with their learning requirements. Our partner universities provide support for trainees with different needs and learning requirements. This can be discussed at the screening and interview process.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:53:06.790Z","updatedAt":"2021-10-29T14:55:37.525Z"}
