{"id":"cf792652-386e-43cc-ad12-ffd24d652894","name":"Discovery SCITT – Inspiring Leaders Teacher Training","code":"1BJ","type":"scitt","isAccreditedBody":true,"ukprn":"10055365","address":{"addressLine1":"Discovery Schools NSPCC Training Centre","addressLine2":"NSPCC National Training Centre","town":"Leicester","county":"Leicestershire","postcode":"1 School Lane"},"contact":{"website":"http://www.inspiringleadersscitt.com","email":"jvenables@iltt.org.uk","telephone":"1163184066","fullName":"Fossebrook Primary School"},"location":{"latitude":52.6670577,"longitude":-1.1641075},"trainWithUs":"Inspiring Leaders Teacher Training, is an Ofsted 'Outstanding' rated partnership of schools working across Leicestershire, Leicester and Rutland, working together to develop outstanding teachers and leaders of the future. As Discovery Schools Academy Trust we are committed to helping every child the opportunity to 'Discover their Potential' and believe the best way to achieve this is through outstanding teaching and leadership. All of the schools you will be based within, aspire for our schools to be the best paces for children to learn and develop their full potential. To achieve this we need to recruit, support and invest in teachers with the passion and determination to provide outstanding opportunities and experiences for our children. Our SCITT / School Direct training route provides all trainees with a blend of school experience alongside an innovative and inspiring taught programme, leading to the award of QTS and a PGCE, with our partners the University of Leicester.\nWe are passionate, experienced and successful at developing great teachers with 100% of our trainees being successfully employed in the past 3 years.\nWe offer more than just a one year teacher training programme by supporting trainees into employment in our schools and delivering ongoing career opportunities tailored to their needs.\n[For more information visit our websites:]\n(https://www.inspiringleadersscitt.com)\n(https://www.discoveryschoolstrust.org.uk/)\nCall us on 0116 3184066 or email us at info@iltt.org.uk","trainWithDisability":"We are an equal opportunities provider and provide support for all our students with their learning requirements. Our partner universities provide support for trainees with different needs and learning requirements. This can be discussed at the screening and interview process.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:51:32.479Z","updatedAt":"2021-11-12T17:08:19.470Z"}
