{"id":"cfef1481-d5dd-443d-940a-719504468240","name":"Burnt Mill Academy","code":"2GY","type":"lead_school","isAccreditedBody":false,"urn":"137694","ukprn":"10035847","address":{"addressLine1":"First Avenue","town":"Harlow","county":"Essex","postcode":"CM20 2NR"},"contact":{"website":"http://www.bmat-trust.org/","email":"teachingschool@bmatrust.org.uk","telephone":"1279307244","fullName":"Robyn"},"location":{"latitude":51.776273,"longitude":0.1070037},"trainWithUs":"Burnt Mill Academy is graded as Outstanding by Ofsted. Our most recent inspection recognised that provision for students with special educational needs is strong. We are an inclusive academy that has the highest expectations so that students are enabled to succeed across the curriculum. We also place a high value on enrichment activities and supporting our students pastorally.\nBurnt mill is part of the BMAT Multi Academy Trust which includes 5 Primary and 6 Secondary Schools - including a STEM Academy and 2 Sixth Form provisions providing wide opportunities for trainees to experience educations from EYFS to A Level. As a Trust, we commit to living out the following values Courageous actions\nWe are courageous enough to make the tough decision, to do what’s right – even if it’s not what’s popular.\nHigh expectations\nWe are unswerving in expecting excellence of our teachers and expecting more of our children – for behaviours, relationships and academic results.\nServant leadership\nWe treat each other as peers, not as superiors, and choose to adopt a leadership style that asks: ‘How can I help?’\nApplicants may train across one of the trust schools.","trainWithDisability":"The Disability and Dyslexia Service at UEL provides support and advice for disabled students and those with specific learning difficulties (SPDs), including dyslexia.\nIf you have a disability, long-term medical condition or a specific learning difficulty, we can help to identify and address any barriers to your education so that you can access your course and reach your potential. \nAppointments can be made via the student Hub at both the Docklands and Stratford Campuses in person, on the phone (020 8223 4444) or by email (thehub@uel.ac.uk).","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"2e1ce675-b5df-42ab-bb63-1e0435ef5722","code":"E28","name":"University of East London","description":"UEL is one London’s leading centres for teacher training, offering highly successful courses for the primary, secondary and further education and training sectors. Capitalising on our east London location, we’ve earned an excellent reputation for working in partnership with schools to prepare teachers to work in multi-ethnic and multilingual urban schools.\\r\\nThe Cass School of Education and Communities trains approximately 600 teachers every year. You will be joining a large department with a long and impressive track record and benefit from subject specific coaching and mentoring from experienced and expert practitioners."}],"createdAt":"2021-07-06T17:50:26.188Z","updatedAt":"2021-10-10T21:57:46.912Z"}
