{"id":"d037848f-bfbc-4cc6-81a1-c3ff204c750b","name":"Lime Trust","code":"1PX","type":"lead_school","isAccreditedBody":false,"address":{"addressLine1":"Kingsley Road","addressLine2":"New Road","town":"Chingford","county":"London","postcode":"PE1 5JS"},"contact":{"website":"http://www.limetrust.london","email":"miranda.cummings@limetrust.org","telephone":"1733566847","fullName":"Beth Billington"},"location":{"latitude":52.5808355,"longitude":-0.228691},"trainWithUs":"The Lime Trust and our partner schools believe that teaching is an exciting, challenging and rewarding profession. We pride ourselves on having a proven track record in training excellent practitioners and supporting them in gaining positions within our partnership schools. We ensure that all of our trainees are given access to a high quality, purposeful programme that ensures they are equipped to excel in the work place that they progress onto. We are based in Chingford, North East London and we have a number of partner schools in Waltham Forest and Havering. We also have partner schools in Peterborough, through the Lime Trust. Our partner schools consist of both mainstream and special schools and we are able to provide placements in both settings. Partner schools are carefully selected to provide excellent training experiences for trainees. Each trainee spends the majority of their time learning to teach in one of partner schools and they also complete an alternative placement in a different school, in another key stage. For special school trainees, the alternative placement must be held in a mainstream setting. This means that trainees are exposed to a contrast in terms of teaching styles and organisation, school size and demographics. Centre based training takes place once a week. Our programme of training equips trainees with knowledge of theory and pedagogy and sessions are delivered by outstanding, experienced practitioners. We pride ourselves in providing high levels of support to individual trainees and schools.","trainWithDisability":"Please contact Miranda Cummings at miranda.cummings@limetrust.org to discuss how we can support your disabilities and needs.","accreditedBodies":[],"createdAt":"2021-07-06T17:55:47.575Z","updatedAt":"2021-07-06T17:55:47.575Z"}