{"id":"d04809d3-d34a-4034-ae20-11f666f3293c","name":"North East Partnership SCITT (Physical Education)","code":"N55","type":"scitt","isAccreditedBody":true,"ukprn":"10003503","address":{"addressLine1":"John Spence Community High School","addressLine2":"Preston Road","town":"North Shields","county":"Tyne and Wear","postcode":"NE29 9PU"},"contact":{"website":"http://www.nepscitt.co.uk","email":"sarah.ramsden@johnspence.org.uk","telephone":"1912961432","fullName":"Jonathan Heath (Head Teacher)"},"location":{"latitude":55.0220564,"longitude":-1.4509305},"trainWithUs":"If you want to be a secondary PE teacher train with the prestigious North East Partnership SCITT (previously the Northumbria University PGCE). We are the top PE provider in the NE and one of the top in the country.\n* We have consistently been graded as outstanding by Ofsted. * We are consistently identified as one of the top 10 providers in the country in the Good Teacher Training Guide and in 2015 were identified as the best in the country.\n* We are the largest provider of secondary PE in the NE and one of the largest in the country. * Our trainee outcomes are exceptionally high; completion rates, attainment grades and employment. * As a single-subject SCITT we can really focus on developing your subject-specific knowledge and pedagogy. * You will have the opportunity to gain additional teaching qualifications and NGB awards at no extra charge, including; mental health, first aid, cricket, dodgeball, frisbee, handball and trampolining. * You will have the opportunity to teach a second subject at KS3. * Training is completely school-centred. We work with over 40 schools in the NE and a significant number of these, support the programme delivery. * We have exceptionally strong support mechanisms. We have a mental health and well being lead. You will have a subject mentor, a professional mentor and a link tutor. A large cohort of trainees means you are never working alone. * You will exit with QTS and a PGCE which includes 60 Masters Credits.","trainWithDisability":"We are committed to providing an environment in which you are treated fairly and with respect, regardless of any disability. Disabilities are catered for on a case by case basis. Any trainee with an impairment or health condition (physical or mental), which may affect their ability to train to teach, will be referred to occupational health and any reasonable adjustments will be made for their training year. We acknowledge that some of you might find the academic side of the course a little challenging, especially if you have been out of full-time education for a while or suffer from dyslexia, and provide a range of support to cater for this. In addition, we have a mental heath and well-being lead who works with you throughout your training year.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:48:26.802Z","updatedAt":"2021-07-19T17:47:12.946Z"}
