{"id":"d06d9c3c-a3da-402b-9dfa-ab814cd0489c","name":"CREC Early Years Partnership","code":"25R","type":"lead_school","isAccreditedBody":false,"urn":"70346","ukprn":"10048034","address":{"addressLine1":"St. Thomas Children’s Centre, Bell Barn Road","town":"BIRMINGHAM","county":"West Midlands","postcode":"b15 2af"},"contact":{"website":"www.earlyyearsteachertraining.co.uk","email":"itt@crec.co.uk","telephone":"0121 464 0020","fullName":"Sean Delaney"},"location":{"latitude":52.4694137,"longitude":-1.9065963},"trainWithUs":"We offer a one-year full-time school-based route to becoming a qualified primary teacher with a specialism in early years (3-7 years old).\n\nOur core aim is to help you become a confident, knowledgeable and highly employable teacher with a passion for working with young children to give them the best starting point in life, whatever their circumstances.\n\nOur high-quality mentors and tutors have extensive practical experience and will help you succeed by offering consistent guidance and personalised support throughout the course.\n\nAlongside the Qualified Teacher Status (QTS), this course also carries a PG Cert awarded by Birmingham City University.\n\nOur partner schools include primary and nursery schools from across Birmingham, Solihull, Coventry and Warwickshire.\n​\nThe course has been devised to develop high quality teachers to work in EYFS and Key Stage 1, in addition to covering all Teaching Standards, the training includes an emphasis on multi-agency working, leadership in the EYFS, working with 2 year olds, SEN/D, and practitioner research.\n\nThe SCITT programme benefits from the direct contributions of Professor Chris Pascal and Professor Tony Bertram from CREC, both highly experienced teacher educators, and a wider team of early years and primary specialists and placement mentors. This course also carries Postgraduate Accreditation (60 Masters Credits) awarded by Birmingham City University.","trainWithDisability":"Just as we see all children as individuals, we see out Trainees in the same way and offer individualised support and make reasonable adjustments to allow access to learning and practice. Each person's needs will be different and we will be guided by individuals as to best they can be supported.\nWe can draw upon colleagues at Birmingham City University where all Trainees are registered for their academic qualification and access their Student Support Team for specialist advice.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:48:44.281Z","updatedAt":"2021-07-22T21:11:28.970Z"}
