{"id":"d0986f27-a799-48e6-a367-9e3aac8924ab","name":"ARK Teacher Training","code":"1CS","type":"lead_school","isAccreditedBody":true,"urn":"135600","ukprn":"10044534","address":{"addressLine1":"The Yellow Building","addressLine2":"1 Nicholas Road","town":"London","postcode":"W114AN"},"contact":{"website":"http://www.arkteachertraining.org","email":"teachertraining@arkonline.org","telephone":"2031166353","fullName":"Ark Teacher Training"},"location":{"latitude":51.5104516,"longitude":-0.2186575},"trainWithUs":"[Ark Teacher Training](http://www.arkteachertraining.org) is an [Outstanding](https://www.arkteachertraining.org/about-us/ofsted/) programme that allows graduates and career changers to become highly-effective, inspiring teachers, [learning from some of the best educators in the profession](https://www.arkteachertraining.org/your-training-year/). We work in low income areas with a history of academic underachievement, striving for the best outcomes for all our pupils, regardless of their background. According to the [Department for Education](http://www.suttontrust.com), Ark makes the biggest difference in transforming the lives of disadvantaged students out of all the major school groups. - Classroom teaching: from day one, you’ll be in the classroom so you can have an impact straight away. Your tutor and coach will support you to build up your independent teaching time during the year.\n- School orientation experience: before your course starts, spend time in your school meeting your new colleagues and interacting with pupils so you can hit the ground running in September.\n- Summer School: all new trainees come together over two weeks in August for an introduction to the programme, our schools and the principles of great teaching. You’ll also cover the essential elements of behaviour management, so you are ready for day one.\n- Weekly coaching and learning to plan: every week you'll be observed by your in-school coach, so they can offer you positive feedback and bite-sized improvement targets.\n- Your trained lead planner will help you create effective lessons, developing your planning skills and giving you the opportunity to ask detailed subject -knowledge questions.\n- Weekly training: in-person training sessions with your tutors/peers.","trainWithDisability":"- Disabled access\nWe want to make sure that our training programme is open to everybody, so if you have a disability we will make every reasonable adjustment to accommodate you throughout the recruitment process, as well as during the training programme if you are offered a place. Please provide us with details if you would like us to make any adjustments for you on the assessment day. This will in no way affect the outcome of your application.\nWhenever we build new schools, we ensure they have wheelchair access to classrooms. However, when an existing school joins the network, we have to work with the existing buildings and these can sometimes have limited accessibility. - Study Facilities\nYour PGCE qualification is accredited by Goldsmiths, University of London. The majority of your training sessions will take place in one of our schools, however, you will still have access to the online journals, library facilities and student support services provided by Goldsmiths.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:51:32.802Z","updatedAt":"2021-07-27T21:04:06.963Z"}
