{"id":"d0d173a3-514d-418a-9fbd-b48d98a5bdef","name":"AIM Primary Alliance","code":"1BD","type":"lead_school","isAccreditedBody":false,"urn":"147637","ukprn":"10085000","address":{"addressLine1":"Broomfields Junior School","addressLine2":"Bridge Lane","town":"Warrington","county":"Cheshire","postcode":"WA4 3AH"},"contact":{"website":"https://www.broomfieldsjunior.co.uk/warrington/primary/broomfields/staging/pages/ourschool/schoolsdirect2/schooldirect-warringtonwireprimaryalliance","email":"h.plant@broomfieldsjunior.tcat.uk.com","telephone":"01925 265297","fullName":"Rachel Morris Brown"},"location":{"latitude":53.36243,"longitude":-2.568731},"trainWithUs":"School Direct is an innovative approach to Initial Teacher Training and a fantastic opportunity for aspiring teachers to learn 'on the job', within high performing schools across Warrington. Experienced teachers and mentors guide trainees through a bespoke training experience with access to wide and varied opportunities. The AIM Primary Alliance, Warrington, comprises of eleven primary partner schools with a proven, track record in training the outstanding teachers of tomorrow. Our commitment is to develop confident, creative and innovative classroom practitioners who share and embrace our aspiration to excellence.\nWe will offer all our successful applicants a school-based programme, in a range of schools and contexts, with a clear focus upon enhanced employability and leadership capacity. The AIM Primary Alliance School Direct partnership programme will lead to the award of QTS status and a PGCE including credits towards Masters-level accreditation.\nOur School Direct programme maximises the time you will spend in the classroom allowing you to fully embrace the day-to-day life of a school and maximise the opportunities that our partnership schools will offer you.\nIf you are interested in enhancing the experiences of our young students and share our commitment to excellence, then contact us now.","trainWithDisability":"Specialist staff on both the Chester and Warrington campuses support students in identifying the most appropriate solutions to potential barriers to learning. This includes students with disabilities, specific learning differences, long standing health conditions, mental health conditions, Autism/Asperger’s Syndrome and sensory impairments.\n\nDisability and Inclusion want to ensure all students benefit fully from university life and achieve their learning potential. Specialist staff on both the Chester and Warrington campuses support students in identifying the most appropriate solutions to potential barriers to learning. This may include creation of an Inclusion Plan.\n\nWe are aware that students can be reluctant to disclose a disability because they fear that it might negatively affect their application or result in them being treated differently by the University.\n\nPlease ensure that you detail any needs on your application form so that support can be put in place.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:48:04.463Z","updatedAt":"2021-11-04T23:23:26.113Z"}
