{"id":"d10e3e66-3981-4478-9214-3f9d5559df41","name":"Surrey South Farnham SCITT","code":"13S","type":"scitt","isAccreditedBody":true,"ukprn":"10054050","address":{"addressLine1":"Menin Way","county":"Farnham","postcode":"GU9 8DY"},"contact":{"website":"http://www.ssfscitt.org.uk","email":"scitt@sfet.org.uk","telephone":"01252 717408","fullName":"Susan Shoveller"},"location":{"latitude":51.2093722,"longitude":-0.7859651},"trainWithUs":"SSF (Surrey South Farnham) SCITT is an innovative, [OFSTED outstanding](https://reports.ofsted.gov.uk/inspection-reports/find-inspection-report/provider/ELS/70241), well established and highly respected provider of Primary Initial Teacher Training working across Surrey, Hampshire, Berkshire, West Sussex and the London Boroughs of Sutton, Croydon and Kingston.\nThere are many reasons why we are the first choice for so many trainees and schools and we have a reputation for being amongst the best school-led teacher training providers in the country (Good Teacher Training Guide 2015 and 2017). Our CEO Sir Andrew Carter OBE has led a national review of teacher training and we feature as a case study in the National Mentor Standards.\nOur trainees are highly sought after and we deliver upon an expectation of employment every year. Trainee and school feedback consistently rates the programme as being outstanding. We are the largest school-led, primary provider in the region and are praised for our personalised approach to every trainee.\nSchool-led training enables you to learn in a school environment and treated as a member of the school team from day one. You will be surrounded by experienced colleagues and guided through a gradual integration into teaching a class of children. The programme will be tailored to meet your needs and you will be supported by a Mentor and Support Tutor. Weekly professional studies sessions are led by a team of national experts and primary educationalists.","trainWithDisability":"We pride ourselves in being an equal opportunities provider that encourages and welcomes applicants from under-represented groups, accepting trainees onto our programmes by merit alone.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:48:25.180Z","updatedAt":"2021-10-01T23:48:06.997Z"}
