{"id":"d1392666-2454-4973-8848-d743beecfc33","name":"The Bedfordshire Schools Training Partnership","code":"B31","type":"scitt","isAccreditedBody":true,"ukprn":"10055198","address":{"addressLine1":"Pix Brook Academy","addressLine2":"Arlesey Road","town":"Stotfold","county":"Herts","postcode":"SG5 4HB"},"contact":{"website":"https://www.bedsscitt.org.uk/","email":"cathy@bedsscitt.org.uk","telephone":"01462 817445","fullName":"Bedfordshire Schools' Training Partnersh"},"location":{"latitude":52.0217581,"longitude":-0.2367016},"trainWithUs":"The Bedfordshire Schools' Training Partnership (Beds SCITT) is a successful long established SCITT offering both Primary and Secondary Initial Teacher Training across Bedford, Luton and rural Central Beds. We work in collaboration with Robert Bloomfield Academy (BEST Teaching School) - appears as Bedfordshire Schools Training Partnership on UCAS - and St Thomas More Catholic School (INSPIRIT Teaching School) offering high quality school based training at over 50 partnership schools. All courses operate over one year and are full time resulting in QTS and academic recognition in the form of a PGCE award (worth 60 Masters Credits) validated by The University of Buckingham.\nTrainees will work with experienced teachers as their mentor and will meet weekly with their subject leader for Subject Application lectures. Professional Studies lectures will also be weekly. These lectures will address the Standards for QTS and Subject Knowledge for Teaching and will involve assessment through assignments.\nWhat's in it for you? Why choose us??\nHigh quality school based training alongside qualified teachers; Excellent employment prospects and a rewarding career - we employ the vast majority of our trainees in our Partnership schools across Bedfordshire & Hertfordshire;\nA solid framework of support - always someone to talk to; Placement in a school tailored to meet your needs - your situation will always be taken into account.","trainWithDisability":"We have accommodated many trainees over the years with various disabilities and other needs - Dyslexia is one we often come across. With the help of the various disability assessments provided we always have a clear picture of the needs of every individual at the start of their training and can then tailor our lectures to ensure that we address these needs. Being a relatively small provider this is never a problem and we are always available to discuss any issues moving forward. The Office Manager meets every week with trainees when they attend Professional Studies so there is always an opportunity to check well-being.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:51:31.470Z","updatedAt":"2021-09-14T20:16:32.161Z"}
