{"id":"d14be96c-fe6c-4962-a0b9-6717cf4f9d5b","name":"Ripley ITT","code":"R23","type":"scitt","isAccreditedBody":true,"ukprn":"10058677","address":{"addressLine1":"Ashton Road","town":"Lancaster","county":"Lancashire","postcode":"LA1 4RS"},"contact":{"website":"www.ripleyitt.co.uk","email":"ITT@ripley.lancs.sch.uk","telephone":"01524 64496","fullName":"Jayne Partington"},"location":{"latitude":54.0390665,"longitude":-2.8007533},"trainWithUs":"Ripley ITT SCITT is an Outstanding provider of ITT (Ofsted 2017) based in the historic city of Lancaster, a beautiful location close to Morecambe Bay and the South Lakes. We have a long history of initial teacher training at the lead school, Ripley St Thomas CE Academy, and a very committed partnership of schools.\nOur highly innovative curriculum is designed and delivered by initial teacher training experts in order to train the type of teachers that schools want to employ. Our vision is to develop outstanding teaching and learning ensuring that each teacher that we train can provide the very best holistic education for pupils. Our trainees are highly valued and well supported at all stages of their training by specialist practitioners and outstanding mentors. Ofsted have graded our programme Outstanding in every category:\n\"The highly integrated structure and content of the programme produces confident teachers who are very well equipped to contribute immediately to their employing schools\"\n\"The pastoral care of trainees is exemplary. The personalised support that they receive has a significant impact on the outstanding progress that they make. This high-quality support continues throughout their NQT year\"\nMany of our trainees go on to work in our partner schools where they make excellent progress, often with rapid promotion into leadership roles.","trainWithDisability":"Ripley ITT SCITT is committed to equality of opportunity and meeting the needs of all trainees on the programme. Our programme operates in line with the legislation applicable to the DfE ITT Criteria.\nPeople with disabilities are offered facilities at interviews to enable them to demonstrate their suitability for the programme. People who are or become disabled while on the programme are given positive help to enable them to continue their training. Additional resources are made available and funded by Ripley ITT SCITT in providing such support.\nVenues and resources for training take account of the needs of all participants.\nWellbeing is an important part of our programme for all trainees and our curriculum addresses mental health, resilience, workload and individual needs. Personal support for trainees is Outstanding (Ofsted 2017)","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:47:27.796Z","updatedAt":"2021-09-30T21:10:24.013Z"}
