{"id":"d1969afe-15a1-410d-b1bc-279921ed2c05","name":"KsENT","code":"29C","type":"lead_school","isAccreditedBody":false,"urn":"119044","ukprn":"10015914","address":{"addressLine1":"C/O Beacon School","addressLine2":"Park Farm Road","town":"Folkestone","county":"Kent","postcode":"CT19 5DN"},"contact":{"website":"http://www.classtsa.org.uk/","email":"vanessa.geylani@ksent.org","telephone":"01622 743925","fullName":"Lauren Scott-Smith"},"location":{"latitude":51.0915381,"longitude":1.1722774},"trainWithUs":"Our School Direct programmes offer successful applicants a unique opportunity to train as a teacher within one of our special schools in Kent. You will be learning on the job with our outstanding practitioners. You will find support from mentors, fellow trainees and our dedicated ITT team to help you achieve the award of Qualified Teacher Status.\nThere are 2 School Direct routes available:\n*School Direct Salaried:\nThis is a one year employment based route for high-quality graduates ideally with Special Educational Needs work experience. Colleagues will earn as a salary while they train.\n*School Direct unsalaried:\nThis is aimed at high-quality graduates with a desire to become part of a school team from day one. Trainees will pay their own fees, but may be eligible for a bursary of up to £30,000 to support them whilst they train.\nWE OFFER:\n*Fantastic opportunities to train to be an excellent teacher in a Kent special school\n*School based training in special schools with an alternative 6 week placement in a partner mainstream school\n*A superb supportive network of special schools within which to develop the skills and knowledge to become an inspirational teacher\n*A strong partnership with Canterbury Christ Church University through which first class training will be provided\n*Salaried and Non Salaried routes for primary and secondary training to gain QTS with the opportunity to gain a PGCE (self funded)\n*Training opportunities for every step of your career","trainWithDisability":"KSENT is a trust of 26 Special Schools in Kent. We will do everything we can to accommodate those with additional needs. If you have any specific questions, please do not hesitate to contact us.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:51:54.283Z","updatedAt":"2021-12-10T00:20:52.022Z"}
