{"id":"d1b36e0c-ba96-4e39-98d7-2a052600673d","name":"Higham Lane School Partnership","code":"2KZ","type":"lead_school","isAccreditedBody":false,"urn":"137767","ukprn":"10035967","address":{"addressLine1":"Higham Lane School Partnership","addressLine2":"Shanklin Drive","town":"Nuneaton","county":"Warwickshire","postcode":"CV10 0BJ"},"contact":{"website":"https://www.highamlaneschool.co.uk/partnership","email":"partnership@highamlaneschool.co.uk","telephone":"2476388123","fullName":"Vanessa Domigan"},"location":{"latitude":52.5328277,"longitude":-1.4563646},"trainWithUs":"Higham Lane School Partnership comprises 11 partner schools across both primary and secondary phases. We offer School Direct training in collaboration with The University of Warwick, The University of Leicester and Birmingham City University. Our Lead School is Higham Lane School, rated outstanding by Ofsted and amongst the top 100 performing, non-selective state funded schools in England. We are a close partnership both in terms of location and our approach to the training provision. Our partnership has an expert and experienced team of mentors to support trainees and provide an excellent in-school experience in a range of contexts. \nAll our schools are happy, caring and purposeful environments. Mutual respect and very clear expectations regarding effort, progress and behaviour are key to our success. Students get on exceptionally well with each other and with the staff. Achievement in all forms: artistic, academic, social, cultural, sporting and intellectual are equally valued.\nOur partnership is more than just a place to work - it is a thriving community, proud of its past and confident in its future. \nSecondary subjects include English, mathematics, biology, chemistry, physics, physics with mathematics, computer science, geography, history, art and design, design and technology, drama, physical education, modern foreign languages, music, religious education and social sciences.\nIf you are passionate about teaching, ambitious, reflective and with excellent communication skills and a desire to positively influence and transform young people’s lives, we look forward to receiving your application for one of our programmes.\nFor more information, please see https://www.highamlaneschool.co.uk/partnership","trainWithDisability":"We are proud to be a fully-inclusive training provider. Schools within our partnership attract applicants and trainees from a diverse range of age groups, backgrounds and needs. We are a welcoming, supportive and inclusive community, that everyone can feel part of.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:53:58.554Z","updatedAt":"2021-09-29T17:24:11.669Z"}
