{"id":"d1cec06e-f4c9-453a-987d-89780e2b17e0","name":"Blackpool Sea View Trust School Direct ITT","code":"1XH","type":"lead_school","isAccreditedBody":false,"urn":"140143","ukprn":"10043075","address":{"addressLine1":"Park Community Academy","addressLine2":"158 Whitegate Drive","town":"Blackpool","county":"Lancashire","postcode":"FY3 9HF"},"contact":{"website":"https://www.seaviewtrustschooldirect.co.uk","email":"gillian.bruce@park.blackpool.sch.uk","telephone":"01253 764130","fullName":"Gill Hughes"},"location":{"latitude":53.8119694,"longitude":-3.0331116},"trainWithUs":"Blackpool Sea View Trust deliver inclusive school based training via our School Direct Programme. Blackpool is a rewarding yet challenging place to teach. Our vision is to train the next generation of outstanding teachers to give the children of Blackpool and the local area the best possible start in life. We are looking for candidates who have a passion for teaching, enjoy a challenge and put children and their needs at the centre of their practice.\nWe offer 2 courses both leading to PGCE with QTS\nPrimary\nPrimary with SEND\nOur programmes immerse you into school life. You become part of the team, observing, supporting and team teaching alongside highly skilled practitioners. You experience first-hand the wider professional responsibilities of a teacher as you become involved in a range of whole school events.\nAlongside this you receive high quality training around pedagogy and practice delivered by experienced teachers and study the PGCE L7 modules delivered by the University of Cumbria. You will undertake 3 placements each in a different school setting teaching in both key stage 1 and key stage 2. Students undertaking our Primary Programme will be hosted in mainstream schools and will undertake a minimum of 2 placements within a mainstream setting with the opportunity to undertake an optional assessed placement in a Specialist School. Students undertaking the Primary with SEND programme will be hosted in 2 SEND settings and undertake 2 placements in a Specialist School with the additional placement in a mainstream setting.","trainWithDisability":"All students receive the appropriate level of support according to their needs. We are a fully inclusive programme and all locations are fully accessible.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-12T20:49:19.412Z","updatedAt":"2021-10-01T16:52:13.596Z"}
