{"id":"d1e18920-2720-4378-b0a7-b615ab325da1","name":"Ashmead Combined School","code":"289","type":"lead_school","isAccreditedBody":false,"urn":"110356","ukprn":"10069370","address":{"addressLine1":"Ashmead School","addressLine2":"Cole Road","town":"Aylesbury","county":"Buckinghamshire","postcode":"HP21 8SU"},"contact":{"website":"http://www.ashmeadschoolteachertraining.org.uk","email":"teachertraining@ashmeadschool.org.uk","telephone":"01296 484434","fullName":"Marcus Pickover"},"location":{"latitude":51.8018932,"longitude":-0.8202985},"trainWithUs":"Ashmead School has been engaged in the delivery of Initial Teacher Training for over 10 years. As a Lead School based in Aylesbury, we are well placed to provide a centre for training that caters not only for those living within Buckinghamshire, but also areas of neighbouring Oxfordshire and Hertfordshire.\nThe partnership offers Initial Teacher Training opportunities across a diverse group of schools that collectively recognise the mutual value of providing the best opportunities for those wanting to join our wonderful profession. Our commitment is absolute, and to those wishing to join our partnership, we extend the warmest of welcomes.\nIf you would like further information about the training opportunities available through the Ashmead ITT partnership, please visit our website (http://www.ashmeadschoolteachertraining.org.uk/)","trainWithDisability":"Ashmead School is committed to equal opportunities and will not discriminate on the grounds of colour, race, nationality, ethnic origin, sex or marital status or on the grounds of disability.\nWe encourage all potential applicants to discuss their needs in order that we can consider them individually and explore any adjustments that can reasonably be made to offer the best learning experience. All efforts will be made to support an individual’s needs, but applicants should be aware that unsuccessful management of a condition may result in termination of the programme.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"6e6c8aa3-8d77-4c7d-af3c-4c7912b1cc2a","code":"T89","name":"Two Mile Ash ITT Partnership","description":"Two Mile Ash ITT Partnership is the longest-running, most well-established primary teacher training provider serving Milton Keynes and its surrounding counties, with 19 years’ experience in leading initial teacher training.\\r\\n\\r\\nPlease note, this is a School Direct Tuition Fee programme, if you have the requisite experience and come with the financial backing of a school, then you can consider the Postgraduate Teaching Apprenticeship programme, which is available through Two Mile Ash ITT Partnership."}],"createdAt":"2021-07-06T17:57:14.430Z","updatedAt":"2021-10-04T17:26:40.605Z"}
