{"id":"d2b7d074-fac9-42c5-a0d3-d5471b35f7d9","name":"Nottingham Trent University","code":"N91","type":"hei","isAccreditedBody":true,"ukprn":"10004797","address":{"addressLine1":"50 Shakespeare Street","county":"Nottingham","postcode":"NG1 4FQ"},"contact":{"website":"http://www.ntu.ac.uk/teach","email":"enquiries@ntu.ac.uk","telephone":"0115 848 4200","fullName":"Nottingham Trent University"},"location":{"latitude":52.9580712,"longitude":-1.1540226},"trainWithUs":"Nottingham Trent University's (NTU) reputation is long established. We've been training teachers and educational professionals for well over 50 years. Our greatest strength is our extensive links with schools and educational settings. These relationships enable every student to gain experience through placement in a wide variety of educational environments.\n\nWhy choose NTU?\nWorking with schools\nA great strength of our courses is the extensive partnership links that we have with over 600 primary, secondary and post-16 settings across the East Midlands. These relationships enable you to gain a wide experience of teaching in many different educational environments. Experiences vary from city centre to suburban and semi-rural settings, laying a sound foundation for future professional development.\n\nStudent diversity\nWe are committed to promoting a diverse body of teacher trainees. Our students are made up of different backgrounds, nationalities and faiths.\n\nExperienced lecturers and informed courses\nNTU is home to an enthusiastic, expert group of academic staff who are leading researchers and practitioners in the education field. This means that, not only is your course informed by the latest thinking, but also that you will learn from people with a real passion for their subject.","trainWithDisability":"You will receive lots of support based around your school placements, with planning sessions, mentors and pastoral support from your tutors and colleagues. You can also tap into a range of services at any time, including: Financial Support Services, Counselling, Disability Support, Support, Mature Student Support and Mental Health Support.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"createdAt":"2021-07-06T17:55:18.809Z","updatedAt":"2021-10-04T22:52:27.749Z"}
