{"id":"d2ba71f2-c125-4d86-bb22-736e67043120","name":"University of Brighton","code":"B72","type":"hei","isAccreditedBody":true,"urn":"133796","ukprn":"10000886","address":{"addressLine1":"Mithras House","addressLine2":"Lewes Road","town":"Brighton","county":"Brighton and Hove","postcode":"BN2 4AT"},"contact":{"website":"https://www.brighton.ac.uk","email":"enquiries@brighton.ac.uk","telephone":"01273 644644","fullName":"Registry - Admissions"},"location":{"latitude":50.8420449,"longitude":-0.1198916},"trainWithUs":"The University of Brighton is one of the UK’s largest providers of education and teacher training. We have a long-established reputation for high quality courses and have been educating teachers and other professionals for over 100 years. We were rated ‘outstanding’ by Ofsted in 2018 for early years, primary and secondary initial teacher training.\nAs one of the leading initial teacher training providers in the country, our strength lies with our school-led partnership, one that works to ensure trainee teachers receive the best possible support and education. Through our partnership we work closely with over 600 schools and colleges in the region who provide high quality school-based training opportunities. Our specialist facilities include the Curriculum Centre which houses more than 30,000 specialist resources for trainee teachers. We’re ranked in the top 20 for education courses in England in the Complete University Guide 2022. Our students develop the skills and knowledge needed to be great educators, able to change our societies for the better. Employment rates for our students are consistently above the sector average and they are highly sought by our partner schools.","trainWithDisability":"If you have a disability, long-term health condition or a specific learning difficulty, we will do everything we can to make sure you have equal opportunities to learn and take part in all aspects of student life. We have a dedicated team who will support you, and facilities and equipment to help you make the most of university.\nYou can find out more about how we can support you [on our website.](https://www.brighton.ac.uk/studying-here/applying-to-brighton/advice-for-students/index.aspx) You can also email us: disability@brighton.ac.uk or call us: 01273 643799.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"createdAt":"2021-07-06T17:55:55.844Z","updatedAt":"2021-11-03T18:50:41.219Z"}
