{"id":"d2ce1fbe-879c-42d1-b2ed-e27efee10045","name":"Castlebar School","code":"1RW","type":"lead_school","isAccreditedBody":false,"urn":"101966","ukprn":"10077040","address":{"addressLine1":"Castlebar School","addressLine2":"Hathaway Gardens","town":"Ealing","county":"London","postcode":"W13 0DH"},"contact":{"website":"https://www.castlebar.ealing.sch.uk/professional-services/school-direct-teacher-training/","email":"training@castlebar.ealing.sch.uk","telephone":"020 8998 3135","fullName":"Melanie Hogan"},"location":{"latitude":51.523341,"longitude":-0.329389},"trainWithUs":"Castlebar School is looking to train exceptional graduates to become teachers. Our Initial Teacher Training programmes are tailored to individual needs and aspirations. Whether you are a recent graduate or are considering a change of career, our programmes will give you the best foundation for a great career in teaching. We offer training routes in mainstream and special school settings.\nWe are seeking applicants who are passionate about education, have an excellent academic background, and are committed to working with children and young people to make a difference in their lives. This school-based teacher training route led by schools in partnership with universities and SCITTs means we can deliver training which blends theoretical study of learning, teaching and child development with practical experience in the classroom. We have an established record of supporting and bringing new talented teachers into the profession. Teachers in our Partner Schools are excellent practitioners, both supportive and eager to share their skills, knowledge and practice with the next generation of teachers.\nYou will benefit from: •\tA dedicated Mentor to support and guide you\n•\tOngoing CPD opportunities\n•\tCaring and supportive staff\nAll Primary and Special Schools who are in partnership with us have extensive experience of training teachers and we fully recognise how much vibrancy, enthusiasm and drive they can offer to a school community. As a result, our trainees are highly employable and we have a high employment rate upon course completion.","trainWithDisability":"Candidates who have disabilities or other needs should contact us before making an application to discuss their needs and the bespoke support that we can provide for them during their initial training year. Our individual Partner Schools have differing disabled access provisions, so if in doubt please contact us for more information.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:56:22.244Z","updatedAt":"2021-09-13T17:17:55.044Z"}
