{"id":"d2e3dada-3323-4884-8e6b-ee4b8a2bafc5","name":"Lee Chapel Teaching School Alliance","code":"16H","type":"lead_school","isAccreditedBody":false,"address":{"addressLine1":"The Knares","town":"Basildon","county":"Essex","postcode":"SS16 5RU"},"contact":{"website":"http://www.leechapel.essex.sch.uk","email":"teachertraining@leechapel.essex.sch.co.uk","telephone":"1268474177","fullName":"Miss Sally Brierley"},"location":{"latitude":51.564702,"longitude":0.445189},"trainWithUs":"Lee Chapel’s Core Values\n- Developing outstanding future teachers for the Basildon area.\n- Develop and identify potential school leaders to shape the future of children in Basildon.\nWhy train with the Lee Chapel Teaching School Alliance?\n‘As a trainee teacher at Lee Chapel I received outstanding support and encouragement from a hard-working team of teachers. Training within an ‘Outstanding’ school meant that I was able to immerse myself in the day-to-day running of a busy classroom and see for myself what the job really entails. I was able to secure a job in my main placement school, which means that I have firm relationships with my colleagues and felt immediately settled when it came to starting my NQT year. The transition was seamless. I know that I am able to call on the people around me and can ask for advice whenever needed. Without doubt, teacher training has been the most rewarding year of my life and has set me up for a long and successful career.’","trainWithDisability":"Here at Essex Teacher Training we are committed to offering all prospective trainees the opportunity to gain QTS. If you have a specific need, we can discuss this with you at interview and agree a suitable level of support.","accreditedBodies":[{"id":"00782614-9301-40e4-8832-9a74cc1bbb07","code":"E75","name":"Essex Teacher Training","description":"Essex Teacher Training is a large provider of ITT in the Eastern Region, offering a variety of different routes to QTS. Working with in excess of 80 schools in Essex and neighbouring counties, they provide excellent opportunities in primary, secondary and special schools. With excellent employment rates and over 95% of trainees finishing the programmes, each year, as good or outstanding, headteachers comment that trainees are well prepared for their NQT year."}],"createdAt":"2021-07-06T17:47:11.813Z","updatedAt":"2021-07-06T17:47:11.813Z"}