{"id":"d3a557f3-2a2d-4c1b-9956-37db0401d03e","name":"Eleanor Palmer Primary School","code":"14F","type":"lead_school","isAccreditedBody":false,"urn":"100027","ukprn":"10078057","address":{"addressLine1":"Eleanor Palmer Primary School","addressLine2":"Lupton Street","town":"London","postcode":"NW5 2JA"},"contact":{"website":"https://www.eleanorpalmer.camden.sch.uk/school-direct/","email":"vicky@eleanorpalmer.camden.sch.uk","telephone":"020 7485 2155","fullName":"Vicky Green"},"location":{"latitude":51.5546335,"longitude":-0.1386946},"trainWithUs":"Eleanor Palmer School leads the Camden Primary Partnership - a group of fantastic schools in an outstanding London borough. We work with the UCL Institute of Education (IOE), provider of first class teacher training for over 100 years.\nOur partnership aims to provide an outstanding education for all children in our community. We want to provide this opportunity for trainees because we believe in the importance of collaboration with an emphasis on good primary practice. This is our 9th year running this programme, which receives consistently great feedback. Students are placed within a partner school, choosing their specialist key stages. Students also meet in partner schools on Thursdays while on placement to observe lessons, creating a peer group which students find incredibly valuable in addition to study and school placements.\nThis year's programme includes workshops on setting up inspiring classrooms, using literature to enthuse, curriculum as behaviour management, and essentials of effective maths practice.\nOur students benefit from excellent support from Caroline Heal (consultant and former IoE tutor of 30 years ), a lead partnership mentor, Rosie Thomson (Eleanor Palmer School Deputy), school mentors, class teacher mentors and the student peer group. As the year progresses, our students guide our programme and we base sessions on specific needs and requests. We survey participants after every session for feedback on session impact.\nOur partner Camden primary schools are: Holy Trinity & St. Silas, Kentish Town, Thomas Coram, Torriano, Primrose Hill, Christopher Hatton, Fleet, Netley, Brecknock, Brookfield, Gospel Oak, Brookfield and Rhyl.","trainWithDisability":"School Direct students are entitled to support from the UCL Student Support and Wellbeing (SSW) team. You can find more information here:-\n\n(https://www.ucl.ac.uk/students/disability-support)","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-12T20:48:20.894Z","updatedAt":"2021-09-23T22:56:14.089Z"}
