{"id":"d41a1821-e35b-48eb-bf02-4842872b04a2","name":"University of Exeter","code":"E84","type":"hei","isAccreditedBody":true,"ukprn":"10007792","address":{"addressLine1":"Admissions, University of Exeter","addressLine2":"Innovation Centre","town":"Rennes Drive","county":"Exeter, Devon","postcode":"EX4 4RN"},"contact":{"website":"https://www.exeter.ac.uk/teachertraining/","email":"PGCE-admissions@exeter.ac.uk","telephone":"0300 555 6060","fullName":"PGCE Admissions"},"location":{"latitude":50.7371369,"longitude":-3.5351475},"trainWithUs":"We are leaders in Initial Teacher Education, consistently graded as outstanding in all areas by [Ofsted](https://files.api.beta.ofsted.gov.uk/v1/file/2739445) and ranked 3rd amongst university providers of teacher training in the most recent Good Teacher Training Guide (2017).\nWe have strong partnerships with over 250 schools in the south west where you will spend two-thirds of your training year, putting into practice what you have learnt on the taught course. Our PGCE is uniquely characterised by innovative research-led teaching informed by professional practice and academic excellence. All our tutors have real-world experience as teachers, senior managers or OFSTED inspectors. They lead and innovate, developing the latest ideas in teacher education, leading research, writing textbooks, leading subject networks and advising government.\nWe provide unrivalled opportunities for trainees to achieve through our highly original PGCE teaching model ‘The Exeter Model’, praised by OFSTED and cited as an example of best practice. By starting with a University-led taught course for most of the first term, you access the tools to rapidly build professional knowledge to underpin your work in school placements.\nOur unique approach gives you opportunities to become part of a community of trainees and teachers who are passionate about education and will support you during your course and beyond.","trainWithDisability":"The University of Exeter provides comprehensive student services that include AccessAbility and Wellbeing teams, Student Learning Skills Service, Student Advice Unit, Counselling Service, Students’ Union Advisors, Student Health Centre, Family Centre and the Chaplaincy.\nFor further details on the wealth of support available to you please go to [Student Support Services](http://www.exeter.ac.uk/newstudents/supportandservices/yourhealthandwelfare/#a4)\nPGCE trainees can access the support of a Wellbeing Services Welfare Consultant to discuss concerns, talk through options for support or understand more about how the University Wellbeing Services may be able to help.\nAlongside the support described above, every PGCE trainee is assessed by an Occupational Health provider as part of the admissions process to ensure they are fit to teach in a school setting. If the Occupational Health provider recommends any adjustments, the University’s Partnership Office will ensure you are placed in schools where these adjustments can be made, providing they are logistically possible and reasonable.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"createdAt":"2021-07-06T17:46:44.085Z","updatedAt":"2021-09-30T20:35:41.691Z"}
