{"id":"d42008b9-26c1-45a8-95c6-fefca8f13512","name":"BHSSA","code":"1KN","type":"lead_school","isAccreditedBody":false,"urn":"114607","ukprn":"10003169","address":{"addressLine1":"Hove Park School","addressLine2":"Hangleton Way","town":"Hove","county":"East Sussex","postcode":"BN3 8AA"},"contact":{"website":"http://www.hovepark.org.uk/","email":"schooldirect@hovepark.org.uk","telephone":"1273082841","fullName":"Jade Doig"},"location":{"latitude":50.844912,"longitude":-0.2018483},"trainWithUs":"The Brighton & Hove School Direct Partnership is a large alliance of schools from Brighton & Hove and the surrounding area. As a partnership Hove Park School is the Lead School in an alliance of 27 different schools from across the City and beyond, and we are committed to initial teacher training, we feel that training with us is a highly rewarding and innovative experience that will provide you with an excellent training ground in your first steps to becoming an outstanding practitioner. \n\n•The Primary, secondary schools and Sixth form Colleges in our alliance have had consistently good and outstanding OFSTED grading for their teaching and learning in recent years.\n•Our schools are very experienced in both university and school based teacher training routes, and mentors and coaches are well trained to support you through your training year. We also have a network of very supportive and experienced professional tutors and in-school mentors that will stretch and challenge you, so that you become the best practitioner that you can over the year. \n• The diversity within the partnership enables you as a trainees to engage with a wide variety of teaching methods and styles of learning.\n•Each year we have a large selection of trainees in our schools, including PGCE, so you will not be alone but will benefit from the peer to peer support that is so important when learning new skills.","trainWithDisability":"As a partnership we do our best to cater for all individual needs. Applicants would need to be in contact with the schools directly to see what support they have in place.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:49:40.767Z","updatedAt":"2021-10-05T15:09:09.757Z"}
