{"id":"d4456a4a-cfcc-4451-a178-cde0016546a7","name":"Hall Mead School","code":"1GJ","type":"lead_school","isAccreditedBody":false,"urn":"137197","ukprn":"10034666","address":{"addressLine1":"Hall Mead School","addressLine2":"Marlborough Gardens","town":"Upminster","county":"Essex","postcode":"RM14 1SF"},"contact":{"website":"https://www.haveringteachertraining.co.uk","email":"aaslan@elatschools.co.uk","telephone":"01708 255006","fullName":"Amanda Aslan"},"location":{"latitude":51.5642461,"longitude":0.2620639},"trainWithUs":"At HTTP, we support our School Direct trainees to become outstanding practitioners. We have a strong network of support and 100% pass rate for this programme, with exceptionally strong long term employment figures.\n“The partnership is a close-knit community of schools and educators across which trainees, mentors and professional tutors build positive and productive working relationships.” OFSTED 2021\nWe are passionate about our profession and our course is structured to provide a firm foundation for the start of your career; your learning will extend to your ECT years and beyond. Many of our past trainees fast track to positions of responsibility and offer an extended network of support in our Partner schools.\n“Partnership leaders have worked collaboratively to design an ITE curriculum that demonstrates high expectations for trainees’ development of subject expertise and classroom practice. Leaders have carefully planned the structure, sequence, and content of the programme. It includes all elements of the core content framework.” OFSTED 2021.\nTo prepare you for working in the classroom from day one, we run a bespoke 2 day end of summer Induction where you will learn about : lesson planning and behaviour for learning, ahead of beginning your teaching in September.\n“Trainees feel supported from the moment they start the programme.” OFSTED 2021\nThis route is appropriate for candidates who have already worked in a school, as an instructor or working will groups of students. You are expected to have the confidence to address and lead a class from the beginning of term.","trainWithDisability":"We welcome trainees with disabilities and other special needs. In recent years Havering schools have been modified in order to improve disabled access. Applicants who would benefit from disabled access should let us know in their application so that they can be considered for placements at the appropriate schools.\nHTTP has a partnership with \"Havering Mind\" who provide us with training, advice and support. Where Trainees have experienced problems they have been helped with personalised support tailored to their specific needs.\nA senior member of HTTP staff works closely alongside each trainee and small tutorial groups ensure personal attention. Training sessions are held weekly which guarantees regular contact with other trainee teachers. Past trainees have remarked upon the valuable personal support received during those challenging periods inevitable whilst training as a secondary school teacher.\nOur most recent Ofsted Report identified as a key strength: 'The high level of individual support, and adaption of the programme in response to individual needs.'","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:54:40.804Z","updatedAt":"2021-10-07T21:16:09.192Z"}
