{"id":"d4a93000-8658-4679-8125-92f6e35835f9","name":"Chiltern Training Group","code":"C59","type":"scitt","isAccreditedBody":true,"ukprn":"10055370","address":{"addressLine1":"Company Secretary Chiltern Learning Trust c/o Denbigh High School","addressLine2":"Alexandra Avenue","town":"Luton","county":"Bedfordshire","postcode":"LU3 1HE"},"contact":{"website":"https://www.chilternlearningtrust.org","email":"recruitment@ctg.ac.uk","telephone":"01582 493 680","fullName":"Karen Bateman Director of Training and P"},"location":{"latitude":51.8913483,"longitude":-0.4240396},"trainWithUs":"The Chiltern Training Group (CTG) is an outstanding provider (Ofsted, 2014) of school centred initial teacher training based in Luton. It has a long heritage of training teachers and we have been at the forefront of school centred initial teacher training for over 25 years. We have a strong partnership with The Acorn Training Group and together with its' family of schools, brings a wealth of expertise at primary level. We are part of the Chiltern Teaching School Hub.\nWe offer\n* Outstanding, personalised, high quality training\n* Training facilitated by experts in their subjects and chosen areas\n* Fantastic mentoring and school-based support\n* A blended learning experience where theory and practice merge\n* 'Learning on the job' to build skills and confidence\n* Excellent employment and professional development prospects\nA full range of training routes are offered from primary aged 3 to secondary aged 18. We believe the best place to train teachers is in schools and have access to an incredible range of different settings. Lower and Primary schools in rural settings, primary multi-ethnic urban schools, middle schools, special schools, upper and secondary high schools as well as a dedicated sixth form college.","trainWithDisability":"We welcome applicants with disabilities and other needs and where possible reasonable adjustments will be made to carry out your duties and meet the standards of teaching effectively.\nWe pride ourselves in supporting trainees however small or large your concerns may be. Your teacher training programme will be personalised for you to reach your full potential. This includes a range of academic and professional support from the central team and your placement school as well as your mentor.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:47:38.291Z","updatedAt":"2021-11-01T15:54:11.142Z"}
