{"id":"d4c14d22-ab8a-4734-880f-2c8e35898cda","name":"Kingston School Direct","code":"1FM","type":"lead_school","isAccreditedBody":false,"urn":"137848","ukprn":"10007776","address":{"addressLine1":"Coombe Girls’ School","addressLine2":"Clarence Avenue","town":"New Malden, Kingston upon Thames","county":"London","postcode":"KT3 3TU"},"contact":{"website":"https://sites.google.com/coombe.org.uk/cat-teacher-training/ksda","email":"twellb1@coombe.org.uk","telephone":"2089421242","fullName":"School Direct Admissions"},"location":{"latitude":51.4099484,"longitude":-0.2635318},"trainWithUs":"Our partnership aims to create a caring and vibrant environment, where trainee teachers can develop their teaching expertise, knowledge and skills while feeling valued and supported by expert professionals and inspirational leaders. Our teachers are excellent practitioners, committed to sharing their skills, knowledge and practice with the next generation of teachers. Coombe Girls' School is a nationally designated Teaching School judged 'outstanding' by Ofsted outstanding in every category at its last inspection.\nSchools involved in our programme have included:\nChessington Community College, Coombe Boys' School, Coombe Girls' School, Hinchley Wood School, King's College School (Wimbledon - independent), Raynes Park High School, Richard Challoner School, Rutlish High School, Southborough High School, The Holy Cross School, The Kingston Academy, The Tiffin School, The Tiffin Girls' School and Tolworth Girls' School. And in our primary programme:\nBurlington Juniors, Christ Church Primary (New Malden), Coombe Hill Infants, Coombe Hill Juniors, Ellingham Primary, Green Lane Primary, King's Oak Primary, Knollmead Primary, Robin Hood Primary, Sacred Heart Primary (Teddington) and St Mary's and St Peter's Primary (Teddington).\nThe unique strength to the secondary partnership lies in the diversity of provision, offering our student teachers an enriching, contrasting experience. The partnership includes co-educational schools, single sex, selective and non-selective and one independent. Our secondary programmes provide opportunities to develop post-16 teaching practice. Our schools enjoy a highly valued reputation locally, many oversubscribed due to the competitive, high-performing profile of our borough. Student behaviour is generally excellent and results show that many students consistently out-perform their national peers.","trainWithDisability":"All school direct students have full access to the student services in our university provider partners. This includes support services for students with a range of physical and mental health needs. Their campuses have full disability access.\nStudents may also access well-being and counselling services and support services for specific learning needs, including dyslexia and dyspraxia, through academic achievement advisers.\nThe Institute of Education has a nursery available (run by University College London). However, for student teachers we recommend you look into childcare options near your place of residence or host teaching school. Our partner universities also offer accommodation for student teachers, although it may be better to find accommodation near placement schools.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:53:44.503Z","updatedAt":"2021-10-04T18:37:36.238Z"}
