{"id":"d540e070-63f7-46ae-b5d8-5eb04c06e813","name":"The Viridis Schools Partnership","code":"2CN","type":"lead_school","isAccreditedBody":false,"urn":"100234","ukprn":"10078029","address":{"addressLine1":"Holcroft Road","town":"Hackney","county":"London","postcode":"E9 7BB"},"contact":{"website":"http://viridis-schools.co.uk/","email":"traintoteach@vs.hackney.sch.uk","telephone":"2089857785","fullName":"Stephen Hall"},"location":{"latitude":51.541008,"longitude":-0.04891},"trainWithUs":"Our in-school teacher training is based in the vibrant and diverse community of Hackney, East London with easy transport links into and out of Central London. We successfully provide for many children from disadvantaged backgrounds and have a passion for making a difference. Our teachers are committed to the fact that establishing a strong social and academic grounding will unlock the fantastic potential our pupils hold. We provide a rich and dynamic learning experience which will inspire our pupils, and have earned many awards and achievements that celebrate our inclusivity and curriculum design. Our schools have a long involvement with teacher training, and a strong commitment to on-going professional development for all our staff, with a great track record of training and developing professionals from their very first teaching experience through to experienced school leaders. We offer all students a mentor to work alongside, as well as links with other students and tutors across our organisation. We understand that the journey to being a great teacher is never simple and have the expertise and ambition to ensure that our programme is of the highest quality and personalised to the needs of each individual. If you want to work in a dynamic and forward thinking community school that really makes a difference for those who most deserve it, then we are the organisation for you.","trainWithDisability":"We are able to provide for a range of need, and our staff profile reflects this. Our schools are committed to safeguarding and promoting the welfare of children and young people and expects all staff and volunteers to share this commitment. We welcome applications from all sections of the community, regardless of gender, race, religion, disability, sexual orientation or age.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"30bda414-7b00-426c-956b-18a187efe967","code":"L68","name":"London Metropolitan University","description":"London Met have built successful, powerful partnerships with high-quality London schools to provide an excellent platform to develop your career as a teacher. We offer innovative, inspiring courses that are delivered by knowledgeable and experienced sector professionals. Employment prospects are excellent and many students are offered employment in their placement schools. London Met trainees have been praised by Ofsted for their “professional attributes… and their ability to manage pupils’ behaviour” as well as achieving employment and completion rates well above the national average."}],"createdAt":"2021-07-06T17:53:46.485Z","updatedAt":"2021-08-22T20:00:58.090Z"}
