{"id":"d610b465-87ae-4b54-8e94-8940d24de317","name":"City Learning Trust","code":"1JB","type":"lead_school","isAccreditedBody":false,"urn":"138549","ukprn":"10059284","address":{"addressLine1":"Haywood Academy","addressLine2":"High Lane","town":"Burslem","county":"Stoke-on-Trent","postcode":"ST6 7AB"},"contact":{"website":"http://www.citylearningtrust.org/","email":"dpoole@citylearningtrust.org","telephone":"01782 853535","fullName":"Adele Mills"},"location":{"latitude":53.0555109,"longitude":-2.1877764},"trainWithUs":"The City Learning Trust is a Multi Academy Trust founded in 2014. The CLT has five academies in membership covering approximately three thousand students aged three to nineteen. Our academies include Haywood Academy, Haywood Sixth Form Academy, Mill Hill Primary, Smallthorne Primary Academy and Trentham Academy. We offer a variety of secondary school direct subject places with Staffordshire University. Subjects include: English, Mathematics, Science, Art and Design, Business Studies, Computing, Geography and Physical Education. In addition, we have numerous primary places with Keele and North Staffordshire Teacher Education and with Staffordshire University. We provide high quality training that ensures trainees are fully prepared for life in the classroom and a career in education. Working closely with the partner universities, we ensure that our Schools Direct colleagues gain their teaching qualification (QTS) and a Postgraduate Certificate in Education (PGCE). If you choose to apply to the CLT and are successful, you are guaranteed placements at academies within our Multi Academy Trust. It is a privilege for us to be working in a diverse region with exceptional teachers. We respect the cultures and backgrounds of the young people in our settings, and we enable you to take seriously, issues of equality and social justice. In particular, we value the transformative role that a high quality educational experience has in enabling young people to become informed, empowered and engaged.","trainWithDisability":"It is a privilege for us to be working in a diverse region with exceptional teachers who value supporting trainees who also come to us with a range of prior experiences and needs. We enable you to take as seriously as ourselves issues related to inclusion, equity and social justice.\nKeele University and our school based teaching rooms have full access. Applicants who would benefit from additional support in relation to access should let us know on their application so that we can facilitate appropriate placements. We regularly support trainees with a variety of needs including for example dyslexia and dyspraxia, and find that they are able to thrive on our course. At the start of the programme you will all have the opportunity to disclose any needs that they may have so that the appropriate support can be put into place. Your mental health and wellbeing is a prime concern of ours. On the course you will be enabled to support others and so we will ensure that you are aware of how we can help you to meet your own needs so that you can thrive and enjoy our amazing profession. Keele and North Staffordshire Teacher have a Deputy Director who is pleased to be responsible for student welfare and also acts as the enabling coordinator. She can assist students in accessing the various excellent support services offered by Keele University. More information can be found at [Student Support] (https://www.keele.ac.uk/students/lifeoutsideofstudy/disabilityanddyslexiasupport/supportforcurrentstudents/reasonableadjustments/)","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"34f0b949-839c-4292-88c3-5289076bd205","code":"24J","name":"Keele and North Staffordshire Teacher Education","description":"KNSTE is an outstanding provider (2017) who works in close partnership with their school clusters. The programme is designed and managed by local headteachers and senior school leaders. They are relentless in pursing excellence in teaching so that the pupils in our school communities benefit from passionate and effective teaching. Evidence is used to inform and challenge school-based practice for the benefit of all. In this way your school and SCITT sessions are intertwined. We have been thrilled to employ previous trainees and are delighted that KNSTE has sustained its high recruitment, retention and employment rates"}],"createdAt":"2021-07-06T17:47:12.860Z","updatedAt":"2021-11-04T22:37:05.354Z"}
