{"id":"d63dbf19-431b-48e2-9905-17ebff79d484","name":"Harbour Learning Trust","code":"1ES","type":"lead_school","isAccreditedBody":false,"urn":"136277","ukprn":"10031358","address":{"addressLine1":"The Harbour Learning Trust, Healing Science Academy","addressLine2":"Low Road","town":"Healing","county":"Grimsby","postcode":"DN41 7QD"},"contact":{"website":"https://harbourlearningtrust.com","email":"ITT@healing-school.co.uk","telephone":"1472582557","fullName":"Lauren Hoyle"},"location":{"latitude":53.5743631,"longitude":-0.1637638},"trainWithUs":"The Harbour Learning Trust (HLT), School Direct (SD) Teacher Training programme is a 'hands-on' and 'bespoke' programme. Trainees spend the majority of their training year in their placement schools ‘learning on the job’ from outstanding experienced classroom practitioners. A key feature of The Humber Teaching School’s SD programme is that applicants decide which institution they wish to undertake their training in, therefore all of Phase One and Three are completed in the institution of the trainee’s choice. Trainees train in two contrasting institutions and SD places are offered across the full age range (from 11 through to 19-year-old students. The Harbour Learning Trust is extremely proud of its 100% success rate, achieved consistently since 2011 when the previous Humber Teaching School originated. All HLT trainees since this time, wishing to gain employment within the local area have done so. Many have gained employment within the partnership / alliance institutions. All placements through The Harbour Learning Trust are in outstanding and good local Secondary Schools and FE providers","trainWithDisability":"The Harbour Learning Trust cares equally about all of our trainees and aim to support the needs of every trainee with consistency throughout the entirety of the School Direct training year. We are very proud to offer a programme of ‘bespoke’ support and professional development that is suitable to the varying and individual needs of all our trainees. Applicants are not obliged to disclose their disabilities and appropriate provision will be provided for all trainees to promote positive equality.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:48:29.063Z","updatedAt":"2021-10-05T18:48:30.977Z"}
