{"id":"d6961000-f4b7-41cb-9dbd-4da057d9057d","name":"Kingston University","code":"K84","type":"hei","isAccreditedBody":true,"ukprn":"10003678","address":{"addressLine1":"Kingston Hill Campus","addressLine2":"Kingston Hill","town":"Kingston-upon-Thames","county":"London","postcode":"KT2 7LB"},"contact":{"website":"http://www.kingston.ac.uk","email":"education@kingston.ac.uk","telephone":"020 8417 5145","fullName":"Kingston University"},"location":{"latitude":51.4291912,"longitude":-0.26421},"trainWithUs":"Kingston University's Department of Education has a strong tradition of teacher training at Kingston Hill, going back to the formation of Gypsy Hill College (1917). We have an excellent reputation, both locally and nationally, and were ranked second overall in the UK for Education in the Guardian University Guide 2022. One of the key elements of our courses that students feel define their experience at Kingston is the excellent support they receive from tutors and school-based mentors on placement. We believe that this is a significant factor in the success students have in gaining their award of QTS and the PGCE, as well as finding employment. Our students become effective, creative, inclusive and evidence-informed teachers that are highly sought after by schools following graduation.\nOur courses are located on a spacious and beautiful site on Kingston Hill, set amongst natural woodlands adjacent to Richmond Park, yet within easy access of both Kingston upon Thames and Central London. This self-contained campus, with a range of facilities, is linked to other parts of the university by a free bus service and has free onsite parking for students.","trainWithDisability":"We welcome applicants from a wide range of backgrounds in addition to those with disabilities and specific needs to apply for our courses. Our Disability Team will be available to offer any guidance and support you may need for your interview at Kingston University or during the course.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"createdAt":"2021-07-06T17:56:14.010Z","updatedAt":"2021-11-16T17:34:05.323Z"}
