{"id":"d6fb80a1-7ba4-41ba-b07b-86a21ff1eb49","name":"St Patrick’s Greater Manchester Alliance","code":"18A","type":"lead_school","isAccreditedBody":false,"urn":"105986","ukprn":"10018025","address":{"addressLine1":"56 New Lane","addressLine2":"Eccles","town":"Salford","county":"Lancashire","postcode":"M30 7JJ"},"contact":{"website":"https://teachingschool.stpatricksrchigh.co.uk/initial-teacher-training/","email":"thestpatscentre@salford.go.uk","telephone":"0161 921 2323","fullName":"Teaching School Coordinator"},"location":{"latitude":53.4837161,"longitude":-2.3663123},"trainWithUs":"We aim to support and encourage the next generation of teachers through a personal approach to teacher training. You can decided to be based in our Salford or Blackburn hub to train.\n* Be a part of a family of Alliance of Schools working together to ensure that every pupil, in every school, is inspired, happy and achieving. * A personalised approached helping you to develop into the teacher that you want to be.\n* Supportive, well trained mentors, who work alongside you to ensure that you have the time to develop into an outstanding teacher. You have a dedicated mentor in your placement schools but also a coach from Saint Patrick’s and a University Tutor to help you across the entire year.\n* You will gain the skills needed to support pupils in their learning journey, gaining confidence to become a future leader in education.\n* You achieve both QTS and a PGCE providing you with the best possible start to your teaching career.\n* Our teacher training courses use outstanding facilitators, with a proven track record. These include: Outstanding teachers, Specialist Leaders in Education, a range of trained Pastoral Staff, SLT staff, Headteachers and National Leaders of Education. Please join us on Twitter by following @stpatsalliance we share advice on the application process but you can also see how our trainees this year are doing!\nPlease visit our [website] (https://teachingschool.stpatricksrchigh.co.uk/initial-teacher-training/course-information/)\nTeaching is a wonderful, exciting and joyous profession, we wish you all the very best with your applications.","trainWithDisability":"Please visit our [website] (https://teachingschool.stpatricksrchigh.co.uk/initial-teacher-training/course-information/) to find out more and those of our Alliance Schools.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:55:12.961Z","updatedAt":"2021-09-29T14:38:37.303Z"}
