{"id":"d791d177-2696-4fdf-9457-60723323183e","name":"Matrix ITT","code":"2D2","type":"lead_school","isAccreditedBody":false,"urn":"113033","ukprn":"10017007","address":{"addressLine1":"Hayes Lane","addressLine2":"Swanwick","town":"Alfreton","county":"Derbyshire","postcode":"DE55 1AR"},"contact":{"website":"www.matrixitt.co.uk","email":"teach@matrixitt.co.uk","telephone":"1773602198","fullName":"Chris Greenhough"},"location":{"latitude":53.0730781,"longitude":-1.3926784},"trainWithUs":"As a training provider we offer our trainees a diverse range of outstanding opportunities to help them become the best teacher they can be.\n\nOur programme firmly believes that educators of pupils (SEND/Primary) should be highly skilled and adaptable to be able to provide an educational experience to all their pupils that makes a difference.\n\nAll trainees will have placements in both SEND and Primary. This is to ensure you are an all round practitioner who can enable learning in an ever increasingly changing classroom environment.\n\nFor those trainees who successfully complete our course, employment opportunities are available in both the SEND/Primary sectors. \n\nAll trainees are placed within outstanding schools with outstanding mentors. This ensures that all trainees are supported to reach their potential whilst being exposed to highly effective and innovative practice.\n\nWe place a large emphasis on trainee development and invest additional time to allow all trainees to access CPLD opportunities that improves awareness of educational theories and pedagogies which can be utilised in both the SEND and Primary sectors.\n\nOur aim is to ensure all pupils receive the best education possible by enabling you to become the best teacher you can be.","trainWithDisability":"If you have a disability, including long term medical conditions, specific learning difficulties (such as dyslexia, dyspraxia and A(D)HD) and mental health conditions, you can access additional support for your academic studies whilst at Sheffield Hallam.\nStudents can receive support for a wide variety of conditions. There is extensive support available, including\n• Learning contracts- reasonable adjustments to your course such as extensions or extra time in exams\n• Support workers - like a mentor to help with organisation, or a personal assistant to help with mobility\n• Equipment/Assistive Technology and software - such as digital recorders or text to speech software\nWe have an on-site assessment Centre, the Sheffield Regional Assessment Centre, where a range of disability specialists can carry out Study Needs Assessments.\nWe run daily drop in sessions - come and talk to us, no appointment needed. You can also register for support online","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:49:17.020Z","updatedAt":"2021-11-02T15:22:48.886Z"}
