{"id":"d7af44d1-b971-4f3a-b3f2-8059dea6d4c6","name":"St Angela’s Teacher Training Centre","code":"1XC","type":"lead_school","isAccreditedBody":false,"urn":"102786","ukprn":"10006109","address":{"addressLine1":"St Angela’s Ursuline School","addressLine2":"St George’s Road","town":"Forest Gate","county":"London","postcode":"E7 8HU"},"contact":{"website":"www.stangelas-ursuline.co.uk","email":"nicola.dominique@stangelas-ursuline.co.uk","telephone":"0208 472 6022","fullName":"Teaching School"},"location":{"latitude":51.542361,"longitude":0.0274977},"trainWithUs":"St Angela's Teacher Training Centre, currently comprises of secondary, primary and all through schools spread across East London and Essex with St. Angela's Ursuline in Newham as the lead school. Please see the website for a detailed list of partner schools.\nWe are committed to the provision of outstanding teacher training and have a long track record in this area going back to the time of training schools. All our partners are equally committed and in StATTC you will get excellent training in the broadest possible range of contexts. We are forward thinking and want people to train with us who share our inclusive vision and have a can do attitude. Many previous trainees have gone on to highly successful teaching careers, often with very rapid promotion. In order to extend even further the quality of our training, alongside our desire to recruit and retain the best staff, we are now a major partner in a new SCITT (School Centred Initial Teacher Training). Through Partnership London SCITT we offer the very best training from outstanding and experienced practitioners - people who spend the majority of their working week in the classroom. The great strength of StATTC and therefore PLS is the quality and vibrancy of the young people in our schools. From a very wide variety of cultural backgrounds they want to succeed and education is greatly valued by parents and students alike. We offer a great place to learn your craft and develop your teaching skills.","trainWithDisability":"All St Angela's Ursuline and PLS partner schools are compliant with disability access","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"a6a60029-f606-42b6-b526-48360b61890c","code":"2B1","name":"Partnership London SCITT (PLS)","description":"PLS sees teaching as a vocation and we aim to recognise and respond to the talents and needs of every trainee and provide the best means of developing their full potential. \\r\\nWe will recruit, train and retain the very best teachers. A key part of our philosophy is that we ensure equality of opportunity and welcome, value and respect all who train with us.\\r\\nWe aim to build a learning community based on justice and a sense of personal responsibility. Central to our philosophy is promoting dialogue and cooperation with the wider community and encouraging a commitment to life-long learning."}],"createdAt":"2021-07-06T17:46:21.216Z","updatedAt":"2021-10-01T01:16:16.958Z"}
