{"id":"d80a7bc2-a97d-4f03-8f65-0b90657ebe45","name":"St Francis of Assisi Catholic Primary School","code":"2JV","type":"lead_school","isAccreditedBody":false,"urn":"142732","ukprn":"10056130","address":{"addressLine1":"St Francis of Assisi School","addressLine2":"Jessopp Road","town":"Norwich","county":"Norfolk","postcode":"NR2 3QB"},"contact":{"email":"office@st-francisofassisi.norfolk.sch.uk","telephone":"1603441484","fullName":"Felicity Hope"},"location":{"latitude":52.6242734,"longitude":1.2647763},"trainWithUs":"St Francis of Assisi Catholic Primary School is based in Norwich and has approximately 420 children on roll. We are part of the St. John the Baptist Catholic Multi-Academy Trust, which consists of Notre Dame High School and a number of Norfolk and north Suffolk primary schools. Trainees will have the option of working in any of our CMAT primary schools; you do not have to be Catholic to apply to our course - just supportive of our ethos.\nAt St Francis of Assisi, as in all our CMAT primaries, we are constantly striving to provide outstanding teaching and learning opportunities and experiences. Our drive for excellence means that we keep abreast of current research and we incorporate best practice into all that we do.\nWe place a strong emphasis on enabling children to achieve the highest standards in essential areas of learning, such as literacy and numeracy, whilst at the same time bringing learning alive, making it exciting and stimulating through a creative curriculum. Teamwork is a very strong feature of all our schools - as a trainee you will be welcomed, valued and supported throughout your time with us. We have a dedicated Well-being Team and many staff who have previously worked alongside trainee teachers.\nIn addition, our Teacher Training Lead at St Francis has worked with SCITT students for many years, as well as providing centre-based training sessions on various aspects of teaching.","trainWithDisability":"Suffolk and Norfolk SCITT supports all trainees based on their individual needs. Recently this has included those with dyslexia, physical, hearing and visual impairments and mental health conditions. Plans are developed with trainees to ensure that they can fully access in centre training, operate effectively on school placement and complete written assignments.\nSuffolk & Norfolk Primary SCITT training venues in Ipswich and Norwich have full disabled access as do partnership schools. However, applicants who would benefit from disabled access should let us know on their application so that they can be considered for placements at the most appropriate schools.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"89831af6-535f-471b-aa97-098bd1a93291","code":"S13","name":"Suffolk and Norfolk Primary SCITT","description":"The Suffolk and Norfolk Primary SCITT programme is a personalised, relational and ethical training provider. Primary SCITT has very high attainment and employment outcomes for trainees. On average 95% of trainees are employed in local schools by the end of their training year. \\r\\nTrainees are supported by school mentors and SCITT Tutors who have a range of experience in schools as classroom practitioners and often headteachers or members of senior leadership teams, so have a wealth of experience to share with trainees. \\r\\n\\r\\nThe Primary SCITT course is a highly personalised course which offers a wide range of opportunities to trainees."}],"createdAt":"2021-09-26T00:58:33.151Z","updatedAt":"2021-09-27T20:03:36.231Z"}
