{"id":"d876cd6a-344b-4e61-833a-7be7e9747a7a","name":"Devon Primary SCITT","code":"D40","type":"scitt","isAccreditedBody":true,"ukprn":"10059112","address":{"addressLine1":"Trinity Primary School","addressLine2":"Fish Street","town":"Exeter","county":"Devon","postcode":"EX2 7TR"},"contact":{"website":"http://www.dpscitt.ac.uk","email":"lflounders@dpscitt.ac.uk","telephone":"01392 790 164","fullName":"Devon Primary SCITT"},"location":{"latitude":50.6970066,"longitude":-3.4801511},"trainWithUs":"Devon Primary SCITT provides outstanding personalised school-based training across Devon, Plymouth and Torbay. Founded in 2000, we are a very committed partnership of 50 primary and special schools, passionate about inspiring the next generation of reflective, creative and resilient teachers. We are extremely proud of our reputation for developing successful teachers, with strong foundations for fulfilling teaching careers. Our family ethos means that we keep in touch with former trainees, many of whom are now Headteachers or Senior Leaders.\nAt the heart of our Partnership and course is our focus on:\n* Children’s development and learning * Strong relationships and personal support\n* Cohesive and interactive training * Dialogue and individual coaching\n* Reflection and applied learning.\nWhat others say:\n* OFSTED judged us to be Outstanding in all 4 of our inspections (2003, 2006, 2009 & 2016). Their latest report commented on our “Outstanding personalised training, professional development and pastoral support” and our “dynamic training programme that is carefully tailored to meet the needs of each trainee and …. gives them the best possible start to their teaching career” (Ofsted, 2016)\n* The “Good Teacher Training Guide” has consistently ranked us in the Top 5 of National Training Providers.\n* We were awarded “Provider of the Year” in 2019 by the National Association of School-based Teacher Trainers. As part of our commitment to ongoing personal and professional support through our graduates’ careers, we also provide high quality Early Career and Subject Leadership Programmes through the Devon Training School Partnership.","trainWithDisability":"We have extensive experience of supporting trainees with a range of physical and specific learning difficulties, ensuring that their individual needs are met. In addition to the time, resources and strategies provided by Course Tutors, trainees are encouraged and supported to apply for the Disabled Student Allowance. This is used to fund further study support which is organised with external agencies, such as Contacts Associates.\nDescribing the accessibility of the course as “amazing”, a trainee with autism commented that she “really enjoyed the course and [was] incredibly impressed with how adaptable and efficient it has been”. (Corrine, former trainee)\nThe course is highly personalised and supportive. Each trainee has a Personal Tutor (either the Director or Deputy Director) to provide pastoral and professional support throughout the course. This approach enables us to cater for individual needs with speed and flexibility, and is a key strength of the course. “The pastoral and professional support of DPSCITT staff is amazing, and a stand out feature of the course.” (Alannah, former trainee)\nRegular 1:1 meetings are timetabled with Personal Tutors to discuss each trainee’s needs and wellbeing, and trainees are encouraged to seek further support when necessary. Each week, School-based Tutors provide quality time to support each trainee, planning and coordinating their individual training programme. “Learning Conversations … are at the heart of this outstanding training programme. Skilled DPSCITT and school-based staff ensure each conversation is personal to that trainee and focused on their specific learning successes and areas for development.” (Ofsted, 2016)","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:48:18.170Z","updatedAt":"2021-10-06T21:11:45.374Z"}
