{"id":"d8b99dc6-52c0-4d80-925e-28c11c305477","name":"University of Plymouth","code":"P60","type":"hei","isAccreditedBody":true,"urn":"133865","ukprn":"10007801","address":{"addressLine1":"Nancy Astor Building, 3rd Floor","addressLine2":"Drake Circus","town":"Plymouth","county":"Devon","postcode":"PL4 8AA"},"contact":{"website":"http://www.plymouth.ac.uk","email":"admissions@plymouth.ac.uk","telephone":"01752 585858","fullName":"PGCE Admissions"},"location":{"latitude":50.3766065,"longitude":-4.1380195},"trainWithUs":"With a mission to advance knowledge and transform lives through education and research, the University of Plymouth is among the emerging global elite of modern higher education institutions. Plymouth is distinguished by its approach to combining world-class research and teaching with a commitment to widening participation and social inclusion. We aim to ensure you have every opportunity to stretch yourself and explore within a supportive environment.\nOur University campus is at the centre of a thriving, ocean front city in one of the UK’s most beautiful regions. Plymouth has everything you would expect from the largest city in the South West – major high street stores, theatres, multiplex cinema, art cinemas, and a wealth of small clubs and venues. We also enjoy easy access to the fine beaches and beautiful countryside of the South West.","trainWithDisability":"Disability Services is part of Learning Support and Wellbeing and is here to help with your study support requirements if you have a disability. \n\nWhether you're a prospective student, applicant, current student or member of staff supporting students, we are here to assist.\nMore information on University of Plymouth Disability services can be found [here](https://www.plymouth.ac.uk/student-life/services/learning-gateway/disability-and-dyslexia)","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"createdAt":"2021-07-06T17:52:05.185Z","updatedAt":"2021-09-08T19:37:39.540Z"}
