{"id":"d8c030de-91f2-420d-9ff7-4286c7f913fa","name":"Edge Hill University","code":"E42","type":"hei","isAccreditedBody":true,"urn":"133828","ukprn":"10007823","address":{"addressLine1":"Edge Hill University","addressLine2":"St Helens Road","town":"Ormskirk","county":"Lancashire","postcode":"L39 4QP"},"contact":{"website":"http://www.edgehill.ac.uk/postgraduate/pgce","email":"study@edgehill.ac.uk","telephone":"01695 657000","fullName":"Admin"},"location":{"latitude":53.5596255,"longitude":-2.8738368},"trainWithUs":"Edge Hill University is based on an attractive, award-winning 160-acre campus in Lancashire, close to Liverpool and Manchester. By choosing us for your PGCE, you will be joining a university that has been training teachers for 130 years, offering:\n* Expert tuition – highly experienced tutors and researchers share their knowledge to enable you to become an excellent practitioner. Many of our staff are active in classroom-based research and in publishing national papers and texts for school and colleges, while others have high profile roles within examining boards and subject associations;\n* Working in partnership – we have developed strong relationships with over 3,000 partner schools, colleges and other settings, enabling you to gain extensive experience in a variety of settings, with professional practice placements matched to your training needs;\n* A stimulating learning environment – our Faculty of Education is located in a £9 million purpose-built facility which makes for a stimulating learning environment. This stunning lakeside building features a 300-seat lecture theatre, well-equipped ICT suites and teaching rooms complete with the very latest technology, plus a popular cafe;\n* Outstanding student support – we adopt a personalised approach to your development as a teacher. You will be supported by an Edge Hill tutor and up to two mentors in practice. Your mentors are enthusiastic classroom practitioners, with a real commitment to teacher education, who will spend a considerable amount of time training you. They will also provide specific support in your specialist subject area.","trainWithDisability":"[The Inclusion Team ](https://www.edgehill.ac.uk/ls/disability-support/) provide information, guidance and support to applicants and students who have disclosed any of the following: Autism Spectrum Conditions (ASC), Mental Health, Sensory Impairment, Mobility difficulties or a medical condition e.g. Epilepsy, Diabetes, Heart Condition, Asthma and we work closely with academic and support staff across the University.\nLearning Services provides support to students with a specific learning difficulty – SpLD, such as Dyslexia.\nWe encourage disabled applicants to make contact with us early in the application process to enable us to plan for support you may need right from start of your university course. We provide a friendly and professional service and applicants and students can discuss individual requirements in complete confidence. Our highly experienced team are here to advise about:\n* Impact of disability/health condition and potential impact on study\n* Support available including 1-1 sessions, group support and study skills sessions\n* The benefits of a Student Support Plan\n* Disabled Students Allowance (DSA) and eligibility\n* Reasonable adjustments to support your study\n* Exam modifications and alternative assessments\n* Rights and Responsibilities\n* Support whilst on placement (e.g. access and transport)\n* Disclosure and Confidentiality\n* Rights and Responsibilities\n* PEEPs and Emergency Action Plans\nOne of our priorities is to ensure safe environment for all students. If you have Epilepsy, Diabetes, Asthma or another serious health condition which may require First Aid, we recommend that you complete our Emergency Action Plan. We can discuss this with you when we see you.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"createdAt":"2021-07-06T17:54:16.938Z","updatedAt":"2021-07-23T18:50:46.574Z"}
