{"id":"d8c263a3-b1da-4ce9-bd5f-246ccd63236b","name":"South Bromsgrove Teacher Training Partnership","code":"19S","type":"lead_school","isAccreditedBody":false,"urn":"140292","ukprn":"10043915","address":{"addressLine1":"South Bromsgrove High School","addressLine2":"Charford Road","town":"Bromsgrove","county":"Worcestershire","postcode":"B60 3NL"},"contact":{"website":"http://www.sbhteachingschool.org.uk","email":"training@southbromsgrove.worcs.sch.uk","telephone":"01527 962021","fullName":"Andrea Taylor"},"location":{"latitude":52.3249216,"longitude":-2.0611586},"trainWithUs":"South Bromsgrove High Teacher Training Partnership provides a high quality, school-based learning opportunity. ‘South’ is an outstanding school (Ofsted 2012/13) where students enjoy learning in a way which stimulates their imagination and creativity. We maintain high standards of achievement, offer a broad and relevant curriculum, and place great emphasis on high quality learning experiences in lessons.\nThe unique aspect of our School Direct training programmes is that delivery is shared across schools from our wider alliance, who have specific areas of expertise. This allows insight into First, Middle, High and Special Schools and a broader understanding of education and pedagogy. Our highly successful primary programme is coordinated by St John’s CofE Middle School (judged Outstanding by Ofsted in 2012) and placements are provided in a range of excellent local First, Middle and Primary Schools. All schools in our partnership are highly committed to the training of teachers in a school based environment with access to high quality support from Higher Education Institutions. South Bromsgrove TTP has experienced subject and professional mentors who are involved in the planning and development of the School Direct courses. Every trainee is assigned a Professional and Subject Mentor who will be experienced in mentoring, coaching and giving feedback. You will meet with your mentor regularly, to review and set targets related to the teacher standards.","trainWithDisability":"South Bromsgrove Teacher Training Partnership recognises that teachers with disabilities make an important contribution to schools, both in the classroom and in shaping the wider culture and ethos. We value diversity and the unique contribution that all staff and trainees bring. We welcome applications from candidates with disabilities or specific educational needs and we are committed to fulfilling our duty to make reasonable adjustments to ensure that all trainees can access all aspects of our training provision. We also work closely with our accredited providers to ensure that support mechanisms are in place for emerging needs of trainees throughout the course.\nSpecific support might include:\n* Training materials produced in advance or made available online;\n* Specific print requirements, such as large print / coloured paper; * Flexible working hours;\n* Wheelchair access to relevant training / classrooms;\n* Designated quiet working areas.\nIt is a trainee's choice whether or not they disclose disabilities to us, but we would encourage you to do so in order that we can support you fully in completing your training.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"0ab5238e-606a-4f42-9aea-90d321ad7dc8","code":"2B3","name":"Haybridge Alliance SCITT","description":""},{"id":"6019b3ce-f2f6-4b0e-b2a9-5813d74c4d54","code":"W80","name":"University of Worcester","description":""}],"createdAt":"2021-07-06T17:54:27.477Z","updatedAt":"2021-10-12T20:09:45.970Z"}
