{"id":"d907cf6c-b11c-4379-bb76-f9c12b607e04","name":"The Heath Consortium","code":"1DO","type":"lead_school","isAccreditedBody":false,"urn":"136779","ukprn":"10003957","address":{"addressLine1":"The Heath School","addressLine2":"Clifton Road","town":"Runcorn","county":"Cheshire","postcode":"WA7 4SY"},"contact":{"website":"www.theheathschool.org.uk","email":"jdooley@heathschool.org.uk","telephone":"01928 576664","fullName":"E Robinson"},"location":{"latitude":53.3262938,"longitude":-2.7230671},"trainWithUs":"The Heath Consortium is a network of schools across Halton, Wirral, Liverpool and Cheshire. We have been a School Direct provider since this route began, as such we have expertise and a successful history of effective Initial Teacher Education with high employment rates and student satisfaction. Our aim is to train outstanding, reflective primary and secondary teachers to ensure that you are fully equipped for your NQT year and to ensure that the young people in our region, and beyond, receive the best education possible.\nOn successful completion of the course you will receive Qualified Teacher Status with a PGCE with 60 Masters level credits.\nIf you choose to train to teach with The Heath Consortium you will enjoy:\n* Training days delivered by highly skilled, current practitioners who are Specialist Leaders of Education. Training is research based and reflects the needs of our trainees. It is designed to have an immediate impact on improving the quality of your classroom practice.\n* Excellent support from well trained subject and school mentors who will provide quality feedback to enable you to make rapid progress.\n* Bespoke training and placements in a range of primary, secondary and special schools across the Greater Merseyside region. * Commitment to supporting you to find your first teaching position.\nThe Heath Consortium is committed to supporting trainees to fulfil their potential during this challenging and rewarding year, in preparation for a successful teaching career.","trainWithDisability":"The Heath Consortium with LJMU is committed to Equality of Opportunity and proud of the help we offer. The Disability Advice Team will help you access the support you need. The best time to contact the Disability Advice Team is before you start your course. By contacting the team before you begin and disclosing your disability, you'll be able to receive support from when you arrive. Email: disability@ljmu.ac.uk Tel: 0151 231 3164/3165.\nIf you need an Individual Student Learning Plan (ISLP) which sets out the type of support you may need and who is responsible for ensuring your support is in place, this will be put in place by an LJMU Disability Adviser once you have met to discuss your needs. Once finalised, your plan will be sent to you via email. As soon as you have agreed the ISLP it will be sent to your Disability Coordinator and then, with your agreement, passed on to the relevant academic and support staff.\nAll trainees are encouraged to disclose any specific learning need that they experience, in order to make any adjustments, both at your home school and LJMU. As part of the enrolment process to Teacher Training Programmes all students are required to complete a Health Questionnaire and some may be asked to attend a screening appointment with our Occupational Health Unit. This is designed to ensure that arrangements are in place, from the outset, to support any students who may need additional support or reasonable adjustments to be made.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"ec34b77c-cba3-4598-93be-23f0471adff1","code":"L51","name":"Liverpool John Moores University","description":"Our accredited body, Liverpool John Moores University has an established reputation for high quality Teacher Training. The LJMU Partnership’s 2019 OFSTED inspection outcomes were the best on Merseyside with Primary provision graded Outstanding and Secondary programmes judged to be Good. Our Partnership with LJMU ensures that our teachers develop a deep and research-informed understanding of subjects, the curriculum, learners and learning. The Postgraduate Award from LJMU is co-designed to ensure that teaching and assignments are embedded in classroom practice. There is significant academic and pastoral support from LJMU, whose staff also visit our students and their mentors on placement"}],"createdAt":"2021-07-06T17:53:14.129Z","updatedAt":"2021-10-04T23:14:10.377Z"}
