{"id":"da22fdaa-acc6-495d-9923-ea4cad2f0e74","name":"Middlesbrough Schools’ Teaching Alliance","code":"1SP","type":"lead_school","isAccreditedBody":false,"urn":"144136","ukprn":"10007713","address":{"addressLine1":"Gribdale Road","addressLine2":"Pallister Park","town":"Middlesbrough","postcode":"TS3 8PW"},"contact":{"website":"www.pallisterparkprimary.co.uk","email":"teach@oc1st.co.uk","telephone":"01642 242174","fullName":"Andrew Mackle"},"location":{"latitude":54.561142,"longitude":-1.19993},"trainWithUs":"Schools within our alliance are great places to work and learn. They provide a unique school based learning opportunity in partnership with the lead school, Pallister Park Primary, Green Lane Primary and York St John University. Our school-centred (School Direct) programme is a community of learning with partnership at the heart of the programme. The partnership work together to help develop outstanding teachers who are:\n•\ttransformative and creative professionals; •\thighly motivated and committed; •\tautonomous and independent;\n•\tenquiry based self-reflective practitioners. The programme is committed to delivering focused education and training that is current and relevant and that provides excellent opportunities for student teachers to develop their knowledge and understanding of their subject and wider educational issues, so that they are equipped to be outstanding teachers and leaders. Our work is rooted in the vision of providing opportunities and experiences that meet the needs of all our pupils....and where all leaders and managers are effective and inspirational in improving teaching. We create an environment in which staff, pupils and trainee teachers alike feel valued and supported. We have worked with trainee teachers for many years and we fully recognise how much vibrancy, enthusiasm and drive they can offer to a school community. Our schools serve varied urban contexts that provide a unique opportunity to experience a diverse and contrasting range of teaching and training experiences. They are eager to share their skills, knowledge and practice with the next generation of teachers.","trainWithDisability":"Applications are welcome from candidates with disabilities and/or other needs.\nMost of our schools have good wheelchair access and, if required, placements for candidates who would require wheelchair access are matched to a school's layout and provision.\nCandidates with dyslexia can receive additional support from our schools in our alliance allowing them to access the programme and meet the academic and professional requirements required.\nSuccessful candidates can also access the full range of student services offered by our partner University of York St John.\nYou can be assured that we have Covid 19 secure arrangements in place for the duration of the current situation.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"b011427a-6dff-4a77-9df3-c85a54be605a","code":"Y75","name":"York St John University","description":"Partnership working with York St John University is very strong giving students access to a range of services and high quality tuition and mentoring."}],"createdAt":"2021-07-06T17:53:25.302Z","updatedAt":"2021-10-08T14:25:20.602Z"}
