{"id":"da50cf69-960a-4c7e-b113-ef6cea1c32d5","name":"Portsmouth Primary SCITT","code":"P82","type":"scitt","isAccreditedBody":true,"ukprn":"10042780","address":{"addressLine1":"Portsmouth Primary SCITT","addressLine2":"Allaway Avenue","town":"Portsmouth","county":"Hampshire","postcode":"PO1 1JE"},"contact":{"website":"http://www.portsmouthscitt.co.uk","email":"admin@portsmouthscitt.co.uk","telephone":"023 9237 3432","fullName":"Portsmouth Primary Scitt"},"location":{"latitude":50.8493486,"longitude":-1.0921954},"trainWithUs":"Why choose us?\n- 18 years experience of bespoke school based teacher training\n- Exceptional retention rates (95% of our trainees are still in the teaching profession 5 years later\n- 100% employment for the last 5 years\n- Outstanding provider since 2004 (OfSTED)\nVisit our website (www.portsmouthscitt.co.uk) for more information regarding our course.\nThe course is run alongside Beacon View Primary Academy, Portsmouth. It is a one year course that qualifies successful primary students to teach children aged 5-11 years in primary, junior and infant schools. We offer a PGCE and QTS (option for Masters credits) validated by the University of Portsmouth.\nPortsmouth Primary SCITT can give a considerable amount of individual support to each trainee. Our aim is to train good teachers and our standards are high. You will have the opportunity to observe good teachers at work and be able to work alongside them, gradually developing your own teaching skills. You will receive high quality mentoring, together with support from the SCITT team to enable you to develop into a competent and confident newly qualified teacher.\nA strong feature of the course is the mutual support that the trainees give one another. The group is usually around 36 in number – a good size for cohesion and diversity. Lasting friendships are made. And what trainees learn about team work serves them well when they graduate to become Newly Qualified Teachers in their first posts.\nPast trainees have said \"Exceptional course, very well managed\".","trainWithDisability":"Portsmouth Primary SCITT is committed to the inclusion of all eligible participants. There are no significant differences in the outcomes achieved by different groups of trainees. This is the result of high quality training which is carefully personalised. Each year an Intervention & Inclusion Log monitors and supports a variety of declared or emerging needs. Bespoke training is essential to ensuring every trainee has the opportunity to maximise his or her potential.\n\nWe have specific support in place for students with additional needs. For example, students with dyslexia are offered additional support with assignment writing. We also offer extended pastoral support to students struggling with mental health or anxiety conditions.\n\nPlacements are carefully chosen taking in account the varying needs of students. These might include: parents who require a placement closer to home; access based on physical needs; or whether the mentor and school are a 'good fit' based on the emotional needs of students.\n\nPortsmouth Primary SCITT is focussed on establishing firm relationships with all stakeholders and we are therefore able to tailor training to meet the needs of individual students. \n\nPast trainees have said:\n\"The training I received at SCITT has given me a wealth of tools and strategies in all areas of teaching. My placements were selected based on my strengths and weaknesses. I was supported by the SCITT staff throughout. The pastoral care given has been exemplary. I also received advice when applying for jobs based on my particular skill set, which was invaluable to me\".","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:56:52.538Z","updatedAt":"2021-10-14T19:36:25.110Z"}
