{"id":"da626d9f-2951-449b-b7da-fe1a66f9dc4e","name":"Education Teaching Alliance Lewisham","code":"1GA","type":"lead_school","isAccreditedBody":false,"address":{"addressLine1":"Fairlawn and Haseltine Federation","addressLine2":"Fairlawn Primary School","town":"Honor Oak Road","county":"London","postcode":"SE23 3SB"},"contact":{"website":"http://etal.org.uk","email":"enquiries@etal.org.uk","telephone":"0208 6997948","fullName":"Christina Jenner"},"location":{"latitude":51.4469073,"longitude":-0.0546017},"trainWithUs":"Education Teaching Alliance Lewisham (ETAL) is part of Fairlawn and Haseltine Federation with 10 School Direct Salaried (SDS) and 10 School Direct tuition fee (SDt) places for 2019/20. The unique qualities and different catchment areas of schools working with ETAL provide a dynamic environment in which to train. Fairlawn Primary, the lead school, is judged Good. In partnership with Bromley Schools' Collegiate, ETAL provides high quality teacher training ensuring trainees are equipped to drive their own professional development by building a strong skill set with trainees being encouraged to become involved in joint practice development, mini action research and paired observation. All trainees are expected to participate in day to day school life and work the whole school year so that the immersion experience of school direct is complete. You must be prepared to travel to Bromley Schools' Collegiate in Chislehurst every Friday.","trainWithDisability":"Equality of opportunity for all sections of our community and workforce is an essential value for LB Lewisham. Everyone has a role to play in ensuring fairness towards colleagues and the community. Showing that we value all staff, providing everyone with what they need to do a good job, creating opportunities to develop new skills and progress within our schools, are all important ways of demonstrating equal opportunities in practice. Our policies are designed to set a framework for schools to do this. Teachers and trainees with disabilities or from diverse communities, make an important contribution to schools both in the classroom and in shaping the wider culture and ethos of the schools they work in. Our schools value and promote diversity and the unique contribution that all their staff and trainees bring. It is a personal choice if you wish to inform a school about your disability. The advantage of disclosure is that it enables support and reasonable adjustments to be put in place. All schools campuses are different but all have an Accessibility Plan. Please contact individual schools for more information.","accreditedBodies":[{"id":"2cb11a46-97d4-4ced-a702-0dc37f7d6ebb","code":"B91","name":"Bromley Schools Collegiate","description":"We have been working in partnership with Bromley Schools’ Collegiate since 2015. For more information: https://www.bscteach.co.uk"}],"createdAt":"2021-07-06T17:56:33.280Z","updatedAt":"2021-07-06T17:56:33.280Z"}