{"id":"da8e5252-e14a-470a-8247-00b835a79010","name":"University of the West of England, Bristol","code":"B80","type":"hei","isAccreditedBody":true,"urn":"133798","ukprn":"10007164","address":{"addressLine1":"Bristol, University of the W/E","addressLine2":"Frenchay Campus","town":"Coldharbour Lane","county":"Bristol","postcode":"BS16 1QY"},"contact":{"website":"http://www.uwe.ac.uk","email":"admissions@uwe.ac.uk","telephone":"+44(0)117 32 83333","fullName":"Admissions Office"},"location":{"latitude":51.5003171,"longitude":-2.5475737},"trainWithUs":"At UWE Bristol we are particularly proud to be in the top 10 universities in the UK for student satisfaction and to be awarded the highest possible rating in the Teaching Excellence and Student Outcomes Framework (TEF) 2018, achieving GOLD Standard.\nOur Education subject provision is highly successful - we came 5th in the UK for Education in the Guardian University League Table 2019 and 9th in the UK in the Complete University Guide League Table 2019. All of the subject-level university league-tables show us as clear leaders in Education in the region. Significant components of the subject rankings are student satisfaction and quality of teaching. Our students are extremely positive about our provision and about the excellent support they receive from our wide range of school partners. The programme tutors at UWE along with our community of schools are committed to providing a teacher training experience which enables trainees to graduate as skilled and thoughtful practitioners who know what works and who can put this into practice in the classroom.","trainWithDisability":"We take a great deal of care to ensure all our trainees can be successful and have many examples of this in practice. We evaluate needs in advance of students starting their course to enable us to put all the necessary measures in place both at UWE and in collaboration with our school partners. We are committed to ensuring that the teaching profession is as diverse as possible, just as we are committed to helping trainees to support the needs of all of their pupils they teach.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"createdAt":"2021-07-06T17:56:47.611Z","updatedAt":"2021-10-01T21:59:44.400Z"}
