{"id":"dada1360-37b9-4343-832c-cbad314dfe77","name":"Colmore Partnership Training School Alliance","code":"19Q","type":"lead_school","isAccreditedBody":false,"urn":"103189","ukprn":"10052836","address":{"addressLine1":"Colmore Partnership Training School Alliance","addressLine2":"Colmore Road","town":"Kings Heath","county":"Birmingham","postcode":"B14 6AJ"},"contact":{"website":"http://www.cptsa.co.uk","email":"enquiry@cptsa.co.uk","telephone":"0121 675 8766","fullName":"Ali Fisher"},"location":{"latitude":52.4275269,"longitude":-1.8998453},"trainWithUs":"The Colmore Partnership Training School Alliance (CPTSA) is committed to achieving personal and academic excellence for all trainee teachers. Through a true school led partnership, we aim to develop and support future teachers in becoming the next generation of outstanding practitioners. We aim to provide new teachers with the opportunity to learn, develop and practise the skills needed to be successful in a highly supportive environment. We work with over 50 schools in the local and surrounding areas. Well being and pastoral support of all our students underpins everything we do. Under the School Direct programme we are working in partnership with The South Birmingham SCITT and are proud to be working together to provide an innovative, supported and school led route into teaching\n* Primary and Secondary Teacher Training\n* School led route\n* Qualified Teacher Status and a Post Graduate Certificate in Education (MA Level 7 x 80 Masters Credits) This is higher than a PGCE\n* 100% employment rates\n* Learn from real teachers in real classrooms who are doing the job today\n* Bespoke programme to reflect your starting point\n* I day in Professional Studies (Solihull Sixth Form College), 4 days in school from September. A mix of face to face and remote learning\n* 50+ exciting and innovative schools in Birmingham and surrounding areas ready to support your placement\n* Placements in schools that we know and trust\n* Consideration for placements is based on where you live, your personal circumstances and travel arrangements","trainWithDisability":"A condition of your offer will be the successful completion of an Occupational Health Check to satisfy the requirements for Fitness to Teach.\nWe endeavour to meet the needs of trainees with disabilities and you are welcome to discuss any needs of disabilities with us at any time during the application process.\nIf you are disabled or have a specific learning difficulty, all reasonable adjustments will be made","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:51:16.645Z","updatedAt":"2021-09-30T17:18:18.994Z"}
