{"id":"dae8b113-3556-416a-8da0-57eb5aaff9e2","name":"High Force Education (SCITT)","code":"H38","type":"scitt","isAccreditedBody":true,"ukprn":"10046049","address":{"addressLine1":"Green Lane CE Primary School","addressLine2":"Green Lane","town":"Barnard Castle","county":"Co Durham","postcode":"DL12 8LG"},"contact":{"website":"http://www.highforceeducation.co.uk","email":"info@highforceeducation.co.uk","telephone":"01833 630487","fullName":"High Force Education Primary SCITT"},"location":{"latitude":54.5460522,"longitude":-1.9097757},"trainWithUs":"High Force Education is an Ofsted outstanding provider that produces inspirational, creative teachers of the future. We operate across four learning hubs: Durham, North Yorkshire, Darlington and Teesside, Weardale and Teesdale. High Force was the first school centred ITT provider to be established in the North East and has a proven track record of success. We have chosen learning leads who are not only highly effective in their chosen subject area but are also passionate about teacher training and have the skills needed to impart the enthusiasm and passion for their subject to you.\nOur vision is to nurture and develop resilient and passionate individuals who are skilled in critical thinking. Trainees are interviewed in the hub school nearest to where they live and spend the majority of their year in satellite schools attached to the Hub.","trainWithDisability":"High Force is committed to equality of opportunity for all and does not discriminate on the grounds of race, gender, sexual orientation, age, disability, religion or socio-economic circumstances. For specific information and guidance on support, provision available and/or facilities for trainees with learning difficulties or disabilities, please contact the ITT Deputy Director on 01833 630487. We produce a separate Disability Statement, outlining facilities for disabled learners. This is available on request.\nWe have a dedicated pastoral lead who provides additional support when needed.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:54:41.308Z","updatedAt":"2021-09-15T15:20:02.493Z"}
