{"id":"db2188d3-0047-44ee-92d2-64d1b5e1a939","name":"University of Newcastle Upon Tyne","code":"N21","type":"hei","isAccreditedBody":true,"urn":"133852","ukprn":"10007799","address":{"addressLine1":"Admissions","addressLine2":"Level 3","town":"King’s Gate","county":"Newcastle upon Tyne","postcode":"NE1 7RU"},"contact":{"website":"https://www.ncl.ac.uk/ecls/study/postgrad/teacher/","email":"pgce-education@ncl.ac.uk","telephone":"0191 208 6017","fullName":"Dawn Bell"},"location":{"latitude":54.9789749,"longitude":-1.6135961},"trainWithUs":"The PGCE Team pride ourselves on providing our students with an excellent standard of education, training and practical teaching experience and are delighted that Newcastle university achieved A Gold Award, in the Teaching Excellence Framework (TEF), evidencing that Newcastle University consistently delivers outstanding teaching, learning and outcomes, for our students. Similarly, we were given a ‘judgement of Confidence by the The Quality Assurance Agency for Higher Education (QAA). We also pride ourselves personal support we give to our students and you will have full access to the extensive services of the ‘Student Support Service’.\nNewcastle University has a reputation for world-class research (16th in the UK) and the PGCE team work closely with our colleagues to ensure our subject and professional programmes are research led and well informed.\nOur PGCE programme, rated Good by Ofsted in 2017, provides rigorous academic and school training. University and school-based components are integrated so that learning is relevant to your practice and development as a confident and capable teacher. To support you, you will have access to a wide range of study facilities, including all relevant course materials , a well-stocked Education Resource Centre and the comprehensive facilities of the university. You will also have full access to the extensive services of the ‘Student Support Service’","trainWithDisability":"The PGCE Team welcome applications from students with disabilities. Advice, information and guidance is available from the university Student Support Services, who liaise with us over students’ support requirements, and may liaise with external agencies where appropriate. Disabled Students' Allowances (DSA) is a non-means tested grant available to U.K. disabled students who are applying for, or are attending, a course of Higher Education. There are specific eligibility conditions related to residence in the UK, which have to be met to qualify for this funding. DSA allowance covers some additional study-related costs that students will incur because of a disability, ongoing medical condition or mental health condition. Extra costs may include specialist equipment, a non-medical helper or travel costs. If you are invited to an interview for PGCE is often a good opportunity to arrange to meet with one of the Disability Advisers, to talk about your support requirements.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"createdAt":"2021-07-06T17:50:15.994Z","updatedAt":"2021-08-03T15:26:11.916Z"}
