{"id":"db8bf7ea-fab0-4761-b5e9-1802a017bbca","name":"Pathways Partnership","code":"27C","type":"lead_school","isAccreditedBody":false,"urn":"107963","ukprn":"10072252","address":{"addressLine1":"Pathways Partnership","addressLine2":"Cobden Primary School","town":"Cobden Road","county":"Leeds","postcode":"LS12 5LA"},"contact":{"website":"www.pathwayspartnership.co.uk","email":"rachelthorpe@exceedacademiestrust.co.uk","telephone":"0113 279 8079","fullName":"Paula Head"},"location":{"latitude":53.7831221,"longitude":-1.6093863},"trainWithUs":"The Pathways Partnership comprises a group of Leeds schools working in a diverse range of social contexts. We are committed to providing first-class learning opportunities for children and adults to develop the next generation of inspirational teachers.\nPathways Partnership provides a high quality route into effective teaching, supporting you in your career as a trainee teacher, an NQT and beyond. Previous trainee teachers within the partnership have been successfully employed in our schools, with an NQT programme to ensure that they continue to flourish as professionals in this exciting world of primary education. All the schools in our partnership believe that the most effective way to train teachers is through the School Direct route. Our programme provides trainees with experience in both a ‘host’ and ‘home’ school. Academic rigour is provided by a post graduate course with study at masters level. The partnership provides a range of professional development days and training across all the schools, including supporting trainees with job applications.\nAs many of our trainees will secure their first teaching posts at one of our partnership schools, we are keen to invest heavily in the training programme, thereby ‘growing our own’ teachers of the future.","trainWithDisability":"As a partnership of schools committed to inclusive education and challenging discrimination, we welcome applications from trainees with disabilities. We are looking for enthusiastic, energetic individuals who are passionate about teaching and learning. Candidates need to be reflective, evaluative and clearly focused on their own professional development. Successful candidates will have good interpersonal skills and the ability to work collaboratively with all colleagues in school. The range and variety of school within our partnership, enables us to place you with the most appropriate setting. Individual needs of students are taken into consideration when placing you in a school, building upon your strengths while ensuring that any needs are catered for.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:55:40.243Z","updatedAt":"2021-10-21T00:56:17.050Z"}
