{"id":"dbc9f149-9701-4e33-a9f3-2f69602006dd","name":"Culcheth Campus","code":"4F5","type":"lead_school","isAccreditedBody":false,"urn":"111430","ukprn":"10001791","address":{"addressLine1":"Culcheth High School","addressLine2":"Warrington Road","town":"Culcheth","county":"Cheshire","postcode":"WA3 5HH"},"contact":{"website":"http://culchethhigh.org.uk/culcheth-campus/","email":"teachertraining@culchethhigh.net","telephone":"1925767587","fullName":"Jodie Lomax"},"location":{"latitude":53.455496,"longitude":-2.507168},"trainWithUs":"Culcheth High School is an innovative and forward-thinking school that puts Professional Development at the heart of everything that we do in our school community. We believe that investing in the next generation of teachers is crucial to our success and is key to serving our local community. Being a Lead School for Schools Direct provides us with the opportunity to create a unique evidence-based approach to teacher training. Working in partnership with Bright Futures SCITT and the prestigious University of Manchester means that you will receive a broad and balanced training experience, collaborating with a team of highly experienced, passionate and dedicated teachers and leaders who will guide and support you through the most exciting, challenging and inspiring teacher training experience. You will be immersed in a culture of high quality, evidence-informed teaching practice, providing you with the opportunity to make informed choices about your own teaching practices, enabling you to grow and develop as an outstanding teacher. You will explore in depth the principles of cognitive science and psychology so that you can understand how students learn and consider how this translates into classroom pedagogy. You will receive a well-thought-out programme of SEND, wellbeing, mental health and safeguarding training, delivered by expert practitioners, providing you with a holistic approach to life as a teacher.","trainWithDisability":"Culcheth Campus is an inclusive provider who endeavours to support the needs of all candidates. Please contact us if there is anything in particular you would like to discuss.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"cb360fcd-0c3a-4fc2-a4df-521e9475cd1c","code":"G65","name":"Bright Futures SCITT","description":"Bright Futures SCITT (formally Alliance for Learning SCITT) is a dynamic, high-quality teacher training provider offering a range of school-based routes into teaching. Bright Future’s reputation for high quality training is built on the passion and expertise of our trainers. Our training is designed for all stages of your career http://allianceforlearning.co.uk/cpd/introduction/. Judged by Ofsted as ‘Good’, the Bright Futures SCITT has a proven track record of providing outstanding teacher training for over 10 years."}],"createdAt":"2021-07-06T17:55:57.815Z","updatedAt":"2021-09-17T21:02:20.691Z"}
