{"id":"dc6d97f7-9cf6-410f-89e2-6df3c0f4f2a7","name":"Generate Teaching Hub","code":"15R","type":"lead_school","isAccreditedBody":false,"urn":"143064","ukprn":"10057459","address":{"addressLine1":"Generate Teaching Hub","addressLine2":"c/o Warrington Primary Academy Trust, Evelyn Street","town":"Warrington","county":"Cheshire","postcode":"WA5 1BD"},"contact":{"website":"https://generateteachinghub.org/","email":"schooldirect@wpat.uk","telephone":"1925202255","fullName":"Recruitment Administrator"},"location":{"latitude":53.385479,"longitude":-2.616989},"trainWithUs":"Generate Teaching Hub School Direct is the largest provider of Primary School Direct programmes in Warrington and Halton, welcoming trainees from across Warrington, Merseyside and Cheshire. As a national Teaching School, we put 'children first', focusing upon always improving children's outcomes and experiences of their early education. We promote innovation and resilience, working with the latest evidence-based practices and building strong teams of experts to deliver excellence across all activities and partnerships. Our School Direct PGCE (QTS) programmes are carefully developed to reflect this; recruiting the best candidates and investing in the highest quality training, placements and mentoring to create classroom confident, ambitious and highly successful Teachers.\nBecoming a member of the school team from the very start, our trainees experience placements in a wide range of settings; community, faith, academies, and SEN with enrichment opportunities in alternative provisions, high schools, private nurseries. Each trainee receives bespoke placements to maximise their range of experience to develop strong resilient teachers and enhance their employment opportunities.\nUsing high quality trainers, our programmes scaffold the theory behind the practice; curriculum knowledge and professional standards all being embedded through the programme. Our dedicated mentoring team nurture and support trainees to develop confidence and offer teaching opportunities. Trainees attend Masters level days at TEF Gold awarded Liverpool Hope University.\nWith long-standing 100% pass and excellent employment rates for all of our trainees we're proud to have supported so many trainees into their careers as teachers and we look forward to supporting many more!","trainWithDisability":"Generate Teaching Hub School Direct is committed to supporting the best candidates to become excellent teaching professionals, regardless of disability or other need. As such we believe in being an inclusive and accessible provider. For Generate Teaching Hub School Direct all trainees are unique and so each one receives a bespoke programme of placement opportunities. This enables us to take individuals accessibility and health needs into consideration at all points. Our training venues are accessible and we have a large partnership of placement schools to suit each trainee.\nWe encourage any potential applicant to contact us directly to discuss any questions they may have about our programme and delivery.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:47:36.008Z","updatedAt":"2021-10-04T16:35:29.771Z"}
