{"id":"dd023fad-7961-43f9-a0e2-366a4a91f429","name":"ArrowITT","code":"1DD","type":"lead_school","isAccreditedBody":false,"urn":"132831","ukprn":"10003614","address":{"addressLine1":"Sycamore Drive","addressLine2":"Bishopdown","county":"Salisbury","postcode":"SP1 3GZ"},"contact":{"email":"head@greentrees.wilts.sch.uk","telephone":"1722340596","fullName":"Ray Picton"},"location":{"latitude":51.09039,"longitude":-1.7817538},"trainWithUs":"ArrowITT provides a Schools Direct programme based in 11 schools in the Salisbury area. We have been established for 5 years but this is the first year under the name ArrowITT, as we have grown our capacity through the merger of two smaller Schools Direct programmes (Greentrees Primary School and Salisbury Primary Teaching School Alliance).\nWe are very excited about this growth as we can now provide placements in a wide range of schools, including church, community, Infant , Junior and Primary, LA led and academy. We can also offer access to a Special School and a Resource Base within the cluster of schools. Our link tutors are all members of staff at the schools providing excellent access to advice and support at all times.\nThe interview process takes place at one of the cluster schools giving you the opportunity to experience a school in the cluster at an early stage.\nWe organise and inform you of your placements prior to you starting the course providing you with security and the chance to be in contact with your schools at an early stage.\nWe have a 100% record of students getting a job prior to leaving the course often within the cluster of schools. There will be opportunities given throughout the year to practice interview techniques in readiness for applying for jobs.\nOur purpose in running ArrowITT is to help Salisbury schools recruit high quality NQTS for the benefit of all schools in our region.","trainWithDisability":"We always meet the needs of candidates with disabilities and respond to individual requests for support as necessary. \nA number of the schools in our cluster are new builds with excellent access. Placements can be tailored to meet needs as a result.\nWe work closely with the University of Winchester at the recruitment stage to ensure that all candidates needs are met.\nThe lead school, Greentrees is in a modern building, on two sites in close proximity. We have toilet and shower facilities for the disabled. Please contact us to discuss any needs that you may have and we will do our utmost to accommodate you.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:50:38.078Z","updatedAt":"2021-07-26T15:23:16.748Z"}
