{"id":"ddae7874-ec9d-49c9-89ff-2d10d9a7c4ca","name":"Pudsey Primrose Hill","code":"1AY","type":"lead_school","isAccreditedBody":false,"urn":"145526","ukprn":"10035411","address":{"addressLine1":"Primrose Hill","addressLine2":"Stanningley","town":"Leeds","county":"Pudsey","postcode":"LS28 6AB"},"contact":{"website":"http://www.primrosehill.leeds.sch.uk/","email":"school.direct@pudseyprimrosehill.co.uk","telephone":"0113 257 4129","fullName":"Kathryn Dickson"},"location":{"latitude":53.8020446,"longitude":-1.6668881},"trainWithUs":"Pudsey Primrose Hill Primary School in Leeds is the lead school of a long-standing and very successful School Direct partnership, offering both salaried and fee-paying Primary training routes to QTS. Trainees are employed by, or placed in, up to 15 Primary schools in the Leeds/Bradford area and recruitment and retention rates following the programme, which is accredited by Educate Group Initial Teacher Training, are exceptionally high. The fee for non-salaried trainees includes a PGCE (and 60 Master's credits) awarded by Leeds Beckett University. Salaried trainees can choose to add the PGCE for a fee of £2,000.\nAll trainees spend a full-time year teaching and training in schools. Centralised training sessions cover content such as High Expectations, Behaviour Management, How Pupils Learn, Adaptive Teaching, Classroom Practice, Curriculum and Assessment in line with the Core Content Framework. This is supplemented by opportunities to observe other teachers in a range of settings and undertake a variety of school-based training enhancements. This is supplemented by a programme of Primary curriculum subject knowledge (including Phonics) delivered in Pudsey's purpose-built training facilities and directly related to the realities of the classroom.\nAll trainees submit three assignments throughout the year:\n1. School Based Independent Study 2. Developing Subject Competency 3. Professional Values and Practice\nTrainees are supported to improve their knowledge, understanding and application of the Educate Initial Teacher Education (ITE) Curriculum, leading to development of classroom practice skills and their professional teaching role. Final assessment is made on a trainee's ability to meet the Teachers' Standards.","trainWithDisability":"Educate Group Initial Teacher Training takes the necessary steps before the programme begins, to fully assess the needs of trainees so that all aspects of the course are accessible to them and personal requirements accommodated.\nEducate have, in the past, supported trainees with dyslexia, physical impairment and mental health conditions to successfully complete their course. A collaborative approach is taken to ensure that study needs assessment reports, school partners and university colleagues are consulted to design a complete package of personal support.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"4808c596-11e0-4586-8cb4-116a1d9838b3","code":"E65","name":"Educate Group Initial Teacher Training","description":"Educate Group is a large, National SCITT provider, with a long-standing reputation for successful Primary and Secondary QTS programmes.\\r\\n\\r\\nProgramme leaders are highly sensitive to the well-being of their trainees. They ensure that they provide timely and appropriate support to those trainees whose personal circumstances require it. Trainees appreciate this support(Ofsted, 2018). \\r\\n\\r\\nTraining sessions on specific subject knowledge and classroom practice supplement the first-hand experience in school. Contrasting placements means that trainees gain an appreciation of a range of ages, curricula, teaching strategies, inclusion, diversity and SEND. Employment rates following this programme are consistently high."}],"createdAt":"2021-07-06T17:56:33.180Z","updatedAt":"2021-10-09T01:12:01.752Z"}
