{"id":"de0e702b-b19b-4594-b433-aa49be29f4d9","name":"Tes Institute","code":"H40","type":"scitt","isAccreditedBody":true,"ukprn":"10035578","address":{"addressLine1":"26 Red Lion Square","addressLine2":"London","postcode":"WC1R 4HQ"},"contact":{"website":"www.tes.com/institute","email":"institute@tesglobal.com","telephone":"+44 (0) 203 194 3200","fullName":"Admin"},"location":{"latitude":51.5198802,"longitude":-0.1189875},"trainWithUs":"TES Institute is committed to supporting school-based teacher training, helping schools to create great teachers. Through their team of highly experienced Pathway Tutors working in partnership with schools and trainees, TES Institute combines the best of in-person and online learning to deliver truly flexible teacher training. For our School Direct Teacher Training programme, TES institute works with 8 partnerships of schools across London, Essex, Suffolk, and Kent, who work collaboratively to share best practice to develop and deliver high quality teacher training. Our postgraduate Teacher Apprenticeship is offered nationally.\n\nWe offer three routes through Teacher Training \nSchool Direct Unsalaried (Full Time or Part Time)\nSchool Direct Salaried (Full Time or Part Time)\nPostgraduate Teacher Apprenticeship (which we operate nationally)","trainWithDisability":"TES Institute are committed to promoting access for people with disabilities and additional needs. We support and enable students with physical disabilities, sensory impairments, specific learning difficulties, special psychological needs and medical conditions that can have an impact on day-to-day activities, to participate in TES Institute programmes, as far as is reasonably practicable and within any constraints laid down by relevant professional bodies. TES Institute will:\n\nEncourage applications from people with disabilities\nSeek to provide information in suitable formats\nAssess applicants who disclose disabilities or specific needs solely on the basis of their academic potential and suitability to train to teach\nInvite applicants with a disability or specific need to contact TES Institute to discuss how their requirements can be accommodated\nProvide additional support or resources at application to enable the applicant to complete the application process including attending interview where applicable\nOffer additional provision to ensure no disadvantage compared with other applicants\nWork towards the earliest possible assessment of needs and offer of reasonable accommodations where required\nMake reasonable accommodations in assessment where applicable and without impacting the learning outcomes to be assessed\nProvide educational support services as appropriate for eligible students\nTake steps to encourage students with progressive conditions, or who become disabled during their programme of study, to continue their studies\nPromote an inclusive environment and attitude at TES Institute and endeavour to provide appropriate training to staff where required","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:57:22.266Z","updatedAt":"2021-11-20T01:49:26.769Z"}
