{"id":"de7a6a8b-2543-44a0-9e4a-15c2f055509b","name":"Tollbar Academy","code":"162","type":"lead_school","isAccreditedBody":false,"urn":"136268","ukprn":"10043656","address":{"addressLine1":"Station Road","town":"New Waltham","county":"Grimsby","postcode":"DN36 4RZ"},"contact":{"website":"http://www.tollbarmat.co.uk","email":"hookc@tollbarmat.org","telephone":"1472502297","fullName":"Paul Donnelly"},"location":{"latitude":53.5213175,"longitude":-0.0791349},"trainWithUs":"Tollbar MAT Family of Academies\nTollbar Family of Academies is a unique Multi Academy Trust (MAT) led by experienced educationalists responsible for one of the largest and most successful schools in the country. Tollbar MAT aims to offer a world-class, 21st century education to the young people in all its Academies, providing life-long learning opportunities and creating centres of excellence, which model the successful practices at Tollbar Academy, bringing confidence and pride to the local community.\nIt is a learning community, run by a team who have proved their worth by maintaining their own outstanding outcomes for the 2,200 students at Tollbar Academy, while mentoring six further Academies, Primary and Secondary, and taking two of these from 'Special Measures' and 'Requires Improvement' to 'Good' in a short space of time.\nSuch is their success, that Tollbar Academy has not only been rated 'Outstanding' on three consecutive occasions by Ofsted, but it is also designated as one of the UK's high-performing schools.\nTollbar MAT are delighted to offer the opportunity to train with our Trust. We have extensive experience of working with trainee teachers across a number of subject areas (Biology, Chemistry, French, Geography, History, Maths, Physics, Primary and Spanish). A large number of our past trainees have remained with the Trust having been offered teaching roles following successful completion of teacher training.","trainWithDisability":"The Company is committed to promoting equality of opportunity for all applicants. We aim to create an environment in which all individuals are able to make best use of their skills, free from discrimination or harassment, and in which all decisions are based on merit.\nWe do not discriminate against staff on the basis of their gender, sexual\norientation, marital or civil partner status, gender reassignment, race, colour, nationality, ethnic or national origin, religion or belief, disability or age (the protected characteristics).","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:52:30.090Z","updatedAt":"2021-09-30T21:40:38.218Z"}
