{"id":"dece1cf6-1208-4f4d-b886-cec23b540a35","name":"Manor Primary School","code":"1QO","type":"lead_school","isAccreditedBody":false,"urn":"141858","ukprn":"10053803","address":{"addressLine1":"Manor Primary School","addressLine2":"Ettingshall Road","town":"Coseley","county":"Bilston","postcode":"WV14 9UQ"},"contact":{"website":"http://manorprimary.com","email":"acliff@manorprimary.com","telephone":"1902556460","fullName":"Anita Cliff"},"location":{"latitude":52.5490377,"longitude":-2.0960927},"trainWithUs":"*Train to become a teacher in a vibrant, stimulating school where pupils thrive personally, socially and academically and achieve the very highest of standards nationally. *Train in a school where leaders nurture, support, and coach and empower all staff to be the best they can be.\n*Train in a school where outstanding teaching over time is a result of highly skilled and reflective teachers and teaching assistants who are dedicated and committed to ensuring pupils receive the highest quality and standards of educational experience. *As a Teaching School we have a proven track record of training the next generation of teachers with 100% of students completing their PGCE with us over the past 3 years gaining employment at the end of their programme.\nOn our School Direct teacher programme, you will be given in-depth experience in the classroom. You will complete a main placement in a Key Stage of your choice and a second placement in a contrasting school and Key Stage. You will also have the opportunity to complete enhanced placements In addition, away from the classroom, you will receive practical training sessions from expert teachers and the team at Manor Teaching School. The University of Birmingham will also lead sessions to support your academic development.\nWe are looking for ambitious individuals who can demonstrate potential and show strong commitment. Our School Direct programme is for people who are willing to work hard and are passionate about training to teach. Interested?","trainWithDisability":"Manor's School Direct route into teaching is an inclusive pathway and provides any student with any disability or other needs with individual and bespoke support so that their disability is not a barrier to achieving their PGCE.\n\nAny student with a disability is provided with a support plan that is reviewed monthly to ensure their individual needs are met.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"c357e0fa-802e-471b-818a-d0cd1434f9cd","code":"B32","name":"University of Birmingham","description":"The University of Birmingham’s Initial Teacher Training Programme is rated as Outstanding by Ofsted. Ofsted view is that they provide High quality training and .... outcomes for trainees are excellent\\r\\n\\r\\nWe have a long standing established partnership that provides our students with an excellent route into teaching."}],"createdAt":"2021-07-06T17:50:57.504Z","updatedAt":"2021-07-27T21:37:35.055Z"}
