{"id":"df2033c6-3628-486d-be0e-70aca5092943","name":"Avenue Primary Academy","code":"1J3","type":"lead_school","isAccreditedBody":false,"urn":"142177","ukprn":"10053779","address":{"addressLine1":"Avenue Road","addressLine2":"Belmont","town":"Sutton","county":"Surrey","postcode":"SM2 6JE"},"contact":{"website":"avenueprimary.com","email":"bbrooke@cirrustrust.uk","telephone":"2086425138","fullName":"Britt Brooke"},"location":{"latitude":51.3463601,"longitude":-0.2041271},"trainWithUs":"Avenue Primary Academy is an outstanding, large primary school based in Sutton and is a member of Cirrus Primary Academy Trust. We recognise and develop the potential of each and every person, empowering them and giving them the confidence to play a positive role in society as responsible citizens. We aim high and believe we can succeed.\nA commitment to development attracts the best staff to work at Avenue. Because of our size and work with other schools in the local area, teachers have career progression and promotion opportunities within the school and across the Trust. We believe this is crucial to the success of our school.\nAs a teaching school from 2012 - 2021, Avenue successfully trained teachers through School Direct for 8 years. Many of our School Direct trainees have continued to work at their host schools or within Cirrus Primary Academy Trust. We also successfully mentor, support and assess a number of ITT students from University of Roehampton and Kingston University each year. We will continue to offer the School Direct route as a lead school from September 2021.\nIf you are interested in becoming a part our thriving and successful teaching community, we offer teacher training places in conjunction with our university provider, the University of Roehampton. Please contact us to find out more.","trainWithDisability":"Over the past 8 years, we have trained students with disabilities and special needs. The university of Roehampton has a disabilities team with designated members of staff to support students with dyslexia, physical disabilities and mental health conditions. Avenue Primary Academy considers the mental health of pupils and staff to be a priority. A number of support staff, teachers and leaders are trained as mental health first aiders to support pupils and staff.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"accreditedBodies":[],"createdAt":"2021-07-06T17:57:10.582Z","updatedAt":"2021-11-23T21:04:54.978Z"}
