{"id":"df7557d1-f806-4495-8dd5-0be99a1b8d0e","name":"West Ipswich Teaching School","code":"2FO","type":"lead_school","isAccreditedBody":false,"address":{"addressLine1":"Chesterflied Drive","postcode":"IP1 6DW"},"contact":{"website":"https://www.westipswichteaching.org/initial-teaching-training","email":"info@westipswichteaching.org","telephone":"1473742534","fullName":"Admissions"},"location":{"latitude":52.076064,"longitude":1.1320823},"trainWithUs":"The West Ipswich Teaching School are offering an exciting and innovative School Direct Initial Teacher Training programme. West Ipswich Teaching School is a hub of two outstanding and inclusive schools. We have a proven history of developing quality early years practice in Ipswich and across Suffolk specialising in SEND.\nWe are offering an exciting and innovative School Direct Initial Teacher Training programme. An application through our alliance will give a duality of benefits. In addition you will have your core training through SCITT which has an outstanding reputation providing a quality start for your career in a dynamic and exciting career.\nWIT provides extra input which will be extremely beneficial in preparation for the demands of the classroom. Providing:\n*A person centred learning approach for all\n*Access quality CPD provided as part of the WIT Alliance and partners as well as working in partnership with families and health and care teams.\n*Access to relevant quality CPD provided by Teaching Schools within the regional area.\n*Access support from experienced practitioners for your first year of practice to help you on the journey to achieving QTS.\n*On-going mentor support to ensure each individuals learning action in the classroom.\n*Additional regular training sessions with specialised SEND education provision to gain hands on experience of physical, medical and sensory conditions\n*Access to research and information networks provided through the Teaching School and Ipswich Research School\n*On-going mentor support for your RQT and RQT +1 years with a designated program on CPD and supervision cycle.","trainWithDisability":"Suffolk and Norfolk SCITT supports all trainees based on their individual needs. Recently this has included those with dyslexia, physical, hearing and visual impairments and mental health conditions. Plans are developed with trainees to ensure that they can fully access in centre training, operate effectively on school placement and complete written assignments.\nSuffolk & Norfolk Primary SCITT has full disabled access as do all the schools in the partnership. However, applicants who would benefit from disabled access should let us know on their application so that they can be considered for placements at the most appropriate schools.","accreditedBodies":[{"id":"89831af6-535f-471b-aa97-098bd1a93291","code":"S13","name":"Suffolk and Norfolk Primary SCITT","description":"The Suffolk and Norfolk Primary SCITT programme is a personalised, relational and ethical training provider. Primary SCITT has very high attainment and employment outcomes for trainees. On average 95% of trainees are employed in local schools by the end of their training year. \\r\\nTrainees are supported by school mentors and SCITT Tutors who have a range of experience in schools as classroom practitioners and often headteachers or members of senior leadership teams, so have a wealth of experience to share with trainees. \\r\\nThe Primary SCITT course is a highly personalised course which offers a wide range of opportunities to trainees."}],"createdAt":"2021-07-06T17:53:58.301Z","updatedAt":"2021-12-11T01:16:13.438Z"}