{"id":"dfb70146-b996-4195-8f8d-1f04a3c73466","name":"Delta Academies Trust","code":"1DU","type":"lead_school","isAccreditedBody":false,"urn":"136343","ukprn":"10055739","address":{"addressLine1":"Education House","addressLine2":"Spawd Bone Lane","town":"Knottingley","county":"West Yorkshire","postcode":"WF11 0EP"},"contact":{"website":"https://www.deltatrust.org.uk/train-to-teach/","email":"schooldirect@deltatrust.org.uk","telephone":"0345 196 0033","fullName":"Jill Kelly"},"location":{"latitude":53.7047093,"longitude":-1.2427965},"trainWithUs":"Delta Academies Trust is a multi-academy trust (MAT) of over 50 academies in the Yorkshire and Humber region. Our MAT consists of Secondary, Primary, Infant, Junior, all through schools and Free Schools.\nDelta has high retention rates with many School Direct trainees being employed as Newly Qualified Teachers within our Academies each year.\nFollow this link to discover more information about our teacher training offer. https://teach.deltatrust.org.uk/train-to-teach\nWe believe, due to the geographical location of all our academies, we can provide the best teacher training opportunities and provide excellent support through outreach work and sharing best practices. There are many career opportunities available to all our trainees who succeed on the School Direct Programme. We support, motivate and inspire teachers throughout their career to become leaders of the future. We strongly believe the excellence in the quality of training teachers receive, leads to excellence in education for children.","trainWithDisability":"Delta Academies Trust, in accordance with its Equality and Diversity Policy, the Organisation will provide equal opportunities to all trainees and applicants and will not discriminate either directly or indirectly because of age, disability, gender reassignment, marriage and civil partnership, pregnancy and maternity, race (including colour, nationality and ethnic or national origins), religion or belief, sex and/or sexual orientation.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:47:07.175Z","updatedAt":"2022-01-25T06:20:17.456Z"}
