{"id":"dfd4b849-fdfa-4f62-af77-245e4512819e","name":"Lionheart Teach","code":"1O8","type":"lead_school","isAccreditedBody":false,"urn":"139624","ukprn":"10055191","address":{"addressLine1":"Ridge Way","addressLine2":"Oadby","town":"Leicester","county":"Leicestershire","postcode":"LE2 5TP"},"contact":{"website":"https://lionheartteach.org.uk","email":"info@lionheartteach.org.uk","telephone":"1162729100","fullName":"James McKenna"},"location":{"latitude":52.5885202,"longitude":-1.0724685},"trainWithUs":"Lionheart Teach is the Leicester and Leicestershires School Direct Initial Teacher Training run by the Lionheart Educational Trust. Our Trust seeks to develop excellent teachers to work within our partnership and provide our students with the high quality teaching that secures academic excellence and holistic development. The school direct partnership works with our family of schools across both Leicester & Leicestershire to develop trainee teachers to teach across different settings in our valued communities.\nThe foundation of our Trust is built on a perfect balance of Academic Excellence and Holistic Development. We realise the importance of delivering quality first teaching; developing well-rounded young people and preparing them for life beyond education.\nWe aim to provide you with an excellent experience, developing your subject specialism and approach to teaching with our supportive team of experts. We pride ourselves on delivering a personalised programme where you can thrive and realise your passion to become a teacher to make a real difference and positively impact on the lives of others.\nOur Schools:\nBeauchamp College, an 11-19 school, Oadby\nBeauchamp City Sixth Form, a 16-18 college in Leicester City Centre\nCedars Academy, an 11-19 school, Birstall\nHumphrey Perkins, a 11-16 school, Barrow upon Soar\nJudgemeadow Community College, and 11-16 school, Evington\nThe Martin High School, an 11-19 school, Anstey\nSir Jonathan North Community College, an 11-16 girls’ school, Leicester\nThere are 4 primaries in The Trust:\nBrockshill Primary, Oadby\nHallam Fields Primary, Birstall\nHighcliffe Academy, Birstall\nRiverside Primary, Birstall\nFind out more here: (www.beauchampteach.org.uk)","trainWithDisability":"Definition of Disability\nA person has a disability if:\n* they have a physical or mental impairment * the impairment has a substantial and long-term adverse effect on their ability to perform normal day-to-day activities (Equality Act 2010)\nReasonable Adjustments:\nTo achieve this level playing field the concept of reasonable adjustment has been established. Please contact as at info@beauchampteach.org.uk to talk about how we can support you.\nA vitally important aspect of providing a reasonable adjustment is that the dignity of individuals is paramount. This point is relevant to all of us whatever our role. Disabled people do not want favours and do not want to stand out as special cases. They simply want the same level of opportunity to achieve and to live. In addition to support available from The Beauchamp Lionheart Training Partnership, as a University of Leicester Loughborough University and Nottingham Trent University PGCE student you will have access to the full range of University student services such as study support and welfare counselling.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"816ef4e7-51c7-4211-828f-dbf6bb48bb6d","code":"L79","name":"Loughborough University","description":"Loughborough University has a strong tradition of teacher education and a history of successfully producing teachers who are in great demand by schools and colleges in the UK and overseas. We are renowned for the high quality courses we offer in Physical Education and Mathematics. Highly rated in Ofsted inspections, Loughborough is a category ‘A’ provider which represents ‘outstanding’ provision.\\r\\nWe have a strong tradition of teacher education and a history of successfully producing outstanding teachers who are in great demand by schools and colleges in the UK and overseas"},{"id":"d2b7d074-fac9-42c5-a0d3-d5471b35f7d9","code":"N91","name":"Nottingham Trent University","description":"Nottingham Institute of Education at NTU is one of the foremost providers of education and training for teachers and other learning and development professionals. \\r\\nWith extensive partnership links with primary schools, secondary schools, colleges and academies across the East Midlands. We recognise the strength of our links with local schools and the range of specialist placements for trainee teachers, giving them access to high-quality training.\\r\\nWe have a growing international reputation, but still retain a strong local presence: our staff work regularly with children and teachers in schools across the Midlands, helping to improve practice, raise standards, and change lives."},{"id":"3e6c62a3-5d34-4a91-9c23-01c7409fd909","code":"L34","name":"University of Leicester","description":"Our PGCE teacher training courses are taught by experts with years of experience as teachers themselves. We aim to develop inspirational teaching, informed by current research and grounded in a practical understanding of what works in the classroom.\\r\\n\\r\\nYou’ll have ongoing support from a range of tutors throughout your studies, helping to build your confidence and skills as you progress.\\r\\n\\r\\nOur PGCE courses focus on developing the kind of teachers schools tell us they want to employ. It’s no wonder our graduates are in high demand, with 96% securing their first teaching post within 12 months of finishing the course."}],"createdAt":"2021-07-06T17:50:29.204Z","updatedAt":"2021-10-04T01:38:03.776Z"}
