{"id":"dff68315-f882-43de-9781-40b458d43b52","name":"STAR Alliance","code":"26D","type":"lead_school","isAccreditedBody":false,"urn":"145778","ukprn":"10067569","address":{"addressLine1":"STAR Teaching School Alliance","addressLine2":"Monk Fryston CE Primary School","town":"Chestnut Green","county":"North Yorkshire","postcode":"LS25 5PN"},"contact":{"website":"http://STARteachingschoolalliance.org","email":"TSA@MF.STARMAT.UK","telephone":"01977 682388","fullName":"STAR Teaching School Alliance"},"location":{"latitude":53.759325,"longitude":-1.23383},"trainWithUs":"STAR Teaching School Alliance’s aim is to raise outcomes for children whilst providing sustainability in our schools, all within a small geographic area based around Sherburn-in-Elmet and Tadcaster in North Yorkshire. We have a mix of partner schools that offer placements - large/small; faith/non-faith; Local Authority/Academy, so we aim to offer our trainees a breadth of experience to support them in future job applications.\nProfessional learning, including initial teacher training, is at the centre of all we do. Teacher training is recognised as a mutual learning experience and helps our schools to maintain energy, enthusiasm and innovation. We have a track record of effectively supporting trainee teachers, a number of whom continue to develop their careers in our schools.\nAs a STAR trainee, you will experience the full school year from start to end, gaining valuable first hand experience to prepare you for life as a teacher. The majority of your time will be in the classroom, working with a successful, highly skilled, but also caring and supportive team. We are committed to delivering outstanding education and training that is both current and relevant, and providing excellent opportunities to develop knowledge and understanding. We aspire to ensure trainees are equipped to be outstanding teachers and future leaders.","trainWithDisability":"We are an inclusive teaching School Alliance and believe that there should be no barriers to qualified people pursuing a teaching career in teaching.\nTo this end, please contact the Alliance (using contact details below) to talk to us about any specific needs are and we will seek to accommodate them within our placement schools.\nAdditionally, you can contact the university Disability Services (tel: 01482 462020 or e-mail disability-services@hull.ac.uk) to find out about what Hull University are able to provide to support your academic studies and your time on campus with them.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:49:45.288Z","updatedAt":"2021-10-18T21:11:39.052Z"}
