{"id":"e00f01fe-7113-4b38-83d0-b61c6bbc0476","name":"Learning Unlimited Teaching School Alliance","code":"26G","type":"lead_school","isAccreditedBody":false,"address":{"addressLine1":"Learning Unlimited TSA","addressLine2":"St Thomas of Canterbury School","town":"Chancet Wood Drive","county":"Sheffield","postcode":"S8 7TR"},"contact":{"website":"http://www.lutsa.co.uk","email":"s.rockliff@lutsa.co.uk","telephone":"01142 745745","fullName":"Sarah Rockliff"},"location":{"latitude":53.595252,"longitude":-2.548643},"trainWithUs":"LUTSA is based at St Thomas of Canterbury Primary School in Sheffield. This is an outstanding school with drive and passion to transform children's lives through world class teaching. Our focus is Primary, Primary with Maths and Early Years teacher training. Our mission is to grow the highest calibre of teachers to meet the needs of the schools in our region. Feedback from our latest cohort of trainees was overwhelmingly positive with 100% rating the training at five out of five. For the past 2 years more that 75% of the cohort have been graded Outstanding by the end of the course, with the rest graded good. LUTSA are currently working with 15 partner schools across Sheffield, Chesterfield and Doncaster. Over 85% of the cohort for the past 2 years have gained employment before the completion of the course and many in our partner schools.\nThis is a high quality and individualised training route into teaching where you will learn alongside outstanding classroom practitioners and gain exceptional training experiences with input from our expert facilitators overseen by our Ofsted Outstanding Lead school.\nAs a teaching School our trainees have access to many development opportunities that we run in addition to their training, including a Maths knowledge enhancement programme of 12 sessions to grow their confidence in teaching Primary Maths using Mastery techniques. We also collaborate with other providers to make sure our trainees get experiences from a range of contexts and experts in the region.","trainWithDisability":"At LUTSA we provide a very personalised approach to School Direct Teacher Training. We take pride in getting to know all our trainees, their personal circumstances and their strengths and areas for development so that we can support and develop them most effectively.\nWe have developed specific support for trainees with Dyslexia in the past including providing software and a laptop for academic purposes.\nWe have developed training that specifically looks at resilience and strategies to help recognise and cope with stress for example.\nAt LUTSA we are able to carefully match students to schools and mentors who will help support their needs due to the fact that we deal with relatively small numbers each year (up to 20 trainees)\nWe continue to offer Maths subject enhancement sessions this year to support trainees in growing their knowledge, skills and confidence in this area and have introduced Literacy sessions also.\nOur students have access to the comprehensive student support services provided by both the Hull University and Sheffield Hallam depending on which course they undertake with us at LUTSA.","accreditedBodies":[{"id":"899178cc-20a7-4df5-951a-ee83c1b3d4d1","code":"S21","name":"Sheffield Hallam University","description":"The Primary 3-5 EYFS course is run by LUTSA with Sheffield Hallam University as the accredited provider . This course leads to QTS and a PGCE with 60 Masters credits in the training year.\\r\\n\\r\\nYou train in two contrasting placement schools during the year; one day a week at SHU and one at LUTSA for academic work when not on block teaching practice.\\r\\n\\r\\nThe SHU EYFS course was graded as Outstanding by Ofsted in 2017/8, one of the few ITT course to gain that grade in the country."},{"id":"43920484-d42a-42ca-8071-74b1ff5e81cc","code":"S97","name":"The Sheffield SCITT","description":"General Primary and Primary with Maths are run by LUTSA with the Sheffield SCITT as the accredited provider. This course leads to QTS and PGCert with 30 Masters credits from Hull University in your training year and the option to do a further 30 Masters credits in your NQT year fully paid for.\\r\\n\\r\\nYou train in 2 contrasting schools, attending Hubsessions every Tuesday afternoon. You will attend 3 of days for Masters sessions.\\r\\n\\r\\nA QTS only route is available this year.\\r\\n\\r\\nThe SCITT was subject to an Ofsted inspection in 2017/8 and was graded as Good with Outstanding features."}],"createdAt":"2021-07-06T17:55:27.977Z","updatedAt":"2021-10-04T17:25:12.453Z"}