{"id":"e04d6a9e-2e40-4759-a992-d8c84a2e4539","name":"Aston Community Education Trust","code":"17U","type":"lead_school","isAccreditedBody":false,"urn":"136718","ukprn":"10005790","address":{"addressLine1":"Aughton Road","addressLine2":"Swallownest","town":"Sheffield","county":"South Yorkshire","postcode":"S26 4SF"},"contact":{"website":"http://www.astonacademy.org/index.php/school-direct","email":"schooldirect@astonacademy.org","telephone":"0114 2872171","fullName":"ACET School Direct Coordinator"},"location":{"latitude":53.3689797,"longitude":-1.3212167},"trainWithUs":"Aston Academy is the lead school for Aston Community Education Trust (ACET) School Direct. At Aston Academy we are committed to providing high quality learning and teaching which is reflected in our Ofsted report where we were judged to be a Good provider. Trainees are placed at one of our 18 primary or secondary partnership schools in Sheffield, Rotherham and Derbyshire. Our partnership schools vary in their educational setting giving trainees access to a variety of experiences over a wide geographical area.\nFor secondary, the majority of student teachers will be at Aston Academy for one of their two placements and have another placement at one of our partnership schools. Further information can be found [here](http://www.astonacademy.org/index.php/our-partnerships-the-university-of-sheffield) or [here] (http://www.astonacademy.org/index.php/our-partnerships-sheffield-hallam-university)\nFor primary including early years, trainees have their placements at two of the ACET junior academies. Further information can be found [here](http://www.astonacademy.org/index.php/our-partnerships-sheffield-hallam-university)\nLast year 100% of ITT trainees rated their overall placement at Aston Academy as good or outstanding.\nSo far this year 100% of candidates have rated their in school training as excellent.","trainWithDisability":"As a student teacher at The University of Sheffield you will have full access to support if you have a disability or additional needs. Full information is available [here]( http://www.shef.ac.uk/ssid/disability)\nAdditionally, we work closely with all our school partners to ensure that your needs are met whilst on placement, offering support and adaptations where necessary.\nThe more we know about your additional needs, the easier it is for us to support you to succeed in your development as a teacher.","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"accreditedBodies":[{"id":"899178cc-20a7-4df5-951a-ee83c1b3d4d1","code":"S21","name":"Sheffield Hallam University","description":""},{"id":"7d0c173d-d084-47d1-8aea-909930227991","code":"S18","name":"University of Sheffield","description":""}],"createdAt":"2021-07-06T17:56:45.748Z","updatedAt":"2021-09-22T19:19:34.638Z"}
