{"id":"e06166f7-f57d-4f6c-bf5d-a12c0beb7526","name":"Crocketts Community Primary School","code":"142","type":"lead_school","isAccreditedBody":false,"urn":"103941","ukprn":"10068842","address":{"addressLine1":"Crocketts Community Primary School","addressLine2":"Coopers Lane","town":"Smethwick","county":"West Midlands","postcode":"B67 7DW"},"contact":{"website":"http://www.crockettscommunityprimary.co.uk","email":"claire.gibbs@crocketts.school","telephone":"0121 558 1659","fullName":"Admissions"},"location":{"latitude":52.4915623,"longitude":-1.9719644},"trainWithUs":"Crocketts Community Primary and Newman University School Direct PGCE.\n\n'Unlocking Futures'\n\nAs a trainee, you will work with a highly-skilled, caring and supportive team within a school who will do everything they can for you to succeed. You will be allocated an experienced school-based mentor who supports you during the programme. Trainees are encouraged to work collegiately by sharing experiences and offering mutual support.\n\nOur partner schools reflect the diverse nature of education on the outskirts of Birmingham, ensuring your placements are varied and increase your chances of finding the school that is right for you.\n\nTrainees are encouraged to develop into reflective teachers who can respond to the learning needs of children of all abilities. You will be assessed against the Teacher Standards through regular lesson observations with supportive feedback and ongoing self-reflection. \n\nCrocketts is an excellent place to train for many reasons including:\n•\tWe are committed to supporting and developing the next generation of teachers. \n•\tA decade of successful training with Newman University.\n•\tFeedback from previous trainees is always complimentary.\n•\tOpportunities to participate in the wider aspects of school life.\n•\tWe tailor and customise each individual’s training to ensure you will develop into balanced well-rounded professionals.\n•\tExtensive support provided by high-quality tutors and school colleagues.\n\nPlease provide references from a senior person in your workplace/University.\n\nIt is desirable but not essential that you have undertaken some school experience, or plan to do so before the course commences.","trainWithDisability":"Crocketts Community Primary values diversity and the unique contribution that all their staff and trainees bring. If you have a disability, you shouldn’t be dissuaded from applying as our training programme caters for individual needs.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:51:17.308Z","updatedAt":"2021-10-06T17:28:55.652Z"}
