{"id":"e084fb2e-fa2d-4c4c-8d6a-93aa32265e5a","name":"Wirral Schools Collaboration (Pensby)","code":"1ME","type":"lead_school","isAccreditedBody":false,"urn":"135497","ukprn":"10003957","address":{"addressLine1":"Greenbank Drive","town":"Pensby","county":"Wirral","postcode":"CH61 5UE"},"contact":{"website":"http://www.pensbyprimaryschool.org","email":"schooloffice@pensbyprimaryschool.org","telephone":"1513484145","fullName":"Kate Brown"},"location":{"latitude":53.341991,"longitude":-3.098824},"trainWithUs":"The Wirral Schools Collaboration is situated within Wirral and Pensby Primary is the lead school. Our schools have a strong, successful collaboration model based on many years of working together. We work very closely with Stanley Special Primary School and this gives our trainees excellent opportunities to experience Special Educational Needs. Our schools deliver primary education with some schools offering Nursery places, so covering all key stages of primary education. School training is held within your 'home' school and we provide additional training delivered by our staff who are experienced and skilled in their field. Together, the Collaboration and the University deliver exciting, engaging, meaningful training that enables the development of the professional knowledge and skills required to become an effective primary practitioner. Each trainee is assigned a mentor within their 'home' school. Our mentors are highly experienced. Working closely with the mentors, gives the best opportunity to reflect on your experiences and performance and guide the setting of targets for the next stage of your professional development. Our Collaboration has been training the teachers of the future , through School Direct, for several years. Our success rates and student satisfaction rates are very high (LJMU data). Our schools all have:\n*Positive working environments within supportive cultures, *Long lasting history of successful partnerships with Higher Education Institutes, *Wonderful children with exceptional behaviour who are eager to learn, *A wide range of subject specialisms, *Opportunities to work with leading teachers, within highly successful schools,","trainWithDisability":"We seek to support candidates with disabilities and other needs in partnership with LJMU. Our schools have a variety of environments and we allocate a home school to meet needs. E.G. trainees who have young dependents would be placed in a home school closest to their family, or trainees with specific disabilities will be placed in a school setting that can support those needs.\nOur schools all offer access to a range of medical support, including mental health services.\nLJMU is committed to Equality of Opportunity. Their Disability Advice Team will help you access the support you need. The best time to contact the Disability Advice Team is before you start your course. By contacting the team before you begin and disclosing your disability, you'll be able to receive support from when you arrive. Email: disability@ljmu.ac.uk Tel: 0151 231 3164/3165. All trainees are encouraged to disclose any specific learning need that they experience, in order to make any adjustments, both at LJMU and within our Collaboration. As part of the enrolment process to Teacher Training Programmes all students are required to complete a Health Questionnaire and some may be asked to attend a screening appointment with LJMU’s Occupational Health Unit. This is designed to ensure that arrangements are in place, from the outset, to support any students who may need additional support or reasonable adjustments to be made.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"ec34b77c-cba3-4598-93be-23f0471adff1","code":"L51","name":"Liverpool John Moores University","description":"\\r\\nOur accredited body, Liverpool John Moores University has an established reputation for high quality Teacher Training. The LJMU Partnership’s 2019 OFSTED inspection outcomes were the best on Merseyside with Primary provision graded Outstanding and Secondary programmes judged to be Good. Our Partnership with LJMU ensures that our teachers develop a deep and research-informed understanding of subjects, the curriculum, learners and learning. The Postgraduate Award from LJMU is co-designed to ensure that teaching and assignments are embedded in classroom practice. There is significant academic and pastoral support from LJMU, whose staff also visit our students and their mentors on placement."}],"createdAt":"2021-07-06T17:55:55.748Z","updatedAt":"2021-10-04T15:44:47.594Z"}
