{"id":"e1473ef6-b29f-4e0b-adff-558ab367008a","name":"Cabot Learning Federation SCITT","code":"2AV","type":"scitt","isAccreditedBody":true,"ukprn":"10049578","address":{"addressLine1":"CLF Institute","addressLine2":"Russell Town Avenue","town":"Redfield","county":"Bristol","postcode":"BS5 9JH"},"contact":{"website":"https://www.clfinstitute.net/","email":"katharine.alcock@clf.cabot.ac.uk","telephone":"01172 446233","fullName":"Katharine Alcock"},"location":{"latitude":51.4594152,"longitude":-2.5623418},"trainWithUs":"The Cabot Learning Federation (CLF) is an exciting and inspiring place to train. We are a mature Multi-Academy Trust (MAT) in the South West. The CLF is a diverse network of 20 entities including Primary, Secondary, an all-through 3-19 Academy, Post 16, a Studio School and alternative provisions. Our academies work collaboratively to offer the best possible education, outcomes and life chances for the young people and communities we serve, irrespective of background or circumstance. The CLF employs around 2000 staff and we educate approximately 12,000 children and young people. Our contexts include urban, inner-city, suburban, rural and coastal catchment areas in geographically local clusters serving Bristol, South Gloucestershire and North Somerset.\nThe CLF Institute is the centre for our SCITT and the Boolean Maths Hub. We also provide high quality professional development for teachers, leaders and support staff at every career stage. The CLF is jointly sponsored by Rolls Royce PLC and the University of the West of England (UWE); we work in partnership with UWE for the PGCE qualification. As a MAT, our trainees have opportunities for teaching within and beyond the phases they are training to teach. There are often employment opportunities within the CLF and our partnership schools.\nTeaching really is the best job in the world. Not only do you get to spend time with the most creative, funny, inquisitive and interesting young people, but you get to make a difference on a daily basis. Teaching has the potential to transform lives, including yours!","trainWithDisability":"The CLF SCITT programme is inclusive and personalised to meet the needs of every trainee. As a schools- based provision we have access to expertise within our partnership schools around meeting all specific educational needs and can provide reasonable adjustment for disabilities. Our trainees have access to study and occupational health support as required. A characteristic of our training programme, afforded by our scale and school-centred context, is the pastoral and individual support that we can provide to ensure that every trainee's needs are met.\n\nCLF SCITT trainees who undertake the PGCE award have access to the full range of student support provision from the University of the West of England (UWE) Bristol.\n \nCLF SCITT trainees have access to various online training packages including NIMBLE and NASBTT Learn.\n\nAll CLF SCITT trainees have access to our Employee Assistance Programme.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:47:51.244Z","updatedAt":"2021-09-10T16:55:44.431Z"}
