{"id":"e195e2d3-b272-4418-95c0-5c863afdc335","name":"Owls","code":"2K3","type":"lead_school","isAccreditedBody":false,"urn":"104863","ukprn":"10070946","address":{"addressLine1":"Farnborough Road Infant School","addressLine2":"Birkdale","town":"Southport","county":"Merseyside","postcode":"PR83DF"},"contact":{"website":"www.owlsteach.co.uk","email":"b.stevens082@googlemail.com","telephone":"7752810961","fullName":"B Stevens"},"location":{"latitude":53.6163841,"longitude":-3.0150529},"trainWithUs":"Training with OWLS We run a challenging but rewarding School Direct PGCE programme which will help you to secure deep and meaningful knowledge and understanding of teaching within primary education. The OWLS cluster is a dynamic group of schools offering a diverse range of contexts and training enhancements. Our staff have a long and successful history working closely in partnership with Edge Hill University. Edge Hill provides trainees with the academic bedrock of effective teaching and learning. In Edge Hill, your knowledge and understanding of research, both as a consumer and a leader, will be deepened. Within your tutor group, you will engage in preparation and reflection of your professional practices.\nThe cohort is big enough to share ideas and experiences, but small enough to offer opportunities for tailored provision and personal support. You will work alongside and be trained by outstanding, highly skilled, experienced class teachers who will guide, support and challenge you on your journey to becoming an outstanding practitioner. Training with OWLS will ensure that you gain a richly diverse set of experiences in school which will prepare you for a successful career in teaching. You will complete placements in two of our schools and visit other schools for enhancement days. You will be supported by outstanding mentors as well as a visiting tutor from Edge Hill.\nMore information on our Website www.owlsteach.co.uk\nTwitter Acount OWLSSTT.\nOWLS admin Barbara Stevens 07752810961\nbarbara@owlsteach.co.uk\nCourse Codes Training Provider Code 2K3 Training Programme 3D5D","trainWithDisability":"All our schools are inclusive.\nThe Inclusion Team provide information, guidance and support to applicants and students who have disclosed any of the following: Autism Spectrum Conditions (ASC), Mental Health, Sensory Impairment, Mobility difficulties or a medical condition e.g. Epilepsy, Diabetes, Heart Condition, Asthma and we work closely with academic and support staff across the University.\nLearning Services provides support to students with a specific learning difficulty – SpLD, such as Dyslexia.\nWe encourage disabled applicants to make contact with us early in the application process to enable us to plan for support you may need right from start of your university course. We provide a friendly and professional service and applicants and students can discuss individual requirements in complete confidence. Our highly experienced team are here to advise you about:\nImpact of disability/health condition and potential impact on study\nSupport available including 1-1 sessions, group support and study skills sessions\nThe benefits of a Student Support Plan\nDisabled Students Allowance (DSA) and eligibility\nReasonable adjustments to support your study\nExam modifications and alternative assessments\nRights and Responsibilities\nSupport whilst on placement (e.g. access and transport)\nDisclosure and Confidentiality\nRights and Responsibilities\nPEEPs and Emergency Action Plans\nOne of our priorities is to ensure safe environment for all students. If you have Epilepsy, Diabetes, Asthma or another serious health condition which may require First Aid, we strongly recommend that you complete one of our Emergency Action Plans. We can discuss this with you when you come to see us.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"d8c030de-91f2-420d-9ff7-4286c7f913fa","code":"E42","name":"Edge Hill University","description":"Edge Hill University is based on an attractive, award-winning 160-acre campus in Lancashire, close to Liverpool and Manchester. The institution has been providing higher education since 1885, with a mission to create opportunity from knowledge. \\r\\n\\r\\nThe institution’s significant success in achieving its mission is recognised by a range of awards and high rankings for teaching, student experience, accommodation and more. Edge Hill is ranked as Gold in the Teaching Excellence Framework (TEF), the government’s evaluation of excellence in teaching quality, learning environment and student outcomes. The University has previously held the coveted UK University of the Year title."}],"createdAt":"2021-07-06T17:51:41.821Z","updatedAt":"2021-10-01T15:13:42.739Z"}
