{"id":"e328aab3-a535-4921-8ded-5e37133c76dd","name":"Liverpool Hope University","code":"L46","type":"hei","isAccreditedBody":true,"urn":"133826","ukprn":"10003956","address":{"addressLine1":"Student Enrolment","addressLine2":"Hope Park","town":"Liverpool","county":"Merseyside","postcode":"L16 9JD"},"contact":{"website":"http://www.hope.ac.uk","email":"enquiry@hope.ac.uk","telephone":"0151 291 3111","fullName":"Liverpool Hope University"},"location":{"latitude":53.3908007,"longitude":-2.8922988},"trainWithUs":"Liverpool Hope University has been providing first class training opportunities for aspirational teaching professionals for nearly 175 years. The PGCE course offered is an intensive and challenging yet rewarding programme aimed at high quality graduates who have a real passion for their subject and a desire to inspire the next generation. If you train to teach with us, you will have the opportunity to work with highly skilled professionals, drawn from a range of academic and professional backgrounds, who bring with them a rich diversity of experience. The tutor teams are dedicated to providing individually tailored support as you work towards becoming an aspirational Hope Teaching Professional. We have developed strong, long standing partnerships with a wide range of schools across the North West, enabling us to provide you with the best school based training. At Liverpool Hope, we are committed to the idea that teachers are formed not trained, and therefore provide the theoretical and practical support you will need to become an outstanding classroom practitioner. A programme of engaging and interactive lectures, seminars, workshops and conference days supports the school based experience, enabling you to become a critically reflective professional, confident in making well informed, independent judgements.\nTEF Gold Award\nThe Teaching Excellence Framework (TEF) was introduced by the Government to build evidence about the performance of the UK’s higher education sector. Based on the evidence gathered, TEF awarded Liverpool Hope the gold award in recognition of the consistently outstanding teaching, learning and outcomes delivered for its students.","trainWithDisability":"We endeavour to ensure equality of educational opportunity across our diverse student community. The University will take reasonable steps to ensure that the general need for access and the specific requirements of individuals with additional support needs are addressed. The Learning Support Team works with disabled students in order to minimise any potential disadvantage they may face because of their disability. Find out more about disability support at [Hope], (https://www.hope.ac.uk/lifeathope/studentsupport/)","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:57:01.912Z","updatedAt":"2021-08-11T20:40:49.043Z"}
