{"id":"e3b33884-e0a6-4f9b-bb7d-589228f26db2","name":"Exceed Partnership","code":"278","type":"lead_school","isAccreditedBody":false,"urn":"143096","ukprn":"10057431","address":{"addressLine1":"Exceed SCITT and Teaching Schools","addressLine2":"Holybrook Training Campus","town":"Bradford","county":"West Yorkshire","postcode":"BD10 0EF"},"contact":{"website":"http://www.exceedscitt.co.uk","email":"exceed.scitt@exceedacademiestrust.co.uk","telephone":"01274 578606","fullName":"Kathryn Gerrard"},"location":{"latitude":53.824978,"longitude":-1.7134422},"trainWithUs":"Thank you for considering Exceed Partnership to train to teach in Bradford and Keighley. We also recruit to our Leeds hub based at Westerton Primary Academy. We aim to recruit 30 trainees on either a Primary 3-7 or 5-11 programme. We also have places for Salaried School Direct in Bradford and Teaching Apprenticeships which are based in Leeds. We want to know all our trainees as individuals to ensure your training experience is bespoke and meets your needs.\nOur programme is innovative and forward thinking, with 3 clear strands: The National Curriculum for strong subject knowledge and teaching strategies to ensure pupil’s make good progress; Professional Practice, such as inclusion and effective behaviours for learning so that you are confident to meet the needs of all children; Your personal well-being including mindfulness, positive psychology and managing workload.\nWant to train and make a difference to children’s life chances? There is no better place to train than in our diverse partner schools. We offer experiences that few providers can, such as experiencing schools in challenging socio economic circumstances and achieve outcomes well above national expectations. Our partnership is an amazing place to train and committed to its vision and values; ‘providing inspirational training for aspirational teachers and a genuine commitment to professional learning and evidence based practice.’ You can see the schools in our partnership here: (https://www.exceedscitt.co.uk)","trainWithDisability":"As a partnership of schools committed to inclusive education and challenging discrimination, we welcome applications from trainees with disabilities. Exceed SCITT places trainee welfare at the heart of its vision and values.\n“Putting the pupil at the heart of teacher training and Exceed Teachers at the core of our care.”\nYou will have regular progress meetings that include trainee wellbeing and support to ensure you can access all aspects of the training programme. For example, additional time for tasks, contact with expert tutors on the programme who can provide guidance and strategies for any individual needs. The Postgraduate Certificate in Primary Education is an academic award with 60 Masters Level credits and is awarded by a University. As a student of a University you are able to access the support services offered by the institution.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:51:21.098Z","updatedAt":"2021-09-29T15:45:12.082Z"}
