{"id":"e4195146-aae7-4f6c-9d14-91edd0962da4","name":"Henry Maynard Training E17","code":"2AW","type":"scitt","isAccreditedBody":true,"ukprn":"10053211","address":{"addressLine1":"Henry Maynard Primary Sch","addressLine2":"Maynard Road","town":"Walthamstow","county":"London","postcode":"E17 9JE"},"contact":{"website":"http://www.henrymaynardprimary.co.uk/topic/training","email":"training@henrymaynard.waltham.sch.uk","telephone":"020 8520 3042","fullName":"Programme Leader for ITE"},"location":{"latitude":51.5825522,"longitude":-0.0078526},"trainWithUs":"Henry Maynard Training E17 is an accredited provider of Initial Teacher Training. We are based at Henry Maynard Primary School in Walthamstow and, as a school, we have successfully been involved in leading teacher training for more than 15 years. We provide initial teacher training leading to the awards of QTS and PGCE (validated by University of Brighton).\nHenry Maynard Training E17 was graded Outstanding by Ofsted in 2018. [https://reports.ofsted.gov.uk/provider/41/70359]\n\nWe are committed to training outstanding teachers who will serve the diverse community in North and East London. Our aim is to produce high quality teachers who are fully able to inspire, educate and nurture our local children.\nWe have a great track record of producing outstanding teachers, leaders and head teachers of the future. 100% of our trainees in 2020-21 secured a teaching position at the end of the course. The majority of our trainees take up NQT positions in one of our partnership schools.","trainWithDisability":"Our buildings are accessible and we follow an equality policy in line with the Equalities Act of 2010. We welcome applications from all candidates meeting entry requirements and we offer appropriate support to applicants with disabilities and other needs.\nApplicants with additional needs should contact us so we can discuss how best to support them.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:54:17.987Z","updatedAt":"2021-09-28T15:57:25.169Z"}
