{"id":"e42576ab-5005-412e-bfae-ecf0cd334bf1","name":"Alfreton Nursery School","code":"2C2","type":"lead_school","isAccreditedBody":false,"urn":"112485","ukprn":"10083807","address":{"addressLine1":"Stanton Close","addressLine2":"Alfreton","town":"Derby","county":"Derbyshire","postcode":"DE553SH"},"contact":{"website":"https://alfreton.derbyshire.sch.uk/","email":"katie.cresswell@alfreton.derbyshire.sch.uk","telephone":"1773520031","fullName":"Katie Cresswell"},"location":{"latitude":53.093613,"longitude":-1.388254},"trainWithUs":"Alfreton Nursery School is an outstanding DCC Maintained School. The school has been consistently outstanding for 22 years, becoming accredited as a National Teaching School in Sept 2015 in recognition of its hard work and collective drive to constantly raise standards in school. As all Teaching Schools were de-designated in September 2021, Alfreton Nursery School is now a key partner of Potentia Teaching School Hub (TSH)\nWe provide opportunities for working in both urban and rural settings, within diverse communities. Specialisms include EYFS, KS1 and Primary as well as Secondary through David Nieper Academy.\nThe rich opportunities available from working in staff teams within our local Schools offers our graduates high quality teacher training opportunities.\nWe offer enhanced Teacher Training for professional studies, building inclusive practitioners, skilled in Special Educational Needs, behaviour for learning and closing the achievement gap, harnessing expertise from our strategic partners.\nFrom day 1 you will be fully immersed in our staff teams, hitting the ground running; attending staff meetings and development days. You will spend most of your school year in one host school, with a mid term placement in an alternative phase; gradually increasing the amount of time spent in the role of a teacher.\nYou will be assessed throughout the course by both your link tutor and school mentor, whilst receiving the most up-to-date training and pedagogy from the University of Derby and our teaching professionals. We will inspire you to teach and look forward to hearing more about you.","trainWithDisability":"As a fully inclusive school and Inclusion Quality Mark (IQM) Centre of Excellence (CoE), we support candidates with disabilities and other needs as long as all our entry requirements can be met.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"aa023df3-b71e-4249-b9c4-41fca8bd135e","code":"D39","name":"University of Derby","description":"For our Primary and Secondary courses we work in partnership with The University of Derby to provide bespoke School Direct teaching programmes. Students are immersed in school practice for the duration of their course, spending days at the University to build on knowledge, experience and expertise. \\r\\n\\r\\nOffering practical classroom experience throughout, our courses help students join a new generation of talented school teachers.\\r\\n\\r\\nAll trainee teachers are mentored by a teacher and link tutor."}],"createdAt":"2021-07-06T17:51:20.379Z","updatedAt":"2021-07-16T17:38:53.465Z"}
