{"id":"e43bdebc-5157-4418-9196-bcb9cc39e758","name":"Grazebrook Primary School","code":"18Y","type":"lead_school","isAccreditedBody":false,"urn":"100258","ukprn":"10078018","address":{"addressLine1":"Grazebrook Primary School","addressLine2":"Lordship Road","town":"Stoke Newington","county":"London","postcode":"N16 0QP"},"contact":{"email":"teachingschool@newwavefederation.co.uk","telephone":"0208 802 4051","fullName":"School Direct Lead"},"location":{"latitude":51.5644404,"longitude":-0.082878},"trainWithUs":"New Wave offers trainee teachers the unique opportunity to work and learn in a range of exciting and innovative primary schools. The partnership consists of four high-performing primary schools, one exceptional secondary and one highly successful, outstanding graded all through special school. All the primary applications will be led by Grazebrook Primary School.\nThe lead school, Grazebrook Primary School, Shacklewell Primary School, Woodberry Down Community Primary School, Mossbourne Riverside and Sir Thomas Abney are all outstanding schools who are leaders in their fields. All schools share a common ethos and approach to pedagogy, ensuring that pupils become confident learners achieving the highest standards possible. As a group of schools we share the same vision for Initial Teacher Training. We are passionate about supporting and nurturing the next generation of teachers and ensure that all of our trainees receive the very best professional development. All of our previous trainees are currently in teaching positions and qualified at a good or outstanding level.\nFor more information about us, Teaching Apprenticeships or the School Direct programme please visit our website or contact us on the address below. We look forward to hearing from you.\nteachingschool@newwavefederation.co.uk","trainWithDisability":"At New Wave, we welcome applications from graduates with disabilities. We fundamentally believe that there is an important place for teachers with disabilities within the teaching profession and our schools are committed to supporting future trainees fully.\nIf potential applicants are interested in finding out more information about ways in which we can support, please do get in touch.\nAll information will be treated sensitively and in confidence. (https://newwaveteachingschoolalliance.co.uk)\nteachingschool@newwavefederation.co.uk","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:51:09.665Z","updatedAt":"2021-10-13T17:44:33.733Z"}
