{"id":"e46d3ef9-9b34-480a-bb64-1d408a14057c","name":"Shanidar - West Yorkshire","code":"2JY","type":"lead_school","isAccreditedBody":false,"urn":"139978","ukprn":"10042623","address":{"addressLine1":"Co-Op Academy Southfield","addressLine2":"Haycliffe Lane","town":"Bradford","county":"West Yorkshire","postcode":"BD5 9ET"},"contact":{"website":"http://www.shanidar-tsa.org.uk","email":"robert.cameron@coopacademies.co.uk","telephone":"01274 062580 ext 251","fullName":"Rob Cameron"},"location":{"latitude":53.7744858,"longitude":-1.7775959},"trainWithUs":"Thank you for considering Shanidar – West Yorkshire, in Bradford, Keighley, Leeds and Skipton as your provider of School Direct, ITT. We aim to recruit a cohort of 15-20 trainees on a Primary (5-11) programme with an additional specialism in SEN. This course is suitable for those wanting to work in either a mainstream primary or a special school. Our ethos is to champion inclusive education for all pupils and challenge discrimination. If you have a passion for inclusive education and you're wanting to train to be a teacher to make a difference to children's life chances, there is no better place to train than in our diverse partner schools.\nYou'll be awarded QTS by Exceed SCITT and a PGCE by Leeds Trinity University. Our programme has 4 pathways for you to choose from;\n* Autism (communication and interaction)\n* Generic SEND (cognition and learning)\n* Social, Emotional and Mental Health (SEMH) * Sensory (Visual Impairment / Hearing Impairment). We aim to match you with a home school that reflects your interest in SEND and/or geographical location.\nOur partnership of 14 schools have a passion and commitment to providing excellent inclusive education. * Brooklands Special School\n* Bradford Central PRU\n* Cottingley Village Primary\n* Crossley Hall Primary\n* Delius Special School\n* Farnley Park Special School\n* Girlington Primary\n* Grove House Primary * Haworth Primary\n* Hazelbeck Special School\n* Ingrow Primary\n* Long Lee Primary\n* Southfield Special School\n* Swain House Primary School","trainWithDisability":"As a partnership of schools committed to inclusive education and challenging discrimination, we welcome applications from trainees with disabilities. Exceed SCITT places trainee welfare at the heart of its vision and values.\n“Putting the pupil at the heart of teacher training and Exceed Teachers at the core of our care.”\nYou will have regular progress meetings that include trainee wellbeing and support to ensure you can access all aspects of the training programme. For example, additional time for tasks, contact with expert tutors on the programme who can provide guidance and strategies for any individual needs. The Postgraduate Certificate in Primary Education is an academic award with 60 Masters Level credits and is awarded by Leeds Trinity University. As a student of the University you are able to access the support services offered by the institution.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:47:55.706Z","updatedAt":"2021-10-18T21:49:54.129Z"}
