{"id":"e4e2c0ab-04a5-483c-be62-ecd763da90da","name":"Wade Deacon Trust","code":"1KQ","type":"lead_school","isAccreditedBody":false,"urn":"111435","ukprn":"10007848","address":{"addressLine1":"Wade Deacon Trust","addressLine2":"Wade Deacon High School, Birchfield Road","town":"Widnes","county":"Cheshire","postcode":"WA8 7TD"},"contact":{"website":"https://www.wadedeacontrust.com/teaching-school/teacher-training-programme/","email":"j.goulding@wadedeacontrust.co.uk","telephone":"01514583400 ext 1002","fullName":"Jen Murphy, Teaching School Strategic Le"},"location":{"latitude":53.3764973,"longitude":-2.7351048},"trainWithUs":"Wade Deacon Trust is a very experienced School Direct training provider. All of our courses are managed by our Leader of Teacher Training, Jane Goulding, who has been awarded the University of Chester Outstanding Professional Mentor award, so we guarantee that you're in safe hands! Every Associate Teacher is assigned a personal Subject Mentor, who will support your day to day teaching and guide you through your training. We will ensure that you meet all of the Teachers' Standards, and will provide you with high quality experiences and access to the very best school-based training. The School Direct programme consists of a structured training programme for the academic year, including an alternative school placement, enrichment opportunities and a full timetable of in-house training sessions. As a member of staff you will participate in all aspects of the role of a teacher, including participation at Open Evenings, Parents' Evenings and educational visits taking place throughout the academic year, making this a highly realistic experience!\nWe place a large emphasis on ensuring that you are ready to secure your first teaching post, so offer application and interview training, alongside developing your skills in the classroom.\nOur exceptional reputation within the community, and close work with a variety of different settings, provides our Associate Teachers with rich and varied experiences. Previous Associate Teachers have benefitted from spending time in our local Special School; exploring EYFS provisions at local Nursery Schools, and working closely with organisations including Widnes Vikings Rugby Club and England FA.","trainWithDisability":"We are keen to ensure that all students benefit fully from the School Direct programme. Each training site is fully compliant with The Equality Act 2010.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:50:33.671Z","updatedAt":"2021-10-05T22:41:09.957Z"}
