{"id":"e5573d32-1684-4472-9e2b-c6743eddce31","name":"West London Teacher Training Alliance (Secondary)","code":"2BV","type":"lead_school","isAccreditedBody":false,"urn":"137935","ukprn":"10036715","address":{"addressLine1":"WLTTA Office, Sacred Heart High School","addressLine2":"212 Hammersmith Road","town":"Hammersmith","county":"London","postcode":"W6 7DG"},"contact":{"website":"http://www.wltta.org.uk","email":"adijkhuis@sacredh.lbhf.sch.uk","telephone":"0208 748 7600 x290","fullName":"Alex Dijkhuis"},"location":{"latitude":51.493165,"longitude":-0.2228436},"trainWithUs":"THE WEST LONDON TEACHER TRAINING ALLIANCE (WLTTA) The West London Teacher Training Alliance represents a large group of 70 schools (nurseries, primaries, special needs, secondaries, sixth forms; faith and non-faith, maintained schools, independent schools and free schools) – who are all seeking to mentor and build a relationship with a trainee who aspires to work in their school. Most of our schools are in Hammersmith & Fulham and Kensington & Chelsea, but we also have schools in Westminster, Richmond, Twickenham, Ealing, Hounslow, Hillingdon and Brent. The WLTTA office is based at Sacred Heart High School, in Hammersmith.\nWe have formal partnership arrangements for teacher training with four universities\n* St Mary's University, Twickenham\n* University of Roehampton\n* University College London (UCL)\n* London Metropolitan University\nOUR APPROACH TO TRAINEE RECRUITMENT\nWe pride ourselves in the support that we provide potential applicants and in the speed of our shortlisting. We have a detailed website (do please look) [wltta.org.uk](https://www.wltta.org.uk/)\nThe WLTTA office is staffed full time with teacher-training recruitment experts to talk to on the phone. With us, you choose the schools when you apply. If you perform well at interview but fail to get a place at your preferred school, we operate an internal referral system rather than rejecting you (see the interview section below).\nWe place significant emphasis on getting a good fit between trainee and school because we are all keenly focused on recruitment for qualified teachers in our alliance schools the following year.","trainWithDisability":"WLTTA and all our partner universities are committed to supporting students with disabilities. Please contact us as early as possible in your application process so that your needs are met and support can be arranged.\nYou can also find support and information from the university accrediting the course that you hope to apply for:\nST MARY'S UNIVERSITY offers advice and support to their students who have requirements as a result of a disability, specific learning difficulty (e.g. dyslexia), medical condition or temporary disability, such as injury. St Mary’s Dyslexia and Disability Co-ordinator (DDC) works closely with the other members of the Student Services team, supporting students in their time at university assisting them to be proactive in their studies as an independent learner. [http://www.smuc.ac.uk/student-support/dyslexia-and-disability/](http://www.smuc.ac.uk/student-support/dyslexia-and-disability/)\nUNIVERSITY OF ROEHAMPTON: [http://www.roehampton.ac.uk/Disabilities/Support/](http://www.roehampton.ac.uk/Disabilities/Support/)\nUCL:\nYou would be able to access the services provided by UCL’s Student Support and Wellbeing team. See the following web page for full details:- [https://www.ucl.ac.uk/students/student-support-and-wellbeing](https://www.ucl.ac.uk/students/student-support-and-wellbeing)\nLONDON METROPOLITAN UNIVERSITY\nTo register with London Met's Disabilities and Dyslexia Service (DDS), you can call them on 020 7133 2188 or email: [dds.studentservices@londonmet.ac.uk](dds.studentservices@londonmet.ac.uk).","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:53:46.701Z","updatedAt":"2021-10-25T18:25:30.209Z"}
