{"id":"e5b44d52-86b8-4298-bf6e-1fa5bfd8a5a6","name":"The Minster Learning Alliance","code":"1EC","type":"lead_school","isAccreditedBody":false,"urn":"145643","ukprn":"10081959","address":{"addressLine1":"Minster School","addressLine2":"Nottingham Road","town":"Southwell","county":"Nottinghamshire","postcode":"NG25 0LG"},"contact":{"website":"https://www.minster.notts.sch.uk/teaching-school/initial-teacher-training","email":"p.omalley@minster.notts.sch.uk","telephone":"01636 817365","fullName":"David Boothroyd - Deputy Director MTSA"},"location":{"latitude":53.0721199,"longitude":-0.9567761},"trainWithUs":"The Minster Learning Alliance is committed to identifying, training and supporting outstanding teachers of the future and the School Direct training programme provides the opportunity to recruit and develop the next generation of teachers by hosting School Direct PGCE trainees. The Alliance has a long record of partnership with our Higher Education partners in helping to train teachers. We facilitate School Direct PGCE training for over 30 teachers per year across the Alliance. Over the past few years, 100% of our trainees have successfully qualified and secured teaching posts within 6 months of completing the School Direct course. A large proportion of our trainees are employed by their host school, or other schools within the Alliance.\nIn addition to the support that you will receive from your university and your host school, the Alliance will provide support for you and your mentor, including:\n- a programme of sessions throughout the year to support and complement practice that has been taught at university and in school\n- specific additional training for key elements of phase-specific teaching, such as phonics or GCSE/A Level examinations\n- the opportunity to link and work with School Direct students in other schools across both primary and secondary phases, which has proven to be a real network of support\n- a second placement at a school in a contrasting context, with careful consideration of your transport and training needs\n- additional support from our team throughout your training.","trainWithDisability":"In partnership with our universities, support can be provided for applicants with disabilities and other needs. This may be delivered through specific support from your university, additional training or resources, and consideration of your needs by ourselves and/or your host school.\nAs with students across our Alliance, we will endeavour to provide support on a bespoke and individual basis wherever possible. If you have a disability or additional need, please contact us to discuss this.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:52:52.474Z","updatedAt":"2021-09-29T22:01:34.095Z"}
