{"id":"e6c26d28-03d4-443c-9b65-5db7e183966c","name":"Gloucestershire Initial Teacher Education Partnership (GITEP)","code":"G48","type":"scitt","isAccreditedBody":true,"ukprn":"10034789","address":{"addressLine1":"Unit 23, The Steadings Business Centre","addressLine2":"Maisemore","town":"Gloucester","county":"Glos","postcode":"GL2 8EY"},"contact":{"website":"www.gitep.org.uk","email":"admin@gitep.org.uk","telephone":"01242 505945","fullName":"Admissions"},"location":{"latitude":51.8929519,"longitude":-2.2713547},"trainWithUs":"[GITEP SCITT](https://www.gitep.org.uk) is a highly successful school centred initial teacher training provider, rated outstanding by [Ofsted].( https://reports.ofsted.gov.uk/inspection-reports/find-inspection-report/provider/ELS/70026) Five key values underpin the partnership:\n1.\tPartnership and community\nOur intention is that the trainees will go on to teach in partnership schools, growing together as a community of new teachers and supported by a community of trainers, drawn from schools across the partnership.\n2.\tSubject knowledge and expertise\nTrainees develop a strong understanding of the pedagogical principles of their subject.\n3.\tResearch-informed and reflective practice\nTrainees engage critically with the latest research and use it to develop their understanding of high-quality teaching.\n4.\tPupil progress and outcomes\nAll training focuses on the progress of pupils. Trainees develop a strong understanding of the needs of individual pupils.\n5.\tWellbeing and support\nWe hope trainees build a career in our partnership schools and feel fully supported in doing so, developing effective strategies and habits to manage their workload and enjoy their teaching.\nGITEP SCITT works with the University of Bristol to offer the academic PGCE. GITEP and the University both focus solely on secondary teacher training and share a commitment to developing outstanding subject expertise.\nGITEP has around 30 partner schools - “the richest possible mix of different settings” according to Ofsted. We pride ourselves in knowing all our trainees individually and providing outstanding support.","trainWithDisability":"We welcome applications from trainees with disabilities and particular needs. A conversation with you, by telephone or at one of our taster days, may help us clarify how we can best support you.\nWe have a large number of partnership schools and some will be better suited than others to particular needs. An early conversation can help us identify the most appropriate training placement e.g. a school where your subject is taught in ground floor classrooms. We have had trainees with hearing and visual impairments and have worked with placement schools to ensure suitable support.\nTrainees receive excellent support from mentors and training managers in schools, as well as their subject leader. Liaison between schools and the GITEP leadership is very strong and we are used to making reasonable adjustments to help trainees, both short term and over the whole course.\nAll GITEP PGCE trainees are registered as students with the University of Bristol and this gives access to the full range of student services offered by the University. This includes support with academic assignments for trainees with dyslexia and all the University counselling and student support services. Trainees with disabilities and other needs are strongly encouraged to register with the University Library Support service.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:50:44.359Z","updatedAt":"2021-09-28T16:20:53.707Z"}
