{"id":"e71fb6cf-eff8-4110-bc88-c6d60462c64b","name":"Carlisle School Direct","code":"136","type":"lead_school","isAccreditedBody":false,"urn":"137369","ukprn":"10034763","address":{"addressLine1":"Strand Road","town":"Carlisle","county":"Cumbria","postcode":"CA1 1JB"},"contact":{"website":"http://trinity.cumbria.sch.uk/schooldirect/","email":"dme@trinity.cumbria.sch.uk","telephone":"01228 516051 ext320","fullName":"School Direct Programme Lead"},"location":{"latitude":54.8971262,"longitude":-2.9282662},"trainWithUs":"The Carlisle School Direct alliance provide 'hands on' training for both Primary and Secondary student teachers. The schools forming Carlisle School Direct have come together to support our trainees with the knowledge and skills essential to develop the future learning and achievement of young people across Carlisle and the surrounding areas.\nBuilt around a close partnership between an alliance of leading schools, Carlisle School Direct offers an exciting way to 'learn to teach by teaching' that covers every classroom situation: from small rural schools to the area's largest. Our programme offers Masters level credits as part of the PGCE with Qualified Teacher Status (QTS). You will receive excellent school-based practice and academic input to support your journey.\nDeveloped in close association with the University of Cumbria, one of the largest providers of Teacher training in the country and Carlisle's Trinity School, the alliance provides a real insight into the reality of the profession. We take pride in our personal approach and offer an exciting programme which allows you to grow your teacher identity.\nWe have consistently achieved 'good' or better outcomes for our student teachers with a high percentage gaining employment locally: over 90% of our Primary and Secondary trainees secured employment in 2019.","trainWithDisability":"All our students have access to the University of Cumbria's support systems as well as that offered within our own alliance of schools. As a distance learner you can access support online or our location in allows easy on campus access too.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:56:02.595Z","updatedAt":"2021-09-26T19:02:14.141Z"}
