{"id":"e7be94a0-c2e6-4944-a37f-b6a56e4cfc8d","name":"Dorridge Alliance","code":"2KX","type":"lead_school","isAccreditedBody":false,"urn":"104045","ukprn":"10068838","address":{"addressLine1":"Dorridge Primary School","addressLine2":"Hanbury Road","town":"Solihull","county":"West Midlands","postcode":"B93 8EU"},"contact":{"website":"www.dorridge.solihull.sch.uk/Train-to-Teach/School-Direct/","email":"s22traintoteach@dorridge.solihull.sch.uk","telephone":"01564 772836","fullName":"Mrs G Thelwell"},"location":{"latitude":52.377288,"longitude":-1.750604},"trainWithUs":"With over 15 years experience training teachers of the future, we are delighted to present the Dorridge Alliance. We are an ITT provider consisting of 6 good and outstanding schools in partnership with Warwick University, an Ofsted outstanding ITT provider. To complement the university led training, the Dorridge Alliance will provide a bespoke series of CPD sessions tailored to meet your needs, designed to ensure you are NQT ready for September 2021. These sessions will be led by outstanding practitioners and lead professionals from our alliance schools. We will guide and support you through the course, with each school providing an in house mentor as well as your university mentor. Our Lead Professional Mentor and Quality Assurance Leads will work alongside each of our schools to ensure you become the very best teacher you can be.","trainWithDisability":"Our courses attract a diverse range of age groups and backgrounds, creating a welcoming, inclusive and supportive community, that everyone can feel a part of. Arrangements can be made to support applicants with particular needs.\nApplicants will need to be able to travel independently between the University Campus in Coventry and to the training schools in Solihull and Birmingham Local Authorities.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:46:30.483Z","updatedAt":"2021-09-29T17:39:09.369Z"}
