{"id":"e7ff38ed-7cdd-4acd-b74d-20f00aa73b2a","name":"Bishop Wheeler Catholic Academy Trust Professional Development Partnership (BWCAT Partnership)","code":"1QD","type":"lead_school","isAccreditedBody":false,"urn":"139352","ukprn":"10040645","address":{"addressLine1":"St Mary’s Teaching School","addressLine2":"Broadgate Lane","town":"Horsforth","county":"Leeds","postcode":"LS18 5AB"},"contact":{"website":"https://www.bishopwheelerpdp.org","email":"ITT@stmaryshorsforth.org","telephone":"0113 2584593","fullName":"Peter Hughes"},"location":{"latitude":53.8399245,"longitude":-1.6320481},"trainWithUs":"Bishop Wheeler Catholic Academy Trust Professional Development Partnership (BWCAT PDP formerly St Mary's Teaching School) is an inspirational partnership that is currently in its eighth year of providing high quality Teacher Training. A high proportion of trainees are retained in our Teaching School Alliance and Diocese. \nOur Teaching School Alliance covers a wide geographical area, working with a number of good and outstanding schools across Leeds and North Yorkshire. As part of the Bishop Wheeler Catholic Academy Trust, we a group of excellent voluntary academies working together. All schools that we are in partnership with are in a variety of settings providing varied and exciting training opportunities.\nWe provide high-quality training, mentoring and coaching in a supportive\nand caring environment. The teachers in our alliance are outstanding practitioners with exemplary behaviour management skills who are eager to share their skills, knowledge and practice with the next generation of teachers. Our Partnership is aspirational and aims to support and train outstanding teachers of the future, with a real focus on the quality of teaching and learning. Working closely with the National College for Teaching and Learning we are up to date, lead, share and research that which shapes and develops the future of education. Our investment in training teachers extends beyond Initial Teacher Training as many of our trainees continue to complete our ECT Programme with Leeds Trinity. Not only that, we are committed to the continued professional development of teachers into middle leadership and beyond.","trainWithDisability":"BWCAT PDP in partnership with Leeds Trinity are committed to enabling you to achieve your full potential. We work to ensure that the educational opportunities we provide are inclusive for all students. We recognise the diversity of our population as a strength, and value the way that differences can contribute to a richer, creative and more productive environment.\nWe value the individual contribution of people irrespective of sex or gender, pregnancy/maternity, transgender status, marital/civil partnership status, sexual orientation, age, disability, race, colour, ethnic or national origin, religion or belief.\nOur Training Program environment in which individual differences and the contributions of all students are recognised and valued. We create a learning environment for every trainee that promotes dignity and respect to all and welcome applicants from all backgrounds and needs.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"accreditedBodies":[],"createdAt":"2021-07-06T17:56:52.645Z","updatedAt":"2021-10-13T20:34:50.599Z"}
