{"id":"e806d5d7-c3fc-45cd-b5b3-f3b9b9ffaa91","name":"Windsor Teaching Alliance","code":"23R","type":"lead_school","isAccreditedBody":false,"urn":"70246","ukprn":"10005550","address":{"addressLine1":"Imperial Road","town":"Windsor","postcode":"SL4 3RT"},"contact":{"email":"dohea001@windsorgirls.net","telephone":"1753795155","fullName":"Laura Hynes"},"location":{"latitude":51.4724469,"longitude":-0.6300508},"trainWithUs":"The Royal Borough of Windsor and Maidenhead (RBWM) has been a successful Initial Teacher Training provider of salaried route for both secondary and primary trainees since 2002.\nRBWM SCITT work in partnership with Bucks New University (BNU) based in High Wycombe. Trainees graduate with Qualified Teacher Status (QTS) and a Post Graduate Certificate in Educational Practice (PG Cert) this is 60 Masters credits equivalent to a third of a Masters.\nThe RBWM SCITT works with the Windsor Teaching Alliance of First Schools, Middle Schools and Upper Schools.\nWe also have a history of working with Independent Schools and welcome applications from this sector. There are also places available to work with Schools in other neighbouring Local Authorities. Since 2009 100% of trainees have gained QTS and 100% have gained employment. In 2017-2018 100% of trainees gained employment in The Royal Borough or surrounding areas.\nRBWM SCITT is based within the Early Years and Childcare Advisory Service at Maidenhead Town Hall, giving us excellent access to a wide range of expertise, including Strategic School Leadership, Educational Advisers and Consultants. RBWM Initial Teacher","trainWithDisability":"Disability Access\nAll schools within the local authority have an accessiblity plan ensuring access for all sites. \n\nHaving worked with dyslexic trainees in the past we are able to provide for their individual needs following appropriate assessments.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:54:41.499Z","updatedAt":"2021-07-15T18:34:33.302Z"}
