{"id":"e843cb68-d310-478c-8dba-cf9633fea086","name":"University of Chester","code":"C55","type":"hei","isAccreditedBody":true,"ukprn":"10007848","address":{"addressLine1":"Riverside Campus","addressLine2":"Castle Drive","town":"Chester","county":"Cheshire","postcode":"CH1 1SL"},"contact":{"website":"https://www1.chester.ac.uk/education-and-childrens-services/postgraduate-courses","email":"admissions@chester.ac.uk","telephone":"1244511000","fullName":"Undergraduate Admissions"},"location":{"latitude":53.1852087,"longitude":-2.8916499},"trainWithUs":"The [University of Chester](https://www1.chester.ac.uk) is an outstanding provider of teacher education, and one of the oldest higher education institutions in the UK. We started teacher training in 1839, and since then the University has developed and evolved to the modern, innovative institution it is today, with a well-deserved reputation for the quality of its education. Our [Faculty of Education and Children’s Services](https://www1.chester.ac.uk/education-and-childrens-services) has been awarded 'Outstanding' status in its most recent Ofsted report (Ofsted Report 2016), for its secondary programmes and all 3-7 and 5-11 primary/primary-early years programmes. The Faculty has extensive links to schools within the region, and offer a huge range of undergraduate, postgraduate and professional development courses for those involved or interested in education, teaching and children’s services. Students can benefit from a range of subject specific facilities designed to bring learning to life; high-quality learning facilities and an on-campus library, housing an extensive collection of books and journals, as well as computer suites and multi-media rooms.\nOur experienced team of staff work hard to help you realise your potential through a variety of teaching methods, including practice placements. So whether you’re studying as part of your career development, or retraining towards a new career, our staff and on-campus facilities aim to provide you with a safe and professional environment to hone your skills.","trainWithDisability":"[Disability and Inclusion](https://www.chester.ac.uk/campus-life/support-for-students/disability-support) look to fully support all types of disabilities or impairments on a case by case basis to ensure the individual’s needs are reviewed accordingly. We endeavour to provide an inclusive learning and teaching environment, in which all students can achieve their potential. This inclusive environment looks at the way in which courses are run, the accessibility of resources and materials, assessment types and support available with professional placements. Examples of inclusive practice would include accessible buildings, lecture information being made available two days prior to learning, presentations being consistent and easy to follow (colours, text formats etc.) and optional study skills seminars or sessions that students can attend.\nWe are very aware of the complex needs some students may have, such as students with mobility difficulties or visual impairments. We are able to advise these students on the support available through government organisations and specific reasonable adjustments the University are able to put in place, if barriers to learning are still present. Examples could include accessible formats for reading materials, text to speech software, extra time in examinations, alternative seating, ground floor lectures or height adjustment desks.\n[Student Futures Support](https://www.chester.ac.uk/campus-life/support-for-students/section) pride their selves on the quality of the support that they provide students.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"createdAt":"2021-07-06T17:51:06.330Z","updatedAt":"2021-09-15T16:33:01.018Z"}
