{"id":"e8a86c7e-57c3-40d6-bc7e-d71df5d19fb4","name":"Grey Court Training School","code":"22S","type":"lead_school","isAccreditedBody":false,"urn":"138825","ukprn":"10039056","address":{"addressLine1":"Ham Street","addressLine2":"Ham","town":"Richmond","county":"RICHMOND","postcode":"TW10 7HN"},"contact":{"website":"http://www.greycourt.richmond.sch.uk","email":"cmeri@greycourt.org.uk","telephone":"2089481173","fullName":"Chrystelle Meri"},"location":{"latitude":51.4388657,"longitude":-0.3121524},"trainWithUs":"Why train with us?\n“The quality of training at the Grey Court School is first class” Ofsted January 2018\nGrey Court Training School Alliance is a group of good and outstanding schools to work, train and learn. We provide a supportive, outstanding and tailored learning opportunity in partnership with the universities of St Mary’s, King’s College London, Kingston, Brunel and Goldsmith. The Grey Court Training School Alliance is a partnership of 10 schools, secondary and primary, across the boroughs of Richmond and Kingston , many of which have achieved good and outstanding ratings.\nOur partnership of schools is led by Grey Court School and includes a variety of mixed secondary and primary schools, a faith school ,a girls’ school and one independent school. Our partner schools are: *Chessington School http://chessington.kingston.sch.uk\n*Christ’s School http://www.christs.richmond.sch.uk\n*The Hollyfield School https://www.hollyfield.kingston.sch.uk\n*The Ibstock Place school https://www.ibstockplaceschool.co.uk *Meadlands Primary School https://www.meadlands.richmond.sch.uk *Orleans Park School https://www.orleanspark.school\n*The Russell School https://www.russell.richmond.sch.uk *St. Richard’s Primary School https://www.srsa.richmond.sch.uk\n*Strathmore School https://www.strathmore.richmond.sch.uk *Waldegrave School https://www.waldegrave.richmond.sch.uk\nAll our mentors are qualified teachers, and trained mentors with great expertise to share and train you as you prepare to enter the best job in the world!\nOur trainees have said “Training with the Great Court Alliance was an outstanding experience”.\nYou can find some of our past events on Eventbrite, search for \"Grey Court School\". We hope to be able to offer some \"Get into Teaching\" events from the Spring Term 2022. Please check Eventbrite regularly.","trainWithDisability":"Working in partnership with the universities, we support candidates with disabilities and other needs. All our student teachers are assessed to evaluate their \"fitness to teach\" as part of their enrolment process. In the past we have successfully trained student teachers with *dyslexia\n*mental health conditions\nGrey Court Training School is a very supportive and inclusive environment to train and work in. We are very proud or out well-being policy and provision for our school community. Our trainees are always invited to join a range of fun extra-curricular activities for staff, such as football, yoga, Zumba and many more.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:47:17.486Z","updatedAt":"2021-10-29T19:53:33.789Z"}
