{"id":"e8d8646a-daca-4733-8f73-6172e688a093","name":"St John’s CofE Primary School BD4 6JF","code":"2HY","type":"lead_school","isAccreditedBody":false,"urn":"145220","ukprn":"10065957","address":{"addressLine1":"St John’s C of E Primary School - School Direct","addressLine2":"Dawson Lane,","town":"Bierley","county":"Bradford","postcode":"BD4 6JF"},"contact":{"website":"https://www.bradfordbirthto19.co.uk/index.php/home/scitt/initial-teacher-training-scitt/school-direct-primary","email":"scitt@bradfordbirthto19.org","telephone":"01274 494898","fullName":"Lesley Burton"},"location":{"latitude":53.76682,"longitude":-1.7208751},"trainWithUs":"St John's C of E Primary School serves its community by providing an education of the highest quality. At St John’s we pride ourselves on our knowledge of our children: the children come first in all that we do. We work hard to know every child, to know their strengths and interests, so that their learning is always challenging and interesting. We work closely with families to ensure that our families are empowered to support their children within and beyond school. The team at St John’s work hard to ensure our curriculum is inspiring for our children, responding to their needs both academically and personally, building individual, independent children as they leave our school.\nWe are keen to recruit student teachers who share the same commitment. If you share our vision for education, we want to hear from you. We will provide highest quality training, delivered by outstanding practitioners through a bespoke training package, to make the most of your knowledge and skills. After a year's successful training, you will achieve Qualified Teacher Status. As School Direct partner working with our SCITT provider, we are committed to helping you develop professionally, beyond your training and Newly Qualified Teacher year by means of an extensive programme of Continuing Professional Development opportunities.","trainWithDisability":"We believe that teachers with disabilities make an important contribution to schools both in the classroom and in shaping the wider culture and ethos of the schools they work in, indeed we have 100% pass rate for trainees who have declared a disability. We adhere to The Equality Act 2010 and Special Educational Needs and Disability Act 2001, which require teacher training providers to ensure they are not discriminating against applicants with disabilities or special educational needs (SEN).\nAll our partner Schools value diversity and the unique contribution that all their staff and trainees bring.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"58e814cb-bf42-4d3d-9486-b3ea827fd9e2","code":"259","name":"Bradford Birth to 19 SCITT","description":"Bradford Birth to 19 School Centered Initial Teacher Training (SCITT) offers a different way of training to become a teacher. Learn by listening to and observing good and outstanding teachers. Training involves practicing your teaching skills with groups of students. Supported effectively by a school mentor, you are treated as a member of the school staff, someone the school is often looking to potentially employ. This route ensures you are working in your class from day one of the course.\\r\\nWe aim to train the next generation of outstanding teachers"}],"createdAt":"2021-07-06T17:47:53.787Z","updatedAt":"2021-09-30T20:12:23.060Z"}
