{"id":"e8ea0f17-91d8-4cf9-a962-b2740a44d05a","name":"Teach Thurrock Primary Partnership","code":"166","type":"lead_school","isAccreditedBody":false,"urn":"139104","ukprn":"10039702","address":{"addressLine1":"Dilkes Academy","addressLine2":"Garron Lane","town":"South Ockendon","county":"Essex","postcode":"RM15 5JQ"},"contact":{"website":"www.teachthurrock.org.uk","email":"andrea.parfett@catrust.org.uk","telephone":"01708 852128","fullName":"Headteacher"},"location":{"latitude":51.508507,"longitude":0.272942},"trainWithUs":"\"Teach Thurrock \" is an innovative one year primary school-based Initial Teacher Education (ITE) programme through School Direct, in partnership with the University of Greenwich. The programme is delivered by highly experienced lecturers, head teachers and outstanding teachers. The programme is essentially, a school based course within the partnership's fifteen schools which is supported by input from Greenwich University. All trainees are allocated to a home school and are supported by an experienced mentor. Trainees will have the opportunity to gain experience of working within a variety of phases of education within the diverse range of schools within the partnership. At the end of the course trainees will either be awarded a Post Graduate Certificate in Education (PGCE) plus 60 Masters credits or Qualified Teacher Status (QTS). It is expected, that on completion of the programme, all successful candidates will be supported in gaining a teaching post within one of the partnership schools or a school in Thurrock.\nTo register your interest, and for more information, contact Andrea Parfett at 01708 852128. Dilkes Academy is the Lead School in the partnership but you will be able to search for Teach Thurrock Primary Partnership.","trainWithDisability":"We welcome applications from disabled people and are committed to helping disabled students succeed. The University of Greenwich has a Disability & Dyslexia Centre which can provide assistance at any stage in your application process and at any point in your studies. Advice and guidance is based on your individual requirements, and includes support for students with mental health needs and long-term medical conditions.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"b3681bbc-2e2a-49c3-aa4e-e453a8d0e4a5","code":"G70","name":"University of Greenwich","description":"The University of Greenwich is an outstanding ITT provider."}],"createdAt":"2021-07-06T17:50:11.606Z","updatedAt":"2021-10-06T15:46:43.454Z"}
