{"id":"e8ee242e-91d2-4d79-836f-dfeb92623627","name":"Bitterne Park Teacher Training Alliance","code":"1F6","type":"lead_school","isAccreditedBody":false,"urn":"116458","ukprn":"10014998","address":{"addressLine1":"Bitterne Park School","addressLine2":"Dimond Road","town":"Bitterne Park","county":"Southampton","postcode":"SO18 1BU"},"contact":{"website":"https://www.bitterneparkschool.org.uk/train-to-teach/trainee-teacher-vacancies","email":"alliance.office@bitterneparkschool.org.uk","telephone":"2380294133","fullName":"Bitterne Park Teaching School Alliance"},"location":{"latitude":50.9301869,"longitude":-1.369959},"trainWithUs":"The Bitterne Park Teacher Training Alliance currently consists of 13 secondary schools located in the South and South West of England working with the Universities of Southampton, Chichester and Winchester to provide a one year full-time School Direct teacher training programme leading to a Postgraduate Certificate in Education (PGCE) with Qualified Teacher Status (QTS) and the opportunity to gain up to 60 credits at Master’s level. We feel our School Direct training programme combines the best elements of a traditional university-led PGCE training model with the benefits of a school-centred approach. We are proud to celebrate a 100% pass rate for trainees completing our programme, with many trainees choosing to remain with us and forge successful careers in the BPTTA family of schools.","trainWithDisability":"If you have a disability or learning difference, we encourage you to get in touch before you apply so we can discuss tailored support for your individual needs. Disability access varies across the alliance sites, so you may wish to contact individual schools for further information. Successful candidates will be required to complete a pre-placement Health Declaration before starting our teacher training programme and, based upon the responses provided, may be invited to attend an assessment. This will assist us to make workplace adjustments where possible.\nThe Bitterne Park Teacher Training Alliance currently comprises the following schools:\n* Bitterne Park School, Bitterne Park, Southampton (lead school) - www.bitterneparkschool.org.uk * The Burgate School and Sixth Form, Fordingbridge, Hampshire -www.burgate.hants.sch.uk * Cams Hill School, Fareham, Hampshire - www.camshill.com\n* Cantell School, Bassett, Southampton - www.cantell.co.uk * Chamberlayne College for the Arts, Weston, Southampton - www.chamberlayne.org\n* Matravers School, Westbury, Wiltshire - www.matravers.wilts.sch.uk * The Petersfield School, Petersfield, Hampshire - www.petersfieldschool.com * Pewsey Vale School, Pewsey, Wiltshire - www.pewsey-vale.org\n* Priestlands School, Lymington, Hampshire - www.priestlands.hants.sch.uk\n* Redbridge Community School, Southampton - www.redbridgecommunityschool.com\n* Regents Park Community College, Shirley, Southampton - www.regentsparkcollege.org.uk * St George Catholic VA College, Swaythling, Southampton - www.stgcc.co.uk\n* Upper Shirley High School, Shirley, Southampton - www.uppershirleyhigh.org","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"3f5b1139-3651-4ee5-845c-54cd9e999b08","code":"C58","name":"University of Chichester","description":"The University of Chichester is recognised as one of the leading institutions in the country for teacher training, and has a long and distinguished track record of training teachers dating back to 1839. During your training year you will have the full support of the University and access to all facilities. \\r\\nAll university-led training on our English and English ‘with’ courses will take place in school and you will not be required to travel to Chichester/Bognor Regis."},{"id":"2b84ae64-ebca-4e4d-88b1-13effff3a411","code":"S27","name":"University of Southampton","description":"The University of Southampton is a Russell Group University with a long-established record of excellent initial teacher training. During your training year you will have the full support of the University and access to all facilities."},{"id":"3700fb02-7007-40c8-9127-b070e146d6cb","code":"W76","name":"University of Winchester","description":"The University of Winchester has a long history in teacher education and is recognised by Ofsted as an ‘Outstanding’ provider. The University offers a stimulating and supportive learning environment that challenges and inspires trainees. The city of Winchester is a beautiful, historic cathedral city, which has a rich heritage and vibrant contemporary culture. During your training year you will have the full support of the University and access to all facilities."}],"createdAt":"2021-07-06T17:55:00.139Z","updatedAt":"2021-08-17T19:20:38.361Z"}
