{"id":"e93b7f77-cc5c-4ff1-9679-84470019b39e","name":"Harris Initial Teacher Education","code":"1TZ","type":"lead_school","isAccreditedBody":false,"urn":"135311","ukprn":"10055126","address":{"addressLine1":"Harris Initial Teacher Education","addressLine2":"55 Southwark Park Road","town":"London","county":"London","postcode":"SE16 3TZ"},"contact":{"website":"http://www.harristraintoteach.com","email":"info@harrisschooldirect.com","telephone":"2082537758","fullName":"Admin"},"location":{"latitude":51.4933567,"longitude":-0.0718341},"trainWithUs":"Our vision is to work with commitment and integrity to engender change and have a positive impact on schools, communities and the teaching profession as a whole. We offer year-long primary and secondary teacher training programmes to graduates and career changers joining the teaching profession through our Harris School Direct programme. We offer a strong support network and exciting environment in which to train to ensure that our trainee teachers leave the course feeling supported, confident and well-prepared. Our provision has been graded as Outstanding by OFSTED.\nAll our teacher training courses lead to QTS (Qualified Teacher Status), a PGCE (Post Graduate Certificate in Education) and 60 Master’s Level credits. We give you access to first class training, invaluable school and classroom practice and opportunities to learn on-the-job at a placement in one of our 52 academies across the Harris Federation and partner schools. We work in partnership with Kingston University to deliver the PGCE element of our programme.\nYou will benefit from bespoke weekly Core Training with your fellow trainees; tailored subject-specific training days; personalised mentor and team support and a second placement in a contrasting school environment. You could earn a salary or receive a bursary, subject to eligibility, while you train.","trainWithDisability":"Our training programme is open to everyone who meets the eligibility criteria. If you have a disability, we will make every reasonable adjustment to accommodate and support you throughout the recruitment process, as well as during the training programme, if you are offered a place.\nAll candidates who have accepted a place must complete a pre-commencement medical questionnaire. If this reveals you have a support need, Harris ITE provides appropriate school placements, support and monitoring for you during the course. If you have any questions about health, disability, or the support provided, please do not hesitate to contact us. We offer Employee Assistance Programme (EAP) services to all Harris employees.\nTo support those with a physical disability, whenever we build new schools within our Federation, we ensure they have full wheelchair access. However, when an existing school joins the network, we have to work with the existing buildings, and these can sometimes have limited accessibility. Our placement academies and core training facilities make full use of a range of technologies and specialist equipment.\nThe physical health, mental health and wellbeing of our trainees is important to us. Our team are trained as Mental Health first aiders. We incorporate wellbeing sessions throughout our Core Training and offer regular, additional academic writing support as required.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"45cef0fd-ad2f-4353-b7df-d45abd016a5d","code":"1WU","name":"Harris ITE","description":"Harris Initial Teacher Education (Harris ITE) is the accredited training provider and has responsibility for recommending trainees, who successfully complete the programme, for Qualified Teacher Status (QTS)."}],"createdAt":"2021-07-06T17:47:25.117Z","updatedAt":"2021-10-01T17:58:45.280Z"}
