{"id":"e93d662c-62f0-4292-aba3-60e6503e14a8","name":"East Kent Learning Alliance","code":"2DG","type":"lead_school","isAccreditedBody":false,"urn":"136584","ukprn":"10033425","address":{"addressLine1":"EKLA c/o Herne Infant School","addressLine2":"Palmer Close","town":"Herne Bay","county":"Kent","postcode":"CT6 7AH"},"contact":{"website":"https://www.ekla.org.uk/","email":"courses@ekla.org.uk","telephone":"07784 653929","fullName":"Tanya Barwick"},"location":{"latitude":51.3504239,"longitude":1.1382983},"trainWithUs":"The East Kent Learning Alliance (EKLA) is a partnership of secondary and primary schools that engage with schools and accredited providers to recruit high quality trainees to provide a rich training programme. EKLA is committed to helping improve the lives of the young people that it serves in East Kent and believes that the recruitment and development of the workforce of the future will help us to achieve this aim.\nThe advantages of choosing EKLA are:\n* We have a strong relationship with our accrediting provider, CCCU\n* Collaborative working\n* Joint Professional Studies delivered by serving practioners\n* Potential Employment with a school in the EKLA area\n* Our EKLA School Direct coordinators complete QA visits of all our trainees. These visits will quality assure the school provision to ensure consistency and monitor provision for our trainees. This will include additional support for trainee development.\nSupport Activities will include:\n* Initial meetings to QA school provision in line with training requirements\n* Joint observations and debrief with mentors\n* Meeting with key stakeholders * Portfolio reviews\nFor further information visit: www.ekla.org.uk","trainWithDisability":"Access varies according to our different schools so for more details please contact the individual school that you wish to apply to directly. \nYou can find a list of the primary and secondary schools that are recruiting for School Direct with us at: \n\nhttps://www.ekla.org.uk/itt/school-direct-places","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:49:03.907Z","updatedAt":"2021-09-23T18:43:03.298Z"}
