{"id":"ea67d4fb-0319-4800-8e7b-b14d17a4be4c","name":"Crispin School with the Mid Somerset Consortium","code":"1OF","type":"lead_school","isAccreditedBody":false,"urn":"136913","ukprn":"10034178","address":{"addressLine1":"Crispin School Academy","addressLine2":"Church Road","town":"Street","county":"Somerset","postcode":"BA16 0AD"},"contact":{"website":"http://www.mscitt.org.uk","email":"SLewis@mscitt.org.uk","telephone":"1458449418","fullName":"Sarah Lewis"},"location":{"latitude":51.1306598,"longitude":-2.7324755},"trainWithUs":"Crispin School in Street, Somerset, is the base for the MSC which is a local provider of ITT. Together they run a small but successful School Direct Salaried teacher training programme within its longstanding partnership of schools across Somerset. Trainees on salaried programme will have some prior experience of teaching and will be employed by a partnership school to fulfil a part time teaching post. The salary grant from the DfE pays for the trainees' course fees and also contributes to the trainees' salaries.\nThis is a tough training route and is only for those who are able to demonstrate their understanding of teaching in the state sector and the demands of the classroom.\nSalaried trainees will be timetabled up to 13 hours of teaching each week. This will start from the first week of the course and continue through out the training year. A mentor in school is at hand to offer advice and support to each trainee.\nTrainees are able to gain QTS and PGCE via this route. Assessment for QTS is through weekly lesson observation and portfolio tasks which are specifically designed to allow trainees to showcase their practice. Our PGCE is delivered through the MSC's Professional Training (accredited by Bath Spa University). Assessment is in the form of three written assignments at Masters' level. Salaried trainees wishing to take the PGCE will need to pay the accreditation fee as the DfE grant only covers the cost of QTS training.","trainWithDisability":"The MSC welcomes all candidates and trainees with disabilities, health conditions, metal health conditions or learning difficulties and aims to support all candidates and trainees throughout the recruitment process and training course. We support trainees with their specific learning needs to achieve their dream of becoming a teacher and will ensure appropriate support throughout the recruitment process and training year. As an experienced provider of Initial Teacher Training, we are proud to have supported students with a variety of additional needs to become fantastic and successful teachers. We will aim to tailor our support to make sure that the course is both accessible and achievable. We encourage all candidates/trainees with any disability or health conditions to discuss this with the MSC. If you wish to discuss any of the above, please contact the office. We work closely with trainees and schools to ensure training is accessible and personalised to an individual's needs.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"0fd2de51-736a-4516-81ce-94659d58951d","code":"M84","name":"Mid Somerset Consortium for Teacher Training","description":"The MSC has excellent outcomes; they were ranked 27/153 secondary trainers across the UK in the Good Teacher Training Guide 2017. It has successfully been training teachers in Somerset’s Secondary Schools for 11 years. \\r\\n\\r\\nIt trains between 35 and 50 trainees each year. School Direct Salaried trainees make up a small but significant proportion of these. \\r\\n"}],"createdAt":"2021-07-06T17:51:21.351Z","updatedAt":"2021-09-15T14:13:36.760Z"}
