{"id":"ea707d39-b1cb-4826-a63b-e02e52c9c787","name":"Thames Teaching Alliance","code":"2B8","type":"lead_school","isAccreditedBody":false,"address":{"addressLine1":"Gravesend Grammar","addressLine2":"Church Walk","town":"Gravesend","county":"Kent","postcode":"DA12 2PR"},"contact":{"email":"bunnyl@gravesendgrammar.eu","telephone":"01474 331893","fullName":"Laura Bunny"},"location":{"latitude":51.4372253,"longitude":0.383221},"trainWithUs":"The Thames Teaching Alliance is a large group of varied schools in and around the banks of the Thames in North Kent, 16 miles from London and close to Ebbsfleet International station. We believe training with us will be an invigorating and innovative experience because: * Students in our schools come from a variety of socio-economic backgrounds and are ethnically diverse, which will enable you to engage with a whole variety of teaching methods and styles of learning.\n* We have a large selection of trainees in our schools each year so you will not be alone but will benefit from that peer to peer support that is so important when learning new skills.\n* Schools in the alliance include nursery schools, junior schools, primary schools and academies. There are single sex and mixed Secondary schools, Faith schools, Special schools, High schools and Grammar schools. Their intake ranges from children coming from the leafy suburbs of the affluent London commuter belt, to students who live in areas of social and economic deprivation. * Over the six years the Thames Teaching Alliance has engaged with School Direct, we have a 70% retention rate of the staff we train remaining in local schools. This means it is likely that we will be able to support you in finding that all important supportive first teaching job in a North Kent School.\n* Thames Teaching Alliance training is evaluated by the students in an overwhelmingly positive way with a consistent 95% satisfaction rate.","trainWithDisability":"We are committed to providing equal opportunities in employment. You will receive equal treatment regardless of age, disability, gender reassignment, marital or civil partner status. This includes pregnancy or maternity, race, colour, nationality, ethnic or national origin. Religion or beliefs, sex or sexual orientation. If you are disabled, we encourage you to notify us as early as possible in application process so that we can consider what reasonable adjustments or support may be appropriate. Please be aware that this will differ between our range of schools.","accreditedBodies":[{"id":"d2ba71f2-c125-4d86-bb22-736e67043120","code":"B72","name":"University of Brighton","description":"The University for Brighton is an outstanding provider of teacher education in the South East. The School of Education is at the Falmer campus, and has access via motorway and trainline as well as buses from the centre of Brighton. For further information please see the following website. (https://www.brighton.ac.uk/about-us/contact-us/academic-departments/school-of-education.aspx)"},{"id":"1165d5fd-11f4-4dab-99c9-47b309481463","code":"C10","name":"Canterbury Christ Church University","description":"Canterbury Christchurch university is one of the largest centres of teacher education in the country. It is a good provider of education. The School of Education provides courses in the centre of Canterbury and at Hall Place, the satellite site for the university. For further information please see the following website. (https://www.canterbury.ac.uk/education/faculty-of-education.aspx)"}],"createdAt":"2021-07-06T17:51:09.026Z","updatedAt":"2021-07-06T17:51:09.026Z"}