{"id":"eadd0ee6-acb8-4b2e-a6f5-2902c495bfac","name":"Consortium Multi Academy Trust","code":"2J7","type":"lead_school","isAccreditedBody":false,"urn":"145795","address":{"addressLine1":"The Consortium Multi Academy trust","addressLine2":"27 Norwich Road","town":"Halesworth","county":"Suffolk","postcode":"IP19 8BX"},"contact":{"website":"https://consortiumacademy.co.uk/suffolk/primary/consortium-mat/site/pages/cpdtraining","email":"d.thomas@consortiumacademy.org","telephone":"1986835670","fullName":"Andrew Aalders-Dunthorne"},"location":{"latitude":52.3461431,"longitude":1.5031469},"trainWithUs":"The Consortium MAT fundamental aim is to enhance the position of rural community primary schools in the heart of our communities. We recognised that for our small schools to remain vibrant and viable – closer integration and collaborative working is necessary to ensure that our curriculum is exciting, provision is full and the outcomes for pupils are exceptional.\nWe exist to support our schools, communities and children not as a business but as a mutual co-operative of professionals. Where our schools share financial, physical and intellectual resources, pooling them at the appropriate level with the primary aim to secure better outcomes for our pupils.\nWe do not think in straight lines, we have broken free of the local authority concept of school provision; we are risk takers while always remembering that every action that we take is for the sole purpose to adding value to the core offer to our pupils and ensuring that they receive the exceptional education that they deserve.\nConsortium offers collaboration, not prescription. We offer choice, not decisions made for you. Consortium was founded on the principle of delegated responsibility.\nEvery school is an exceptional school, every school receives effective support, every school is in an effective partnership.\nAt Consortium, we demand the best opportunities for our children and the broadest possible curriculum for them to gain experiences, skills and attitudes that will support their future developments.\nPlease note that due to funding changes, we only offer salaried tuition to existing Consortium employees.","trainWithDisability":"Suffolk and Norfolk SCITT supports all trainees based on their individual needs. Recently this has included those with dyslexia, physical, hearing and visual impairments and mental health conditions. Plans are developed with trainees to ensure that they can fully access in centre training, operate effectively on school placement and complete written assignments. Suffolk & Norfolk Primary SCITT training venues in Ipswich and Norwich have full disabled access as do partnership schools. However, applicants who would benefit from disabled access should let us know on their application so that they can be considered for placements at the most appropriate schools.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"89831af6-535f-471b-aa97-098bd1a93291","code":"S13","name":"Suffolk and Norfolk Primary SCITT","description":"The Suffolk and Norfolk Primary SCITT programme is a personalised, relational and ethical training provider. Primary\\r\\nSCITT has very high attainment and employment outcomes for trainees. On average 95% of trainees are employed in\\r\\nlocal schools by the end of their training year.\\r\\nTrainees are supported by school mentors and SCITT Tutors who have a range of experience in schools as classroom\\r\\npractitioners and often headteachers or members of senior leadership teams, so have a wealth of experience to\\r\\nshare with trainees.\\r\\nThe Primary SCITT course is a highly personalised course which offers a wide range of opportunities to trainees."}],"createdAt":"2021-07-06T17:57:15.760Z","updatedAt":"2021-09-22T23:59:02.283Z"}
