{"id":"eb1ae478-8ebc-4ef4-a186-22b08535a802","name":"Hampton Hargate Primary School","code":"1XV","type":"lead_school","isAccreditedBody":false,"urn":"132763","ukprn":"10074201","address":{"addressLine1":"Hampton Hargate Primary School","addressLine2":"Hargate Way","town":"Peterborough","county":"Cambridgeshire","postcode":"PE7 8BZ"},"contact":{"website":"http://www.hampton-hargate.peterborough.sch.uk","email":"chris.clayton@hampton-hargate.peterborough.sch.uk","telephone":"01733 296780","fullName":"Enquiries"},"location":{"latitude":52.5385052,"longitude":-0.2740554},"trainWithUs":"At Hampton Hargate Primary School we are committed to the academic, personal, social and emotional development for all of our pupils. We promote an engaging environment where successful and inspiring teaching and enthusiastic learning, tolerance and mutual respect towards others is valued above all else. In pursuit of excellence we will always endeavour to demonstrate best practice, to promote the spiritual, moral, cultural, mental and physical developments of pupils in our school and in society, and prepare pupils in our school for the opportunities, responsibilities and experience of later life. All pupils will experience a broad and balanced curriculum, which supports, challenges and extends their self-discipline, motivation and self-esteem in order to achieve excellence in learning. In working closely with pupils, parents and the wider community we will encourage the children to develop into confident, successful, responsible, independent beings who have an appropriate sense of Citizenship. The full-time course is for one year with school experience starting in September of the training year. School placements are carefully structured to ensure gradual development of your confidence as an effective teacher through building up experiences by working with other trainees, link tutors and teachers.","trainWithDisability":"We really care about all of our trainees and aim to support them all of the way through their studies, from application to graduation. Here at BGU we recognise that trainees may require additional assistance to engage fully with their studies due to a range of access needs. Student Advice plays a key role in co-ordinating services available to BGU’s disabled and sensory impaired students, and/or with specific learning differences or other access needs before and during their studies. In order to assess the level of support trainees may require, we use the legal definition of disability, which is wide ranging but includes:\n* Specific learning differences including dyslexia\n* Physical mobility difficulties\n* Hearing impairments\n* Visual impairments\n* Persons requiring personal care\n* Autistic Spectrum Disorders including Asperger’s Syndrome\n*Mental health difficulties\n* Medical conditions such as epilepsy, diabetes or asthma\nPlease note that this is not an exhaustive list – trainees may have access needs that are not listed above. If you are unsure whether you have access needs which are covered by disability legislation, please contact Student Advice – we will be happy to offer advice and guidance.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:48:04.551Z","updatedAt":"2021-07-08T23:17:09.039Z"}
