{"id":"eb4a38dd-1429-4c88-b2ee-a552369e4306","name":"The Tommy Flowers SCITT Milton Keynes","code":"1YK","type":"scitt","isAccreditedBody":true,"ukprn":"10058516","address":{"addressLine1":"Denbigh School, Burchard Cres","addressLine2":"Shenley Church End","town":"Milton Keynes","county":"Buckinghamshire","postcode":"MK5 6EX"},"contact":{"website":"http://www.tommyflowersscitt.co.uk","email":"TFSCITTsecondary@denbigh.net","telephone":"01908 669735 ext. 353","fullName":"Gaynor Garton"},"location":{"latitude":52.0245661,"longitude":-0.7874435},"trainWithUs":"Graded an ‘outstanding’ provider of primary and secondary teacher training in Milton Keynes by Ofsted, the Tommy Flowers SCITT works in partnership with schools across Milton Keynes and the surrounding area, to provide access to outstanding training, mentoring and pastoral care. \n\nOur provision is offered with in person, face to face training to give a collegiate, personal approach and support. This is vital for a teaching role that is based on developing relationships and connections with adults and young people. We believe that the opportunity to discuss and debate with others in the room is the best way to train to teach.\n\nWe create varied experiences for our trainees that will set them up to be excellent teachers for the children of Milton Keynes. We aim to nurture trainees into exceptional teachers who develop positive attitudes to learning and behaviour in their pupils, have strong subject and professional knowledge and engage their classes with enthusiasm and energy. With a 100% employment rate following completion of the course, our Early Career Teachers (ECTs, formerly NQTs), ‘often exceed levels of performance expected at such an early stage of their career.’ (Ofsted 2017).\n\nIf you have a passion for teaching, are organised and hard-working, please explore our courses further and contact us to find out more about studying with the [Tommy Flowers SCITT](www.tommyflowersscitt.co.uk).","trainWithDisability":"Disability access varies across the partnership schools and this will depend on which school becomes your base school for your main placement. Trainees with disabilities or other needs will have a needs analysis completed so that the appropriate support or adaptations can be put in place. We work in partnership with Northumbria University to ensure that needs are met across the teacher training and PGCE elements of the course.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-09-16T21:55:33.925Z","updatedAt":"2021-10-13T18:43:45.834Z"}
