{"id":"eb4feff7-6a8c-4d6c-90a5-ced16950f12a","name":"Greenbank Primary Liverpool","code":"2EP","type":"lead_school","isAccreditedBody":false,"urn":"133332","ukprn":"10073582","address":{"addressLine1":"Greenbank Primary School, Mossley Avenue","town":"Liverpool","county":"Merseyside","postcode":"L18 1JB"},"contact":{"website":"http://greenbank-primary.co.uk","email":"k.rowlands@greenbank.liverpool.sch.uk","telephone":"0151 522 5748","fullName":"Louise Kaemena"},"location":{"latitude":53.3892726,"longitude":-2.9255011},"trainWithUs":"Greenbank Primary School is a thriving, multicultural school with a diverse and unique population. We are a larger than average primary school with over 450 pupils from Nursery to year six. We aim to provide an environment where everyone in the school community can achieve their highest potential and to foster a climate where all members of the community, regardless of class, race, gender or disability feel secure and can grow in confidence and self-esteem. We are a proactive school, leading change within its own network of schools across the city and in areas further afield. One example of this is the fact we are a Maths Mastery Hub School, meaning that we provide support for eight additional Mathematics Mastery Schools. We have a strong partnership with Liverpool Hope University and work alongside them to enable you to become an outstanding teacher. We aim to ensure that your training with us is enriching, thought-provoking and inspiring. 100% of our former trainees, who chose full-time employment gained permanent contracts upon completion of the course. One of our former trainees, commented that, ‘The staff are very supportive and make you feel part of the school straight away. The school are keen to develop you professionally and provide plenty of opportunities for this to happen.’","trainWithDisability":"Greenbank Primary School constantly strives to be an inclusive School for pupils, staff and those that choose to train with us. We will take reasonable steps to restructure the cultures, policies and practices in school, so that they respond to the diversity of trainees wishing to undertake School Direct course at Greenbank.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:48:26.741Z","updatedAt":"2021-11-09T04:27:57.725Z"}
