{"id":"eb5eb912-c69f-40c3-a3ac-4086d4bebf18","name":"Ringwood School Teaching Alliance","code":"1G3","type":"lead_school","isAccreditedBody":false,"urn":"136657","ukprn":"10033374","address":{"addressLine1":"Parsonage Barn Lane","town":"Ringwood","county":"Hampshire","postcode":"BH24 1SE"},"contact":{"website":"http://www.ringwood.hants.sch.uk/","email":"ali.fanos@ringwoodschool.org","telephone":"1425475000","fullName":"Ali Fanos"},"location":{"latitude":50.8483033,"longitude":-1.7832331},"trainWithUs":"Ringwood School has been successfully working with trainee teachers for many years. We have been working specifically with School Direct trainees since September 2012 and are pleased to boast a very high success rate for recruiting trainees within our alliance of schools following their training year. Our retention rate is also very high showing that we attract the right people for the right routes in the right schools.\nThough our partnership with the University of Winchester, we are committed to providing high quality teacher training opportunities across the region, working with lead professionals in high performing schools to support and develop teachers of the future. We are ALL passionate about supporting people to make the next step to join the teaching profession and we look forward to working with you.\nWe can offer a diverse range of school placements including special schools, selective schools and single sex schools. We are able to provide access to professional development beyond teacher training to include peer-to-peer learning, identifying and nurturing leadership potential for the future and supporting your career development through our network of excellent school partners.","trainWithDisability":"Your wellbeing is a top priority and we will do all we can to give you the chance to flourish and maximise your potential. In partnership with the University of Winchester there is a dedicated student support team to help with any questions or challenges you might experience during your studies. \n\nWe work with you to support your wellbeing and mental health, provide confidential advice and offer workshops to boost your academic skills. If you have a disability or learning difference, we encourage you to get in touch before you apply so we can discuss tailored support for your individual needs.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:54:55.727Z","updatedAt":"2021-10-13T22:52:30.003Z"}
