{"id":"eb9baee1-ab34-4e8d-8e1f-3b8dbd48b5a8","name":"St George’s Academy","code":"24D","type":"lead_school","isAccreditedBody":false,"urn":"136044","ukprn":"10029212","address":{"addressLine1":"St George’s Academy Partnership","addressLine2":"Westgate","town":"Sleaford","county":"Lincolnshire","postcode":"NG34 7PP"},"contact":{"website":"http://www.teacher-training.org","email":"wendy.procter@teacher-training.org","telephone":"1529301193","fullName":"Amanda Money"},"location":{"latitude":53.0002652,"longitude":-0.4148147},"trainWithUs":"St George’s Academy Partnership includes seventeen schools across Lincolnshire, offering school based teacher training for Secondary.\nThe Partnership is the accrediting provider for this course and provides the Qualified Teacher Status (QTS) training. The University of Lincoln provides the Post Graduate Certificate in Education (PGCE) with 60 Master’s Level credits.\n•\tYou choose which school you would like to train in and apply directly to that school on Apply. Schools within the partnership are listed on Apply and on our website.\n•\tYou will be a part of a small cohort, enabling us to tailor the programme to meet your personal circumstances such as transport or childcare.\n•\tYou will be supported in school by mentors, subject specialists, ITT Leads and Programme Leaders.\n•\tYour training is delivered by practising teachers who are up to date with curriculum changes and who are fully aware of the challenges and enormous rewards of a career in teaching.","trainWithDisability":"If you have a disability or additional needs, it is helpful if you give us details on your application so that we can make any adjustments you may need. The disability access in all of our partner schools is in accordance with legal requirements.Some of our schools are more accessible than others- we can advise you on this matter with a quick phone call to Wendy Procter: 01529 301193.\nIn previous cohorts we have worked with trainees who have had additional needs or disabilities (such as dyslexia, epilepsy, visual and hearing impairments) to ensure a safe and successful training year.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"c85cf314-f1cd-41e3-bb90-f76825d601a2","code":"G15","name":"St. George’s Academy Partnership","description":"St George’s Academy is the accredited provider for all of our courses on both routes."}],"createdAt":"2021-07-06T17:54:06.181Z","updatedAt":"2021-09-14T20:10:07.147Z"}
