{"id":"ec34b77c-cba3-4598-93be-23f0471adff1","name":"Liverpool John Moores University","code":"L51","type":"hei","isAccreditedBody":true,"ukprn":"10003957","address":{"addressLine1":"Liverpool John Moores University","addressLine2":"Education Building, Maryland Street","town":"Liverpool","county":"Merseyside","postcode":"L1 9DE"},"contact":{"website":"https://www.ljmu.ac.uk/about-us/faculties/faculty-of-arts-professional-and-social-studies/school-of-education/courses/teacher-training","email":"education@ljmu.ac.uk","telephone":"0151 231 3000","fullName":"Liverpool John Moores University"},"location":{"latitude":53.4026787,"longitude":-2.9711231},"trainWithUs":"Liverpool John Moores University (LJMU) has a long established reputation for providing high quality Teacher Training, working in close Partnership with over 300 committed, welcoming and diverse schools across the North West. Our 2019 OFSTED inspection outcomes were the best judgements on Merseyside with Primary provision graded Outstanding and Secondary programmes judged to be Good.\nWe are committed to diversifying the teacher workforce and strongly encourage teaching applicants from underrepresented groups to apply to us, Our Graduate teacher employment rates are consistently above average for the sector.\nMost Teacher training courses offer a PGCE Award worth 60 credits at Masters Level. LJMU, is one of a small number of teacher training providers that offers a Post Graduate Diploma in Education and Qualified Teacher Status. This means that our beginning teachers graduate with 120 Masters level credits. Many go on to complete a Masters in Education Practice during their early career.\nOur emphasis is on developing inclusive and reflective practitioners. We ensure that LJMU teachers develop a deep understanding of subjects, the curriculum, learners and learning. This enables them to provide the best and most appropriate learning opportunities for all children and young people, with a positive impact on their development and achievements. School-based experience takes place largely in a Home School, supported by expert teacher mentors. Shorter placements are also provided in contrasting school settings. This ensures that our students can confidently plan, teach and manage learning in varied settings and contexts.","trainWithDisability":"LJMU is committed to Equality of Opportunity and proud of the help we offer. The Disability Advice Team will help you access the support you need. The best time to contact the Disability Advice Team is before you start your course. By contacting the team before you begin and discussing your disability, you'll be able to receive support from when you arrive. Email: disability@ljmu.ac.uk Tel: 0151 231 3164/3165.\nIf you need an Individual Student Learning Plan (ISLP) which sets out the type of support you may need and who is responsible for ensuring your support is in place, this will be put in place by an LJMU Disability Adviser once you have met to discuss your needs. Once finalised, your plan will be sent to you via email. As soon as you have agreed the ISLP it will be sent to your Disability Coordinator and then, with your agreement, passed on to the relevant academic and support staff.\nAll trainees are encouraged to disclose any specific learning need that they experience, in order to make any adjustments, both at LJMU and within our Partner Schools. As part of the enrolment process to Teacher Training Programmes all students are required to complete a Health Questionnaire and some may be asked to attend a screening appointment with our Occupational Health Unit. This is designed to ensure that arrangements are in place, from the outset, to support any students who may need additional support or reasonable adjustments to be made.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"createdAt":"2021-07-06T17:52:10.344Z","updatedAt":"2021-08-31T21:40:59.010Z"}
