{"id":"ec9b83ed-1f6f-46b5-b172-44e52d93b21a","name":"University of Nottingham","code":"N84","type":"hei","isAccreditedBody":true,"ukprn":"10007154","address":{"addressLine1":"The School of Education","addressLine2":"Jubilee Campus","town":"Nottingham","county":"Nottinghamshire","postcode":"NG8 1BB"},"contact":{"website":"http://www.nottingham.ac.uk/education","email":"tt-educationadmin@exmail.nottingham.ac.uk","telephone":"0115 951 5151","fullName":"School of Education, ITE Office"},"location":{"latitude":52.9519194,"longitude":-1.1853459},"trainWithUs":"The University of Nottingham has been involved in teacher education for over 120 years and our postgraduate Initial Teacher Education provision is one of the largest in the country; courses inspected during our latest Ofsted visit were rated ‘outstanding’. We offer primary and secondary routes, emphasising practical school-based training, supported by an exploration of established and current educational theory and thinking. We have a clearly articulated set of strands and phases outlining the development of specialised teacher knowledge over the year, supporting our students to understand, and take ownership of, their professional development. Our courses are designed to challenge students’ ideas on learning and teaching and enable them to experience and develop for themselves a wide variety of styles and techniques to use in the classroom.\nUniversity tutors working with our beginning teachers were successful and innovative teachers in schools and are now experienced teacher educators committed to developing the next generation of teachers.\nWith a strong partnership with schools in the region, all of our courses are underpinned by a shared ethos and work toward shared aims. Our students are highly rated locally and a large proportion of them go on to work in partner schools each year.\nThe University of Nottingham ITE courses are popular and large cohorts offer excellent peer support throughout the course. We have a strong emphasis on emotional wellbeing, supporting our beginning teachers to develop their own identities and embed work ethics that enable them to thrive and enjoy teaching as a profession.","trainWithDisability":"Admission to the course is subject to a satisfactory medical report, as you are required to meet the standards for 'Fitness to Teach'. It is important that you disclose any medical condition or disability so that we can look at the best way of supporting you if you are offered a place on the course.\nThe University of Nottingham is committed to creating an inclusive and equitable teaching and learning environment and we work closely with our partnership schools to ensure that any student who has a specific need is supported to thrive as a beginning teacher. We believe the teacher workforce should reflect the diversity of school communities.\nWe have a wide range of facilities to meet the needs of students with special needs and disabilities. The School of Education is supported by our wellbeing team who work with students when necessary to ensure they access all available support from the University but also to support with any issues that specifically relate to being a student teacher.\nWe have many examples of supporting students with a range of needs and, in the past, have worked with students to plan placements in advance that accommodate their needs and mediated needs with partnership schools to ensure additional support is in place.\nYou are welcome to discuss any special needs or disabilities with us at any time during, or after, the application process.","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"createdAt":"2021-07-06T17:56:30.356Z","updatedAt":"2021-10-04T02:25:30.113Z"}
