{"id":"ecc695c5-f842-4507-a160-2e979cc9abfe","name":"SD at Turton","code":"2BS","type":"lead_school","isAccreditedBody":false,"urn":"105253","ukprn":"10003957","address":{"addressLine1":"Bromley Cross Road","addressLine2":"Bromley Cross","town":"Bolton","county":"Lancashire","postcode":"BL7 9LT"},"contact":{"website":"http://schooldirect.turton.uk.com/","email":"sd@turton.uk.com","telephone":"01204 333233","fullName":"Kelly Leonard"},"location":{"latitude":53.6153859,"longitude":-2.4112582},"trainWithUs":"We are an innovative, school led primary and secondary teacher-training programme designed and formed through a strategic partnership between Turton School and our extensive network of partnership schools across the North West. This one year PGCE with QTS will give you 60 credits towards a Master’s Degree. Our programme offers you the opportunity to carry out the majority of your training in school.\nWe are delighted to be working with our accrediting university partner, Liverpool John Moores University who support our aims of working creatively and flexibly with you, to provide the highest quality training. This year we have more than 60 trainees on our programme, bucking the trend by being the biggest provider in Bolton. We are working in partnership with more than 25 schools, Professional Mentors and more than 100 ITT Mentors Our into employment figures exceed national figures\nOur vision is to ensure that you are prepared for the challenges of the classroom and well-equipped to benefit students in the schools in which you will train. We will work collaboratively and proactively with you to achieve high quality teaching and learning. You will train in your Home School four days per week and attend our training centre at Turton School (Bolton) on one day for lectures delivered by LJMU staff, followed by workshops and subject knowledge development sessions. You will explore subject pedagogy with subject specialists working as leaders of learning in schools across our primary and secondary partnership.","trainWithDisability":"School Direct at Turton and LJMU are committed to Equality of Opportunity and proud of the help we offer. The Disability Advice Team at LJMU will help you access the support you need. The best time to contact the Disability Advice Team is before you start your course. By contacting the team before you begin and disclosing your disability, you'll be able to receive support from when you arrive. Email: disability@ljmu.ac.uk Tel: 0151 231 3164/3165.\nThe LJMU disability team are able to advise you on the services and support available to you. The Disability Advice Team work with you throughout the induction process to make sure that you receive personalised support. They will help you access the support that you need.\nAs a disabled student you may be eligible for Disabled Students' Allowance (DSA). The DSA is a grant that will help you meet the extra course costs you may face as a direct result of your disability, an ongoing health condition, a mental health condition or a specific learning difficulty. To find out if you are eligible for DSA or to find out how much funding you could receive as part of your DSA, please visit the government Disabled Students' Allowance webpages. Trainee teachers on our programme have accessed a number of services provided by Liverpool John Moores University including support for hearing impairment and a range of physical impairments.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"ec34b77c-cba3-4598-93be-23f0471adff1","code":"L51","name":"Liverpool John Moores University","description":"Our accredited body, Liverpool John Moores University has an established reputation for high quality Teacher Training. The LJMU Partnership’s 2019 OFSTED inspection outcomes were the best on Merseyside with Primary provision graded Outstanding and Secondary programmes judged to be Good. Our Partnership with LJMU ensures that our teachers develop a deep and research-informed understanding of subjects, the curriculum, learners and learning. The Postgraduate Award from LJMU is co-designed to ensure that teaching and assignments are embedded in classroom practice. There is significant academic and pastoral support from LJMU, whose staff also visit our students and their mentors on placement."}],"createdAt":"2021-07-06T17:51:42.537Z","updatedAt":"2021-10-01T18:57:53.679Z"}
