{"id":"ecc85c2d-855d-4e29-8904-3cb7c203d557","name":"St Marylebone Collaborative","code":"1ET","type":"lead_school","isAccreditedBody":false,"urn":"137353","ukprn":"10035059","address":{"addressLine1":"64 Marylebone High Street","town":"London","county":"Greater London","postcode":"W1U 5BA"},"contact":{"website":"http://www.stmaryleboneschool.com","email":"h.hall@stmaryleboneschool.com","telephone":"2079354704","fullName":"Peter Jordan"},"location":{"latitude":51.5221492,"longitude":-0.152011},"trainWithUs":"The St Marylebone School Teaching School Alliance was part of the first cohort of a hundred Teaching schools and won this accolade largely due to a proven track record of training and outreach work, Now working as SMS Collab. We are experienced in supporting successful trainees over a number of years on different training routes, for instance PGCE, Teach First, the Graduate Teacher Programme, School Direct Pilot and School Direct. Staff are eager to be involved in training and mentoring, many of them having themselves trained at St Marylebone School. You will work with experienced teachers, first of all observing and team teaching, then teaching independently. This is complimented by a placement of about 6 weeks’ teaching in another school. We have been successively rated ‘outstanding’ by Ofsted and SIAMS and are one of the best performing non-selective state schools nationally. We are based in in the fantastic location of Marylebone High Street with all the attractions of central London nearby and the benefits of excellent transport links. Nearest tube stations: Baker Street, Regents’ Park (both a 2-minute walk away). You will be able to develop your career in a beautiful school with excellent facilities and positive links with parents and the vibrant local community\nWe work with a big group alliance of school in central London and further afield. Often the six week second school placements are shared between alliance schools to ensure that trainees have a good experience.","trainWithDisability":"For e'Qualitas trainees. \nAlso contact the eQualitas office for a discussion of your needs if they are not related to mobility, so that we can identify what additional support might be appropriate for you.\n\nDisability access is limited in some of the schools due to the nature of the historic buildings in which they are based. Please contact the school concerned directly if you wish to discuss this in detail.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"7f11aaed-7c3e-42c5-af7a-023d33b45fa3","code":"U80","name":"UCL, University College London","description":""},{"id":"252d7e03-741e-4453-b6a8-3d361e6c9d1b","code":"E69","name":"e-Qualitas","description":"e-Qualitas recognises that all training situations are different, and tailor aspects of the learning journey towards mastery of the e-Qualitas ITT curriculum and Teachers’ Standards training accordingly. Each trainee, in their school, has a unique position: learning how to plan so that all pupils and students make good progress in lessons and over time. Our aim is that the e-Qualitas curriculum is clearly understood in schools and provides trainees with models and multiple opportunities to rehearse and refine particular approaches through a shared vision that engages and prepares trainees for the reality of the classroom through sustainable workload and support."}],"createdAt":"2021-07-06T17:52:14.627Z","updatedAt":"2021-10-26T16:26:38.796Z"}
