{"id":"ecd0e02f-2c36-42c3-b595-7722a03dffd4","name":"Fairfields School","code":"1L3","type":"lead_school","isAccreditedBody":false,"urn":"122160","ukprn":"10042491","address":{"addressLine1":"Fairfields School","addressLine2":"Trinity Avenue","town":"Northampton","county":"Northamptonshire","postcode":"NN2 6JN"},"contact":{"website":"http://fairfieldstsa.org.uk","email":"info@fairfields.northants.sch.uk","telephone":"01604 714777","fullName":"Lead practitioner"},"location":{"latitude":52.2537089,"longitude":-0.8883956},"trainWithUs":"Fairfields School is a truly inclusive training provider. We have an excellent track record of 100% of trainees achieving QTS. Over the last 3 years, we have had 85% of trainees exceed requirements.\nOur School Direct Programme is led by the Outstanding (2018) Fairfields School in Northampton. We work with a vast range of local schools and we offer opportunities for placements at special schools and mainstream schools.\nOur tailored training equips our trainees with the skills and knowledge required to be effective classroom practitioners.\nWe offer the tuition fee training route with a focus on local and needs based training.\nWe work with the University of Derby, an Outstanding ITT provider.\nPlease contact us through info@fairfields.northants.sch.uk and we would be happy to answer your questions.","trainWithDisability":"As a special school, being inclusive is at the heart of everything we do.\nWe treat all of our trainees as individuals and cater for all needs for successful candidates. Our vast range of schools allow us to prepare bespoke placements if needed.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"aa023df3-b71e-4249-b9c4-41fca8bd135e","code":"D39","name":"University of Derby","description":"The University of Derby School Direct Programmes were judged as Outstanding in 2015 by Ofsted."}],"createdAt":"2021-07-06T17:49:33.653Z","updatedAt":"2021-10-22T19:25:56.292Z"}
