{"id":"eceb05bc-a63f-4f29-91d0-1248d7f86e3e","name":"Sunderland Nursery Schools","code":"2JQ","type":"lead_school","isAccreditedBody":false,"urn":"108753","ukprn":"24246977","address":{"addressLine1":"Sunderland Nursery Schools","addressLine2":"Portsmouth Road, Pennywell","town":"Sunderland","county":"Tyne and Wear","postcode":"SR4 9AX"},"contact":{"website":"http://www.pennywellearlyyears.org","email":"claire.leybourne@schools.sunderland.gov.uk","telephone":"1915341004","fullName":"Claire Leybourne"},"location":{"latitude":54.8976004,"longitude":-1.4420598},"trainWithUs":"Why train with us?\nPartners in Pedagogy is a partnership of 7 maintained nursery schools across Sunderland led by Pennywell Early Years Centre, an outstanding school. We work together to provide training and support to schools and settings and initial teacher training placements.\nWe believe in high quality teaching and learning through an active, creative and high quality curriculum for all children. All our staff are trained to a high standard and our environments also reflect our belief in its importance.\nThe child and the parent’s voice are fundamental to inspirational teaching and learning and we value their participation and encourage a “learning together” ethos. Learning for all is promoted through our reflective practice to ensure we adapt and change with our families.\nOur practice focuses on :\n* A child led, play based curriculum demonstrating high quality pedagogy\n* High quality indoor and outdoor environments\n* Reflective practice in action\n* Data analysis to support purposeful planning and assessments which are used to ensure high levels of learning and development.\n* Inclusive teaching and learning which enables all children and their families to engage\nThe placement schools and linked Primary Schools are committed to providing quality support and guidance throughout your course to ensure that you receive exceptional training in supportive and exciting environments. You will work with highly skilled teachers and practitioners in Early Years and extended age phases with local partner primary schools.","trainWithDisability":"We follow the University of Sunderland Diversity statement:\n\"We celebrate and value the diversity of all students and staff, working to ensure that all are welcome in our community and do not face discrimination or encounter barriers with regard to their disability.\"\nThe University of Sunderland Disability Support Team provides advice, information and guidance to students with a disability; students with mental illness or mental health difficulties; students with Specific Learning Difficulty (SpLD) such as dyslexia.\nOn application please contact the Disability Support Team for disability-related queries:\nWebsite: Disability Services Email: disability.support@sunderland.ac.uk\nTel: 0191 515 2952\nAll the Nursery Schools are single storey, fully accessible buildings, close to local amenities.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"926804ac-be7a-4f0a-97f9-a26a5f5f032a","code":"S84","name":"University of Sunderland","description":"We are proud to work in partnership with the University of Sunderland. The University has successfully trained teachers for over 100 years making a difference in educating the next generation of learners.\\r\\n\\r\\nThrough our partnership with the University our Trainee Teachers benefit from the support of our Sunderland Nurseries Tutor Team who are experts in their subject fields and related pedagogies. The School of Education is world leading in research according to the latest Research Excellence Framework. Trainees are allocated a Personal Tutor from the University who will work with their School Mentor to give academic, pastoral and placement support."}],"createdAt":"2021-07-06T17:56:48.338Z","updatedAt":"2021-10-08T21:15:30.569Z"}
