{"id":"edad87dc-9350-40ce-9752-e74cedd2688e","name":"George Spencer Academy SCITT","code":"1HR","type":"scitt","isAccreditedBody":true,"ukprn":"10052834","address":{"addressLine1":"George Spencer Academy","addressLine2":"Arthur Mee Road","town":"Stapleford","county":"Nottingham","postcode":"NG9 7EW"},"contact":{"website":"http://georgespencerscitt.co.uk/","email":"SCITT@george-spencer.notts.sch.uk","telephone":"1159170100","fullName":"SCITT - Vicki Ilic or Colleen Brennan"},"location":{"latitude":52.9209512,"longitude":-1.2676247},"trainWithUs":"We offer a high quality teacher training programme (QTS and PGCE) with outstanding outcomes for trainees and high satisfaction ratings. (Ofsted 2013)\nOur team are highly experienced, approachable and supportive including first rate mentors and trainers who are all serving teachers and are passionate about providing first rate teachers for the region.\nSubject knowledge and pedagogical skills are enhanced through our comprehensive subject knowledge and professional studies programmes.\nOur programme aims to challenge you to become an expert teacher while fully supporting you in every aspect of your training. A wide variety of placements and experiences are available and you will benefit from our diverse range of schools some of which are culturally mixed, in challenging socio-economic circumstances or graded outstanding by Ofsted. Our partners include an outstanding PGCE Provider (University of Derby), George Spencer Academy Teaching School Alliance, Derby Research School and East Midlands West Maths Hub.\nOngoing professional development programmes are available beyond your training year including Early Career Teacher Programmes, Middle Leader Courses and National Professional Qualifications.","trainWithDisability":"Here at George Spencer Academy SCITT your individual needs are taken into account from the minute we receive your application through to completion of the programme and beyond. We are able to make reasonable adjustments to accommodate disabilities and other health conditions.\nOur specialist staff are available to support learning needs such as dyslexia, using their wealth of experience and knowledge and specialised resources.\nTo enable you to achieve your full potential our programme supports you to create a productive work-life balance whilst promoting good health and wellbeing.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:53:26.191Z","updatedAt":"2021-07-15T20:42:09.419Z"}
