{"id":"eddc62cc-0d35-4b94-89f6-50923a3e16a6","name":"Learning Academy Partnership","code":"21V","type":"lead_school","isAccreditedBody":false,"urn":"137304","ukprn":"10034560","address":{"addressLine1":"Learning Academy Partnership","addressLine2":"Suite 4 Zealley House","town":"Greenhill Way, Kingsteignton","county":"Devon","postcode":"TQ12 3SB"},"contact":{"website":"https://www.lapsw.co.uk/schooldirect/","email":"schooldirect@lapsw.org","telephone":"01626 248793","fullName":"School Direct Administrator"},"location":{"latitude":50.5422987,"longitude":-3.5951006},"trainWithUs":"* Do you aspire to be an outstanding primary teacher?\n* Are you excited at the prospect of making a difference to children's lives?\n* Are you determined, passionate and committed to your own development?\nOur programme awards both QTS and PGCE on successful completion of the programme. We work with a wide range of diverse and high quality primary schools and academies from a variety of different contexts including: multi-academy trusts, church, community, local authority, small, large, seaside, urban and rural locations. Our Teacher Education team have seven years' experience of designing and delivering the School Direct programme and year on year we have had an extremely high success rate of School Direct students gaining employment upon completion of our programme. Whilst we do not guarantee teaching posts to School Direct graduates, our alliance schools are fully involved in the programme as they are committed to 'growing' the next generation of outstanding teachers for their own schools. We work together to share expertise, experience, talent and capacity to improve the learning and achievement of young people across the South West. We believe that every child has the right to be taught by an excellent teacher in an excellent school that nurtures, challenges and supports their potential. Together, we have a track record of developing and supporting new, talented teachers into the profession, through high quality training, delivered by excellent practitioners in our schools and universities.","trainWithDisability":"Support can be provided for candidates with disabilities - we will discuss this with you in detail upon receipt of your application.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:54:06.696Z","updatedAt":"2021-10-04T14:35:27.257Z"}
