{"id":"ef09ce50-ccfc-4346-a0ce-43e840153dab","name":"University of Warwick","code":"W20","type":"hei","isAccreditedBody":true,"ukprn":"10007163","address":{"addressLine1":"Westwood Campus","addressLine2":"University of Warwick","town":"Kirby Corner Road","county":"Coventry","postcode":"CV4 8EE"},"contact":{"website":"http://www2.warwick.ac.uk/fac/soc/cte/thinking-about-being-a-teacher/","email":"cte.admissions@warwick.ac.uk","telephone":"024 761 50269","fullName":"Centre for Teacher Education"},"location":{"latitude":52.3879174,"longitude":-1.5613053},"trainWithUs":"WARWICK. HELPING YOU FIND YOUR OWN PATH TO TEACHING SUCCESS.\nWe understand that teaching is more than just a job. We also know that you are more than just another applicant. That’s why our approach is tailored around your needs. We’re focused on getting you prepared to enter the classroom and ready for all the challenges that teaching throws at you. We won’t drop you in at the deep end, but we will help you become accustomed to different school environments.\nWe have a long history of providing students with the best access to the contacts, resources and facilities needed to fulfil teaching promise. You’ll also benefit from our research-informed teaching, delivered at an acclaimed university with a reputation for excellence. That teaching will come from people who truly understand about the journey that you’re taking. We have been training teachers for over 50 years and are part of the Russell Group, whose members represent outstanding teaching and learning experience. We are rated an \"Outstanding\" provider of teacher training by Ofsted We work in partnership with over 500 schools to deliver the highest quality training. You will be taught and supported by highly experienced tutors, class teachers and school mentors who have national reputations for the quality of their training. Upon completing a PGCE with Warwick you will gain 90 credits at master’s level.","trainWithDisability":"All trainees are provided with a named personal tutor and a subject specific mentor in placement. \nWarwick provide a range of support for students with disabilities and other needs through the Student Disabilities Team.\n\nwarwick.ac.uk/services/disability","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"createdAt":"2021-07-06T17:54:26.825Z","updatedAt":"2021-10-04T19:47:19.281Z"}
