{"id":"ef172d85-20e4-4aa2-96d0-9e3ae81f526d","name":"St Mary’s University, Twickenham","code":"S64","type":"hei","isAccreditedBody":true,"urn":"133895","ukprn":"10007843","address":{"addressLine1":"Waldegrave Road","addressLine2":"Strawberry Hill, Twickenham","town":"Richmond upon Thames","county":"London","postcode":"TW1 4SX"},"contact":{"website":"https://www.stmarys.ac.uk/teacher-training/about.aspx","email":"Apply@stmarys.ac.uk","telephone":"020 8240 2394","fullName":"Admissions Office"},"location":{"latitude":51.437026,"longitude":-0.3350701},"trainWithUs":"St. Mary's University is graded \"Outstanding\" by Ofsted for both Primary and Secondary teacher training. Come and meet us. The university runs 'Getting into Teaching' open events where you can chat with the tutors. Book via https://www.stmarys.ac.uk/open-events/pgce.aspx\nFor further details: (https://www.stmarys.ac.uk/teacher-training/become-a-teacher.aspx )\nWhere to find us: (https://www.stmarys.ac.uk/contact/overview.aspx)\nStudent Life: (https://www.stmarys.ac.uk/student-life/overview.aspx)\nTrainee teachers at St Mary's have very high employment statistics, with many securing jobs in in our partnership schools.\nStudent feedback, and our recent OFSTED report (February 2019), highlights the quality of the pastoral care provided through the training programmes and the support offered by partner schools. St. Mary's University is situated in Strawberry Hill, Twickenham - a leafy part of Greater London (5 minute walk from Strawberry Hill mainline from London Waterloo) and good local bus links for other central London connections.\nPublic Transport: https://www.stmarys.ac.uk/contact/overview.aspx\nWe will soon celebrate 170 years in Education in south west London. St Mary's is London's second largest teacher training course provider, with a significant proportion of our 6,000 students training to teach on primary and secondary initial teacher training courses.\nKey Facts\nClose partnership between the University and partner schools in all aspects of the course\nEducational theory closely related to practical reality of the classroom\nBespoke personal tutor support\nStrong focus on subject knowledge development\nSupport for those with an area of interest in SEND and EAL\nHigh employability rates for PGCE Trainee Teachers\nOngoing support into your NQT year and your career beyond\nOngoing Masters study opportunities at discounted rates","trainWithDisability":"St. Mary's University has a fully supportive and well-resourced Student Wellbeing service to support trainees with disabilities and other needs.\nAt interview, we encourage candidates to disclose any additional needs requiring support so that early support can be in place for the PGCE course.\nFor further information on Disability Access: (https://www.stmarys.ac.uk/student-support/wellbeing/dyslexia-and-disability/registering.aspx)","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"createdAt":"2021-07-06T17:53:48.874Z","updatedAt":"2021-08-16T21:37:44.557Z"}
