{"id":"ef96e044-b65c-4cc8-b2b4-44aca678aeb0","name":"The Learning Institute South West","code":"L19","type":"scitt","isAccreditedBody":true,"ukprn":"10057945","address":{"addressLine1":"Rm B304, Beacon Place, Station Approach","town":"Roche","county":"Cornwall","postcode":"PL26 8LG"},"contact":{"website":"www.learninginstitute.co.uk","email":"itt@learninginstitute.co.uk","telephone":"1726891745","fullName":"Ania Glowczynska"},"location":{"latitude":50.4185709,"longitude":-4.8288256},"trainWithUs":"The Learning Institute South West is a successful and highly respected SCITT with over 15 years of experience.Since starting in 2004, the SCITT has trained over 600 teachers with excellent employment rates.The Learning Institute is an outreach arm of WeST (Westcountry Schools Trust). We work in close partnership with Southerly Point Co-Operative Multi Academy Trust,Castleman Learning Network and a range of schools in the region to provide the best possible training experiences for our trainees.The breadth and strength of our partnerships allow us to bring together expertise from across the region to provide the highest quality taught sessions and placements.Our programme is designed not only to prepare trainees to flourish in the teaching profession now,but also throughout their careers. We are committed to developing the school leaders of the future through our values-led programmes,supporting critical reflective practice and principled decision-making.Our teacher training programmes are school-based.This is the best way to experience all aspects of school life,learning from outstanding practising teachers.You will be supported by mentors and our experienced tutor team.School-based learning is supported by regular taught sessions to help develop teaching skills with greater depth and understanding.External Moderator reports:‘Trainees receive excellent support from their schools and visiting tutors. Leaders ensure that the well-being of trainees is a high priority’.We are able to treat trainees as individuals and understand that trainees coming into teaching have different backgrounds and strengths. We can provide personalised programmes to enable bespoke learning opportunities.","trainWithDisability":"We will support and advise people with individual needs who wish to come into teaching and when necessary help them access the appropriate resources to meet their goals. Medical conditions are confidentially assessed by Teacher Training Occupational Health advisers, who make impartial recommendations about candidates’ suitability and readiness for the teaching profession. By raising awareness of all strands of diversity we aim to eliminate discrimination and promote equality of opportunities. We are preparing our trainee teachers to become good global citizens, and to appreciate the diverse society in which they live. We believe that, in turn, this helps to shape responsive teachers. We appreciate that talents reside in people of all backgrounds.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:51:38.751Z","updatedAt":"2021-09-23T17:48:16.643Z"}
