{"id":"efacc8e8-79db-41bb-b7c4-83300535d1fc","name":"Aston Manor Academy","code":"1F2","type":"lead_school","isAccreditedBody":false,"urn":"136882","ukprn":"10034151","address":{"addressLine1":"Phillips Street","addressLine2":"Aston","town":"Birmingham","county":"West Midlands","postcode":"B6 4PZ"},"contact":{"website":"http://www.astonmanor.bham.sch.uk/school-direct/","email":"jack.small@titan.org.uk","telephone":"0121 607 1930","fullName":"Neil Turner"},"location":{"latitude":52.4958679,"longitude":-1.8897936},"trainWithUs":"Aston Manor Academy is an inner city school which caters for students from Year 7 through to Sixth Form. We have a diverse cultural mix of students who are keen to achieve. In our recent Ofsted report we were graded as an Outstanding Academy as we were awarded outstanding in all areas. Exam results both at GCSE and Sixth Form have improved dramatically over the last seven years. Progress made by students now places the Academy in the top 1% of schools in the country; an outstanding achievement made possible by the students and staff who all work exceptionally hard. As an Academy, we are committed to ensuring that every child succeeds. Results for both vocational and academic courses at in our Sixth Form subjects are outstanding and 100% of our Year 13 students were successful in obtaining University places. Our Initial Teaching Training Programme in association with the 'Titan Partnership' is well established and many programmes having been in action for over 15 years; we have employed many of our former trainees who have gone onto become strong middle and senior leaders. We hope to provide all the trainees at AMA with the best possible support to ensure success at every level. The feedback we have had from our trainees has always been positive because of the support given by both ourselves and the course provider.","trainWithDisability":"Aston Manor Academy is an inclusive provider. We will support you during your training year and make any reasonable adjustments to ensure we meet your specific needs.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:48:08.077Z","updatedAt":"2021-09-22T17:52:19.559Z"}
