{"id":"efc5c0af-96d8-4b6b-a02d-965d674f236c","name":"Calthorpe Park North East Hants and Surrey Borders Consortium","code":"1UH","type":"lead_school","isAccreditedBody":false,"urn":"116436","ukprn":"10015239","address":{"addressLine1":"Hitches Lane","town":"Fleet","county":"Hampshire","postcode":"GU51 5JA"},"contact":{"website":"http://www.cps.hants.sch.uk","email":"m.beacroft@cps.hants.sch.uk","telephone":"01252 613483","fullName":"Emma Jones"},"location":{"latitude":51.279803,"longitude":-0.862486},"trainWithUs":"The Calthorpe Park North East Hanst & Surrey Borders consortium is an exciting place to work and learn. We have a long and successful history of training and developing future teachers and are proud to offer a number of training places for 2022/2023.\nThe consortium comprises eleven very varied schools which present dynamic and exciting training possibilities for those wishing to pursue a career in teaching. We have six secondary schools in the consortium, two with a sixth form. We also have two junior schools, two primary schools and one special needs primary school which provides a unique opportunity for trainees to experience a very different educational setting.\nCalthorpe Park School is the lead school in this consortium and our partner schools are;\n* Collingwood College, Camberley * Frogmore Community College, Yateley\n* Yateley School, Yateley\n* Cove School, Farnborough\n* Alderwood School, Aldershot\n* All Saints Church of England Junior School, Fleet\n* Potley Hill Primary School, Yateley\n* St. Peter's Church of England Junior School, Farnborough\n* Henry Tyndale School, Farnborough\n* Dogmersfield Church of England Primary School, Dogmersfield\nCalthorpe Park School and partners work collaboratively as part of the University of Reading ITT Partnership to ensure that its trainees receive the best of what School-based and University-based training has to offer. These two aspects of the course are closely integrated and supported by University subject tutors as well by members of staff in school who receive specialist training at the University.","trainWithDisability":"The University of Reading welcomes all students and has a dedicated Disability Advisory Service which offers advice and guidance to students with any disability, mental health condition, or specific learning difficulty (SpLD).","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"6439adcc-af64-4d3d-a1da-de045755db06","code":"R12","name":"University of Reading","description":"The University of Reading’s Institute of Education is an established provider of high-quality training and research. They are ranked 10th in the UK for Education (The Guardian University League Table 2022).\\r\\n\\r\\nCommitted to developing caring, reflective, professional teachers, they have well-established partnerships with over 400 schools in Berkshire and the surrounding area.\\r\\n\\r\\nOfsted report that the effective relationships with partner schools support the development of high quality teaching and trainees that are well-prepared to work in the region’s schools. ITE inspection report, September 2016."}],"createdAt":"2021-07-06T17:48:38.756Z","updatedAt":"2021-11-25T18:21:39.114Z"}
