{"id":"eff03c14-006a-4fd8-8ae8-1b3e7f955455","name":"Valentines High School","code":"1OM","type":"lead_school","isAccreditedBody":false,"urn":"102857","ukprn":"10007204","address":{"addressLine1":"Cranbrook Road","town":"Gants Hill","county":"Ilford","postcode":"IG26HX"},"contact":{"website":"https://www.valentines-sch.org.uk/school-direct","email":"swo@valentines-sch.org.uk","telephone":"2085543608","fullName":"Steve Woodley"},"location":{"latitude":51.5740357,"longitude":0.0662486},"trainWithUs":"As a Teaching School and Leading Edge School, Valentines High School places quality professional development at the centre of its work. We were among the first ten schools in London to be awarded the Pan London Quality Mark for CPD, achieving the highest ‘Gold’ Level for the quality of our work. We were also one of the first 100 Teaching Schools. Valentines is an “outstanding” school with GCSE results consistently in the top 5% of national schools for progress. We lead an alliance of high performing, welcoming and highly successful schools in East London, all of whom have considerable experience in developing the skills of trainee teachers across a range of initial teacher training programmes. Our partnership of schools comprises a range of primary and secondary schools including a faith school. They are conveniently located, which means trainees can engage with more than one school in the partnership. We provide a unique opportunity to experience a diverse and contrasting range of teaching and training experiences. We work with a range of leading London universities and all our School Direct programmes lead to PGCE qualifications.","trainWithDisability":"We are an equal opportunities employer, and we seek to accommodate all needs. Please contact us if you would like to discuss arrangements.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:52:17.543Z","updatedAt":"2021-09-23T16:43:27.936Z"}
