{"id":"f03a925e-bdf9-446b-8dc6-c97e9019988d","name":"The Norwich Teaching School","code":"1SR","type":"lead_school","isAccreditedBody":false,"address":{"addressLine1":"Eaton Hall Specialist Academy","addressLine2":"Pettus Road","town":"Norwich","county":"Norfolk","postcode":"NR4 7BU"},"contact":{"website":"https://www.norwichteachingschool.co.uk/school-direct","email":"info@norwichteachingschool.co.uk","telephone":"1603255943","fullName":"Valerie Moore"},"location":{"latitude":52.6166725,"longitude":1.2572929},"trainWithUs":"Norwich Teaching School is a supportive developmental teaching school. Working with schools in the Alliance it provides access to a wide range of CPL and career development opportunities coupled with expert evidence based practice from supportive colleagues. We have a 100% success rate of SCITT pupils passing through our Alliance schools who have all gone onto to retain employment within the wider trust family. We welcome applicants with a range of experiences and are keen to work with you to develop your career in what is, the most rewarding and dynamic profession.","trainWithDisability":"We are committed to supporting trainees with disabilities. Please contact us to discuss any access requirements.","accreditedBodies":[{"id":"89831af6-535f-471b-aa97-098bd1a93291","code":"S13","name":"Suffolk and Norfolk Primary SCITT","description":"The Suffolk and Norfolk Primary SCITT programme is a personalised, relational and ethical training provider. Primary SCITT has very high attainment and employment outcomes for trainees. On average 95% of trainees are employed in local schools by the end of their training year. \\r\\nTrainees are supported by school mentors and SCITT Tutors who have a range of experience in schools as classroom practitioners and often headteachers or members of senior leadership teams, so have a wealth of experience to share with trainees. \\r\\nThe Primary SCITT course is a highly personalised course which offers a wide range of opportunities to trainees."},{"id":"d8370001-6f2b-4624-b30c-27ddc5beebfc","code":"S14","name":"Suffolk and Norfolk Secondary SCITT","description":"The Suffolk and Norfolk Secondary SCITT programme is a highly personalised, well regarded and established teacher training course. It has very high attainment and employment outcomes for trainees. This programme has the unique structure of being in partnership with a\\r\\nsignificant number of schools across all areas of Suffolk and Norfolk. Due to the size of our partnership, this course provides with you the wealth of experiences so you can become a resilient and confident newly qualified teacher who will be able to teach in any type of school at the start of\\r\\nyour teaching career."}],"createdAt":"2021-07-06T17:51:28.904Z","updatedAt":"2021-12-22T02:02:43.956Z"}