{"id":"f03c9777-978d-4904-9fac-5870cc456cac","name":"City of Liverpool College","code":"L43","type":"lead_school","isAccreditedBody":false,"urn":"130487","ukprn":"10003955","address":{"addressLine1":"Clarence Street","town":"Liverpool","county":"Merseyside","postcode":"L3 5TP"},"contact":{"website":"https://www.liv-coll.ac.uk/courses/teacher-training-pre-service-lifelong-learning/","email":"Scott.Clarke@liv-coll.ac.uk","telephone":"0151 252 3000","fullName":"Vesna Levi"},"location":{"latitude":53.4045885,"longitude":-2.9731412},"trainWithUs":"The City of Liverpool College University Centre has a long tradition of providing Initial Teacher Education to those teaching, training and tutoring in the Lifelong Learning Sector. We offer a rewarding programme that will equip you with the skills and knowledge you need to pursue a career in teaching. Our campus is based in the heart of Liverpool and offers world class facilities and centralised student finance and support services that provide students with a learning experience like no other. You will have access to dedicated tutors who bring with them a wealth of knowledge and experience. The quality of our teaching is recognised nationally. In 2021, The City of Liverpool College University Centre scored 96% for student satisfaction in the National Student Survey. We work in a strong and credible partnership with the University of Huddersfield to deliver our teacher training programmes.","trainWithDisability":"The College welcomes applicants with disabilities and is proactive both in anticipating needs, and in making reasonable adjustments to ensure that disabled students are welcomed and treated fairly. You do not have to tell us about a disability, but we positively welcome disclosure at any point during your studies, as informing us will ensure that any necessary support from disability specialists or teaching staff can be put in place. Students can access counselling and mental health support whilst studying with us. We are also able to offer guidance for students who are applying for Disabled Students' Allowance and financial support towards related costs.\nFor more information, contact: DSA@liv-coll.ac.uk","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:53:51.214Z","updatedAt":"2021-08-02T21:55:11.676Z"}
