{"id":"f0439376-da6f-452c-9efb-371f2dee4cec","name":"The Wroxham School","code":"12M","type":"lead_school","isAccreditedBody":false,"urn":"138215","ukprn":"10037471","address":{"addressLine1":"The Wroxham School","addressLine2":"Wroxham Gardens","town":"Potters Bar","county":"Herts","postcode":"EN6 3DJ"},"contact":{"website":"https://www.thewroxham.org.uk/","email":"jenny.bramley@thewroxham.net","telephone":"1707643576","fullName":"The ITT Lead Coordinator"},"location":{"latitude":51.699476,"longitude":-0.214072},"trainWithUs":"The Wroxham School is a lead school for School Direct courses and works in partnership with the University of Hertfordshire. Our schools cover a wide geographical area, within travelling distance of the University of Hertfordshire’s DeHavilland campus in Hatfield.\nThe course we offer is a School Direct PGCE (self funded). The course lasts a year and results in Qualified Teacher Status (QTS) and a Post Graduate Certificate in Education. You will be based in one main school, getting the chance to learn 'on the job' and spend one day per week training at university. A shorter second placement occurs in the spring term. You spend one day a week throughout the year at The University of Hertfordshire.\nAll applications are processed by The Wroxham School. We will invite candidates to interview if their application meets the university criteria. If the applicant is accepted, they will be allocated to a school in their area that has requested a trainee. We are always willing to work with schools that are new to our alliance, especially if they are already keen to host a particular applicant. Please contact jenny.bramley@thewroxham.net for more information.","trainWithDisability":"Each year the University of Hertfordshire welcomes a significant number of students who disclose a disability and/or have other needs. The University seeks to create a fair, inclusive culture where everyone feels valued and respected.\nThe University of Hertfordshire and The Wroxham School are committed to promoting equality of opportunity to ensure that they meet the needs of disabled people and has policies that are intended to support all students both in their studies and in developing their professional practice.\nIf you have a disability or other need we encourage you to disclose this and any other relevant information that could support your studies.\nThe School of Education at the University of Hertfordshire provides both academic and practice placement support for teachers in training with disabilities and other needs.\nOne key aspect of the PGCE course is to raise awareness of mental health and well-being and to support the removal of unnecessary workload. [University of Hertfordshire disability support](https://www.herts.ac.uk/life/student-support/disability-services)\n[University of Hertfordshire statement on disability disclosure by students](https://www.herts.ac.uk/life/student-support/disability-services/statement-on-disability-disclosure-by-students).","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"feecdec5-259c-45e3-b1cf-4e391936ee90","code":"H36","name":"University of Hertfordshire","description":"University of Hertfordshire is a leading regional provider of teacher training with a long-standing history of working in partnership to support Initial Teacher Education (ITE).\\r\\n\\r\\nWe are recognised among the top 25% of providers by the Department for Education (DfE). We have been consistently rated good (Ofsted 2005-6, 2010-11, 2013-14) in our Ofsted inspections and have been recognised in the Guardian and Times league tables.\\r\\n\\r\\nwww.go.herts.ac.uk/schooldirect"}],"createdAt":"2021-07-06T17:56:48.241Z","updatedAt":"2021-10-14T00:51:35.895Z"}
