{"id":"f0bb05af-bedd-48ed-a89d-80f805ff576e","name":"Brampton Manor Academy","code":"MB8","type":"lead_school","isAccreditedBody":false,"urn":"136669","ukprn":"10033384","address":{"addressLine1":"Roman Road","addressLine2":"East Ham","town":"London","postcode":"E6 3SQ"},"contact":{"website":"https://www.bramptonmanor.org/","email":"admin@teachinglondon.org","telephone":"2079321126","fullName":"Tabitha Kaiser"},"location":{"latitude":51.5222396,"longitude":0.0417471},"trainWithUs":"At Brampton Manor Academy, we passionately believe that all students can be successful if they show real effort and determination to do their best. We know that this is true and can point to the success of thousands of former and current students to prove the point.\n\nThe values which underpin everything we do are expressed in our Mission Statement:\n*At Brampton Manor we encourage ambition, a positive self-image and pride in achievement.\n*Within a stimulating learning environment, we motivate, challenge and support all members of the school in pursuit of excellence.\n*We value each individual and confront all forms of discrimination and prejudice.\n*We develop a strong sense of community based on listening to, caring for, co-operating with and encouraging others.\n*In partnership with parents, governors and the wider community we seek to enrich the quality of school life, make learning enjoyable and empower all our members to realise their potential and to contribute fully to the society of which they are a part.\n\nWe recognise that a top quality education consists of much more than just academic qualifications. The skills and qualities which we instil in our young people will have a profound impact on the quality of their lives and their future opportunities. Their personal and social strengths will be integral to everything they achieve. At Brampton Manor we work hard to develop students who are:\n*Confident\n*Creative\n*Expressive\n*Independent\n*Collaborative\n*Empathetic\n*Resilient","trainWithDisability":"Teaching London: LDBS SCITT has a degree of step-free access, but as the building was a Victorian school, we are unable to fully accommodate wheelchair access. We are always willing to discuss, and where possible, adapt to meet individual needs.\nThe well-being of our trainees is paramount, which is why you will be automatically enrolled into the Employee Assistance Programme with the Education Support Partnership. This provides 24/7 individual support and counselling, in addition to our in-house advice and support.\nWe also have experience in supporting trainees with a diagnosis of dyslexia and are able to offer specialist support on the course.","accreditedBodies":[{"id":"720894da-360a-4f7a-9835-7ce7beb3c6de","code":"L59","name":"Teaching London: LDBS SCITT","description":"An Outstanding provider (Ofsted: 2017), Teaching London puts pupils at the heart of your training. The depth and breadth of our programme enables you to gain the confidence and competence to develop into a highly skilled, responsive teacher. Exciting, interactive and rigorous centre-based sessions will inform your classroom practice, led by inspiring and experienced tutors. Your growth as a reflective practitioner is underpinned by the PGCE element, routed in school-based and current research. \\r\\n\\r\\nTraining teachers for 20+ years, we are highly effective in our role with 76% of trainees graded as Outstanding at the end of their training in 2017-18."}],"createdAt":"2021-07-06T17:54:13.715Z","updatedAt":"2021-07-06T17:54:13.715Z"}