{"id":"f0ff1cbd-be8e-4e7a-acb0-a59d3d348dcd","name":"Stepney All Saints Partnership.","code":"132","type":"lead_school","isAccreditedBody":false,"urn":"100977","ukprn":"10005863","address":{"addressLine1":"Stepney All Saints School and Sixth Form College","addressLine2":"Stepney Way","town":"London","postcode":"E1 0RH"},"contact":{"website":"https://stepneyallsaints.school/our-school/vacancies/learn-to-teach/","email":"jane.barnes@stepneyallsaints.school","telephone":"2077914965","fullName":"Mrs Jane Barnes"},"location":{"latitude":51.51597,"longitude":-0.0429155},"trainWithUs":"Stepney All Saints Partnership [formerly Sir John Cass Partnership] as a Lead School in Tower Hamlets recruits, selects and trains its own prospective teachers working with its partner schools in London and Essex. Over 50 of our current teaching staff gained QTS with us, and are still with us, many in senior positions. Please see our school website in the ‘learn to teach’ section to hear what former and current trainees have to say. https://stepneyallsaints.school/our-school/vacancies/learn-to-teach/\nWe are a Church of England School with a strong religious ethos, but also a neighbourhood school with a multi-faith intake. We are rated 'Outstanding' by Ofsted and by the SIAMs church school inspection. We are in the top 1% of highest achieving school in the country with excellent examination results at GCSE and A Level. We have a Sixth Form College of over 400 students where the majority of Year 13 students progress to University, including Russell Group Universities.\nFor further information and to read what former trainees have said about training at Stepney All Saints [formerly Sir John Cass] please visit the link below.\n\"\nhttps://stepneyallsaints.school/our-school/vacancies/learn-to-teach-at-sjcr/","trainWithDisability":"We are able to accommodate trainees with limited mobility as we have a lift in the main building and sixth form college, but our corridors do get very busy at lesson change over. We can also support trainees with dyslexia. This past year we have successfully supported trainees with limited mobility and dyslexia.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"2e1ce675-b5df-42ab-bb63-1e0435ef5722","code":"E28","name":"University of East London","description":"We have a longstanding relationship of over 20 years with the University of East London , our HE provider and work closely with tutors to plan programmes , the calendar , weekly meetings between trainees and mentors and tutor visits.\\r\\nUEL have awarded us a Gold Award for our outstanding support of the UEL ITE Partnership’s Trainee teachers.\\r\\n\\r\\nTogether we aim to develop outstanding teachers through innovative, creative and critically engaging experiences."}],"createdAt":"2021-07-06T17:55:34.168Z","updatedAt":"2021-09-16T20:06:27.440Z"}
