{"id":"f12b0a2b-0897-41af-87c2-54ae4e898662","name":"Teach East","code":"T11","type":"scitt","isAccreditedBody":true,"ukprn":"10058314","address":{"addressLine1":"Helpston Road","town":"Peterborough","county":"Cambridgeshire","postcode":"PE6 7JX"},"contact":{"website":"www.teacheast.co.uk","email":"aconnelly@teacheast.org","telephone":"01733 252235","fullName":"Enquiries"},"location":{"latitude":52.638215,"longitude":-0.303794},"trainWithUs":"Teach East is a School Centred Initial Teacher Training programme based in Peterborough. We offer a route into teaching that prepares you for a career in education as most of your time will be spent in schools.\nTeach East is run by a team of dedicated senior leaders, all of whom still teach and lead in the city on a day to day basis. With the support of staff from a wide and diverse range of schools within the city, we have constructed a course that allows trainees to learn in high quality settings, watching and working with some of the best practitioners in Peterborough.\nWe are proud of our 100% employment rates at the end of the training year, for which we provide excellent guidance and support for finding the right school for each trainee.","trainWithDisability":"Providing all the eligibility criteria is met for teacher training Teach East will ensure that people are treated solely on the basis of their abilities and potential, regardless of race, colour, nationality, ethnic origin, religious or political belief or affiliation, trade union membership, age, gender, gender reassignment, marital status, sexual orientation, disability, socio-economic background, or any other inappropriate distinction.\n\nAll disabilities can be declared on your application form and Teach East will work with all individuals to ensure their needs and requirements are met.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:51:27.321Z","updatedAt":"2021-10-13T18:39:08.783Z"}
