{"id":"f146be05-0295-4b53-94c0-0ef017f4c012","name":"Acklam Grange School","code":"2FD","type":"lead_school","isAccreditedBody":false,"urn":"145774","ukprn":"10067565","address":{"addressLine1":"Lodore Grove","town":"Middlesbrough","postcode":"TS5 8PB"},"contact":{"website":"www.acklamgrange.org.uk","email":"beaumont.c5@acklamgrange.org.uk","telephone":"1642277700","fullName":"Jon Tait"},"location":{"latitude":54.5445099,"longitude":-1.2654736},"trainWithUs":"Acklam Grange School, in association with Durham SCITT, is a large, 11-16 urban, multi-cultural secondary school with first class facilities in campus-style buildings all on one site. We offer all our teachers, support staff and trainees a nationally acclaimed professional development programme (AGS Inspire), together with a nationally recognised staff well-being package supported by a serving NHS practitioner. Our school results since 2016 have seen us as one of the top performing schools in the country.\n\nTrainees will undertake 2 placements, 1 diagnostic and an extended placement at Acklam Grange School. You will be allocated a mentor in both schools as well as being assigned a Subject Specialist by Durham SCITT. The training will offer relevant, practical, up-to-date guidance for the classroom, whilst encouraging trainees to become reflective practitioners committed to improving teaching and learning in schools. Trainees who successfully complete the course will be recommended for Qualified Teacher Status (QTS). As an integral part of the course, there is an opportunity to study 2 Masters' level modules which lead to a PGCE and can be used as credits towards an MA.\n\nThe majority of your time will be spent at Acklam Grange School where there will be a comprehensive training programme, supplemented by training at Durham SCITT. Other features of the course will include; an enhancement course with the opportunity to visit an SEN school as well as a school for autistic students. Subject knowledge training will be delivered through Durham SCITT's SSP programme.","trainWithDisability":"Durham SCITT is committed to equality of opportunity and welcomes applications from all potential trainees regardless of age, gender, race, ethnic origin, colour, nationality, sexual orientation, marital or parental status, disability, political or religious belief, or socio-economic class. Trainees will need good communication skills, determination to succeed, commitment to working hard and the ability to work with others. Developing excellent interpersonal skills will enable trainees to effectively support the learning of groups of young people from diverse backgrounds. We are looking for people who strive to improve and who are committed to their own professional development.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:54:39.176Z","updatedAt":"2021-10-29T19:45:53.223Z"}
