{"id":"f17d08c1-2257-4ccb-a4b6-e2f03205609e","name":"Stockton-on-Tees Teacher Training Partnership","code":"S60","type":"scitt","isAccreditedBody":true,"ukprn":"10006337","address":{"addressLine1":"Block B - The Education Centre at SSFC","addressLine2":"Bishopton Road West","town":"Stockton-on-Tees","county":"Cleveland","postcode":"TS19 0QD"},"contact":{"website":"http://www.stocktonscitt.uk/","email":"scitt@stockton.gov.uk","telephone":"01642 527675","fullName":"Stockton Teacher Training Partnership (S"},"location":{"latitude":54.5705265,"longitude":-1.3421895},"trainWithUs":"Our unique approach combines focused specialist in-house training in how to teach alongside immersion in the school environment to develop your skills as a teacher. We are one of a very few providers who provide substantial in-house training alongside your placement in school. We believe that this better equips you to hit the ground running when you begin to teach. Training sessions provide practical strategies and techniques that will support you when you are teaching in school. There are also many opportunities for you to learn from and teach your fellow trainees through sessions that allow you to share your successes, ideas and challenges with each other and reflect on your school experiences. You will benefit from a mentor dedicated to supporting your development as well as a professional tutor who will oversee your development throughout the year.\nWe have a reputation for excellence, which is why more trainees than ever are choosing Stockton SCITT. Our employment rate is very strong; every year, over 50% of our trainees go onto secure ECT positions in Stockton, many in the schools where they trained with the rest gaining employment in the wider Tees Valley and beyond.","trainWithDisability":"All of our training takes place on the ground floor. For trainees with specific needs such as dyslexia or autism, we work with Occupational Health and the trainee to identify their precise needs and ensure that the appropriate support is put in place. For example, a recent trainee with dyslexia was provided with appropriate software on a loaned laptop, a smartpen, overlays and materials provided on coloured paper.\nThe family dynamics of trainees often change during the course of the programme; we work with you to support you to manage these changes alongside your training needs. For example, in previous years, we have offered maternity and paternity leave, compassionate leave and temporary flexible training hours to manage a specific issue.\nThe well-being of all our trainees is very important to us. We continually monitor well-being through a number of mechanisms and individual support is put in place as required. All individual needs are taken into account when determining the location and nature of your placement schools.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:49:56.408Z","updatedAt":"2021-09-08T21:24:34.977Z"}
