{"id":"f194958a-a361-4e4e-8c58-389856ca0148","name":"Sutton Park SCITT","code":"25D","type":"scitt","isAccreditedBody":true,"ukprn":"10035849","address":{"addressLine1":"Queslett Road East","town":"Sutton Coldfield","county":"West Midlands","postcode":"B74 2EX"},"contact":{"website":"http://suttonpark-scitt.weebly.com/","email":"S.Cormell@thestreetlyacademy.co.uk","telephone":"07309 708236","fullName":"Stephen Cormell"},"location":{"latitude":52.563582,"longitude":-1.8776926},"trainWithUs":"The Sutton Park SCITT works with schools in Birmingham, Walsall, Sandwell, Wolverhampton, Staffordshire, Warwickshire, Nottinghamshire and Shropshire.\nThe single focus throughout the course is on you developing into the best teacher that you can be in the year, so there are no distractions from this such as writing assignments for university courses.\nYou are immersed into the life of a subject department within a school where you are nurtured in your professional development in the way that is most appropriate for you at each time throughout the year. There is no blueprint for how you must train, for each trainee is different, comes with different levels of experience, has different personal characteristics and will develop styles of teaching which are appropriate for them as individuals. Support from dedicated mentors in your school enables you to reflect and progress in your development as a teacher. This is teachers training teachers.\nOur online progress and assessment portal gives you and those supporting you access to the necessary information anywhere and any time, using the Chromebook which we provide.\nOfsted said: \"There is an extensive programme of training, centrally and on school placements, which ensures that outcomes are at least good for almost all trainees. This ensures that they are well prepared to teach at the beginning of their teaching careers.\"","trainWithDisability":"We welcome trainees with disabilities and other needs openly. At every interview we inform applicants that, whatever health or other conditions they declare after they have accepted their place, we will provide whatever support and whatever reasonable adjustment is appropriate to whatever has been declared.\nWe have had successful trainees in the recent past who have declared mental health conditions as well as physical ones. Illness and disability is not a barrier to being a capable teacher.\nWe recognise that, very often, it is the individual themself who is the expert in their condition and we seek their guidance about the support that they need.\nWe have also provided support to trainees with dyslexia, getting ICT equipment for them. We have also paid for dyslexia diagnosis where a trainee suspected that he might be dyslexic.\nSome of our school settings, including The Streetly Academy where most of the .Friday 'hub training' takes place, have extensive wheelchair access and lifts around the school.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:48:45.738Z","updatedAt":"2021-07-14T21:25:37.572Z"}
