{"id":"f1bd8660-b91f-4133-838c-77e9cbc428dc","name":"SCITT in East London Schools (SCITTELS)","code":"S17","type":"scitt","isAccreditedBody":true,"ukprn":"10046003","address":{"addressLine1":"SCITTELS, Colegrave Primary School","addressLine2":"Henniker Road","town":"Stratford","county":"London","postcode":"E15 1JY"},"contact":{"website":"http://www.scittels.co.uk/","email":"David.Nott@colegrave.newham.sch.uk","telephone":"2085340243","fullName":"Recruitment and Selection Tutor"},"location":{"latitude":51.548543,"longitude":0.001612},"trainWithUs":"SCITTELS (School Centred Initial Teacher Training in East London Schools) has twice been graded Outstanding by Ofsted, who described us as providing 'the best possible training'. This is a view shared by current and ex-trainees, employers and partnership schools. We pride ourselves in developing strong relationships with individual trainees and schools. This means we are able to provide personalised training that meets the individual needs of each of our trainees. Each trainee is assigned a Professional Tutor who monitors their progress and well-being throughout the programme and is available to answer any queries through the year. The SCITTELS programme prepares trainees for teaching in diverse, urban environments. While the training programme covers all aspects of a teacher's role, inclusion and behaviour management are particular strengths. The skills you learn on the SCITTELS PGCE will prepare you for teaching whether you choose to stay in East London or move elsewhere. The SCITTELS PGCE is a one year, full-time course. Trainees can choose whether to specialise in Early Years and Key Stage one (ages 3-7) or Key Stages one and two (ages 5-11). It is assessed against 'M' level criteria leading to Qualified Teacher Status and 60 credits at Master's Level. Our PGCE is validated by the Goldsmiths University. We provide a range of employment support to ensure trainees are best-placed to gain their first teaching job. Many PGCE trainees are offered employment at one of their placement schools and almost all secure full-time employment after completing the programme.","trainWithDisability":"The SCITT in East London schools welcomes applications from trainees with disabilities. Colegrave School, where the SCITT is primarily based, is equipped with disabled access and facilities.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:57:07.154Z","updatedAt":"2021-09-15T21:54:06.672Z"}
