{"id":"f23a9c8a-3433-4016-8a60-2a33971ddbb5","name":"Manchester Trusts and Schools Alliance","code":"1JR","type":"lead_school","isAccreditedBody":false,"urn":"144131","ukprn":"10063039","address":{"addressLine1":"Brookburn Primary School","addressLine2":"Brookburn Rd","town":"Chorlton","county":"Greater Manchester","postcode":"M21 8EH"},"contact":{"website":"http://www.manchestertsa.com","email":"learn@manchestertsa.com","telephone":"1618818880","fullName":"Catherine Roberts"},"location":{"latitude":53.4358546,"longitude":-2.2826708},"trainWithUs":"Manchester Trusts & Schools Alliance is led by five legacy teaching schools: Brookburn Primary School, Barlow Primary School, Chorlton Park, Chorlton High School and Sea Shells Trust. The alliance brings together primary and secondary schools across South Manchester, and works in partnership with Manchester Metropolitan University. All MTSA members work together, providing a high-quality teacher-training experience for primary and secondary Associate Teachers.\nWhy train to teach with MTSA?\nAs an Associate Teacher with MTSA, you join a team of staff committed to delivering the highest quality learning and teaching to children in Manchester. You immerse yourself in school life from day one. Your mentors support you fully, using innovative training to enable you to become a resilient, successful and fulfilled professional who can make a difference.\nWhat can MTSA School Direct offer you?\n*Teaching placements in a network of schools in our alliance including a Special School,\n*Cross-phase training experiences throughout the course\n*Trained mentors supporting every aspect of your professional development\n*Professional studies sessions facilitated by outstanding teachers, centred around issues directly related to teaching and learning in inner city contexts\n*Meetings with other associate teachers from a wide trainee network across Manchester\n*Regular pedagogical training sessions at Manchester Metropolitan University\n*Gaining Qualified Teacher Status (QTS), a PGCE, and Masters level credits\n*Support with further professional development in your first year of teaching (NQT)\n*Experiences not offered through the traditional PGCE route, such as INSET training, a wellbeing provision and increased job prospects through establishing direct links with schools","trainWithDisability":"We are very happy to support candidates with disabilities and other needs and have particular experience in supporting candidates with dyslexia.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"812b70c4-7fc4-46fc-975b-3e4d00f77dc4","code":"M40","name":"Manchester Metropolitan University","description":"The Manchester Trusts and Schools Alliance have worked closely with MMU for many years and have forged excellent relationships to ensure our students benefit from our truly collaborative work in partnership.\\r\\n\\r\\nOur leaders actively participate on the steering groups set up by the university and this ensures we work effectively together for the benefit of all our students."}],"createdAt":"2021-07-06T17:49:28.988Z","updatedAt":"2021-09-10T18:46:15.986Z"}
