{"id":"f23f176a-d733-46e3-ace2-122d6c91e5c8","name":"North West SHARES SCITT","code":"N83","type":"scitt","isAccreditedBody":true,"ukprn":"10040125","address":{"addressLine1":"North West SHARES SCITT","addressLine2":"Woodland Primary Teaching School","town":"Heathgate, Skelmersdale","county":"Lancashire","postcode":"WN8 6QH"},"contact":{"website":"www.northwestscitt.com","email":"ddavies@woodland.lancs.sch.uk","telephone":"01695 557488","fullName":"Dawn Davies"},"location":{"latitude":53.5456404,"longitude":-2.7605724},"trainWithUs":"North West SCITT is a leading provider of school-based Initial Teacher Training, with a 100% employment rate over the last 3 years. Over the course of one intense year we nurture and challenge trainees to develop the skills to become highly effective teachers, ready to take up a teaching post in Foundation Stage, KS1, KS2 or SEN provision. Our training programme is entirely school based and our trainee teachers spend 37 weeks in school, learning ‘on the job’, working alongside experienced teachers who mentor them through their training period. What is unique about North West SCITT:\n-\tYou are treated as a ‘future colleague’ and will be trained through a bespoke Individual Training Plan;\n-\tOn completing the programme, you will continue to receive support through our NQT Package during your first year as a teacher;\n-\tWith our eye on ‘future talent’ – our Leadership Ladder will equip you to take on further responsibility and move into school leadership.\nWhat Ofsted (2015) says, “Exceptional leadership and management, everyone shares the same ambitious vision, all are absolutely dedicated to developing inspirational teachers and future leaders for local schools.” What our students say, \"My SCITT training experience has been like nothing I have experienced before. I have thoroughly enjoyed my year with the SCITT family. From start to finish I have been fully supported and given the opportunity to shine whilst recognising my development needs – I cannot wait to continue to grow with NW SCITT on their leadership ladder”.","trainWithDisability":"It is our aim to make our provision accessible to all applicants and trainee teachers. We comply with equality legislation and promote equality of opportunity and aim to avoid discrimination. Applicants with a disability are advised to inform us of any special arrangements they may need prior to the interview date in order that we can make suitable arrangements. Due to our individualised approached to ITT, trainees with a range of disabilities and Specific Learning Difficulties (such as Dyslexia or Dyspraxia) have successfully completed our programme. All schools within our ITT partnership are fully committed to inclusive education for their children and will make reasonable adjustments to enable trainees with disabilities or SpLD to succeed during their training.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:56:46.755Z","updatedAt":"2021-09-01T20:43:38.688Z"}
