{"id":"f2b7cf88-1ee5-4230-a382-9a874f85a675","name":"Bournville Village Primary School","code":"22T","type":"lead_school","isAccreditedBody":false,"urn":"103445","ukprn":"10073745","address":{"addressLine1":"Linden Road","addressLine2":"Bournville","town":"Birmingham","county":"West Midlands","postcode":"B30 1JY"},"contact":{"website":"https://www.bournvillevillageprimary.org.uk/initial-teacher-training-and-continuous-profession/","email":"schoolsdirect@bournvillevillageprimary.org.uk","telephone":"1216759098","fullName":"Martine Mc Corry"},"location":{"latitude":52.429573,"longitude":-1.936638},"trainWithUs":"Bournville Village Primary School has a proven track record of effectively supporting trainees to become effective practitioners. Over the years, almost 100% of our School Direct trainee cohorts have secured permanent posts by the end of their training, often within our Alliance schools. Moreover, every trainee employed has flourished and is still teaching.\nThe feedback from our trainees is always extremely positive and complementary. As a trainee, you will be working with a highly skilled, but also caring and supportive team within a school who will do everything they can for you to succeed. You will be allocated an experienced school-based mentor who will support you during the programme. In addition, there will be opportunities to participate fully in the wider aspects of school life. A hallmark of the success of our trainees is their ability to work collegiately by sharing experiences and offering mutual support.\nOur partner schools across the Bournville alliance reflect the diverse nature of education in Birmingham, ensuring your placements are varied and increase your chances of finding the school that is right for you.","trainWithDisability":"We are experienced in supporting trainees with dyslexia and those with mental health and well-being concerns. Rather than applying a generic process to supporting trainees, our first step is to listen to the specific needs of each individual and tailor support accordingly. For example, an experienced member of our team has worked with an excellent trainee with dyslexia to develop strategies for ensuring lesson resources would avoid errors.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:51:18.302Z","updatedAt":"2021-10-04T17:16:12.635Z"}
