{"id":"f2be5be8-a2ff-4062-8b27-677c514ca81a","name":"Kent Oaks Consortium","code":"2CC","type":"lead_school","isAccreditedBody":false,"urn":"136128","ukprn":"10030458","address":{"addressLine1":"Bradbourne Vale Rd","town":"Sevenoaks","county":"Kent","postcode":"TN13 3LE"},"contact":{"website":"http://www.kentoaksconsortium.co.uk/","email":"kentoaksconsortium@knoleacademy.org","telephone":"01732 454608 ext 333","fullName":"Jo Osborn"},"location":{"latitude":51.286822,"longitude":0.1836571},"trainWithUs":"Our school-based School Direct programme is accredited by the University of Sussex and provides trainees with an opportunity to undertake an outstanding and dynamic initial teacher training in a vibrant primary or secondary school environment. All schools within the consortium, including the lead school, Knole Academy, are based within the west Kent and south east London area and allow trainees to be fully immersed in the daily school routine. Trainees are fully supported during their training through a robust support network of professional and subject mentors based within the placement school and at the University of Sussex. Some key benefits of undertaking a placement within the consortium include:\n* Part-time (over two years) or full-time (over one year) course options available * A range of subjects are available to teach at the secondary school level\n* Numerous primary school teaching placements are available\n* A complementary 4 to 6 weeks placement within a partner school provides trainees with a varied training programme\n* Applicants can apply for a salaried post and start earning money from the beginning of their training\n* Trainees have numerous scholarships, bursaries and funding options available to support them during their training\n* Successful trainees will gain Qualified Teacher Status (QTS) with the option to achieve a Postgraduate Certificate in Education (PGCE) worth 60 Masters level credits\nMore information can be found by visiting the [Kent Oaks Consortium website](http://www.kentoaksconsortium.co.uk/)","trainWithDisability":"The University of Sussex Schools’ Partnership welcomes applications from any candidates who have the potential to make excellent teachers regardless of disability and additional needs. We have previously successfully supported trainee teachers with Dyslexia, Dyspraxia, Autism, Mental Health conditions and a range of physical, hearing and visual impairments.\nAll candidates complete an online health questionnaire administered by the University's Occupational Health Department in the summer before beginning the course. This is to establish mental and physical fitness for teaching. Following this, if you have a disability or health condition, you are then advised to register with the University Student Support service and an assessment is arranged to establish your needs and to identify additional support and adjustments needed to help you be as successful as possible on the course. At all stages we strongly recommend trainees fully disclose their individual needs so a support package can be tailored to each individual.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"4d4cceab-1516-4a6c-a9ab-5de0e32e1fe1","code":"S90","name":"University of Sussex","description":"Offering a Postgraduate Certificate in Education (PGCE) in Primary (ages 5-11) and Secondary (11-16) with specialisms in over eight subjects. For the latter, professional practice is focused on Key Stages 3 and 4. \\r\\n\\r\\nCommitted to high-quality teacher education built upon genuine partnerships, inspired by best classroom practice, and engaged in teaching as an intellectual and ethical vocation. Our goal is to recognise, support and develop a generation of reflective practitioners who are ready, willing and able to improve the life chances of every young person they teach."}],"createdAt":"2021-07-06T17:50:07.966Z","updatedAt":"2021-10-01T17:08:32.464Z"}
