{"id":"f2eb33a1-d224-4e37-b415-21ff0467ca2d","name":"Shireland Teacher Training","code":"13A","type":"lead_school","isAccreditedBody":false,"urn":"135170","ukprn":"10021074","address":{"addressLine1":"Shireland Collegiate Academy","addressLine2":"Waterloo Road","town":"Smethwick","county":"West Midlands","postcode":"B66 4ND"},"contact":{"website":"http://www.shirelandtsa.co.uk/School%20Direct/school.html","email":"Emily.Hughes@collegiateacademy.org.uk","telephone":"0121 558 8086","fullName":"Emily Hughes"},"location":{"latitude":52.4837496,"longitude":-1.9638092},"trainWithUs":"We believe outstanding teachers absolutely make a difference. Here at Shireland we aim to make a difference to the lives and academic achievement of each and every learner. Join us and inspire a love of learning in young people and change attitudes, aspirations, and their lives forever.\n\nSTSA, working in partnership with Birmingham City University, the University of Warwick and Newman University, aims to develop the next generation of outstanding teachers.\n\nOur belief is that through emersion within a school environment trainee teachers will have continual opportunities to relate theory into practice by working alongside outstanding practitioners. \n\nOur unique approach allows trainee teachers to develop the skills and self-awareness needed to become outstanding and remain outstanding, giving them an advantage in their future teaching careers.\n\nTake a look at our website for more info - [shirelandtsa.co.uk](http://www.shirelandtsa.co.uk/)","trainWithDisability":"Shireland Teaching School Alliance welcomes candidates with disabilities and under the Disability Discrimination Act those candidates who disclose their disability have the right to have reasonable adjustments made to enable them to train to teach. If you have any particular needs please contact Emily Hughes via email at emily.hughes@collegiateacademy.org.uk to discuss these arrangements.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:51:04.483Z","updatedAt":"2021-11-01T16:51:50.527Z"}
