{"id":"f305037e-0d4a-49f2-b80f-dabbf56d3bdf","name":"Teach Maidenhead","code":"286","type":"lead_school","isAccreditedBody":false,"urn":"137740","ukprn":"10035798","address":{"addressLine1":"Furze Platt Senior School","addressLine2":"Furze Platt Road","town":"Maidenhead","county":"Berkshire","postcode":"SL6 7NQ"},"contact":{"website":"http://www.teachmaidenhead.co.uk","email":"Debbie.Harding@furzeplatt.net","telephone":"01628 625308","fullName":"Debbie Harding"},"location":{"latitude":51.5359052,"longitude":-0.7405579},"trainWithUs":"Teach Maidenhead was founded in 2013 and provides a unique school based learning opportunity in partnership with the University of Reading. Our partnership consists of five secondary schools (rated outstanding or good) and includes a service which supports children in mainstream educational settings with a diagnosis of Autistic Spectrum Disorder (ASD). All teach students from ages 11-18, giving trainee teachers the opportunity to teach the entire secondary age range. Teach Maidenhead schools are conveniently located, meaning trainees can engage with all five schools in the partnership and experience a diverse and contrasting range of teaching and training practices. Teach Maidenhead works closely with the University of Reading to plan and deliver training programmes. The support provided to trainees is first rate, with intensive subject-based training from experts at the University of Reading and close mentoring from experienced teachers in each school. Another popular feature of our training programme is the weekly professional studies training sessions which involve all trainees, and are led by experts from across the Teach Maidenhead group. Students and staff warmly welcome trainee teachers and recognise their valuable contribution to the school community. Successful trainees have access to opportunities to apply for teaching posts at all five schools, each of which provides an exemplary level of support to NQTs in their first year as well as further career development and opportunities.\nAll trainees gain QTS (Qualified Teacher Status) and PGCE (Postgraduate Certificate in Education) as well as 60 credits towards a Masters Degree.","trainWithDisability":"Teach Maidenhead seeks the best potential teachers and welcomes applications from disabled candidates. Teach Maidenhead will take all reasonable steps to provide access to disabled trainees and applicants who would benefit from disabled access should let us know on their application form so that appropriate arrangements can be considered. Potential applicants are welcome to contact the school prior to application in order to discuss their requirements.\nIn addition, our partner, the University of Reading, has a dedicated Disability Advisory Service which offers advice and guidance to students with any disability, mental health condition, or specific learning difficulty (SpLD). Further information is available on their website and includes definitions of disability, advice on how to prepare before commencing training and information relating to funding support.","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"6439adcc-af64-4d3d-a1da-de045755db06","code":"R12","name":"University of Reading","description":"The University of Reading’s Institute of Education is an established provider of high-quality training and research. They are ranked 7th in the UK for Education (The Guardian University League Table 2020) and have been consistently in the top 10 for over a decade.\\r\\nCommitted to developing caring, reflective, professional teachers, they have well-established partnerships with over 300 schools in Berkshire and the surrounding area. \\r\\nOfsted report that the effective relationships with partner schools support the development of high quality teaching and trainees that are well-prepared to work in the region’s schools. ITE inspection report, September 2016."}],"createdAt":"2021-07-06T17:49:56.626Z","updatedAt":"2021-09-21T22:11:58.082Z"}
