{"id":"f3a03d96-5fd3-4346-9026-c43fb9167284","name":"Kaizen Teaching School Alliance","code":"2AG","type":"lead_school","isAccreditedBody":false,"address":{"addressLine1":"Weald of Kent Grammar School","addressLine2":"Tudeley Lane","town":"Tonbridge","county":"Kent","postcode":"TN9 2JP"},"contact":{"website":"http://www.kaizentsa.org/221/initial-teacher-training","email":"clove@wealdgs.org","telephone":"1732373500","fullName":"Chris Love"},"location":{"latitude":51.1842918,"longitude":0.2809174},"trainWithUs":"The Kaizen Teaching School Alliance is a well established and growing Alliance of West Kent schools, both Primary and Secondary, that offers School Direct salaried and un-salaried teacher training placements. As an Alliance, we are passionate about teaching and learning and committed to providing exceptional world-class initial teacher training. We have a cultural mix of students in our schools who are keen to achieve and we have a number of schools judged by Ofsted to be 'Outstanding'. The Kaizen Teaching School Alliance works closely with our School-Centred Initial Teacher Training provided (SCITT), Kent and Medway Training, to ensure that all of our trainees receive high quality mentoring and following a training programme that is suited to their individual skills and needs. Trainees spend the majority of their training year in the classroom, learning from outstanding teachers, receiving 1-1 subject and professional development and studying the teaching profession. All trainees have the opportunity to experience contrasting schools in their two placements and the majority of our trainees go on to be employed within the alliance. Trainees have excellent opportunities for career development and are supported through further training during their Newly Qualified Teacher (NQT) year. We welcome all enquiries into our School Direct programmes and would urge you to contact us to arrange school experience prior to your application. Further information can be found on the Kaizen Website [http://www.kaizentsa.org/221/initial-teacher-training].","trainWithDisability":"Kaizen and KMT are committed to supporting candidates with disabilities. Please contact Kent and Medway Training for further information. Additional information about how our individual schools cater for disabilities can be found on their websites.","accreditedBodies":[{"id":"757d0dca-c7a9-43c8-8c3b-96c0a81539b6","code":"K30","name":"Kent and Medway Training","description":"Kent and Medway Training (KMT) is a highly regarded and successful Schools Centered Initial Teacher Training Provider (SCITT) which has been training teachers for over 25 years. They work in collaboration with a variety of schools, including those within the Kaizen Alliance. They offer training which leads to Qualified Teacher Status (QTS) and the partnership with Leeds Beckett University gives trainees the opportunity to access a PGCE Top-Up qualification. Trainees learn to teach in the classroom, guided by experienced, current practitioners, which enables them to develop their own skills and techniques, equipping them for their future career."}],"createdAt":"2021-07-06T17:48:51.733Z","updatedAt":"2021-11-04T22:30:35.218Z"}