{"id":"f3a93938-0208-4680-ac22-b564b18ff02b","name":"Durham University","code":"D86","type":"hei","isAccreditedBody":true,"ukprn":"10007143","address":{"addressLine1":"School of Education","addressLine2":"Leazes Road","town":"Durham","county":"County Durham","postcode":"DH1 1TA"},"contact":{"website":"https://www.durham.ac.uk/departments/academic/education/teacher-training/","email":"raa.enquiries@durham.ac.uk","telephone":"0191 334 1000","fullName":"Education Admissions"},"location":{"latitude":54.7779,"longitude":-1.5657519},"trainWithUs":"We are very proud to be one of the leading departments for education in the UK, as we regularly feature in the top five in national university league tables such as 5th in the Guardian University Guide 2020 as well as 3rd in The Times and Sunday Times Good University Guide 2019, and 9th in the Complete University Guide 2020. We also rate highly in the world rankings, 74th in the QS World University Rankings 2019.\n\nAs a Department, we also lead the way in high quality research, 5th in the field of education nationally and joint 1st in the UK for world-leading research impact. Together with our OFSTED outstanding rated Initial Teacher Education provision we are a major contributor in the field of education.\n\nYou can be assured of high quality teaching as we have been awarded the highest possible accolade, Gold, in the Teaching Excellent and Student Outcomes Framework (TEF).","trainWithDisability":"Durham University has a Disability support team who offer advice and guidance to both prospective and current students within the University. We also arrange appropriate provision for disabled students, as well as offer support to those who think they may have a disability.\n\nhttps://www.dur.ac.uk/disability.support/\n\nThe School of Education has successfully supported students with learning disabilities, hearing and visual impairments to obtain QTS and become teachers.\n\nThe School of Education is situated on the Hild Bede site where access can be limited in places for those with a physical disability. Please contact us for more information or check on the Access Go site which has up to date information :\n\nhttps://www.accessable.co.uk/durham-university","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"createdAt":"2021-07-06T17:46:47.553Z","updatedAt":"2021-09-29T15:39:50.021Z"}
