{"id":"f3f8fb12-f81b-40b9-8e59-18333854a8a4","name":"The Priory Learning Trust","code":"2E3","type":"lead_school","isAccreditedBody":false,"urn":"137300","ukprn":"10034815","address":{"addressLine1":"The Priory Learning Trust","addressLine2":"Queensway","town":"Weston super Mare","county":"North Somerset","postcode":"BS22 6BP"},"contact":{"website":"https://www.theplt.org.uk/teaching-school.php","email":"tsa@theplt.org.uk","telephone":"01934 529351","fullName":"Denise Hurr"},"location":{"latitude":51.3637438,"longitude":-2.9100869},"trainWithUs":"The Priory Learning Trust is based in Weston super Mare in the South West of the UK. The Trust is made up of 3 secondary schools - Priory Community School an Academy, Worle Community School an Academy and The King Alfred School an Academy. The Trust is proud to include 5 primary Schools - St Anne's Church Academy, Castle Batch Primary School Academy, Pawlett Primary School Academy, East Huntspill Primary Academy and West Huntspill Primary Academy. The Trust provides education for children aged 3 - 18 across the school sites. The Trust focus is students first, cherishing staff and it is proud to now provide education for 7000 students and employ 700 staff. Those who choose to train with The Priory Learning Trust can look forward to a quality programme which will ensure they are supported and developed by a school based mentor. Delivery of the University content of the PGCE will be delivered on site at Priory Community School, in Plymouth or remotely by specialist staff from across the Trust in alignment with the University of St Mark & St John. Quality Assurance will be provided by the University with University Tutors also supporting and assessing the progress of our trainees.","trainWithDisability":"All school sites in the Trust are fully accessible to wheelchair users. Support can be provided for trainees with dyslexia in relation to assistive technology. All of the schools in the Trust have supporting staff and student mental health at the heart of their provision with a wide range of support available including access to 24/7 counselling and occupational health where required.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"a4e84530-e1f1-47c6-b57e-ec693d629637","code":"P63","name":"Plymouth Marjon University","description":"Plymouth Marjon University is dedicated to preparing the next generation of teachers for the best profession in the world.\\r\\n\\r\\nThe programmes are designed to train trainee teachers to become highly reflective teachers. The Guardian ranks Marjon as 6th best university in the UK for education courses, out of 80 universities, and 1st in Devon and Cornwall. At Plymouth Marjon learning and teaching is underpinned by research, policy and practice. The Complete University Guide 2021 No. 1 in England for student satisfaction. and the National student survey 2021 ranks us as number 1 in England for Learning Community."}],"createdAt":"2021-07-06T17:48:16.989Z","updatedAt":"2021-10-08T18:30:29.431Z"}
