{"id":"f424c037-30a1-4d7b-b4cc-b529ed0a402d","name":"Ladywood School Direct","code":"13D","type":"lead_school","isAccreditedBody":false,"urn":"146406","ukprn":"10077021","address":{"addressLine1":"masefield road, littlelever,","town":"Bolton","county":"Lancashire","postcode":"BL31NG"},"contact":{"website":"http://www.ladywood.bolton.sch.uk","email":"schooldirect@ladywood.bolton.sch.uk","telephone":"1204333400","fullName":"Susan Tailor"},"location":{"latitude":53.5658814,"longitude":-2.3660671},"trainWithUs":"Ladywood is a three times 'Outstanding' school, based within Bolton, Greater Manchester. Ladywood School Direct is an integral part of the overall organisation. Ladywood School Direct programme will be delivered by outstanding practitioners in a highly supportive and aspirational environment. We offer primary placements in both mainstream and special school settings. We aim to transfer your skills, knowledge and understanding into those required for teaching within a primary classroom of tomorrow, by offering a uniquely holistic approach.\nThe majority of training will be facilitated by our Alliance Partners (currently 22 schools) together with Edge Hill University. The programme allows you to take risks and discover your potential in a safe environment. It allows you to be a reflective practitioner whilst focusing on current pedagogy and bringing this to life in the classroom setting. This innovative programme aims to meet the needs of the group and the individual, as well as reflecting the current educational concepts; creating a dynamic and diverse training programme. From day one you will be treated as a fellow professional and receive high quality individual support.\nThe Alliance provides opportunities to teach in both urban and semi-rural settings. You will be joining us and be part of our Alliance’s journey at this exciting and innovative time as we cultivate the next generation of outstanding teachers.\nWe offer a range of Focus areas linked with EHU.\nThis year we will be offering a number of salaried places on our School Direct.","trainWithDisability":"EHU's Inclusion Team provide information, guidance and support to applicants and students who have disclosed any of the following: Autism Spectrum Conditions (ASC), Mental Health, Sensory Impairment, Mobility difficulties or a medical condition e.g. Epilepsy, Diabetes, Heart Condition, Asthma and we work closely with academic and support staff across the University. Learning Services provides support to students with a specific learning difficulty – SpLD, such as Dyslexia. EHU and Ladywood Teaching School encourage disabled applicants to make contact with us early in the application process to enable us to plan for support you may need right from start of your university course. We provide a friendly and professional service and applicants and students can discuss individual requirements in complete confidence. Our highly experienced team are here to advise you about: Impact of disability/health condition and potential impact on study Support available including 1-1 sessions, group support and study skills sessions The benefits of a Student Support Plan Disabled Students Allowance (DSA) and eligibility Reasonable adjustments to support your study Exam modifications and alternative assessments Rights and Responsibilities Support whilst on placement\nDisclosure and Confidentiality Rights and Responsibilities PEEPs and Emergency Action Plans One of our priorities is to ensure safe environment for all students. If you have Epilepsy, Diabetes, Asthma or another serious health condition which may require First Aid, we strongly recommend that you complete one of our Emergency Action Plans. We can discuss this with you when you come to see us.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-12T20:48:56.438Z","updatedAt":"2021-07-22T18:23:03.107Z"}
