{"id":"f43bf51b-2b8b-4272-857e-12a9c389d3f2","name":"BDAT ITT in partnership with Gorse SCITT","code":"3G1","type":"lead_school","isAccreditedBody":false,"urn":"138087","ukprn":"10060130","address":{"addressLine1":"Bradford Diocesan Academies Trust","addressLine2":"2nd Floor Jade Building, Albion Mills, Albion Road","town":"Bradford","county":"Yorkshire","postcode":"BD10 9TQ"},"contact":{"website":"https://www.bdat-academies.org","email":"info@bdat-academies.org","telephone":"01274 909120","fullName":"Nicola France"},"location":{"latitude":53.833071,"longitude":-1.718459},"trainWithUs":"The BDAT ITT mission is to drive school improvement by recruiting and developing thoughtful, reflective trainees. Our partner, GORSE SCITT, is an Ofsted Outstanding teacher training provider rated Outstanding in all aspects of their work.\nBDAT believe that there are no great schools without great staff, and our values reflect this:\nAspiration - We set high expectation for ourselves, our trainees and our staff so that each of us is supported to achieve our own potential. Inclusion. We understand everyone is equal, without exception. We value and encourage diversity and difference. We proactively seek to learn from others.\nExcellence - We provide rigorous support and challenge to our trainees. We strive for excellence in all they do. Compassion - We care for each other. We respect each other and treat our trainees how they would expect to be treated. We make sure they are safe, feel loved and are actively supported at all times.\nResilience - We are ambitious and reflective. We will support our trainees to be determined and brave in making decisions and resilient when facing challenges. We expect our schools to provide them with the skills and knowledge to guide them through their future as lifelong learners.\nWe have partnered with a carefully selected, highly successful and committed provider in GORSE SCITT who share our ethos, and together, we will provide you with a great teacher training experience.","trainWithDisability":"We pride ourselves on the layers of support we provide for our trainees. Each week you will be mentored by a placement mentor who will support you with the planning, delivery and reflection of your lessons, as well as ensuring that you experience your placement as a colleague rather than as a trainee; we also expect our trainees to act like colleagues. You will be mentored and coached each week by a Professional Mentor who will support the development of your classroom pedagogy, and a Subject Lead who will support your subject knowledge development as well as ensuring that you are able to fully deliver your subject curriculum. We are committed to equal opportunities for staff, trainees and prospective Trainees right from the beginning of the admissions process, and throughout the course.\nIf you have a disability or other need please disclose this on the medical questionnaire form you are required to complete during the admissions process. We will discuss your requirements and ensure we allocate appropriate placement schools or make adjustments where necessary.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"59579b9d-79e3-4ab9-a34e-6d11aad8263e","code":"1N1","name":"Gorse SCITT","description":"Over the last nine years, GORSE SCITT has trained over 1600 trainee teachers across all subjects and in both Primary and Secondary phases. As an Ofsted Outstanding provider of Initial Teacher Training, we have worked hard to ensure that our training programme and curriculum is one that we can be proud of, and one that ensures that our trainees are well-prepared for employment in any school, in any context, in any location."}],"createdAt":"2021-09-13T23:58:13.340Z","updatedAt":"2021-10-01T16:44:13.868Z"}
