{"id":"f45337e3-d0cc-4f4e-802f-743ff667b9aa","name":"Latchmere School","code":"1LZ","type":"lead_school","isAccreditedBody":false,"urn":"138689","ukprn":"10037863","address":{"addressLine1":"Latchmere Road","town":"Kingston upon Thames","county":"Surrey","postcode":"KT2 5TT"},"contact":{"website":"www.latchmereschool.org","email":"claire.hogston@ltsalliance.org","telephone":"2085467181","fullName":"Claire Hogston"},"location":{"latitude":51.4227462,"longitude":-0.2945438},"trainWithUs":"Latchmere is a large community school in Kingston and our passion is teaching and learning. We are committed to providing a high quality route into teaching through the School Direct programme. This programme enables you to train on the job whilst receiving pedagogical input through training sessions based at Latchmere or the University. We draw on the latest theories in education and on the expertise across our alliance. We support you from the interview to preparation to start, beginning the programme, the placements and the award of QTS. We hold a 100% employment record over the last 4 years. Of our programme this year, a trainee said, 'Outstanding support from everyone involved with my training. I never felt I couldn't do it because of the support provided. I would recommend school direct as a brilliant way to get into teaching, especially through Latchmere.'","trainWithDisability":"We are an equal opportunities employer. We recruit, train and promote people because of their ability, the needs of the post and other relevant criteria. We treat all employees who apply to us equally. When an applicant has a disability and they meet the essential criteria of the post, they are automatically shortlisted for interview. This positive action helps ensure young people with disabilities get their fair share of jobs. We regularly review our practices and procedures to make sure our equal opportunities policy is working.","accreditedBodies":[],"createdAt":"2021-07-06T17:52:01.149Z","updatedAt":"2021-12-06T21:22:04.580Z"}