{"id":"f4c9b9cf-7429-4284-8574-ec41809c10aa","name":"Waltham Forest Partnership","code":"1AK","type":"lead_school","isAccreditedBody":false,"urn":"103100","ukprn":"10007784","address":{"addressLine1":"209 Blackhorse Road","town":"Walthamstow","county":"London","postcode":"E17 6ND"},"contact":{"website":"www.willowfield-school.co.uk","email":"Debbie.Chapman-Andrews@willowfield-school.co.uk","telephone":"2085274065","fullName":"Debbie Chapman-Andrews"},"location":{"latitude":51.5863009,"longitude":-0.0409091},"trainWithUs":"Willowfield School is the lead school for the School Direct programme in Waltham Forest. All of the Waltham Forest secondary schools work collaboratively on a range of professional development initiatives to recruit, train and develop our teachers in the long term. We have a strong record of training and retaining teachers in our schools with a firm commitment to a \"cradle to grave\" development opportunities. We have worked hard as a partnership to provide our fantastic students with a high quality education and we are the only London borough in which all secondary school's are rated good or above according to Ofsted. Training to teach in Waltham Forest provides trainees with opportunities to experience a variety of different settings: single sex schools, all through schools, sixth forms, faith schools, free schools, academies and local authority schools comprise our Alliance and we endeavour to ensure that all trainees have a varied experience in order to equip them for a long term career. Our students are truly amazing young people and the support and subject expertise of our mentors ensures that trainees are supported and developed to become highly effective practitioners in our diverse and vibrant school communities. We work in partnership with NELTSH (North East London Teaching School Hub)","trainWithDisability":"Training with disabilities and other needs*\nSchool Direct students can access the services provided by both the UEL and UCL support and wellbeing team\nhttps://www.uel.ac.uk/teacher-training/secondary-teacher-training\nhttps://www.ucl.ac.uk/ioe/courses/teacher-training?gclid=CjwKCAjwgISIBhBfEiwALE19Sa33NP-ybOh7jJ84ph1yLmD0sT8WqDdstZmC1BQqBRD39NT_xAiEqRoCIsAQAvD_BwE","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:46:31.612Z","updatedAt":"2021-10-29T17:27:11.066Z"}
