{"id":"f4ff1826-c6a5-4c9a-bdb8-98a0803f453d","name":"ASSET Education","code":"146","type":"lead_school","isAccreditedBody":false,"urn":"141819","ukprn":"10048992","address":{"addressLine1":"St Helen’s Primary School","addressLine2":"Woodbridge Road","town":"Ipswich","county":"Suffolk","postcode":"IP4 2LT"},"contact":{"website":"www.asseteducation.co.uk","email":"SCITT@sthelensprimary.net","telephone":"01473 251333","fullName":"Alison Rees"},"location":{"latitude":52.0575204,"longitude":1.1653242},"trainWithUs":"A Suffolk Schools Education Trust (ASSET) is a primary educational trust consisting of 14 schools based in Suffolk with hubs of schools in the Bungay and Halesworth area of north-east Suffolk as well as in Ipswich and the Shotley peninsula. We have been committed to training teachers for over seven years placing students in schools across the region. Our lead school, St Helen's Primary, is based in the centre of Ipswich and provides additional training in supporting EAL children with its diverse, multi-cultural school setting. Additional SEN training is organised locally through our networks of schools, including one school with and SSC. We work closely with schools both within and outside of the trust. Some of the schools in our network are small, village schools. Others are large primaries based in the centre or outskirts of Ipswich. The majority of our students have gone on to work at one of our schools. Training and accreditation is provided by Suffolk and Norfolk School Centred Initial Teaching Training who offer outstanding primary PGCE programmes through the salaried, tuition and assessment-only routes. Further information is available at http://www.suffolkandnorfolkscitt.co.uk/\nwww.asseteducation.co.uk","trainWithDisability":"Suffolk and Norfolk SCITT supports all trainees based on their individual needs. Recently this has included those with dyslexia, physical, hearing and visual impairments and mental health conditions. Plans are developed with trainees to ensure that they can fully access in centre training, operate effectively on school placement and complete written assignments.\nSuffolk & Norfolk Primary SCITT has full disabled access as do all the schools in the partnership. However, applicants who would benefit from disabled access should let us know on their application so that they can be considered for placements at the most appropriate schools.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"89831af6-535f-471b-aa97-098bd1a93291","code":"S13","name":"Suffolk and Norfolk Primary SCITT","description":"The Suffolk and Norfolk Primary SCITT programme is a personalised, relational and ethical training provider.\\r\\nPrimary SCITT has very high attainment and employment outcomes for trainees. On average 95% of trainees\\r\\nare employed in local schools by the end of their training year.\\r\\nTrainees are supported by school mentors and SCITT Tutors who have a range of experience in schools as\\r\\nclassroom practitioners and often headteachers or members of senior leadership teams, so have a wealth of\\r\\nexperience to share with trainees.\\r\\nThe Primary SCITT course is a highly personalised course which offers a wide range of opportunities to\\r\\ntrainees."}],"createdAt":"2021-07-06T17:49:20.392Z","updatedAt":"2021-09-23T00:10:47.383Z"}
