{"id":"f569af48-7b66-4b13-8d63-3aea58503c3d","name":"St Peter’s London Docks CofE Primary School","code":"1V1","type":"lead_school","isAccreditedBody":false,"urn":"100960","ukprn":"10074014","address":{"addressLine1":"Garnet Street","addressLine2":"Wapping","town":"London","county":"London","postcode":"E1W 3QT"},"contact":{"website":"https://www.stpetersprimary.org.uk/","email":"admin@teachinglondon.org","telephone":"2079321126","fullName":"Elizabeth Dickson"},"location":{"latitude":51.5059609,"longitude":-0.0551817},"trainWithUs":"St Peter’s is a small, friendly, church school in the London Docks area. We are a good school, committed to improving further and with a clear focus on maximising the achievements of our diverse community. We are strongly focused on raising standards through good teaching and learning. We value the positive support of our parents and wider community and strive for an open and welcoming environment where we can work in partnership for the benefit of all our pupils. We seek to provide a Christian education for the children of the parish of St. Peter’s London Docks and for those who elect to come to our school. We see education as being concerned with excellence in learning alongside spiritual and social growth to, develop the individual potential of each child.","trainWithDisability":"St Peter’s is based on one floor with full wheelchair access and are committed to train candidates with a range of additional needs including dyslexia and ASD. Teaching London: LDBS SCITT has a degree of step-free access, but as the building was a Victorian school, we are unable to fully accommodate wheelchair access. We are always willing to discuss, and where possible, adapt to meet individual needs.\nThe well-being of our trainees is paramount, which is why you will be automatically enrolled into the Employee Assistance Programme with the Education Support Partnership. This provides 24/7 individual support and counselling, in addition to our in-house advice and support.\nWe have experience in supporting trainees with a diagnosis of dyslexia and are able to offer specialist support on the course.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"720894da-360a-4f7a-9835-7ce7beb3c6de","code":"L59","name":"Teaching London: LDBS SCITT","description":"An Outstanding provider (Ofsted: 2017), Teaching London puts pupils at the heart of your training. The depth and breadth of our programme enables you to gain the confidence and competence to develop into a highly skilled, responsive teacher. Exciting, interactive and rigorous centre-based sessions will inform your classroom practice, led by inspiring and experienced tutors. Your growth as a reflective practitioner is underpinned by the PGCE element, routed in school-based and current research. \\r\\n\\r\\nTraining teachers for 20+ years, we are highly effective in our role with 76% of trainees graded as Outstanding at the end of their training in 2017-18."}],"createdAt":"2021-07-06T17:56:20.802Z","updatedAt":"2021-07-28T00:57:51.370Z"}
