{"id":"f5823e44-faa4-4924-a880-226f0dfaaf67","name":"Oasis Academy Warndon","code":"7K9","type":"lead_school","isAccreditedBody":false,"urn":"140041","ukprn":"10042953","address":{"addressLine1":"Edgeworth Close","addressLine2":"Warndon","town":"Worcester","county":"Worcestershire","postcode":"WR4 9PE"},"contact":{"website":"https://www.oasisacademywarndon.org/","email":"naomi.cooke@oasiswarndon.org","telephone":"1905453530","fullName":"Emily Hobson"},"location":{"latitude":52.211166,"longitude":-2.185472},"trainWithUs":"Our vision is “Every child a Character Crackerjack with Happy hearts, Enquiring Minds and Promising Futures”\nIn May 2015, we were judged by Ofsted to be ‘good’ in all categories. The report outlined significant strengths and excellent practice in the academy. This is now fully embedded and further enhanced and we consider our provision outstanding in all areas, with a clear and determined focus to maintain this through detailed on-going analysis, excellent CPD and a keen eye on research and development in education.\nWe are a popular and expanding school and have now fully transitioned from two to three form entry. We are an incredibly cohesive community and are extremely proud of who our young people are becoming and what they are able to achieve.\nOur Academy is situated in an area of high deprivation. IMD data showed that more than 50% of our catchment resides in the bottom 1% of deprivation. 36.9% of children in Warndon live in recognised poverty: the second highest ward in Worcester. Children are predominantly of white British heritage (87%) with the next largest group being Other-White (5%). The percentage supported for SEND is above average. Pupils enter Early Years with low starting points (<10% ARE in Nursery in 2018), meet National Expectations by end for KS1 and significantly exceed the national picture by KS2. In 2019 we achieved 77% combined at KS2- 12% above the national average and putting us in the top 10% of schools for progress.","trainWithDisability":"As an academy, we would provide suppport and bespoke training packages to any candidate with a need.\nAs an inclusive, community focussed provider we would strive to support and accomodate any candidate with additional needs.\nAll trainees will be provided with:\nA high quality experienced mentor.\nTime for planning , preparation and assessment.\nHigh quality CPD.\nPersonal coaching sessions to improve and suppport classroom practice.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"62d5803b-89ca-4e21-bb6f-5c74944c56ad","code":"B25","name":"Birmingham City University","description":"We work with Haybridge Alliance SCITT and the PGCE element is undertaken with Birmingham City University."}],"createdAt":"2021-07-06T17:55:34.104Z","updatedAt":"2021-09-16T17:15:19.725Z"}
