{"id":"f63e2e67-93bd-4343-8016-5ccaaa62f12c","name":"Aspire Education Alliance","code":"27K","type":"lead_school","isAccreditedBody":false,"urn":"101219","ukprn":"10075063","address":{"addressLine1":"Warren Junior School, Gordon Road","addressLine2":"Chadwell Heath","town":"Romford","county":"Essex","postcode":"RM6 6DA"},"contact":{"website":"http://www.aspireall.org.uk","email":"aspireall@warren-j.bardaglea.org.uk","telephone":"0208 270 4680","fullName":"Mairead Pryor"},"location":{"latitude":51.5762847,"longitude":0.1423888},"trainWithUs":"Warren Junior School (Aspire Education Alliance) is the Lead School for School Direct in the primary phase including special, offering salaried and tuition placements. Our host schools are good or outstanding schools. We deliver a supportive Professional Study programme, for trainees and mentors, which runs alongside the university PGCE programme.\nWe have a 100% success rate with trainees all transitioning into their NQT year, mostly within the London Borough of Barking and Dagenham. Our purpose built Teaching School building ensures all trainees have an excellent environment to study, with facilitators who are outstanding school leaders and classroom practitioners.\nThe School Direct training programme is open to both top graduates and career changers. It offers talented individuals the chance to be part of a teaching team from day one by combining teacher training with on the job learning. The support and guidance given to all trainees ensure that the placements are successful and work in harmony with the university. Trainees are based in their ‘host school’ for the year with a second placement of up to six weeks in a contrasting age range during the spring term. All mentors are experienced teachers and senior leaders.\nWhy choose School Direct with us?\n* High quality school-based training\n* Train in supportive, creative, good and outstanding schools\n* Outstanding practitioners and lead teachers delivering the programme\n* A proven track record of successful teacher training\n* All trainees will benefit from an experience in a special school setting\n(www.aspireall.org.uk)\n[aspireall@warren-j.bardaglea.org.uk]","trainWithDisability":"We recognise inclusivity and diversity- we support individuals that require special assistance and have additional needs.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:53:38.424Z","updatedAt":"2021-09-30T17:57:47.394Z"}
