{"id":"f652c4be-0c09-4451-9aa3-8cd5b850ca70","name":"Sola Fide Multi-Academy Trust","code":"1NC","type":"lead_school","isAccreditedBody":false,"address":{"addressLine1":"St John’s CE Primary School","addressLine2":"James St","town":"Failsworth","county":"Oldham","postcode":"M35 9PY"},"contact":{"website":"http://www.solafidetrust.org","email":"head@stjohns.oldham.sch.uk","telephone":"1616948096","fullName":"Sophie Nelson"},"location":{"latitude":53.5094593,"longitude":-2.1506269},"trainWithUs":"Sola Fide is a mixed Multi-academy Trust that is able to accommodate all types of schools, church and state, from a full range of differing contexts aligning with the trust’s inclusive, collaborative nature - embracing and meeting the needs of children everywhere. Children are at the centre - they always come first. Children’s futures are entrusted into our hands. We are committed to providing children with a wide range of high-quality learning opportunities enabling them to flourish. Sola Fide expresses is Commitment through Love and Service. The trust is motivated by the desire to make a difference, strategic in its approach and committed to unleashing everyone’s potential. It is our ambition that all schools within Sola Fide impact positively on the communities they serve. The Christian values of love and service are embraced by everyone, effectively built within all practices and processes and therefore practically demonstrated throughout the Trust, epitomising ‘love in action.’ There is a genuine willingness to share with others. We believe that when one gives freely, everyone gains and grows. To this end, Sola Fide has a Teaching School supporting schools locally, regionally, nationally, internationally and globally, and is an academy Sponsor.","trainWithDisability":"The Wellbeing and Disability Service at the University of Huddersfield works with students with a range of disabilities and long-term conditions that have a significant impact on their ability to study. This includes specific learning difficulties such as dyslexia, long-term medical conditions such as diabetes, mobility or physical disabilities or conditions, hearing impairments, visual impairments and social communication difficulties such as autistic spectrum conditions or mental health issues. Our main aim is to work alongside you to get the right support in place at the right time as we believe that nothing should stop you achieving what you're capable of. For more information please email disability@hud.ac.uk.","accreditedBodies":[{"id":"791f82c8-19fd-4339-9c7b-301dee8067ce","code":"H60","name":"University of Huddersfield","description":"The University of Huddersfield has an impressive track record of producing highly skilled teachers, training around 1,500 every year with local and national partners. They operate strong, credible partnerships with local and national education providers, including leading The Education and Training Consortium consisting of 21 regional partners. \\r\\nTogether, academics, researchers and partners within schools work to ensure our trainees are able to equip themselves with the most relevant and up to date skills. By studying with the University of Huddersfield, you’ll join an inspiring, passionate and committed community focused on making your studies as enjoyable, rewarding and productive as possible."}],"createdAt":"2021-07-06T17:48:26.673Z","updatedAt":"2021-07-06T17:48:26.673Z"}