{"id":"f6f54f95-7d0c-4cb5-ab28-c2c95568990f","name":"Woodrush Training Consortium","code":"21T","type":"lead_school","isAccreditedBody":false,"urn":"136924","ukprn":"10034168","address":{"addressLine1":"Shawhurst Lane","addressLine2":"Wythall","town":"Birmingham","county":"West Midlands","postcode":"B47 5JW"},"contact":{"website":"http://www.woodrushtc.co.uk","email":"trainingconsortium@woodrush.org","telephone":"1564823777","fullName":"Woodrush High School"},"location":{"latitude":52.388577,"longitude":-1.878189},"trainWithUs":"Woodrush Training Consortium is an excellent place to start your teaching career. We aim to develop outstanding practitioners who are creative, highly effective and exceed the professional standards. Educational theory, innovative research and outstanding pedagogy are the foundations of our highly successful training programme. Early career teachers regard highly the support that they receive from Woodrush. This was recognised by Ofsted in 2018 who said that early career teachers 'feel fully supported as they develop their skills in teaching and managing pupils’ behaviour. They value the quality of the training and the way in which leaders encourage them to be reflective practitioners. Through this support, newly qualified teachers are able to speak with passion and knowledge about a range of educational topics. All newly qualified teachers spoken to said that they are proud to work at the school'. ​\nWoodrush High School, the lead in our consortium, is an 11-18 school on the border of Birmingham and Worcestershire. We place an emphasis on ensuring all of our students achieve the qualifications, and equally important the life skills, to be successful in the world we live in. We have hardworking and well qualified staff who are dedicated to delivering an ever-changing curriculum in a vibrant and exciting way. The curriculum we offer is broad, balanced and inspires students to learn. Staff at Woodrush work as a close and effective team, sharing good practice and providing support for each other. High quality coaching and mentoring is a strength across our consortium.","trainWithDisability":"We welcome our duties under the Equality Act 2010 to eliminate discrimination, advance equality of opportunity and foster good relations in relation to age (as appropriate), disability, race, gender reassignment (maternity and pregnancy), religion and belief, sex and sexual orientation.\n\nTreating people equally does not necessarily involve treating them all the\nsame. Our policies, procedures and activities must not discriminate but must nevertheless take account of differences of life-experience, outlook and background, and in the kinds of barrier and disadvantage which people may face,","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"accreditedBodies":[],"createdAt":"2021-07-06T17:48:21.973Z","updatedAt":"2021-10-08T15:55:44.492Z"}
