{"id":"f7203006-bdab-499b-8b56-8db91360b722","name":"Calderdale and Kirklees Teaching School Hub","code":"1ZG","type":"lead_school","isAccreditedBody":false,"urn":"137352","ukprn":"10035022","address":{"addressLine1":"Shelley College","addressLine2":"Huddersfield Road","town":"Huddersfield","county":"West Yorkshire","postcode":"HD8 8NL"},"contact":{"website":"https://www.ckteachingschoolhub.org/","email":"cktsh@sharemat.co.uk","telephone":"01484 868762","fullName":"Rebecca Hesmondhalgh"},"location":{"latitude":53.592721,"longitude":-1.66578},"trainWithUs":"The Calderdale and Kirklees Teaching School Hub is a growing partnership of schools and institutions in West Yorkshire. Lead School is Shelley College (Secondary) and was designated a Teaching School in 2014. Our passion is to ensure the children and young people in all our schools achieve their personal best.\nMost of our partners are judged to be at least “good” by OFSTED and many of these are ‘outstanding’. Our aim is to promote our strengths, and to enable schools in the local community and beyond to make significant improvements in the quality of their leadership, teaching, talent, staffing capacity and pupil progress.\nAcross our partner schools there are Subject Experts, Specialist Leaders of Education, Excellent Practitioners, trained Coaches and Mentors. We provide all our ITTs with high quality support throughout their training year. Our Alliance schools encompass the full age range from 3 to 18. Trainees may be offered the opportunity to gain experience in post 16 education. Our schools share skills, experience, talent and capacity to help improve the learning and achievements of young people across the region and beyond. At Calderdale and Kirklees Teaching School Hub, we encourage our trainees to develop their individual teaching style. We want to inspire those we work with; pupils, teachers and leaders to achieve their personal best. We are dedicated to the development of teachers throughout their career, from Initial Teacher Training within the hub, through to leaders of schools. For further information visit our website:\nWebsite: (https://www.ckteachingschoolhub.org/)","trainWithDisability":"At the hub, we welcome applications from individuals with disabilities, recognising the valuable and important contribution individuals bring to school life. We will always seek to ensure individuals with disabilities and other needs are supported during their placement. We adhere to The Equality Act 2010 and Special Educational Needs and Disability Act 2001, which require teacher training providers to ensure they are not discriminating against applicants with disabilities or special educational needs (SEN).\nAll our partner Schools value diversity and the unique contribution that all their staff and trainees bring.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:47:02.554Z","updatedAt":"2022-02-07T22:57:45.066Z"}
