{"id":"f761c87d-497d-4b8e-9b11-2540e666f13f","name":"Northern Teacher Training Hub","code":"1YQ","type":"lead_school","isAccreditedBody":false,"urn":"137831","ukprn":"10036293","address":{"addressLine1":"Northern Teacher Training Hub C/O Benedict Biscop CE Academy","addressLine2":"Marcross Drive","town":"Moorside","county":"Sunderland","postcode":"SR3 2RE"},"contact":{"website":"https://northernlightstsh.co.uk/itt-initial-teacher-training/","email":"bbaht@nllt.co.uk","telephone":"0191 5947033","fullName":"Rachel Hunt"},"location":{"latitude":54.8643737,"longitude":-1.4260995},"trainWithUs":"Training at the Northern Teacher Training Hub is provided in partnership with Durham SCITT (School Centred Initial Teacher Training) and is based in the lead school Benedict Biscop CE Academy which is an Outstanding Primary School, part of Northern Lights Learning Trust. Durham SCITT, our accredited body, provide ITT for the region of Sunderland, Gateshead and South Tyneside as well as wider partners in Durham and the Tees Valley. We work closely in partnership with partner schools and provide a unique school-based learning opportunity. All partnership schools are rated as ‘good’ or ‘outstanding’ by Ofsted, meaning you really are learning from the best. You will be trained in a highly supportive and aspirational environment and will develop the rigour, professional knowledge, understanding and skills necessary for the delivery of creative, purposeful and challenging teaching and learning. We believe that our innovative model provides the perfect platform to develop the outstanding teachers of the future. The staff you work with have a proven track record in training and professional development. Our teachers are outstanding practitioners with exemplary behaviour management skills and are eager to share their skills, knowledge and practice with the next generation of teachers. Our course aims embedding, you, the trainee in the heart of a school. You will start the year in school on the first day of term and work the life of a teacher for three terms. You will benefit from a professional and social life that reflects the school community you are placed in.","trainWithDisability":"We have an inclusive approach to all trainee teachers and their learning needs, offering additional support throughout the year, should it be required.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"99d7311e-6bc7-4ef3-a36b-72a3ff429155","code":"D87","name":"Durham SCITT","description":"Durham SCITT have been training teachers since 2005. It’s the personal attention they give to trainees which makes this provider different from the rest. Durham SCITT pride themselves on the bespoke approach offered. There is no such thing as a “typical trainee” so we don’t provide a one-size-fits-all course. The programme was recognised by Ofsted as outstanding in 2014."}],"createdAt":"2021-07-06T17:48:21.341Z","updatedAt":"2021-10-13T16:38:56.957Z"}
