{"id":"f77dcbe7-9944-4965-b5e1-14548b5ea8c0","name":"Ashton Teacher Training Partnership","code":"29O","type":"lead_school","isAccreditedBody":false,"urn":"146816","ukprn":"10082366","address":{"addressLine1":"Ashton Sixth Form College","addressLine2":"Darnton Road","town":"Ashton-under-Lyne","county":"Greater Manchester","postcode":"OL6 9RL"},"contact":{"website":"https://www.asfc.ac.uk/university-courses/primary-pgce-school-direct","email":"sharron.galley@asfc.ac.uk","telephone":"0161 3302330","fullName":"Lynette Grindley"},"location":{"latitude":53.4915466,"longitude":-2.0760181},"trainWithUs":"Our award-winning campus covers over 6 acres in the Tameside borough of Greater Manchester. There are good links to public transport, the campus is a short journey from both Ashton and Stalybridge Train Station, Ashton tram stop and Ashton Bus Station.\nAshton Sixth Form is rated as an 'Outstanding' provider by Ofsted. As a trainee teacher with us you would receive individualised support and the benefit of being part of a small, nurturing team. On your college professional development days, you will receive training from Sharron Galley, an experienced PGCE lecturer who was previously a primary school teacher. Your training in college will also be supported by subject experts who deliver lectures and workshops to develop your subject knowledge. Ashton Teacher Training Partnership has built up strong partnerships with primary schools to ensure our trainees receive the very best teaching practice experiences. You will be supported by an experienced mentor (who is often the class teacher you are working with) who will help you to develop all aspects of your classroom practice through regular feedback meetings and target-setting. Within the Ashton Teacher Training Partnership, we have a proven track record of producing qualified primary school teachers; many of whom have gone on to teach in local schools.","trainWithDisability":"Our experienced and professional Inclusive Learning Team provide specialist support if you have specific learning needs. The breadth of support is extensive, from learning difficulties to accessibility, and so much more. Every student’s needs are different and Inclusive Learning ensure that support is there for anyone who may need it.\nInclusive Learning help students who have:\nSpecific Learning Differences\nAutistic Spectrum Disorders\nSocial and emotional difficulties\nA Hearing Impairment\nA Visual Impairment\nPhysical and/or Medical Conditions\nInclusive Learning will also support any students who are having problems with:\nPlanning and Organisation\nSPaG\nStudy skills and revision techniques\nWriting skills and proofreading","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"8796f284-20bb-4ad7-a6e6-cd40fc05fb2d","code":"25F","name":"Associated Merseyside Partnership SCITT","description":"The Associated Merseyside Partnership SCITT (AMP) is a strong and collaborative partnership of schools in Merseyside and the wider area with a number of distinctive features that contribute to diversity and choice for our trainees."}],"createdAt":"2021-07-12T20:49:13.526Z","updatedAt":"2021-09-20T18:02:04.106Z"}
