{"id":"f7a98beb-5743-422f-972b-cf4fc4be420a","name":"Holmes Chapel Comprehensive School","code":"1PN","type":"lead_school","isAccreditedBody":false,"urn":"137449","ukprn":"10035146","address":{"addressLine1":"Selkirk Drive","addressLine2":"Holmes Chapel","town":"Holmes Chapel","county":"Crewe","postcode":"CW4 7DX"},"contact":{"website":"http://www.chimneyhousealliance.co.uk","email":"lorraine.mellish@hccs.info","telephone":"01477 410544","fullName":"Karen Fuller"},"location":{"latitude":53.1975214,"longitude":-2.3681938},"trainWithUs":"Holmes Chapel Comprehensive School is the lead school in The Chimney House Alliance (CHA) with a well-established partnership with The Manchester Metropolitan University. The CHA has a strong track record of collaborative working within ITT including School Direct. This route is designed to maximise the time a trainee spends in school, both on teaching placements and training conferences to ensure a diverse and contrasting range of teacher training experiences.\nThe CHA is well established and consists of eight 11-18 schools - including a free school and single sex school, six 11-16 schools, a Special School and core primary schools - large, small, urban and rural. Some have achieved outstanding Ofsted ratings. Our core purpose is to ensure that children learn and achieve and to prepare them for a changing world and the Alliance's Mission is 'Raising achievement through collaboration'. Staff and students are ambitious and confident and benefit from the extensive Continuous Professional Development programmes we have on offer, from entering the profession as a trainee to becoming a head teacher. We have established an environment in which staff, students and trainee teachers feel valued and supported. We have worked with trainee teachers for many years and were the first training school consortium in the country. We offer both a one-year Primary PGCE and a range of secondary PGCE specialisms, including national shortage subjects. Our expectations are high and our learning environment is fun yet challenging.","trainWithDisability":"All our schools in the partnership, with the exception of Sandbach High School and Sixth Form College have full disabled access as does The Manchester Metropolitan University.","accreditedBodies":[{"id":"812b70c4-7fc4-46fc-975b-3e4d00f77dc4","code":"M40","name":"Manchester Metropolitan University","description":"The Manchester Metropolitan University, which has national recognition for its high quality Initial Teacher Training provision."},{"id":"4daac859-d081-45ad-834c-4237f112924a","code":"25Q","name":"Cheshire East SCITT","description":""}],"createdAt":"2021-07-06T17:50:35.644Z","updatedAt":"2021-07-06T17:50:35.644Z"}
