{"id":"f7b9f762-b988-4a87-8364-313534a9c54e","name":"Goldington Academy","code":"2DM","type":"lead_school","isAccreditedBody":false,"urn":"136552","ukprn":"10033281","address":{"addressLine1":"Goldington Academy","addressLine2":"Haylands Way","town":"Bedford","county":"Bedfordshire","postcode":"MK41 9BX"},"contact":{"website":"https://www.goldington.beds.sch.uk/about/initial-teacher-training","email":"chapmanl@goldington.beds.sch.uk","telephone":"01234 261516","fullName":"Leanne Chapman"},"location":{"latitude":52.144792,"longitude":-0.444047},"trainWithUs":"\"Goldington Academy is a very welcoming school where pupils achieve well. Pupils, from the youngest to the eldest, and from varying backgrounds, work together with respect for one another and the staff. Pupils feel a sense of belonging at Goldington Academy, and consequently, they are well placed to learn and achieve.\" Ofsted 2015\nGoldington Academy is an ambitious and aspirational school where student success is at the heart of all decision making. The school's accommodation and facilities are excellent following a recent DfE funded refurbishment. All of our classrooms are equipped with interactive technologies. There are extensive specialist facilities for Art, Computer Science, Design Technology, Drama, Cooking and Nutrition, Music and Science. Sports facilities include a gymnasium, a sports hall and an all-weather mutli-use games.\nAt key stage 3 all students study English, Maths, Science, Humanties, French, Art, DT, Computing, PE, Drama and Music. Year 9 students also follow a personalised learning programme allowing them to study areas of special interest.\nStudents start GCSE courses in Year 10 spending 18 periods studying compulsory subjects – English Language and Literature, Maths, History/Geography, Science and PE. Six periods are spent studying optional subjects - Art, Computer Science, Creative I Media, DT, Drama, Hospitality and Catering, French, Music, PE, RS and Spanish and Travel and Tourism.\nGoldington Academy have experience of successfully working with trainee teachers. Where positions arise, we have a strong record in regards to the employment of our trainee teachers as members of staff on completion of the course.","trainWithDisability":"Goldington Academy is a fully accessible site.\n\nThere are designated Mental Health and Wellbeing leads for staff.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:47:42.236Z","updatedAt":"2021-09-07T20:04:13.196Z"}
