{"id":"f7d8c641-454e-431a-ad3c-f1b596f86547","name":"The Oldham Academy North","code":"2KG","type":"lead_school","isAccreditedBody":false,"urn":"136115","ukprn":"10030433","address":{"addressLine1":"Broadway","addressLine2":"Royton","town":"Oldham","county":"Lancashire","postcode":"OL2 5BF"},"contact":{"website":"https://theoldhamacademynorth.e-act.org.uk/","email":"liza.miles@toan.e-act.org.uk","telephone":"0161652 2428","fullName":"Liz Miles"},"location":{"latitude":53.5599235,"longitude":-2.1261956},"trainWithUs":"Our aim is to develop the next generation of outstanding teachers for Oldham and Greater Manchester. The lead school is The Oldham Academy North, a mixed 11-16 school serving over 1200 students from across Oldham. A 2016 ONS study found Oldham to be the most deprived town in England; it is the mission of TOAN to address that inequality and deliver outstanding educational outcomes for our young people. Our most recent Ofsted was in March 2020 where we received a Good rating. The report said, 'The Oldham Academy North is a school which lives and breathes cultural diversity and inclusivity' and that 'pupils behave well and try hard in class'. School leaders ' leaders work with purpose and pace, to secure pupils’ bright futures'.\nTOAN is a vibrant and exciting place to be for both staff and students. We have a relentless focus on having the highest standards in all aspects of Academy life, and we expect the very best from all of our staff and students. We strive to make sure that every child leaves us with the skills and qualifications to be successful in the challenging and competitive world around us; our students are provided with opportunities to add to their cultural capital, pursue their interests and achieve their ambitions.\nWe have excellent facilities at TOAN: a number of updated ICT suites, a lecture theatre, brand new facilities for sports, music, drama, art and a range of technologies as well as our broad and balanced curriculum.","trainWithDisability":"E-ACT and The Oldham Academy North are firmly committed to the principles of equality, diversity and inclusion in both employment and the accessibility and delivery of services. We welcome applications from all suitably qualified persons regardless of their race, sex, disability, religion/belief, sexual orientation or age.\n\nThe Oldham Academy North provides access to occupational health and employee assist services. Flexible working can be negotiated. Reasonable adjustments can be put in place to support access to the training course.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:47:14.614Z","updatedAt":"2021-10-22T15:50:49.877Z"}
