{"id":"f826f61a-9bfc-4086-b9a1-39d544177893","name":"St Mary’s CofE Primary School","code":"29Y","type":"lead_school","isAccreditedBody":false,"urn":"102139","ukprn":"10071424","address":{"addressLine1":"Church Lane","town":"London","county":"London","postcode":"N8 7BU"},"contact":{"website":"http://www.stmarysn8.co.uk","email":"admin@teachinglondon.org","telephone":"2079321126","fullName":"Fran Hargrove"},"location":{"latitude":51.587171,"longitude":-0.114852},"trainWithUs":"St Mary’s is based on two sites in Hornsey, with excellent facilities, green space, a football pitch and a pond.\nWe are a large, skilled staff with a very strong sense of family. We strive for the best so that children feel secure, inspired, supported and confident. We want all children to have the opportunity to realise their special talents and abilities. We foster strong partnerships with families so that parents and carers can be actively involved in all areas of their children’s learning and development.\nWe aim to show our children the importance of tolerance, understanding and mutual respect within our diverse community. We have built strong links so that our children are able to work and learn in the wider local environment and help to contribute to the area in which they live.","trainWithDisability":"As a lead school we have the facilities and the expertise to support applicants with a range of disabilities and would encourage those interested in becoming a teacher to get in contact.\nTeaching London: LDBS SCITT has a degree of step-free access, but as the building was a Victorian school, we are unable to fully accommodate wheelchair access. We are always willing to discuss, and where possible, adapt to meet individual needs.\nThe well-being of our trainees is paramount, which is why you will be automatically enrolled into the Employee Assistance Programme with the Education Support Partnership. This provides 24/7 individual support and counselling, in addition to our in-house advice and support.\nWe also have experience in supporting trainees with a diagnosis of dyslexia and are able to offer specialist support on the course.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"720894da-360a-4f7a-9835-7ce7beb3c6de","code":"L59","name":"Teaching London: LDBS SCITT","description":"An Outstanding provider (Ofsted: 2017), Teaching London puts pupils at the heart of your training. The depth and breadth of our programme enables you to gain the confidence and competence to develop into a highly skilled, responsive teacher. Exciting, interactive and rigorous centre-based sessions will inform your classroom practice, led by inspiring and experienced tutors. Your growth as a reflective practitioner is underpinned by the PGCE element, routed in school-based and current research. \\r\\n\\r\\nTraining teachers for 20+ years, we are highly effective in our role with 76% of trainees graded as Outstanding at the end of their training in 2017-18."}],"createdAt":"2021-07-06T17:49:26.643Z","updatedAt":"2021-07-28T00:48:14.635Z"}
