{"id":"f83184c0-eda1-4c5b-a6b4-5954bf7c6e66","name":"The Havering Teacher Training Partnership","code":"H17","type":"scitt","isAccreditedBody":true,"ukprn":"10059123","address":{"addressLine1":"Bower Park Academy","addressLine2":"Havering Road","town":"Romford","county":"Essex","postcode":"RM1 4YY"},"contact":{"website":"www.haveringteachertraining.co.uk","email":"aaslan@elatschools.co.uk","telephone":"01708 255006","fullName":"Amanda Aslan"},"location":{"latitude":51.60509,"longitude":0.1802872},"trainWithUs":"The HTTP SCITT programme is school based route to QTS . Trainees benefit from working with highly experienced classroom practitioners in a supportive school environment. Havering is a successful outer London Borough and almost all local secondary schools are partners. As a result we are able to carefully match trainees to a suitable school department ensuring that aspiring teachers have the best possible start.\nOur training sessions are provided by practising expert teachers from Partnership schools. They are thematically structured to equip trainees with excellent skills and knowledge to become confident practitioners. The programme has established an enviable reputation and is well regarded by head teachers: our long term employment figures are exceptionally strong. Most central training sessions will be at Bower Park Academy in a suite of dedicated rooms but others will take place in a variety of appropriate settings to widen our trainees experience. Our programme is current and challenging; we are passionate about teaching and learning and we lead by example. Training is held weekly and our cyclical programme ensures that trainees have time to apply new skills, knowledge and strategies learned to the classroom. Fortnightly subject specific training is delivered by our highly skilled team of Subject Leaders to develop subject pedagogy. We are proud of our course and our network of schools and are delighted that our most recent OFSTED inspection validated this position. Our aim is to provide the highest quality entrants to the profession to make a difference to the lives of students.","trainWithDisability":"We welcome trainees with disabilities and other special needs. In recent years Havering schools have been modified in order to improve disabled access. Applicants who would benefit from disabled access should let us know in their application so that they can be considered for placements at the appropriate schools.\nHTTP has a partnership with \"Havering Mind\" who provide us with training, advice and support. Where Trainees have experienced problems they have been helped with personalised support tailored to their specific needs.\nA senior member of HTTP staff works closely alongside each trainee and small tutorial groups ensure personal attention. Training sessions are held weekly which guarantees regular contact with other training teachers. Past trainees have remarked upon the valuable personal support received during those challenging periods inevitable whilst training as a secondary school teacher.\nOur most recent Ofsted Report identified as a key strength: 'The high level of individual support, and adaption of the programme in response to individual needs.'","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:54:34.637Z","updatedAt":"2021-10-07T21:14:56.014Z"}
