{"id":"f8337932-0749-4e5e-8ac5-3bdb2b9c111d","name":"LEAD Teaching School Hub Lincolnshire","code":"1DK","type":"lead_school","isAccreditedBody":false,"urn":"12345","ukprn":"12354678","address":{"addressLine1":"L.E.A.D. Academy Trust, Manor Farm Academy","addressLine2":"Tiber Road","town":"North Hykeham","county":"Lincoln","postcode":"LN6 9ST"},"contact":{"website":"https://leadequatetsa.co.uk/","email":"stacey@equatetsa.co.uk","telephone":"1522214459","fullName":"Matt Lawrence"},"location":{"latitude":52.9552927,"longitude":-1.1615491},"trainWithUs":"Everything we do in our schools is about giving children a high quality education. We celebrate the fact that all children are unique and we have high aspirations for all their futures. At L.E.A.D. Equate we are committed to high quality training that impacts on the learning experiences of every child’s education.\nWe work closely with the University of Nottingham to design and develop an innovative Initial Teacher Training programme linked with our specialism of high quality teaching in a variety of educational settings. All trainee teachers within our alliance meet half termly to engage with our enhanced and enriched curriculum. This is delivered by outstanding practitioners from our schools. This is an opportunity for you to consider your development as a teacher and reflect upon practice within different settings. Past trainees have found these sessions invaluable and a majority of trainees have gone on to secure successful teaching positions within one of our 25 Trust based schools. As a trainee teacher in our alliance, you will learn from the best teachers, supported by a culture of coaching and mentoring. All trainee teachers observe outstanding teaching and get to work alongside the best teachers in an apprenticeship role.","trainWithDisability":"L.E.A.D. Equate has a duty of care to find out if trainees have a disability or medical condition. This may include aspects such as dyslexia, mental health or long-term physical impairments. In that way we can make sure that students are offered the support they need to successfully access the programme. In declaring the level of need, reasonable adjustments can then be made to suit the needs of the applicant. We do not view disability as a barrier to teaching effectively and we will endeavour to ensure that all candidates can access the training programme and go on to teach successfully within a setting.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:46:30.040Z","updatedAt":"2021-10-29T17:56:06.284Z"}
