{"id":"f8616aa4-b54a-4118-91e2-6771f33775c4","name":"Advance Learning Partnership","code":"2AL","type":"lead_school","isAccreditedBody":false,"urn":"137903","ukprn":"10059549","address":{"addressLine1":"Advance Learning Partnership","addressLine2":"Whitworth Lane","town":"Spennymoor","county":"Durham","postcode":"DL16 7LN"},"contact":{"website":"alplearning.org.uk","email":"c.taylor@alplearning.org.uk","telephone":"01388 825 285","fullName":"Catherine Taylor"},"location":{"latitude":54.6950236,"longitude":-1.6144219},"trainWithUs":"By choosing to train to teach with the Advance Learning Partnership you will learn first-hand from outstanding teachers and be immersed in school life from the outset of the course.\nAdvance Learning Partnership is a not-for-profit Multi Academy Trust consisting of a mix of primary and secondary academies across the north-east. All academies within our trust work closely with each other as a ‘family of schools’. The trust as a whole is not a separate body or group of people, but rather one single organisation made up of all our academies with one single vision and shared set of values. We work together to ensure that all children, irrespective of their starting point, receive an excellent education. Whether you are a new graduate, about to graduate or you are considering a career change, our school direct initial teacher training courses, will provide you with the foundation you need for your career in teaching.\nOur School Direct Programme\nOur route offers trainees an extended professional practice placement in one main school, supplemented by an additional placement (around 6 weeks) in another ALP school. Trainees will also spend time at Durham SCITT working in their purpose built training centre with their team of subject specialists, attending general professional study sessions and following a programme of enhancements. This ensures an experience of teaching in different settings.","trainWithDisability":"At ALP we pride ourselves on the personal approach and fully support candidates with disabilities during the interview process and throughout the course. The Occupational Health Service provides an assessment and advisory service on the occupational health aspects of trainees. As part of the recruitment process, you will be required to complete an Occupational Health questionnaire and, if any needs are identified, they will be followed up.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"99d7311e-6bc7-4ef3-a36b-72a3ff429155","code":"D87","name":"Durham SCITT","description":"Durham SCITT has been training teachers since 2005. It’s the personal attention we give to our trainees which makes this a great place to learn. We pride ourselves on the personal approach. We know there is no such thing as a “typical trainee” so we don’t provide a one-size-fits-all course. We will help you to grow and become a great teacher. Our secondary Subject Specialist programme (SSP) was recognised by Ofsted as outstanding and highly innovative practice.\\r\\nHigh quality trainees, impressive employment rates and effective partnerships with schools, mean we are in the position to offer outstanding teacher training."}],"createdAt":"2021-07-06T17:49:50.573Z","updatedAt":"2021-09-23T23:19:29.540Z"}
