{"id":"f8964237-2d91-4b66-a571-9ffb72db6d0a","name":"University of Brighton Academies Trust School Direct Programme","code":"2FU","type":"lead_school","isAccreditedBody":false,"urn":"136400","ukprn":"10000886","address":{"addressLine1":"University of Brighton, Exion 27","addressLine2":"Crowhurst Road","town":"Brighton","county":"East Sussex","postcode":"BN1 8AF"},"contact":{"website":"https://www.brightonacademiestrust.org.uk/careers-and-training/train-to-teach","email":"enquiries@brightonacademiestrust.org.uk","telephone":"01273 082005","fullName":"Samantha Coates"},"location":{"latitude":50.8695524,"longitude":-0.1223966},"trainWithUs":"The University of Brighton Academies Trust is a network of 15 academies in Sussex all supporting each other – and our pupils – to excel.\nWe believe that education transforms lives. Enriched by the University of Brighton's contribution, we want to ensure that our 7,500 pupils are inspired to meet their potential and develop a passion for life-long learning. School Direct is a year-long postgraduate teacher training programme. Trainees spend more time in the classroom, putting theory into practice and gaining confidence-boosting experience.\nBased in one of our academies in Sussex you’ll benefit from a tailored training programme, with personalised support from highly experienced teachers and tutors. You’ll also attend training sessions at the University of Brighton, rated by Ofsted as an outstanding provider of initial teacher training.\nWe hope that once your training is complete, you’ll decide to continue your teaching career with us. With three large secondary schools, primaries with a range of specialisms from a forest school to expanding infant provision, we’re confident that there will be an opportunity to suit you and your career aspirations.","trainWithDisability":"Our academies are highly inclusive, and we welcome applications from candidates with disabilities and other needs. We are a Disability Confident Committed employer. Almost all of our academies are fully accessible.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:54:25.023Z","updatedAt":"2021-08-18T19:55:16.997Z"}
