{"id":"f8a389ed-1e76-445c-8d11-34e8979ed40e","name":"Leeds SCITT","code":"L26","type":"scitt","isAccreditedBody":true,"ukprn":"10003863","address":{"addressLine1":"Brownberrie Lane","addressLine2":"Horsforth","town":"Leeds","county":"West Yorkshire","postcode":"LS18 5HD"},"contact":{"website":"http://www.leedsscitt.org.uk","email":"admissions@leedstrinity.ac.uk","telephone":"0113 283 7268","fullName":"Leeds SCITT"},"location":{"latitude":53.8485578,"longitude":-1.6480962},"trainWithUs":"Leeds SCITT are one of the longest operating SCITTs in West Yorkshire with enviable employment rates. We work in close partnership with Leeds Trinity University, all of our secondary teacher training courses offer both QTS and a Professional Graduate Certificate of Education (PGCE) (FHEQ Level 6). However, our trainees are registered to study for a Postgraduate Certificate in Education qualification (PGCert) (FHEQ Level 7). L6 & L7 awards are from Leeds Trinity University.\nAll PGCE courses with Leeds SCITT are offered in the 11-16 age range with the opportunity to experience teaching at post-16 level.\nAs a Leeds SCITT trainee, you will be immersed in the school environment from week one and you will be seen as a professional by school staff, pupils and parents. This allows you to take the theory, thinking and research and implement this in the classroom, ensuring you develop your ‘teacher’ persona as quickly as possible.\nOur courses are divided into three main stages. The Lead School Experience is spent predominantly in your Lead School with the other trainees in your subject and this is where you will begin your teaching of classes in pairs or individually. Stage A is when you start your first full time teaching placement in a partnership school, teaching a reduced timetable with support and guidance from your Subject Mentor.\nFinally, Stage B allows you to consolidate your learning in a full time teaching placement in a different partnership school as you prepare for your first teaching job.","trainWithDisability":"We’re committed to ensuring that every student with potential, regardless of their background or circumstances, has the opportunity to benefit from higher education. \n\nIf you have a disability or additional needs, Leeds SCITT in partnership with Leeds Trinity University will endeavour to put in place reasonable adjustments to accommodate any additional requirements throughout your teacher training year. We’re able to support with conditions such as: \n\n-\tDyslexia\n-\tSpecific learning difficulties\n-\tAsperger syndrome/autism\n-\tVisual/hearing impairments\n-\tPhysical and mobility restrictions\n-\tLong-term medical conditions\n-\tA mental health condition. \n\nIf you register with our Disability Service at Leeds Trinity University, a member of the team will develop a Learning Support Plan tailored to your specific needs. The support within this plan could include exam adjustments, extended library loans, specialist one-to-one study skills, dyslexia screening and assessments, learning materials provided in alternative formats and alternative assessments.\n\nWith your permission, they’ll share this plan with your tutor so that they know how to best support you during your university-based training. They can also share this plan with the School Partnerships team, who are able to inform the host schools for your placements so they can discuss how to best support you during your school-based training.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"createdAt":"2021-07-06T17:50:48.238Z","updatedAt":"2021-09-29T17:54:50.223Z"}
