{"id":"f8bdffd5-dabf-483f-b692-e637c41af3d0","name":"University Campus Oldham","code":"KG8","type":"hei","isAccreditedBody":true,"ukprn":"10006770","address":{"addressLine1":"Oldham Business Centre, University Way","town":"Oldham","county":"Lancs","postcode":"OL1 1BB"},"contact":{"website":"http://www.uco.oldham.ac.uk/","email":"jill.taylor@oldham.ac.uk","telephone":"0161 344 8817","fullName":"Jill Taylor"},"location":{"latitude":53.5385458,"longitude":-2.1138605},"trainWithUs":"University Campus Oldham opened in May 2005 bringing higher education courses to the people of Oldham.\nThis has allowed thousands of students to access Higher Education close to home. Courses have always been aligned to employers` needs in Oldham and Greater Manchester so our graduates have the best opportunities to start their careers of choice.\nSince August 2012, University Campus Oldham, has been part of the Oldham College family. Our courses are of the highest quality as they are validated by leading United Kingdom universities who have the highest quality standards, approved by QAA (Quality Assurance Agency for Higher Education).\nLike many other college Higher Education campuses, University Campus Oldham does not validate its own degree programmes. The degrees that we offer are validated by Higher Education Institutions that have degree awarding powers – usually a university. This ensures that all our programmes are academically rigorous and meet the stringent requirement laid down by the Quality Assurance Agency for Higher Education.\nYour PGCE Pre-service in Teacher Training (Lifelong Learning) is validated by University of Huddersfield","trainWithDisability":"At UCO we will make reasonable adjustments to support you to overcome difficulties your disability presents you with. Examples of the support that may be available, but not limited to, are:\nExtensions on assignment dates\nExam concessions\nExtra time on library book loans\nLibrary assistance\nAdditional tutorials with your course tutors\nDyslexia assessments\nCounselling\nActive monitoring sessions\nAdvice and guidance\nHealth and Wellbeing Assessments\n1:1 sessions\nLearning support plans","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:51:41.554Z","updatedAt":"2021-09-29T14:35:20.417Z"}
