{"id":"f8fa5596-ee32-42b1-b93f-686ece6da8f7","name":"Warren Dell Primary School","code":"215","type":"lead_school","isAccreditedBody":false,"urn":"144905","ukprn":"10065025","address":{"addressLine1":"Warren Dell Primary School,","addressLine2":"Gosforth Lane,","town":"South Oxhey,","county":"Hertfordshire","postcode":"WD19 7UZ"},"contact":{"website":"www.warrendellprimary.co.uk","email":"head@warrendell.herts.sch.uk","telephone":"0208 428 4571","fullName":"Jenny Morley"},"location":{"latitude":51.628625,"longitude":-0.391852},"trainWithUs":"We are an experienced lead school for salaried school direct students with the significant majority of our trainees completing the course with an outstanding grade.\nWe work with a number of schools and have a dedicated lead practitioner who oversees the programme across all schools. Alongside the University of Hertfordshire we hold induction days where all of our students have time to meet each other and they have built supportive networks.\nAs a forward thinking school there are opportunities to develop other skills alongside the course such as outdoor learning, thinking skills. As a school with flagship status for inclusion there will be opportunities for additional training and experiences.","trainWithDisability":"We treat every student as an individual and make all reasonable adjustments to support a disability or other need.\nWe meet with the student to complete a risk assessment and look at how we can adapt the environment/resources. This could be access to a lap top and spell check and support so that the student can pre plan learning in more detail to check for correct spellings.","accreditedBodies":[{"id":"82fd3a3b-6bfd-40d1-8343-0c19e34a847a","code":"T92","name":"2Schools Consortium","description":"Hertfordshire university is an experienced provider in initial teacher training courses."},{"id":"feecdec5-259c-45e3-b1cf-4e391936ee90","code":"H36","name":"University of Hertfordshire","description":"We have an extensive partnership with the University of Hertfordshire. We work alongside them to offer enrichment weeks and placements for other students.\\r\\nThe visiting tutors that have worked with us to visit students have been approachable, supportive and offer feedback that supports continuing further development."}],"createdAt":"2021-07-06T17:47:44.311Z","updatedAt":"2021-07-06T17:47:44.311Z"}