{"id":"f92545e7-be5f-4a2b-a9af-21271b8d985e","name":"Poole SCITT","code":"P75","type":"scitt","isAccreditedBody":true,"ukprn":"10057353","address":{"addressLine1":"Ad Astra Infant School","addressLine2":"Sherborn Crescent","town":"Poole","county":"Dorset","postcode":"BH17 8AP"},"contact":{"website":"www.poolescitt.co.uk","email":"hbscitt@adastra.poole.sch.uk","telephone":"01202 605315","fullName":"Poole SCITT"},"location":{"latitude":50.7497483,"longitude":-1.9652909},"trainWithUs":"Poole SCITT is a 'Schools-Centered Initial Teacher Training Course' leading to a Post-Graduate Certificate of Education (PGCE) in Primary Education with Qualified Teacher Status. Created through partnerships between the participating primary schools and Kingston University in Surrey, to offer initial teacher training at primary school level. Accredited by the DfE as an official provider of initial teacher training, it has been recognised by Ofsted as 'Outstanding' in all areas. Validated for PGCE status by Kingston University, Kingston upon Thames, Surrey and the course carries 'M' credits towards a Masters.\nAd Astra Infant School, Canford Heath, Poole, Dorset is the Taught Course Centre for Poole SCITT. Course sessions can also take place in the partnership schools. The SCITT team are based at Ad Astra Infant School and are responsible for the general direction and day-to-day running of the course. They, and the professional tutors and your mentors, will act as your personal guidance tutors. The majority of trainees obtain teaching positions mostly in the local area before graduating.","trainWithDisability":"Your well-being is a top priority and we will do all we can to give you the chance to flourish and maximise your potential. Candidates are given several opportunities to declare any disabilities or additional support required both before and during the course.\nWe support students on an individual basis according to need. Being a small provider, on occasions we may need to seek specialist advice from outside agencies.\nAll candidates successful in obtaining a place will need to be medically cleared as 'Fit to Teach' as per DfE initial teacher training requirements. The SCITT centre at Ad Astra Infant School is accessible for all as are most of our placement schools.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:48:24.674Z","updatedAt":"2021-07-28T17:25:48.408Z"}
