{"id":"f977529d-4242-4a3d-b00b-5ce3203befbb","name":"Bromley Schools’ Collegiate Eliot Bank Gordonbrock","code":"1UO","type":"lead_school","isAccreditedBody":false,"urn":"136644","ukprn":"10033362","address":{"addressLine1":"Bromley Schools’ Collegiate, Hayes Secondary School","addressLine2":"West Common Road","town":"Hayes, Bromley","county":"Kent","postcode":"BR2 7DB"},"contact":{"website":"http://bscteach.co.uk","email":"administrator@gradteach.co.uk","telephone":"2083006566","fullName":"Gill Kendall"},"location":{"latitude":51.4365765,"longitude":-0.0616931},"trainWithUs":"The federation has a clear vision for the education of its children and our policies and practices are based on this. We want our children to enjoy learning whilst being challenged to meet the highest standards they can. Our schools are full of active and engaged learners who, as well as developing their academic skills, are also developing life skills of learning, friendship, effort and resilience. Staff across the schools work together in a number of ways to ensure the standard of teaching and learning is high. We have a shared curriculum, assessment strategies and policies.\n\nOur Senior Leadership Teams work closely together to ensure that systems are aligned and working well and staff regularly meet for Continuing Professional Development opportunities. More experienced staff across the federation support less experienced colleagues ensuring that all quickly become proficient in their areas of responsibility.\nWe welcome applications from candidates who believe every child deserves to feel safe in school and educated by like minded inspiring teachers.","trainWithDisability":"Bromley Schools' Collegiate is an all inclusive provider.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"2cb11a46-97d4-4ced-a702-0dc37f7d6ebb","code":"B91","name":"Bromley Schools Collegiate","description":"Bromley Schools’ Collegiate is a well established provider of initial teacher training with over 25 years experience. \\r\\n\\r\\n100% of trainees say they feel supported on their journey through their training year and prepared as they become Early Career Teachers (ECT) . \\r\\n\\r\\nWhat our last cohort say: \\r\\n\\r\\n*\\tI know my confidence stems from the opportunities that have been provided by Bromley Schools’ Collegiate \\r\\n\\r\\n* Support and guidance enables trainees to apply their knowledge skilfully in placement schools \\r\\n\\r\\n*\\tSupport was consistent throughout and I have really benefited from learning as you go approach"}],"createdAt":"2021-07-06T17:52:17.467Z","updatedAt":"2021-10-02T22:54:19.516Z"}
