{"id":"f99870ea-ca70-489d-9e0e-7bd85506e122","name":"Castle View Enterprise Teaching Alliance","code":"2FS","type":"lead_school","isAccreditedBody":false,"urn":"135818","ukprn":"10027530","address":{"addressLine1":"Castle View Enterprise Academy","addressLine2":"Cartwright Road","town":"Sunderland","county":"Tyne and Wear","postcode":"SR5 3DX"},"contact":{"website":"https://www.castleviewenterpriseacademy.co.uk/","email":"allan.j@cvea.co.uk","telephone":"1915946330","fullName":"Emma McDermott"},"location":{"latitude":54.917799,"longitude":-1.450058},"trainWithUs":"Castle View Enterprise Academy is an 11 to 16 Academy situated in North of Sunderland. We have an excellent reputation for teacher training and extensive experience of running and supporting successful ITT programmes including GTP, School Direct and PGCE placements for the University of Sunderland, Newcastle University and Durham University. Using this experience and expertise, we have worked with the University of Sunderland to develop our School Direct training programme for secondary School Direct trainee teachers.\nWithin our School Direct alliance are the following North East schools:\n* Belmont Community College (11-16, Durham)\n* Durham School (Independent 11-18, Durham)\n* King James I Academy (11-18, Bishop Auckland)\n* King’s Priory (11-18, North Tyneside)\n* Oxclose Community Academy (11-16, Washington)\n* St Wilfrid’s RC College (11-18, South Tyneside)\n* Villa Real (Special School, 2-19, Consett) The training you receive will take place within school and the University of Sunderland. You will usually spend one full day a week at the University of Sunderland, plus induction days and review weeks. Work-based learning will be based in your school. Our School Direct programme requires you to complete a teaching placement in two of the schools within our alliance. You will complete the majority of your teaching practice in your lead school. You will also complete a shorter teaching practice in one of our partner schools. There will be the opportunity for trainees to visit other schools in the alliance for additional training opportunities including lesson observations and post-16 teaching experience.","trainWithDisability":"We follow the University of Sunderland's Diversity Statement:\n'We celebrate and value the diversity of all students and staff, working to ensure that all are welcome in our community and do not face discrimination or encounter barriers with regard to their disability.'\n\nThe University of Sunderland's Disability Support Team provides advice, information and guidance to students with a disability; students with mental health conditions and students with Specific Learning Difficulties (SpLD) such as dyslexia.\n\nOn application, please contact the Disability Support Team for disability-related queries:\n\nEmail: disability.support@sunderland.ac.uk\nTelephone: 01915152952","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:51:37.093Z","updatedAt":"2021-09-17T14:32:57.186Z"}
