{"id":"fa5a7483-6630-4f00-ba16-9cef817c2c91","name":"East London Alliance SCITT (School Direct)","code":"1RT","type":"lead_school","isAccreditedBody":false,"ukprn":"10064183","address":{"addressLine1":"Barclay Road","addressLine2":"Plaistow","town":"London","county":"London","postcode":"E13 8SA"},"contact":{"website":"https://www.elascitt.com","email":"elascitt@tollgate.boleyntrust.org","telephone":"2074761848","fullName":"Allison Weston"},"location":{"latitude":51.519907,"longitude":0.0339364},"trainWithUs":"ELASCITT was rated Outstanding in October 2017. Our employment rate is 100%. We have excellent Partnerships across our trust and with other schools in our Teaching Alliance. We also work closely with other schools in East London. Our training is up to date and delivered by Specialist Leaders of Education, most of whom are still teaching. We are a small provider and therefore can provide bespoke programmes if needed. Come and see us, our doors are always open.","trainWithDisability":"As a provider we are very aware of supporting our trainees and their individual needs. We provide weekly drop in sessions and regular pupil progress meetings to monitor progress and well being. The School Based Educators, ITT co-ordinators and Professional Tutors are also there to support the trainees and monitor their progress and well being. We include sessions on resilience and well being, both of which are very important to us. We have had Place2be in to run a session and also included mindfulness. We take well being very seriously and offer opportunities to track your own resilience and have signed all of our trainees to individual support and counselling with Education Support. We cater our training to the needs of our students, this may include dyslexia, so we ensure that the resources are on the portal ready to access before the session and discuss your needs during your training.","accreditedBodies":[{"id":"fce142fe-a2a1-4f4d-b2db-2e508280e68f","code":"24M","name":"London District East SCITT","description":""}],"createdAt":"2021-07-06T17:57:00.977Z","updatedAt":"2021-10-14T15:27:03.058Z"}