{"id":"fa7eed0d-9142-4126-9689-ca18621f7f4c","name":"SUPA SOUTHAMPTON","code":"2BH","type":"lead_school","isAccreditedBody":false,"urn":"137125","ukprn":"10059006","address":{"addressLine1":"Noadswood School","addressLine2":"North Road, Dibden Purlieu","town":"Southampton","county":"Hampshire","postcode":"SO45 4ZF"},"contact":{"website":"https://www.supateacher.training/","email":"nicci.dossett@noadswood.hants.sch.uk","telephone":"023 8084 0025","fullName":"Nicci Dossett"},"location":{"latitude":50.858044,"longitude":-1.418223},"trainWithUs":"SUPA Southampton offers the best of both worlds in terms of teacher training. Not only will an applicant have access to the skills and support of a world class university but also the opportunity to train in schools with a long history of excellent practice in developing new teachers. We endeavour to create an environment in our schools where trainee teachers feel valued and supported and in return we appreciate the enthusiasm and energy that they bring to our school communities. Overall, we aim to produce outstanding teachers with up-to-date pedagogy who are continually striving to improve their practice in one of the most dynamic career paths on offer.\nDuring the course the University will provide extensive training on the theoretical aspects of teaching and learning, while the practical aspects will be centred on the schools. Consequently, trainees should be aware that although the course programme will be focussed on Southampton, most Friday's will be spent at the University throughout the year. Overall, SUPA Southampton provides any trainee teacher with the opportunity to 'learn their trade' in a very professional and supportive environment.\nOnce a place has been accepted trainees will be allocated a \"home\" school which they will be invited to before the course starts. The \"home\" school is where the main placement will be spent from January to June. Placement 1 is selected from the whole of the University partnership to give the best possible contrast.","trainWithDisability":"The schools in the Alliance welcome applications from candidates with disabilities and other needs. SEND is a very important element of our training and trainees who have personal experiences of SEND are of real benefit to our programmes, as they bring a wealth of experience.\nHow are Trainee Teachers with disabilities and other needs supported?\n1.\tTrainees with dyslexia meet together at the start of the course for an informal session, led by a tutor with significant SEND experience. This group is then enabled to support one another throughout the course, with individual, personalised, input from the tutor as required.\n2.\tTrainees with Physical Disabilities are always accommodated as appropriate and a wide variety of modifications are available. For example, a student with a hearing impairment may be supported by our enabling services, as well as by their Personal Academic Tutor with services such as remote transcription available - we work with individuals to ensure that their needs are met both when at the University and when teaching in our schools.\n3.\tWe recognise that teaching can be stressful. The University offers a variety of services for Trainees who may be suffering from anxiety or depression, for example trainees can access talking therapies via the University Enabling Services. Trainees are also encouraged to make full use of their Personal Academic Tutor.\n4.\tThe course team are able to personalise many aspects of the programme, to accommodate need on an individual basis, to enable successful completion of the course.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:54:58.894Z","updatedAt":"2021-10-05T01:33:12.618Z"}
