{"id":"fa85c065-4efa-4005-846d-c7410c152ba6","name":"Attleborough Academy","code":"2GG","type":"lead_school","isAccreditedBody":false,"urn":"140534","ukprn":"10044478","address":{"addressLine1":"Attleborough Academy Partnership","addressLine2":"9 Norwich Road","town":"Attleborough","county":"Norfolk","postcode":"NR17 2AJ"},"contact":{"website":"http://www.norfolkttc.org.uk","email":"EnquiriesNTTC@ccn.ac.uk","telephone":"1603773708","fullName":"Paul McCann"},"location":{"latitude":52.5194945,"longitude":1.0191119},"trainWithUs":"Secondary\nWorking closely with our partner schools across the region, Attleborough Academy Partnership offers ages 11 to 19 experience across a broad range of subjects and schools. We provide a tailor-made route in to teaching with our school-based programme. Our well qualified and motivated mentors are at the heart of our programmes, offering the opportunity to develop subject knowledge alongside engaging classroom activities.","trainWithDisability":"Working with City College Norwich we can work closely with all our learners to ensure that all needs are supported in an atmosphere of inclusivity. If you have any special needs, please talk to us in confidence during your interview and we will ensure that the most appropriate and individualised learning plan is put in place.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"1f91f989-047b-4bbc-a73e-d45ffcfc1f28","code":"N43","name":"Norfolk Teacher Training Centre","description":"At the Norfolk Teacher Training Centre, we have over 45 schools in our partnership dedicated to your future. \\r\\n\\r\\nYour school-based experiences will be grounded in a training programme run by experts in adult education and based at City College Norwich. You will be supported by an experienced team of higher education professionals who are at the heart of teaching in Norfolk. \\r\\n\\r\\nOver the last four years, 100% of our graduates secured their NQT jobs before the end of the programme. We believe that this demonstrates NTTC’s commitment to ensuring that you are well prepared to present yourself at interview."}],"createdAt":"2021-07-06T17:57:09.818Z","updatedAt":"2021-08-24T21:25:15.247Z"}
