{"id":"faeb2c5e-3f00-47d1-8a83-6e93d578b675","name":"The Olympus Academy Trust","code":"25X","type":"lead_school","isAccreditedBody":false,"urn":"137753","ukprn":"10036157","address":{"addressLine1":"Fiddlers Wood Lane","addressLine2":"Bradley Stoke","town":"Bradley Stoke","county":"Bristol","postcode":"BS32 9BS"},"contact":{"website":"https://www.olympustrust.co.uk/Careers/Get-Into-Teaching/","email":"sarah.evans@olympustrust.co.uk","telephone":"01454 252059","fullName":"Dave Baker"},"location":{"latitude":51.5351166,"longitude":-2.5452569},"trainWithUs":"The Olympus Academy Trust works closely with local universities to provide high quality Initial Teacher Training. We offer our own School Direct PGCE courses accredited by Cabot Learning Federation SCITT; the PGCE element is approved by the University of the West of England. Trainees on the School Direct programme will be awarded PGCE and QTS at the end of the training year, with perhaps the possibility of being employed by one of our schools.\nWe are committed to developing teachers to serve our local communities and our Teaching School reflects our passion for and expertise in developing teachers and support staff in our institutions and beyond; providing excellent Continuing Professional Development in teaching and learning, career development and leadership skills at all stages and levels of teaching and education.\nWorking together with the CLF allows us to provide a wide range of placements for PGCE trainees in the North Avon area in both secondary and primary phases; we have schools which are urban, suburban and rural in nature. By applying for a place on the School Direct route you will be placed in one of our schools for each of your two teaching placements.","trainWithDisability":"We welcome applications from anyone interested in training to teach.\nIf you have additional needs, we will support you in your training. We working closely with CLF SCITT to facilitate you in accessing training and to provide additional support for, e.g. written assignments. All of our schools are fully accessible and we pride ourselves on our inclusivity for both our pupils and staff. Over the years we have trained teachers with a range of additional needs from medical needs, to ASD through to high level dyslexia. We are also keen to support trainees with mental health needs, again, through accessing CLF SCITT support or by being involved in our active staff wellbeing programmes in our schools.\nMost students find themselves needing a bit of help at times as they juggle different priorities and demands. Common concerns include balancing study, work and social life, personal issues, friends and relationship difficulties, health or loneliness. •\tDisability and Accessibility\n•\tMental health and wellbeing\n•\tMoney Advice","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:52:31.047Z","updatedAt":"2021-09-17T17:20:26.945Z"}
