{"id":"fb3ca289-04a0-4871-a554-e534f98e3783","name":"Whitefield Alliance","code":"2JU","type":"lead_school","isAccreditedBody":false,"urn":"140795","ukprn":"10060725","address":{"addressLine1":"Whitefield Academy Trust","addressLine2":"Macdonald Road","town":"Walthamstow","county":"London","postcode":"E17 4AZ"},"contact":{"website":"https://www.whitefieldpds.org.uk/68/initial-teacher-training-itt","email":"j.fitzsimons@whitefield.waltham.sch.uk","telephone":"2085313426","fullName":"Geraldine O''Grady"},"location":{"latitude":51.5953783,"longitude":-0.0022068},"trainWithUs":"PRIMARY MAINSTREAM WITH SEN\nFor a special child, you need a special person. If you are interested in the challenge of teaching pupils with special needs, we offer you the chance of learning to teach in a special school. Pupils have complex needs, autism, visual impairment or global delay and are from 5-11 years. Placements are in both Mainstream and SEN schools. A PGCE add on is available.\nSCHOOL DIRECT SALARIED ROUTE leading to Qualified Teacher Status validated by the University of East London. The Trainee is based in one of the special schools within our Alliance in Waltham Forest, Havering, Haringey or Hillingdon. An experienced member of staff with current or recent classroom experience will encourage you to reflect on your practice and work with you to develop your progress. We actively encourage further study at Postgraduate and Masters Levels.\nThe NON_SALARIED TUITION FEE ROUTE is based at a school and includes a placement in a contrasting school. Trainees attend lectures, tutorials and seminars throughout the year . After achieving QTS, many Trainees go on to work in one of their placement schools in their NQT year. SECONDARY MAINSTREAM: various subjects\nWe have places for the sciences, maths, history and English based in a Mainstream secondary in Highams Park and a SEN school in Hillingdon. Personal support is provided towards achieving QTS. A PGCE add on is available.","trainWithDisability":"The Whitefield Teaching Alliance consists of a group of special needs schools, as well as Mainstream, so we have complete understanding of any extra educational and non-educational issues that may affect your training and working. We provide two personal mentors for each trainee, one from the school and one from the university. In addition, the Research and Development Centre provides further personal support where necessary.\nWe currently have Teacher Trainees with additional needs whom we are supporting. We put extra support in where necessary. All schools have programmes to ensure well-being and good mental health.\nIn addition to this, the University of East London has a large student support department. Their Disability and Dyslexia Service provides support and advice for disabled students and those with specific learning difficulties including dyslexia.\nThe University states, “If you have a disability, long-term medical condition or a specific learning difficulty, we can help to identify and address any barriers to your education so that you can access your course and reach your potential.”\nThe progress and inclusion of all trainees is very important to us. We provide equal opportunity for all.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:51:24.423Z","updatedAt":"2021-12-06T16:47:37.909Z"}
