{"id":"fb5fd635-3bc9-44e9-9d05-caa875ff2565","name":"Uffculme School","code":"1TK","type":"lead_school","isAccreditedBody":false,"urn":"136287","ukprn":"10031369","address":{"addressLine1":"Uffculme School","addressLine2":"Chapel Hill","town":"Uffculme","county":"Devon","postcode":"EX15 3AG"},"contact":{"website":"www.wctsa.org/get-teaching","email":"admin@wctsa.org","telephone":"01884 842908","fullName":"Sara Jacobs"},"location":{"latitude":50.9077078,"longitude":-3.332872},"trainWithUs":"Our diverse partnership of schools & sixth form colleges across Devon and Somerset make us a great choice for Teacher Training in the South West.\n\n* Outstanding schools and contrasting placements: \nMost of our School Direct trainees are based at Uffculme School, which is regularly among the top performing non-selective state schools in the South West. Uffculme School has been judged Outstanding by Ofsted in every inspection since 2007, and in 2017 was ranked 11th nationally for Progress 8. Our diverse partnership of schools and sixth form colleges provide trainees with the opportunity to experience a variety of contexts, giving them the tools, skills and expertise they need to build highly successful careers.\n\n* Outstanding partnerships: \nThe West Country Training School Alliance works in partnership with the University of Exeter, which is itself rated Outstanding as a Teacher Training provider. Trainees who successfully complete the course receive their PGCE qualification from the University.\n\n* Outstanding provision: \nWe offer trainees a bespoke programme combining the expertise of classroom practitioners with academic theory. Trainees can choose either a school or university based programme.\n\n* Outstanding employment opportunities: \nOur reputation for delivering high quality teacher training has resulted in local schools seeking to appoint our trainees. In 2019 and 2020 all of our trainees who sought employment secured a teaching post.","trainWithDisability":"The University of Exeter provides comprehensive student services that include AccessAbility and Wellbeing teams, Student Learning Skills Service, Student Advice Unit, Counselling Service, Students’ Union Advisors, Student Health Centre, Family Centre and the Chaplaincy. For further details on the wealth of support available to you please go to Student Support Services (http://www.exeter.ac.uk/newstudents/supportandservices/yourhealthandwelfare/). PGCE trainees can access the support of a Wellbeing Services Welfare Consultant to discuss concerns, talk through options for support or understand more about how the University Wellbeing Services may be able to help. Alongside the support described above, every PGCE trainee is assessed by an Occupational Health provider as part of the admissions process to ensure they are fit to teach in a school setting. The Occupational Health provider can recommend ‘Reasonable Adjustments’, which will be put into place by the provider, providing they are logistically possible and reasonable.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"d41a1821-e35b-48eb-bf02-4842872b04a2","code":"E84","name":"University of Exeter","description":"The West Country Training School Alliance works in partnership with the University of Exeter, which is rated Outstanding as a Teacher Training provider. Trainees who successfully complete the course receive their PGCE qualification from the University."}],"createdAt":"2021-07-06T17:47:31.229Z","updatedAt":"2021-10-11T15:16:13.088Z"}
