{"id":"fb861907-5da9-4a29-9187-711d5d700bf8","name":"The Forge Trust","code":"2GK","type":"lead_school","isAccreditedBody":false,"urn":"141760","ukprn":"10007811","address":{"addressLine1":"The Sir Donald Bailey Academy","town":"Newark","county":"Notts","postcode":"NG24 4EP"},"contact":{"website":"https://theforgetrust.co.uk/teacher-training/","email":"c.braithwaite@theforgetrust.co.uk","telephone":"1636680142","fullName":"Carl Braithwaite"},"location":{"latitude":53.060745,"longitude":-0.8085124},"trainWithUs":"With seven academies situated across the East Midlands to choose from, we are able to tailor placements to the needs of students offering a choice not generally available through other routes. As well as having a track record for developing students and helping launch the careers of a number of outstanding professionals, many students have been successful in finding places with us after graduation. Some of whom have been identified as having leadership potential and have gone on to secure leadership roles within the trust.\nAs a trainee with Forge, you will be part of talented team that prides itself on teaching and learning. An evidence based approach has been honed over a number of years, initially at the founding school, in which a dramatic turn-around in pupil outcomes occurred. Mentors from across the trust will take you through approaches to teaching, in a step-by- step way to support your learning journey. Mentors work with our students to provide tailored support. At the same time a bank of experienced and specialist teachers from across the trust, provide school-based training on a range of themes from assessment and planning through to working with parents. The Forge Trust is committed to promoting outstanding teaching across its academies and has clear systems and policies for planning, marking and feedback and approaches to teaching the core subjects and wider curriculum. Expectations are high but we believe trainees can benefit from proven strategies for raising attainment and the trust's clarity of expectation.","trainWithDisability":"Our trainees are important to both the trust as a whole and to each individual academy. We want our trainees to be successful and many are successful in finding places with us after graduation. At The Forge Trust we recognise that you may require additional assistance to engage fully with your studies due to a range of access needs. Our academy buildings are all readily accessible and access plans are in place across our academies. If you have additional needs the trust ITT Lead will coordinate the trust and academy offer, where needed, to ensure that barriers to access at all stages of the process from recruitment to graduation are removed, overcome, mitigated or that suitable adaptive measures are put in place to support you. In order to assess the level of support you may require, we use the legal definition of disability. If you are unsure whether you have access needs which are covered by disability legislation please contact The Forge Trust directly.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"yes"},"accreditedBodies":[{"id":"1d95b6cb-0e08-4485-848a-0e304d71102a","code":"B38","name":"Bishop Grosseteste University","description":"Bishop Grosseteste University is located on a beautiful campus just a few minutes’ walk from Lincoln Cathedral.\\r\\n\\r\\nThe teaching at BGU is Gold rated. This means it has been awarded the highest rating in the first ever Government-led Teaching Excellence Framework assessment, a rating which was awarded to just the top 26% of universities in the UK. \\r\\n\\r\\nThe employability rate of BGU graduates is also high. In a recent survey of graduate outcomes, 88% were in work or further study one year after graduation – much higher than the sector average. We are proud of our link with this university"}],"createdAt":"2021-07-06T17:54:17.466Z","updatedAt":"2021-10-05T14:56:49.316Z"}
