{"id":"fbb4540f-1243-4300-9df9-6f0e716b7b21","name":"Trinity Institute of Education","code":"1YF","type":"lead_school","isAccreditedBody":false,"urn":"136094","ukprn":"10029939","address":{"addressLine1":"The Maltings","addressLine2":"Maltings Road","town":"Halifax","county":"West Yorkshire","postcode":"HX2 0TJ"},"contact":{"website":"https://tie.trinitymat.org/","email":"contactus@tie.trinitymat.org","telephone":"1422433324","fullName":"School Direct Applications"},"location":{"latitude":53.7379367,"longitude":-1.9008984},"trainWithUs":"Trinity Institute of Education and Huddersfield University have developed an innovative school-led teacher training programme for School Direct 2022. We have over 45 schools across West Yorkshire, offering rich opportunities for trainees to access the highest quality training in a diverse range of establishments including academies, church schools, schools with 6th forms, primary schools with early years provision, grammar schools, and schools with dedicated special needs provision. Our School Direct programme has been created in partnership with leading practitioners from both the University and across the institute, as well as subject specialists from our sister organisations White Rose Maths and West Yorkshire Maths Hub. We ensure a collaborative approach between all partners, led and quality assured by a team of experienced senior leaders, dedicated to providing the very best training experience for our School Direct students. We have a strong focus on ensuring that our trainees are fully supported to develop their knowledge, skills and professional attributes in order to become outstanding and inspirational teachers. A world-class education system requires world-class teachers and this unique programme sets out to address this challenge. Trinity Academy Halifax is the lead school - graded outstanding in all areas. We are dedicated to developing the teachers and educational leaders of the future. Staff are able to access quality CPD programmes, designed to ensure our outstanding teachers also have the opportunity to develop into outstanding leaders.","trainWithDisability":"We offer disabled access across the Institute and recommend applicants to discuss their individual needs with us so that we can place you in the most appropriate school for your training year.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:54:15.504Z","updatedAt":"2021-07-08T00:27:19.199Z"}
