{"id":"fc46147d-83e4-430e-b210-9e0f58c55964","name":"NET Academies","code":"2KT","type":"lead_school","isAccreditedBody":false,"urn":"141379","ukprn":"10046090","address":{"addressLine1":"Longwood Primary Academy","addressLine2":"Paringdon Road","town":"Harlow","county":"Essex","postcode":"CM18 7RQ"},"contact":{"website":"https://www.netacademies.net/Join-Us/","email":"hewers@longwood.netacademies.net","telephone":"01279 866155","fullName":"James Hollinsley"},"location":{"latitude":51.7496211,"longitude":0.0980593},"trainWithUs":"Longwood Primary Academy is host to the NET Academies training routes, based in Harlow, Essex.\nWe believe that teaching is an exciting, challenging and rewarding profession. We pride ourselves on having a proven track record in training excellent practitioners and supporting them in gaining positions within our partnership schools. Due to our unique setup, NET academies have 5 schools within very close proximity to one another - as a result, we can provide experiences and training beyond that of other providers. We have a range of lead practitioners and development pathways in order to suit all applicants.\nAbout the Lead School:\nIn 2018 Longwood was awarded national 'Employer of the Year' in the TES awards, Place2Be Primary Community of 2019 and was the second school in the country to be awarded with gold status for mental health and wellbeing for pupils and staff. This is due to our commitment to lifelong wellbeing for pupils and staff. Longwood was also awarded 'Outstanding Contribution to Emotional Health and Wellbeing' in 2017 and 2018. The leadership and management, together with personal development, behaviour and welfare was graded as outstanding by Ofsted in 2017.","trainWithDisability":"We welcome applications from candidates including those with special educational needs and disabilities. We aim to meet the challenge of all declared disabilities and other needs placing candidates in our diverse range of school. We are committed to supporting the full inclusion of individuals ensuring their needs are met. At NET Academies, we are proud of our inclusive practices meeting the needs of children and adults alike.\nOur locations are all DDE compliant.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:57:13.832Z","updatedAt":"2021-10-04T18:03:45.334Z"}
