{"id":"fcbf4523-b2eb-4167-991d-8a75749a76af","name":"North Star","code":"269","type":"lead_school","isAccreditedBody":false,"urn":"144168","ukprn":"10063684","address":{"addressLine1":"Inspiration Way","addressLine2":"Topcliffe Road","town":"Thirsk","county":"North Yorkshire","postcode":"YO7 1TS"},"contact":{"website":"https://www.elevatemat.org/","email":"northstar@elevatemat.org","telephone":"01423 226389","fullName":"Kerry Young"},"location":{"latitude":54.2186055,"longitude":-1.3504629},"trainWithUs":"North Star was designated as a Teaching School Alliance in 2014. We support schools across North Yorkshire and beyond in school improvement projects and professional development programmes. Our motivation for running the programme is to supply all of the schools in our alliance with 'home grown' skilled teachers - we are invested in making you the best teacher you can be. We have a track record of supporting trainees through all the challenges of undertaking the programme. We pride ourselves on our responsiveness to any obstacles you might meet along the way. Because our programme is school-based, it attracts trainees of all ages and from all different backgrounds. North Star Teaching School Alliance supports entrants to the profession though every stage in their career - from NQT to Headship. We are committed to delivering a programme of the highest quality, with training from outstanding SLEs, LLEs and school leaders tailored to the needs of our trainees.","trainWithDisability":"We believe the teachers we train are important role models – both in their schools and in the wider community – and that they should reflect the diversity around them and help create a culture that promotes and celebrates inclusion in all its forms.\nIn response to this, we have built up a network of ‘Diversity Champions’, whose role it is to promote conscious inclusion and ensure that every one of our trainees, whatever their personal circumstances, feel welcomed, supported and valued.\nOver years we have worked with a number of individual trainees to tackle specific barriers they have faced, including:\n•\tWorking with a trainee with mobility issues to ensure their placement schools were able to arrange accessible parking, ground floor classrooms, bespoke pupil seating plans and a timetable that allowed them sufficient time to reach other areas of the school if required.\n•\tSupporting trainees with autism to clarify expectations with their schools and oversee any necessary modifications to classroom layouts, lighting and sounds.\n•\tMaking course adjustments for trainees with dyslexia, such as sending PowerPoint presentations in advance of the training and working with them to develop strategies to help turn any particular perceived weaknesses such as spelling and short-term memory into a strength.\n•\tEnsuring that all trainees learn about adult mental health awareness as part of their course.\nOur commitment to diversity in all its forms is evidenced by the fact that 15% of our trainees report having some form of disability.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:50:17.490Z","updatedAt":"2021-11-22T22:18:01.962Z"}
