{"id":"fce142fe-a2a1-4f4d-b2db-2e508280e68f","name":"London District East SCITT","code":"24M","type":"scitt","isAccreditedBody":true,"urn":"140998","ukprn":"10064183","address":{"addressLine1":"Tollgate Primary School","addressLine2":"Barclay Road","town":"London","county":"Newham","postcode":"E13 8SA"},"contact":{"website":"http://www.londondistricteast.org/","email":"scitt@londondistricteast.org","telephone":"2074761848","fullName":"Tom Canning"},"location":{"latitude":51.519907,"longitude":0.0339364},"trainWithUs":"London District East SCITT was previously known as ELASCITT, we are now part of the London District East Teaching School Hub. We were rated Outstanding in October 2017 and our employment rate is 100%. We have excellent Partnerships across our trust and with other schools in our Teaching School Hub. Our training is up to date with evidence based research and delivered by Specialists in their field, majority of whom are Senior Leaders in their school and still teaching. We are a small provider with excellent relationships and communication and therefore can provide all the support necessary to ensure that you complete the course successfully. Come and see us, our doors are always open.","trainWithDisability":"As a provider we are very aware of supporting our trainees and their individual needs. We provide weekly drop in sessions and regular progress meetings to monitor progress and well being. The Mentors, ITT co-ordinators and Tutors are also there to support the trainees and monitor their progress and well being. We include sessions on resilience and well being, both of which are very important to us. We take well being very seriously and offer opportunities to track your own resilience and have signed all of our trainees to individual support and counselling with Education Support. We cater our training to the needs of our students, this may include dyslexia, so we ensure that the resources are on the portal ready to access before the session and discuss individual needs both at the interview stage and during your training.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:54:16.277Z","updatedAt":"2021-10-18T18:24:55.453Z"}
