{"id":"fd2ef0c0-5f82-4bc2-ad7b-b4aac5f6c2e7","name":"Balcarras School","code":"14B","type":"lead_school","isAccreditedBody":false,"urn":"136474","ukprn":"10032991","address":{"addressLine1":"East End Road","addressLine2":"Charlton Kings","town":"Cheltenham","county":"Gloucestershire","postcode":"GL53 8QF"},"contact":{"website":"http://www.balcarras.gloucs.sch.uk/","email":"rja@balcarras.gloucs.sch.uk","telephone":"1242515881","fullName":"Rebecca Atkin, assistant headteacher"},"location":{"latitude":51.8814114,"longitude":-2.0436998},"trainWithUs":"Balcarras is an outstanding 11-18 mixed comprehensive school on the out skirts of Cheltenham. We pride ourselves that this is a school where every individual is valued and feels safe, where all students are inspired not only to do their best but to expand their horizons, and where everyone involved in school life feels a great sense of pride and enjoyment at being part of this community. We are a Teaching School which enables an exciting and vibrant commitment to continued professional development and an emphasis on the importance of good teacher training. We are also a maths hub school and run the GLOW Maths Hub. Three of the GITEP subject leaders are teachers at the school in maths, history and PE. We have been working as a School Direct provider since 2012, where we were one of the pilot schools for the School Direct programme. We have successfully enabled training of 30 teachers across a range of subjects.\nYou will be able to choose between a QTS only and a PGCE qualification. The GITEP PGCE is awarded by the University of Bristol.","trainWithDisability":"We welcome applications from trainees with disabilities and particular needs. A conversation with you, by telephone or at one of our taster days, may help us clarify how we can best support you. For dyslexic trainees we would be able to offer extended deadlines for written assignments if necessary. For any other disabilities we would of course endeavour to make all reasonable adjustments to enable a successful training year. This would be done on an individual basis and has been our approach as we have trained teachers at Balcarras. For previous trainees this has included ensuring that all of their lessons are downstairs where they were not able to access the upper floor via a lift. Liaison between Balcarras school and the GITEP leadership is very strong and we are used to making reasonable adjustments to help trainees, both short term and over the whole course.\nAll GITEP PGCE trainees are registered as students with the University of Bristol and this gives access to the full range of student services offered by the University. This includes support with academic assignments for trainees with dyslexia and all the University counselling and student support services. Trainees with disabilities and other needs are strongly encouraged to register with the University Library Support service.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:51:29.253Z","updatedAt":"2021-07-08T16:58:52.442Z"}
