{"id":"fd9930cc-33fd-4f47-bdff-b643d0b39f3b","name":"Perins Innov-8","code":"2DC","type":"lead_school","isAccreditedBody":false,"urn":"137128","ukprn":"10034823","address":{"addressLine1":"Pound Hill","addressLine2":"Alresford","town":"Winchester","county":"Hampshire","postcode":"SO24 9BS"},"contact":{"website":"https://www.perins.net/schools-direct/","email":"schooldirect@perins.hants.sch.uk","telephone":"1962737278","fullName":"Wayne Davies"},"location":{"latitude":51.0888362,"longitude":-1.1684304},"trainWithUs":"In Omnia Excellentia (Excellence in Everything)\nThis is our commitment to training the teachers of tomorrow.\nSchool Direct offers an training route for graduates who want to be part of a school team from day one. They will be training alongside enthusiastic teachers, who are committed to education and who are leaders in their own fields.\nAt Perins, we have the experience and capacity to deliver outstanding training for the next generation of teachers. We are committed to fostering individual growth. We challenge all aspiring teachers to become the best that that they can and we provide learning opportunities at a personalised level.\nThe course is delivered in an interactive way, and can be directly applied to the classroom. Allowing the trainee to experience the role of the learner and how it feels to be a pupil. Our Partner schools are experienced in working with trainee teachers in a wide range of subject areas at both phases. Enabling us to provide a broad range of courses. You will gain experience in two schools and you will have opportunity to experience Teaching and Learning at a school in a different part of the country as well as a specialist provider. You will be able to experience Key Stages above and below.\nPerins School is located in the beautiful market town of Alresford within easy reach of Winchester, Southampton and Basingstoke. Perins has an excellent reputation for its sports offering and creative arts projects and productions as well as its academic results.","trainWithDisability":"In accordance with the Equality Act 2010 shall endeavour to make reasonable adjustments for students who require extra support due to a disability, long term medical condition or sensory/physical impairment.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:48:15.279Z","updatedAt":"2021-10-12T16:22:52.586Z"}
