{"id":"fe872367-c0b4-4746-94a8-8000edf1c198","name":"The Golden Thread Teaching School Hub","code":"155","type":"lead_school","isAccreditedBody":false,"urn":"138729","ukprn":"10038662","address":{"addressLine1":"Painsley Catholic College - Sixth Form","addressLine2":"Attlee Road","town":"Cheadle","county":"Stoke-on-Trent","postcode":"ST10 1LL"},"contact":{"website":"https://www.goldenthreadtsh.co.uk/","email":"LBU@painsley.staffs.sch.uk","telephone":"01538 493777","fullName":"Anne Maingay"},"location":{"latitude":52.9814567,"longitude":-1.9899786},"trainWithUs":"We are a consortium of secondary and primary schools across Staffordshire and Stoke on Trent. Through our links with our university partners, we offer an innovative approach to your development as a teacher; a number of our school based colleagues lead sessions at the University, enabling you to benefit from the strengths that both the university and our schools bring to your teacher education programme. All our schools share our vision to develop exceptional teachers who are effective, caring, critical and creative. We seek to develop your talents and attributes in relation to secondary pedagogy. This will enable you to not only meet the competencies required by the Teacher's Standards, but to exceed them. The Golden Thread TSH Consortium of schools is part of the wider University partnership of secondary schools comprises a mixture of faith schools (Catholic and Church of England), as well as local authority and academy settings. You will be able to benefit from placements in 2 school settings; each providing a contrasting experience. Whilst on placement we will support you in offering children a broad and balanced curriculum, one that both engages and excites them. It is a privilege for us to be working in a diverse region with exceptional teachers. We respect the cultures and backgrounds of the young people in our settings. In particular, we value the transformative role that a high quality secondary educational experience has, it enables young people to become informed, empowered and engaged and improving the outcomes for all.","trainWithDisability":"We welcome applications from all sections of the community. Applicants who would benefit from disabled access should let us know on their application so that they can be considered for placements at appropriate schools.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[{"id":"34f0b949-839c-4292-88c3-5289076bd205","code":"24J","name":"Keele and North Staffordshire Teacher Education","description":"KNSTE is an outstanding provider (2017) who works in close partnership with their school clusters. The programme is designed and managed by local headteachers and senior school leaders. They are relentless in pursing excellence in teaching so that the pupils in our school communities benefit from passionate and effective teaching. Evidence is used to inform and challenge school-based practice for the benefit of all. In this way your school and SCITT sessions are intertwined. We have been thrilled to employ previous trainees and are delighted that KNSTE has sustained its high recruitment, retention and employment rates"},{"id":"aa023df3-b71e-4249-b9c4-41fca8bd135e","code":"D39","name":"University of Derby","description":""}],"createdAt":"2021-07-06T17:52:39.887Z","updatedAt":"2021-07-29T23:00:32.737Z"}
