{"id":"ff5e78c6-2928-44d6-b4e6-8fa2fed5feb7","name":"South West Teacher Training","code":"S66","type":"scitt","isAccreditedBody":true,"ukprn":"10060466","address":{"addressLine1":"West Exe School","addressLine2":"Hatherleigh Road","town":"Exeter","county":"Devon","postcode":"EX2 9JU"},"contact":{"website":"http://www.swtt.net","email":"swtt@westexe.devon.sch.uk","telephone":"01392 686 165","fullName":"Progamme Manager"},"location":{"latitude":50.7066379,"longitude":-3.5399153},"trainWithUs":"South West Teacher Training is based at West Exe School, part of the highly successful Ted Wragg Multi-Academy Trust. We are situated in Exeter, placing our trainees in a partnership of schools across Exeter, Plymouth and throughout Devon and Somerset. Although we can't promise specific placements on application, we carefully match trainees to schools that suit their skills and location.\nWe work with Bath Spa University, an Ofsted Outstanding provider, who provide our PGCE. They offer a balanced programme of academic excellence alongside school-based training. Bath Spa tutors visit our Exeter site, providing lectures and one-to-one tutorials. We work with Exeter Consortium and the Ted Wragg Multi-Academy Trust. We offer a programme of study that links our Secondary and Primary training, giving our Secondary trainees an enviable insight into the workings of Primary education. The programme is taught by leading practitioners, many of whom are ex-SWTT trainees now employed by our partner schools. They provide training rooted in research and current classroom practice. Our programme prioritises teaching over paperwork - our Good Ofsted Inspection report in 2021 acknowledges our is 'highly regarded by headteachers and says our trainees spend more time considering their impact on young people, and less time managing paperwork and workload. Our trainees begin teaching in staged steps early on, integrating academic study with classroom practice. Trainees value our route as it places them in schools swiftly, yet allows them to build their teaching skills gradually. Our route is truly practitioner-led. Visit www.swtt.net to learn more.","trainWithDisability":"At South West Teacher Training we have a long history of accommodating trainees with a wide range of disabilities and other needs. Our training programme emphasises the need for trainees to manage their own pace of learning. Our recent Ofsted Inspection praised our programme as inclusive; trainee well-being is at the heart of our vision for creating resilient teachers capable of managing their workload.\nTo that end, in the past we have successfully trained teachers who have learned strategies to manage their dyslexia, colour-blindness as well as mobility issues whilst meeting the demands of classroom practice. Trainees are asked to discuss their needs during a health check before starting the course and this information is swiftly communicated to the course team.\nOur partnership with Bath Spa University is designed to support trainees with a range of needs and we have a differentiated programme of support tutorials, offering our trainees the help and guidance they need as individuals.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"createdAt":"2021-07-06T17:49:36.567Z","updatedAt":"2021-09-28T20:06:55.711Z"}
