{"id":"ff90612e-0423-4257-99d4-a669882af678","name":"Kings Langley School","code":"154","type":"lead_school","isAccreditedBody":false,"urn":"139036","ukprn":"10039628","address":{"addressLine1":"Kings Langley School","addressLine2":"Love Lane","town":"Kings Langley","county":"Hertfordshire","postcode":"WD4 9HN"},"contact":{"website":"http://www.kls.herts.sch.uk","email":"admin@kls.herts.sch.uk","telephone":"1923264504","fullName":"School Direct Coordinator -Fiona Winfiel"},"location":{"latitude":51.7166099,"longitude":-0.4632515},"trainWithUs":"Kings Langley School (lead school) has been part of the Dacorum Strategic Partnership working together with local secondary schools since September 2001. Examples of our collaborative working include:\n*\twhole school CPD for teachers and support staff; *\tleadership exchange programmes, *\tMiddle leader professional development programmes, *\tteacher placement exchanges *\tshared school policies This year two local primary schools , Kings Langley Primary School and Saint Alfred the Great Catholic Primary School are also working with us as part of the school direct programme. As a school we are recognised by the local authority as a school with strong leadership and management expertise and as such over a number of years we have been asked to support schools within Hertfordshire. For example, during the last academic year the headteacher was acting as the executive headteacher for Cavendish School in Hemel Hempstead.\nAs a school we have a proven track record of working with teacher trainees having successfully supported students over a number of years in their PGCE placements, OTT in assessment only routes, GTTPR and School Direct programmes. Kings Langley School has a 100% success rate for the completion by trainees on the School Direct programme. The school moved into a new purpose built school in September 2016. This gives trainees and teachers from our partnership the opportunity to work with state of the art technology and resources when delivering our ITT programmes.","trainWithDisability":"Accommodation\nUnfortunately the School Direct partnership is not able to provide any accommodation for trainee teachers. Child Care Facilities\nThe School Direct partnership is unable to provide any child care facilities for trainee teachers. Disability Access\nThe University of Hertfordshire Every year a significant number of the University's applicants and students disclose a disability. The University is delighted that so many disabled students choose to study at the University of Hertfordshire and takes proactive steps to provide an inclusive environment and makes reasonable adjustments to meet individuals' disability-related needs. Kings Langley School would endeavour to make reasonable adjustments for colleagues.","accreditedBodies":[],"createdAt":"2021-07-06T17:55:23.750Z","updatedAt":"2021-09-01T21:25:08.774Z"}