{"id":"ffa3f0dc-4880-4ae7-9942-84502da47f56","name":"Five Counties Teaching School Hub (South Glos and BANES)","code":"27R","type":"lead_school","isAccreditedBody":false,"urn":"109164","ukprn":"10071357","address":{"addressLine1":"Church Farm Road","addressLine2":"Emersons Green","town":"Bristol","county":"Avon","postcode":"BS16 7EY"},"contact":{"website":"https://nexustsa.org.uk/Services/School-Direct-ITT/","email":"sian.kinder@mangoschool.org","telephone":"1454867400","fullName":"Sian Kinder"},"location":{"latitude":51.4867596,"longitude":-2.4779201},"trainWithUs":"The Five Counties Teaching School Hub Alliance (South Glos and BANES), formerly the South Glos Teaching School Alliance, are working with a group of schools in South Gloucestershire to provide high quality, school led teacher training. Working alongside these schools, you will learn from excellent teachers who are keen to share their expertise. Each of the schools has their own specialism including one school with a resource base for children with social and communication needs. Even though this group of schools are in a 2 miles radius, they all have different contexts giving you a really good grounding in teaching. We will work with you to identify your strengths and interests to find the best placement school for you. You will spend a large percentage of time in the class, applying what you have learnt straight away and we will make you feel like part of the school team from day one. We are extremely proud of our work with trainee teachers and are committed to developing great teachers for the future. As we only have a small cohort of trainees, we really get to know you and tailor the training to suit individuals. We want the best possible teachers for our children and the majority of our trainees go on to gain a full time teaching position in one of our schools.","trainWithDisability":"We understand that many disabled students will have additional support needs to enable them to access their course. We support all candidates with disabilities and other needs such as dyslexia, physical, hearing and visual impairments and mental health conditions, putting an individualised package of support in place for each trainee. This might include ICT support and software, extra mentor support, specialist equipment, parking arrangements and reasonable adjustments for coursework.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:48:43.785Z","updatedAt":"2021-10-08T18:30:05.677Z"}
