{"id":"ffd5b0ec-5fdf-4981-81e5-4938ca5f265a","name":"Transform SCITT – Inspiring Leaders Teacher Training","code":"5W1","type":"lead_school","isAccreditedBody":false,"urn":"70296","ukprn":"10088528","address":{"addressLine1":"11 Castlebridge Office Village, Kirtley Drive,","addressLine2":"Castle Marina","town":"Nottingham","county":"Nottinghamshire","postcode":"NG7 1LD"},"contact":{"website":"www.transformtrust.co.uk","email":"jayne.limb@transformtrust.co.uk","telephone":"1159825090","fullName":"Jo Venables"},"location":{"latitude":52.9447939,"longitude":-1.1618239},"trainWithUs":"Inspiring Leaders Teacher Training, is an Ofsted 'Outstanding' rated partnership of schools working across Nottingham and Derby City working together to develop outstanding teachers and leaders of the future. \n\nAs a trainee teacher with Transform you will be in the heart of our vibrant and diverse school communities making a daily difference to children. You will work in our urban hubs as a role model and innovator in our culturally rich schools.\nTransform will invest in you as a person and professional from the very beginning of your teaching career. You will be championed by a network of expertise in inspiring and creative learning environments. Our specialist support continues into your NQT year and beyond. A world of opportunity awaits you!\n\nOur SCITT / School Direct training route provides all trainees with a blend of school experience alongside an innovative and inspiring taught programme, leading to the award of QTS and a PGCE, with our partners the Nottingham Trent University.\n\nWe are passionate, experienced and successful at developing great teachers 'Together we Achieve'. \n\nWe offer more than just a one year teacher training programme by supporting trainees into employment in our schools and delivering ongoing career opportunities tailored to their needs.\n\n[For more information visit our websites:]\n(https://www.inspiringleadersscitt.com)\n\n\nCall us on 0116 3184066 or email us at info@iltt.org.uk","trainWithDisability":"We are an equal opportunities provider and provide support for all our students with their learning requirements. Our partner universities provide support for trainees with different needs and learning requirements. This can be discussed at the screening and interview process.","showSchoolPlacements":"no","visaSponsorship":{"canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no"},"accreditedBodies":[],"createdAt":"2021-07-06T17:55:15.397Z","updatedAt":"2021-10-08T22:09:28.982Z"}
