{"id":"840023c2-3033-45b5-875e-13c1d02d0f79","name":"Primary","code":"27VP","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"846551f6-e83d-4a87-ac5e-c971342d14d9","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"69f059e1-1fb2-480d-877d-9584dd317dd0","code":"1S2","name":"Kingsbridge EIP SCITT"},"profPost":"PG","degreeGrade":"1","english":"1","maths":"1","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"Birmingham City University (BCU) have developed an online GCSE equivalence option that we accept and is open to trainees who may require equivalency certificates. Please contact us for more details.","courseLength":"OneYear","feesUK":9250,"feeDetails":"Course fees at Kingsbridge are amongst the most competitive around at just £9,250. \r\n\r\nAnyone who applies for a place can also apply for financial support through the Student Loan Company.\r\n\r\nTo find out more, visit: https://www.gov.uk/apply-for-student-finance  \r\n","aboutCourse":"Kingsbridge EIP SCITT provides the highest quality teacher training: ensuring those beginning their careers are reflective, inquisitive, and confident practitioners. Having completed your training with us, you will access a programme of Continued Professional Development for your ECT year. Kingsbridge has consistently secured attainment and employment outcomes for trainees far in excess of national and regional averages.\r\nKingsbridge offers a high-quality programme of support ensuring a sound relationship between theory and practice. We offer a wide variety of opportunities to enrich your training. You will spend all your time with us based in one of our partner schools. There are 4 days based in school and one day based at our Training Centre. There is also the opportunity to experience life in a different teaching environment through a separate placement.\r\nWe will be with you every step of the way because all our placements offer a level of support to suit your needs. Every trainee has a school-based mentor who is on hand to offer daily advice and guidance. You will also get outstanding support from your subject coaches and Kingsbridge’s team of Tutors.\r\nAs well as QTS, trainees will also work towards a PGCE. \r\nThere are 3 different areas of study to this course. Professional Practice, Subject Knowledge and Professional Studies\r\nSubject Knowledge - Our subject knowledge development focuses on the key concepts and skills for every subject in the primary curriculum and how you can develop knowledge of pedagogy to teach content in a subject specific way. There are intensive courses on Early Reading, mathematics and science as well as key sessions linked to the wider foundation subject curriculum. The course will  develop your ability to apply the core principles of subject knowledge development to your own professional learning.\r\nThe professional studies and professional practice areas of the course will give you a thorough understanding of the learning process itself including an appreciation of individual differences. The study of the principles and practices of learning and teaching is through both school and professional studies sessions allowing you to develop practical competencies supported by analytical skills\r\nProfessional development \r\nProfessional development is intrinsically linked to all key strands of the programme and is designed to enable you to evaluate critically and reflect upon your learning in order to make improvements.\r\nTo find out more about training to teach with Kingsbridge please visit https://www.kingsbridgeteachertraining.co.uk.\r\n","interviewProcess":"Your interview process at Kingsbridge comes in three phases:\r\n\r\n•\tThe Formal Interview: You’ll be invited to Kingsbridge to sit your interview. Just like any other job interview, you will be asked a series of questions designed to illustrate how you meet our standards. We will be looking at your communication skills, knowledge and experience and your personal attributes.  \r\n\r\n•\t During the formal interview process candidates will be required to demonstrate high standards of safeguarding that promotes the welfare of young people.  Keeping children safe in education, it is vital that schools, colleges and SCITTS create a culture of safe recruitment and adopt recruitment procedures that help deter, reject, or identify people who might abuse children.  Please be aware that our recruitment procedures are robust in this regard.  \r\n\r\n•\tSchool Based Assessment: Once you’ve made it through the interview you’ll be invited to come to one of our partner schools. You will be asked to deliver an activity with a small group of students. We will be looking at how you engage with the young people, how you capture their attention and fire their imaginations. We’ll also be looking for self-confidence in front of the class and your creativity in devising and delivering an entertaining and educational session.\r\n\r\n•\tThe Conditional Offer: When you make it through the first two phases we will make you an offer of a place. This is designed to make sure that your literacy and numeracy skills are up to an acceptable standard for teaching\r\n","howSchoolPlacementsWork":"At Kingsbridge, you will be placed in a school setting full time, this will be your main placement and one day release at Kingsbridge Teacher Training centre. You will have opportunity to be placed in a contrasting school on your second placement in the spring term.","personalQualities":"A genuine passion for teaching. \r\n\r\nIt would be helpful if you have recent experience with children and learners to confirm your career choice, but this is not a prerequisite before applying to Kingsbridge Teacher Training. We look for the potential to train to teach, for example excellent communication skills, team work, responding to feedback and flexibility. \r\n\r\nKingsbridge operates strict safer recruitment procedures and makes sure all appropriate checks are carried out on all trainees who join the SCITT. Kingsbridge promote welfare of children and your people at every stage.\r\n","otherRequirements":"Original certificates for your degree and GCSE subjects or equivalents, will need to be brought with you to the interview. If you are in your final year of study, please enter a predicted grade.\r\n\r\n*If your qualifications were not gained in the UK, you can visit the National Academic Register Centre (NARIC) website to find out whether your qualifications are considered to be equivalent to UK GCSEs and degrees.\r\n\r\nEvery lesson shapes a life through Kingsbridge Teacher Training.\r\n","status":1,"createdAt":"2021-07-06T10:53:08.846Z","updatedAt":"2021-09-27T13:58:30.414Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
