{"id":"90206c55-e1c7-442c-a5f2-81eb71b529a5","name":"Primary","code":"T869","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"4e46c23d-23e6-400a-a7fc-733942c6cc9a","name":"St. George's Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"e43f853d-9fa2-45a0-9105-23dbd128e512","name":"Kingsbridge Excellence Centre","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"69f059e1-1fb2-480d-877d-9584dd317dd0","code":"1S2","name":"Kingsbridge EIP SCITT"},"profPost":"PG","degreeGrade":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Birmingham City University (BCU) have developed an online GCSE equivalence option that we accept and is open to trainees who may require equivalency certificates. Please contact us for more details.","courseLength":"OneYear","feesUK":9250,"feeDetails":"Tuition fees for all unsalaried programmes is £9,250.\r\n\r\nFull-time Initial Teacher Training (ITT) courses, whether undergraduate or postgraduate, will get funding in the same way as other undergraduate degree programmes. This means you’ll be able to apply as a full-time student for student finance for fees and living costs in the same way as undergraduates on any other higher-education course.\r\n\r\nVisit https://www.gov.uk/teacher-training-funding for more details. ","financialSupport":"Wellbeing and support is at the heart of our teacher training programme.\r\n\r\nTo further support our trainees this coming academic year we have also developed a trainee wellbeing support service that will offer our trainees access to the tools and support needed to improve their overall health and wellbeing. This support service includes access to trusted health information such as counselling and GP support should it be needed during the programme. ","aboutCourse":"Initial Teacher Training opportunities are available from Sept 2022 through our Wirral partnership with St. George's Primary School, Wallasey, Merseyside and [INSERT].\r\n\r\nProgrammes will be available through the following phases:\r\n• Primary Education (3-7 phase)\r\n• Primary Education (5-11 phase)\r\n\r\nOur partnership believes that every success story starts with great teachers and great Wirral teachers train to teach at Kingsbridge. \r\n\r\nKingsbridge is a dynamic teacher training provider with a proven track record of excellence. With Kingsbridge you will build a teaching career you can be proud of... through a strong support network and through training in an exciting environment.\r\n\r\nOur Wirral partnership aims to support local trainee teacher development across the Wirral. In line with the core content framework, you will train by drawing on the best available evidence, to improve education outcomes and to make a difference to the education of local Wirral children.\r\n\r\nWe will also ensure that you have early, career-stage-appropriate opportunities to achieve your ambitions and experience our wonderful profession. \r\n\r\nTo find out more about training to teach with Kingsbridge please visit https://www.kingsbridgeteachertraining.co.uk/wirral\r\n\r\n","interviewProcess":"Your interview process at Kingsbridge will operate in three phases:\r\n\r\n• (1) The Formal Interview: Just like any other job interview, you will be asked a series of questions designed to illustrate how you meet our standards. We will be looking at your communication skills, knowledge and experience and your personal attributes. \r\n\r\n• During the formal interview process candidates will be required to demonstrate high standards of safeguarding that promotes the welfare of young people. Our SCITT creates a culture of safer recruitment and our recruitment procedures help us deter, reject, or identify people who might abuse children. Please be aware that our recruitment procedures are robust in this regard.\r\n\r\n• (2) School Based Assessment: Once you’ve made it through the interview you’ll be invited to visit one of our partner schools. You may be asked to deliver an activity with a small group of pupils. We will be looking at how you engage with the young people, how you capture their attention and fire their imaginations. We’ll also be looking for self-confidence in front of the class and your creativity in devising and delivering an entertaining and educational session.\r\n\r\n• (3) The Conditional Offer: When you make it through the first two phases we will make you an offer of a place. This is designed to make sure that your literacy and numeracy skills are up to an acceptable standard for teaching.","howSchoolPlacementsWork":"You’ll be placed in a Wirral school for your main placement during your training. \r\n\r\nPlacements during the year ordinarily operate as follows: \r\n1) Main Placement - Sept to Christmas \r\n2) Second Placement - Jan to Feb Half Term \r\n3) Return to Main Placement - Feb Half Term to Graduation \r\n\r\nYou can’t pick which school you want to be placed within, but we will try to place you in schools you can commute to.\r\n\r\nIn addition to the normal placements outlined above all our trainees engage in a range of additional short-term intensive school placements. \r\n\r\nOur intensive placement scheme provides opportunities for trainees to benefit from highly focused practice of, and feedback on, essential components of the curriculum, to fully support trainees in the method and practice of teaching, especially in academic subject or theoretical concepts.","personalQualities":"A genuine passion for teaching.\r\n\r\nIt would be helpful if you have some recent experience with children and learners to confirm your career choice, but this is not a prerequisite before applying to Kingsbridge Teacher Training. We look for the potential to train to teach, for example excellent communication skills, team work, responding to feedback and flexibility.\r\n\r\nKingsbridge operates strict safer recruitment procedures and makes sure all appropriate checks are carried out on all trainees who join the SCITT. Kingsbridge promote welfare of children and your people at every stage.","otherRequirements":"Original certificates for your degree and GCSE subjects or equivalents, will need to be brought with you to your interview. \r\n\r\nIf you are in your final year of study, please enter a predicted grade.\r\n\r\n*If your qualifications were not gained in the UK, you can visit the National Academic Register Centre (NARIC) website to find out whether your qualifications are considered to be equivalent to UK GCSEs and degrees.\r\n\r\nEvery lesson shapes a life through Kingsbridge Teacher Training.","status":1,"createdAt":"2021-09-23T10:01:12.535Z","updatedAt":"2021-09-27T13:58:54.098Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
