{"id":"1b58eab4-8fba-43ce-a4b6-0861f4090763","name":"Primary (3-7)","code":"34S3","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_7","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"a24e36c3-b0e4-44cd-851a-ebf88d07aeae","name":"Saint Johns Middle School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"d8c263a3-b1da-4ce9-bd5f-246ccd63236b","code":"19S","name":"South Bromsgrove Teacher Training Partnership"},"accreditedBody":{"id":"6019b3ce-f2f6-4b0e-b2a9-5813d74c4d54","code":"W80","name":"University of Worcester"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":13700,"feeDetails":"Fees are subject to change for 2020/21","aboutCourse":"South Bromsgrove High Teacher Training Partnership is a well-established and highly succcessful provider of School Direct Initial Teacher Training. Our Primary School Direct courses are coordinated by St John’s Cof E Middle School,Bromsgrove,  in collaboration with the University of Worcester and a strong partnership of schools, offering vibrant and high-achieving training placements. Our growing partnership of schools are situated across Bromsgrove, Droitwich, Redditch, Worcester and Dudley, allowing us the flexibility to place trainees in schools based on their location and specific training needs.\r\n\r\nWhat we can offer you:\r\n\r\n* An Outstanding lead training school (Ofsted, 2012).\r\n* An alliance of placement schools committed to high quality training and mentoring.\r\n* A comprehensive, evidence based Professional Studies programme with input from leading experts in education.\r\n* Fully trained and dedicated subject mentors.\r\n* Opportunities to broaden your experience of school life through our extensive Extra-Curricular Programme.\r\n* Strong and successful partnership with University of Worcester, providing excellent levels of support throughout the training year.\r\n* High quality support in becoming an outstanding, creative and reflective teacher.\r\n* QTS and PGCE qualification, with credits towards Masters Accreditation","interviewProcess":"The School Direct Programme is a school-based training year that demands a full-time commitment. Our selection process is thorough and designed to help you feel confident that the School Direct pathway is the right route into teaching for you. Interviews will be held at St John’s CofE Middle School in collaboration with our partner First, Primary and Middle Schools and the University of Worcester.\r\n\r\nThe interview will involve:\r\n\r\n* leading an activity with a small group of children;\r\n* a written activity based on some pre-reading;\r\n* an interview.\r\n\r\nAll details relating to the activity and the written task will be sent out in good time, prior to interview.\r\n\r\nThe interview day is always a very positive experience for all concerned. We endeavour to make you feel welcome and we encourage you to come with lots of questions about the course. Interviews may be organised in groups, whereby you will be interviewed with 4 or 5 other candidates, or they may be arranged individually. \r\n\r\nIn the event of ongoing social distancing measures, all interviews will be carried out online.","howSchoolPlacementsWork":"The Primary Early Years course will enable you to teach children in the 3-7 age range.\r\nAs a Primary Early Years trainee teacher, you will undertake three School Experience placements in two different schools. Throughout your school experience, you will gain experience in two different key stages in order to meet the requirements of the qualification.  Your School Experience 1 (Autumn) and School Experience 3 (Summer) will be based at your main school.  School Experience 2, (Spring), will be based in a contrasting school.  Your main school will be determined by the South Bromsgrove Teaching School Alliance in collaboration with the Primary Lead at St John's CofE Middle School and the University of Worcester. In placing trainees, we will take account of your location and specific training needs. We are keen to expand our partnership of schools, should trainees wish to train in specific schools, with whom they have existing links. All partnership schools are subject to Quality Assurance procedures, carried out by the University of Worcester.\r\n\r\nTrainees will spend the majority of the time in school, but will spend one day a week in Professional Studies sessions. This will take place either at the University of Worcester or one of our alliance schools. These sessions cover all aspects of the Teacher Standards and draw on the extensive expertise from within the South Bromsgrove Teaching School Alliance. Through our programme, you will be able to visit a range of different schools and institutions and network with staff and trainees from across our network. We take a huge amount of pride in our Professional Studies as we ensure that the course not only prepares trainees for the demands of the training year (including teaching practice and assignments), but also prepares trainees for a career in primary education. \r\n\r\n","personalQualities":"What are we looking for – Applicants will need to demonstrate:\r\n\r\n* A commitment to the welfare and well-being of young people;\r\n* Enthusiasm for teaching and an ability to relate to young people;\r\n* A passion for your subject and for education in general;\r\n* A willingness to learn through experience and respond to feedback;\r\n* Some prior school experience is strongly recommended.","otherRequirements":"Prospective trainees will be subject to an Enhanced DBS check. ","status":1,"createdAt":"2021-07-06T10:54:28.114Z","updatedAt":"2021-09-15T09:57:45.800Z","canSponsorStudentVisa":"yes","cycle":"2024"}
