{"id":"7bbf3679-1eeb-406b-979e-45a6e27f1096","name":"Art and Design","code":"2XBP","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"d461a678-3335-4ca2-9616-1dc479d31a49","code":"W1","name":"Art and design"}],"locations":[{"id":"b8575786-8144-44b6-b31d-7c4f7dd41fa7","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"d8c263a3-b1da-4ce9-bd5f-246ccd63236b","code":"19S","name":"South Bromsgrove Teacher Training Partnership"},"accreditedBody":{"id":"0ab5238e-606a-4f42-9aea-90d321ad7dc8","code":"2B3","name":"Haybridge Alliance SCITT"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"This course prepares trainees to teach Art and Design within secondary schools, from Key Stage 3 to Key Stage 5. The course involves a combination of practical teaching experience and taught modules on pedagogy and broader aspects of education. Trainees will be placed at South Bromsgrove High Academy for the main placement and will undertake a second, contrasting school experience placement at another school.  Second school placements will be arranged during the first term and will be carefully matched to the needs of the trainee.\r\n\r\nThe professional studies element of the course will be coordinated by Haybridge Alliance SCITT on a particular day each week. The unique aspect of this programme is that the delivery will be shared across schools in a wider alliance, who have specific areas of expertise. This will also allow insight into First, Middle, High and Special Schools. Much of the Professional Studies element will involve linking theory to classroom practice.\r\n \r\nThe subject based elements of the programme will be delivered in collaboration with Haybridge Alliance SCITT and Birmingham City University.  Trainees are required to undertake 3 assignments across the year. These will be coordinated by Birmingham City University.\r\n\r\nAssessment on this course is carried out via a combination of lesson observation and written assignment.  On completion, trainees receive QTS and a PGCE qualification.","interviewProcess":"Interviews will take place at South Bromsgrove High Academy.  These will typically take one whole day and will involve the following:\r\n\r\n* lesson observation of an experienced teacher\r\n* written task \r\n* mathematics exercise\r\n* subject knowledge interview\r\n* small group / class teaching\r\n* formal interview\r\n\r\nInterviews will be conducted by the Lead Mentor and the Subject Mentor for Art and Design.","howSchoolPlacementsWork":"This programme is based at South Bromsgrove High Academy. The school, in collaboration with Haybridge SCITT will arrange a second school experience placement that will take place during the Spring term. The school will be selected based on the training needs of the individual trainee and location.\r\n\r\nTrainees will be assigned a designated Subject Mentor whilst in school, along with a Professional Mentor.  Mentors will work together to ensure that trainees are making good progress in their teaching practice and that all emerging training needs are being met. \r\n\r\nThe school experience placements will ensure that trainees are able to teach across the full age range, from 11 - 18.  \r\n\r\nTrainees will spend the majority of their time in school, but will attend Haybridge SCITT or Birmingham City University for professional and subject studies on one day per week.\r\n","personalQualities":"We are looking for the following personal qualities in our prospective trainees:\r\n\r\n* A commitment to the welfare and well-being of young people\r\n* Enthusiasm for teaching and an ability to relate to young people\r\n* A passion for your subject and for education in general\r\n* A willingness to learn through experience and respond to feedback\r\n* Some prior school experience is not expected, but is recommended\r\n\r\n","otherRequirements":"All prospective trainees will be subject to a medical questionnaire, assessing their fitness to teach and an Enhanced DBS check.","status":1,"createdAt":"2021-07-06T10:54:28.048Z","updatedAt":"2021-09-29T14:03:06.080Z","canSponsorStudentVisa":"no","cycle":"2024"}
