{"id":"3a02707c-a82d-44af-8c58-f6cd03489117","name":"History","code":"3CX2","qualification":"pgde_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"5a3609a0-5bbb-4377-b919-5d89932ab622","code":"V1","name":"History"}],"locations":[{"id":"5a32491d-143a-4545-9377-16ddb58d5234","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"3a0d00b9-3749-4c51-a5f0-c53c6f19c243","code":"242","name":"St Paul’s Caritas Christi"},"accreditedBody":{"id":"c357e0fa-802e-471b-818a-d0cd1434f9cd","code":"B32","name":"University of Birmingham"},"profPost":"PG","degreeGrade":"1","english":"2","maths":"2","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"\r\n\r\nhttp://www.stpaulgl.bham.sch.uk\r\n\r\nThis postgraduate programme leads to Qualified Teacher Status and a full PGCE. The programme will prepare you fully for the practical demands of teaching, learning from experienced outstanding teachers and immediately put your new skills into practice. \r\n\r\nWe are delighted to offer School Direct training courses by working in close partnership with the University of Birmingham and we play a key role in recruiting and selecting trainees. By developing this partnership, we all strive to provide  a high-quality training programme which leads to the award of the  PGDipEd with QTS at Secondary level. \r\n\r\nApplicants apply direct to St Paul’s Caritas Christi (UCAS Provider Code 242) and undertake placements within the our school’s partnership.  Our Partnership include a mixture  of primary and  secondary based in central Birmingham.\r\n\r\nSchool Direct gives you the chance to combine a school-based year with the  outstanding University programmes offered at the University of Birmingham. You will work as part of the teaching team from day one and will learn from experienced colleagues in the school, whilst also benefiting from the training, support and expertise of University of Birmingham tutors.\r\n","interviewProcess":"\r\nhttp://www.stpaulgl.bham.sch.uk\r\n\r\nThe team at St Paul’s Caritas Christi will be co-ordinating the recruitment process, following your application being checked by the Admissions department at the University of Birmingham. \r\n\r\nApplicants will be selected jointly by  relevant staff from the University and the school. The interview usually takes up to half a day, including an introduction from the Headteacher, a tour of the school and a range of activities. The interview will take place at a number of schools, depending on available spaces. \r\n\r\nFull details of the interview process, including any written tests, venues and times will be sent to applicants at least a week in advance of the interview date. Applicants will know, prior to interview, which school(s) they are being interviewed for.\r\n\r\nThe interview will normally include a short teaching activity, usually between 20 – 30 minutes, delivered to a small group of pupils. Applicants will always be informed about the topic for the teaching activity and the age group/ability of the students. \r\n\r\nThere are a set number of places available for each programme, so we recommend that you apply as early as possible to give yourself the best chance of obtaining a place. We will close courses once we have filled all of the available places. This will show on the UCAS website.\r\n","howSchoolPlacementsWork":"http://www.stpaulgl.bham.sch.uk\r\n\r\nIf you accept an offer you will be based in your placement school for extended placements throughout the whole school year. As a committed group of professionals, we invest in our School Direct trainees, and see the School Direct year as the start of your successful career with us. NQTs in our schools benefit from our high quality, year-long NQT Induction Programme. You will be assigned two mentors from the staff in your school, one from your subject area (subject mentor) and also a senior member of staff (professional mentor).  \r\n\r\nYou will have significant input during your University based training and will have a comprehensive two week induction to the course, followed by focus weeks at the university at the beginning of the Spring and Summer terms. During your extended school placements, you will attend university training on alternate Mondays all year. \r\n\r\nYou will be trained in a highly supportive and aspirational environment that will enable you to develop the professional knowledge, necessary skills and expertise for the delivery of creative, purposeful and challenging teaching and learning.\r\n\r\nThe school-based training will be delivered by our teachers who have a wide range of experience and expertise within the partnership schools. This will be enhanced by regular attendance at university. You will be assigned to  schools in the partnership in which you will complete extended teaching placements. All schools have comprehensive intakes and you will gain valuable experience of working with young people of all abilities. You can express a preference for a placement at a specific school in the partnership but we cannot promise to meet your request.\r\nOur mentors are outstanding teachers who are required to undertake a rigorous training programme to develop their mentoring skills. This includes coaching, effective classroom observation and feedback skills.\r\n\r\nFrom the beginning you will be treated as a full member of staff and will attend staff meetings and INSET opportunities, including full staff development days. You will be in school from the beginning of the school year so you will feel part of the team from day one.  \r\n","personalQualities":"http://www.stpaulgl.bham.sch.uk\r\n\r\nWhat are we looking for from our trainees?\r\n\r\n•\tYour enthusiasm for education. \r\n\r\n•\tIt is important to explain why you want to teach. \r\n\r\n•\tWhat can you offer and why you will make a good teacher.\r\n\r\n•\tHow you know that teaching is right for you. \r\n\r\n•\tWhat experience you have had in schools that has confirmed this. \r\n\r\n•\tConvey your communication skills. \r\n\r\n\r\n","otherRequirements":"•have a GCSE in Maths, English (grade 4 or above), or an equivalent qualification obtained before application. If these grades have not been obtained, GCSE Maths and English (Grade 4) must be attained as a condition of entry. If you are offering an alternative qualification check with us before applying.\r\n•complete an enhanced Disclosure and Barring Service (DBS) check.\r\n•complete relevant checks to ensure you have the health and physical capacity to teach.\r\n•agree to abide by the University of Birmingham Code of Professional Conduct and Fitness to Practise.","status":1,"createdAt":"2021-07-06T10:52:34.431Z","updatedAt":"2021-10-01T22:08:49.128Z","canSponsorStudentVisa":"yes","cycle":"2024"}
