{"id":"7f0be4c4-b24f-4ec2-828d-ad6ef703efef","name":"Religious Education","code":"2YYW","qualification":"pgce_with_qts","startDate":"2023-07-31T23:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"724b5d16-28dd-4431-bc17-ea4be4daedc4","code":"V6","name":"Religious education"}],"locations":[{"id":"5a32491d-143a-4545-9377-16ddb58d5234","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"3a0d00b9-3749-4c51-a5f0-c53c6f19c243","code":"242","name":"St Paul’s Caritas Christi"},"accreditedBody":{"id":"ef09ce50-ccfc-4346-a0ce-43e840153dab","code":"W20","name":"The University of Warwick"},"profPost":"PG","degreeGrade":"1","english":"2","maths":"2","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"www.stpaulgl.bham.sch.uk\r\n\r\nThis postgraduate programme leads to Qualified Teacher Status and a full PGCE. The programme will prepare you fully for the practical demands of teaching, learning from experienced outstanding teachers and immediately put your new skills into practice.\r\n \r\nTraining sessions and Masters assignment sessions are held at the University of Warwick on either Mondays or Fridays throughout the year (depending on the subject) and a range of schools during the year. \r\n\r\nThere are three elements to the University of Warwick School Direct course which are designed to equip you with the knowledge, understanding and practical skills you will need to pursue a successful teaching career:\r\n\r\n•\tSubject Studies - looks at all aspects of how to teach your subject, including planning, teaching, assessment and classroom management.\r\n•\tProfessional Studies - focuses on working in classrooms and schools and on the broader context of teaching today.\r\n•\tProfessional Practice - placements provide opportunities for observation, practice and investigation in a wide variety of our partnership schools.\r\n\r\nFeedback on Assignments: The University tutors provide written formal feedback which will identify the strengths of the academic piece and also provide trainees with actions for future work. If trainees do not initially pass an assignment they are supported by a one hour tutorial with one of their markers to review their assignment and draw up an action plan for re-submission.\r\n\r\nKey aims:\r\n\r\n•\tBuild your confidence and gain practical teaching experience in contrasting schools.\r\n•\tLearn about the latest curriculum developments, issues and innovations.\r\n•\tDeepen your understanding of teaching, and learn about the opportunities for continued professional development and the relationship between educators and society.\r\n","interviewProcess":"www.stpaulgl.bham.sch.uk\r\n\r\nWhat are we looking for from our trainees?\r\n\r\n•\tYour enthusiasm for education. \r\n•\tIt is important to explain why you want to teach. \r\n•\tWhat can you offer and why you will make a good teacher.\r\n•\tHow you know that teaching is right for you. \r\n•\tWhat experience you have had in schools that has confirmed this. \r\n•\tConvey your communication skills. \r\n\r\nThe team at St Paul’s Caritas Christi will be co-ordinating the recruitment process. The interview usually takes up to half a day, including an introduction from the Headteacher, a tour of the school and a range of activities. The interview will take place at a number of schools, depending on available spaces. Full details of the interview process, including any written tests, venues and times will be sent to applicants at least a week in advance of the interview date. Applicants will know, prior to interview, which school(s) they are being interviewed for.\r\n\r\nThe interview will normally include a short teaching activity, usually between 20 – 30 minutes, delivered to a small group of pupils. Applicants will always be informed about the topic for the teaching activity and the age group/ability of the students. \r\n\r\nThere are a set number of places available for each programme, so we recommend that you apply as early as possible to give yourself the best chance of obtaining a place. We will close courses once we have filled all of the available places. \r\n\r\n","howSchoolPlacementsWork":"www.stpaulgl.bham.sch.uk\r\n\r\nIf you accept an offer with St Paul’s Caritas Christi you will be based in your placement school for the whole year, except for a 6 week placement in a complementary school during the Spring Term. As a committed group of professionals, we invest in our School Direct trainees, and see the School Direct year as the start of your successful career with us. \r\n\r\nNQTs in our schools benefit from our high quality, year-long NQT Induction Programme. You will be assigned two mentors from the staff in your school, one from your subject area (subject mentor) and also a senior member of staff (professional mentor).  Our mentors are outstanding teachers who are required to undertake a rigorous training programme to develop their mentoring skills. This includes coaching, effective classroom observation and feedback skills.\r\n\r\nFrom the beginning you will be treated as a full member of staff and will attend staff meetings and INSET opportunities, including full staff development days. \r\n\r\nYou will be in school from the beginning of the school year so you will feel part of the team from day one. You will be trained in a highly supportive and aspirational environment that will enable you to develop the professional knowledge, necessary skills and expertise for the delivery of creative, purposeful and challenging teaching and learning.\r\n\r\nThe school-based training will be delivered by our teachers who have a wide range of experience and expertise within the partnership schools. This will be enhanced by regular attendance at university. All schools have comprehensive intakes and you will gain valuable experience of working with young people of all abilities. You can express a preference for a placement at a specific school in the partnership but we cannot promise to meet your request.\r\n","personalQualities":"What are we looking for from our trainees?\r\n \r\n \tYour enthusiasm for education. \r\n\r\n \tIt is important to explain why you want to teach. \r\n\r\n \tWhat can you offer and why you will make a good teacher.\r\n\r\n \tHow you know that teaching is right for you. \r\n\r\n \tWhat experience you have had in schools that has confirmed this. \r\n\r\n \tConvey your communication skills. \r\n","otherRequirements":"Fitness to Teach\r\n\r\nIn order to comply with the Department for Education, all applicants must satisfy to the University their physical and mental suitability to undertake teacher training.\r\n\r\nSchool Experience\r\n\r\nAlthough it is not a requirement, we recommend that you have had experience in schools focusing on mainstream Key Stages 3, 4 and 5, so that you are familiar with the atmosphere and demands across Secondary.\r\n","status":1,"createdAt":"2021-07-06T10:52:34.001Z","updatedAt":"2021-10-01T22:05:29.140Z","canSponsorStudentVisa":"yes","cycle":"2024"}
