{"id":"ec735884-c285-4aaa-960a-535e98a1579d","name":"Primary","code":"E616","qualification":"pgde_with_qts","startDate":"2022-09-01T09:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"e6be6a9c-8696-4b88-8fbd-1ba1bef1b6fc","code":"11","name":"Computing"},{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"e50ef344-a1fd-4a25-8381-c2910d03a623","name":"Main Site","isPublished":"false","status":"new","vacancies":"full_time"},{"id":"531bd5bf-63c1-4a1f-9f6d-7c40536ec62e","name":"Main Site","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"5a32491d-143a-4545-9377-16ddb58d5234","name":"Main Site","isPublished":"true","status":"running","vacancies":"full_time"}],"trainingProvider":{"id":"3a0d00b9-3749-4c51-a5f0-c53c6f19c243","code":"242","name":"St Paul’s Caritas Christi"},"accreditedBody":{"id":"c357e0fa-802e-471b-818a-d0cd1434f9cd","code":"B32","name":"University of Birmingham"},"profPost":"PG","degreeGrade":"1","english":"2","maths":"2","science":"2","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"no","courseLength":"OneYear","aboutCourse":"The Level 6 Teacher with QTS Apprenticeship Programme is an employment-based route into teaching.  This route is for people with a degree who receive a salary while training.  The apprenticeship will typically be 12 months in duration (with 12 months as the minimum length). The University of Derby is the main provider of the apprenticeship.\r\nThe Apprenticeship Programme consists of 80% on the job training and 20% off the job training. Usually the 80% on the job training will consist of the apprentice being in a substantive role as an unqualified teacher working four days per working week, delivering a subject specialism or teaching a specific age phase of children.  The 20% off the job training consists of a variety of activities which will usually take place one day per working week.  The 20% off the job training has three specific strands:\r\n\r\n*Professional Studies – this covers aspects which relate directly to developing professional practice in the classroom.  For example, learning how to plan and design learning experiences for pupils, assessment of pupils, behaviour management, statutory responsibilities (safeguarding).\r\n\r\n*Academic Studies – this covers aspects which have been designed to complement professional studies/practice and to develop thinking teachers who make research informed decisions in their classrooms. \r\n\r\n*Subject specialist/age phase knowledge and pedagogy – this element is personalised to the subject specialism or age phase the apprentice is teaching to help them develop their professional skills.  This could include activities such as attending subject specialist training, observing experienced practitioners, supported marking and work scrutiny.\r\n","interviewProcess":"Interviews will usually take place at Forest Way School and dates will be set as required throughout the year.\r\n\r\nThe interviews will comprise of:\r\n\r\n* Group discussion on selected topics and current educational issues\r\n* Individual interview\r\n* Completion of a Literacy and Numeracy test (subject to change)\r\n* Visit to class to meet pupils and teachers (where possible)\r\n \r\n","howSchoolPlacementsWork":"As part of the 80% on the job training, apprentices must teach in two different school settings to ensure compliance with statutory Initial Teacher Training criteria and supporting advice  as issued by the Department for Education.","personalQualities":"We are seeking to recruit highly motivated and inspiring individuals who have:\r\n\r\n* a genuine commitment to teaching\r\n* excellent communication skills \r\n* ability to form good and effective relationships\r\n* reflective qualities \r\n* emotional resilience \r\n* awareness of current educational issues  \r\n* energy and a sense of humour!\r\n* experience  in educational related settings, or wider experience of working with children\r\n\r\nPlease use your personal statement to highlight these qualities and give us a clear picture of why you want to teach.\r\n","otherRequirements":"Trainees must demonstrate the required competencies in the Fundamentals and English and Maths outlined by the Department for Education before Qualified Teacher Status is awarded. \r\nTo ensure trainees meet the required competencies you will be required to undertake and pass the University’s agreed assessment which will take place when you commence your course. Full details of the required competencies and assessment will be provided in due course.   Please note it is the trainee’s responsibility to secure these fundamental skills.\r\n\r\n","status":2,"createdAt":"2021-07-06T10:53:08.546Z","updatedAt":null}