{"id":"3f54a8fb-12d7-4719-bc93-f3ac85831a0f","name":"Primary","code":"35MZ","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"d990cdbd-626f-417c-81d4-420dd5de9edd","name":"Dore Primary School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"60f7e7de-aad1-4b67-bbbc-bf973e786d12","code":"13C","name":"Mercia Learning Alliance"},"accreditedBody":{"id":"43920484-d42a-42ca-8071-74b1ff5e81cc","code":"S97","name":"The Sheffield SCITT"},"profPost":"BO","degreeGrade":"9","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We do not offer equivalency tests ourselves but there are 3rd party providers who do e.g. equivalencytesting.com and A Star Equivalency. \nThere are up front costs associated with these courses which you will need to fund. As the test centres could be a distance from where you live there could also be travel costs.  \nIn addition you may need to book the test in advance. So make sure you give yourself plenty of time to pass the test before our course starts in September.","courseLength":"OneYear","feesUK":9250,"feeDetails":"There are Student Loans available to pay the fees. \r\n\r\nIf you decide to pay privately then the payment schedule is:\r\n\r\n* Term 1 : £2,625\r\n* Term 2 : £2,625\r\n* Term 3 : £4,000\r\n\r\nWith each amount being due on the first day of each term.\r\n\r\nYou will have to pay the cost of the Enhanced Criminal Record Check in advance of starting the course. \r\n","financialSupport":"We are not able to offer any monetary financial support to trainees.  \r\n\r\nHowever,\r\n\r\n* We will support you with the Student Finance Application process. \r\n* We will keep you informed as to whether you are eligible for a government funded Train to Teach Bursary. \r\n\r\n\r\nWe also provide free membership of the Westfield Healthy Extras emotional wellness support package to support you during your ITT year.\r\n","aboutCourse":"The Primary Mercia Learning Alliance School Direct course is overseen by Dore Primary School, Sheffield. Dore is a large primary school in south-west Sheffield, and has been at the heart of School Centred Initial Teacher Training for over 20 years.  Dore Primary was a founding member of the ‘National SCITT in Outstanding Primary Schools’ in the late 1990s, and have been advocates of the school-centred approach to teacher training ever since.\r\n\r\nThis course is 5 - 11 years and will entail 4 days in school. During time in school you will be guided by an experienced mentor. One day per week you will join other teacher trainees. You will receive high quality training on all aspects of the Teacher Standards including: teacher presence and behaviour management, planning and teaching effective lessons, and how to really stretch and challenge students. \r\n\r\nThere are three formally assessed teaching practices throughout the year. You will begin, and spend the majority of the year, in your ‘Home School’ and there will be the opportunity to complete one teaching practice in a contrasting primary school, in an alternate Key Stage. \r\n\r\nOur PGCE is delivered through the University of Hull. You will spend approximately 3 days over the year with your tutors from the University of Hull. \r\n\r\n\r\nThe 100% school-based approach we use means our own outstanding teachers are at the heart of your development. You will train by working alongside - and being mentored by - people who won't ask you to do anything they can't demonstrate by doing well themselves.  They will be working with the same children you will be teaching, meaning conversations regarding pedagogy and methodology are pertinent and relevant.\r\n\r\nWith no blocks of time out at a University you will also experience the full cycle of the school year from welcoming and settling new students in September to celebrating the success of school leavers in July and the full annual cycle between.  By the end of your year with us, you will be ready to teach across the full year as an ECT.\r\n\r\n","interviewProcess":"After completing the online application we shortlist applicants based on qualifications, experience and evidence of being ready to train to make a good teacher. \r\n\r\nInterviews take place at Dore Primary School and are led by senior leaders and a member of the Mercia Learning Alliance team. The interview will consist of a welcome and introduction to the course, a 15 minute teaching activity and a formal interview.\r\n\r\nWe also ask you to sit mock numeracy and literacy papers to help us identify if you will need support before you start your ITT course. \r\n\r\nWe also ask you to reflect on your teaching activity.\r\n","howSchoolPlacementsWork":"You will spend most of the training year in one school (the 'Home School') and these schools are central to the selection process and our school-based interview system. \r\n\r\nYou can express a preference for your Home School based on location, preference for the type of school or a personal connection to a community you want to serve, but we cannot guarantee to meet everyone's preference.\r\n\r\nThere is also a short alternative placement in a contrasting alliance school during your training year and a brief experience in the phase you are not training to teach in.\r\n\r\nIt would be sensible for trainees to base themselves within commutable distance of their Home School so these are finalised with you before the summer holidays to allow you to arrange your accommodation. We make every attempt to make sure the alternative placement school is in an accessible location but it may involve a few weeks of travelling further to get that all important contrasting experience in the right school for you.\r\n\r\nCurrently, schools you can train in within our alliance are:\r\n\r\n\r\n* Dore Primary School\r\n* The Nether Edge Primary School\r\n* Totley Primary School\r\n* Hunters Bar Infants School\r\n\r\n\r\n\r\n","personalQualities":"At Mercia we are looking for the next generation of outstanding teachers and subsequently those who will lead our schools in the future.\r\n\r\nWe are looking for applicants with:\r\n\r\n* Commitment to teaching\r\n* Insight into the realities of teaching\r\n* Resilience\r\n* An analytical approach to problem solving\r\n* Enthusiasm and passion for education\r\n* Interpersonal and communication skills\r\n\r\nWe are passionate about education and the difference it makes to young people and society as a whole. If you share our passion, please come and join us!\r\n","otherRequirements":"You will need to pass an Enhanced Criminal Record Check. \r\n\r\nIdeally you will have some experience working with children in a school or another organisation e.g. nursery, playgroups, scouts etc.\r\n\r\nAs we are not allowed to hold a licence to sponsor visa applications you will need to be a UK citizen or have been granted “Settled Status” by the U.K. Home Office.\r\n\r\nIf you are not a UK citizen you will need to prove you have access to Public Funds or have the ability to support yourself financially during your course prior to being offered a place.   \r\n","status":1,"createdAt":"2021-07-06T10:56:00.344Z","updatedAt":"2021-09-22T11:23:21.498Z","canSponsorStudentVisa":"no","cycle":"2024"}
