{"id":"f3ccaec6-ea19-455b-84a7-bb4f2492c239","name":"Primary (5-11)","code":"2S4X","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"f50b89db-9687-4ad0-b23d-6abd53443f4a","name":"Woodfield Infant School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"142aadee-df2b-4d1e-95cc-253be1c6808d","name":"St Peter's CE Primary and Nursery School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"585f0d71-f778-4cd8-9fca-47490bc2ef1e","code":"2AN","name":"Shropshire Primary Partnership"},"accreditedBody":{"id":"e843cb68-d310-478c-8dba-cf9633fea086","code":"C55","name":"University of Chester"},"profPost":"BO","degreeGrade":"0","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"Please visit the following link for more information about the equivalency tests https://www.edgehill.ac.uk/study/equivalency/","courseLength":"OneYear","feesUK":9250,"feeDetails":"Course fees can be covered by a Student Loan as with all university courses and repayments will only start once full time employment begins.","financialSupport":"The course is non-salaried.","aboutCourse":"Teaching is an extremely rewarding and challenging career. Our course is designed to provide you with the knowledge, understanding and skills that you need to be an outstanding teacher.\r\n\r\nTrainees will complete a total of 180 days of training.  60 days will be academic study and 120 days will be based in the classroom, observing and building up to whole class teaching as soon as possible.\r\n\r\nThe benefit of School Direct, as opposed to the conventional PGCE, is that the School Direct programme is based around school embedded learning with trainees spending a minimum of two days per week in classrooms from the second week of the programme resulting in more confident, independent and effective teachers.\r\n\r\nTrainees will be trained as part of a supportive group and modules will be delivered across the year to all Shropshire Primary Partnership trainees.  There will be a range of modules including Meeting Children's Needs - within and beyond the classroom, Pedagogical Excellence, The Creative and Effective Curriculum and Reflective Practice. \r\n\r\nUniversity staff will deliver the PGCE elements of the course at The University Centre, Shrewsbury and local practitioners will lead tuition in the subject specific areas.  A typical week may include one day's university training, two day's school-led training (some of which will include personal study) and two day's classroom practice implementing theory into practice.  This flexible structure with its blend of academic and practitioner expertise ensures that theory is embedded into practice at the earliest possible opportunity.\r\n\r\nSuccessful completion of our programme will provide candidates with Qualified Teacher Status and a Post Graduate Certificate in either Primary or Early Years (3-7) Education.\r\n\r\n","interviewProcess":"We are looking for candidates who have an empathy and understanding of the demands of teaching in a primary classroom.  You should enjoy working with children and want to get involved with the life of the school beyond the classroom. Confidence in front of a classroom of children is essential which is why we would encourage all applicants to find some voluntary observation experience before applying.  As part of the interview process you will be required to teach part of a lesson so we can gauge your clarity of explanations as well as how you engage with our young people.\r\n\r\nOnce we receive your application, be reviewed by senior colleagues from Shropshire Primary Partnership and our University partner.  We will look at your experience and qualification relevancy and will invite you to interview if your application meets our criteria.  If you are unsuccessful at this stage, you will be notified through your Teacher Training account.\r\n\r\nIf successful, you will be invited to interview at school which will involve a mini-teach activity, literacy test and a formal interview.  The programme will be sent to you in advance and you will have 7 days to respond to the invitation.  You should allow half a day for your interview.\r\n\r\nIf an offer of a place is made, it will either be unconditional or conditional based upon successful completion of your degree, if you are still at university, or on the basis of gaining more experience observing in a primary school.","howSchoolPlacementsWork":"On appointment, trainees will be placed with a School Direct host school and be provided with an experienced professional tutor and a university based tutor as well as an alliance based team to support you throughout your PGCE programme.\r\n\r\nThere are a series of three school block placements across which trainees will experience outstanding teaching in Early Years, Key Stage 1 and Key Stage 2 within a variety of contexts in a range of good or outstanding schools within the Shropshire Primary Partnership:\r\n\r\nBeginning Placement - 4 weeks in November/December\r\nDeveloping Placement - 5 weeks in January/February\r\nExtending Placement - 8 weeks in April/May/June\r\n\r\nPlease note that your school placements could be at any of our partner schools.  You will need to take into consideration travel time and distances that may be involved though we will try to take personal circumstances into consideration when placing trainees.  Our partner schools are located in and around the Shrewsbury and North Shropshire area.","personalQualities":"We are looking for candidates who have an empathy and understanding of the demands of teaching in the primary classroom.  You should enjoy working with young people and see teaching as a wider professional duty.  \r\n\r\nAs part of the interview process you will be required to teach part of a lesson so we can gauge your clarity of explanations as well as how you engage with our young people.\r\n\r\nWe are looking for the highest quality graduates who may well bring further work-related experience from previous careers which can help to strengthen their application.\r\n","otherRequirements":"We are looking for applicants who are able to commit the time needed to the training programme which will include academic assignments and study.  We would like candidates who want to be involved in the wider pastoral and extra-curricular life of our schools and who can give the time to this during their training year.  \r\n\r\nYour own transport would be advantageous so you can easily access your school placements within Shropshire.\r\n\r\nAll candidates will be required to undertake DBS clearance via the University of Chester prior to the course commencing.\r\n","status":1,"createdAt":"2021-07-06T10:49:43.046Z","updatedAt":"2021-09-20T13:55:43.489Z","canSponsorStudentVisa":"yes","cycle":"2024"}
