{"id":"bbacf238-c16f-4d4d-a16a-e1c254e2d710","name":"Primary","code":"A951","qualification":"pgce_with_qts","startDate":"2024-01-01T00:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"P","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"dcbbc311-9ab8-415a-bfce-766f01dddc89","name":"Marlbrook Primary School","isPublished":"Y","status":"S"},{"id":"32dc07d9-7aaa-45df-bafb-2be9f4c0f111","name":"St Martin's Primary School","isPublished":"Y","status":"S"},{"id":"6597e765-d932-447b-8f67-921ff380ccaf","name":"Little Dewchurch CE Primary School","isPublished":"Y","status":"S"}],"trainingProvider":{"id":"8e7d52e9-0f3a-4baa-9cbc-2355e052c443","code":"1Y2","name":"Marlbrook Collaboration of Schools"},"accreditedBody":{"id":"6019b3ce-f2f6-4b0e-b2a9-5813d74c4d54","code":"W80","name":"University of Worcester"},"profPost":"PG","degreeGrade":"9","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Grade C/level 4 at GCSE in English Language, Mathematics and Science (or equivalent) (for 2022 entry, applicants must have these qualifications by the start of the course). Alternatively, we offer equivalency Test if you don’t have the required GCSE grade to apply for our courses. Trainees who begin courses before providing evidence of the required GCSE standard (or equivalent) will not be eligible for financial incentives, such as bursaries or grants until they achieve the required standard.\nQualifications not listed?   Contact the Admissions Office for advice by email: AdmissionsB@worc.ac.uk","courseLength":"TwoYears","feesUK":9250,"feesInternational":14100,"aboutCourse":"School Direct is an exciting opportunity to attend a school led training course which enables you to spend  time training in school over a period of 19 months.  This route into teaching is for graduates who prefer the more ‘hands on’ approach.  Straight away you will be placed with an outstanding teacher, learning from the very best.  You will spend 3 days a week training (usually 2 days a week in school and a day at The University of Worcester).  Throughout your training you will have the opportunity to teach in 2 of our partnership schools.  \r\nQualification\r\nPGCE award: Students achieving 60 credits at Masters level and meeting the requirements for Qualified Teacher Status will be awarded Postgraduate Certificate in Education with QTS.\r\n  \r\nBenefits\r\n\r\n*Support throughout the year from outstanding practitioners.\r\n\r\n*You will experience mentoring and coaching to enhance your own teaching skills.\r\n\r\n*High retention rates.\r\n\r\n*University of Worcester work closely with us to ensure your training is seamless for the year.\r\n\r\n*Working in a variety of schools.\r\n\r\n*A guarantee of a job interview at the end of the year if a post is vacant at that time.\r\n\r\n\r\nThe School Direct Programme allows schools to recruit and train their own teachers.  The course lasts for 1 year and is full time.  \r\nFees-£9250 a year.  \r\n\r\nFor more information please see the links below\r\n-University of Worcester School Direct Primary Course\r\n-Department for Education School Direct\r\n\r\n\r\n","interviewProcess":"How we select our trainees\r\nMarlbrook Primary is the Lead school and we will be involved in the recruitment process.\r\nIf successful, the interview will include:\r\n* A short talk and tour from a Senior member from the school you have applied to.\r\n* Information about the course from a member of staff from the University of Worcester and tasks.\r\n* A short activity with a small group of pupils.\r\n*A chance to talk to student Voice (Student Council).\r\n* An individual interview based at the University (this may be online).\r\n\r\nYou will only require one interview and we will let candidates know on the same day if successful.\r\n\r\nSuccessful applicants will require DBS clearance and suitable references.\r\n\r\n\r\n","howSchoolPlacementsWork":"The School Direct training is school-led training, it will last for 19 months and involve 2 placements.  You will select your preferred school when you complete your UCAS application online:\r\n\r\nYou will have opportunity to observe and work with other year groups throughout your practice.  You will receive high quality support from your Mentor and outstanding training opportunities throughout the year.\r\n\r\nStudents will need to attend the University of Worcester .  You will experience a dynamic taught programme, ensuring depth and breadth across the Primary subjects.   You will be assigned a University tutor that will work closely with your mentor at your school placements.\r\n","status":1,"createdAt":"2021-09-29T11:59:39.754Z","updatedAt":"2021-09-29T12:30:56.413Z","canSponsorStudentVisa":"yes","cycle":"2024"}
