{"id":"48aaab5a-1fac-4023-b3a4-503adba78a37","name":"Primary","code":"2TTJ","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"3_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"bdeb9277-3953-46c9-9d84-b600ac95fe9e","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"e4195146-aae7-4f6c-9d14-91edd0962da4","code":"2AW","name":"Henry Maynard Training E17"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We accept equivalency tests from:\nEquivalency Testing: www.equivalencytesting.com\nA Star: www.astarequivalency.co.uk","courseLength":"OneYear","feesUK":9000,"feeDetails":"There are no additional costs for the PGCE, this is included in the £9000 course fee.","aboutCourse":"This programme leads to Qualified Teacher Status (QTS) and the academic award of a Post Graduate Certificate in Education (PGCE). The programme is currently validated by the University of Brighton.\r\n\r\nTrainees on the SCITT programme will be based in one of the schools in the partnership and will attend centre-based training at Henry Maynard Primary School. Initially this will be 2 days per week but as the year progresses it will reduce to one day a week and then less frequently. The remaining days will be spent in school teaching and completing school based tasks.\r\n\r\nTo apply for the SCITT programme it is desirable that you have some experience working in schools or working with children but this does not need to be paid employment, it can be voluntary experience.","interviewProcess":"Candidates are short-listed following reference to the person specification and if successful are invited for interview. The interview day can take place at Henry Maynard Primary or in a school within the partnership. \r\n\r\nThe interview process comprises:\r\n\r\n* an interview with a panel consisting of the Henry Maynard Training E17 \r\nManager and headteachers or representatives from our partner schools\r\n* a short presentation task\r\n* maths and writing tests. (The tests are intended to assess your ability to communicate effectively in written English and your competence in a range of mathematical skills. Maths will be at approximately KS3 level and literacy will be an extended writing task.)","howSchoolPlacementsWork":"You will select to train in either 3-7 or 5-11 phase. In the 3-7 phase you will have one placement in EYFS and one in KS1. In the 5-11 phase you will have one placement in KS1 and one in KS2. Henry Maynard Training E17 arranges the placements.\r\nYour main placement will be in one of our partner schools and you will complete a second placement of 6 weeks in a contrasting school. We work with a range of primary schools in Waltham Forest, Islington and Hackney.","personalQualities":"* Recent experience of working with children. This can be paid or voluntary work.\r\n* The ability to communicate clearly and accurately in Standard English \r\n* A commitment to teach and a motivation to learn\r\n* Well developed personal qualities and skills such as self-organisation, resilience and reflectiveness\r\n* A commitment to equal opportunities\r\n* An understanding of, and commitment to, the safeguarding of children","otherRequirements":"It is the duty of all schools to protect vulnerable children and adults. If you are offered a place on the programme, the school will apply for a DBS check for you.\r\nThe form will contain details of any cautions, convictions, reprimands or any warnings recorded against your name (even where they would generally be considered spent), or will confirm that you have none. It will allow the school to make an assessment of your suitability for access to these vulnerable groups.\r\nPlease visit: www.gov.uk/disclosure-barring-service-check/overview","status":1,"createdAt":"2021-07-06T10:54:18.027Z","updatedAt":"2021-09-28T09:12:26.319Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
