{"id":"d2cb3f4e-38c6-49d2-876e-98550c4bd913","name":"Mathematics","code":"27YG","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"72345aa7-096c-488f-8649-085b8178cadb","code":"G1","name":"Mathematics"}],"locations":[{"id":"9eb24c88-0e92-4105-bf74-5a9d63a2f9a6","name":"Alban Federation","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"71afbbc7-9d1b-42da-aa90-79745d0e2cde","code":"1MN","name":"Alban Federation"},"degreeGrade":"1","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":6900,"feeDetails":"For candidates following a fee paying course, who choose not to take out a student loan, payments are collected on a termly basis.","financialSupport":"AF offers DfE bursaries in eligible subjects while trainees are able to apply for a student loan if they are interested.","aboutCourse":"All Alban Federation (AF) trainees are based at one home school through their training with a second school placement taking place in the Spring term. Trainees are allocated a subject mentor who offer day to day support within the department. Federation training takes place every Wednesday afternoon, with sessions hosted at schools across the partnership. Additional core training is offered at the start of the course to support trainees in the developing teaching skills.\r\n\r\nTrainees are assessed continually through the programme with an acknowledgement that individuals develop at different rates. Trainees will receive feedback through formal lesson observations (at least one a week) and receive a formal review at three points through training. There are no essays to write or assignments to complete. \r\n\r\nAF was ranked in the top 10 of all ITT providers in the Good Teacher Training Guide (2017).","interviewProcess":"Applicants will have the opportunity to complete an informal visit to partner schools offering the subject before progressing to a formal selection day in which they will 'teach' and complete panel interviews. Successful applicants will then proceed to a final interview at Alban Federation.","howSchoolPlacementsWork":"Alban Federation has over 20 schools in its Secondary partnership so most successful applicants will have the chance to work in a school of their choice. Trainees are normally placed on 11-16 training programme, working in schools for at least 4 days a week. The second placement takes place in the half term immediately after the Christmas break.","personalQualities":"Alban Federation is looking for applicants with a real commitment to develop their skills through training. To train to teach candidates should be highly motivated and enthusiastic about their subject and working with young people, \r\nPrior school experience is not necessary.","otherRequirements":"All candidates will be subject to DBS procedures before beginning the programme.","status":1,"createdAt":"2021-07-06T10:50:40.198Z","updatedAt":"2021-07-14T06:54:58.186Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
