{"id":"d1c74b96-dba6-41f4-ad34-7728918ad278","name":"English","code":"36B4","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3aed1aa8-ae46-4b68-92bb-a6cc20655c59","code":"Q3","name":"English"}],"locations":[{"id":"c6b21c23-ed50-4c28-a5b4-5ccca4f41867","name":"Outwood Academy Acklam","isPublished":"Y","status":"R","vacancies":"F"},{"id":"f0962ca9-f25c-4f8e-a82d-e079928c76ba","name":"Outwood Academy Bydales","isPublished":"Y","status":"R","vacancies":"F"},{"id":"78f977c0-0b61-44c8-9ced-8cf3e0234518","name":"Outwood Academy Ormesby","isPublished":"Y","status":"R","vacancies":"F"},{"id":"228a70e9-74c9-4729-8a88-81f368fcc3f6","name":"Outwood Academy Bishopsgarth","isPublished":"Y","status":"R","vacancies":"F"},{"id":"6af20c40-7e38-411f-9eb2-9743d998866a","name":"Outwood Academy Redcar","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"cb7a6a44-a0ab-4db1-83e9-b580d249dea6","code":"2G9","name":"Teach North: County Durham"},"accreditedBody":{"id":"f3a93938-0208-4680-ac22-b564b18ff02b","code":"D86","name":"Durham University"},"profPost":"PG","degreeGrade":"0","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"As a Teach North English trainee, you will promote a love of reading to all students, exploring a wide range of fiction and non-fiction, poems and plays that include works by 19th, 20th and 21st century writers. Alongside your students, you will unpick the craft of the writer and how language is used for effect and influences the readers. \r\n\r\nYou will deliver lessons that are fundamental to personal intellectual growth, enabling students to make sense of the world around them whilst building their confidence in communication. \r\n\r\nYour classroom will be brimming with opportunities for students to write imaginatively and through transactional writing where purpose, audience and format are paramount; these will extend students’ vocabulary as well as their written accuracy. \r\n\r\nOn completion of this programme, you will be awarded a PGCE with QTS and 90 Masters credits in Education from Durham University.\r\n\r\nYou'll be delighted to know that we have a strong partnership with Durham University who are one of the leading departments for education in the UK as they regularly feature in the top five in national university league tables such as 3rd in the Guardian University Guide 2019. This partnership creates a collaborative model of training. \r\n\r\n[Click here to read about one of our English trainees](https://static1.squarespace.com/static/5b3b3ce0266c0780e2b0138d/t/5fda23ff107109236d5b4549/1608131585199/OIE_Case+Study_SO.pdf)","interviewProcess":"If you meet our entry requirements, you will be invited to a remote interview to complete our selection process. \r\n\r\n[Click here to explore our remote interview process](https://teachnorth.com/remote-interviews)","howSchoolPlacementsWork":"During the programme, you will complete two placements in our alliance schools and academies. The location of these placements is decided by the Teach North team who will consider your home location, mode of transport and the capacity of the school or academy.\r\n\r\n[Click here to discover our placement schools](https://teachnorth.com/our-placement-schools)\r\n\r\nYou will be assigned a trained mentor to support and celebrate your progress as you enter the teaching profession. \r\n\r\n[Click here to meet our mentors](https://teachnorth.com/meet-our-mentors)\r\n\r\n\r\n","personalQualities":"Teach North is seeking applicants with the following qualities:\r\n\r\n- A genuine desire to put children first and a commitment to improving the life chances of young people\r\n- An ability to engage with students in a personable and professional manner\r\n- Resilience, flexibility and a passion to succeed in the teaching profession","otherRequirements":"Successful candidates must obtain clearance from the Disclosure and Barring Service (DBS) regarding suitability to work with children. Admission is also dependent on a satisfactory medical examination.","status":1,"createdAt":"2021-07-06T10:52:20.508Z","updatedAt":"2021-10-03T05:36:07.814Z","canSponsorStudentVisa":"yes","cycle":"2024"}
