{"id":"2a324c47-2eef-4c02-927c-bdb39e23eec2","name":"Modern Languages","code":"372L","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"ce8523ef-9236-4cd9-b260-d826c7a521b3","code":"ML","name":"Modern Languages"},{"id":"4608e5e3-2a1a-48a1-8236-56c7af5a139d","code":"24","name":"Modern languages (other)"}],"locations":[{"id":"3ead4941-2b65-41a2-ae23-f0530f3f3d19","name":"The Mountbatten School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"3f49abd8-1824-4ba8-8d6c-7b5d3f7d4944","name":"The Romsey School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"87db698d-18c2-400a-9094-ec89ca5c1f50","code":"1A8","name":"Halterworth Training School Partnership"},"accreditedBody":{"id":"3700fb02-7007-40c8-9127-b070e146d6cb","code":"W76","name":"University of Winchester"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Refer to University of Winchester requirements.","courseLength":"OneYear","feesUK":9250,"feeDetails":"The tuition fees for September 2021 entry are £9,250 for UK, EU and Islands (Channel Islands and Isle of Man) students.\r\n Salaried students do not pay course fees please see our [website] (www.halterworthtsp.co.uk) for entry requirements of salaried applicants\r\nFor some secondary subjects bursaries may be available please see the Get into teaching website https://getintoteaching.education.gov.uk/funding-and-salary/overview/funding-by-subject\r\n","financialSupport":"Please see the 'Get into Teaching' website for details of current funding bursaries available.","aboutCourse":"Students spend 4 days a week in a host school placement and one day per week training either at Winchester University or with a Specialist Leader of Education (SLE) in one of our host schools.  To make sure you are a successful and confident teacher in the 21st-century, we have devised a vibrant programme, informed by research and constantly reviewed, to ensure students are equipped with the most up-to-date developments in education. Our aim is to provide you with a training experience that immerses you in the theory and practice of teaching. \r\nAn advantage of training days hosted in different Partnership Schools is the opportunity to partake in focussed learning walks/tours. This is reviewed favourably by students and adds to experience of different settings.\r\nTeaching time increases gradually throughout the year with protected time in school allocated for planning, reflecting, observing and University assignments. There are four assignments over the year that are closely linked with school placements – combining theory and practice.  Plenty of support is available for writing the assignments.   There are also two assessed school placements. \r\nThe training is structured around modules - a combination of taught modules based at the University and placement modules based in host schools.  You will undertake studies in all elements of education; extend your knowledge of learning and teaching, of the breadth and scope of the curriculum and the professional skills associated with high-quality teaching. You will then apply these areas of understanding and skill to classroom practice throughout the year, including during two assessed placements in schools or educational settings.\r\nThere is a close relationship between school based provision and Winchester University.  Students are allocated a school based mentor  and a University mentor.  All mentors are quality assured and attend regular mentor training.  There is also a large trainee support network.\r\nUpon successful completion of the course you will be awarded a PGCE with recommendations for the award of Qualified Teacher Status (QTS).  There is the option of 60 Masters Credits if assignments are passed at Level 7.\r\nIf you would like to find out more then please contact us to arrange to attend an information morning or evening.  We hope to be able to arrange school experience later this academic year, but this will be dependent on the changing Covid-19 guidelines.\r\n","interviewProcess":"Prior to interview, we will look for evidence of a commitment to the teaching profession, an understanding of professional requirements, and an awareness of current educational issues in an application. Prior experience in a school is not required, however prospective students may find experience in a school useful for obtaining insights into teaching. Experience in a school or similar setting may also provide reassurance to prospective students that teaching is the right choice for their career.\r\nIf you already meet, or are expected to meet, our entry requirements, and have demonstrated your passion and commitment to teaching in your application, you will be invited to attend an interview. The interview day consists of a written task, group presentation and individual interview with a Head Teacher from Halterworth Teaching School Partnership and a tutor from Winchester University. Further information about the format of the day will be sent to you via email in advance. The interview is your chance to find out more about the course and get a feel for us as a Partnership. \r\nStudents come from many different walks of life and there is a good balance between students coming straight from degrees and those changing careers. We truly value the experience that you, as an individual, can bring to teaching and also want to hear about this at interview.\r\nPlease visit our website for more information www.halterworthtsp.co.uk\r\n \r\n","howSchoolPlacementsWork":"You will be placed in a host school (The Romsey School or The Mountbatten School) for the majority of your placement and become part of the staff and department team from the outset. The placement location will be dependent on availability at the schools and will be confirmed after places are accepted. \r\n\r\nThere is a contrasting 6 week placement in a different School from our Partnership Schools and the option of experience in a Sixth Form College (Barton Peveril).\r\n\r\n ","personalQualities":"","otherRequirements":"Criminal Records check (completed post interview)\r\nPhoto ID with address (Passport or driving licence)\r\nTwo other forms of ID with current address on\r\nBirth Certificate\r\nOriginal copies of certificates of qualifications (GCSEs or equivalent and degree)","status":1,"createdAt":"2021-07-06T10:52:28.298Z","updatedAt":"2021-09-16T13:57:10.538Z","canSponsorStudentVisa":"yes","cycle":"2024"}
