{"id":"715c1b0f-507d-4331-9366-7b3892ac653a","name":"Primary (5-11)","code":"X100","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"e7c747fa-53bf-4401-8955-0d0bdab1cc15","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"6cbdc52f-08fc-47e9-b2ee-831ac14e2d98","code":"L35","name":"Leicester & Leicestershire SCITT"},"profPost":"PG","degreeGrade":"9","english":"1","maths":"1","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feeDetails":"This is an unsalaried course","aboutCourse":"At the Leicester and Leicestershire SCITT, we believe passionately in EVERY child’s entitlement to an excellent education, so they enjoy school, enjoy learning and make very good progress.  We \"have created a culture where high standards and a passion for improving outcomes for pupils permeate every aspect of the course\"  [(Outstanding Ofsted 2015)](https://files.api.ofsted.gov.uk/v1/file/2535240).\r\n\r\nOur unsalaried school-based course provides engaging, interactive training that is an ideal blend of theory, research and practice; all our students are full members of the University of Leicester, graduating with a masters level PGCE. The quality of our programmes is recognised in the most recent [Good Teacher Training Guide](https://www.buckingham.ac.uk/wp-content/uploads/2017/04/GTTG17fin.pdf) where the SCITT is in the top five Initial Teacher Training (ITT) providers nationally and is the top primary provider in the East Midlands.  \r\n\r\nThe quality of support in school placements is central to success in ITT.  The SCITT is proud that ALL of the top four of Leicestershire’s primary schools [(The Real Schools Guide 2019)]( https://leics-scitt.co.uk/wp-content/uploads/2019/09/TOP-ten-schools-2019.pdf) are our partners, offering placements and employing many SCITT trained teachers.  \r\n\r\nA key strength of our programme is the personalisation and support across all elements of the training so that each individual trainee is able to achieve their full potential.  This is reflected in the SCITT outcomes where the percentage of trainees successfully gaining QTS and employment are at the top of the DfE tables for providers in Leicestershire [Initial teacher training performance profiles](https://leics-scitt.co.uk/wp-content/uploads/2019/09/ITTPP2019_Provider_tables_East-West-Mids.xlsx). Over 97% of our trainees have been graded as \"Good\" or \"Outstanding\" against the Teachers’ Standards at the end of training.  \r\n\r\nThe primary (5-11yr) course, leads to QTS across the full (3-11yr) primary age range, with specialist training and placements in KS1 and KS2; it is carefully designed so all trainees enter their NQT year confident and secure in their subject knowledge across both key stages.  Graduates of this course often rapidly gain leadership positions in schools, with some choosing to teach in the Foundation Stage as their career progresses. \r\n\r\nChoice of course in ITT is an important decision! The best way to get to know if our course is the right one for you is to come and meet us. Sign up on our [website](https://leics-scitt.co.uk/why-choose-scitt/) for a free information event or call us on 0116 254 3187 or admin@leics-scitt.co.uk for advice, support or further information. \r\n\r\n“The SCITT believed in me from day one, before I even believed in myself”  \r\nStephen, (Trainee 2018/19)\r\n\r\n\r\n\r\n","interviewProcess":"The SCITT and School Direct partner alliances, will use a two stage interview process for candidates called to interview, normally held on two separate days. It may be possible to hold both interviews on the same day for candidates who need to travel further or candidates who will find attending interview for two half days particularly difficult.  \r\n\r\nAs part of our selection process all candidates will be asked to complete written audits in English and mathematics.  The written audits assess whether each candidate’s personal subject knowledge in English and mathematics is sufficient to form a secure base to underpin high quality teaching of these subjects in the primary school. \r\n\r\nPreparation materials and information about the interview audits are attached here:   [Audit Information] (https://leics-scitt.co.uk/entry-requirements/our-interview-process/)\r\n\r\nThe interview process will also take place in our partner schools and will involve a combination of tasks including: \r\n\r\n*a presentation, connected to current educational issues; \r\n\r\n*a task working with a small group of early primary or primary pupils; \r\n\r\n*a formal interview; \r\n\r\n*a reading task. \r\n\r\nEach part of the selection procedure will be graded to agreed criteria. The interview questions will be largely based on elements that will contribute to the Teachers’ Standards. Equal opportunities procedures will be followed to ensure that the selection procedures are open, fair and assessments are to agreed criteria.","howSchoolPlacementsWork":"The SCITT partnership knows trainees can only reach their potential if given exceptional support in placements. Teaching is about relationships; and the relationship between a trainee and their class teacher on placement is vitally important.  The trust and loyalty of headteachers and teachers in our partner schools, built up over the last 15 years, is a key strength of our training. \r\n\r\nThe consistently high quality of support in three contrasting school placements, from dedicated and enthusiastic teachers, underpins our success, making us one of the very top teacher training providers in the country [The Good Teacher Training Guides](https://www.buckingham.ac.uk/wp-content/uploads/2017/04/GTTG17fin.pdf).  It also maximises opportunities for each trainee to learn from best practice in three very different settings.  Consequently our trainees complete training confident across the key stages, knowledgeable about the type of school that suits them, and fully prepared to work in schools that serve diverse pupil populations.\r\n\r\nPlacements are carefully matched to each individual trainee’s development needs and SCITT management also take into account the fact that trainees may be using public transport to reach placement schools.  Trainees with children are always thought about carefully so as to best support them as they juggle teaching demands with their own childcare arrangements.\r\n\r\nTrainees spend:  8 weeks in a placement school in autumn term; 7 weeks on placement in a different school/age phase in spring term; 10 weeks on placement in summer in a third school. The teaching load is phased in from 40% of the timetable at the end of the autumn placement to 80% of the time table in the final weeks of summer term. \r\n\r\nWe have over 80 partner primary schools across the city and county offering trainees a diverse range of schools in which to gain experience.  \r\n[OFSTED 2015](https://files.api.ofsted.gov.uk/v1/file/2535240) reported that “Placement schools are very carefully allocated to provide trainees with teaching experiences across the whole 5-11 age range in a variety of settings. This is an outstanding feature of the training.”\r\n","personalQualities":"\r\nWe are looking for talented, creative individuals, with a passion for teaching across a wide range of subjects within the primary curriculum. Good communication skills are at the heart of effective teaching and all applicants are expected to demonstrate excellent interpersonal and communication skills. \r\n\r\n\r\nTeachers in schools know that teaching demands stamina and perseverance. We look for applicants with the resilience and determination required to cope with the demands of teaching. \r\n\r\n\r\nWe aim to recruit a range of good role models representative of the local population, particularly from minority ethnic communities and men. We also encourage LSAs and career changers. \r\n","otherRequirements":"\r\nA commitment to undertake teacher training is a major step. As such it is important applicants make this commitment based on a first hand understanding of the pressures and rewards of working in a British primary school in the twenty first century. Applicants are strongly encouraged to have a minimum of one week’s relevant and recent experience in a primary school. We feel this is advantageous to demonstrate your understanding of teaching and learning in your interview.   \r\n\r\n\r\nApplicants will need to pass health and DBS police checks and have the physical and mental fitness to teach. \r\n","status":1,"createdAt":"2021-07-06T10:56:58.602Z","updatedAt":"2021-09-24T12:32:02.978Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
