{"id":"51c1713d-c23e-43a4-bb0d-fb68b7ccabf6","name":"Primary (5-11)","code":"2XY8","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"dbc0988f-76d1-465a-990c-7f3f7b4a1bf2","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"867142f1-4608-4b8c-9ef5-9d6710ec92a2","code":"2D5","name":"Synergy"},"accreditedBody":{"id":"b8bcaeed-f311-4867-a1e3-c0fde20809d6","code":"E14","name":"University of East Anglia"},"profPost":"PG","degreeGrade":"1","english":"1","maths":"1","science":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"no","courseLength":"38 weeks","feesUK":9250,"feesInternational":22400,"feeDetails":"For any additional course costs at the University of East Anglia please [visit our website](https://www.uea.ac.uk/about/university-information/finance-and-procurement/finance-information-for-students/tuition-fees/additional-course-fees)","financialSupport":"Find out more about the Financial Support available within our Primary PGCE course pages via the [Course Finder](https://www.uea.ac.uk/course-finder)","aboutCourse":"Our 38-week, full-time PGCE Primary (specialising in Key Stage 2) programme will prepare you to become a general class teacher in the age range 5-11 years, with a specialism in Key Stage 2 (Years 3 to 6).\r\n\r\nYou will undertake two main school placements – one in Lower Key Stage 2 and the other in Upper Key Stage 2, where possible. Our aim is for your placements to be in contrasting schools, giving you a breadth of school-based experience. In Key Stage 2, children become part of a community of learners and show the capacity to make a contribution to society. You will be working with children at this important stage to motivate, inspire and challenge them in their learning.\r\n\r\nUpon successful completion of your PGCE, you will graduate with Qualified Teacher Status (QTS) and 90 Master’s credits.\r\n\r\n[Find out more about this course](https://www.uea.ac.uk/course/postgraduate/pgce-primary-specialising-in-key-stage-2)\r\n\r\n[Sign up for one of our information sessions](https://www.uea.ac.uk/about/school-of-education-and-lifelong-learning/initial-teacher-education/events-and-experience)\r\n\r\n\r\n","interviewProcess":"Interviews are part of the formal selection process. You will need to present yourself well, come prepared, and dress smartly. Your interview day will include:\r\n* An introductory talk\r\n* An individual interview\r\n* A written task\r\n\r\nYou may also be asked to complete other relevant tasks such as:\r\n* Working with small groups of pupils\r\n* Giving a presentation\r\n* A group interview\r\n* Literacy, numeracy and subject knowledge questions\r\n\r\n\r\n\r\n","howSchoolPlacementsWork":"During the two extensive placements in our partnership schools, you will gain a broad range of practical teaching experience. \r\n\r\nYou will be placed in schools in our School Direct Partnership, where possible. Our aim is for your placements to be in contrasting schools with different age ranges based on your chosen training pathway. \r\n\r\n\r\n","personalQualities":"Trainees are selected on the basis of their application form, references and an interview. You are encouraged to prepare thoroughly.\r\n\r\nApplication forms should demonstrate strengths in subject and curriculum knowledge, your enthusiasm and commitment to a career in teaching, and the age range for which you have applied.\r\n","otherRequirements":"Prior to submitting your application, we recommend you gain some observational experience in a classroom environment if possible. This will help you gain an up-to-date understanding of how classrooms are managed and how teaching and learning takes place.\r\n\r\nApplicants must also obtain:\r\n* An Enhanced Criminal Records check from the [Disclosure and Barring Service](https://www.gov.uk/government/organisations/disclosure-and-barring-service) \r\n* A satisfactory Health Check. All PGCE trainee teachers must meet the Secretary of State's requirements for physical and mental fitness to teach.\r\n\r\nAll trainee teachers must have the health and physical capacity to teach and not put children and young people at risk of harm.\r\n","status":1,"createdAt":"2021-07-06T10:50:30.568Z","updatedAt":"2021-10-21T08:12:37.623Z","canSponsorStudentVisa":"yes","cycle":"2024"}
