{"id":"e365c3eb-6d11-4a2d-a702-eaf7524e202b","name":"Modern Languages","code":"G165","qualification":"qts","startDate":"2024-04-30T23:00:00.000Z","applicationsOpenDate":"other","programType":"TA","fundingType":"apprenticeship","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"ce8523ef-9236-4cd9-b260-d826c7a521b3","code":"ML","name":"Modern Languages"},{"id":"5e94c647-7b7e-4d02-a3b4-7667296fbf0a","code":"18","name":"Italian"},{"id":"e34fd2a3-a32e-44e9-aea1-666badf3ac03","code":"22","name":"Spanish"},{"id":"9727f674-61ba-4efa-b1f2-21ec7e354442","code":"15","name":"French"},{"id":"fbb00c08-2dbc-4f26-adb3-3b23afba18c1","code":"17","name":"German"}],"locations":[{"id":"6e8a7c3f-9169-47fc-9a2a-07cfe1dbe904","name":"Orange Moon Education (Bristol)","isPublished":"N","status":"N","vacancies":"F"},{"id":"a1bd2880-8cb8-47d4-9978-8c410e8919b9","name":"Orange Moon Education (Bradford)","isPublished":"N","status":"N","vacancies":"F"},{"id":"2a1a4c13-721f-478c-8cf1-e36590117242","name":"Orange Moon Education","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"7dd0b9e5-a4fe-4256-bb69-a0e6534be174","code":"3A7","name":"Orange Moon Education"},"accreditedBody":{"id":"58e814cb-bf42-4d3d-9486-b3ea827fd9e2","code":"259","name":"Bradford Birth to 19 SCITT"},"english":"3","maths":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"TwoYears","feesUK":null,"aboutCourse":"The course is designed specifically for working with young people between the ages of 11-18. This course will provide you with a level 6 Postgraduate Teaching Apprenticeship and Qualified Teacher Status (QTS) with an option for PGCE. Orange Moon Education works closely in partnership with Bradford Birth to 19 School Centred Initial Teacher Training. During the placement in schools, you will gain the knowledge, skills and understanding needed to be a newly qualified teacher.  Throughout the course, we place particular emphasis on providing equal opportunities for all students working in a diverse, multi-ethnic society. \r\n\r\nA strength of the course is how theory and practice are related as a result of extensive time spent working with children in at least two placement schools. At least 120 days are school-based with support provided by experienced school mentors.\r\n\r\nThe course builds upon the subject knowledge and independent study skills that you will have already acquired as a graduate. Our school-based sessions are also concerned with the professional skills which all teachers need. Course tutors work closely with managers, mentors and teachers in our school to provide you with advice and support for the progressive development of your teaching expertise.\r\n\r\nA large proportion of your teaching and training will be in school, delivered by both highly experienced, inspiring school teachers and leaders. School-based sessions consist of lectures, seminars tutorials, micro-teaching environments and observations of teaching in school. This is very much a practical course, where you learn by doing.\r\n\r\nAssessment is carried out across two placements against the Teaching Standards. You will also have the opportunity to get the experience of working in an alternative key stage/provision or special school.\r\n\r\nYou will work alongside experienced teachers and mentors, who will provide advice and support. You will be introduced to your new role in stages, beginning with observation and work with individual pupils, then with small groups, eventually leading to your work with full classes.\r\n\r\nDuring your school placement, you will work alongside experienced teachers and mentors, who will provide advice and support. You will be introduced to your new role in stages, beginning with observation and work with individual pupils, then with small groups, leading to your work with full classes.\r\n\r\nTypically before applying for this course, you must ensure you have the support of a school or academy to cover your salary cost.","interviewProcess":"All our trainees who are shortlisted for interview will be invited into our school or one of our partner schools. If you are asked for interview, we will provide more details about tasks you will be asked to complete.\r\n\r\nAll our interviews have the same elements:\r\n\r\nA classroom based exercise, where you will be observed interacting with children or young people. (Please note if current restrictions continue this activity will be adapted)\r\n\r\nWritten tasks which are designed to assess your written communication skills; your ability to be numerate; your capacity to access higher level study; and for secondary applicants, subject knowledge.\r\n\r\nFace to face interview with a panel of School Leaders.\r\n\r\nDBS If you are successful at interview stage, you will be made an offer of a training place subject to satisfactory enhanced DBS clearance. For more information, see the guidance on line at; https://www.gov.uk/disclosure-barring-service-check","howSchoolPlacementsWork":"We carefully consider school placements for all of our trainees. We match strengths as well as support needs for students. All trainees will be placed in two contrasting schools, ensuring students experience a wide range of settings.\r\n\r\nYour training week initially involves some days a week in school and some days working on teaching pedagogy, helping you learn the skills to make you an effective teacher. During your training year, you will experience a vast array of schools from our partnership in Nursery, Primary, Special and Secondary sectors. We operate an A B A model for our students, where trainees start in their host school working with pupils that are aged 11 to 16, then complete a 6-week contrasting placement, then return to their host school to complete the training year. \r\n\r\nThe course builds upon the subject knowledge and independent study skills which, as a graduate, you will have already acquired. Our school based sessions are also concerned with the professional skills all teachers need. Course tutors work closely with managers, mentors and teachers in our schools and academies to provide you with advice and support for the progressive development of your teaching expertise. A large proportion of your teaching and training will be in our schools and academies, delivered by both highly experienced, inspiring school teachers and leaders. School-based sessions consist of lectures, seminars, tutorials, micro-teaching environments and observations of teaching in school. This is very much a practical course, where you learn by doing.\r\n","personalQualities":"We don’t have a fixed picture of what kind of a person we are looking for. Teaching is a creative, dynamic profession which has space for innovative thinking, for people who can break free from what’s expected. Our school is clear that we want trainees to have a rapport with children, a passion for their subject, and to have the ambition to become excellent teachers. You will have a relentlessly positive outlook, show initiative and be good team player, ready to work hard in a challenging but wonderfully rewarding profession.","otherRequirements":"If you are successful at interview stage, you will be made an offer of a training place subject to satisfactory enhanced DBS clearance.","status":2,"createdAt":"2021-07-06T10:54:57.182Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","applicationsOpenDateOther":"2022-03-01T00:00:00.000Z"}
