{"id":"4678a36b-8ef9-455e-8adf-938f66b53cf6","name":"Chemistry","code":"F1X1","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"912d4fb4-761b-42e9-8dc6-e968b791ea4e","code":"F1","name":"Chemistry"}],"locations":[{"id":"6369a82f-107c-49b9-af0d-6e16fa1d1d41","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"0bc933b8-dad9-4149-8bb2-fd2041d567c2","code":"H72","name":"The University of Hull"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"For information on acceptable equivalency please contact admissions@hull.ac.uk","courseLength":"OneYear","feesUK":9250,"feesInternational":14800,"feeDetails":"Please contact the Admissions Service on 01482 466100 for any further information on Fees. \r\n\r\n*Fees for EU, EAA and Swiss nationals are to be confirmed.  \r\n\r\nEU, other EEA and Swiss nationals will no longer be eligible for home fee status, undergraduate, postgraduate and advanced learner financial support from Student Finance England for courses starting in academic year 2021/22.\r\n\r\nTraining bursaries may be available for some subjects. For further information visit the following website for information:\r\n(https://getintoteaching.education.gov.uk/funding-and-salary/overview)\r\n","aboutCourse":"Train to blow some minds by teaching one of the most exciting subjects on any curriculum. This course teaches you how to plan lessons, organise safe investigations, meet the needs of all pupils, manage the learning environment and undertake assessments. There are plenty of opportunities to carry out practical work in our spacious school laboratory.\r\n\r\nIn the first part of the course, the emphasis is on science in the national curriculum. In the later stages, you’ll develop your Key Stage 5 teaching with specialist tutors - learning how to challenge and motivate the range of learners staying on in schools and colleges.\r\n\r\nHull is one of the few universities in the country to provide the option of including your PGCE year as the first year of study for an MA in Educational Studies. You can then complete the MA part-time over the following three years, developing your professional expertise and career prospects.\r\n\r\nEmployment opportunities are very good since science is a shortage subject both nationally and locally. Hull, East Yorkshire and Lincolnshire prove popular destinations for our trainees, and you’ll most likely bump into some of our former students on your teaching practices.\r\n\r\nWe work with a range of schools over a wide geographic area, so you'll gain experience in different settings. Staff in the school will support you throughout your placement.\r\n\r\nThe Postgraduate Certificate in Education is an initial qualification in education for those who intend to have a career in teaching. Its three main threads are to\r\n- provide you with the information, knowledge and skills to enable you to embark on a teaching career and become an effective teacher\r\n- help you develop a professional interest in educational issues as the basis for further thought or training\r\n- help your personal development in a critical year that bridges the gap between being a student (or doing some other form of work) and becoming a teacher\r\n\r\nTheory\r\nAssessment is based on a range of coursework assignments.\r\n\r\nPractice\r\nThe assessment takes place in schools. You’ll also be assessed on your achievement of the Teachers’ Standards.\r\n\r\nPlease see full information on our webpage (https://www.hull.ac.uk/study/pgce/secondary-pgce-chemistry.aspx)","interviewProcess":"On receipt of your application, it will be checked for the suitability of the academic qualifications, the quality of both the content and the accuracy of written English and the extent of support provided by the referee. This is always done by the Subject Tutor. Your application will also be seen by a School Mentor, and sometimes by the Programme Director.\r\n\r\nThe Department for Education stipulates that entrants to ITT must possess a first degree of a United Kingdom higher education institution or an equivalent qualification. The University requires that prospective applicants possess or are studying towards a 2:2 honours degree and have appropriate subject knowledge.  The University reserves the right to determine equivalent qualifications. Since science is such a broad subject area, and we are flexible in our degree subject entry requirements, we suggest you speak to the subject method tutor, Michelle Wormald at m.wormald@hull.ac.uk.\r\n\r\nYou will be interviewed on an individual basis with a Subject Tutor(s).  Currently, our interviews are being held virtually.\r\n\t\r\nThe interview process is informal and you will be offered the opportunity to ask questions about the programme.  You may be asked to deliver a short presentation on a topic agreed in advance.\r\n\r\nAfter the interview, decisions about the offer of places are made immediately after the interviews and the outcomes communicated to candidates formally through UCAS Teacher Training.","howSchoolPlacementsWork":"You'll spend a total of 120 days in schools during the programme, supported by school mentors, class teachers and University-based tutors.","personalQualities":"We are looking for someone who is:\r\n- Motivated to work with young people and is enthusiastic about their subject\r\n- Adaptable, hardworking and committed to teaching all pupils\r\n- Able to think on their feet, with good communication skills and a sense of humour\r\n- Able to work as a member of a team as well as being independent and resourceful.\r\n- Be well qualified in your subject and to be able to talk about it with understanding and enthusiasm. We would like you to believe that your subject is relevant for pupils of all ages and abilities.","otherRequirements":"Admission is subject to a satisfactory medical report and an Enhanced Clearance by the Disclosure and Barring Service (DBS).  If you have spent time living outside of the UK, you may be asked to also provide a satisfactory police check from the country or countries in which you have resided.","status":1,"createdAt":"2021-07-06T10:51:28.439Z","updatedAt":"2021-09-23T09:30:43.300Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
