{"id":"eaffe562-96ec-4fe6-b7d8-46082cb5a802","name":"Primary (5-11)","code":"X100","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"6369a82f-107c-49b9-af0d-6e16fa1d1d41","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"0bc933b8-dad9-4149-8bb2-fd2041d567c2","code":"H72","name":"The University of Hull"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"For information on acceptable equivalency please contact admissions@hull.ac.uk","courseLength":"OneYear","feesUK":9250,"feesInternational":14800,"feeDetails":"Please contact the Admissions Service on 01482 466100 for any further information on fees. \r\n \r\n* Fees for EU, EAA and Swiss nationals are to be confirmed.  \r\n\r\nEU, other EEA and Swiss nationals will no longer be eligible for home fee status, undergraduate, postgraduate and advanced learner financial support from Student Finance England for courses starting in academic year 2021/22.\r\n\r\nTraining bursaries may be available for some subjects. For further information visit the following website for information:\r\n(https://getintoteaching.education.gov.uk/funding-and-salary/overview)","aboutCourse":"This one-year course is designed to prepare you for teaching children in the 5 to 11 age range. With a balance of school and university-based learning, you’ll graduate with Qualified Teacher Status (QTS). Hull enjoys close, well-established relationships with over 150 infant, junior and primary schools which are involved in the programme design, recruitment and training. You’ll undertake block placements in two different schools, where you’ll be closely supervised by tutors and mentors.\r\n\r\nYou’ll be given a foundation in the full range of subjects that make up the primary school curriculum, with particular emphasis on the core subjects – English, Mathematics and Science.\r\n\r\nYour studies consist of five key areas:\r\n\r\nEnglish – looking at the various strategies which can be applied in different types of schools, with some weekly English sessions taking place in local schools\r\n\r\nMathematics – build the confidence of your own mathematical ability as well as gain the knowledge and skills to teach mathematics effectively\r\n\r\nScience – develop your own knowledge and understanding of science, as well as the pedagogical skills best suited to facilitating children’s effective learning of science in the classroom\r\n\r\nFoundation subjects – art, design and technology, geography, history, information and communication technology, music, physical education and religious education\r\n\r\nProfessional studies – Develop an understanding of a wide range of general issues related to the profession, including safeguarding, child development, curriculum planning and assessment, teachers’ legal responsibilities, behaviour management and record planning\r\n\r\nTheory\r\nAssessment is based on a series of coursework assignments at Masters level. There are two subject-focused assignments, one for English and one for mathematics, and the third piece of work is related to themes presented in the professional studies course.\r\nPractice\r\n\r\nThe assessment takes place in schools. You’ll be assessed on your achievement of the Teachers’ Standards. Assessment of teaching ability is based on performance as a teacher in the classroom.\r\n\r\nPlease see full information on our webpage (https://www.hull.ac.uk/study/pgce/primary-pgce-5-11-years)\r\n","interviewProcess":"On receipt of your application, it will be checked for the suitability of the academic qualifications, the quality of both the content and the accuracy of written English and the extent of support provided by the referee. This is always done by the Subject Tutor. Your application will also be seen by a School Mentor, and sometimes by the Programme Director.\r\n\r\nThe Department for Education stipulates that entrants to ITT must possess a first degree of a United Kingdom higher education institution or an equivalent qualification. The University requires that prospective applicants possess or are studying towards a 2:2 honours degree and have appropriate subject knowledge.  The University reserves the right to determine equivalent qualifications. \r\n\r\nYou will be interviewed on an individual basis with a Subject Tutor(s).  Currently, our interviews are being held virtually.\r\n\t\r\nThe interview process is informal and you will be offered the opportunity to ask questions about the programme.  You may be asked to deliver a short presentation on a topic agreed in advance.\r\n\r\nAfter the interview, decisions about the offer of places are made immediately after the interviews and the outcomes communicated to candidates formally through UCAS Teacher Training.","howSchoolPlacementsWork":"Trainees spend more than 120 days in school, comprising two block placements of eight weeks in the spring and summer terms. Each assessed placement is preceded by two weeks in school to enable you to prepare for your placement.\r\n\r\nIn addition to two block placements, there are weekly visits to schools throughout the autumn term as part of the professional studies course.","personalQualities":"We are looking for applicants with \r\n- A commitment to primary education\r\n- An ability to motivate and inspire children of all abilities\r\n- Energy and enthusiasm\r\n- Effective interaction with children\r\n- An ability to work under pressure\r\n- Perseverance and flexibility\r\n- Oral and written communication skills\r\n- The ability to work co-operatively\r\n- An awareness of current educational issues\r\n- A broad subject-knowledge base\r\n- Reflection, self-evaluation and a willingness to learn\r\n- Awareness of what being a primary teacher entails\r\n","otherRequirements":"Admission is subject to a satisfactory medical report and an Enhanced Clearance by the Disclosure and Barring Service (DBS).  If you have spent time living outside of the UK, you may be asked to also provide a satisfactory police check from the country or countries in which you have resided.","status":1,"createdAt":"2021-07-06T10:51:28.780Z","updatedAt":"2021-09-23T09:54:25.535Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
