{"id":"edc51fd3-f48f-4bcb-9f36-b85d6dba2a50","name":"Physics with Mathematics","code":"F3GX","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"bf97cd0a-224c-43d3-a021-84143df13e8d","code":"F3","name":"Physics"},{"id":"72345aa7-096c-488f-8649-085b8178cadb","code":"G1","name":"Mathematics"}],"locations":[{"id":"6369a82f-107c-49b9-af0d-6e16fa1d1d41","name":"Main Site","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"0bc933b8-dad9-4149-8bb2-fd2041d567c2","code":"H72","name":"The University of Hull"},"profPost":"PG","english":"3","maths":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feesInternational":14800,"feeDetails":"Please contact the Admissions Team on 01482 466100 for any further information required on Fees. \r\n\r\nIf you are an International student from a non-EU country you will be charged the standard overseas student fee.\r\n\r\nTraining bursaries are available for some subjects for all UK and EU postgraduate teacher trainees. For information visit the following website for information.\r\n\r\n(https://getintoteaching.education.gov.uk/funding-and-salary/overview)","aboutCourse":"The Secondary PGCE programme concentrates on the teaching of 11 - 16 year olds, but part of it extends your studies/experience to cover preparation for post-16 teaching.\r\n\r\nIt is delivered by the University from its Hull campus together with approximately 90 partnership schools. \r\n\r\nScience is an exciting, practical subject which includes physics, chemistry and biology. As a teacher you may be required to teach physics, chemistry and biology up to key stage 3, or even key stage 4, teaching your specialist subject at key stage 5.  This PGCE programme concentrates on the teaching of 11 - 16 year olds, but part of it extends your studies/experience to cover preparation for post-16 teaching.\r\n\r\nThere has been much more emphasis recently on developing science courses to ensure the population is science literate before they leave school. These exciting developments enable you to develop innovative methods of teaching science and to focus on a pedagogically sound approach to teaching and learning. Many of the skills that you teach your pupils will be transferable across the sciences. As part of the course you will consider how to plan lessons; how to organise safe investigations; how to meet the needs of all pupils; how to manage the learning environment effectively and how to undertake assessment. There are plenty of opportunities to carry out practical work in our spacious school laboratory. In the first part of the programme the emphasis is on science within the National Curriculum and in the later stages of the programmee you will develop your key stage 5 teaching with specialist tutors to learn how to challenge and motivate the full range of learners staying on in Schools and Colleges, of particular importance given the changes to the school leaving age.\r\n\r\nWe take good quality applicants for the Secondary PGCE course who have studied biology, chemistry or physics as well as other degree subjects which contain significant amounts of these as part of their undergraduate course. However we are also looking for trainees who have developed transferable skills and qualities. They will of course need to be committed enough to undertake substantial background reading or a subject-bridging course to prepare for the PGCE. To this end, an early application is advisable.\r\n\r\nIt is also desirable if you have spent some time observing science lessons in secondary schools to support your application.\r\n\r\nPlease see full information on our webpage (https://www.hull.ac.uk/study/pgce/secondary-pgce-chemistry.aspx)","interviewProcess":"On Receipt of UCAS Teacher Training Applications\r\nThe applications are checked for the appropriateness of the academic qualifications, the quality of both the content and the accuracy of written English and the extent of support provided by the referee. This is always done by the Subject Tutor. The forms will also be seen by a School Mentor, and sometimes, by the Programme Director.\r\n\r\nApplicants must possess a degree of a British university, or equivalent and have appropriate subject knowledge. The University states that prospective applicants require a degree 2:2 or better to be able to progress on to the PGCE Secondary programme.  Since science is such a broad subject area, and we are flexible in our degree subject entry requirements, we suggest you speak to the subject method tutor, Michelle Wormald at m.wormald@hull.ac.uk. \r\n\r\nInterviews\r\nCandidates are either called for interview individually or, more usually, in small groups. The interview is conducted by the Subject Tutor(s). The interviews are usually held in the University, but on some occasions, in a partnership school.\r\n\t\r\nThe interview process is informal and usually candidates are offered the opportunity to ask questions, possibly give a short presentation, complete a written task as well as participate in an individual discussion with Subject Tutors and Mentors.\r\n\r\nAfter the interview\r\nDecisions about the offer of places are made immediately after the interviews and the outcomes communicated to the candidates formally through the UCAS Teacher Training System.\r\n","howSchoolPlacementsWork":"All trainees have two school placements and teach in two schools. The two periods of teaching experience are approximately 12 weeks in length. Each teaching block is preceded by a developmental phase of structured preparation. This involves observing experienced teachers working with individual pupils, working with groups of pupils, team teaching, and eventually taking responsibility for whole lessons. In their practical teaching, trainees are advised and guided by their subject mentors in schools, and observed teaching by University Method Tutors. Trainees each have a Journal and Profile Document in which they and their mentors record their development. This document is both formative and summative because you use it throughout your training and it also contains two sections for completion at the end of each major period of teaching.","personalQualities":"We are looking for someone who is:\r\n- Motivated to work with young people and is enthusiastic about their subject\r\n- Adaptable, hardworking and committed to teaching all pupils\r\n- Able to think on their feet, with good communication skills and a sense of humour\r\n- Able to work as a member of a team as well as being independent and resourceful.\r\n- Be well qualified in your subject and to be able to talk about it with understanding and enthusiasm. We would like you to believe that your subject is relevant for pupils of all ages and abilities.","otherRequirements":"","status":2,"createdAt":"2021-07-06T10:51:28.476Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
