{"id":"4dc8a2b6-3dac-49e4-9e13-8bdf90e58025","name":"Geography","code":"2X2D","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3f47e67b-7fa5-4947-a5a0-74d528cd2a87","code":"F8","name":"Geography"}],"locations":[{"id":"58bead1c-53a0-4aa7-aa6b-591dd1843870","name":"Hartshill School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"7b45cc38-0d8a-40b2-a8bb-e045d6b4d83b","name":"Etone College","isPublished":"Y","status":"R"},{"id":"ce03afd8-0226-489c-8811-005f10818f51","name":"Ormiston Shelfield Community Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"02138d9f-a970-439c-8e73-de13e077aed5","name":"Chase Terrace Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"21e2cb50-e833-40ea-b29e-e2edf3848eb3","name":"Q3 Academy Great Barr","isPublished":"N","status":"S","vacancies":"F"},{"id":"3e1ae49b-7d0e-4a9c-95b5-077c6a95022b","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"},{"id":"bfb301a7-568a-4deb-b30d-da23e49933b9","name":"Brownhills Ormiston Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"5b9eb24c-2069-4132-9161-30bad7c034af","name":"Dame Elizabeth Cadbury School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"09dbb3a1-5b4c-4e22-81c3-6194ecc6e424","name":"Grace Academy Darlaston","isPublished":"Y","status":"R","vacancies":"F"},{"id":"27a56f76-1ca0-425d-a502-2dc632a058da","name":"Bloxwich Academy","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"c8c19866-6d7e-4e45-9461-9379e4ca53b0","code":"2AX","name":"Barr Beacon SCITT"},"profPost":"PG","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"We normally require a degree classification of a 2:2 or above (or equivalent). This is usually an Honours degree.","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We do not offer equivalency testing as a provider, it is the candidate's responsibility to source and provide this information should it be required.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Your journey to becoming a teacher begins with a detailed pre-course induction. In May and June you will be enrolled onto our evening webinars and in July you'll take part in our full-day pre-course induction. This will introduce you to the course, the SCITT team and your fellow trainee teachers. \r\n\r\nYou’ll start your training with us in September 2022 and our course is divided into four key phases: \r\n\r\nPhase 1 (September - October)\r\n\r\n* During your first week you'll take part in induction days for the SCITT, your main placement school and the PGCE. \r\n* You will spend four weeks being immersed in all aspects of school life in a detailed school induction led by your personal mentor. \r\n* You will begin to teach and build up to 6 hours of solo teaching. \r\n* Our regular Professional Studies and Subject Studies sessions equip you with the essential skills to teach your subject and manage your classroom effectively. \r\n\r\nPhase 2 (October - December)\r\n\r\n* At the heart of our SCITT programme is hands-on experience in schools and classrooms and during this period you will deliver 6 solo lessons and work with colleagues in schools for 9 collaborative lessons. \r\n* You are given regular feedback on your progress and your teaching from your mentor, your Subject Course Leader and classroom practitioners. \r\n\r\nPhase 3 (January - April)\r\n\r\n* You will experience a contrasting school placement. \r\n* Our on-going Professional Studies and Subject Studies continues your professional development throughout Term 2.\r\n* Your teaching timetable will increase to 12 hours of solo lessons and 3 hours of collaborative teaching.\r\n* Your teaching is developed through the continuous support from inspirational classroom practitioners, course leaders and mentors. \r\n* You will experience a primary school and take part in our carousel weeks where our partner schools expand your professional development through bespoke training opportunities. \r\n\r\nPhase 4 (April - July) \r\n\r\n* Your teaching timetable increases to 15 hours solo lessons.\r\n* You will have collected evidence throughout the year to show how you are meeting all of the Teachers' Standards and during this term you will excel with the continued support of your mentors and course leaders. \r\n* You will have completed your assignments towards your PGCE qualification (delivered in partnership with University of Worcester).\r\n* We run a range of sessions that prepare you for the transition to your role as a Early Career Teacher (ECT).\r\n","interviewProcess":"Assessment days will take place with Barr Beacon SCITT and the partner school that you have applied to. Our assessment days allow us to assess whether you have the potential to train with Barr Beacon SCITT. You will complete: \r\n\r\n* A 50-minute assessment of your subject knowledge and a 10-minute assessment of your written English skills.\r\n* A 15-minute teaching episode to a small group of students. \r\n* A 5-minute pre-prepared presentation on a given topic with a short Q&A session.\r\n* An interview encompassing all aspects of becoming a teacher. \r\n\r\nThere is an opportunity for you to ask any questions.\r\n\r\n You will be judged against the following criteria:\r\n\r\n* Appropriateness of subject qualifications and knowledge and relevance to the teaching of the subject\r\n* Capacity to extend subject knowledge \r\n* Awareness of the role and responsibilities of a teacher and school environments\r\n* Resilience \r\n* Enthusiasm for and commitment to teaching\r\n* Awareness of personal strengths and areas of development\r\n* Ability to engage and enthuse students in the subject\r\n* Ability to be flexible to meet the needs of the students and manage the learning environment\r\n* Ability to communicate effectively in standard spoken and written English\r\n* Awareness of the provider and our programme\r\n\r\nApplicants successful at interview will then complete a Fundamental English and Mathematics assessment at a later date. \r\n\r\nRegular information webinars that offer an insight into our programme and our schools can be found [here](https://bbscitt.co.uk/events/).","howSchoolPlacementsWork":"Trainees applying to Barr Beacon SCITT select a main placement school of preference on their applications. This partner school is known as the trainee’s main placement school. You can view which schools we work with and which subjects they offer [here](https://bbscitt.co.uk/our-schools/). All of our schools offer these subjects at age range 11-16 (Key Stage 3 and Key Stage 4), with a Post-16 enhancement available. The only exceptions to this are our Business Studies and Psychology courses which are 14-19 (Key Stage 4 and Key Stage 5) where a Key Stage 3 enhancement is possible. \r\n\r\nOur trainees are based in their main placement school from September to December (Term 1) and from March to June (Term 3). \r\n\r\nFrom January to March (Term 2) trainees will spend time in a contrasting school placement, sometimes referred to as 'second placement'. Arrangements for the contrasting placement school are made centrally by the SCITT in a timely manner once the course has commenced. A trainee's emerging teaching strengths and areas of development, locality and personal circumstances are taken closely into consideration when making these arrangements. \r\n\r\nTrainees are supported, developed and assessed by our trained and experienced team of Professional Mentors and Subject Mentors in the same way across all of our placement schools. Additionally, trainees also receive:\r\n\r\n* Central, whole-cohort Professional Studies sessions to learn about the key topics in education\r\n* Specific Subject Studies sessions, led by a dedicated, subject-specific course leader to impart the pedagogy of teaching your subject\r\n* The opportunity to be trained on best practice in a range of key areas of teaching in a number schools through our carousel weeks \r\n* An opportunity to observe Key Stage 2 teaching and consider the Key Stage 2 to 3 transition through a short placement in a primary school.\r\n","personalQualities":"Full details of the personal qualities that Barr Beacon SCITT trainees have can be found on [our website](https://bbscitt.co.uk/recruitment-process/). ","otherRequirements":"At Barr Beacon SCITT we are guided by the DfE's guidance on [Keeping Children Safe in Education](https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1014057/KCSIE_2021_September.pdf ) (September 2021) and all offers are subject to enhanced DBS clearance.\r\n\r\nWe have a responsibility to ensure that trainees have the health and physical capacity to teach. This will take the form of a questionnaire prior to the commencement of the course. \r\n\r\nAll trainees are subject to a prohibition to teach check, a disqualification check and a right to work check. We may contact references for further information.\r\n\r\nThere is an opportunity at interview to discuss statutory checks in more detail.","status":1,"createdAt":"2021-07-06T10:48:37.891Z","updatedAt":"2021-09-22T14:26:11.466Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
