{"id":"679c202b-c6b1-4132-b6d9-ebefbb5dc75b","name":"Primary","code":"Y576","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"acbbf6f3-fc04-4c48-b905-2b105faa5579","name":"Ryders Hayes Primary School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"c8c19866-6d7e-4e45-9461-9379e4ca53b0","code":"2AX","name":"Barr Beacon SCITT"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We do not offer equivalency testing as a provider, it is the candidate's responsibility to source and provide this information should it be required.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"The Barr Beacon SCITT 5-11 primary programme is led by Ryders Hayes Teaching School. Ryders Hayes is a National Teaching School with a strong culture of developing and nurturing trainee teachers. They have a  partnership of local good and outstanding schools which creates a strong and diverse SCITT partnership.\r\n\r\nYour journey to becoming a teacher begins with a carefully planned pre-course induction. In May and June you will be enrolled onto our evening webinars and in July you'll take part in our full-day pre-course induction. This will introduce you to the course, the SCITT team and your fellow trainee teachers. \r\n\r\nYou’ll start your training with us in September 2021 and our course is divided into four key phases: \r\n\r\nPhase 1 (September - October):\r\n\r\n* During your initial weeks on the course you'll take part in induction days for the SCITT, your main placement school and the PGCE.\r\n* You will spend Phase 1 being immersed in all aspects of school life in a detailed, hands-on school induction led by your personal mentor. \r\n* You will begin a personalised build-up to 50% of whole class teaching. \r\n* Regular Professional Studies sessions are delivered by expert facilitators and equip you with essential teaching and learning skills.\r\n\r\nPhase 2 (October - December):\r\n\r\n* At the heart of our SCITT programme is hands-on experience in schools and classrooms and during this period you will build up to 50% whole class teaching and take part in collaborative teaching experiences. \r\n* You receive a bespoke training package, which includes additional support in specialist subjects, promotes access to all aspects of school life.\r\n\r\nPhase 3 (January - April)\r\n\r\n* You will experience a contrasting school placement. \r\n* Our on-going Professional Studies continues your professional development throughout Term 2.\r\n* Your teaching timetable will increase to 60% whole class teaching by the end of Phase 3. \r\n* You will focus on group-work and interventions\r\n\r\nPhase 4 (April - July) \r\n\r\n* Your teaching timetable increases to 80% whole class teaching by the end of Phase 4\r\n* You will have collected evidence throughout the year to show how you are meeting all of the Teachers' Standards \r\n* You will have completed your assignments towards your PGCE qualification (in partnership with Birmingham City University).\r\n* We run a range of sessions that prepare you for the transition to your role as a Early Career Teacher (ECT).","interviewProcess":"Assessment days will take place with Ryders Hayes Teaching School. Our assessment days allow us to assess whether you have the potential to train with Barr Beacon SCITT. You will complete: \r\n\r\n* A 60-minute assessment of your primary national curriculum knowledge, which includes an assessment of your written English skills.  \r\n* A 60-minute audit of your Fundamental English and mathematics skills.\r\n* A 15-minute teaching episode, during which you will present a walk-through of a lesson that you have pre-prepared. \r\n* A 5-minute pre-prepared presentation on a given topic with a short Q&A session.\r\n* An interview encompassing all aspects of becoming a teacher. \r\n\r\nThere is an opportunity for you to ask any questions.\r\n\r\n You will be judged against the following criteria:\r\n\r\n* Appropriateness of qualifications and knowledge and relevance to primary teaching\r\n* Capacity to extend subject knowledge \r\n* Awareness of the role and responsibilities of a teacher and school environments\r\n* Resilience \r\n* Enthusiasm for and commitment to teaching\r\n* Awareness of personal strengths and areas of development\r\n* Ability to engage and enthuse students\r\n* Ability to be flexible to meet the needs of the students and manage the learning environment\r\n* Ability to communicate effectively in standard spoken and written English\r\n* Awareness of the provider and our programme\r\n\r\nWe run regular information webinars that offer you an insight into our programme and our schools. You can find upcoming events [here](https://bbscitt.co.uk/events/).","howSchoolPlacementsWork":"We offer primary training programmes in the age ranges 3-7 (Programme Code D101) or 5-11 (Programme Code Y576). Please make sure you have applied for the correct programme.  \r\n\r\nTrainees apply to Barr Beacon SCITT and assessment days will be carried out by Ryders Hayes on behalf of Barr Beacon SCITT. Ryders Hayes allocate trainees a placement school within the SCITT partnership. We strongly believe in creating a ‘best fit’ between the host school and the trainee, in the belief that they are one of the staff team and a potential employee. \r\n\r\nOur trainees are based in their main placement school from September to December (Term 1) and from March to June (Term 3). \r\n\r\nFrom January to March (Term 2) trainees will spend time in a contrasting school placement, sometimes referred to as 'second placement'. Arrangements for the contrasting school placement are made centrally by the SCITT/Ryders Hayes in a timely manner once the course has commenced. A trainee's emerging strengths and areas of development, locality and personal circumstances are taken closely into consideration when making these decisions. \r\n\r\nTrainees are supported, developed and assessed by our expert team of mentors in the same way across all of our placement schools. Additionally trainees receive: \r\n* Training in a diverse range of educational settings, including regular training at Ryders Hayes from expert facilitators, providing a detailed ‘hands-on’ school-based experience. \r\n* A bespoke training package for each trainee, including additional support in specialist subjects to promote access to all aspects of school life.\r\n\r\nAdditional information for our part-time courses:\r\n* Our part-time programme covers the same content as the one year full-time route spread across a two year route, with adjusted placement timings to account for the part-time nature of the course allowing for continuation of part-time employment whilst training.","personalQualities":"Full details of the personal qualities that Barr Beacon SCITT trainees have can be found on [our website](https://bbscitt.co.uk/recruitment-process/). ","otherRequirements":"At Barr Beacon SCITT we are guided by the DfE's guidance on [Keeping Children Safe in Education]( https://www.gov.uk/government/publications/keeping-children-safe-in-education--2) (September 2020) and all offers are subject to enhanced DBS clearance.\r\n\r\nWe have a responsibility to ensure that trainees have the health and physical capacity to teach. This will take the form of a questionnaire prior to the commencement of the course. \r\n\r\nAll trainees are subject to a prohibition to teach check, a disqualification check and a right to work check. We may contact references for further information.\r\n\r\nThere is an opportunity at interview to discuss statutory checks in more detail.","status":1,"createdAt":"2021-07-06T10:48:38.687Z","updatedAt":"2021-09-30T11:24:26.731Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
