{"id":"924861b1-3eb3-484a-af2e-196ceaa3da41","name":"Biology","code":"2P5W","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"322cfc19-d51d-45db-91e3-bd7b4738470f","code":"C1","name":"Biology"}],"locations":[{"id":"bed3d6aa-fe0c-4bc7-b1d3-b2958ea78984","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"034b57f5-d231-41d7-aa08-475cd841b5e9","code":"T30","name":"Titan Partnership Ltd"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We recommend using www.equivalencytesting.com for equivalent GCSEs. If you wish to use an alternative provider, please contact us to make sure that they are accepted.","courseLength":"OneYear","feesUK":9250,"financialSupport":"Titan offers a hardship fund should you require additional financial support.\r\nYou will receive details on how to access this funding during induction week.\r\n","aboutCourse":"Our SCITT programme is a  37 week, full time school-led course that leads to QTS and a PGCE with Master's credits.\r\n\r\nYour training year is split into 2 placements of equal length (Sep-Feb & Feb-Jul) this will give you a balance of experience across 2 contrasting school settings.\r\nYou will also have the option of an additional placement focussing on SEN, Alternative Provision or STEM.\r\n\r\nAfter your induction week, you will be based in school Monday-Friday. On a Tuesday morning you will attend cross-phase taught sessions at our Learning Hub. These sessions are designed to give you an understanding of the elements of your professional role that lie outside of the national curriculum. These sessions are delivered by a range of speakers who are experts in their field. \r\n\r\nYou will also attend subject specific twilight taught sessions to assist you with planning, assessing and delivering the national curriculum. These sessions will examine the particular nature of learning in your subject area and will be delivered by subject specialists from our partnership of schools.\r\n\r\nAs this is a school-led programme, you will spend the majority of your time in school learning from excellent practitioners. You will start by observing good practice in your placement school before starting to team teach alongside your designated school based trainer. You will then have the opportunity to  deliver solo lessons before you begin your assessed teaching practice on a 50% timetable.\r\n\r\nDuring your school placements you will be supported by your School Based Trainer (SBT) and a Professional Tutor (PT). You will have a weekly one-to-one with your SBT and regular meetings with your PT in order to review progress against the Teachers' Standards. In addition to this, you are also supported by a Subject Leader and our team of Titan ITT experts.\r\n\r\nYou will also find a number of ex-trainees in your placement schools, many of whom are in senior leadership roles, these too will prove a valuable source of guidance and support.\r\n\r\nQTS is assessed by your classroom practice, a portfolio of evidence against the Teachers' Standards and a reflective practice folder.\r\n\r\nThe PGCE is assessed through 3 assignments.\r\n\r\nThis is a demanding, and highly rewarding, course and we look forward to supporting you into teaching.\r\n","interviewProcess":"Due to the ongoing developments and government advice regarding Corona virus (COVID-19), we will be offering the option to have remote interviews for our SCITT & School Direct programmes.\r\n\r\nThe presentation and interview sections will take place virtually and the subject knowledge tests will be adapted so they can take place online.\r\nWe want to ensure that all applicants for teacher training can still pursue their ambitions to train to teach and that we are doing all that we can to support this.\r\n\r\n* A 10 minute presentation\r\n* A 40 minute formal interview\r\n* A 40 minute subject knowledge test (adapted GCSE paper)\r\n* A 10 minute short reflective written task.\r\n\r\n\r\n","howSchoolPlacementsWork":"Our partnership of schools are based in the North West of Birmingham with good public transport links.\r\nDue to our small numbers we are able to personalise your training experience, allowing us to select the school which would provide the right training environment for you.\r\nYou can view our partnership schools directly on our [website](http://www.titanteachertraining.co.uk/about-us/itt-partner-schools/)\r\n\r\nThe SCITT programme runs a 2 placement model designed to give you an equal experience of 2 contrasting school settings.\r\n\r\n* Placement 1 runs from September-February, during this time you will be in school Monday-Friday and at our Learning Hub on a Tuesday morning.\r\n* Placement 2 runs from February to July with an increased teaching timetable resulting in you being in school Monday-Friday.\r\n\r\n\r\n\r\n","personalQualities":"You will need to demonstrate a  passion for your subject, education and making a difference to the lives of young people. \r\n\r\nYou will need to possess good time keeping skills and be able to prioritise your workload.\r\n\r\nYou will face many new challenges and will need to have  the determination and resilience to meet these challenges and overcome any difficulties.\r\n\r\nYou need to have the ability to listen to advice and be able to act upon it. You will be offered constructive criticism on a regular basis which will be designed to help you improve your teaching skills.","otherRequirements":"Once you are accepted onto our course we will carry out a DBS and Fitness to Teach check.\r\n\r\nPlease ensure the references used on your application are of a professional nature. Where possible include a reference from a school if you have managed to gain any recent school experience.","status":1,"createdAt":"2021-07-06T10:56:04.176Z","updatedAt":"2021-09-22T10:23:37.766Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
