{"id":"6e3ae34d-0d2d-4aca-9236-9a487d10f730","name":"Computing","code":"33D3","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"7_to_14","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"e6be6a9c-8696-4b88-8fbd-1ba1bef1b6fc","code":"11","name":"Computing"}],"locations":[{"id":"eddab549-8f93-4354-af71-5c7d57742355","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"1165d5fd-11f4-4dab-99c9-47b309481463","code":"C10","name":"Canterbury Christ Church University"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feeDetails":"In addition to the tuition fee, there are some additional costs which you will need to budget for. You will need to purchase your own textbooks.  You will pay for your own travel costs to your other sites and placements.  You may be able to claim back part of the placement travel costs from the University if you meet the specific criteria.\r\n\r\nYou will be expected to pay any library fees or fines you incur and for any printing or photocopying you do. \r\n\r\nYou can attend your graduation ceremony for free.  You will need to pay for robe hire, photography and guest tickets. \r\n","aboutCourse":"The course will prepare you to teach your chosen subject in the 7-14 age range.  The taught element is 36 weeks over a 9 month period.  You will spend approximately a third of the year training at the university and two thirds developing your teaching skills in two different schools. \r\nUniversity tutors and students will contribute to your sessions in university where your development, progress and practical teaching skills will be assessed.  \r\n\r\nCanterbury Christ Church University has a strong partnership with schools in Kent and Medway, nurseries and Further Education colleges in the region. Your course will be based on the latest research and you will be encouraged to reflect on how this impacts your own teaching.\r\nYou will be introduced to the principles, research and theory on which good classroom practice is based.  Activities that might be included during your degree include modelling, role-play, lectures, seminars, discussion, school/educational setting visits and evaluation of classroom-based activities and resources. \r\n\r\nYou will be assessed in two main ways: academic assignments and assessment of your teaching. Each of your modules is based on research which will enhance the education of your pupils as you will develop as a teacher. You will complete your own research projects which will help you develop as a teacher. \r\n\r\nThere are three modules: Subject Pedagogy, Professional Practice and Research and Enquiry in Education. Assessments will be:\r\n* Subject Pedagogy. You will be assessed by an individual presentation to an audience (50% of your mark) and a 2,000 word essay (50%)\r\n* Professional Practice. You will be assessed by an individual presentation which links theory and practice. You will use your evidence from professional practice to demonstrate that you have a critical understanding of a specific area in learning and assessment theories. This will be related to your subject or specified age range. \r\n* Research and Enquiry in Education. You will be assessed by either one 4,000 word essay (100% of your mark) or individual presentation (50%) and a 2,000 word literature review (50%)\r\n\r\nYou will be taught and supported by age-specific and subject experts with extensive experience in schools and other educational settings. In school, you will be supported by subject and professional mentors. Your teaching practice will be assessed against the national Teachers’ Standards.\r\nYou will have access to the university’s Virtual Learning Environment where you will find detailed information on your academic assignments and curriculum updates.\r\n","interviewProcess":"Your PGCE interview will be over the course of a day, typically from 9.30am to 4.30pm.  The day is designed to give you an idea of what it is like to be a trainee teacher at Canterbury Christ Church University (CCCU). \r\n\r\nWhen you are invited to interview, you will be sent an Initial Subject Knowledge Audit in Computer Science which you need to fill in and send back two days before. This audit will ask you to rate yourself in aspects of teaching Computer Science and your knowledge and experience through a structured questionnaire. You will also need to bring along any materials you need for your Micro Teach session and subject interview session.\r\n\r\nThe morning session is an introduction to the day. You will be asked to work in small groups with other candidates on collaborative tasks which are linked to general themes in education.  There will be a chance to learn about the structure of the programme and ask questions.\r\n\r\nIn the afternoon, your interview day will be subject-focussed. There are three parts: a written activity, the Micro Teach and the subject interview.  \r\nFor the Micro Teach, you will need to prepare a 5 minute teaching session where you will teach a topic found in the Key Stage 3 National Curriculum requirements for Computer Science. \r\n \r\nYour subject interview will be with your subject tutor. You will be asked questions about your experience, your knowledge of and teaching Computer Science.\r\n","howSchoolPlacementsWork":"Your placements will be in one of our partner schools.  All of the Initial Teacher Education programmes at Canterbury Christ Church University (CCCU) are run in partnership with our partner schools. The placement will allow you to put into practice your learning from the academic modules. In the initial placement you will work collaboratively with your mentor to help you develop your confidence in the classroom.  Your allocation of teaching time will then increase steadily over the course of the year.  Your University tutors will make visits to your placement school to support your mentor in working effectively with you.  \r\n\r\nYour placement school will depend on your subject specialism and age-phase. We do try and take into account your individual needs when allocating placements. We try to ensure that you will travel no more than an hour and a quarter from your home. Factors such as where you live and whether you drive or need to take public transport are taken into account. You will have the opportunity to gain experience across two consecutive age phases and in more than one school setting. \r\n\r\nYou will complete two block placements which cover two-thirds of your PGCE year.\r\n\r\nCCCU has partnerships with a number of schools, educational settings and colleges.  You will be mentored in school by one of our partner school mentors. Mentors take part in CCCU’s Mentor Development Programme which is based on the National Standards for school-based Initial Teacher Training mentors. You will also continue to receive support from your University tutors whilst on placement.","personalQualities":"We are looking for enthusiastic, resilient teacher trainees.  You will have good communication skills and a passion and commitment for working with young people.\r\n\r\nPrevious experience of teaching is not required, but you should be able to demonstrate an understanding of the teaching profession.  You would benefit from having a clear awareness of the UK education system.  You may consider gaining knowledge of how pupils learn to help you in your application.  \r\n","otherRequirements":"You will need a satisfactory Disclosure and Barring Service (DBS) check and health check carried out through the university.\r\n\r\n","status":1,"createdAt":"2021-07-06T10:52:06.178Z","updatedAt":"2021-08-18T10:33:47.202Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
