{"id":"866914ee-e6b5-4aa1-971c-d1448b228400","name":"Primary (Special Educational Needs)","code":"25QH","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"yes","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"e38cfff1-c198-494b-83de-4855ab065f39","name":"Chadsgrove School","isPublished":"N","status":"S","vacancies":"F"},{"id":"e04c313b-7cb3-4744-8448-9ab01410217c","name":"Wyre Forest School","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"c846f1d3-90ce-4583-bf34-d5f9657c1172","code":"17A","name":"Chadsgrove Training School"},"accreditedBody":{"id":"c357e0fa-802e-471b-818a-d0cd1434f9cd","code":"B32","name":"University of Birmingham"},"profPost":"PG","degreeGrade":"0","english":"1","maths":"1","science":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"no","courseLength":"OneYear","feesUK":null,"aboutCourse":"If you are keen to become a teacher and work with children with Special Educational Needs and Disabilities, then train to teach on the Chadsgrove School Direct programme. We offer trainees an exceptional opportunity to qualify as a Primary teacher, but with additional enhanced skills to effectively teach pupils with SEND. Previous trainees have gone on to be teachers in both mainstream and special schools. \r\nOn our salaried course you will be employed by your host special school and train in the classroom as an unqualified teacher, working alongside exemplary teachers. You will be mentored by experienced and enthusiastic practitioners who will provide the highest quality support whilst challenging you to become a confident and truly effective classroom teacher.\r\nOur course runs from September to July, and during this time you will spend 120 days on placement in two schools (8 weeks in mainstream and the remainder in a special school or specialist base), developing your professional skills, knowledge and understanding in motivating, supportive and inspiring settings. The proportion of time that you will be expected to directly teach pupils will increase during the year, so that by the later summer term you will be teaching up to 90% of the timetable. You will not be expected to teach classes unsupported until you and the school know that you are ready to do so. Your school-based mentor will formally observe your teaching during each placement, and provide feedback on your progress toward meeting the Teachers’ Standards. On three occasions during the year you will also be observed by a Lead Mentor from Chadsgrove or your Link Tutor from the university.\r\nYou will also spend around 25 days studying with the University of Birmingham, and attend school-based training days at Chadsgrove or one of our partner schools. Training days will cover topics such as subject knowledge, pedagogy, assessment, professional conduct, and effective support for pupils with a range of special educational needs and disabilities.\r\nThe University of Birmingham will award your PGCE from two assessed assignments.\r\n\r\n","interviewProcess":"Selection is a rigorous and thorough process designed to identify the applicants with the strongest aptitude. Chadsgrove, as the lead school in the partnership, coordinates the recruitment process in close liaison with the University of Birmingham and our partner schools. \r\n\r\nOur interview process normally takes place over a period of around 2½ hours. The process typically comprises an interview with a panel of 3 headteachers of partner schools, an interview with school council , an activity led by you with a group of pupils, and the university's Maths and English tests. However, during current Covid-19 restrictions we are operating a streamlined process with interviews conducted via Zoom.","howSchoolPlacementsWork":"During the course you will undertake placements in both specialist and mainstream primary settings.\r\nTrainees undertake an eight-week placement in a mainstream primary class during the autumn term, and during this time attend the university for block weeks and occasional single training days. For your mainstream placement we look to schools closest to your residential address.\r\nYou will spend the majority of your training experience, spring and summer terms, in your employing special school. During this period you will be in school for four days each week and attend training one day each week, either at Chadsgrove or at one of our partner schools.\r\n\r\n","personalQualities":"We are seeking highly motivated individuals, who have a passion to inspire minds, transform lives, and make a difference. We are particularly looking for people with experience of working with children, preferably in an educational setting, and who can demonstrate the ability to engage and inspire young minds. We want our teachers in training to be ambitious, passionate and enthusiastic about teaching pupils with Special Educational Needs and Disabilities, and who are committed to providing outstanding teaching and achieving the highest outcomes for their pupils.","otherRequirements":"All applicants will need to obtain an enhanced DBS check and complete a fitness to teach assessment before being accepted onto the course.","status":1,"createdAt":"2021-07-12T13:48:31.269Z","updatedAt":"2021-07-12T16:01:18.360Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"For the period of your training on the salaried school direct programme you will be employed by your host school (including during your mainstream placement) and paid a salary of Unqualified Pay Range 1, and will be taxed on earnings.\r\n\r\nThe current rate for Unqualified Pay Range 1 is available [here](https://www.tes.com/jobs/careers-advice/pay-and-conditions/pay-scale-calculator)\r\n\r\nYou will not be required to pay any tuition fees."}
