{"id":"c8621bf8-0dcb-40dd-89c5-cb6be0ab21b1","name":"Primary (Special Educational Needs)","code":"25QG","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"yes","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"3c9d23fe-f1d0-429f-89c7-e412e5dbcd91","name":"Meadows First School","isPublished":"Y","status":"R"},{"id":"34cc4b32-6f6c-4c4b-9b58-035d593c9d85","name":"Pitcheroak School","isPublished":"Y","status":"R"},{"id":"1f3ce70e-62e8-4ff4-b693-c3e1474865af","name":"The Westminster School","isPublished":"N","status":"S"},{"id":"e38cfff1-c198-494b-83de-4855ab065f39","name":"Chadsgrove School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"e04c313b-7cb3-4744-8448-9ab01410217c","name":"Wyre Forest School","isPublished":"Y","status":"R"},{"id":"019fdfcf-eb6a-467f-980d-f6d2f0b6bdc9","name":"Rigby Hall School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"3b8a9ecf-e00f-4b87-b86b-77de9b105b06","name":"Victoria School & Specialist Arts College","isPublished":"Y","status":"R","vacancies":"F"},{"id":"e3780f36-e512-4d93-988e-de8d08b28d90","name":"Fort Royal","isPublished":"Y","status":"R","vacancies":"F"},{"id":"71362dc3-86a3-40b8-bb0b-eb42abca45b4","name":"Cherry Trees School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"dbd47b0d-1676-49c5-9bda-909a87e7f0e0","name":"The Orchard School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"c846f1d3-90ce-4583-bf34-d5f9657c1172","code":"17A","name":"Chadsgrove Training School"},"accreditedBody":{"id":"c357e0fa-802e-471b-818a-d0cd1434f9cd","code":"B32","name":"University of Birmingham"},"profPost":"PG","degreeGrade":"0","english":"1","maths":"1","science":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"If you are keen to become a teacher and work with children with Special Educational Needs and Disabilities, then train to teach on the Chadsgrove School Direct programme.\r\n\r\nWe offer trainees an exceptional opportunity to qualify as a Primary teacher, but with additional enhanced skills to effectively teach pupils with SEND. Previous trainees have gone on to be teachers in both mainstream and special schools.\r\n\r\nOur programme enables you to train in the classroom, working alongside exemplary teachers within each school setting. You will be mentored by experienced and enthusiastic practitioners who will provide the highest quality support whilst challenging you to become a confident and effective classroom teacher.\r\n\r\nOur course runs from September to July, and during this time you will spend 120 days on placement in two schools (8 weeks in mainstream and the remainder in a special school or specialist base), developing your professional skills, knowledge and understanding in motivating, supportive and inspiring settings.\r\n\r\nThe proportion of time that you will be expected to directly teach pupils will increase during the year, so that by the later summer term you will be teaching 80% of the timetable. You will not be expected to teach classes unsupported until you and the school know that you are ready to do so. \r\n\r\nYour school-based mentor will formally observe your teaching during each placement, and provide feedback on your progress toward meeting the Teachers’ Standards. On three occasions during the year you will also be observed by a Lead Mentor from Chadsgrove or your Link Tutor from the university.\r\n\r\nYou will also spend around 25 days studying with the University of Birmingham, and attend school-based training days at Chadsgrove or one of our partner schools. Training days will cover topics such as subject knowledge, pedagogy, assessment, professional conduct, and effective support for pupils with a range of special educational needs and disabilities.\r\n\r\nThe University of Birmingham will award your PGCE from two assessed assignments.\r\n\r\nIn 2013 Ofsted judged teacher training at the University of Birmingham to be Outstanding and stated:\r\n“Such is the confidence of schools that trainees from the University of Birmingham are of high quality, employment rates for both primary and secondary phases exceed national averages by some margin.”\r\n","interviewProcess":"Selection is a rigorous and thorough process designed to identify the applicants with the strongest aptitude. Chadsgrove, as the lead school in the partnership, coordinates the recruitment process in close liaison with the University of Birmingham and our partner schools. \r\n\r\nOur interview process normally takes place over a period of around 2½ hours. The process typically comprises an interview with a panel of 3 headteachers of partner schools, an interview with school council , an activity led by you with a group of pupils, and the university's Maths and English tests. However, during current Covid-19 restrictions we are operating a streamlined process with interviews being conducted via Zoom.","howSchoolPlacementsWork":"During the course you will undertake placements in both specialist and mainstream primary settings. We have special education placements across the Worcestershire, south Birmingham, Sandwell, and Wolverhampton areas, and work with a number of mainstream primary schools within the region. \r\n\r\nTrainees undertake an eight-week placement in a mainstream primary class during the autumn term, and during this time attend training days at the university, including two block weeks. For your mainstream placement we look to schools closest to your residential address.\r\n\r\nYou will spend the majority of your training experience, the spring and summer terms, in one of our special schools or specialist bases (such as an autism support unit). During this period you will be in school for four days each week and attend training one day each week, either at Chadsgrove or at one of our partner schools.\r\n\r\nWhilst we ask applicants to identify a preference for their special school placement, we cannot guarantee that first choices will be offered as schools are limited on the number of teachers in training that they can support each year.\r\n\r\n","personalQualities":"We are seeking highly motivated individuals, who have a passion to learn, inspire minds, transform lives, and make a difference. We are particularly looking for people who can articulate the rewards of working with children in an educational setting, and who can demonstrate the ability to engage and inspire young minds. We want our teachers in training to be ambitious, passionate and enthusiastic about teaching pupils with Special Educational Needs and Disabilities, and who are committed to providing outstanding teaching and achieving the highest outcomes for their pupils.","otherRequirements":"All applicants will need to obtain an enhanced DBS check and complete a fitness to teach assessment prior to being accepted onto the programme.","status":1,"createdAt":"2021-07-12T13:48:31.225Z","updatedAt":"2021-07-12T16:01:57.237Z","canSponsorStudentVisa":"yes","cycle":"2024"}
