{"id":"b5d2ec7c-cac3-4a8a-91dd-4b003c472e53","name":"Primary","code":"37HL","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"8b89d1ae-304d-45e3-92ff-873e66b41432","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"75bd7d1e-47d6-4b54-8d10-50d545b3f444","code":"2CM","name":"Oakwood Academy"},"accreditedBody":{"id":"812b70c4-7fc4-46fc-975b-3e4d00f77dc4","code":"M40","name":"The Manchester Metropolitan University"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9000,"aboutCourse":"Throughout your time on a primary School Direct PGCE you will have time in University to learn basic teaching skills and subject knowledge. The lead school will host professional sessions to cover areas such as teaching and learning, safeguarding, lesson planning, behaviour management, pupil progress and assessment, dealing with parents, differentiation and well being. These will be delivered by senior staff from Oakwood or Specialist leaders within our alliance. First placement starts in Sept and last around 14 weeks up until Christmas. 2nd placement begins early January and ends end of March ( 10 weeks). 3rd and final placement starts beginning of May and ends mid June (6 weeks). You will be assessed continuously via lesson observations on a weekly basis and formal feedback will be given. You will also complete 3 assignments throughout the year. This course is unique and we welcome candidates to apply if you would like experience of both mainstream and special needs. This gives you more skills to be able to teach in either setting.","interviewProcess":"If you are successful in being shortlisted for interview you will be contacted via email by the lead school (Oakwood Academy).\r\n\r\nThe interview consists of the following tasks:\r\nLesson activity 15-20 mins\r\nInterview 30 mins\r\nwritten task 25/30 mins\r\n\r\nYou will be notified on the day if you have been successful or not and feedback will be given.\r\n\r\n","howSchoolPlacementsWork":"Thoughout your School Direct PGCE you will have 3 main placements (each between 8 - 12 weeks in length) along with one 2 week inclusion placement.  Your school placement would be selected in consultation with the trainee looking at travel distance from home. \r\nAll our partner primary schools are located locally to Oakwood. \r\nSt Mary's C.E Primary, Irlam & Cadishead\r\nSt Mary's R.C Primary, Eccles\r\nMonton Green Primary, Eccles\r\nKingsway Primary School, Trafford\r\nGreen Lane Special School, Warrington\r\nOakwood Academy Special School , Eccles.\r\nYou will have the opportunity to teach from year 1 - year 6 in both mainstream and special schools. This opportunity is adding more skills for you to take into your first teaching post.","personalQualities":"Oakwood Teaching School Alliance are looking for well motivated candidates who have a clear passion to teach young people. We are looking for candidates who can communicate well and show confidence in a classroom environment. We are keen to recruit people who are 100% committed and have high expectations of themselves and others. ","otherRequirements":null,"status":1,"createdAt":"2021-07-06T10:47:04.674Z","updatedAt":"2021-09-16T10:42:56.752Z","canSponsorStudentVisa":"yes","cycle":"2024"}
