{"id":"0733d1bd-2a48-49a3-9e08-1d44d4b6a0e3","name":"Primary","code":"2RWM","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"71c973d3-1585-498a-a228-09ee6f9c756c","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"9e16b352-794f-4031-9d55-75820dbb8699","code":"165","name":"Bridging the Tamar Learning Alliance"},"accreditedBody":{"id":"a4e84530-e1f1-47c6-b57e-ec693d629637","code":"P63","name":"Plymouth Marjon University"},"degreeGrade":"1","english":"1","maths":"1","science":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"no","courseLength":"OneYear","aboutCourse":"This course is run from Sir Robert Geffery's School in Landrake (which is close to the Tamar Bridge and Plymouth) where the salaried teacher will be employed.  Sir Robert Geffery's is an outstanding school that has had a high level of success in teacher training.  Bridging the Tamar SLEs provide additional training throughout the year.\r\n\r\nStudents will have the opportunity to also develop subject specialisms in the primary curriculum by working alongside our specialist delivery team.\r\n\r\nAs Bridging the Tamar is a small Teaching School, we pride ourselves in the ability to bespoke the training to meet the needs of our successful candidates.","interviewProcess":"Interviews are arranged throughout the year when we invite candidates to spend a day at the school meeting the staff and pupils.  During the day a lesson will be taught and a presentation made to the School Council.  Representatives from the Governing Body and Marjons usually attend the formal interview process.","howSchoolPlacementsWork":"During the training, students work across the whole primary age range.  Two practices will take place at Sir Robert Geffery's and one other at a contrasting school.  This is to improve the employability of students leaving the course.  Depending upon where students live, the placements are allocated.","personalQualities":"We welcome applications from people with experience of working with children and the English National Curriculum.\r\n\r\nEnthusiastic learners who thrive in a busy and exciting environment. ","otherRequirements":"Please state all qualifications on application form.\r\n\r\nA successful candidate will need an enhanced dbs check.","status":1,"createdAt":"2021-07-06T10:54:58.738Z","updatedAt":"2021-09-30T10:20:00.180Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"The salary offered is 0.8 of the unqualified teachers pay because of the number of training days provided during the year.  The QTS tuition fees are also paid by the School."}
