{"id":"5c10b40d-fe0d-4da0-949b-2c90abff14c5","name":"Primary (Physical Education)","code":"2RWS","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"5ae4c96e-1da2-4831-91a3-64439b606fed","code":"06","name":"Primary with physical education"}],"locations":[{"id":"71c973d3-1585-498a-a228-09ee6f9c756c","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"9e16b352-794f-4031-9d55-75820dbb8699","code":"165","name":"Bridging the Tamar Learning Alliance"},"accreditedBody":{"id":"a4e84530-e1f1-47c6-b57e-ec693d629637","code":"P63","name":"Plymouth Marjon University"},"degreeGrade":"1","english":"1","maths":"1","science":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"no","courseLength":"OneYear","feesUK":9000,"aboutCourse":"This course is run from Sir Robert Geffery's School in Landrake (which is close to the Tamar Bridge and Plymouth).  Sir Robert Geffery's is an outstanding school that has had a high level of success in teacher training.  Bridging the Tamar SLEs provide additional training throughout the year. \r\n\r\nThe students will work alongside PE Specialist teachers in the afternoons as well as learning to deliver Maths and English in the morning sessions.\r\nStudents will have the opportunity to also develop other subject specialisms in the primary curriculum by working alongside our specialist delivery team.\r\n\r\nAs Bridging the Tamar is a small Teaching School, we pride ourselves in the ability to bespoke the training to meet the needs of our successful candidates.\r\n\r\n","interviewProcess":"Interviews are arranged throughout the year when we invite candidates to spend a day at the school meeting the staff and pupils.  During the day a lesson will be taught and a presentation made to the School Council.  Representatives from the Governing Body and Marjons usually attend the formal interview process.","howSchoolPlacementsWork":"During the training, students work across the whole primary age range.  Two practices will take place at the lead school and one other at a contrasting school.  This is to improve the employability of students leaving the course.  ","personalQualities":"We look for enthusiastic learners who thrive in a busy and exciting environment.  Potential to become an inspirational practitioner who can motivate others.\r\nPassion for PE and talent in sports","otherRequirements":"Please record all qualifications on application.\r\n\r\nSuccessful candidates will need to have an enhanced dbs check\r\n","status":1,"createdAt":"2021-07-06T10:54:58.803Z","updatedAt":"2021-09-30T10:27:43.822Z","canSponsorStudentVisa":"yes","cycle":"2024"}
