{"id":"8c2069d5-bc16-4cfb-94ab-2cf57e3c52c3","name":"Modern Languages","code":"3D62","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"4608e5e3-2a1a-48a1-8236-56c7af5a139d","code":"24","name":"Modern languages (other)"},{"id":"ce8523ef-9236-4cd9-b260-d826c7a521b3","code":"ML","name":"Modern Languages"}],"locations":[{"id":"c4f2e6ff-fb09-4847-adcb-195034486945","name":"St Mary's","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"12d161ca-40a3-4224-a1ec-95ba1781e61f","code":"2KN","name":"St Mary’s Catholic School"},"accreditedBody":{"id":"917facc1-82bb-4a00-a765-a1522edcb916","code":"2BA","name":"Sacred Heart Newcastle SCITT"},"profPost":"BO","degreeGrade":"9","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"We are an alliance of 10 placement/ partner schools which span across the Newcastle, Durham and North Tyneside areas. We have a track record of providing an outstanding, bespoke and inspirational School Direct teacher training programme. Successful completion of the course will result in QTS (Qualified Teacher Status), PGCE (Postgraduate Certificate of Education) with Newcastle University and an opportunity to gain 60 credits towards Masters accreditation. \r\n\r\nOur course begins with an induction days at St Mary’s Catholic School in the summer term of 2019.   At the beginning of the autumn term 2019, you will be part of the staff at your first training school, which will give you the opportunity to be involved in the school training days and be able to familiarise yourself with general school life. During this induction time, observe and jointly plan and team teach lessons, and spend time in your subject area working with small groups of students. You will also attend alliance development days and twilight sessions throughout the year where you will have training on key areas.  You will also spend every Friday in Newcastle University to be introduced to the Professional Studies aspect of the course.\r\n\r\nYour first assessed teaching practice will begin after October half term and will involve you teaching 50% of a normal newly qualified teaching timetable.  Additional placements will require you to teach up to 60% of a normal NQT timetable. These final placements will be in your second training school, enabling you to build strong relationships with colleagues and students, maintain continuity teaching and, to fully become part of the school. \r\n\r\nDuring your training, you will have regular contact with the university in order to complete the professional studies aspect of the course as well as full access to the university facilities and lecturers' expertise.   You will also take part in school-based training within your training schools. This will be delivered by a wide range of experienced teachers. \r\n\r\nAll trainees must show evidence that they have fully met each of the Teachers' Standards by the end of the course. Assessments against the Teachers' Standards are carried out through lesson observations, review of practice, formal assessments, mentor and tutor visits. By the end of the course, you must submit a detailed and comprehensive portfolio which contains evidence you have gathered over the one year course. \r\n","interviewProcess":"Shortlisting \r\nCourse Leaders and Leadership from the alliance of schools will look at application forms and references very closely. Your choice of referees is very important; if possible, select referees who are able to comment on your suitability of becoming a teacher, for example, a teacher from your recent school experience. Once the application has been considered, a shortlist for interview will be agreed. \r\n\r\nThe Interview Day \r\nSt Mary’s School is the Lead school will be co-ordinating the recruitment process. Interviewing will take place across a number of schools within our alliance, including St Mary’s School. The process will involve spending time at the school, having a carousel of interviews, talking to a range of experienced staff about your school experiences and subject knowledge, as well as an opportunity to discuss a lesson you will be expected to plan prior to the interview. \r\n\r\nOffers \r\nAll offers to train within St Mary’s Teaching School Alliance are conditional to the applicants obtaining: a DBS, professional skills tests in literacy and numeracy, as well as original documentary evidence of degree and GCSE qualifications - which must be provided at interview. You may be required to complete a subject enhancement course (SKE) before your training begins. \r\n\r\nOnce you have been interviewed, you will be informed that day of the alliance's decision which will be uploaded onto UCAS. Please note, if you are successful, your place will be held with UCAS and CANNOT be offered to any other applicant until you have made your decision. ","howSchoolPlacementsWork":"School Direct is a way for passionate and enthusiastic people to train to become teachers. You will be trained in a highly professional and supportive environment and will develop the skills, knowledge and expertise that will enable you to plan and deliver engaging learning experiences for pupils of all abilities and dispositions. \r\n\r\nYou will be placed in one of our host schools, where you will complete most of your training. You will begin your training on the first day of term in September. You will attend staff meetings and professional development days and will be treated as a member of staff from the outset. You will spend 4 days a week working and learning alongside teachers in the classroom. Friday is our designated training day. The majority of these training days take place in our schools, with some Fridays throughout the year spent at the university. \r\nYou will do two assessed placements. The first assessed placement (AP1) takes place in October/November in a second placement school. The second assessed placement (AP2) takes place in the host school from the end of January until June. Your training will cover 2 consecutive key stages. \r\n\r\nYou will be required to submit 3 assignments to the university. Assignments will be founded upon educational theory as well as school based action research. In 2 of the assignments you will have the opportunity to demonstrate achievement at level 7, gaining 60 credits towards a Masters degree. You will attend training at the university on a regular basis to prepare you for these assignments and you will have full access to the university library. \r\n\r\nMentoring is a crucial part of our training programme. During your time in school you will work closely with a mentor in order to develop your knowledge and practice. Mentors are carefully selected for their ability to support and train aspiring teachers. You will also be assigned a university academic tutor who will provide guidance for the modular assignments. \r\n","personalQualities":"We are looking for a dynamic, committed and ambitious trainee teacher with a passion for teaching and learning. You must have a desire to inspire young people in the secondary age range and an ability to share and communicate your enthusiasm for your subject. We would expect you to be well-organised, hard-working, empathetic, approachable and resilient. You need to be willing to evaluate your practice and be able to respond to feedback given. A willingness to co-operate and share ideas during the course is also essential.  Finally, we expect you to act and dress professionally at all times.","otherRequirements":"Successful applicants will also not be permitted to begin their training without being in possession of an Enhanced Criminal Bureau check which verifies your suitability for working with young people. Once the offer of a place has been made, forms which need to be completed will be sent out to you.","status":1,"createdAt":"2021-07-06T10:46:54.130Z","updatedAt":"2021-07-12T09:31:20.222Z","canSponsorStudentVisa":"no","cycle":"2024"}
