{"id":"ce013880-8d7c-40b3-9b39-dfec33199272","name":"Physics","code":"2TJ4","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"bf97cd0a-224c-43d3-a021-84143df13e8d","code":"F3","name":"Physics"}],"locations":[{"id":"95fee653-dd20-4951-8adb-65579df57bd5","name":"Sydney Russell School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"7e047ce4-9c75-4003-8631-bd6bd1d6b0bf","name":"St Angela's Ursuline School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"a6a60029-f606-42b6-b526-48360b61890c","code":"2B1","name":"Partnership London SCITT (PLS)"},"profPost":"PG","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"A recognised awarded honours degree (or equivalent) of at least 2:2 classification with at least 50% of the degree content being in the subject to be taught although consideration will be given outside this criteria on a case-to-case basis","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Equivalency tests must be taken with a recognised provider.  Costs vary with each provider and the candidate is expected to pay these costs themselves.","courseLength":"OneYear","feesUK":9250,"feeDetails":"DBS and fitness to teach medical are an additional cost ","financialSupport":"You can find information about tuition fee loans and other financial help on the Gov.uk website - (https://www.gov.uk/student-finance) ","aboutCourse":"You will join Partnership London SCITT's  programme with full access to all services and facilities. You will benefit from the world-class expertise and research profile of our team.  You are supported professionally by a system of school and personal tutoring and will spend a minimum of 120 days in school , divided into three assessment phases. This will give you an opportunity to gain experience in contrasting educational settings \r\n\r\nThe programme covers your chosen National Curriculum subject in detail as well as providing opportunities to learn about professional issues and research in education. You will benefit from an approach to teacher education that puts creative, inclusive and reflective practice at the heart of our programmes. \r\n\r\nThis programme will give you a thorough grounding in all aspects of the National Curriculum for your chosen subject. \r\nIt offers a balance of theory and practice, including the opportunity to understand the historical forces and ideas that have shaped today's curriculum. You're taught to appreciate a wide range of teaching approaches and we deal in detail with the planning and evaluation of lessons, assessment, marking and examination syllabuses. \r\n\r\nPGCE Accreditation with Sussex University\r\nWe offer the PGCE in pedagogy and practice awarded by Sussex University. The course structure is a three-fold assessment through a 6000 word essay, presentation of directed tasks and portfolio evidence presented orally towards the end of the course. There will be support from the university as well as from PLS and this is an ideal way to gain PGCE for those wishing to have that academic award in addition to QTS. \r\n\r\nProfessional Studies and Subject Development Sessions\r\nThese will take place on a weekly basis throughout your training and will cover the key issues both in the classroom and those wider issues of professional responsibility and professional conduct. \r\n\r\nIn addition to the subject development and professional studies sessions you will also have a mentor who you will meet with on a weekly basis for review, reflection and target setting. \r\n\r\n","interviewProcess":"Selection Process\r\nYou will be interviewed by a Partnership London SCITT director and a subject specialist. In order for your application to be considered you should consider your personal statement as being an important part of this process. \r\n\r\nReferences\r\nWe require two references one of which will be an academic reference. If you completed your studies more than five years ago your employer should provide your first reference. \r\n\r\nInterview\r\nWe will interview all shortlisted candidates prior to making an offer of training. If you are invited to interview, we expect knowledge of key aspects of education and excellent subject knowledge. \r\nThe interview process will include \r\n- Preparing and presenting a lesson \r\n- Written tasks\r\n- A formal interview \r\n\r\nYou will be assessed on your ability to communicate clearly and engage the audience. \r\nAll teachers need to be able to write English clearly without errors in spelling, punctuation or grammar because this is part of the job. Therefore there will be a fundamental English written assessment as part of the selection process as well as a written assessment for fundamental maths and a subject related written assessment. \r\n\r\nThe interview will assess you on the following criteria:-\r\n- Appropriateness of subject qualifications \r\n- Capacity to expand subject knowledge \r\n- Awareness of the roles and responsibilities of a teacher \r\n- Any teaching or school based experience \r\n- Resilience \r\n- Ability to communicate effectively \r\n- Enthusiasm for, and commitment to teaching \r\n- Self-awareness of both strengths and areas to improve \r\n","howSchoolPlacementsWork":"The training model is very much rooted in the philosophy of our mission statement, viewing all as life-long learners. \r\nWe find the following definition of pedagogy useful:-\r\nPedagogy is the act of teaching together with its attendant discourse. It is what one needs to know, and the skills one needs to command in order to make and justify the many different kinds of decisions of which teaching is constituted (Alexander 2003) \r\n\r\nYou will have two teaching placements in contrasting schools covering at least two different key stages. These placements will not necessarily be in Sydney Russell School or St Angela's Ursuline School.  There are a number of secondary and primary schools within our SCITT Partnership, so you could be placed in any one of them.\r\nThe training will follow what is commonly referred to as an ABA model. The second placement (B) is six weeks and takes place in the spring term. \r\nTherefore most of the training year will be spent in your main placement school (A), allowing you to get to know the systems, students and staff. \r\nYou will get weekly input on subject pedagogy as well as professional studies. These sessions will be delivered by very experienced practicing teachers, a key part of our training model. \r\n","personalQualities":"- Enthusiasm for teaching \r\n- Positive attitudes to young people and their education\r\n- Understanding the importance of establishing respectful, supportive and constructive relationships\r\n- Ability to communicate effectively and accurately in spoken and written English\r\n- Ability to reflect critically and creatively\r\n- Evidence of wider educational reading and knowledge of key issues facing educators \r\n- A sense of the scope of teachers' professional skills and responsibilities\r\n- Understanding ‘Fundamental British - Values’ and its importance to all aspects of teaching\r\n- Awareness of key safeguarding issues \r\n- Commitment to inclusion and equal opportunity\r\n- A strong work ethic\r\n","otherRequirements":"A UK ENIC Statement of Comparability  should be provided for non UK GCSE and degree level qualifications.\r\n\r\nLiteracy and Numeracy \r\nCandidates are expected to be competent in fundamental English and Mathematics.  This will be tested during the interview.\r\n\r\nDBS and Medical\r\nPLS places are offered conditionally subject to  a successful DBS check \r\nand a health check to ensure that they have the health and physical capacity to teach without putting young people at risk. \r\nFailure to complete this questionnaire or any trainee deemed being unfit to teach will result in any offer of a place being withdrawn \r\n","status":1,"createdAt":"2021-07-06T10:56:41.804Z","updatedAt":"2021-10-04T07:23:10.525Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
