{"id":"d55c3942-b668-434c-ae47-0321780cc984","name":"Drama","code":"T493","qualification":"qts","startDate":"2022-09-01T09:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"69052223-ca45-4781-a8d3-cb92447a6d78","code":"13","name":"Drama"},{"id":"74d64a54-5e34-4590-b6c7-528dd0cf26fe","code":"C6","name":"Physical education"},{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"95fee653-dd20-4951-8adb-65579df57bd5","name":"Sydney Russell School","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"7e047ce4-9c75-4003-8631-bd6bd1d6b0bf","name":"St Angela's Ursuline School","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"5cfa3495-a629-4c42-8294-df57fa52f134","name":"Horncastle Primary School","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"be779ee5-44ec-4993-ba99-4016a9db0dbf","name":"Littlecoates Primary Academy","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"ab2cd1c8-acca-4d29-bc59-363665df7895","name":"Lacey Gardens Junior Academy","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"6ceb468e-626a-4b2a-b6ec-ebfcbb5a0a76","name":"Devonport High School for Boys","isPublished":"true","status":"running","vacancies":"none"},{"id":"904ce688-2e22-4468-9310-e5fac1871924","name":"Eastfield Infants and Nursery Academy","isPublished":"true","status":"running","vacancies":"full_time"}],"trainingProvider":{"id":"a6a60029-f606-42b6-b526-48360b61890c","code":"2B1","name":"Partnership London SCITT (PLS)"},"degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"A recognised awarded honours degree (or equivalent) of at least 2:2 classification with at least 50% of the degree content being in the subject to be taught although consideration will be given outside this criteria on a case-to-case basis","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Equivalency tests must be taken with a recognised provider.  Costs vary with each provider and the candidate is expected to pay these costs themselves.","courseLength":"OneYear","feesUK":8500,"aboutCourse":"All of the courses that we offer are very practical routes into teaching, offering hands on teaching experience, that is facilitated by experienced, practising teachers. Through all of our routes you will be supported and supervised by an experienced class based mentor to ensure you develop and grow into an outstanding teacher. Your mentor will be in class with you all year, guiding and helping you as you train. In addition to this, EoETT will also provide you with a Quality Assurance Tutor who will regularly visit you, providing constructive feedback and support to ensure your development. You will be based in school, on average, four days a week, learning from the experts and seeing first hand how to be an outstanding teacher. Approximately once a week you will attend training in Lincoln, which is led by current teachers from the school partnership and experts. \r\n\r\nYou will start with your ‘host school’ in September, and remain with them until the end of the course in July, except for when you undertake a contrasting 6 week second school placement within our partnership. We can GUARANTEE that all your school placements will take place within your local area - wherever this is. Because you spend so much time in school, you will build fantastic relationships with the children in your class and embed your understanding of the primary curriculum and progression, fully preparing you for your NQT year. Many of our trainees secure employment in their host school or second school and we continue to have high employment rates.\r\n\r\n\r\nAs with any ITT course, you will be assessed against the Teachers’ Standards and will build a portfolio of evidence across the course that is added to our online portal. Evidence will comprise of the activities you do weekly in school (lesson plans, observations, reflections) and expectations for this evidence will be explained to you at the start of the course.\r\n\r\nIf you choose to complete the QTS only course, you will complete 1 assignment at level 6 equivalent - this is marked by East of England Teacher Training.\r\nIf you choose to complete the QTS and PGCE course, you will complete 2 assignments and submit these to our University partner (University of Hull), who will mark these at level 7. The University of Hull will travel to Lincoln to deliver training sessions, you will not need to travel to Hull.","interviewProcess":"We offer a free ‘checking’ service, where we will give you feedback on your personal statement before you apply. Applications will be screened and suitable candidates will be shortlisted to attend an interview, usually in their local area. If selected for interview, we will provide you with full information regarding the interview process, so you feel confident and well informed to attend. All interviews will be held in a school and you will be expected to teach children as part of the interview process. \r\nYou will be interviewed by a panel (usually a panel of 2) which consists of head teachers of schools in your local area or senior leaders from the schools and may include the Head of SCITT too.\r\nAt the end of the interview we will phone you to discuss the interview and the outcome, as a supportive measure. If you are successful, you will be offered a conditional place. All trainees are set targets from interview, to ensure they are fully ready to start the course.\r\nThe availability of school places in the trainee’s local area will be discussed following the interview process and trainees will then visit recommended schools, so they can choose which school suits them the best and the schools can select a trainee that matches their needs. \r\n","howSchoolPlacementsWork":"We guarantee that all trainee’s placement will be within their locality - we work hard to ensure that the trainee does not have to travel too far. \r\nAfter the interview, the availability of places in the trainee’s local area will be discussed. Trainees will then visit schools, so they can choose which suits them the best and the schools can select a trainee that matches their needs.\r\n\r\nFollowing a successful school visit, your host school will be agreed with you. We would encourage all trainees to develop their relationship with their host school and visit them as much as you feel able to, so you get to know one another, before the course starts. The more the trainee gets to know the systems and routines of the host school, the smoother the transition can be at the start of the training year and the trainee will feel more settled.\r\n\r\nPlacement schools are guaranteed to be within your locality (e.g if you live in Grimsby, your placements will be in Grimsby); a full Schools lists can be found here and is updated regularly: https://www.eoettc.com/school-partnerships . If you are from an area where we don’t have an existing partnership, please contact us as we may have historic relationships with schools in your area and we are always looking to expand the schools in our partnership. \r\nIf you have a school that is willing to support you, we will happily welcome new schools into the partnership - contact us to discuss options further.\r\n\r\nAs the course is school based you will have 2 placements; your host school, and a 6 week second school placement. We follow the ‘ABA’ model, meaning you start in your host school, complete your second school visit and then return to your host school.\r\nYou will also undertake a 1 week special school/inclusion experience.\r\n\r\nWhilst the course is a Primary (3-11) course, you will have the choice of choosing to specialise in 3-7 years (EYFS & KS1) or 5-11 years (KS1 & 2) or even 7-11 (KS2 only). Your teaching will take place within this chosen age range. \r\n","personalQualities":"We are looking for passionate, exceptional individuals who want to truly inspire future generations. If you are a practical learner who likes to roll their sleeves up and get stuck in, then this is the course for you! Our trainees spend on average 40 more days in the classroom than other University based routes, meaning you are better prepared for your NQT year. If you are an ambitious, creative learner and want to discover yo","otherRequirements":"Successful applicants will be subject to an enhanced DBS and other safeguarding checks.\r\nPlease be aware that central training is in Lincoln, so if you live outside of this region you will need to travel to training. However, we do encourage trainees to car share where possible to save costs.\r\n","status":1,"createdAt":"2021-10-04T11:33:22.068Z","updatedAt":"2021-10-04T11:34:26.656Z"}