{"id":"d938f608-a90a-4f69-8580-7b3f51800549","name":"Primary","code":"386F","qualification":"qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"45330592-6f9e-4d8d-92f7-1d1e3181b553","name":"Main Site","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"a1c2e812-9ff8-4714-8782-51ece5b8d788","code":"13E","name":"Bishop’s Stortford Education Trust (BSET) SCITT"},"accreditedBody":{"id":"36ab034c-5c27-4ee6-9285-fbdae986131d","code":"26T","name":"Bishop’s Stortford SCITT"},"degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":null,"aboutCourse":"This course is offered as salaried  route into teaching.\r\n\r\nYou will observe and teach across key stages 1 and 2, including experience of pupils in years 3 and 6. \r\n\r\nSalaried trainees will teach a partial timetable from the beginning of the course, approx. 10 lessons per week.\r\n\r\nTrainees work in their placement school Monday - Wednesday and Fridays. Thursdays are training days where Trainees will attend Professional Studies with all the other SCITT Trainees at Leventhorpe and occasionally at one of our Primary Partner Schools.\r\n\r\nDuring the training year Trainees will complete two assignments. The first focuses on the skills of medium term planning. It requires Trainees to focus on the needs of their pupils and the way sequences of lessons need to be planned and evaluated for pupils to make the best possible progress. The second assignment focuses on the skills of action research and requires Trainees to think about the needs of different groups of pupils within the classroom and how they might respond in different ways to learning activities.\r\n\r\nAssessment of Trainees against the QTS standards will be overseen by the Training Manager, who will be supported by quality assurance through the External Moderator. \r\n\r\nJudgement and moderation will take place in late June of the training year. The External Moderator will attend Leventhorpe and visit some Trainees in their placement schools to observe the teaching of the standardisation sample of Trainees.\r\n\r\nTrainees must meet the Teacher Standards at a minimum expectation. There will be a number of sources of evidence used to assess Trainees against the Teacher Standards. These will be: Trainee Evidence Folder, lesson observation records and accompanying Professional Learning Conversations, the academic assignments and school placement assessments (completed each term by the Teacher Mentor and Professional Tutor), as well as the Subject Mentor and Professional Studies Assessments.\r\n\r\nIf you would like any further details or information, we would be very happy to hear from you. Please contact Liz Smith  on 01279 603 104\r\n","interviewProcess":"We have a rigorous recruitment and selection process. Candidates will be interviewed by the Employing School and, if successful, by the SCITT Training Manager for suitability on the Training Programme.  \r\n\r\nDue to the current situation it is likely that part or all of the interview will take place online.\r\n\r\nAs part of our interview process, it is likely that candidates will be required to:\r\n- Plan and deliver a lesson in a classroom situation.\r\n- Complete a written literacy and numeracy task.\r\n- Attend a panel interview with the Primary Headteacher.\r\n\r\n\r\n","howSchoolPlacementsWork":"Salaried trainees spend the majority of their time at their employing school, with only 6 weeks being spent in the Spring term at their second minor placement school. \r\n\r\nBoth Primary and Secondary trainees must gain experience in two consecutive age ranges:\r\n\r\n- Primary Trainees on the age 5-11 programme should have experience (teaching and observing) of years 1 to 6 (Key stages 1 and 2).\r\n- For Secondary Trainees this depends on the age range applicable to the subject in which they are training to teach. For those subjects in the secondary age range 11-16, Trainees will teach across Key Stages 3 and 4, Year 7-11. For those subjects in the secondary age range 14-19, Trainees will teach across Key stages 4 and 5, Years 10-13). \r\nIn addition, Trainees may be given the opportunity to teach outside of the age ranges for which they are being trained.\r\n\r\nIt is optimal for potential trainees to secure a sponsoring school willing to offer employment as a primary salaried trainee. ","personalQualities":"We wish to recruit people from a diverse array of backgrounds and experiences, whether you are straight out of university or a career changer. \r\n\r\nA genuine enjoyment of working with young people and a keen interest in making a difference to their life chances is essential. ","otherRequirements":"At BSET safeguarding of children is our first concern and so in addition to DBS checks we reserve the right to make additional checks of former employers. \r\n\r\nWe do not make school experience a condition for application but it is a good idea if you have a good understanding of the school setting and knowledge of curriculum.\r\n\r\nExperience of working in a school or with young people is an advantage but not essential. \r\n","status":0,"createdAt":"2021-07-06T10:50:36.437Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"Salaried trainees are paid on the unqualified teachers' pay scale.\r\n\r\nTraining Fees are paid by the Employing School."}
