{"id":"fe1e2664-3256-4829-8b8d-e85ba3945c21","name":"History","code":"38HS","qualification":"qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"5a3609a0-5bbb-4377-b919-5d89932ab622","code":"V1","name":"History"}],"locations":[{"id":"45330592-6f9e-4d8d-92f7-1d1e3181b553","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"a1c2e812-9ff8-4714-8782-51ece5b8d788","code":"13E","name":"Bishop’s Stortford Education Trust (BSET) SCITT"},"accreditedBody":{"id":"36ab034c-5c27-4ee6-9285-fbdae986131d","code":"26T","name":"Bishop’s Stortford SCITT"},"degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9000,"aboutCourse":"This course is offered for fee paying trainees.\r\n\r\nAs a Trainee you will observe and teach across Key Stages 3 and 4, including experience of pupils in years 7 and 11.  During the first few weeks you will observe or team teach. This may develop into a contact timetable of up to 40% of a full time teacher during the first placement school (approx.8 lessons), building up to 65% of a full time teacher during terms two and three (approx. 13 lessons). \r\n\r\nTrainees work in their placement school Monday- Wednesday and Fridays. Thursdays are training days where trainees will attend Professional Studies with all the other SCITT trainees at Leventhorpe and occasionally at one of our Primary Partner Schools.\r\n\r\nDuring the training year trainees will complete two assignments. The first focuses on the skills of medium term planning. It requires trainees to focus on the needs of their pupils and the way sequences of lessons need to be planned and evaluated for pupils to make the best possible progress. The second assignment focuses on the skills of action research and requires trainees to think about the needs of different groups of pupils within the classroom and how they might respond in different ways to learning activities.\r\n\r\nAssessment of trainees against the QTS standards will be overseen by the Training Manager, who will be supported by quality assurance through the External Moderator. \r\n\r\nJudgement and moderation will take place in late June of the training year. The External Moderator will attend Leventhorpe and visit some Trainees in their placement schools to observe the teaching of the standardisation sample of trainees.\r\n\r\nTrainees must meet the Teacher Standards at a minimum expectation. There will be a number of sources of evidence used to assess Trainees against the Teacher Standards. These will be: Trainee Evidence Folder, lesson observation records and accompanying Professional Learning Conversations ,the academic assignments and school placement assessments (completed each term by the Teacher Mentor and Professional Tutor), as well as the Subject Mentor and Professional Studies Assessments.\r\n\r\n\r\nIf you would like any further details or information, we would be very happy to hear from you. Please contact Liz Smith  on 01279 603104\r\n","interviewProcess":"We have a rigorous recruitment and selection process. Candidates will be interviewed by the SCITT Training Manager and a Headteacher for Primary, and Subject Lead for secondary. \r\n\r\nAs part of our interview process, candidates will be required to:\r\n- Present on an engaging aspect of their subject for 20 minutes.\r\n- Attend a panel interview with the Training Manager and Primary Headteacher or Subject lead.\r\n- Complete both a written literacy and numeracy task.\r\n- Take part in a student panel. \r\n\r\nCandidates who are choosing to undertake Teacher Training in a subject different to their degree course, may be asked to complete a subject knowledge test. \r\n\r\nCandidates will be informed of the outcome of their interview on the same day.\r\n","howSchoolPlacementsWork":"The BSET SCITT Partnership currently comprises seven secondary school and three primary schools. In addition, we also work with a number of placement schools. All of these schools at present are within the Sawbridgeworth- Bishop’s Stortford region. Our aim is to spot and nurture the outstanding teachers of the future, giving them the best possible training and support in their early career.  Our training is led exclusively by serving practitioners in our family of schools and training takes place entirely in school settings. Trainees will spend both their placements in local schools, where they will be supported by Teacher Mentors in each school.\r\n\r\nFee-paying trainees spend one term in their first placement school and two terms in their second school. We will always try to accommodate trainees’ preferences when making decisions about placement schools.\r\n\r\nSalaried trainees are employed by their main placement school, and undertake a short 6 week placement at a second school in the Spring term.\r\n\r\nTrainees must gain experience in two consecutive age ranges. This depends on the age range applicable to the subject in which you are training to teach. For those subjects in the secondary age range 11-16, trainees will teach across Key Stages 3 and 4, Year 7-11. We also aim to offer all trainees the opportunity to observe and teach in the Sixth Form.\r\n\r\nFor those subjects in the secondary age range 14-19, trainees will teach across Key stages 4 and 5, Years 10-13). In addition, trainees may be given the opportunity to teach outside of the age ranges for which they are being trained.\r\n\r\n","personalQualities":"We wish to recruit people from a diverse array of backgrounds and experiences, whether you are straight out of university or a career changer. \r\n\r\nA genuine enjoyment of working with young people and a keen interest in making a difference to their life chances is essential. ","otherRequirements":"At BSET safeguarding of children is our first concern and so in addition to DBS checks we reserve the right to make additional checks of former employers. \r\n\r\nWe do not make school experience a condition for application but it is a good idea if you have a good understanding of the school setting and knowledge of curriculum.\r\n\r\nExperience of working in a school or with young people is an advantage but not essential. \r\n","status":1,"createdAt":"2021-07-06T10:50:36.655Z","updatedAt":"2021-09-16T14:15:11.300Z","canSponsorStudentVisa":"no","cycle":"2024"}
