{"id":"8d7db2e4-da62-4424-b9e9-d6aa60ee095e","name":"Primary","code":"38XJ","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"24c23f44-5460-4b94-84ef-91d96341d5e3","name":"Main Site - Uplands Primary School and Nursery","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"7d419a51-28e0-47f8-b0a2-462179e2370b","code":"1HW","name":"Forest Learning Alliance"},"accreditedBody":{"id":"6439adcc-af64-4d3d-a1da-de045755db06","code":"R12","name":"The University of Reading"},"profPost":"PG","english":"2","maths":"2","science":"2","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":null,"aboutCourse":"School Direct (salaried) is an employment-based route for high quality graduates, typically with at least three years’ experience of transferable work history. You’ll earn a salary while you train towards your Qualified Teacher Status (QTS) recommendation, and won’t need to pay any tuition fees. This route is run by individual schools or a group of schools. \r\n\r\nStudents who opt for a School Direct (salaried) training programme are employed as an unqualified teacher while they learn on the job. In some cases, this may be a school the student is already working at or has an existing relationship with.\r\n\r\nThis course leads to QTS with the addition of the PGCE qualification. Where this is an option, there may be an additional cost required for completion of the PGCE.\r\n\r\nIf you decide to apply for a School Direct (salaried) training programme, one of your references must be from an employer. If you’re self-employed and unable to provide a reference from a former employer, your referee should be someone who knows you from work, who can comment on your work and suitability for teaching.","interviewProcess":" Successful applicants will be offered an interview at one of our  schools where they will:\r\n- be interviewed by a Headteacher and a school representative\r\n- be observed working with a group of children\r\n- complete an oral presentation on a topic of their choice\r\n\r\nFollowing success at interview, a School Direct placement will be offered within one of our partner schools. The interview process may be different due to Covid restrictions and this will be advised prior to interview. ","howSchoolPlacementsWork":"All School Direct trainee teachers will be spend the majority of their training in one school with regular  sessions, either at the Lead School Uplands Primary, one of the partnership schools or at the University of Reading. The individual placement schools have taken responsibility for deciding individual trainees teaching commitment but the partnership agreement in place ensures that all trainee teachers gain the same range of experience, whatever the school.\r\n\r\nIn addition to their main placement school all trainee teachers will undertake a second placement in the spring term for five weeks.\r\nAll trainee teachers will gain experience across a range of key stages and contexts and this experience will be tailored to meet the needs of individual trainee teachers to ensure that all gain the range of expertise needed to become an effective professional. ","personalQualities":"Applicants:\r\n- can demonstrate and promote positive values, attitudes and behaviour\r\n- are aware of their professional responsibilities\r\n- can work with others to promote the learning and welfare of young people\r\n- can adopt a reflective and critical stance towards their own practice, policy initiatives and listen to and act upon advice\r\n- can take responsibility for their own professional development","otherRequirements":"","status":2,"createdAt":"2021-07-12T13:49:26.348Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"You’ll be paid and taxed as an unqualified teacher. The salary awarded will differ between schools; you should check the salary with the school before you apply for either salaried routes.\r\n\r\nYou will be liable for your tuition fees plus the additional cost of £1500 for the PGCE part of this qualification. "}
