{"id":"fe98bca7-9d07-4a21-91ad-fec8eee6d2bb","name":"Primary","code":"2NWH","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"24c23f44-5460-4b94-84ef-91d96341d5e3","name":"Main Site - Uplands Primary School and Nursery","isPublished":"N","status":"S","vacancies":"F"},{"id":"d9be5ead-4098-4105-b9b2-cf125676aad0","name":"The Charvil Piggott Primary School","isPublished":"Y","status":"R"},{"id":"eae5c2bb-e95c-415f-9d7f-d7e5fd152de9","name":"Crown Wood Primary School","isPublished":"N","status":"S","vacancies":"F"}],"trainingProvider":{"id":"7d419a51-28e0-47f8-b0a2-462179e2370b","code":"1HW","name":"Forest Learning Alliance"},"accreditedBody":{"id":"6439adcc-af64-4d3d-a1da-de045755db06","code":"R12","name":"The University of Reading"},"degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":null,"aboutCourse":"School Direct (salaried) is an employment-based route for high quality graduates, typically with at least three years’ experience of transferable work history. You’ll earn a salary while you train towards your Qualified Teacher Status (QTS) but will be liable for the course fees.  We work closely with University of Reading's Institute of Education, an established provider of high-quality training and research (currently ranked 10th in the UK for Education on the Guardian University League table), \r\n\r\nApplicants for this course are required to have secured a relationship with a school who is willing to financially support them through their training before applying. \r\n\r\nTrainees following this route are employed as an unqualified teacher. If you decide to apply, one of your references must be from an employer. If you’re self-employed and unable to provide a reference from a former employer, your referee should be someone who knows you from work, who can comment on your work and suitability for teaching.","interviewProcess":"Successful applicants will be offered an interview at one of our schools where they will:\r\n\r\n- be interviewed by a Headteacher and a school representative\r\n- be observed working with a group of children\r\n- complete an oral presentation on a topic of their choice\r\n\r\nFollowing success at interview, a School Direct placement will be offered within one of our partner schools.\r\n\r\nCovid restrictions may have an impact on this process and you will be advised of any changes prior to interview. \r\n","howSchoolPlacementsWork":"All School Direct trainee teachers will spend most of their training in one school with regular sessions, either at the Lead School, Uplands Primary, one of the partnership schools or at the University of Reading. The individual placement schools take responsibility for deciding individual trainees teaching commitment but the partnership agreement in place ensures that all trainee teachers gain the same range of experience, whatever the school.\r\n\r\nIn addition to their main placement school all trainee teachers will undertake a second placement in the spring term for five weeks.\r\nAll trainee teachers will gain experience across a range of key stages and contexts and this experience will be tailored to meet the needs of individual trainee teachers to ensure that all gain the range of expertise needed to become an effective professional. ","personalQualities":"Applicants:\r\n- demonstrate and promote positive values, attitudes, and behaviour\r\n- are aware of their professional responsibilities\r\n- can work with others to promote the learning and welfare of young people\r\n- can adopt a reflective and critical stance towards their own practice, policy initiatives and listen to and act upon advice\r\n- take responsibility for their own professional development","otherRequirements":"","status":1,"createdAt":"2021-07-12T13:49:26.278Z","updatedAt":"2021-10-18T11:24:19.451Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"You will be paid and taxed as an unqualified teacher. The salary awarded will differ between schools; you should check the salary with the school before you apply for the salaried route. \r\n\r\nYou are responsible for full payment of your tuition fees. \r\n"}
