{"id":"a1bb2216-64f0-4dc9-81c9-56aa4b2d80be","name":"Primary","code":"35JQ","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"676f0702-2569-4962-8a32-fe7833e67488","name":"Reid Street Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"3de0cc91-87db-40a8-83b9-41b1e4b46c7c","name":"Skerne Park Primary","isPublished":"Y","status":"R","vacancies":"F"},{"id":"de227076-0477-472e-a86e-654a73720df9","name":"Wynard Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"1d4fba18-53a8-4a74-a741-df9a91448bbb","name":"West Park Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"08e38f75-0476-400e-8926-55cd8508e2c4","name":"Red Hall Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"23c08ed7-04ed-4838-a188-f22c241236f5","name":"George Dent Nursery School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"d0349a91-c6c2-4c47-91ba-86519d6195af","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"4fac9429-c2af-4bc2-b871-245febfa809b","code":"1DB","name":"Darlington West Park Partnership"},"accreditedBody":{"id":"926804ac-be7a-4f0a-97f9-a26a5f5f032a","code":"S84","name":"University of Sunderland"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feeDetails":"https://www.sunderland.ac.uk/study/education/pgce-school-direct/","aboutCourse":"PGCE School Direct is a school led course where your colleagues in school will develop your training programme supported by the University of Sunderland. \r\n\r\nWest Park  Partnership is a commitment to ensuring that all learners within our partnership schools and wider partners have access to bespoke learning pathways enabling them to succeed. This ethos applies to our children and young people as well as out trainees, teachers and support staff as learners. We work closely with the University of Sunderland, the partnership schools and our own strategic partners to provide continuity of experiences to ensure judgements and training reaches the required standards. \r\n\r\nTraining as a PGCE School Direct student ensures that you will be in your host school from your first day of the school year and will have the opportunity to spend the year being part of an accomplished and experienced school staff team working within the wider curriculum. You will complete an additional placement in the spring term in one of our contrasting partner schools. \r\n\r\nYou will study at the University of Sunderland for around fifteen days during your full training year. The University will provide support with your education assignments and practice based research led by a Primary programme leader who has a clear understanding of the importance of school led training and how best to guide you through your learning journey. The expertise of staff within the University will complement the support and skills of school based colleagues throughout your training year, with School Liaison Tutors supporting your host school to ensure that you receive high quality training in a supportive learning environment. University academic staff will ensure that you have access to expert training for academic writing and enquiry at Master's Level. \r\n\r\nIn this case West Park Academy (W) is the lead school for the partnership and as a Lead School we help to advertise School Direct vacancies for our host schools. The Darlington primary schools in the partnership are West Park Primary School (W), Red Hall Primary (R) Reid Street Primary (S), Skerne Park Primary (K) and George Dent Nursery School (G). \r\n\r\nYou will pay a tuition fee for your course and you  may be eligible to apply for tax-free government scholarships on offer.\r\n\r\nIf you would like to make any further enquiries please do not hesitate to contact: Emma Farrow e.farrow@westparkacademy.org.uk  (Lead School Mentor) \r\n\r\n","interviewProcess":"If your application is successful, you will be asked to attend an interview  at a school within the Training Partnership where your course will be running from. Each school can choose what they require from you at interview to demonstrate your understanding and practice, this may include: giving a brief presentation on a topic chosen by the school, reading a story to young children, teaching a short episode to a designated class, leading a discussion with young adults or even being interviewed by the School Council. Every interview will finish with a formal interview, where the school and University will explore your motivation for wanting to enter the teaching profession and your understanding of the role and responsibilities of teachers. \r\n\r\nThe interview is a chance for you to show your personality and motivation behind your decision to teach, and what knowledge and transferable skills you will bring with you to your training.\r\n","howSchoolPlacementsWork":"All the schools in our partnership are primary schools. The Darlington primary schools in the partnership are West Park Primary School (W), Red Hall Primary (R) Reid Street Primary (S), Skerne Park Primary (K) and George Dent Nursery School (G). \r\n\r\nYou will select to specialise in an age range , either 3-7 or 7-11 and the host school that you are applying for will be one of two placement schools where you will be placed throughout the year to develop this specialism.  \r\n\r\nThe school you are initially placed in is your host school where you will remain the majority of the year. You will complete an alternative placement in on of our partnership school for 1/2 a term. \r\n","personalQualities":"Trainees should be able to: \r\nDemonstrate a passion for working with children and inspiring learning.\r\nDevelop excellent professional relationships across the school community based on mutual respect. \r\nTake initiative in a range of school contexts and accept responsibility for accessing training opportunities in school. \r\nUse reflection and evaluation to adapt their teaching, drawing on a wide range of practical and creative strategies. \r\nExhibit passion and desire to become an outstanding teacher. \r\nWork effectively as a team member, bringing fresh ideas as well as acknowledging the importance of learning from more experienced colleagues. \r\n\r\n","otherRequirements":"An enhanced Disclosure and Barring Service (DBS) check\r\nA completed medical pro forma (based on DFEE Circular 8/92)\r\n","status":1,"createdAt":"2021-07-12T13:48:35.388Z","updatedAt":"2021-07-13T07:33:36.683Z","canSponsorStudentVisa":"yes","cycle":"2024"}
