{"id":"f6d8b3f6-426d-4208-9a78-ba0da2dc3bb1","name":"Primary","code":"35JR","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"3_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"1d4fba18-53a8-4a74-a741-df9a91448bbb","name":"West Park Academy","isPublished":"N","status":"N","vacancies":"F"},{"id":"de227076-0477-472e-a86e-654a73720df9","name":"Wynard Primary School","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"4fac9429-c2af-4bc2-b871-245febfa809b","code":"1DB","name":"Darlington West Park Partnership"},"accreditedBody":{"id":"926804ac-be7a-4f0a-97f9-a26a5f5f032a","code":"S84","name":"University of Sunderland"},"profPost":"BO","english":"1","maths":"1","science":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","aboutCourse":"This course will mostly be based in your host school, supported by time spent in a second school to develop teaching and allow you to experience a diverse range of teaching opportunities. You will be supported by the University of Sunderland’s experienced trainers, as well as having a school-based subject and a generic trainer. Your school will be able to give you more information about the specific support that they will provide for you. \r\nYou will usually spend one full day a week at the University of Sunderland, plus induction days and review weeksIf you choose the more widely available tuition route you will pay a tuition fee for your course and you will be eligible to apply for the many generous, tax-free government scholarships on offer.\r\nDepending on the route you take, assessments will be a mix of written assignments, case studies and one to one assessments of your teaching practice. You will be taught via lectures, seminars, tutorials, project work and group work. You will be in University for an average of 15 days during the full training year; the University will provide support with your education assignments and practice based research. \r\n\r\nOn the School Direct route your work-based learning will be based in the school. You will have a School Mentor and a University Tutor who will assess your written work and your teaching practice. You will also have support from a University Mentor.\r\n\r\n\r\n\r\n","interviewProcess":"If your application is successful, you will be asked to attend an interview either at the University of Sunderland or at a school within the Training Alliance where your course will be running from. Each school can choose what they require from you at interview to demonstrate your understanding and practice, this may include: giving a brief presentation on a topic chosen by the school, reading a story to young children, teaching a short episode to a designated class, leading a discussion with young adults or even being interviewed by the School Council. Every interview will finish with a formal interview, where the school and University will explore your motivation for wanting to enter the teaching profession and your understanding of the role and responsibilities of teachers. The interview is a chance for you to show your personality and motivation behind your decision to teach, and what knowledge and transferable skills you will bring with you to your training.\r\n","howSchoolPlacementsWork":"All the schools in our partnership are primary schools. The Darlington primary schools in the partnership are West Park Primary School (W), Red Hall Primary (R) Reid Street Primary (S) and George Dent Nursery School (G). In Sunderland we have St Mary's RC Primary (M).\r\nYou will select to specialise in an age range , either 3-7 or 7-11 and the host school that you are applying for will be one of two placement schools where you will be placed throughout the year to develop this specialism.  \r\n","personalQualities":"Trainees should be able to: \r\nDemonstrate a passion for working with children and inspiring learning.\r\nDevelop excellent professional relationships across the school community based on mutual respect. \r\nTake initiative in a range of school contexts and accept responsibility for accessing training opportunities in school. \r\nUse reflection and evaluation to adapt their teaching, drawing on a wide range of practical and creative strategies. \r\nExhibit passion and desire to become an outstanding teacher. \r\nWork effectively as a team member, bringing fresh ideas as well as acknowledging the importance of learning from more experienced colleagues. \r\n\r\n","otherRequirements":"An enhanced Disclosure and Barring Service (DBS) check\r\nA completed medical pro forma (based on DFEE Circular 8/92)\r\n","status":2,"createdAt":"2021-07-06T10:50:09.602Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"Unqualified teacher pay scale"}
