{"id":"315a5a75-f080-4766-a248-a0bd22a94a8e","name":"Primary","code":"S430","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"P","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"7886c3ee-796c-4501-9b4b-d593f7dcf28a","name":"Lord Scudamore Academy","isPublished":"Y","status":"R","vacancies":"P"},{"id":"735acdca-7682-414a-bf71-d7d446ff6c8e","name":"Main Site","isPublished":"Y","status":"R","vacancies":"P"}],"trainingProvider":{"id":"68c91306-4e8f-42ca-8fc7-cbba1f5b1676","code":"19N","name":"Lord Scudamore Primary Academy"},"accreditedBody":{"id":"6019b3ce-f2f6-4b0e-b2a9-5813d74c4d54","code":"W80","name":"University of Worcester"},"profPost":"PG","degreeGrade":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":13700,"aboutCourse":"\r\n\r\n\r\nThe School Direct PCGE offers an immersive and inspiring school centered route into teaching.  This pathway is tailored to your needs, building upon your existing strengths and expertise.  The course is inclusive and innovative in its design and delivery, placing you at the heart of a thriving school community from day 1.  You will need to attend the University of Worcester for approximately 30days over the year and you will have experience teaching in 2 of our partnership schools\r\nQualification PGCE award: Students achieving 60 credits at Masters level and meeting the requirements for QTS will be awarded Postgraduate Certificate in Education with QTS. \r\n \r\nBenefits\r\n*Support throughout the year from outstanding practitioners\r\n*you will experience mentoring and coaching to enhance your own teaching skills\r\n*High employment success.\r\n*University of Worcester work closely with us to ensure your training is seamless for the year.\r\n*Working in a variety of schools\r\n*A guarantee of a job interview at the end of the year if a post is vacant at that time.\r\n\r\nRoutes Offered: School Direct - Primary 3-7 years.\r\n \r\nThe School Direct Teacher Training Programme allows schools to recruit and train their own teachers. The course lasts for 1 year and is full time.  \r\n\r\n\r\n\r\nFor Further Information  please contact HMFA  School Direct on:\r\nhttps://lordscudamore.hmfa.org.uk/ ","interviewProcess":" Initial Interview will take place at Worcester University where a written test will take place.\r\nThere will be an  informal Interview at Lord Scudamore Academy and an activity that will be observed and  arranged with a pupil group. Also there will be chance to view the Academy and to discuss further placements that may occur within the Hereford Marches Federation of Academies (HMFA) \r\nDuring the interview, you will be given the opportunity to discuss your experiences to date, including opportunities  you have had to work with school-aged children and any transferable skills you can offer. We will let candidates  know on the same day if successful.  Successful applicants will require DBS clearance and suitable references.   ","howSchoolPlacementsWork":"There will be 3 placements and these will  be across the Federation at any one of our satellite schools. ","personalQualities":"Strong passion for teaching, good communication skills, diligent and resilient.  ","otherRequirements":"DBS would be requirement upon course acceptance. \r\n\r\nWe can sponsor Student Visas, but this is not guaranteed.\r\nYou do not need a visa if you already have settled or pre-settled status under the EU Settlement Scheme, or if you're an Irish Citizen\r\n\r\nCandidates with qualifications from non-UK institutions may need provide evidence of comparability for a UK ENIC statement","status":1,"createdAt":"2021-10-18T12:12:43.983Z","updatedAt":"2021-10-18T12:40:09.250Z","canSponsorStudentVisa":"yes","cycle":"2024"}
