{"id":"1d63b8c5-991a-4f94-a524-7f122005c42a","name":"Biology","code":"3D4J","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"322cfc19-d51d-45db-91e3-bd7b4738470f","code":"C1","name":"Biology"}],"locations":[{"id":"6938b482-8f5e-4711-b8e0-726308e47fa3","name":"Chorlton High School South","isPublished":"Y","status":"R","vacancies":"F"},{"id":"4bc85eb1-31cb-4dc0-9d0c-805eefcca773","name":"MEA Central","isPublished":"Y","status":"R","vacancies":"F"},{"id":"555e9777-cfef-4e34-b65b-80b7baf0b317","name":"Chorlton High School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"50331c35-0f1d-4157-9e61-c1ac2539ee58","name":"Manchester Enterprise Academy","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"f23a9c8a-3433-4016-8a60-2a33971ddbb5","code":"1JR","name":"Manchester Trusts and Schools Alliance"},"accreditedBody":{"id":"812b70c4-7fc4-46fc-975b-3e4d00f77dc4","code":"M40","name":"The Manchester Metropolitan University"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"The Science Departments at our partnership schools are outstanding, and an excellent base to begin your training and teaching career. There is a mix of recently qualified and extremely experienced staff within the department, with specialisms in Chemistry, Biology and Physics. The subject mentors for Biology are outstanding practitioners.\r\n\r\nHow will the course be assessed?\r\nAssociate Teachers currently have three assignments to complete, along with several shorter ‘reflection points’. In addition to this, when you are on teaching placements, you will need to complete planning, evaluations, marking and self-assessment against the teaching standards. These will be monitored and/or assessed by your mentor and University link tutor.\r\n\r\nYour teaching will also be observed weekly by your school-based mentor. During each placement you will also have at least one joint observation with your professional mentor and one joint observation with your University link tutor. These are the people who will be available to support and mentor you throughout your training.\r\n\r\nCan I refresh my subject knowledge?\r\nNot everyone feels confident in teaching every subject from the outset, for example, your degree might not be in your chosen subject but is closely related. As an Associate Teacher, you should identify parts of your subject knowledge you need to refresh or deepen. Subject Knowledge Enhancement (SKE) courses are available, with a bursary, for English, Maths, Physics, Languages, Chemistry, Computing, Biology, Geography and Design and Technology. Your training sessions at School and University will also assist here, but you are also expected to fill in gaps in your subject knowledge autonomously in order to be confident and competent in teaching accurately. \r\n\r\nWhat proportion of time is spent in school and at University?\r\nAcross the training year, Associate Teachers spend 28 days in University, for subject knowledge and assignment support. 18 days on school-based training and have 120 days teaching experience in two contrasting schools.\r\n\r\nHow do I become a qualified teacher?\r\nThe award of Qualified Teacher Status (QTS) is given based on how well you have met each of the Teacher Standards. Evidence gathered to substantiate each of the standards comes from all assignments, teaching files, reflections and observations completed during your training. A PGCE is awarded from Manchester Metropolitan University.","interviewProcess":"Applicants are interviewed by MTSA, this will include a member of the training team and a subject specialist. The interview for secondary admission has three elements consisting of a teaching task, a written task, and a panel interview.  ","howSchoolPlacementsWork":"Where will I be placed for secondary training?\r\nMTSA does their best to place Associate Teachers in Chorlton High School, as the lead secondary school in the alliance, and another contrasting placement. Chorlton High School is a designated Teaching School, recognised for the training it provides at all levels, which has recently opened a free school, CHS South. Contrasting placements are provided from schools across Manchester, that CHS works closely with for initial teacher training. For example, Manchester Enterprise Academy, MEA Central, The Manchester Grammar School, The Kingsway School, Fallibroome Academy, Cheadle Hulme High School  and Loreto 6th Form College. \r\n\r\nWhich year groups will I be placed in?\r\nAssociate Teachers complete placements in 11-16 schools. You will also have experience of KS2 transition, in a local primary school, and post 16 teaching. \r\n\r\nYou will then be qualified to teach the secondary age range. You will have your specialism but may offer to teach a second subject also. \r\n\r\n(http://www.chorltonhigh.manchester.sch.uk/)\r\n","personalQualities":"We are looking to recruit Associate Teachers who are dedicated to pursuing success for children across Manchester. Our placement schools are truly comprehensive and reflect the diverse makeup of the city. We want lifelong learners who will fulfil their potential in the classroom and in their professional development.\r\n\r\nOur current cohort and alumni have varied background experiences. Some have worked in a school before starting training, some come straight from university and others have been career-changers. We have applications from mature students, from those who have worked overseas, parents and applicants currently living or looking to relocate to south Manchester.\r\n","otherRequirements":"All applicants will need to have an Enhanced DBS check done, prior to working with young people. This will be completed through the Disclosure and Baring Service and MTSA.","status":1,"createdAt":"2021-07-06T10:49:29.097Z","updatedAt":"2021-07-20T10:56:34.775Z","canSponsorStudentVisa":"yes","cycle":"2024"}
