{"id":"5a004e6a-b12f-4043-b299-e84aa6d88754","name":"Primary","code":"3DBY","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"4_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"fe655962-f97b-4e41-a53d-4ab94baa919b","name":"Brookburn Primary Teaching School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"f23a9c8a-3433-4016-8a60-2a33971ddbb5","code":"1JR","name":"Manchester Trusts and Schools Alliance"},"accreditedBody":{"id":"812b70c4-7fc4-46fc-975b-3e4d00f77dc4","code":"M40","name":"The Manchester Metropolitan University"},"profPost":"BO","degreeGrade":"1","english":"2","maths":"2","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"What can the MTSA School Direct course offer you?\r\nAs an associate teacher you become part of our 'MTSA family', we offer bespoke high quality experiences, professional support and training.\r\nYou directly gain by having teaching placements across a network of schools with contrasting context, that also includes cross phase and a Special School.  High quality support from trained mentors will support you professionally and personally.  Professional study sessions are delivered by outstanding teachers and our Specialist Leaders of Education.  At the end of the course you will have both QTS and a PGCE with Masters level Credits and be supported in your NQT year. Also throughout the year are additional experiences not offered via the traditional PGCE route and are bespoke to you. e.g. first aid, communication with parents/carers, growth mindset training etc  We want you to be the best you can be!\r\n\r\nThe workload\r\nAssociate Teachers currently have 4 assignments to complete, along with several shorter ‘reflection points’. In addition to this, when you are on teaching placements, you will need to complete planning, evaluations, marking and self-assessment against the teaching standards. These will be monitored and/or assessed by your mentor.\r\n\r\nYour teaching will also be observed weekly by your school-based mentor. During each placement you will also have at least 1 joint observation with your professional mentor and 1 joint observation with your University link tutor. These are the people who will be available to support and mentor you through your training.\r\n\r\nCan I refresh my subject knowledge?\r\nAs a primary school teacher not everyone feels confident in teaching every subject from the outset. As an Associate Teacher, you can identify parts of your subject knowledge that you need to refresh or deepen. Your training sessions at school and University will assist here, but you are expected to fill in gaps in your subject knowledge autonomously in order to be confident and competent in teaching accurately.\r\n\r\nWhat proportion of my time is spent in school and at University?\r\nAssociate Teachers spend 29 days in University, 18 days on school-based training and have 120 days teaching experience.\r\n\r\nHow do I become a qualified teacher?\r\nThe award of Qualified Teacher Status (QTS) is given based on how well you have met each of the teaching standards. Evidence gathered to substantiate each of the standards comes from all assessments, assignments and observations completed during your training.\r\n","interviewProcess":"Trainees are interviewed by MTSA.  The Headteachers take a keen interest in our School Direct associate teachers and two of them will sit on the interview panel. The interview has 4 elements consisting of a teaching task, a written reflection task, a Maths task  and a panel interview.  \r\n","howSchoolPlacementsWork":"Where will I be placed for primary training?\r\nMTSA places Associate Teachers in a network of primary schools across our alliance. These include Brookburn, Chorlton Park, Beaver Rd, Manley Park, Barlow Hall, St John's RC, St Mary's RC, Old Moat Primary and Chorlton CE. All these schools are located in or around Chorlton in South Manchester and have achieved good or outstanding Ofsted ratings.\r\n\r\nWhich year groups will I be placed in?\r\nAssociate Teachers complete placements in both Key Stage 1 (Years 1-2) and Key Stage 2 (Years 3-6). There is also an option to specialise in Early Years in this case Associate Teachers complete placements in both Early Years and KS1. These are the placements where you will be assessed.  You will also complete a short placement (2/3 days) in Key Stage 3 (Years 7-11) and 1 week in Early Years Foundation Stage (Nursery and Reception). These placements are for experience only and are not assessed.  For those specialising in Early Years a week's placement in KS2 will be completed.\r\n\r\nYou will then be qualified for the specified primary age range. \r\n\r\n","personalQualities":"We wish to recruit Associate Teachers who are dedicated to pursuing success for children across Manchester. Our Associate Teachers are lifelong learners who want to fulfil their potential both in the classroom and in their professional development.\r\n\r\nOur current trainees have varied backgrounds. Some were employed as Teaching Assistants within a school before coming to train, others came straight from university, and others were career-changers who had worked in another field before training to teach. We had applications from mature students, from those who had worked overseas, parents with families and from candidates who were relocating to the Manchester area","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:49:29.823Z","updatedAt":"2021-09-10T12:02:06.836Z","canSponsorStudentVisa":"yes","cycle":"2024"}
