{"id":"03d89563-afa7-45a7-a603-630435f3d76b","name":"English","code":"Q3X1","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3aed1aa8-ae46-4b68-92bb-a6cc20655c59","code":"Q3","name":"English"}],"locations":[{"id":"bc83fc4c-85b9-42cd-9e7b-632e5dfa2933","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"ec9b83ed-1f6f-46b5-b172-44e52d93b21a","code":"N84","name":"The University of Nottingham"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We are able to offer an equivalency test to University of Nottingham PGCE offer holders only.  \n\nYou are only able to take the equivalency test once.  \n\nThere is no charge to take the test.\n\nWe do not accept any other equivalency tests.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"The PGCE course is a one-year full-time programme.  When at university you will be part of two learning cohorts, your subject group and a Schools and Society group. In subject studies you will explore: the principles which underlie the teaching of your particular subject; varied and detailed approaches for effective teaching and learning; how educational theory illuminates subject teaching. In Schools and Society studies you will explore the wider issues of becoming a teacher such as child protection, special educational needs, inclusivity etc.\r\n\r\nYou will spend at least two thirds of your time working in schools, and the remaining time in University.  The course starts with a two-week introduction to the course, including two days spent in your first placement school.\r\n\r\nFirst Placement\r\n\r\nFrom week three of the course you will spend most of your time in your first placement with regular days returning to the University to reflect on, and develop, your practice.\r\n\r\nYou return to the University either side of your Christmas break to work with your peers, reflecting on your experiences in school and preparing for your next teaching placement.\r\n\r\nSecond Placement\r\n\r\nDuring this placement you will become part of the school community and work professionally as a member of a team. Following an induction in school, you gradually build up your teaching across the age and attainment range. By week 3, you will be teaching approximately two-thirds of a teacher’s timetable.\r\n\r\nYou will return for several University-based days that focus on a range of professional development issues and allow for contact with peers and tutors.\r\n\r\nAssessment\r\n\r\nThe PGCE course is a Masters level course incorporating two 30-credit modules entitled 'Schools and Society' and 'Learning and Teaching'. \r\n \r\nFor the award of the PGCE and to achieve Teacher Standards, you must have reached the required standard in both the theory and practice elements of the course. In keeping with the nature of the course, which is vocational and postgraduate in approach, there are no written examinations.\r\n \r\nPractical Teaching is assessed by University tutors, school-based mentors and coordinators, and External Examiners.  Account is taken of your work over all school-based elements of the course and your own written records of such work.\r\n\r\nOn the course, you are required to submit various pieces of work related to your subject and Schools and Society programmes.  The assignments may be written pieces or presentations and may include collaborative work.\r\n","interviewProcess":"We endeavour to make our interview process as stress-free as possible to enable you to get the most from the experience.  When you come for interview, there are likely to be other applicants being interviewed alongside you. You will not be in competition with the other applicants – in fact, we are keen to see that you can work collaboratively with others. \r\n\r\nThe criteria we will use for selection at interview are:\r\n\r\n* an awareness of current educational issues\r\n* a realistic and positive view of schools and schooling\r\n* an open and enquiring mind\r\n* clear reasons for wanting to teach\r\n* motivation and commitment to teaching all pupils \r\n* maturity and self confidence\r\n* an appropriate level of subject knowledge in your subject\r\n\r\n","howSchoolPlacementsWork":"The School of Education has a strong and well-established partnership of approximately 100 secondary schools.  Our partner schools are mainly situated in Nottingham City, Nottinghamshire, Derby City, Derbyshire and Lincolnshire. There are also partner schools in Leicestershire and Staffordshire.  Our Partnership Committee, and working groups for each subject, work with School of Education staff in planning, developing and monitoring our courses.  All our school based mentors and coordinators attend mentor development sessions throughout the academic year.\r\n\r\nYou will undertake two extended placements in at least two schools, enabling you to gain a broad experience of different educational settings.  The course starts in early September and finishes at the end of June/early July. In week one of the course you will begin your first school placement, where you will be based for the autumn term. From January to June your main teaching practice will be in a different, contrasting setting.\r\n\r\nWhen deciding placements we take account of the needs of individual students such as parental/caring commitments, prior experience and home location. You can be assured that the tutors do consider the placements very carefully and your existing skill set may be considered in relation to the tutors’ knowledge of schools’ specialisms and developments. Travel times vary from placement to placement but we aim to keep any commute to within an hour.\r\n\r\nIn the summer term there is an opportunity for you to undertake a placement in an alternative educational setting i.e. sixth form college, special needs school, to further broaden your experiences.\r\n","personalQualities":"During the recruitment process, we will be focussing on your potential to be a great teacher.  The qualities we look for in applicants are:\r\n\r\n* a desire to teach and work with young people from all backgrounds\r\n* effective communication skills\r\n* a commitment to work hard on the course: Teaching is a job where you can really make a difference to young people's lives\r\n*determination to succeed: Success rates on the Nottingham PGCE course are high.  It isn't because the course is easy!  \r\n* a readiness to listen and share\r\n* a flexible approach to learning and teaching\r\n","otherRequirements":"Admission to the course is subject to a satisfactory medical report, as you are required to meet the standards for 'Fitness to Teach'.  It is important that you disclose any medical condition or disability so that we can look at the best way of supporting you if you are offered a place on the course.\r\n\r\nYou will be subject to safeguarding checks which include an enhanced DBS check.\r\n\r\nBefore a recommendation for Qualified Teacher Status can be made we will need to be assured of your proficiency in English and mathematics.  \r\n","status":1,"createdAt":"2021-07-06T10:56:30.592Z","updatedAt":"2021-10-03T19:52:46.355Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
