{"id":"92d9f5aa-8cec-4670-951f-41b7d94dab10","name":"Primary","code":"32HV","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"bc83fc4c-85b9-42cd-9e7b-632e5dfa2933","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"ec9b83ed-1f6f-46b5-b172-44e52d93b21a","code":"N84","name":"The University of Nottingham"},"profPost":"PG","degreeGrade":"9","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We are able to offer an equivalency test to University of Nottingham PGCE offer holders only.  \n\nYou are only able to take the equivalency test once.  \n\nThere is no charge to take the test.\n\nWe do not accept any other equivalency tests.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"The PGCE primary course is a one-year full-time programme.  It prepares you to teach in primary schools. You are supported and challenged to evaluate your experience against the government’s initial teacher training requirements and participate in activities throughout the year to develop new skills and knowledge.\r\n\r\nYou will spend at least two thirds of your time on the course working in schools, returning to the University for a number of days across the year.\r\n\r\nPrior to the course, you will undertake pre-course activities and reading. We expect you to keep up to date with educational debates and current issues in the media. It is also a very important time for you to develop your knowledge of the subjects in the primary curriculum. \r\n\r\nCourse structure\r\n\r\nUniversity-based days\r\n\r\nAt University you are part of a vibrant cohort of beginning primary teachers. You will explore principles which underlie the teaching of the primary curriculum, varied and detailed approaches to teaching the curriculum and wider issues of becoming a teacher such as safeguarding and special educational needs.\r\n\r\nAssessment\r\n\r\nThe PGCE course is at a postgraduate Masters level. It offers you the opportunity to gain up to 60 credits at Masters level that can contribute towards a Masters level course. Assignments relate to two modules -  'Learning and Teaching in Schools' and ‘Issues in Primary Teaching.  One of the assignments is a school-based inquiry project.\r\n\r\nPractical teaching is assessed by the University tutors, school-based mentors and coordinators, and External Examiners.  Account is taken of your work over the course in a holistic way.\r\n\r\nYou are required to submit various pieces of work related to your course. These include written reflections, presentations and collaborative work.\r\n\r\nAll our Initial Teacher Training courses are highly rated locally and many of our students go on to work in partner schools each year. Ofsted judged our PGCE courses to be 'outstanding' in the last inspection.\r\n\r\nSome of the key strengths are: \r\n\r\n* University leaders who have an excellent track record of improving this already high-quality provision and demonstrate an outstanding capacity to develop and improve the quality of training and trainees' outcomes even further. \r\n \r\n* Their very strong integration of theory and practice, informed by the most up-to-date and relevant research, enabling trainees to gain an in-depth understanding of the latest developments in education and in their subject areas.\r\n \r\n* The shared vision and ethos, which permeates the partnership.\r\n","interviewProcess":"We look very closely at your application form. In particular, we are interested in your personal statement, your qualifications and your experience.\r\n\r\nOn the basis of our consideration of your application form, and the academic references that accompany it, we will decide whether to invite you for an interview.\r\n\r\nWhen you come for a PGCE interview, there are likely to be other applicants being interviewed alongside you. You will not be in competition with the other applicants – in fact, we are keen to see that you can work collaboratively with others. \r\n\r\nYou will be interviewed by PGCE tutors from the School of Education.  As part of the interview, you will be asked to carry out certain tasks that allow you to demonstrate your knowledge and skills, individually or in groups. The letter of invitation will give you details about specific requirements.\r\n\r\nWhat happens next?\r\n\r\nWe will inform you of our decision as soon as possible after your interview. If you receive an offer of a place on the PGCE course, ou will receive a link to our pre-course website containing information describing the steps you should take next. If your offer is a conditional offer, it will become unconditional when we have received your acceptance and all the necessary clearances and documentation.\r\n","howSchoolPlacementsWork":"First placement\r\n\r\nIn the autumn term you will spend most of your time in your first placement school, September through to December, with regular days returning to the University to reflect upon and develop your practice.\r\n\r\nDuring this placement you will undertake a variety of tasks and observations and will be gradually introduced to teaching. As the term progresses, you will take on more teaching commitments, working closely with your school-based mentor and your university tutor.\r\n\r\nSecond placement\r\n\r\nBeginning in February through to June with some University days.\r\nYou gradually build up your teaching commitments. This placement allows you to become part of the school community and to work professionally as a member of a team. \r\n\r\nDuring this placement you will negotiate and agree a personalised programme of work. The emphasis is on formulating, developing and reflecting on the insights derived from the experience of earlier placements; meeting the standards required for the Teachers’ Standards, and preparing for the induction year. \r\n\r\nWithin the school, your mentor and other teachers will be immediate sources of support and advice. Your University tutor will visit to observe lessons, discuss challenges and progress, and help with planning. \r\n\r\nDuring the second placement, you will return for several University-based days that focus on a wide range of professional development issues and provide contact with your peers and tutors.\r\n\r\nAs well as the two main placements, you will also spend a week in a Special Education setting and an Early Years’ setting.\r\n","personalQualities":"* A desire to teach and work with young people\r\n* Effective communication skills\r\n* A commitment to work hard on the course: Teaching is a job where you can really make a difference to young people's lives\r\n* Determination to succeed: Success rates on the Nottingham PGCE course are high.  It isn't because the course is easy!  It is because of the high calibre of the students on the course, the course itself and the teachers we work with.\r\n* A readiness to listen and share and work collaboratively\r\n* A flexible approach to learning and teaching\r\n","otherRequirements":"Admission to the course is subject to a satisfactory medical report, as you are required to meet the standards for 'Fitness to Teach'.  It is important that you disclose any medical condition or disability so that we can look at the best way of supporting you if you are offered a place on the course.\r\n\r\nYou will be subject to safeguarding checks which include an enhanced DBS check.\r\n\r\nBefore a recommendation for Qualified Teacher Status can be made we will need to be assured of your proficiency in English and mathematics.  \r\n\r\n","status":1,"createdAt":"2021-07-06T10:56:30.390Z","updatedAt":"2021-10-03T20:29:19.860Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
