{"id":"94891e31-a4dc-482f-93c8-c0ab4b20fb58","name":"Primary","code":"2YNY","qualification":"pgce_with_qts","startDate":"2023-07-31T23:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"767e1f54-b74b-45bd-85e0-8abf943953e1","name":"Richard Wakefield CofE (VC) Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"fdfdeb73-9950-4416-93c8-3bfe02103109","name":"Horninglow Primary: A de Ferrers Trust Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"79c79e5f-68f1-445b-ac1f-73b36bd81aa1","name":"Lansdowne: A de Ferrers Trust Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"6b8c2afb-59be-4191-ab05-5ed164698033","name":"Eton Park Junior: A de Ferrers Trust Academy","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"ec9b83ed-1f6f-46b5-b172-44e52d93b21a","code":"N84","name":"The University of Nottingham"},"profPost":"PG","degreeGrade":"9","english":"1","maths":"1","science":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We are able to offer an equivalency test to University of Nottingham School Direct PGCE offer holders only.\n\nYou are only able to take the equivalency test once.\n\nThere is no charge to take the test.\n\nWe do not accept any other equivalency tests.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Following an induction at the University, you will start at your placement school at the beginning of their academic year. This will involve observing lessons and familiarising yourself with school campuses, alongside policies and procedures. In mid-September you will spend a block of time at the University working as part of a cohort of beginning teachers preparing for the year ahead.\r\n\r\nFrom late September you will spend most of your time in your placement school with regular days returning to the University to further reflect on, and develop, your practice. During the first term you undertake a variety of tasks and observations and are gradually introduced to teaching your phase. You work closely with your school-based mentors and with your tutor who visits you in school.\r\n\r\nYou return to the University either side of your Christmas break. In this block of time you work with your peers, reflecting on your experiences in school and preparing for the next term.\r\n\r\nDuring the spring term you complete a placement in a second school that promotes collaborative learning and broadens your experience.\r\n\r\nDuring your placements post-Christmas you will return for several University-based days that focus on a wide range of professional development issues and allow for contact with peers and tutors.\r\n\r\nAs part of the programme you will undertake a school-based inquiry project where, working with others, you will formulate and develop a research project on an area of interest.","interviewProcess":"There is a two stage process for the School Direct course. \r\n\r\nThe University of Nottingham screens your application and decides whether to offer you an interview. Currently all of the interviews, at least for the foreseeable future will be online, the university will not be inviting people to the School of Education. \r\n\r\nWhen being interviewed at the University, there are likely to be other applicants being interviewed alongside you. They will be keen to see that you can work collaboratively with others. The criteria that will be used at interview to decide whether or not you are suitable for a place on the course are:\r\n\r\n- an awareness of current educational issues;\r\n- a realistic and positive view of schools and schooling;\r\n- an open and enquiring mind;\r\n- clear reasons for wanting to teach at the level for which you have applied;\r\n- motivation and commitment to teaching students of all levels of ability;\r\n- maturity and self confidence;\r\n \r\n\r\nIf you are successful at interview at The University of Nottingham, there will then be a school based interview. This will include:\r\n\r\n- professional discussion\r\n- a formal interview\r\n- a student panel\r\n- the opportunity to virtually tour the campus","howSchoolPlacementsWork":"Your main placement will be in your selected school. You will start at your placement school at the beginning of their academic year. During your time on placement you will become part of your school's community and work professionally as a member of a team. University days are spread across the year.\r\n\r\nDuring the spring term you complete a five week placement in a second school that promotes collaborative learning and broadens your experience.\r\n\r\nYou will experience teaching students from age 5 to 11 during your placements.\r\n","personalQualities":"A desire to teach and work with young people\r\n\r\nEffective communication skills\r\n\r\nDetermination to succeed\r\n\r\nA readiness to listen and share\r\n\r\nA flexible approach to learning and teaching","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:49:11.089Z","updatedAt":"2021-10-04T17:10:01.423Z","canSponsorStudentVisa":"yes","cycle":"2024"}
