{"id":"0d497496-a182-445e-85eb-9acb8f79c275","name":"History","code":"2WHJ","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"5a3609a0-5bbb-4377-b919-5d89932ab622","code":"V1","name":"History"}],"locations":[{"id":"e1f7825e-963d-4eb2-ba52-3f4f9007591d","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"64069a76-35a8-4a50-bceb-1168d8ca32a8","code":"16U","name":"Teach South West (WeST)"},"accreditedBody":{"id":"d41a1821-e35b-48eb-bf02-4842872b04a2","code":"E84","name":"University of Exeter"},"profPost":"BO","degreeGrade":"0","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"The usual entry requirement for this course is a 2:1 degree in History or a History Joint Honours degree. The course will also consider applications from those with degrees in related subjects such as Ancient History, Archaeology, International Relations or Politics.\n\nWe advise applicants to gain some school-based experience prior to application but this is not essential. \n\nPasses at GCSE in English and Mathematics at Grade C/4 or equivalent are required.\n\nRead more at https://www.exeter.ac.uk/teachertraining/secondary/history/#Dg1z3VlvT7RI2V51.99","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Passes at GCSE in English and Mathematics at Grade C/4 or equivalent are required. Read more at https://www.exeter.ac.uk/teachertraining/secondary/history/#Dg1z3VlvT7RI2V51.99\n\nTests offered by www.equivalencytesting.com (please contact the PGCE admissions team for further guidance before signing up for the equivalency test)","courseLength":"OneYear","feesUK":9250,"feesInternational":20000,"financialSupport":"For information on Government loans and training bursaries, please visit the [Student Finance England]( https://www.gov.uk/student-finance) and [Get into Teaching]( https://getintoteaching.education.gov.uk/) websites.\r\n\r\n\r\nFor more information, please see our [Fees and finance]( https://www.exeter.ac.uk/teachertraining/apply/feesandfinance/) webpages\r\n","aboutCourse":"The History PGCE course is concerned with theoretical and practical classroom approaches to the teaching of history. This involves examining a range of appropriate learning and teaching strategies through Key Stages 3-5 in the varied classroom situations you will encounter.  You will develop a rigorous understanding of when and where particular activities might be appropriate. The course is underpinned by the belief that history teaching is a stimulating, creative activity that gives pleasure to both teachers and pupils and educates young people to take a full and active role as citizens. The course draws heavily on current and recent research findings from both the Graduate School of Education and other researchers at the forefront of history education.\r\n\r\nTaught by a team of lecturers, active researchers and practicing classroom teachers from across the south west, the course relates theory to practice in all elements of the National Curriculum and 14-19 History.\r\n\r\nThe PGCE team’s current research interests lie in the areas of history and literacy, the impact that trainee teachers’ subject knowledge has on pupils’ learning in the classroom and how to personalise learning effectively.\r\n\r\nThe programme lasts for 39 weeks (one academic year). The course starts at the beginning of September students are inducted into TSW and spend one week in a primary school and one week in a secondary school and to carry out a variety of pre-course tasks. These include an initial needs analysis focussing on subject knowledge and a variety of reading tasks. The first term is predominately based at the University with an open-door policy to placement school one. The first placement then continues in January and lasts around 12 weeks. Induction into the second placement school takes place before the Easter vacation and then continues in the summer term until early July.\r\n\r\nRead more at https://www.exeter.ac.uk/teachertraining/secondary/history/#Dg1z3VlvT7RI2V51.99\r\nhttps://www.westst.org.uk/page/?title=Teach+South+West&pid=176","interviewProcess":"After successful application through DFE Apply a candidate will be invited to be part of an online interview process which will involve formal interviews and a presentation/teaching episode.  Due to Covid-19 restrictions, interviews are being held remotely.\r\n\r\nWhat we are looking for:\r\n\r\n- A passion for teaching and for learning\r\n\r\n- A real love of their subject\r\n\r\n- An appreciation of the role of a teacher in a pupil's life\r\n\r\n- Adaptability\r\n\r\n- Stamina\r\n\r\n- A willingness to reflect\r\n\r\n- Great organisation\r\n\r\n- The ability to work collaboratively\r\n\r\n","howSchoolPlacementsWork":"We work with our candidates to secure placements that, wherever possible, meet their needs.  The earlier the application the more flexibility we have for placements.  \r\nWe partner with approximately 50 schools who are very supportive of the programme and keen to recruit our trainees into future posts.\r\nRead more at \r\nhttps://www.westst.org.uk/page/?title=Teach+South+West&pid=176\r\n\r\n","personalQualities":"- A passion for teaching and for learning\r\n\r\n- A real love of their subject\r\n\r\n- An appreciation of the role of a teacher in a pupil's life\r\n\r\n- Adaptability\r\n\r\n- Stamina\r\n\r\n- A willingness to reflect\r\n\r\n- Great organisation\r\n\r\nTeach South West is committed to safeguarding and promoting the welfare of children and young people, and expect all staff, trainees and volunteers to share this commitment.\r\nAs such all personnel will undergo the following before being able to train/enter our Schools and Colleges;\r\n- DBS clearance enhanced check\r\n- Safeguarding training\r\n- Data Protection training","otherRequirements":"Most successful applicants have a 2:1 or above.  If however, you have a 2:2 or different academic background, equivalent to degree level, you are welcome to make an application through DFE Apply for consideration.\r\n\r\nIn addition to the academic requirements listed, successful selection based on DFE Apply  application, interview (online due to Covid-19 restrictions), Fitness to Teach assessment and DBS enhanced disclosure.\r\n \r\nNote:It is the University of Exeter's policy that level 2 certificate in Adult Literacy or Numeracy is not acceptable as an equivalent to GCSE English/Mathematics.\r\n","status":1,"createdAt":"2021-07-06T10:55:58.910Z","updatedAt":"2021-10-04T13:14:58.336Z","canSponsorStudentVisa":"yes","cycle":"2024"}
