{"id":"5ea7e175-288f-42f8-9d05-c7f0e2ad1723","name":"English","code":"23QH","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3aed1aa8-ae46-4b68-92bb-a6cc20655c59","code":"Q3","name":"English"}],"locations":[{"id":"fa52e0c4-ea20-410f-b368-aa8907937730","name":"Ivybridge Community College","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"64069a76-35a8-4a50-bceb-1168d8ca32a8","code":"16U","name":"Teach South West (WeST)"},"accreditedBody":{"id":"d41a1821-e35b-48eb-bf02-4842872b04a2","code":"E84","name":"University of Exeter"},"profPost":"BO","degreeGrade":"0","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Most successful applicants have 2:1 degrees in English (Literature or Language), Linguistics, Drama, Cultural/Media Studies, Film or Journalism. \n\nFor Drama, Media Studies, Film and Journalism, we also require a good A level English grade (or equivalent). Combined-honours degrees are welcome: here we look at the balance of English to other subject/s, also looking for high A level English grade if the English element is less than 50%.\n\nPasses at GCSE in English and Mathematics at Grade C/4 or equivalent are required.\n\nSuccessful applicants have a strong academic track record and will be able to demonstrate a passion for teaching English\n\nTests offered by www.equivalencytesting.com (please contact the PGCE admissions team for further guidance before signing up for the equivalency test)","courseLength":"OneYear","feesUK":9250,"feesInternational":20000,"financialSupport":"For information on Government loans and training bursaries, please visit the [Student Finance England]( https://www.gov.uk/student-finance) and [Get into Teaching]( https://getintoteaching.education.gov.uk/) websites.\r\n\r\n\r\nFor more information, please see our [Fees and finance]( https://www.exeter.ac.uk/teachertraining/apply/feesandfinance/) webpages\r\n","aboutCourse":"The PGCE English course has a national reputation for excellence, and its trainees are popular recruits to schools all over the country. It is run by tutors who are enthusiastic about English teaching and who relish the opportunity to work with the next generation of English teachers.\r\n\r\nThe course is active and participatory, placing considerable emphasis on working collaboratively with others and learning together. We expect you to take a high level of responsibility for your own professional learning and the course includes both taught seminars and workshops and directed or independent study activities which allow your professional learning to be tailored to your needs and interests. \r\n\r\nThe programme lasts for 39 weeks (one academic year). The course starts at the beginning of September students are inducted into TSW and spend one week in a primary school and one week in a secondary school and to carry out a variety of pre-course tasks. These include an initial needs analysis focussing on subject knowledge and a variety of reading tasks. The first term is predominately based at the University with an open-door policy to placement school one. The first placement then continues in January and lasts around 12 weeks. Induction into the second placement school takes place before the Easter vacation and then continues in the summer term until early July.\r\n\r\n\r\n\r\nRead more at https://www.exeter.ac.uk/teachertraining/secondary/english/#XzGTHFFT6FfljswM.99\r\nhttps://www.westst.org.uk/page/?title=Teach+South+West&pid=176","interviewProcess":"After successful application through DFE Apply a candidate will be invited to be part of an online interview process which will involve formal interviews and a presentation/teaching episode.  Due to Covid-19 restrictions, interviews are being held remotely.\r\n\r\nWhat we are looking for:\r\n\r\n- A passion for teaching and for learning\r\n\r\n- A real love of their subject\r\n\r\n- An appreciation of the role of a teacher in a pupil's life\r\n\r\n- Adaptability\r\n\r\n- Stamina\r\n\r\n- A willingness to reflect\r\n\r\n- Great organisation\r\n\r\n- The ability to work collaboratively\r\n\r\n","howSchoolPlacementsWork":"We work with our candidates to secure placements that, wherever possible, meet their needs.  The earlier the application the more flexibility we have for placements.  \r\nWe partner with approximately 50 schools who are very supportive of the programme and keen to recruit our trainees into future posts.\r\nRead more at https://www.westst.org.uk/page/?title=Teach+South+West&pid=176\r\n\r\n\r\n","personalQualities":"- A passion for teaching and for learning\r\n\r\n- A real love of their subject\r\n\r\n- An appreciation of the role of a teacher in a pupil's life\r\n\r\n- Adaptability\r\n\r\n- Stamina\r\n\r\n- A willingness to reflect\r\n\r\n- Great organisation\r\nTeach South West is committed to safeguarding and promoting the welfare of children and young people, and expect all staff, trainees and volunteers to share this commitment.\r\nAs such all personnel will undergo the following before being able to train/enter our Schools and Colleges;\r\n- DBS clearance enhanced check\r\n- Safeguarding training\r\n- Data Protection training","otherRequirements":"Most successful applicants have a 2:1 or above.  If however, you have a 2:2 or different academic background, equivalent to degree level, you are welcome to make an application through DFE Apply System for consideration.\r\n\r\nIn addition to the academic requirements listed, successful selection based on DFE Apply application, interview (online due to Covid-19 restrictions), Fitness to Teach assessment and DBS enhanced disclosure.\r\n \r\nAlthough not essential it would be advantageous to be able to reflect on any school-based experience or experience working with young people in another context at interview.","status":1,"createdAt":"2021-07-06T10:55:58.781Z","updatedAt":"2021-10-04T13:14:48.122Z","canSponsorStudentVisa":"yes","cycle":"2024"}
