{"id":"867647dd-dbf8-442b-b4b0-e60449d490be","name":"Modern Languages (French)","code":"2MLJ","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"9727f674-61ba-4efa-b1f2-21ec7e354442","code":"15","name":"French"},{"id":"ce8523ef-9236-4cd9-b260-d826c7a521b3","code":"ML","name":"Modern Languages"}],"locations":[{"id":"e1f7825e-963d-4eb2-ba52-3f4f9007591d","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"64069a76-35a8-4a50-bceb-1168d8ca32a8","code":"16U","name":"Teach South West (WeST)"},"accreditedBody":{"id":"d41a1821-e35b-48eb-bf02-4842872b04a2","code":"E84","name":"University of Exeter"},"profPost":"BO","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"Applicants will normally be expected to have a good Honours degree in French (minimum of a 2.2). Other qualifications of degree level equivalence will be considered, e.g. Final Diploma of Institute of Linguists. Native speakers of French should hold a qualification equivalent to a UK degree at a minimum of 2:2, usually a minimum of 3 years of study at an institution of Higher Education. The qualifications can be in any subject, since they have, by definition, the necessary language skills. \n\nPasses at GCSE in English and Mathematics at Grade C/4 or equivalent are required.\n\nRead more at https://www.exeter.ac.uk/teachertraining/secondary/mfl/french/#3QgXSRKwFUyuR1qG.99","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Tests offered by www.equivalencytesting.com (please contact the PGCE admissions team for further guidance before signing up for the equivalency test)","courseLength":"OneYear","feesUK":9250,"feesInternational":20000,"financialSupport":"For information on Government loans and training bursaries, please visit the [Student Finance England]( https://www.gov.uk/student-finance) and [Get into Teaching]( https://getintoteaching.education.gov.uk/) websites.\r\n\r\n\r\nFor more information, please see our [Fees and finance]( https://www.exeter.ac.uk/teachertraining/apply/feesandfinance/) webpages\r\n","aboutCourse":"The PGCE in Modern Foreign Languages (MFL) offers a course in French to graduates who are keen and eager both to bring to life within the 4 walls of the classroom the French language and the cultures of la francophonie which they themselves love and to nurture a life-long interest in language learning. The course enables you to explore the opportunities and challenges that face both teachers and learners of the French language in Britain today, the strategies for language acquisition and the need for intercultural understanding within the European dimension.\r\n\r\nThe University-based term offers the opportunity to engage with up-to-date research in languages education and provides a solid grounding in the approaches to language teaching, which also puts emphasis on communication and language as structure, as recommended in the National Curriculum. \r\n\r\nProvision is made for students to develop competence in German or Spanish as a second teaching MFL. The use of ICT is developed to enhance the future teacher's own skills as well as to contribute to the preparation for effective MFL teaching in the 21st century.\r\n\r\nThe programme lasts for 39 weeks (one academic year). The course starts at the beginning of September students are inducted into TSW and spend one week in a primary school and one week in a secondary school and to carry out a variety of pre-course tasks. These include an initial needs analysis focussing on subject knowledge and a variety of reading tasks. The first term is predominately based at the University with an open-door policy to placement school one. The first placement then continues in January and lasts around 12 weeks. Induction into the second placement school takes place before the Easter vacation and then continues in the summer term until early July.\r\n\r\n\r\nRead more at https://www.exeter.ac.uk/teachertraining/secondary/mfl/french/#3QgXSRKwFUyuR1qG.99\r\nhttps://www.westst.org.uk/page/?title=Teach+South+West&pid=176","interviewProcess":"After successful application through UCAS, a candidate will be invited to be part of an online interview process which will involve formal interviews and a presentation/teaching episode.  Due to Covid-19 restrictions, interviews are being held remotely.\r\n\r\nWhat we are looking for:\r\n\r\n- A passion for teaching and for learning\r\n\r\n- A real love of their subject\r\n\r\n- An appreciation of the role of a teacher in a pupil's life\r\n\r\n- Adaptability\r\n\r\n- Stamina\r\n\r\n- A willingness to reflect\r\n\r\n- Great organisation\r\n\r\n- The ability to work collaboratively\r\n\r\n","howSchoolPlacementsWork":"We work with our candidates to secure placements that, wherever possible, meet their needs.  The earlier the application the more flexibility we have for placements.  \r\nWe partner with approximately 50 schools who are very supportive of the programme and keen to recruit our trainees into future posts.\r\nRead more at \r\nhttps://www.westst.org.uk/page/?title=Teach+South+West&pid=176\r\n","personalQualities":"- A passion for teaching and for learning\r\n\r\n- A real love of their subject\r\n\r\n- An appreciation of the role of a teacher in a pupil's life\r\n\r\n- Adaptability\r\n\r\n- Stamina\r\n\r\n- A willingness to reflect\r\n\r\n- Great organisation\r\n\r\nTeach South West is committed to safeguarding and promoting the welfare of children and young people, and expect all staff, trainees and volunteers to share this commitment.\r\nAs such all personnel will undergo the following before being able to train/enter our Schools and Colleges;\r\n- DBS clearance enhanced check\r\n- Safeguarding training\r\n- Data Protection training","otherRequirements":"The 'Qualifications' section describes our standard offer.  However, if you have a different academic background, equivalent to degree level, you are welcome to make an application through DFE Apply System for consideration.\r\n\r\nIn addition to the academic requirements listed, successful selection based on DFE Apply application, interview (online due to Covid-19 restrictions),  Fitness to Teach assessment and DBS enhanced disclosure.\r\n \r\nAlthough not essential it would be advantageous to be able to reflect on any school-based experience or experience working with young people in another context at interview.","status":1,"createdAt":"2021-07-06T10:55:58.824Z","updatedAt":"2021-10-04T13:15:20.654Z","canSponsorStudentVisa":"yes","cycle":"2024"}
