{"id":"9f56a159-d4aa-403f-bfb6-83701b6e0d74","name":"Mathematics","code":"23Q5","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"72345aa7-096c-488f-8649-085b8178cadb","code":"G1","name":"Mathematics"}],"locations":[{"id":"fa52e0c4-ea20-410f-b368-aa8907937730","name":"Ivybridge Community College","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"64069a76-35a8-4a50-bceb-1168d8ca32a8","code":"16U","name":"Teach South West (WeST)"},"accreditedBody":{"id":"d41a1821-e35b-48eb-bf02-4842872b04a2","code":"E84","name":"University of Exeter"},"profPost":"BO","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"The usual entry requirements for this course are a good A level mathematics grade and a 2:2 degree with at least 50% mathematical content. However, equivalent or alternative qualifications are always considered and, where necessary, applicants may be required to complete some subject enhancement before joining the course.  Passes at GCSE in English and Mathematics at Grade C/4 or equivalent are required.\n\nFor graduates who need to develop their mathematics subject knowledge to gain access onto a PGCE it is possible to take a Subject Knowledge Enhancement (SKE) course. \n\nRead more at https://www.exeter.ac.uk/teachertraining/secondary/maths/#5PQc8cwhtJXiqfKX.99","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Tests offered by www.equivalencytesting.com (please contact the PGCE admissions team for further guidance before signing up for the equivalency test)","courseLength":"OneYear","feesUK":9250,"feesInternational":20000,"financialSupport":"For information on Government loans and training bursaries, please visit the [Student Finance England]( https://www.gov.uk/student-finance) and [Get into Teaching]( https://getintoteaching.education.gov.uk/) websites.\r\n\r\n\r\nFor more information, please see our [Fees and finance]( https://www.exeter.ac.uk/teachertraining/apply/feesandfinance/) webpages\r\n","aboutCourse":"The PGCE Mathematics course at Exeter is designed to help you develop your understanding of the subject, of current good classroom practice and how students can best be supported in their learning. All of this is underpinned by a commitment to supporting you in your professional development so that you enter the profession as an enthusiastic and highly-skilled teacher.\r\n\r\nThe programme lasts for 39 weeks (one academic year). The course starts at the beginning of September students are inducted into TSW and spend one week in a primary school and one week in a secondary school and to carry out a variety of pre-course tasks. These include an initial needs analysis focussing on subject knowledge and a variety of reading tasks. The first term is predominately based at the University with an open-door policy to placement school one. The first placement then continues in January and lasts around 12 weeks. Induction into the second placement school takes place before the Easter vacation and then continues in the summer term until early July.\r\n\r\nOur aim is to help you to become a reflective practitioner, a teacher who is willing to critically evaluate and develop your practice in the light of experience and research evidence. You will be laying firm foundations for a thoughtful and rewarding teaching career. You will take part in activities that we hope will challenge your thinking and help you to develop a clear and positive rationale for your own values, beliefs and approaches.\r\n\r\nYou will also need to commit to a significant amount of independent study. As well as exploring your own professional development you will be asked to think about students’ learning and how best to plan and organise lessons that allow all students to be active and successful. \r\n\r\nIn the first term of the PGCE year, based at the University, we will draw on your experiences, video material, whole group discussion, small group work, paired work, lectures, peer teaching and peer and self-evaluation to help you prepare for your school-based work in the following two terms. You will also complete two academic assignments during the year, in which you will explore aspects of learning and teaching mathematics in depth.\r\n\r\nWe will explore with you the nature of mathematics and the teaching of mathematics and how this might affect student enjoyment and engagement. \r\n\r\nRead more about the University aspects of the course at https://www.exeter.ac.uk/teachertraining/secondary/maths/#5PQc8cwhtJXiqfKX.99\r\nhttps://www.westst.org.uk/page/?title=Teach+South+West&pid=176","interviewProcess":"After successful application through DFE Apply  a candidate will be invited to be part of an online interview process which will involve formal interviews and a presentation/teaching episode.  Due to Covid-19 restrictions, interviews are being held remotely.\r\n\r\nWhat we are looking for:\r\n\r\n- A passion for teaching and for learning\r\n\r\n- A real love of their subject\r\n\r\n- An appreciation of the role of a teacher in a pupil's life\r\n\r\n- Adaptability\r\n\r\n- Stamina\r\n\r\n- A willingness to reflect\r\n\r\n- Great organisation\r\n\r\n- The ability to work collaboratively\r\n\r\n\r\n","howSchoolPlacementsWork":"We work with our candidates to secure placements that, wherever possible, meet their needs.  The earlier the application the more flexibility we have for placements.  \r\nWe partner with approximately 50 schools who are very supportive of the programme and keen to recruit our trainees into future posts.\r\nRead more at https://www.westst.org.uk/page/?title=Teach+South+West&pid=176\r\n\r\n","personalQualities":"- A passion for teaching and for learning\r\n\r\n- A real love of their subject\r\n\r\n- An appreciation of the role of a teacher in a pupil's life\r\n\r\n- Adaptability\r\n\r\n- Stamina\r\n\r\n- A willingness to reflect\r\n\r\n- Great organisation\r\n\r\nTeach South West is committed to safeguarding and promoting the welfare of children and young people, and expect all staff, trainees and volunteers to share this commitment.\r\nAs such all personnel will undergo the following before being able to train/enter our Schools and Colleges;\r\n- DBS clearance enhanced check\r\n- Safeguarding training\r\n- Data Protection training","otherRequirements":"The 'Qualifications' section describes our standard offer.  However, if you have a different academic background, equivalent to degree level, you are welcome to make an application through DFE Apply System for consideration.\r\n\r\nIn addition to the academic requirements listed, successful selection based on DFE Apply  application, interview (online due to Covid-19 restrictions), Fitness to Teach assessment and DBS enhanced disclosure.\r\n \r\nAlthough not essential it would be advantageous to be able to reflect on any school-based experience or experience working with young people in another context at interview.\r\n","status":1,"createdAt":"2021-07-06T10:55:58.673Z","updatedAt":"2021-10-04T13:15:11.694Z","canSponsorStudentVisa":"yes","cycle":"2024"}
