{"id":"ba43f63d-05e3-4762-a363-841d8b7a94f9","name":"Biology","code":"358Y","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"322cfc19-d51d-45db-91e3-bd7b4738470f","code":"C1","name":"Biology"}],"locations":[{"id":"fa52e0c4-ea20-410f-b368-aa8907937730","name":"Ivybridge Community College","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"64069a76-35a8-4a50-bceb-1168d8ca32a8","code":"16U","name":"Teach South West (WeST)"},"accreditedBody":{"id":"d41a1821-e35b-48eb-bf02-4842872b04a2","code":"E84","name":"University of Exeter"},"profPost":"BO","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"Most successful applicants have a 2:1 or above.  If however, you have a 2:2 or different academic background, equivalent to degree level, you are welcome to make an application through DFE Apply System for consideration.\n\nIn addition, successful selection based on DFE Apply application, interview (online due to Covid-19 restrictions), Fitness to Teach assessment and DBS enhanced disclosure.\n \nAlthough not essential it would be advantageous to be able to reflect on any school-based experience or experience working with young people in another context at interview.","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"A typical student will have obtained good GCSE grades in ‘double science’ or in each of the three separate science subjects. They will have a good ‘A’ level grade in biology and ideally in another science subject and a good degree (first or upper second class Honours) with at least 50% of the content related to biology. Equivalent or alternative qualifications are always considered.  Where necessary you may be required to complete some subject enhancement before joining the course.\nPasses at GCSE in English and Mathematics at Grade C/4 or equivalent are required.\nRead more at https://www.exeter.ac.uk/teachertraining/secondary/science/biology/#DGD3rYQTucCdjZO7.99\nTests offered by www.equivalencytesting.com (please contact the PGCE admissions team for further guidance before signing up for the equivalency test)","courseLength":"OneYear","feesUK":9250,"feesInternational":20000,"financialSupport":"For information on Government loans and training bursaries, please visit the [Student Finance England]( https://www.gov.uk/student-finance) and [Get into Teaching]( https://getintoteaching.education.gov.uk/) websites.\r\n\r\n\r\nFor more information, please see our [Fees and finance]( https://www.exeter.ac.uk/teachertraining/apply/feesandfinance/) webpages\r\n","aboutCourse":"Biology is the most popular science choice at 'A' level and, in addition to being a key component of Science in the National Curriculum, is also being offered as a separate GCSE option in many schools.\r\n\r\nThe PGCE Secondary Biology option provides a pathway into teaching for good biology graduates who, ideally, also have a strong background in at least one other science at 'A' level. It is designed to prepare students for teaching all aspects of science to at least Key Stage 3, and biology at GCSE and 'A' level.\r\n\r\nTopics covered include:\r\n\r\nthe aims of science teaching\r\nthe planning, preparation and evaluation of learning experiences for children of different ages and abilities\r\nschool laboratory management\r\nthe use of information and communications technologies to support science teaching and learning\r\nMore details about the types of sessions you will have and how you will be taught to teach can be found here.\r\n\r\nThroughout the course we aim to promote engagement with the wider issues of science and its ethical and social relevance. Practising teachers are involved in delivering the course in the University and play an active mentoring role to foster professional development in schools.\r\n\r\nThe programme lasts for 39 weeks (one academic year). The course starts at the beginning of September students are inducted into TSW and spend one week in a primary school and one week in a secondary school and to carry out a variety of pre-course tasks. These include an initial needs analysis focussing on subject knowledge and a variety of reading tasks. The first term is predominately based at the University with an open-door policy to placement school one. The first placement then continues in January and lasts around 12 weeks. Induction into the second placement school takes place before the Easter vacation and then continues in the summer term until early July.\r\n\r\nRead more at https://www.exeter.ac.uk/teachertraining/secondary/science/biology/#wSVPoVAysAykPwGj.99 and https://www.westst.org.uk/page/?title=Teach+South+West&pid=176\r\n\r\n","interviewProcess":"After successful application through DFE Apply System a candidate will be invited to be part of an online interview process which will involve formal interviews and a presentation/teaching episode.  Due to Covid-19 restrictions, interviews are being held remotely.\r\n\r\nWhat we are looking for:\r\n\r\n- A passion for teaching and for learning\r\n\r\n- A real love of their subject\r\n\r\n- An appreciation of the role of a teacher in a pupil's life\r\n\r\n- Adaptability\r\n\r\n- Stamina\r\n\r\n- A willingness to reflect\r\n\r\n- Great organisation\r\n\r\n- The ability to work collaboratively\r\n\r\n","howSchoolPlacementsWork":"We work with our candidates to secure placements that, wherever possible, meet their needs.  The earlier the application the more flexibility we have for placements.  \r\nWe partner with approximately 50 schools who are very supportive of the programme and keen to recruit our trainees into future posts.\r\nsee our website for more details https://www.westst.org.uk/page/?title=Teach+South+West&pid=176\r\n\r\n","personalQualities":"- A passion for teaching and for learning\r\n\r\n- A real love of their subject\r\n\r\n- An appreciation of the role of a teacher in a pupil's life\r\n\r\n- Adaptability\r\n\r\n- Stamina\r\n\r\n- A willingness to reflect\r\n\r\n- Great organisation\r\n\r\nTeach South West is committed to safeguarding and promoting the welfare of children and young people, and expect all staff, trainees and volunteers to share this commitment.\r\nAs such all personnel will undergo the following before being able to train/enter our Schools and Colleges;\r\n- DBS clearance enhanced check\r\n- Safeguarding training\r\n- Data Protection training","otherRequirements":"Most successful applicants have a 2:1 or above.  If however, you have a 2:2 or different academic background, equivalent to degree level, you are welcome to make an application through DFE Apply for consideration.\r\n\r\nIn addition, successful selection based on DFE Apply application, interview (online due to Covid-19 restrictions), Fitness to Teach assessment and DBS enhanced disclosure.\r\n \r\nAlthough not essential it would be advantageous to be able to reflect on any school-based experience or experience working with young people in another context at interview.\r\n\r\n\r\n","status":1,"createdAt":"2021-07-06T10:55:59.027Z","updatedAt":"2021-10-04T13:14:17.897Z","canSponsorStudentVisa":"yes","cycle":"2024"}
