{"id":"cd202e5b-5002-48eb-bbcb-114ae15993ea","name":"Primary","code":"358X","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"e1f7825e-963d-4eb2-ba52-3f4f9007591d","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"64069a76-35a8-4a50-bceb-1168d8ca32a8","code":"16U","name":"Teach South West (WeST)"},"accreditedBody":{"id":"d41a1821-e35b-48eb-bf02-4842872b04a2","code":"E84","name":"University of Exeter"},"profPost":"BO","degreeGrade":"0","english":"1","maths":"1","science":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We are looking for applicants with an interest in primary education who have the drive to become critically reflective teachers and change agents.\n\nThe usual entry requirement for this course is a 2:1 or above in your first degree. \n\nPasses at GCSE in English, Mathematics and Science at Grade C/4. Please note that although the DfE requirement is a grade C/4, we will generally only consider applicants with a grade B/5 or above in Mathematics and English and a grade C/4 in Science.\n\nFollow: https://www.exeter.ac.uk/teachertraining/primary/teachingandlearning/#R46Hcbjff3G4Zt4R.99\n\nTests offered by www.equivalencytesting.com (please contact the PGCE admissions team for further guidance before signing up for the equivalency test)","courseLength":"OneYear","feesUK":9250,"feesInternational":20000,"financialSupport":"For information on Government loans and training bursaries, please visit the [Student Finance England]( https://www.gov.uk/student-finance) and [Get into Teaching]( https://getintoteaching.education.gov.uk/) websites.\r\n\r\n\r\nFor more information, please see our [Fees and finance]( https://www.exeter.ac.uk/teachertraining/apply/feesandfinance/) webpages\r\n","aboutCourse":"Our most recent Ofsted inspection, in 2017, rated the Exeter Primary programme as “outstanding”.\r\nOur latest statistics show that in 2016/17, 97 per cent of Primary trainees were awarded QTS of which, 72 per cent were graded as “outstanding”. In the latest employment statistics (2015-16) 93 per cent of those awarded Qualified Teacher Status (QTS) secured a teaching post within six months of completion.\r\nThe programmes last 39 weeks with time spent in school placements and at the University.  We work with you to select these placements.\r\n\r\nThe University modules are designed to give you experience of all the subjects you will be expected to teach for your specified age range.\r\n\r\nSubject specialist pathways are unique to the Exeter Primary PGCE programme and prepare trainees to become curriculum coordinators. The Teaching and Learning pathway prepares trainees to become leaders of curriculum innovation more generally. The leadership skills developed across all pathways provide a distinct advantage as trainees begin their teaching careers.\r\n\r\nThe programme lasts for 39 weeks (one academic year). The course starts at the beginning of September students are inducted into TSW and spend one week in a primary school and one week in a secondary school and to carry out a variety of pre-course tasks. These include an initial needs analysis focussing on subject knowledge and a variety of reading tasks. The first term is predominately based at the University with an open-door policy to placement school one. The first placement then continues in January and lasts around 12 weeks. Induction into the second placement school takes place before the Easter vacation and then continues in the summer term until early July.\r\n\r\n\r\nRead more at https://www.exeter.ac.uk/teachertraining/primary/structure/#ri7EEKIt2YjMwz4s.99\r\nhttps://www.westst.org.uk/page/?title=Teach+South+West&pid=176","interviewProcess":"After successful application through UCAS, a candidate will be invited to be part of an online interview process which will involve formal interviews and a presentation/teaching episode.  Due to Covid-19 restrictions, interviews are being held remotely.\r\n\r\nWhat we are looking for:\r\n\r\n- A passion for teaching and for learning\r\n\r\n- A real love of their subject\r\n\r\n- An appreciation of the role of a teacher in a pupil's life\r\n\r\n- Adaptability\r\n\r\n- Stamina\r\n\r\n- A willingness to reflect\r\n\r\n- Great organisation\r\n\r\n- The ability to work collaboratively\r\n\r\n","howSchoolPlacementsWork":"We work with our candidates to secure placements that, wherever possible, meet their needs.  The earlier the application the more flexibility we have for placements.  \r\nWe partner with approximately 50 schools who are very supportive of the programme and keen to recruit our trainees into future posts.\r\nRead more at https://www.westst.org.uk/page/?title=Teach+South+West&pid=176\r\n\r\n\r\n","personalQualities":"- A passion for teaching and for learning\r\n\r\n- A real love of their subject\r\n\r\n- An appreciation of the role of a teacher in a pupil's life\r\n\r\n- Adaptability\r\n\r\n- Stamina\r\n\r\n- A willingness to reflect\r\n\r\n- Great organisation\r\n\r\nTeach South West is committed to safeguarding and promoting the welfare of children and young people, and expect all staff, trainees and volunteers to share this commitment.\r\nAs such all personnel will undergo the following before being able to train/enter our Schools and Colleges;\r\n- DBS clearance enhanced check\r\n- Safeguarding training\r\n- Data Protection training","otherRequirements":"Most successful applicants have a 2:1 or above.  If however, you have a 2:2 or different academic background, equivalent to degree level, you are welcome to make an application through DFE Apply System for consideration.\r\n\r\nIn addition to the academic requirements listed, successful selection based on DFE Apply  application, interview (online due to Covid-19 restrictions), Fitness to Teach assessment and DBS enhanced disclosure.\r\n \r\nAlthough not essential it would be advantageous to be able to reflect on any school-based experience or experience working with young people in another context at interview.","status":1,"createdAt":"2021-07-06T10:55:58.990Z","updatedAt":"2021-10-04T13:16:06.028Z","canSponsorStudentVisa":"yes","cycle":"2024"}
