{"id":"da1cd97a-1cb7-47b5-8f57-c838347ac84e","name":"Physics","code":"23QF","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"bf97cd0a-224c-43d3-a021-84143df13e8d","code":"F3","name":"Physics"}],"locations":[{"id":"fa52e0c4-ea20-410f-b368-aa8907937730","name":"Ivybridge Community College","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"64069a76-35a8-4a50-bceb-1168d8ca32a8","code":"16U","name":"Teach South West (WeST)"},"accreditedBody":{"id":"d41a1821-e35b-48eb-bf02-4842872b04a2","code":"E84","name":"University of Exeter"},"profPost":"BO","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"A typical student will have a good degree with at least 50% of the content related to physics, e.g. engineering or astronomy. Equivalent or alternative qualifications are always considered. They will have obtained good GCSE grades in ‘double science’ or in each of the three separate science subjects. They will have a good ‘A’ level grade in physics and ideally in another science subject.  Where necessary applicants may be required to complete some subject enhancement before joining the course.\n\nPasses at GCSE in English and Mathematics at Grade C/4 or equivalent are required.\n\nRead more at https://www.exeter.ac.uk/teachertraining/secondary/science/physics/#qTPPj1zI7biZaPhh.99","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Tests offered by www.equivalencytesting.com (please contact the PGCE admissions team for further guidance before signing up for the equivalency test)","courseLength":"OneYear","feesUK":9250,"feesInternational":20000,"financialSupport":"For information on Government loans and training bursaries, please visit the [Student Finance England]( https://www.gov.uk/student-finance) and [Get into Teaching]( https://getintoteaching.education.gov.uk/) websites.\r\n\r\n\r\nFor more information, please see our [Fees and finance]( https://www.exeter.ac.uk/teachertraining/apply/feesandfinance/) webpages\r\n","aboutCourse":"Our PGCE Physics course will prepare you to teach physics to GCSE and 'A' level.\r\n\r\nYou will train as a science teacher who specialises in physics, so we will also prepare you to teach chemistry and biology to at least Key Stage 3.\r\n\r\nThe PGCE Physics option provides a pathway into teaching for graduates who have a good degree with at least 50% of the content related to physics, e.g. physics, engineering or astronomy. Ideally, you will also have a strong background in at least one other science at 'A' level. \r\n\r\nPhysics remains a popular choice for 'A' level students in schools. In addition to being a key component of Science in the National Curriculum it is also being offered as a separate GCSE option in many schools. STEM subjects are a national priority so physics teachers are in strong demand.\r\n\r\nDevelopment of subject and teaching knowledge and understanding is a priority and the team of science tutors includes specialists in physics, chemistry, biology and psychology teaching.\r\n\r\nStudents begin the programme with degree level knowledge of physics which is often quite specialised. Main Subject Physics sessions and Subject Support Groups, in which students teach each other about their own particular specialism within physics, are designed to help students develop their subject knowledge across all the aspects of physics that are relevant to the school curriculum.\r\n\r\nThe programme lasts for 39 weeks (one academic year). The course starts at the beginning of September students are inducted into TSW and spend one week in a primary school and one week in a secondary school and to carry out a variety of pre-course tasks. These include an initial needs analysis focussing on subject knowledge and a variety of reading tasks. The first term is predominately based at the University with an open-door policy to placement school one. The first placement then continues in January and lasts around 12 weeks. Induction into the second placement school takes place before the Easter vacation and then continues in the summer term until early July.\r\n\r\nRead \r\nhttps://www.exeter.ac.uk/teachertraining/secondary/science/physics/#qTPPj1zI7biZaPhh.99\r\nhttps://www.westst.org.uk/page/?title=Teach+South+West&pid=176","interviewProcess":"After successful application through UCAS, a candidate will be invited to be part of an online interview process which will involve formal interviews and a presentation/teaching episode.  Due to Covid-19 restrictions, interviews are being held remotely.\r\n\r\nWhat we are looking for:\r\n\r\n- A passion for teaching and for learning\r\n\r\n- A real love of their subject\r\n\r\n- An appreciation of the role of a teacher in a pupil's life\r\n\r\n- Adaptability\r\n\r\n- Stamina\r\n\r\n- A willingness to reflect\r\n\r\n- Great organisation\r\n\r\n- The ability to work collaboratively\r\n\r\n\r\n","howSchoolPlacementsWork":"We work with our candidates to secure placements that, wherever possible, meet their needs.  The earlier the application the more flexibility we have for placements.  \r\nWe partner with approximately 50 schools who are very supportive of the programme and keen to recruit our trainees into future posts.\r\nRead more at  https://www.westst.org.uk/page/?title=Teach+South+West&pid=176\r\n\r\n\r\n","personalQualities":"- A passion for teaching and for learning\r\n\r\n- A real love of their subject\r\n\r\n- An appreciation of the role of a teacher in a pupil's life\r\n\r\n- Adaptability\r\n\r\n- Stamina\r\n\r\n- A willingness to reflect\r\n\r\n- Great organisation\r\n\r\nTeach South West is committed to safeguarding and promoting the welfare of children and young people, and expect all staff, trainees and volunteers to share this commitment.\r\nAs such all personnel will undergo the following before being able to train/enter our Schools and Colleges;\r\n- DBS clearance enhanced check\r\n- Safeguarding training\r\n- Data Protection training","otherRequirements":"The 'Qualifications' section describes our standard offer.  However, if you have a different academic background, equivalent to degree level, you are welcome to make an application through DFE Apply System for consideration.\r\n\r\nIn addition to the academic requirements listed, successful selection based on DFE Apply application, interview (online due to Covid-19 restrictions), Fitness to Teach assessment and DBS enhanced disclosure.\r\n \r\nAlthough not essential it would be advantageous to be able to reflect on any school-based experience or experience working with young people in another context at interview.","status":1,"createdAt":"2021-07-06T10:55:58.744Z","updatedAt":"2021-10-04T13:15:51.261Z","canSponsorStudentVisa":"yes","cycle":"2024"}
