{"id":"be667e3f-2524-453d-a461-91c24dbf2a58","name":"Primary (3-7)","code":"J339","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_7","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"ac4d33f2-9d21-4e2a-9e45-bfda903da373","name":"Elements Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"ef35ac5c-8032-407e-b110-9c65e415829a","name":"Bramley Park Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"87bfa47f-fdc1-48e0-9c4b-ed25ad156eb3","name":"Ebor Garden's Primary Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"2584fef2-71d0-47af-808e-42d908ab600a","name":"Victoria Primary Academy","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"ab49d14f-e05f-45e0-b1e0-d97eba66f093","code":"1GW","name":"Josie Thirkell Institute of Education"},"accreditedBody":{"id":"e5b8e187-ccc1-4253-9dd0-376d6abf7e66","code":"2EY","name":"Exceed SCITT"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"This PGCE course prepares you to teach children in the 3 to 7 age range as a general primary teacher. It is a very practical course with around two-thirds of the time spent in schools, mostly working with teachers and pupils, and around one third spent on directed study, with partnership training in the University and school.\r\n\r\nOur programme is innovative and forward thinking, with 3 clear strands: The National Curriculum for strong subject knowledge and teaching strategies to ensure pupil’s make good progress; Professional Practice, such as inclusion and effective behaviours for learning so that you are confident to meet the needs of all children; Your personal well-being including mindfulness, positive psychology and managing workload.\r\n\r\nWant to train and make a difference to children’s life chances? There is no better place to train than in our diverse partner schools. We offer experiences that few providers can, such as experiencing schools in challenging socio economic circumstances and achieve outcomes well above national expectations. \r\n\r\nOur partnership is an amazing place to train and committed to its vision and values; ‘providing inspirational training for aspirational teachers and a genuine commitment to professional learning and evidence based practice.’ \r\n","interviewProcess":"Our recruitment process is shared across the partner schools within the Positive Regard Teaching School Alliance. \r\n\r\nThere is an initial selection process based on how applicants meet the qualifications and experience criteria. Should you pass this 'initial sift' successfully, then it is likely you will be called to interview.\r\nInterviews take place in our partner schools and the panel may include representatives from Positive Regard TSA and Senior Leaders from our partner schools. \r\n\r\nThe interview process is designed to enable you to show the extent to which you have the potential to become a great teacher. The interview will consist of a range of tasks designed to test your knowledge and skills in order for you to become an effective teacher.  \r\n\r\nWe will inform you in advance about any pre-interview guidance for the other activities as required.\r\n\r\nDuring the interview, you will have the opportunity to meet and talk to staff and children and ask questions. Although please be aware if successful you may not be placed in the school in which the interviews are taking place. However, we do organise pre-visits to designated placement schools further into the process.\r\n","howSchoolPlacementsWork":"We work with Primary Schools across the region and you will have the opportunity to experience Special school settings as well. You will become part of the team allowing you to train alongside experienced and specialist teachers. \r\n\r\nYou will spend the majority of your course in one of our partner schools, supported by experienced and supportive staff, one of whom will be assigned as your host mentor. You will undertake a second contrasting placement in another of our partner schools in the first half of the Spring Term.\r\n","personalQualities":"We are looking for ambitious trainee teachers who are passionate and enthusiastic about working with children, with a desire to share that with children of all abilities.\r\n\r\nWe also want our teachers to be able to effectively meet the learning needs of pupils who may have a diverse range of educational needs.\r\nExperience of working with children of this age range would be very helpful, particularly if in a school setting through previous employment or voluntary work.","otherRequirements":"Experience is not required however, we recommend that you gain some experience in order for you to become aware of what a career in teaching entails.\r\n\r\nA Disclosure Barring Service (DBS) will need to be completed. This is a requirement before commencement on the course. \r\n","status":1,"createdAt":"2021-07-06T10:50:59.544Z","updatedAt":"2021-09-30T13:30:56.284Z","canSponsorStudentVisa":"no","cycle":"2024"}
