{"id":"e872921e-67b1-4cbf-a039-a810a10b7d97","name":"Primary","code":"22QV","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"79895666-bcb9-4a46-a36d-6ae60edf2c1d","name":"The Mill Academy","isPublished":"N","status":"S","vacancies":"F"},{"id":"fc165f28-6416-42dc-ab8e-3cadbf00203e","name":"Queens Road Academy","isPublished":"N","status":"S","vacancies":"F"},{"id":"b73a85cd-2168-4147-92af-e68f8f92ca16","name":"The Forest Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"d0825969-cac0-441e-bc6a-45d89746a076","name":"West Meadows Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"f58c94ad-d6db-4f24-b090-05b6599b1b53","name":"Oakhill Primary Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"06e265e6-c0c9-47ea-8533-8e6d363830e3","name":"Oakwell Rise Primary Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"068c521a-9db1-4b95-b96b-5e94c5c63f07","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"},{"id":"e0cbff1a-cd58-40ce-868e-351be93bfff0","name":"Royston St Johns the Baptist C of E Primary School","isPublished":"N","status":"S","vacancies":"F"},{"id":"d5241df7-fa8e-447f-ae9a-bfaf1d7dde3b","name":"Darton Primary School","isPublished":"N","status":"S","vacancies":"F"},{"id":"abe4af9c-da20-4e25-a43a-8cda8c854cbd","name":"St Mary's C of E Primary School","isPublished":"N","status":"S","vacancies":"F"},{"id":"1aee76e4-55dc-45a7-8519-9a74433f1faa","name":"All Saints Academy","isPublished":"N","status":"S","vacancies":"F"}],"trainingProvider":{"id":"ab49d14f-e05f-45e0-b1e0-d97eba66f093","code":"1GW","name":"Josie Thirkell Institute of Education"},"accreditedBody":{"id":"899178cc-20a7-4df5-951a-ee83c1b3d4d1","code":"S21","name":"Sheffield Hallam University"},"profPost":"BO","degreeGrade":"9","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"This unsalaried Primary general teacher training programme leads to a recommendation for the award of Qualified Teacher Status (QTS) and PGCE comprising of 60 credits at Masters level.\r\n\r\nFor the duration of the course you will be in school for 4 days a week, apart from assessed periods where you will be in school 5 days.\r\nWithin school, you will have a host mentor who will have undertaken a training programme at Sheffield Hallam University to develop their mentoring skills, including coaching and classroom observation. \r\n\r\nYou will take part in our bespoke twilight Programme, delivered by outstanding practitioners from partner schools within the Alliance. All practitioners have strengths in ensuring the progress of vulnerable groups of learners and in leading the development of innovative and creative pedagogy.\r\n\r\nYou will develop the professional knowledge, understanding and skills required to be an outstanding practitioner through participation in training such as:\r\n* The effective use of data to inform intervention and planning and target setting\r\n* Assessment for learning personalised and differentiated learning\r\n* Effective behaviour management and nurture approaches\r\n * Key theories underpinning child development and attachment disorders\r\n* Professional expectations and the wider role of teachers\r\nCareer development and preparing for interview.\r\n\r\nOur programme is further enhanced by attendance one day a week at Sheffield Hallam University for further subject-specific development and accreditation work. Sheffield Hallam University will also provide intensive preparation for your school placement at the start of the autumn term.\r\n","interviewProcess":"Our recruitment process is shared across the partner schools within the Positive Regard Teaching School Alliance. \r\n\r\nThere is an initial selection process based on how applicants meet the qualifications and experience criteria. Should you pass this 'initial sift' successfully, then it is likely you will be called to interview.\r\nInterviews take place in our partner schools and the panel may include representatives from Positive Regard TSA, Sheffield Hallam University and Senior Leaders from our partner schools. \r\n\r\nThe interview process is designed to enable you to show the extent to which you have the potential to become a great teacher. The interview will consist of a range of tasks designed to test your knowledge and skills in order for you to become an effective teacher. \r\n\r\nWe will inform you in advance about any pre-interview guidance for the other activities as required.\r\n\r\nDuring the interview, you will have the opportunity to meet and talk to staff and children and ask questions. Although please be aware if successful you may not be placed in the school in which the interviews are taking place. However, we do organise pre-visits to designated placement schools further into the process.\r\n","howSchoolPlacementsWork":"We work with Primary Schools across four different Local Authorities and you will have the opportunity to experience Special school settings as well. You will become part of the team allowing you to train alongside experienced and specialist teachers. \r\n\r\nWe follow the Sheffield Hallam ABA model, where you will spend the majority of your course in one of our partner schools, supported by experienced and supportive staff, one of whom will be assigned as your host mentor. You will undertake a second contrasting placement in another of our partner schools in the first half of the Spring Term.\r\n\r\nThroughout the duration of the course, you will be in school for 4 days a week, apart from assessed periods where you will be in school 5 days a week. The assessed periods are in your host school.\r\n\r\n","personalQualities":"We are looking for ambitious trainee teachers who are passionate and enthusiastic about working with children, with a desire to share that with children of all abilities.\r\nWe also want our teachers to be able to effectively meet the learning needs of pupils who may have a diverse range of educational needs.\r\nExperience of working with children of this age range would be very helpful, particularly if in a school setting though previous employment or voluntary work.\r\n","otherRequirements":"Before you start the course, you will need to have a Disclosure and Barring Service (DBS) security check.\r\n\r\n","status":1,"createdAt":"2021-07-06T10:50:57.975Z","updatedAt":"2021-09-30T14:04:16.538Z","canSponsorStudentVisa":"no","cycle":"2024"}
