{"id":"ea13ba59-7eb8-4267-b7e6-dd3de0c310c4","name":"Primary (SEND)","code":"F848","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"other","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"yes","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"e6714868-445c-4882-a030-227dc2bb556a","name":"Springwell Leeds Academy South Site","isPublished":"Y","status":"R","vacancies":"F"},{"id":"720e54cd-f7db-4934-b162-e065b6589987","name":"Springwell Leeds Academy North Site","isPublished":"Y","status":"R","vacancies":"F"},{"id":"068c521a-9db1-4b95-b96b-5e94c5c63f07","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"},{"id":"9f60080d-65f2-44b4-9819-b1e3505b0c16","name":"Penny Field School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"8cd3de15-39ad-457f-848c-aafe55c7acf9","name":"Green Meadows Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"32312eee-cac3-4330-8ac4-eb394294eaa7","name":"The Forest School","isPublished":"N","status":"S","vacancies":"F"},{"id":"019ae170-40ce-4b2b-a77e-10a4e5a0daa4","name":"Springwell Leeds Academy East Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"ab49d14f-e05f-45e0-b1e0-d97eba66f093","code":"1GW","name":"Josie Thirkell Institute of Education"},"accreditedBody":{"id":"e5b8e187-ccc1-4253-9dd0-376d6abf7e66","code":"2EY","name":"Exceed SCITT"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"This unique programme maximises your time in school and classrooms. Even the PGCE is drawn directly from your work in school and is not a separate taught course. \r\n\r\nWe aim to match you with a home school in our partnership that matches your particular interest in SEND and/or suits your geographical location where this is possible.\r\n\r\nYou will start the course with an introduction at your home school. This is followed by an assessed placement for either Key Stage 1 or Key Stage 2 in a mainstream primary school.\r\n\r\nThis full-time course includes both school-based experience and sessions at the university with a strong focus on integrating theory and practice. At least 120 days will be based in schools. School placements are carefully structured to ensure the gradual development of your confidence as an effective teacher through building up experiences working with university-based mentors and school-based mentors. \r\n\r\nIt is an integrated academic and professional preparation for teaching, combining study at either postgraduate or professional level with practical training to meet the Teachers’ Standards. The goal is that you should become a reflective practitioner – a teacher who thinks about their experiences and learns from them in order to improve their practice.\r\n\r\nThe course will include lectures, seminars, workshops, independent study, tutorials, school-based training and will recommend you for Qualified Teacher Status (QTS). The university-based sessions are very much a starting point for the training undertaken in schools through observation and working alongside experienced teachers.\r\n\r\n","interviewProcess":"Our recruitment process is shared across the partner schools within the Positive Regard Teaching School Alliance. \r\n\r\nThere is an initial selection process based on how applicants meet the qualifications and experience criteria. Should you pass this 'initial sift' successfully, then it is likely you will be called to interview.\r\nInterviews take place in our partner schools and the panel may include representatives from Positive Regard TSA and Senior Leaders from our partner schools. \r\n\r\nThe interview process is designed to enable you to show the extent to which you have the potential to become a great teacher. The interview will consist of a range of tasks designed to test your knowledge and skills in order for you to become an effective teacher. \r\n\r\nWe will inform you in advance about any pre-interview guidance for the other activities as required.\r\n\r\nDuring the interview, you will have the opportunity to meet and talk to staff and children and ask questions. Although please be aware if successful you may not be placed in the school in which the interviews are taking place. However, we do organise pre-visits to designated placement schools further into the process.\r\n","howSchoolPlacementsWork":"We work with Primary, Special and Alternate Provision Schools across the region. You will become part of the team allowing you to train alongside experienced and specialist teachers. \r\n\r\nYou will spend the majority of your course in one of our partner schools, supported by experienced and supportive staff, one of whom will be assigned as your host mentor. You will undertake a second contrasting placement in another of our partner schools in the first half of the Spring Term.\r\n","personalQualities":"We are looking for ambitious trainee teachers who are passionate and enthusiastic about working with children, with a desire to share that with children of all abilities.\r\n\r\nWe also want our teachers to be able to effectively meet the learning needs of pupils who may have a diverse range of educational needs.\r\nExperience of working with children of this age range would be very helpful, particularly if in a school setting through previous employment or voluntary work.","otherRequirements":"Experience is not required however, we recommend that you gain some experience in order for you to become aware of what a career in teaching entails.\r\n\r\nA Disclosure Barring Service (DBS) will need to be completed. This is a requirement before commencement on the course. \r\n","status":1,"createdAt":"2021-07-06T10:50:59.464Z","updatedAt":"2021-09-30T13:34:42.985Z","canSponsorStudentVisa":"no","cycle":"2024","applicationsOpenDateOther":"2021-12-14T00:00:00.000Z"}
