{"id":"fd13ac33-7101-457c-ad7e-ff08a48f55b1","name":"Classics","code":"C719","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"fa7ee0d3-4cd4-475a-9280-f6b63b0dc466","code":"A0","name":"Latin"},{"id":"0238281a-b738-45a5-88bb-b426a2a562e1","code":"Q8","name":"Classics"}],"locations":[{"id":"959d052b-6d52-4e74-9e05-4703bbbe2d9e","name":"School Direct Lead School Location","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"604f4b60-b680-4227-a787-370bf3942f27","code":"236","name":"The Downland Alliance"},"accreditedBody":{"id":"66d7a620-e321-4149-9b28-fa5502ce365c","code":"O66","name":"Oxford Brookes University"},"degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"Please contact us if you have a query.","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We do not offer equivalency tests. \n\nDetails of the testing provider and the costs are available at \n\nhttps://www.equivalencytesting.com/","courseLength":"OneYear","feesUK":7250,"financialSupport":"Many courses are supported by scholarships and bursaries. Student finance is available if you are eligible. Details on ways to fund your training are available on the \"Get into Teaching\" website. \r\n\r\nTo encourage and reward training to teach in certain specified subjects teachers in specific areas of England, the Teachers’ Student Loan Reimbursement scheme will pay back the student loan repayments you’ve made in the previous year. ","aboutCourse":"We aim to provide a programme which has at its heart 3 main objectives. \r\n\r\nIt is a programme which is highly professional, of consistent high quality\r\nand personal to you.\r\n\r\nAccredited by Oxford Brookes University, the programme covers a wide range of activities. \r\n\r\nImmersion into a teacher's daily life and exposure to outstanding practice ensures you have the best opportunity to reach your full potential. \r\n\r\nWe look for trainees who display the potential to become outstanding classics teachers of the future and who will develop in students a passion to become contributing citizens and enthusiastic life-long learners.\r\n\r\nAs one of our trainees, you are attached to one “host” school for much of the year. This makes it possible for you to get to know the school's teachers and students and to understand their policies and practices. \r\n\r\nThe core training package provides: \r\n\r\n* a main placement in one of our partner schools\r\n* a second placement in a contrasting school\r\n* a primary cross phase placement in one of linked primary schools \r\n* 6th form experience \r\n* the possibility of experience in a special setting \r\n\r\nTraining modules cover:\r\n\r\n- professional behaviours\r\n- high expectations and managing behaviour\r\n- behaviour management - building a culture for learning\r\n- how students learn - the science of learning\r\n- how to plan and teach effective lessons\r\n- improving outcomes for students - particularly those from \r\n  disadvantaged backgrounds and those with additional needs\r\n- developing subject knowledge and curriculum development\r\n- how to adapt teaching to support students' outcomes\r\n- assessment of learning\r\n- working with parents and carers\r\n- supporting student mental health\r\n- safeguarding and child protection\r\n\r\nAssessment is through engagement with the core training, analysis and reflection and successful completion of two teaching placements with classroom practice observation and formal feedback from your mentor and tutor to ensure you meet the teaching standards by the end of the course.\r\n\r\nYou’ll be part of a team from the start, receiving intensive support from your mentor so you won’t be teaching classes unsupported until you’re ready.\r\n\r\nWhat do our trainees say?\r\n\r\n“All the schools are excellent nurturing supportive environments. The training staff are engaging and informative; crucially the majority are senior leaders in their schools so their expertise is up to date and hands on.”\r\n\r\n\r\n\r\n","interviewProcess":"How do we select our trainees? \r\n\r\nYou should be clear in your personal statement about why you want to become a teacher, the skills involved and what you can bring to the profession. \r\n\r\nYour application will be shortlisted from the details and references. \r\n\r\nIf shortlisted, you will be invited for interview - this initial interview may be on line. \r\n\r\nIt could include the following: \r\n\r\n- a subject specific / teaching task presentation by you\r\n- an individual interview\r\n\r\nIf you are successful at this stage you will be asked to attend a further session at one of our schools to meet students and staff and spend some time in the classroom. You will also have a tour of the school. \r\n\r\nYou numeracy and literacy skills will be assessed during our programme. \r\n\r\nYou will be judged by the criteria:\r\n\r\n- appropriateness of your subject qualifications and the relevance to subject teaching \r\n- your capacity to continue professional learning \r\n- awareness of the role and responsibilities of the teacher \r\n- any school experience \r\n- resilience \r\n- ability to communicate effectively \r\n- your enthusiasm for and commitment to teaching \r\n- awareness of your personal strengths and weaknesses\r\n\r\nYou will be expected to be familiar with key issues and developments in schools – especially in your subject area. \r\n\r\nThe programme for the selection process includes a collaborative approach between Oxford Brookes University and our partner schools.\r\n","howSchoolPlacementsWork":"As a school direct trainee you are based in one of our secondary partner schools and from the beginning there will be a focus on school-based learning.\r\n\r\nYou will have a school based mentor who co-ordinates your classroom-related activities. They provide guidance and support and, as you develop your skills, judge when and how to increase your experience and responsibilities until you are ready to take on whole classes. \r\n\r\nAnother experienced teacher in the school (the ITT coordinator) \r\nco-ordinates activities relating to general educational issues. \r\n\r\nYou will also have individual tutor support from Oxford Brookes University.\r\n\r\nThis personalised approach means that you are supported throughout the course and you don’t have to worry about being thrown in at the deep end until you are ready. \r\n\r\nGradually you will begin to teach parts of lessons, and then short series of lessons. Before and after Christmas, almost all your time will be spent in schools, with a complementary placement at another local school arranged for approximately 6 weeks during February. There is also the opportunity for a cross phase placement. \r\n\r\nWe cannot guarantee your main placement will be in a particular host school - we do, however, take account of any specific requests and always consider any issues including individual travel distances. This forms part of the discussions which take place during the selection process. Above all, we consider which of the schools will be a \"best fit\" for you coupled with the mentor involved and where there vacancies. \r\n\r\nThe majority of our training sessions, which are not school classroom based, take place in one of our partnership schools, although we may occasionally use an external venue such as Shaw House in Newbury. \r\n\r\nWhat do our trainees say? \r\n\r\n“Training across schools enables you to learn as much as possible and see a range of techniques.”\r\n\r\n“Our mentors as well as the training staff are invaluable for their experience teaching wisdom and support. There is always someone to turn to if you feel your ship is sinking!”\r\n\r\n","personalQualities":"You should have a commitment to education and young people and be passionate about making a difference. \r\n\r\nYou'll need to: \r\n\r\n* Be enthusiastic about your subject \r\n* Have a keen interest or hobby \r\n* Work on joint projects - successes in team working are  important\r\n* Take part in discussions and respond to written materials so interpersonal, communication and writing skills are important. \r\n* Have organisational skills, a good work ethic, a positive approach to your own learning, resilience and a sense of humour! \r\n* Have the perseverance required to complete your training and become a member of the profession\r\n","otherRequirements":"You will need to complete a “Fit to Teach” declaration. This is to ensure that you have the health and physical capacity to teach and it is arranged before you start your training.\r\n\r\nStatutory guidance, Safeguarding Children and Safer Recruitment in Education, requires us to ensure that all trainees have been subject to Enhanced Disclosure and Barring Service (DBS) and criminal records check before they start their training. \r\n\r\nHaving school experience will help support your application, but don’t worry if you don’t have any – it isn’t a mandatory requirement.\r\n","status":1,"createdAt":"2021-09-29T11:57:22.725Z","updatedAt":"2021-10-01T09:06:26.958Z","canSponsorStudentVisa":"yes","cycle":"2024"}
