{"id":"7c1418d7-759a-4e3d-a0d8-4feb747f3083","name":"Design and technology","code":"W137","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"P","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"118fabd7-86d0-4a40-9e9a-e5c302abe59b","code":"DT","name":"Design and technology"}],"locations":[{"id":"340b98e9-ad46-4fb6-8f54-15b19706ed48","name":"Main Site","isPublished":"Y","status":"R","vacancies":"P"}],"trainingProvider":{"id":"94695424-6553-46c4-9c05-181e61813587","code":"3S1","name":"Teesside University"},"profPost":"PG","degreeGrade":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"2 years","feesUK":4500,"feesInternational":14010,"aboutCourse":"This course is designed to train you to become an inspirational, reflective and professional teacher of secondary design technology who can motivate learners aged 11-16 to achieve highly and realise their full potential.\r\n\r\nYour learning will be personalised across professional skills, subject knowledge and pedagogy, research and theory. You develop further by completing a small-scale research project within your subject area and by undertaking intensive teaching practices within school settings, allowing you to put your knowledge and understanding of education into practice. On placement you will practise teaching strategies, learn how to manage a classroom environment, and develop evidence-based approaches from skilled professionals who share your passion for your subject area.\r\n\r\nAt the beginning of the course, you focus on developing your knowledge of learning and explore a range of evidence-based teaching and assessment theories and strategies, in addition to your subject knowledge and subject specific pedagogy. Throughout the course, you embed and refine your knowledge and skills, enhancing your own practice and subject expertise during school-based placements as well as developing your ability to reflect on your practice through action research.","interviewProcess":"\r\n","howSchoolPlacementsWork":"During the course you complete two professional placements and will gradually build up the number of hours you teach whilst observing and working alongside colleagues. You experience the life of a teacher by fully immersing yourself in the school environment.\r\n\r\nYou benefit from the support of a curriculum mentor and professional mentor on your placements who will model practice, give you feedback and work with you to set targets. Mentors are highly trained and effective educational practitioners and will provide you with information, advice, and guidance throughout the course.\r\n\r\nWe are partnered with a diverse range of schools and settings across the Tees Valley giving you contrasting experiences where possible.","status":1,"createdAt":"2021-10-04T08:23:42.054Z","updatedAt":"2021-10-04T13:51:43.261Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
