{"id":"0b60808b-ee0a-4c82-811e-05cc4d6e13d0","name":"Primary (5-11)","code":"AT23","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"531bd5bf-63c1-4a1f-9f6d-7c40536ec62e","name":"Main Site","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"a0dd345f-8a0e-4329-9048-6eb076ed0f1b","code":"1K2","name":"Bishop Challoner Training School"},"accreditedBody":{"id":"62d5803b-89ca-4e21-bb6f-5c74944c56ad","code":"B25","name":"Birmingham City University"},"profPost":"PG","english":"3","maths":"3","science":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":null,"aboutCourse":"This School Direct PGCE programme will give you the skills and understanding needed to successfully meet the needs of children in the classroom.\r\n\r\nThe setting of this course also provides you with the opportunities to understand the urban context and experience working with children from a wide range of social, economic and cultural backgrounds. While the PGCE is an academic qualification, the emphasis is very much on practical experience, with around two thirds of the course spent in school.\r\n\r\nYou will also learn by attending workshops and group discussions, but this course is practical and very hands-on in its approach.\r\n","interviewProcess":"You will be required to attend one interview. Interviews include:\r\n\r\n* exploration of curriculum knowledge\r\n* discussions about relevant experiences\r\n* a presentation or small teaching exercise to a whole class\r\n* written task\r\n\r\nWe also look for: \r\n\r\n* good communication skills\r\n* potential / suitability to be a good teacher\r\n* robustness to cope with the demands of the course\r\n\r\nPlease note: initially interviews will take place online this academic year.\r\n\r\n","howSchoolPlacementsWork":"The main placement school for an applicant is discussed at interview, so that individual requirements can be taken into account. With most of our schools being located in or near the Birmingham area, travel time is not usually a problem.\r\n\r\nWe understand that you will spend the first 5 weeks at University before joining your school.\r\n\r\nYou will be based at your main placement school for the majority of the programme except for a second complementary school placement which will take place in the Spring Term. The second placement school will be discussed with you and your school mentor before any decisions are made.\r\n","personalQualities":"Personal qualities we are looking for include:\r\n\r\n* energetic\r\n* good communicator\r\n* able to inspire and enthuse\r\n* good organiser\r\n* imaginative and creative\r\n* confident and resilient.\r\n","otherRequirements":"Applicants must meet the Department for Education’s Initial Teacher Training criteria, which means being medically fit, successfully completing an enhanced disclosure via the Disclosure and Barring Service (DBS) and satisfying any other safeguarding check required for your course.\r\n\r\nWhile not essential, you may wish to gain some school experience before attending interview.\r\n","status":2,"createdAt":"2021-07-06T10:54:54.649Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"Trainees on the salaried route will be paid on at least point 1 of the unqualified teacher scale, which in 2020/2021 is £18,169.\r\n\r\nYour school will pay the Birmingham City University tuition fees.\r\n\r\n"}
