{"id":"0e84ede6-688e-4406-bcb6-5944544ec1a3","name":"Art and Design","code":"35ZM","qualification":"pgce_with_qts","startDate":"2024-07-31T23:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"d461a678-3335-4ca2-9616-1dc479d31a49","code":"W1","name":"Art and design"}],"locations":[{"id":"531bd5bf-63c1-4a1f-9f6d-7c40536ec62e","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"a0dd345f-8a0e-4329-9048-6eb076ed0f1b","code":"1K2","name":"Bishop Challoner Training School"},"accreditedBody":{"id":"ef09ce50-ccfc-4346-a0ce-43e840153dab","code":"W20","name":"The University of Warwick"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Course aims:\r\n\r\n* to gain practical teaching experience in contrasting schools\r\n* to build confidence and help you reflect on your professional practice\r\n* to become an authority on the latest curriculum development, issues and innovations\r\n* to learn to manage pupils' behaviour and maintain a purposeful learning environment\r\n* to grow confidence in the latest technologies and develop multimedia resources\r\n* to leave with the skills, knowledge and experience needed to begin your teaching career by taking three core modules.\r\n\r\nThis will be through three core modules:\r\n\r\nSubject Studies: You will learn all aspects of how to teach your subject, including planning, teaching, assessment and classroom management.\r\n\r\nProfessional Studies: You will learn about working in classrooms and schools, and the broader context of teaching today.\r\n\r\nProfessional Practice: You will have opportunities for observation, practice and investigation in two contrasting schools.\r\n\r\nTrainees will spend 4 days per week in school with 1 day per week  being a training day. After the Summer half term, trainees will be in school 5 days per week.\r\n\r\nTraining days will mainly take place at the University of Warwick with some days being held at Bishop Challoner Catholic College.\r\n","interviewProcess":"Once an application has been submitted Alliance schools that have requested a trainee in a particular subject will decide if they want to interview. Please contact us to find out the latest list of schools with vacancies in particular subjects.\r\n\r\nIf more than one school wants to interview, the interview will be held at Bishop Challoner Catholic College and representatives from the interested schools will attend. When inviting applicants to interview they will be notified which schools will be represented on the interview panel.\r\n\r\nIf there is one school that wants to interview, the interview will be held at that school.\r\n\r\nIf the applicant is successful and several schools want to offer a place, the applicant can visit the schools and decide which school they prefer. This does not mean they have accepted a place at that school, it just means that they know that the Bishop Challoner offer is for that particular school.\r\n\r\nInterviews consist of:\r\n\r\n* a short teaching session\r\n* a written task\r\n* a formal interview.\r\n\r\nDetailed guidance will be provided about the interview process and what is expected when you are invited.\r\n","howSchoolPlacementsWork":"The main placement school for an applicant is discussed at interview, so that individual requirements can be taken into account. With most of our schools being located in or near the Birmingham area, travel time is not usually a problem.\r\n\r\nSuccessful applicants will know which school will be their main placement when they are offered the place.\r\n\r\nThe second school placement takes place in the first half of the Spring Term, and this will be discussed with the trainee and their school mentor before any decisions are made.\r\n\r\nTrainees are also required to spend one week (or equivalent) in a primary school.\r\n","personalQualities":"* energetic\r\n* good communicator\r\n* able to inspire and enthuse\r\n* good organiser\r\n* imaginative and creative\r\n* confident and resilient","otherRequirements":"Applicants must meet the Department for Education’s Initial Teacher Training criteria, which means being medically fit and successfully completing an enhanced disclosure via the Disclosure and Barring Service (DBS) and satisfying any other safeguarding checks required for this course.\r\n","status":1,"createdAt":"2021-07-06T10:54:53.601Z","updatedAt":"2021-10-04T06:06:27.966Z","canSponsorStudentVisa":"yes","cycle":"2024"}
