{"id":"1eae2798-e6b0-48eb-9160-6fd41151c129","name":"Biology","code":"E191","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"322cfc19-d51d-45db-91e3-bd7b4738470f","code":"C1","name":"Biology"}],"locations":[{"id":"531bd5bf-63c1-4a1f-9f6d-7c40536ec62e","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"a0dd345f-8a0e-4329-9048-6eb076ed0f1b","code":"1K2","name":"Bishop Challoner Training School"},"accreditedBody":{"id":"62d5803b-89ca-4e21-bb6f-5c74944c56ad","code":"B25","name":"Birmingham City University"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"With so many important careers in healthcare and science dependent on people with skills and knowledge in this area, your ability to get your students excited about biology is vital.\r\n\r\nThis course will give you the skills and understanding needed to successfully meet the needs of children in the classroom. You will explore, test and develop the links between science and biology in education theory and its practice.\r\n\r\nThe workshops and seminars facilitate a space for learners to conduct this, which is then supported by school placements.\r\n\r\nThis relationship, between theory and practice, alongside two contrasting school experiences, ensures that you are offered a well-rounded teacher education. \r\n\r\nYour course will feature a range of modules with support from colleagues in our Training School Alliance and experienced University tutors. So while the School Direct PGCE is an academic qualification, the emphasis is very much on practical experience.\r\n\r\nTrainees will spend 4 days per week in school, with 1 day per week being a training day. These training days will be held at either the University or Bishop Challoner Catholic College.\r\n\r\nBishop Challoner Catholic College is the Lead School for the Central Midlands Science Learning Partnership, allowing schools to access the high quality materials and courses provided.\r\n","interviewProcess":"You will be required to attend one interview. Interviews include:\r\n\r\n* exploration of curriculum knowledge\r\n* discussions about relevant experiences\r\n* a presentation or small teaching exercise \r\n* written task\r\n\r\nWe also look for: \r\n\r\n* good communication skills\r\n* potential / suitability to be a good teacher\r\n* robustness to cope with the demands of the course\r\n\r\n","howSchoolPlacementsWork":"The main placement school for an applicant is discussed at interview, so that individual requirements can be taken into account. With most of our schools being located in or near the Birmingham area, travel time is not usually a problem.\r\n\r\nYou will be based at your main placement school for the whole of the programme except for a second complementary school placement which will take place in the first half of the Spring Term. The second placement school will be discussed with you and your school mentor before any decisions are made.","personalQualities":"Personal qualities we are looking for include:\r\n\r\n* energetic\r\n* good communicator\r\n* able to inspire and enthuse\r\n* good organiser\r\n* imaginative and creative\r\n* confident and resilient.\r\n","otherRequirements":"Applicants must meet the Department for Education’s Initial Teacher Training criteria, which means being medically fit and successfully completing an enhanced disclosure via the Disclosure and Barring Service (DBS) and satisfying any other safeguarding checks required for this course.\r\n\r\n","status":1,"createdAt":"2021-07-06T10:54:54.783Z","updatedAt":"2021-10-03T22:10:04.017Z","canSponsorStudentVisa":"yes","cycle":"2024"}
