{"id":"222b85cb-89c2-459c-8803-3b701dec830b","name":"Primary (Physical Education)","code":"35ZD","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"5ae4c96e-1da2-4831-91a3-64439b606fed","code":"06","name":"Primary with physical education"}],"locations":[{"id":"531bd5bf-63c1-4a1f-9f6d-7c40536ec62e","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"a0dd345f-8a0e-4329-9048-6eb076ed0f1b","code":"1K2","name":"Bishop Challoner Training School"},"accreditedBody":{"id":"4aa8177a-27b8-4566-b77a-c45515e46739","code":"N36","name":"Newman University"},"profPost":"PG","degreeGrade":"1","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"This Primary (PE Specialism) programme is designed to:\r\n\r\n* train specialist primary trainees to teach the subject of PE across the key stages alongside the ability to deliver core curriculum English, Maths and Science\r\n* provide a skill set necessary to deliver effective CPD in PE to non-specialists\r\n* enable trainees to engage in scholarly activity related to PE.\r\n\r\nThe overall programme is designed to produce highly effective and critically reflective primary PE specialist teachers. The programme is structured to enable students to develop the relevant knowledge, understanding and skills to enable them to make informed professional decisions to enable pupils to enjoy learning and achieve high standards in PE.\r\n\r\nThere will be extensive training in English, mathematics, science and primary practice, with an equal balance between physical education and the core aspects of the primary curriculum.\r\n\r\nThe programme includes two assessments giving you 60 credits (PGCE) at Masters level which you can use towards further qualification.\r\n\r\nThe programme includes sessions to enhance trainees' existing skills in a range of sports, in partnership with recognised sports bodes, such as the Lawn Tennis Association, Rugby Football Union, Football Association, England and Wales Cricket Board.\r\n\r\nTraining sessions and Masters assignment sessions are held at Newman University and Bishop Challoner Catholic College during the year. Trainees also attend training provided by their own school.\r\n\r\n\r\n\r\n\r\n\r\n","interviewProcess":"The interview could possibly take a full day and will take place at Bishop Challoner Catholic College or in a Primary School in our Alliance.\r\n\r\nInterviews consist of:\r\n\r\n*  a short teaching session\r\n* a written task\r\n* a formal interview.\r\n\r\n\r\n\r\n","howSchoolPlacementsWork":"The main placement school for an applicant is discussed at interview, so that individual requirements can be taken into account. With most of our schools being located in or near the Birmingham area, travel time is not usually a problem.\r\n\r\nThe second school placement takes place in the Spring Term, and this will always be discussed with the trainee and their school mentor before any decisions are made.\r\n","personalQualities":"* energetic\r\n* good communicator\r\n* able to inspire and enthuse\r\n* good organiser\r\n*imaginative and creative\r\n*confident and resilient","otherRequirements":"You have demonstrable skills in a particular sport or sports, and be able to demonstrate sporting excellence at a high level.\r\n\r\nCoaching awards are desirable, but there will be opportunities to take these during the training year.","status":1,"createdAt":"2021-07-06T10:54:53.565Z","updatedAt":"2021-10-04T06:49:31.297Z","canSponsorStudentVisa":"no","cycle":"2024"}
