{"id":"40367765-7fc9-4c9f-8b27-09425122b48e","name":"Physical Education","code":"E131","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"74d64a54-5e34-4590-b6c7-528dd0cf26fe","code":"C6","name":"Physical education"}],"locations":[{"id":"531bd5bf-63c1-4a1f-9f6d-7c40536ec62e","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"a0dd345f-8a0e-4329-9048-6eb076ed0f1b","code":"1K2","name":"Bishop Challoner Training School"},"accreditedBody":{"id":"62d5803b-89ca-4e21-bb6f-5c74944c56ad","code":"B25","name":"Birmingham City University"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"If this is a subject you are knowledgeable and passionate about, our School Direct PGCE Physical Education progranmme will allow you to become a highly skilled graduate teacher with an in-depth knowledge and understanding of teaching and learning, enabling you to demonstrate the highest levels of professional practice.\r\n\r\nYou will be trained to become a confident and reflective practitioner, and will be able to teach contemporary methods and practices. You will learn techniques to inspire students with Physical Education, making it enjoyable for all and ensuring they are equipped with skills and understanding they will need for a positive approach to physical activity in the future.\r\n\r\nCentral to the curriculum is the study of PE pedagogy and professional practice, which you will access through a synthesis of practical workshops, lectures, seminar groups and individual study.\r\n\r\nCurriculum workshops are a key element of your course. Dedicated PE lecturers and teachers deliver these in our specialist education classrooms and lecture theatres. The workshops enable you to experience and develop your understanding of subject pedagogy through topics such as: Physical literacy, growth mindset through PE, dance in the curriculum, gymnastics, invasion games, net and wall games, target games and athletics, health and safety, as well as Key Stage 3 National Curriculum topics, GCSE and A Level PE topics.\r\n\r\nYour course will feature a range of modules with support from colleagues in our Training School Alliance and experienced University tutors. So while the School Direct PGCE is an academic qualification, the emphasis is very much on practical experience.\r\n\r\nTrainees will spend 4 days per week in school, with 1 day per week being a training day. These training days will be held at either the University or Bishop Challoner Catholic College.\r\n\r\n","interviewProcess":"You will be required to attend one interview. Interviews include:\r\n\r\n* exploration of curriculum knowledge\r\n* discussions about relevant experiences\r\n* a presentation or small teaching exercise \r\n* written task\r\n\r\nWe also look for: \r\n\r\n* good communication skills\r\n* potential / suitability to be a good teacher\r\n* robustness to cope with the demands of the course\r\n\r\n","howSchoolPlacementsWork":"The main placement school for an applicant is discussed at interview, so that individual requirements can be taken into account. With most of our schools being located in or near the Birmingham area, travel time is not usually a problem.\r\n\r\nYou will be based at your main placement school for the whole of the programme except for a second complementary school placement which will take place in the first half of the Spring Term. The second placement school will be discussed with you and your school mentor before any decisions are made.\r\n","personalQualities":"Personal qualities we are looking for include:\r\n\r\n* energetic\r\n* good communicator\r\n* able to inspire and enthuse\r\n* good organiser\r\n* imaginative and creative\r\n* confident and resilient.\r\n","otherRequirements":"Applicants must meet the Department for Education’s Initial Teacher Training criteria, which means being medically fit, successfully completing an enhanced disclosure via the Disclosure and Barring Service (DBS) and satisfying all other safeguarding checks required for this course.\r\n\r\n","status":1,"createdAt":"2021-07-06T10:54:54.750Z","updatedAt":"2021-10-03T22:42:18.612Z","canSponsorStudentVisa":"yes","cycle":"2024"}
