{"id":"4cf72b51-5e86-4dae-8608-a55cbca130e3","name":"Geography","code":"E222","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3f47e67b-7fa5-4947-a5a0-74d528cd2a87","code":"F8","name":"Geography"}],"locations":[{"id":"531bd5bf-63c1-4a1f-9f6d-7c40536ec62e","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"a0dd345f-8a0e-4329-9048-6eb076ed0f1b","code":"1K2","name":"Bishop Challoner Training School"},"accreditedBody":{"id":"62d5803b-89ca-4e21-bb6f-5c74944c56ad","code":"B25","name":"Birmingham City University"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Geography has a key role to play in enabling young people to make sense of, understand and make a positive contribution to planet Earth. Teaching will allow you to bring to life the physical and human world that your pupils live in.\r\n\r\nYou will introduce young people in an engaging and stimulating manner to the world that they inhabit and to geography in all its forms – including physical, human and environmental.\r\n\r\nYou will explore the skills and knowledge that geography offers at secondary education level and train to become a confident, dynamic and creative teacher with the ability to make geographical thinking accessible to all. You will discover how pupils learn and explore ways in which you can plan activities that will ensure they progress and develop their geographical minds.\r\n\r\nExploring an inclusive and rich approach towards geography you will discover and learn how to make the geography curriculum come alive in a way that will promote geographical thinking. You will learn how to\r\ninspire and enthuse your pupils by taking them on exciting and stimulating geographical journeys. You will be able to achieve this by developing your knowledge and understanding of a range of geographical pedagogies. These can be used to help pupils to become more self-confident and critically informed about the planet that they inhabit.\r\n\r\nThis course has links with key subject associations, the Royal Geographical Society and the Geographical Association.\r\n\r\nAnother key feature of the course is its fieldwork component which includes an in depth consideration of how to devise and plan local urban fieldwork and residential fieldwork with a rural and physical geography focus.\r\n\r\nThis School Direct PGCE programme will feature a range of modules and the opportunity to get plenty of hands-on practice with support from colleagues in our Training School Alliance and experienced University tutors. \r\n\r\nTrainees will spend 4 days per week in school, with 1 day per week being a training day. These training days will be held at either the University or Bishop Challoner Catholic College.\r\n","interviewProcess":"You will be required to attend one interview. Interviews include:\r\n\r\n* exploration of curriculum knowledge\r\n* discussions about relevant experiences\r\n* a presentation or small teaching exercise \r\n* written task\r\n\r\nWe also look for: \r\n\r\n* good communication skills\r\n* potential / suitability to be a good teacher\r\n* robustness to cope with the demands of the course\r\n\r\n","howSchoolPlacementsWork":"The main placement school for an applicant is discussed at interview, so that individual requirements can be taken into account. With most of our schools being located in or near the Birmingham area, travel time is not usually a problem.\r\n\r\nYou will be based at your main placement school for the whole of the programme except for a second complementary school placement which will take place in the first half of the Spring Term. The second placement school will be discussed with you and your school mentor before any decisions are made.\r\n","personalQualities":"Personal qualities we are looking for include:\r\n\r\n* energetic\r\n* good communicator\r\n* able to inspire and enthuse\r\n* good organiser\r\n* imaginative and creative\r\n* confident and resilient.\r\n\r\n","otherRequirements":"Applicants must meet the Department for Education’s Initial Teacher Training criteria, which means being medically fit and successfully completing an enhanced disclosure via the Disclosure and Barring Service (DBS) and satisfy all other safeguarding checks required for your course.\r\n\r\n","status":1,"createdAt":"2021-07-06T10:54:54.849Z","updatedAt":"2021-10-03T22:25:27.340Z","canSponsorStudentVisa":"yes","cycle":"2024"}
