{"id":"5c18846a-a371-4779-8973-f980f184c61d","name":"Modern languages","code":"AE71","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"ce8523ef-9236-4cd9-b260-d826c7a521b3","code":"ML","name":"Modern Languages"},{"id":"4608e5e3-2a1a-48a1-8236-56c7af5a139d","code":"24","name":"Modern languages (other)"}],"locations":[{"id":"531bd5bf-63c1-4a1f-9f6d-7c40536ec62e","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"a0dd345f-8a0e-4329-9048-6eb076ed0f1b","code":"1K2","name":"Bishop Challoner Training School"},"accreditedBody":{"id":"62d5803b-89ca-4e21-bb6f-5c74944c56ad","code":"B25","name":"Birmingham City University"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Our School Direct PGCE Modern Foreign Languages programme will introduce you to the teaching of languages in secondary schools. The course lays emphasis on language as a form of communication and on the value of language learning as a way of understanding other cultures and backgrounds.\r\n\r\nYou will develop a range of skills to enthuse youngsters and support them in achieving their linguistic potential, and learn about the importance of developing cultural understanding and the impact this can have in shaping young people’s worldviews. \r\n\r\nThe three most commonly taught languages in our Alliance Schools are French, German and Spanish. \r\n\r\nYour course will feature a range of modules with support from colleagues in our Training School Alliance and experienced University tutors. So while the School Direct PGCE is an academic qualification, the emphasis is very much on practical experience.\r\n\r\nTrainees will spend 4 days per week in school, with 1 day per week being a training day. These training days will be held at either the University or Bishop Challoner Catholic College.","interviewProcess":"You will be required to attend one interview. Interviews include:\r\n\r\n* exploration of curriculum knowledge\r\n* discussions about relevant experiences\r\n* a presentation or small teaching exercise \r\n* written task\r\n\r\nWe also look for: \r\n\r\n* good communication skills\r\n* potential / suitability to be a good teacher\r\n* robustness to cope with the demands of the course\r\n\r\n","howSchoolPlacementsWork":"The main placement school for an applicant is discussed at interview, so that individual requirements can be taken into account. With most of our schools being located in or near the Birmingham area, travel time is not usually a problem.\r\n\r\nYou will be based at your main placement school for the whole of the programme except for a second complementary school placement which will take place in the first half of the Spring Term. The second placement school will be discussed with you and your school mentor before any decisions are made.\r\n","personalQualities":"Personal qualities we are looking for include:\r\n\r\n* energetic\r\n* good communicator\r\n* able to inspire and enthuse\r\n* good organiser\r\n* imaginative and creative\r\n* confident and resilient.\r\n\r\n","otherRequirements":"Applicants must meet the Department for Education’s Initial Teacher Training criteria, which means being medically fit and successfully completing an enhanced disclosure via the Disclosure and Barring Service (DBS) and satisfying any other safeguarding checks required for this course.\r\n\r\n","status":1,"createdAt":"2021-07-12T13:49:19.839Z","updatedAt":"2021-10-03T22:39:09.091Z","canSponsorStudentVisa":"yes","cycle":"2024"}
