{"id":"7b5f21cd-230d-4bf6-b35f-d3ad1bc435d3","name":"Psychology","code":"AE69","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"14_to_19","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"1878e739-30bb-4de9-841e-42dacfb1fa0c","code":"C8","name":"Psychology"}],"locations":[{"id":"531bd5bf-63c1-4a1f-9f6d-7c40536ec62e","name":"Main Site","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"a0dd345f-8a0e-4329-9048-6eb076ed0f1b","code":"1K2","name":"Bishop Challoner Training School"},"accreditedBody":{"id":"62d5803b-89ca-4e21-bb6f-5c74944c56ad","code":"B25","name":"Birmingham City University"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"This School Direct PGCE programme prepares you to teach across the 14-19 age range, helping you to develop the professional skills and attitudes to teach Psychology in schools and colleges, as part of both academic and vocational courses.\r\n\r\nYour course will feature a range of modules with support from colleagues in our Training School Alliance and experienced University tutors. So while the School Direct PGCE is an academic qualification, the emphasis is very much on practical experience.\r\n\r\nPsychology is mainly a KS5 subject. You are required to teach across two key stages, so you may be asked to teach some Religious Studies, Health and Social Care, PSHE or some Social Studies lessons at KS4.\r\n\r\nTrainees will spend 4 days per week in school, with 1 day per week being a training day. These training days will be held at either the University or Bishop Challoner Catholic College.\r\n","interviewProcess":"You will be required to attend one interview. Interviews include:\r\n\r\n* exploration of curriculum knowledge\r\n* discussions about relevant experiences\r\n* a presentation or small teaching exercise \r\n* written task\r\n\r\nWe also look for: \r\n\r\n* good communication skills\r\n* potential / suitability to be a good teacher\r\n* robustness to cope with the demands of the course\r\n\r\n","howSchoolPlacementsWork":"The main placement school for an applicant is discussed at interview, so that individual requirements can be taken into account. With most of our schools being located in or near the Birmingham area, travel time is not usually a problem.\r\n\r\nYou will be based at your main placement school for the whole of the programme except for a second complementary school placement which will take place in the first half of the Spring Term. The second placement school will be discussed with you and your school mentor before any decisions are made.\r\n\r\n","personalQualities":"Personal qualities we are looking for include:\r\n\r\n* energetic\r\n* good communicator\r\n* able to inspire and enthuse\r\n* good organiser\r\n* imaginative and creative\r\n* confident and resilient.\r\n\r\n","otherRequirements":"Applicants must meet the Department for Education’s Initial Teacher Training criteria, which means being medically fit and successfully completing an enhanced disclosure via the Disclosure and Barring Service (DBS) and satisfying any other safeguarding checks required for this course.\r\new.\r\n\r\n","status":1,"createdAt":"2021-07-06T10:54:54.414Z","updatedAt":"2021-10-03T22:45:21.912Z","canSponsorStudentVisa":"yes","cycle":"2024"}
