{"id":"811a2eaa-871a-4dbf-a7ac-485761c6dc13","name":"English","code":"E121","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3aed1aa8-ae46-4b68-92bb-a6cc20655c59","code":"Q3","name":"English"}],"locations":[{"id":"531bd5bf-63c1-4a1f-9f6d-7c40536ec62e","name":"Main Site","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"a0dd345f-8a0e-4329-9048-6eb076ed0f1b","code":"1K2","name":"Bishop Challoner Training School"},"accreditedBody":{"id":"62d5803b-89ca-4e21-bb6f-5c74944c56ad","code":"B25","name":"Birmingham City University"},"profPost":"PG","english":"3","maths":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":null,"aboutCourse":"This course will develop your skills so you can help pupils express themselves, to become critical thinkers and develop the vital skills they need to succeed, not just in English, but also in other areas of their education and beyond. Our aim is to ensure you are able to deliver the wide-ranging curriculum covered under English, including Language, Literature and supporting studies in Drama and Media education.\r\n\r\nYou will learn the teaching methods and strategies that will help your classes develop their reading, writing, speaking and listening skills so they become effective communicators.\r\n\r\nYou will explore, test and develop the links between English in education theory and its practice. This relationship, between theory and practice, ensures that you are offered a well-rounded teacher education. \r\n\r\nThis School Direct PGCE programme will feature a range of modules supported by colleagues in our Teaching School Alliance and experienced University tutors.\r\n\r\nTrainees will spend 4 days per week in school, with 1 day per week being a training day. These training days will be held at either the University or Bishop Challoner Catholic College.\r\n","interviewProcess":"You will be required to attend one interview. Interviews include:\r\n\r\n* exploration of curriculum knowledge\r\n* discussions about relevant experiences\r\n* a presentation or small teaching exercise \r\n* written task\r\n\r\nWe also look for: \r\n\r\n* good communication skills\r\n* potential / suitability to be a good teacher\r\n* robustness to cope with the demands of the course\r\n\r\nPlease note: initially interviews will be held online this academic year.\r\n","howSchoolPlacementsWork":"The main placement school for an applicant is discussed at interview, so that individual requirements can be taken into account. With most of our schools being located in or near the Birmingham area, travel time is not usually a problem.\r\n\r\nYou will be based at your main placement school for the whole of the programme except for a second complementary school placement which will take place in the first half of the Spring Term. The second placement school will be discussed with you and your school mentor before any decisions are made.\r\n\r\n","personalQualities":"Personal qualities we are looking for include:\r\n\r\n* energetic\r\n* good communicator\r\n* able to inspire and enthuse\r\n* good organiser\r\n* imaginative and creative\r\n* confident and resilient.\r\n","otherRequirements":"Applicants must meet the Department for Education’s Initial Teacher Training criteria, which means being medically fit and successfully completing an enhanced disclosure via the Disclosure and Barring Service (DBS) and satisfying any other safeguarding checks required for this course.","status":2,"createdAt":"2021-07-06T10:54:54.714Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"Trainees on the salaried route will be paid on at least point 1 of the unqualified teacher scale, which in 2020/2021 is £18,169.\r\n\r\nYour school will pay the Birmingham City University tuition fees.\r\n"}
