{"id":"d8cb5c33-7c83-4b4f-8a35-f5ecc2d7ee68","name":"Art & Design","code":"E989","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"d461a678-3335-4ca2-9616-1dc479d31a49","code":"W1","name":"Art and design"}],"locations":[{"id":"531bd5bf-63c1-4a1f-9f6d-7c40536ec62e","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"a0dd345f-8a0e-4329-9048-6eb076ed0f1b","code":"1K2","name":"Bishop Challoner Training School"},"accreditedBody":{"id":"62d5803b-89ca-4e21-bb6f-5c74944c56ad","code":"B25","name":"Birmingham City University"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"This course will enable you to use your degree level skills in the teaching of art and design so that the young people you work with can explore, understand and challenge the visual culture that surrounds them.\r\n\r\nWe believe that art and design is a crucial element in the education of all pupils, and will work with you to enable you to become the inspirational secondary school teacher that today’s young people deserve.\r\n\r\nOur course provides you with the knowledge and understanding that will enable your current creative skills to grow into exciting and engaging teaching for the classroom. \r\n\r\nThe course is a practice-based programme that will fully support you into becoming a confident, dynamic and creative teacher committed to making art and design accessible for all.\r\n\r\nCentral to the curriculum is the study of art and design pedagogy and professional practice, which you will access through a synthesis of creative practical workshops, lectures, seminar groups and individual study.\r\n\r\nCurriculum workshops are a key element of your course. Dedicated, full-time art and design lecturers and teachers deliver these in our fully equipped specialist art and design studios. The workshops enable you to experience a range of practical work in key specialisms such as digital media, contemporary art including installation, drawing, printmaking, ceramics, mixed media, and craft media. We also work with the Education Curators in leading regional galleries that have included IKON Gallery, New Art Gallery Walsall, BMAG and Eastside Projects.\r\n\r\nTrainees will spend 4 days per week in school, with 1 day per week being a training day. These training days will be held at either the University or Bishop Challoner Catholic College.\r\n","interviewProcess":"You will be required to attend one interview. Interviews include:\r\n\r\n* exploration of curriculum knowledge\r\n* discussions about relevant experiences\r\n* a presentation or small teaching exercise \r\n* written task\r\n\r\nWe also look for: \r\n\r\n* good communication skills\r\n* potential / suitability to be a good teacher\r\n* robustness to cope with the demands of the course\r\n\r\nPlease note: initially interviews will be held online this academic year.\r\n","howSchoolPlacementsWork":"The main placement school for an applicant is discussed at interview so that individual requirements can be taken into account. With most of our schools being located in or near the Birmingham area, travel time is usually not a problem.\r\n\r\nYou will be based at your main placement school for the whole of the programme except for a second complementary school placement which will take place in the first half of the Spring Term. The second placement school will be discussed with you and your school mentor before any decisions are made.\r\n","personalQualities":"Personal qualities we are looking for include:\r\n\r\n* energetic\r\n* good communicator\r\n* able to inspire and enthuse\r\n* good organiser\r\n* imaginative and creative\r\n* confident and resilient.\r\n","otherRequirements":"Applicants must meet the Department for Education’s Initial Teacher Training criteria, which means being medically fit and successfully completing an enhanced disclosure via the Disclosure and Barring Service (DBS) and satisfying any other safeguarding checks required for this course.\r\n\r\n","status":1,"createdAt":"2021-07-06T10:54:55.368Z","updatedAt":"2021-10-03T22:04:19.056Z","canSponsorStudentVisa":"yes","cycle":"2024"}
