{"id":"e264943e-90fd-4e57-a45d-0eb3acec5102","name":"Primary","code":"35Z3","qualification":"pgce_with_qts","startDate":"2024-07-31T23:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"531bd5bf-63c1-4a1f-9f6d-7c40536ec62e","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"a0dd345f-8a0e-4329-9048-6eb076ed0f1b","code":"1K2","name":"Bishop Challoner Training School"},"accreditedBody":{"id":"ef09ce50-ccfc-4346-a0ce-43e840153dab","code":"W20","name":"The University of Warwick"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Course aims:\r\n\r\n*  To gain practical teaching experience in contrasting schools\r\n* To build your confidence and help you reflect on and evaluate your professional practice\r\n* To become an authority on the latest curriculum developments, issues and innovations\r\n* To grow confident in the latest technologies and develop multimedia resources\r\n* To learn to teach phonics, early reading, writing, and early mathematics, as well as foundation subjects\r\n* Assess pupils effectively, promoting pupil progress across the curriculum, and manage their behaviour to create a strong learning environment\r\n* To leave with the skills, knowledge and experience needed to begin your teaching career by taking three core modules\r\n\r\nSubject Studies: You will cover core subjects (English, Mathematics and Science) and non-core (Foundation) subjects. Foundation subjects are covered through 2 \"taster” sessions for each subject: Art and Design, Computing, Design and Technology, Geography/History, Music, Modern Foreign Languages (MFL), Physical Education (PE), Religious Education (RE) and PSHE.\r\n\r\nProfessional Studies: You will develop a good understanding of the key factors in successful learning and teaching. You will address central issues including planning, teaching, assessing and behaviour management.\r\n\r\nProfessional Practice: You will have opportunities for observation, practice and investigation in two contrasting schools. You will develop an awareness of your professional development, reflect on progress on school placements and set targets for successful completion of the programme. \r\n\r\nYou will also be asked to choose a specialism: Early Years, Special Educational Needs, English, Mathematics or Science. The specialism is a unique opportunity to enhance your subject knowledge and skills in a critical area of Primary education.\r\n\r\nTrainees will spend 4 days per week in school with 1 day per week being a training day. After the Summer half term, trainees will be in school 5 days per week.\r\n\r\nTraining days will mainly take place at the University of Warwick with some days being held at Bishop Challoner Catholic College.\r\n","interviewProcess":"Once an application has been submitted Alliance schools that have requested a trainee will decide if they want to interview. Please contact us  to find out the latest list of schools with vacancies.\r\n\r\nIf more than one school wants to interview, the interview will probably be held at Bishop Challoner and representatives from the interested schools will attend. When inviting applicants to interview they will be notified which schools will be represented on the interview panel.\r\n\r\nIf there is one school that wants to interview, the interview will be held at that school.\r\n\r\nIf the applicant is successful and several schools want to offer a place, the applicant can visit the schools and decide which school they prefer. This does not mean they have accepted a place at that school, it just means that they know that the Bishop Challoner is for that particular school.\r\n\r\nInterviews consist of:\r\n\r\n* a short teaching session\r\n* a written task\r\n* a formal interview\r\n\r\n","howSchoolPlacementsWork":"The main placement school for an applicant is discussed at interview, so that individual requirements can be taken into account. With most of our schools being located in or near the Birmingham area, travel time is not usually a problem.\r\n\r\nSuccessful applicants will always know which school will be their main placement when they are offered the place.\r\n\r\nThe second school placement takes place in the Spring Term, and this will always be discussed with the trainee and their school mentor before any decisions are made.\r\n\r\n","personalQualities":"* energetic\r\n* good communicator\r\n* able to inspire and enthuse\r\n* good organiser\r\n* imaginative and creative\r\n* confident and resilient","otherRequirements":"Applicants must meet the Department for Education’s Initial Teacher Training criteria, which means being medically fit and successfully completing an enhanced disclosure via the Disclosure and Barring Service (DBS) and satisfying any other safeguarding checks required for this course.\r\n\r\n","status":1,"createdAt":"2021-07-06T10:54:53.531Z","updatedAt":"2021-10-04T06:46:46.782Z","canSponsorStudentVisa":"yes","cycle":"2024"}
