{"id":"f8d7b034-5c8b-44e3-8a7c-8bc4dc3a9058","name":"Music","code":"E929","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"24311bef-8673-41fb-933c-53f887fb6976","code":"W3","name":"Music"}],"locations":[{"id":"531bd5bf-63c1-4a1f-9f6d-7c40536ec62e","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"a0dd345f-8a0e-4329-9048-6eb076ed0f1b","code":"1K2","name":"Bishop Challoner Training School"},"accreditedBody":{"id":"62d5803b-89ca-4e21-bb6f-5c74944c56ad","code":"B25","name":"Birmingham City University"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"You will explore the skills and knowledge that music as an art form offers at secondary education level; and train to become a confident, dynamic and creative teacher with the ability to make music accessible to all. You will discover how pupils learn and explore ways in which you can plan musical activities that will ensure they progress and develop their musicality.\r\n\r\nExploring an inclusive and rich approach towards music, you will prioritise active music making to promote musical thinking and learn how to inspire and enthuse your pupils by taking them on an exciting and stimulating musical journey.\r\n\r\nTechniques used link many different forms of music and music making. These can be used to help pupils to become more self-confident, informed and culturally aware.\r\n\r\nThis course has strong links with local musical organisations such as Birmingham Music Service, the largest Music Service in the country. The course provides the opportunity to experience music education from a variety of perspectives, including organisations that form part of the Birmingham Hub for Music Education like Birmingham Contemporary Music Group (BCMG) and mac Birmingham.\r\n\r\nA key feature of the course is how we promote technology enhanced learning both in terms of developing beginning teachers and also how music technology can support teaching and learning in schools.\r\n\r\nYour course will feature a range of modules with support from colleagues in our Training School Alliance and experienced University tutors. So while the School Direct PGCE is an academic qualification, the emphasis is very much on practical experience.\r\n\r\nTrainees will spend 4 days per week in school, with 1 day per week being a training day. These training days will be held at either the University or Bishop Challoner Catholic College.\r\n\r\n\r\n","interviewProcess":"You will be required to attend one interview. Interviews include:\r\n\r\n* exploration of curriculum knowledge\r\n* discussions about relevant experiences\r\n* a presentation or small teaching exercise \r\n* written task\r\n\r\nWe also look for: \r\n\r\n* good communication skills\r\n* potential / suitability to be a good teacher\r\n* robustness to cope with the demands of the course\r\n\r\n","howSchoolPlacementsWork":"The main placement school for an applicant is discussed at interview, so that individual requirements can be taken into account. With most of our schools being located in or near the Birmingham area, travel time is not usually a problem.\r\n\r\nYou will be based at your main placement school for the whole of the programme except for a second complementary school placement which will take place in the first half of the Spring Term. The second placement school will be discussed with you and your school mentor before any decisions are made.\r\n\r\n","personalQualities":"Personal qualities we are looking for include:\r\n\r\n* energetic\r\n* good communicator\r\n* able to inspire and enthuse\r\n* good organiser\r\n* imaginative and creative\r\n* confident and resilient.\r\n","otherRequirements":"Applicants must meet the Department for Education’s Initial Teacher Training criteria, which means being medically fit and successfully completing an enhanced disclosure via the Disclosure and Barring Service (DBS) and satisfying any other safeguarding checks required for this course.\r\n","status":1,"createdAt":"2021-07-06T10:54:55.337Z","updatedAt":"2021-10-03T22:40:49.047Z","canSponsorStudentVisa":"yes","cycle":"2024"}
