{"id":"17d53b01-d9af-4bba-86cb-303d1ff0674a","name":"Primary","code":"2XCD","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"6bc62555-c38c-4b2b-9da0-c798563d7e3b","name":"Bishop Grosseteste University","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"eb1ae478-8ebc-4ef4-a186-22b08535a802","code":"1XV","name":"Hampton Hargate Primary School"},"accreditedBody":{"id":"1d95b6cb-0e08-4485-848a-0e304d71102a","code":"B38","name":"Bishop Grosseteste University"},"profPost":"BO","degreeGrade":"1","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"For details of the equivalencies accepted, please visit the BGU website using the below link:\nhttps://www.bishopg.ac.uk/apply-now/gcses-equivalency","courseLength":"OneYear","feesUK":9250,"feesInternational":12500,"feeDetails":"[Find more info about fees and funding on our website](https://www.bishopg.ac.uk/fees-funding/) ","financialSupport":"[Find more info about financial support on our website](https://www.bishopg.ac.uk/fees-funding/)\r\n","aboutCourse":"Aspiring teachers on our School Direct programme have the opportunity to work and train within an alliance with diversity at its core. Our alliance of schools is dedicated to making a difference to the lives of some of the most disadvantaged young people in the city. \r\nThis full-time course is for one year with 120 days in school and 60 days training. School placements are carefully structured to ensure gradual development of your confidence as an effective teacher through building up experiences by working with other trainees, link tutors and teachers. \r\n\r\nBishop Grosseteste University Ofsted Report (2010) shows that we are highly successful and that we have 'High quality trainees with the potential to be good or better teachers'. Our trainees' strengths include their: \r\n* self-motivation in identifying and securing their own professional development \r\n* well-developed personal qualities, which allow them to establish productive relationships with staff and pupils, and create a good climate for learning in the classroom  \r\n* professional attributes and personal qualities, including their commitment and self-motivation in relation to their own professional development. \r\nSpecial Features\r\nAt present you register for the course at Post Graduate level, gaining 60 masters credits (level 7) or you can gain a professional graduate qualification with either 60 credits at level 6 or 30 credits at level 6 and 30 at level 7. \r\nThe modules relate to the professional role of the teacher, the need to be a reflective practitioner, to developing your own knowledge of subjects and areas taught within primary schools and early years setting and how you teach to support children in effective learning. \r\nThe course will include lectures, seminars, workshops, Independent Study, tutorials, school-based training and will recommend you for Qualified Teacher Status (QTS). The University-based sessions are very much a starting point for the training undertaken in schools through observation and working alongside experienced teachers. \r\nAssessment\r\nWe offer a mix of lectures, seminars, tutorials, practical workshops independent study and school-based training. Assessments include written assignments, group and individual presentations, ICT based assessment, peer assessment and practical teaching in partnership with schools. \r\n","interviewProcess":"What we are looking for - Qualities of a trainee\r\nWe are looking for someone who has a love of learning and who wishes to ensure that others do too. \r\nBesides academic qualifications, we are looking for a confident communicator who has a passion for learning. Someone who is well organized and has the ability and desire to become a team player. Your interpersonal skills are important as is your curriculum knowledge. We want to work with people who want to make a difference in individuals' lives. \r\nSelection process\r\nWe will invite you to one of our schools and during the time you are with us, you will be asked to complete a number of tasks. You will meet with students and staff to discuss topical issues. The purpose of the day is for us to get to know you and for you to get to know us. Once the interview has taken place the panel will discuss how they can best support you in becoming an outstanding teacher and which one of our schools is best placed to help you achieve. \r\nThere will be a pre-course task that will enable you to be prepared for your first placement school. \r\n[Find out more on our website](https://www.bishopg.ac.uk/admissions-your-interviews/)\r\n\r\n\r\n","howSchoolPlacementsWork":"The full-time course is for one year with a minimum of  120 days in school and 60 days of training. School placements are carefully structured to ensure gradual development of your confidence as an effective teacher through building up experiences by working with other trainees, link tutors and teachers. \r\nPlacements begin in the autumn Term. The spring and summer term placements follow with you taking the lead within the classroom across core and foundation subjects. You will also undertake an enrichment placement in key stage three and early years.\r\nWhilst on placement you will work closely with your School Based Mentor(SBM). Your SBM will observe your practice throughout the week and will also meet with you weekly to enable you to identify targets to further develop your professional practice. \r\nYou will also attend one afternoon a week at a local training session where senior staff will work with you and help you develop your classroom practice.\r\n[Find out more on our website]( https://www.bishopg.ac.uk/course/pgcesecart/) \r\n","personalQualities":"Qualities of a trainee\r\nWe are looking for someone who has a love of learning and who wishes to ensure that others do too. \r\nBesides academic qualifications we are looking for a confident communicator who has a passion for learning; someone who is well organized and has the ability and desire to become a team player. Your interpersonal skills are important as is your curriculum knowledge. We want to work with people who want to make a difference to individuals' lives.","otherRequirements":"[Find out more on our website](https://www.bishopg.ac.uk/course/pgcesecart/)","status":1,"createdAt":"2021-07-06T10:48:04.609Z","updatedAt":"2021-07-09T14:08:32.694Z","canSponsorStudentVisa":"yes","cycle":"2024"}
