{"id":"3ac99da9-5dbd-4a14-8270-f7a34003a13b","name":"Primary","code":"38TG","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"6bc62555-c38c-4b2b-9da0-c798563d7e3b","name":"Bishop Grosseteste University","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"eb1ae478-8ebc-4ef4-a186-22b08535a802","code":"1XV","name":"Hampton Hargate Primary School"},"accreditedBody":{"id":"1d95b6cb-0e08-4485-848a-0e304d71102a","code":"B38","name":"Bishop Grosseteste University"},"profPost":"BO","degreeGrade":"1","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"For details of the equivalencies accepted, please visit the BGU website using the below link:\nhttps://www.bishopg.ac.uk/apply-now/gcses-equivalency","courseLength":"OneYear","aboutCourse":"Trainees are placed in their host school from the start of the year and typically spend six weeks in a second school to ensure a breadth of experience. Complementing the programme of training sessions at Bishop Grosseteste University, we draw on the expertise and strengths of outstanding classroom teachers, mentors and leadership team members from across the alliance to support participants through a tailored training programme. Through our partnership of largely Outstanding and Good schools we offer training places in a wide range of subjects and phases which change annually based on school demand.\r\nThis PGCE course prepares you to teach children in the 5 to 11 age range as a general primary teacher. It is a very practical course with around two-thirds of the time spent in schools, mostly working with teachers and pupils, and around one third spent on directed study, with partnership training in the University and school. [Find out more on our website](https://www.bishopg.ac.uk/course/pgceprim511/)\r\n","interviewProcess":"We will invite you to one of our schools and during the time you are with us you will be asked to complete a number of tasks. You will meet with students and staff to discuss topical issues. The purpose of the day is for us to get to know you and for you to get to know us. Once the interview has taken place the panel will discuss how they can best support you in becoming an outstanding teacher and which one of our schools are best placed to help you achieve.\r\n[Find out more on our website](https://www.bishopg.ac.uk/admissions-your-interviews/)\r\n\r\n\r\n\r\n","howSchoolPlacementsWork":"The full-time course is for one year with a minimum of 120 days in school and 60 days training. School placements are carefully structured to ensure gradual development of your confidence as an effective teacher through building up experiences by working with other trainees, link tutors and teachers.\r\n\r\nPlacements begin in the autumn term. The spring and summer term placements follow with you taking the lead within the classroom across core and foundation subjects. You will also undertake an enrichment placement in key stage three and early years. Whilst on placement you will work closely with your School Based Mentor(SBM). Your SBM will observe your practice throughout the week and will also meet with you weekly to enable you to identify targets to further develop your professional practice. You will also attend one afternoon a week at a local training session where senior staff will work with you and help you develop your classroom practice.\r\nDuring the spring term you will then specialise in special educational needs. You will work closely with professionals from The Phoenix School to provide learning experience for our young people. \r\n[Find out more on our website]( https://www.bishopg.ac.uk/course/pgcesecart/) \r\n\r\n","personalQualities":"We are looking for someone who has a love of learning and who wishes to ensure that others do too. \r\nBesides academic qualifications we are looking for a confident communicator who has a passion for learning. Someone who is well organised and has the ability and desire to become a team player. Your interpersonal skills are important as is your curriculum knowledge. We want to work with people who want to make a difference to individuals' lives. \r\n","otherRequirements":"[Find out more on our website]\r\n(https://www.bishopg.ac.uk/course/pgcesecart/)","status":2,"createdAt":"2021-07-06T10:48:04.656Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"The salary will be based on your experience within the special school sector. You can expect a minimum of unqualified scale one (UQT 1 - £17,208 per annum). Fees for QTS will be met by the school however fees for PGCE will be the trainees responsibility.\r\n"}
