{"id":"a7308ce2-2e8e-4e18-a969-420feadfc400","name":"Primary","code":"2ZP4","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"4038efa4-6b59-49b6-887f-b5b9a4a446e5","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"5ca88673-1b08-44bc-89be-4729ee7539c1","code":"2EM","name":"St Peter’s Teaching School"},"accreditedBody":{"id":"da8e5252-e14a-470a-8247-00b835a79010","code":"B80","name":"University of the West of England, Bristol"},"degreeGrade":"0","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feesInternational":9250,"aboutCourse":"Thank you for considering beginning your teaching career with St Peter’s Teaching School. Where to study for this qualification is an important decision and we hope to provide you with the information to make an informed choice that will give you the best possible start to this wonderful career.\r\n\r\nSt Peter’s Teaching School is a teaching school within the Lighthouse School Partnership. It is an associated of  18 primary,  infant  and junior schools working with the University of the West of England in order to provide the best quality postgraduate teacher training. \r\n\r\nOur first cohort of 6 students started training with us in September 2015. Since then, we have supported many students at the start of their teaching career and this year, we currently have another 7 trainees working with us.  They are all enjoying outstanding support from our schools with additional training opportunities delivered by leaders within our alliance. All of our trainees have entered employment at the end of the course, many within our schools. We are working closely with UWE but feel that our students are gaining extra opportunities to become essential members of the school staff by taking the School Direct route with us. \r\n","interviewProcess":"What we are looking for?\r\n\r\nWe are looking for ambitious trainee teachers who are passionate and enthusiastic about teaching in a primary setting with the desire to become outstanding and inspirational teachers. You are looking to enter an exciting and demanding career and you will need to be resilient. \r\n\r\nWe expect applicants to come from a wide range of backgrounds and, therefore, with a wide range of skills. This is a strength of the programme as it allows us to use your differences so that you can learn from one another. Some trainee teachers will be coming straight from a first degree, some will be making a fairly early career change, some will be returning to study or be changing career later in life. All are very welcome and we believe our School Direct Programme is enriched by this variety. \r\n\r\nHow we select trainees.\r\n\r\nThe Interview \r\nCluster schools will be hosting interviews on behalf of the alliance, with UWE playing an important role in the process. If you are invited for interview, you will receive full details of what will be expected of you in a letter of invitation and a decision will be made within 40 days of applications being submitted. The interview process will include an opportunity to work with children along with a more formal interview.\r\n\r\nOur interview procedure is a rigorous and thorough process, designed to get the best match.\r\n","howSchoolPlacementsWork":"You will be trained in a highly supportive and aspirational environment and will develop the rigour, professional knowledge, understanding and skills necessary for the delivery of creative, purposeful and challenging teaching and learning.  Much of the training will be delivered by expert teachers in the partnership schools. This will be enhanced by attendance at UWE for the full PGCE academic programme.\r\n\r\nYou will be assigned to one of the schools in the partnership in which you will do a teaching placement in the autumn term and summer term. You will be asked to express preferences for which school you would like to be based in. \r\n\r\nYou will have a mentor from the staff of your placement school and one from UWE. From the beginning you will be treated like a member of staff and will attend staff meetings and development days. Our mentors are outstanding teachers who are are experienced in supporting the professional development of new and experienced teachers. They have a range of skills including coaching, effective classroom observation and feedback skills. Therefore, although teacher training is demanding, you are assured of a high level of personal and professional support in a programme which is well managed at all levels. \r\n\r\nPart of your spring term will be a teaching placement in a contrasting school.\r\n","personalQualities":"We are looking for ambitious trainees who are passionate and enthusiastic about teaching  with the desire to become outstanding and inspirational teachers. You are looking to enter a demanding career and you will need to be resilient. \r\n\r\nApplicants will come from a wide range of backgrounds. This is a strength of the programme as it allows us to u learn from one another. Some trainee teachers will be coming straight from a first degree, some will be making a fairly early career change, some will be returning to study or be changing career later in life. \r\n","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:56:16.922Z","updatedAt":"2021-10-14T21:33:47.042Z","canSponsorStudentVisa":"yes","cycle":"2024"}
