{"id":"5b547f92-16d0-420d-88be-6aa3d8c2b3f4","name":"Primary (5-11) SEND","code":"E677","qualification":"qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"yes","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"bab2e1e5-7211-4a2f-9aa4-36d93da00a03","name":"Main Site","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"d2ce1fbe-879c-42d1-b2ed-e27efee10045","code":"1RW","name":"Castlebar School"},"accreditedBody":{"id":"4b833e5f-01f5-4306-aed0-cdf0c8db9fa3","code":"2B5","name":"Hillingdon SCITT"},"english":"3","maths":"3","science":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","aboutCourse":"This course is designed for applicants who want to train to teach in a specialist setting.\r\n\r\nOur Initial Teacher Training programme is tailored to individual needs and aspirations. Whether you are a recent graduate or you are considering a change of career, our programme will give you the best foundation for a great career in teaching.\r\n\r\nTrainees will be trained to teach in two consecutive Key Stages (Key Stage 1 and Key Stage 2).\r\n\r\nDuring the initial teacher training year trainees will not only learn about pedagogy in general but they will also learn about phase specific pedagogy.  Simultaneously trainees will also be given the opportunity to improve and expand their subject knowledge. Trainees will also experience some EYFS OR KS2.\r\n   \r\nAll trainees will spend 4 days a week in school. This will comprise of observing and learning from experienced colleagues, teaching, being observed and receiving feedback, as well as professional development.  \r\n\r\nThe fifth day will be a Professional Learning day at Hillingdon SCITT (located at Bishop Ramsey School, Hillingdon) and will be delivered by highly experienced and skilled practitioners. As part of their Professional Learning, trainees will undertake an Enquiry Based Pedagogy Project of their choice.\r\n\r\nTrainees will have placements in two different Partner Schools, both in Ealing. Whilst on placement, school direct salaried trainees need to be prepared to teach up to 3 to 3.5 days from the start of the academic year, which may vary weekly.\r\n\r\nThroughout the year, trainees will have a designated Mentor/Coach supporting them. To achieve QTS, all trainees at calendared intervals throughout the year will be assessed against their mastery of the ITE Curriculum as well as the Teachers' Standards.\r\n","interviewProcess":"In conjunction with the Lead School, Ealing Primary Teaching School Alliance will co-ordinate the recruitment process.\r\n\r\nThe interview process, which is rigorous and thorough, will involve a full day spent at one of the Partner Schools, which is likely to be your main placement school for the duration of the training year.  \r\n\r\nThe recruitment day will include:-\r\n\r\nTeaching a lesson or working with a group of students which will be observed by a qualified teacher (applicants will be given the information in advance about the content of the lesson, the duration and the age group that they will be teaching).\r\n\r\nA short presentation (applicants will be given the information prior to the interview to prepare for the presentation).\r\n\r\nLiteracy and Numeracy tests (these are internal Hillingdon SCITT tests to assess the applicant’s fundamental skills in English and Maths).\r\n\r\nInterview (the panel will consist of representatives from Ealing Primary Teaching School Alliance, Hillingdon SCITT and the Partner School).\r\n\r\nThere may also be the opportunity to talk to staff and pupils and possibly a tour of the school.\r\n","howSchoolPlacementsWork":"During the training year trainees will teach in two different Partner Schools based in Ealing.\r\n \r\nTrainees will be spend the majority of the year in one Partner School (where they were interviewed). \r\n\r\nThe second placement is for the duration of 6 weeks, whereby trainees will be placed in a contrasting school.\r\n\r\nMost of the Partnership Schools are located within a few miles from the Lead School. \r\n","personalQualities":"We are looking for ambitious applicants who are passionate, enthusiastic, committed and have a desire to share that with children and young people of all abilities.\r\n\r\nThe salaried route is more suitable for applicants who have worked in schools with children.  Therefore, such applicants should be familiar with how teaching and learning takes place within schools.","otherRequirements":"All successful applicants will be subject to:-\r\n\r\n•\tDisclosure Barring Service checks \r\n•\tHealth and physical capacity to teach\r\n•\tChildcare disqualification\r\n","status":2,"createdAt":"2021-07-06T10:56:22.471Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"Applicants will be paid on the Unqualified Teachers Pay Scale, which will be determined by each Partner School.  \r\n\r\nApplicants are welcome to discuss their salary during the interview.\r\n\r\nThe cost of the QTS will be paid by the applicants employing school."}
