{"id":"9e50f42c-b24b-45b4-8912-0155440f6702","name":"Primary (5-11)","code":"E633","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"bab2e1e5-7211-4a2f-9aa4-36d93da00a03","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"d2ce1fbe-879c-42d1-b2ed-e27efee10045","code":"1RW","name":"Castlebar School"},"accreditedBody":{"id":"4b833e5f-01f5-4306-aed0-cdf0c8db9fa3","code":"2B5","name":"Hillingdon SCITT"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We may consider candidates who need to take an equivalency test in one of the following: English, Maths or Science","courseLength":"OneYear","feesUK":9200,"feeDetails":"£9,200 is the fee for QTS (accredited by Hillingdon SCITT) and PGCE (PGCE is the academic award from Brunel University)","aboutCourse":"Our Initial Teacher Training programme is tailored to individual needs and aspirations. Whether you are a recent graduate or you are considering a change of career, our programme will give you the best foundation for a great career in teaching.\r\n\r\nTrainees will be trained to teach in two consecutive Key Stages (Key Stage 1 and Key  Stage 2).\r\n\r\nAll trainees will spend 4 days a week in school. This will comprise of observing and learning from experienced colleagues, teaching, being observed and receiving feedback, as well as professional development. \r\n\r\nThe fifth day will be a Professional Learning day at Hillingdon SCITT (located at Bishop Ramsey School, Hillingdon) and will be delivered by highly experienced and skilled practitioners. As part of their Professional Learning, trainees will undertake an Enquiry Based Pedagogy Project of their choice. As part of their Professional Learning, all trainees will undertake an Action Research Project of their choice (which will be the main task for QTS).  \r\n\r\nTrainees will have placements in two different Partner Schools, both in Ealing. Whilst on placement, the amount of lessons that fee funded (unsalaried) trainees will be expected to teach is incremental according to each training phase.  A teaching timetable will be created that is bespoke to teach trainees based upon their prior experience and readiness to teach.  \r\n\r\nThroughout the year, trainees will have a designated Mentor/Coach supporting them. In order to achieve QTS, all trainees will be assessed at calendared intervals throughout the year against their mastery of  Hillingdon SCITTs professional learning curriculum followed by the Teachers Standards at the end of the course.\r\n\r\nTrainees who meet requirements of the PGCE for Brunel University will have the opportunity to study for this alongside the QTS (QTS is accredited by Hillingdon SCITT).  There will be three assignments for the PGCE during the training year.","interviewProcess":"The interview process, which is rigorous and thorough, will involve between a half and a full day at one of our Partner Schools, which is likely to be your main placement school for the duration of the training year.  \r\n\r\nThe recruitment day will include:-\r\n* Teaching a lesson or working with a group of students which will be observed by a qualified teacher (applicants will be given the information in advance about the content of the lesson, the duration and the age group that they will be teaching)\r\n\r\n* A short presentation (applicants will be given the information prior to the interview tp prepare for this)\r\n\r\n* English and Maths tests (these are internal Hillingdon SCITT tests to assess the applicant’s fundamental skills in English and Maths)\r\n\r\n* Interview (the panel will consist of representatives from Castlebar School/ Hillingdon SCITT  and the Partner School)\r\n\r\nThere may also be the opportunity to talk to staff and pupils and possibly a tour of the school. \r\n","howSchoolPlacementsWork":"During the training year trainees will teach in two different Partner Schools based in Ealing.\r\n\r\nTrainees will be spend the majority of the year in one main placement school (where they were interviewed). \r\n\r\nThe second placement is for the duration of 6 weeks, whereby trainees will be placed in a contrasting school.\r\n\r\nMost of the Partnership Schools are located within a few miles from the Lead School.","personalQualities":"We are looking for ambitious applicants who are passionate, enthusiastic, committed and have a desire to share that with children and young people of all abilities.","otherRequirements":"All successful applicants will be subject to:-\r\n*Teachers' and Others Prohibited from the Profession check\r\n*Section 128 Barring Directions\r\n*Enhanced Disclosure Barring Service Checks\r\n*Childcare Disqualification Declaration Check\r\n*Health Screening\r\n*Safeguarding References\r\n*International Checks\r\n\r\n","status":1,"createdAt":"2021-07-06T10:56:22.338Z","updatedAt":"2021-09-17T14:47:54.800Z","canSponsorStudentVisa":"no","cycle":"2024"}
