{"id":"ffc2e501-a0bd-402d-8e8d-2144c2bcc3c6","name":"Primary","code":"2QGF","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"bab2e1e5-7211-4a2f-9aa4-36d93da00a03","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"d2ce1fbe-879c-42d1-b2ed-e27efee10045","code":"1RW","name":"Castlebar School"},"accreditedBody":{"id":"ef172d85-20e4-4aa2-96d0-9e3ae81f526d","code":"S64","name":"St Mary’s University, Twickenham"},"profPost":"PG","degreeGrade":"1","english":"2","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We will accept equivalency tests but not in all subjects, please contact us for more information.\n\nPlease visit St Mary's University website for details of the providers we accept, the link is here:\n\nhttps://www.stmarys.ac.uk/teacher-training/prepare/gcse/equivalency-tests.aspx","courseLength":"OneYear","feesUK":9250,"aboutCourse":"This programme provides an intense training experience that combines academic rigour with personal and professional learning experiences. \r\n\r\nThe training is designed to meet the needs of each trainee to support and develop the skills, knowledge and attributes needed to start a teaching career.\r\n\r\nIn preparation for your teaching role, you will be trained across the 5-11 age range, developing knowledge and practice to support your development of:\r\n\r\n*Critical understanding of educational theory\r\n\r\n*Reflective practice linked to professional standards\r\n\r\n*Practitioner research and a wide range of educational issues to understand the unique characteristics of children and their learning needs\r\n\r\n*Subject-specific knowledge and creative ways to enthuse and educate children\r\n","interviewProcess":"","howSchoolPlacementsWork":"Your placements will be in one of our partner schools which is organised and co-ordinated by Castlebar School. All schools are located within Ealing. There will be 2 placements in different settings.\r\n\r\nYou will be supported through this element of the course by our partner schools, mentors and university link tutors.\r\n\r\nDuring your placements, you will be guided from working with small groups of pupils alongside a class teacher towards taking responsibility for whole class teaching.  \r\n\r\nThe development period - a two-week placement of your choice - could be in a range of settings - SEND, secondary or early years setting. \r\n\r\nThis is a self-assessed placement and is measured against the targets set by you and your Academic Tutor from your first school experience. This is an opportunity to work in schools or educational settings to further enhance your skills in a variety of ways and incorporate one or more of the Standards for Teachers 2012.\r\n","personalQualities":"We are looking for applicants who are passionate about education, have an excellent academic background, and are committed to working with children and young people to make a difference in their lives. \r\n\r\nDuring the interview and selection process, you will take part in  an interview and discussion that will allow you to evidence that you have thought carefully about your motives for becoming a teacher and can demonstrate that you have some emerging capability to reflect on what being a teacher means. The interview will be recorded in line with GDPR compliance. (The interview may be remote) \r\n","otherRequirements":"All successful applicants will be subject to:-\r\n\r\nMeet the requirements for physical and mental fitness to teach\r\n\r\nSatisfactory enhanced Disclosure and Barring Service (DBS) check and any other required clearances\r\n\r\nComplete DfE provisional registration requirements\r\n\r\nShow that you can communicate effectively in both spoken and written standard English\r\n\r\nDemonstrate that you have recent, relevant experience in a KS1 or KS2 setting\r\n\r\n\r\n\r\n","status":1,"createdAt":"2021-07-06T10:56:22.287Z","updatedAt":"2021-09-13T10:19:11.046Z","canSponsorStudentVisa":"yes","cycle":"2024"}
