{"id":"ad74d868-00ba-409f-9458-cf3fbb94859d","name":"Primary (Special Educational Needs)","code":"34T6","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"yes","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"c301119b-770b-4b4e-970a-fc2b6c971774","name":"Bamburgh School","isPublished":"N","status":"S"},{"id":"1a8e94cf-0ca9-443f-82b3-9674f5c9e48a","name":"Sunningdale School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"d4298cd3-2e42-42b1-b34d-892706f601dc","name":"The Dales School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"fd92fb4e-ddf5-4fff-a7f7-281f1b2960f7","name":"Hopewood Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"743ee4c6-c511-4bdc-b4f4-43bfd1f45288","name":"Ash Trees Academy","isPublished":"N","status":"S"},{"id":"7b4e5244-00e4-4559-94c7-1267d57edc86","name":"Keelmans Way School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"090947d5-058a-4de0-89c1-437bd80fb4f1","name":"Northern Counties School","isPublished":"N","status":"S"},{"id":"68d55ff1-2a02-49be-96ed-0628f560a7a2","name":"North View Academy","isPublished":"Y","status":"R"},{"id":"d2013d96-be32-411f-b81f-5dde52b17ce5","name":"Columbia Grange School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"0db6ef43-98e7-4e61-ae6d-cb2bbd38a5dd","code":"23M","name":"Sunningdale School"},"accreditedBody":{"id":"b384b008-59e2-461e-a15f-3551d1165c1e","code":"N77","name":"University of Northumbria at Newcastle"},"profPost":"BO","degreeGrade":"1","english":"1","maths":"1","science":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"financialSupport":"Bursaries or student finance if your eligible ","aboutCourse":"This course is designed for postgraduates who would like to develop expertise in teaching children with special educational needs. These may be exhibited as behavioural, emotional and social difficulties; speech, language and communications needs; hearing, visual or multi-sensory impairment; physical disabilities and autistic spectrum disorders. \r\n\r\nOur course will be of particular interest to graduate staff working within special needs schools who are seeking a progression route to become fully qualified teachers.\r\n\r\nThe training provides opportunities for students to immerse themselves fully in school life to provide a comprehensive experience of working with these special children. \r\n\r\nTrainees complete two full time placements over the course of the academic year. The majority of the time is spent in the special needs school to which the application has been made, with one placement in a mainstream primary school. \r\n\r\nThe placements will provide trainee teachers with experience of working with children at key stages one and two. There will be a specific number of assessed weeks within each placement and throughout the training students will receive mentoring support to help them develop the attributes required to demonstrate Teaching Standards for QTS. \r\n\r\nAll trainees will attend their school placements on Monday to Thursday throughout the school year and will attend training sessions provided by Northumbria University and Sunningdale Teaching School on Fridays. \r\n\r\nThe training delivered by Sunningdale will provide equip students for teaching in mainstream primary schools but will also provide a deep understanding of strategies to support the learning of children with special needs that many mainstream training providers are unlikely to make available within their training programmes. \r\n\r\nWith the support of the partner school mentors, trainees will be responsible for collating a portfolio of evidence which demonstrates their capacities to teach against the Teachers’ Standards for QTS. This portfolio development is monitored by Sunningdale Teaching School and the designated Northumbria University tutor. \r\n\r\nThe partner school, the Teaching School and Northumbria University will formally assess student portfolios at the end of the programme and make recommendations to the Examination Board at Northumbria University as part of the PGCE award, noting that the trainee has successfully achieved the Teachers’ Standards for QTS. \r\n\r\nUpon successful completion of the programme, students will be awarded either a Post Graduate Certificate in Education (level 7) or a Professional Graduate Certificate in Education (level 6) subject to the University Examination Board. Both of these qualifications confer QTS.\r\n","interviewProcess":"Sunningdale School coordinates the recruitment process. On interview day the shortlisted applicants will be invited to the school for a tour and will then undertake an observed teaching activity. This process will be completed with an assessment task and an interview by a panel which will include representatives of Sunningdale Teaching School, Northumbria University and the school to which the applicant has applied. \r\n\r\nCandidates are only required to attend one interview. The interview day is an opportunity for both the candidate and the school to meet each other, assess suitability and discuss school placement options. During the process the candidate will be able to showcase their knowledge and skills, view the placement school and discuss the course/training content. \r\n\r\nThe process is designed to get the best match of applicant to the places available.\r\n","howSchoolPlacementsWork":"All candidates are required to undertake teaching in at least two schools with consecutive Key Stage 1 and 2 phases which will take place over the full academic year. \r\n\r\nStudent performance will subject to ongoing assessment. The main placement will take place in the school to which the candidate has applied to undertake their training.  Sunningdale Teaching School arranges the second six-week long school placement in a mainstream school setting with its alliance partners. \r\n\r\nThe placement will start in September within the school to which the candidate has applied. This enables students to become familiar with their host schools and the training programme. \r\n\r\nPreparation for the mainstream school placement will begin at this time, including school visits. Mainstream placements run for six weeks and will take place during October and November. \r\n\r\nThereafter, students will return to their host schools for the remainder of the training programme.\r\n\r\nDuring placements, students’ mentors will complete 2 observations per week and set targets for trainees during the assessed period which will cover a minimum of 15 weeks spread across the academic year. \r\n\r\nThe placements will be organised to ensure that students can be observed working across the range of teaching contexts required to enable them to demonstrate that they have reached the Teachers’ Standards for QTS. \r\n\r\n","personalQualities":"Candidates should have made a considered decision to work with children who have special educational needs and have some experience of working with them in either an educational or care environment. \r\nCandidates should have a genuine passion for teaching, be empathetic and highly motivated, and be excited by the opportunities to be creative in meeting the very diverse needs of children with special needs.\r\n","otherRequirements":"Candidate will require an enhanced background check by the Disclosure and Barring Service (DBS).\r\n\r\n","status":1,"createdAt":"2021-07-06T10:53:33.102Z","updatedAt":"2021-08-06T08:26:51.339Z","canSponsorStudentVisa":"yes","cycle":"2024"}
