{"id":"6e16680f-05ba-4635-aaf7-ac3240aab769","name":"Primary","code":"Q611","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"other","programType":"TA","fundingType":"apprenticeship","studyMode":"F","ageRange":"3_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"b477b70a-8e35-4e45-9a55-d2d70e2e974b","name":"Purley Oaks Primary School","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"8eaad1be-be05-4b10-b15d-02ba86607a43","code":"15O","name":"Saint John Southworth Enterprise and Research Alliance"},"accreditedBody":{"id":"252d7e03-741e-4453-b6a8-3d361e6c9d1b","code":"E69","name":"e-Qualitas"},"english":"3","maths":"3","science":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","aboutCourse":"If you are looking for a teacher training course in which you spend most of your time in-school while you study, this course may be for you.\r\nYou work with experienced teachers, first of all observing and team teaching, then teaching independently. This course will be part of the apprenticeship scheme. All training sessions are provided by experienced school staff, and you attend some training days run by eQ (up to about 10 days, mostly held in a venue in central London). You also have a subject-specialist visiting tutor from eQ.\r\n","interviewProcess":"Candidates will normally be interviewed by a member of the Senior Leadership Team and the Head of Department. Interviews are structured into two parts - the first part of the interview will discuss with candidates their motivation for entry into the teaching profession. While the second half of the interview looks at the candidates understanding of the education system in England. As part of the interview candidates may be asked to teach a lesson of about 30 minutes to a class. Candidates may be asked to undertake a written task as part of the interview.","howSchoolPlacementsWork":"Candidates as part of the application process:\r\n* nominate a school to train within \r\n* the age range they wish to teach \r\nCandidates will spend the majority of their time within their nominated school but will also undertake, at least, a six week placement in a second school. The second school must be a contrasting school to their main school. \r\nRBTSA consists of some 30 schools which are a mixture of primary and secondary schools. This allows the Alliance to ensure that we are able to meet the needs of the candidates across a wide range of schools.\r\n","personalQualities":"Candidates will be able to demonstrate in their application and at interview a genuine passion for working with young people. Ideally, candidates will be able to show relevant work experience within a school context. ","otherRequirements":"All candidates will be subject to a DBS check and relevant qualification checks. ","status":2,"createdAt":"2021-07-06T10:49:40.449Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","applicationsOpenDateOther":"2022-04-07T00:00:00.000Z"}
