{"id":"dc7c8e5c-7502-4cd6-8701-97e495464aad","name":"Health and social care","code":"J237","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"14_to_19","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"b1c3659e-5021-4f1e-a218-16b115f46fbc","code":"L5","name":"Health and social care"}],"locations":[{"id":"c1d61b7b-b555-44f4-aa2c-b3f6f7b3e365","name":"Secondary Training Base  (host schools across S. Lincs and N. Cambs)","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"f855aba5-86e3-4bc1-9fb5-d1dfe91482bb","code":"C36","name":"The Deepings SCITT"},"degreeGrade":"9","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Please note that we do not accept level 2 functional skills qualifications as GCSE equivalents.\n \nWe do however offer our own GCSE equivalency tests at The Deepings, on a date to suit you, for a £50 fee which includes a practice paper, marking and certificate.\nWe also accept GCSE equivalency qualifications from the 'Equivalency Testing' provider: (https://www.equivalencytesting.com/establishments/)","courseLength":"OneYear","feesUK":8250,"feeDetails":"All fee-paying courses leading to QTS cost £8250.\r\nQTS plus the additional PGCE costs £9250.\r\nFor salaried candidates, the additional PGCE costs £1500.\r\n\r\nAdvice and support in applying for loans from the Student Loan Company is offered.\r\n","aboutCourse":"Our courses all lead to QTS and are available with or without the PGCE. The key elements of our training are as follows:\r\n\r\n* One-day-a-week intensive core training when trainees come together to learn, discuss and share ideas about teaching and learning content, theory and pedagogy.\r\n* Access to outstanding school practice in different settings (including SEND experience) via our well-established association of schools \r\n* Effective in-school support and coaching via a trained school-based Mentor, Visiting Tutor (VT), Subject Tutor (ST) and other key personnel\r\n* Carefully timetabled teaching sessions, increasing throughout the training, reviewed termly and supported by developmental observations and weekly meetings\r\n* A full induction programme to prepare trainees for the start of their first term. This includes a meeting between mentor, VT and trainee to discuss the Weekly Progress Documents which bring together all aspects of the course\r\n* A clear focus on key areas including subject knowledge, effective behaviour for learning, assessment, systematic synthetic phonics and early mathematics for Primary\r\n* Strong Subject Knowledge for Teaching is vitally important and this will be developed through audits, action plans and a range of developmental activities and inputs\r\n* A series of structured Teaching Impact Studies which develop key skills, understanding and knowledge linked to the curriculum\r\n* A carefully selected contrasting second placement linked to individual trainee needs \r\n* Opportunities to visit schools offering education in the phases before / after your training phase\r\n* Documentation to support planning and observations\r\n* Documentation to support monitoring and assessment of progress\r\n* Literacy & Numeracy support\r\n\r\nOne-day-a-week core training, plus 2 study weeks, take place largely at The Deepings School and Bourne Westfield Primary Academy. The remaining four days /week are spent in your host training schools. \r\n\r\nAssessment is via:\r\n\r\n* Lesson observations\r\n* Weekly Progress Documents\r\n* Teaching Impact Studies\r\n* Assessed written assignments\r\n* Proficiency tests \r\n\r\nRegular progress reviews assist in the monitoring and reporting of your progress throughout the year. A range of assessment evidence is used including lesson observations, discussions and other portfolio evidence. The VT and mentor will ensure the trainee is prepared for the final visit assessment via a summative assessment visit. A final visit assessor then attends the school to moderate this judgment by: reviewing the documented evidence, discussing progress with the trainee, observing a lesson and chatting to the mentor and/or other school staff.\r\n","interviewProcess":"Rigorous selection and recruitment is an important part of our programme in order that we recruit the very best graduates. \r\n\r\nStage 1  Application screening\r\nWe consider your qualifications, school experience and your personal statement. Any candidates rejected at this stage may request feedback.\r\n\r\nStage 2  Panel interview  \r\nThis is usually held, in person, with at least 2  SCITT staff.  \r\nPrior to this, secondary interviewees are asked to prepare and upload a 10-minute  recorded presentation on an aspect of the KS4 curriculum and are informed of this by letter prior to the interview. Primary interviewees are asked to prepare and upload a reading task, sharing a book with an age group of their choice. Candidates also sit English & Maths tests.\r\n\r\nStage 3  Host School Visit (HSV) \r\nWe ask you to visit your potential training school. Whilst here, you may be interviewed by the Head of Department or members of SLT and there will be opportunities to tour the school and meet the staff teams as well as the children. This is an opportunity to ensure that you and the school are happy with each other.\r\n\r\nWe are committed to safeguarding, therefore, if offered a place, all trainees are required to undergo an Enhanced DBS check. Original exam certification and the required photo ID must be available at the time of interview.  In the case of lost certificates, duplicates must be obtained by the candidate from the awarding body.  \r\n","howSchoolPlacementsWork":"We have very close links with some 30 schools who have been successfully involved in initial teacher training with us for some years.  The SCITT will place applicants in suitable schools, always in consultation with candidates, and placements begin in the September of the training year. Trainees will work in a host school and associated schools until the end of the academic year in July.  During this time, at least one day in the phase prior to /following the one in which you train is provided, as is SEND school experience.  The 6-week Contrasting  School placement is designed to offer a broader experience across school settings and takes place after Christmas.   \r\n\r\nSchools are  matched to candidate need and selected for their training capacity as well as in negotiation with candidates for location and convenience.  Consequently it is very rare that trainees need to change placements. We have a growing number of schools and so it is our aim to ensure that no candidate has to travel too far for their training although in Lincolnshire, due to poor transport links in some areas, the ability to drive, whilst not essential, will bring more opportunities.  \r\n\r\nAlthough Primary trainees may specialise in a Key Stage, they are trained across at least four year groups and all of our Primary trainees, even those with a KS2 focus, are trained in phonics.  For Secondary, the majority are trained in the 11-16 age group although for some (eg Business Studies) this is extended to 16-19 too. Where possible, all trainees in schools with 6th forms are encouraged to become involved with post-16 by the end of their courses.  \r\n\r\nOver your training year you will also spend 2 days in a Special Needs school and a day in the phase before or after that in which you are training. i.e. primary trainees go to our lead secondary and secondary trainees go to our lead primary.\r\n\r\nExperienced staff and fully trained mentors manage your training in all of our placement schools.\r\n","personalQualities":"We want passionate trainees who feel inspired by the different needs in our schools. Recent school experience  demonstrates clear commitment  and a realistic grasp of the role but we understand that current restrictions may restrict this - nevertheless, good, current understanding of your chosen sector is essential, demonstrating an awareness of recent educational developments and good subject knowledge.  \r\n\r\nWe seek applicants who possess multiple transferable skills relating to commitment and motivation, resilience, flexibility, communication, self-awareness and critical thinking, teamwork, decision-making ability, organisation and time management and research.  We demand commitment to demonstrating consistently high standards of personal and professional conduct.\r\n","otherRequirements":"Applicants with recent school experience in their chosen phase in an English school  and who have done some research on the National Curriculum, will put themselves at an advantage at interview.  We want to know that you are serious about the profession, seeing your communication skills and confidence shine through. For us, teaching is all about commitment and making relationships, not necessarily about first class degrees.\r\n\r\nAny offer will of course be conditional upon a satisfactory enhanced DBS check and all other DfE requirements being fulfilled. \r\n\r\n","status":1,"createdAt":"2021-09-28T08:45:26.415Z","updatedAt":"2021-09-28T08:47:12.130Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
