{"id":"4c937ffb-cef5-4ab2-8c38-d7380c7988ac","name":"Music","code":"Z601","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"24311bef-8673-41fb-933c-53f887fb6976","code":"W3","name":"Music"}],"locations":[{"id":"da5fd3cc-297a-4f06-ae93-fa6218d5cce1","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"b1c7a726-d28a-48b1-8003-5e51384c773d","code":"2HN","name":"Bristol Cathedral"},"accreditedBody":{"id":"992b9d4a-bdcf-44e8-9296-fb1fe3bb3315","code":"B78","name":"University of Bristol"},"profPost":"PG","degreeGrade":"0","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"You will follow the well-established University of Bristol PGCE, with the added advantage of taking the School Direct route. This means that you will spend more time in school while training.\r\n\r\nWe are keen to recruit accomplished musicians who are passionate about a career in teaching Music. We encourage you to apply if you fit the profile, although places are limited.\r\n\r\nOne of your placements will be at Bristol Cathedral Choir School, which specialises in and has an international reputation for excellence in Music.  From the OFSTED report in 2016: \"The academy provides an extensive range of enrichment experiences. Pupils and sixth form learners make full use of these opportunities. The range and quality of musical experiences and activities is exceptional, reflecting this specialist aspect of the academy’s work.\"","interviewProcess":"We intend that interviews will take place in person this year. \r\nInterviews are with colleagues from the University and the school.\r\nIf selected for interview, we will brief you fully on what to expect and promptly offer either a place on the programme or some constructive feedback.","howSchoolPlacementsWork":"You will teach across the 11-18 age range.\r\nPlacements are in at least two schools, one of which will be Bristol Cathedral Choir School.\r\nAll of our schools are within five miles of central Bristol, so you won't have to worry about a long commute when you're on placement.","personalQualities":"We are looking for accomplished musicians who are passionate about a career in teaching. \r\n\r\nWe recruit energetic, optimistic, resilient people. We're looking for people who recognise the subject's value as an academic discipline. We encourage individuals with flair and talent to inspire young people.\r\n\r\nWe love people who are committed to working in diverse communities and getting the best out of disadvantaged children.\r\n\r\nOur people have the highest expectations of children and of themselves. We want you to come into teaching to stay, so you can enjoy a rewarding career.\r\n","otherRequirements":"You will need to provide two forms of identification at interview from the standard list available at gov.uk\r\nYou will need to complete a suitability Declaration Form at interview.\r\nYou will need enhanced DBS clearance before you start training.\r\n","status":1,"createdAt":"2021-07-06T10:47:31.132Z","updatedAt":"2021-10-07T12:50:23.088Z","canSponsorStudentVisa":"yes","cycle":"2024"}
