{"id":"b72b0398-9751-4594-9ddf-722a817fe762","name":"Physical Education","code":"3CQW","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"74d64a54-5e34-4590-b6c7-528dd0cf26fe","code":"C6","name":"Physical education"}],"locations":[{"id":"da5fd3cc-297a-4f06-ae93-fa6218d5cce1","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"b1c7a726-d28a-48b1-8003-5e51384c773d","code":"2HN","name":"Bristol Cathedral"},"accreditedBody":{"id":"da8e5252-e14a-470a-8247-00b835a79010","code":"B80","name":"University of the West of England, Bristol"},"profPost":"PG","degreeGrade":"0","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feesInternational":21100,"financialSupport":"Visit  [UWE Postgraduate Fees and Funding](https://www1.uwe.ac.uk/students/feesandfunding/fundingandscholarships/postgraduatefunding/full-timehomeoreupgce.aspx) for more information about UWE's fees and funding\r\n","aboutCourse":"You will spend a significant amount of your time training in schools as a School Direct trainee. You will be placed in at least two schools across the year, so you have experience of teaching in different schools. We guarantee that you will be placed in a school within 5 miles of central Bristol and that you will be able to get to know your colleagues before starting your school placements.\r\n\r\nYou will also spend time studying at the University of the West of England (UWE) in Bristol and have access to all of their resources and support. This gives you the opportunity to work with a larger group of trainees in your subject, so you will feel part of a team. \r\nAll trainee teachers must complete four compulsory modules:\r\n \r\n* Professional Development in Secondary Initial Teacher Education\r\n \r\n \r\n* Professional Practice in Secondary Initial Teacher Education\r\n \r\n \r\n* Core Teaching in Secondary Initial Teacher Education\r\n \r\n \r\n* Classroom-based Enquiry: Secondary Education.\r\n\r\n\r\nAt the end of the course, you will be awarded the Postgraduate Certificate in Education (PGCE) from UWE Bristol, which carries 60 Masters level credits.\r\n","interviewProcess":"We're keen to get to know you both as an individual and as a potential teacher.  The interview process is also about you getting to know us, so you feel that you can make a firm commitment to training with us.\r\n \r\nThe process consists of: \r\n \r\n* a visit to at least one of our schools\r\n \r\n* some time spent working with children to demonstrate your strengths\r\n\r\n* an opportunity to make a brief presentation on one aspect of your subject, to demonstrate your potential teaching skills\r\n \r\n* a panel interview\r\n \r\n* a group discussion about an aspect of education.\r\n \r\nWe will give you much more guidance when you apply. We look forward to receiving your application.\r\n \r\nYou will be recruited by Cathedral Schools Trust, working in close partnership with UWE.\r\n \r\nYour next step: apply for a School Direct place with Bristol Cathedral via the [UCAS teacher training website](https://www.ucas.com/teaching-in-the-uk)\r\n","howSchoolPlacementsWork":"You will spend a significant amount of time training in schools as a School Direct trainee.\r\n \r\nYou will be placed in at least two schools across the year, so you get the experience of teaching in different schools. This will help you prepare for joining the profession after you have qualified. \r\n\r\nWe want you to feel that you belong in each school community, so we make sure that you get to know the people in our schools in advance\r\n \r\nAll of our schools are in or very close to Bristol, so you won't have far to travel. This will save you time and money. Above all, you will have the certainty of knowing your placement schools and the people in them before you start.","personalQualities":"We are looking for energetic, optimistic, resilient people who love teaching and learning. \r\n\r\nWe want people who are not only knowledgeable about their subject but also passionate about its value as an academic discipline. We encourage individuals with flair and talent to inspire young people.\r\n\r\nWe love people who are committed to working in diverse communities and getting the best out of disadvantaged children.\r\n\r\nOur people have the highest expectations of children and of themselves. We want you to come into teaching to stay, so you can enjoy a rewarding career and make a significant contribution to the profession.\r\n","otherRequirements":"* It would be a distinct advantage if you could offer to teach another subject outside of PE, such as English, Maths, Science, Geography, History, Computing or a Modern Foreign Language\r\n\r\n*You will need to provide two forms of identification at interview from the standard list available at gov.uk \r\n\r\n*You will need to complete a suitability Declaration Form at interview. \r\n\r\n*You will need enhanced DBS clearance before you start training.\r\n","status":1,"createdAt":"2021-07-06T10:47:30.605Z","updatedAt":"2021-10-07T15:18:29.444Z","canSponsorStudentVisa":"yes","cycle":"2024"}
