{"id":"ca0ef99c-9a38-4d84-b1f9-b9fb19d11816","name":"Primary","code":"H047","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"f9df473b-28da-4fd6-bc55-73894e3772ae","name":"Services for Education","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"086451b8-c0c2-45b7-94eb-c79c1c4fd637","code":"1WE","name":"Services for Education"},"degreeGrade":"9","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":8250,"feeDetails":"If you are from the UK, you should be eligible for a student loan to cover the cost of tuition fees, available through Student Finance England.","aboutCourse":"Services for Education Primary SCITT (ages 5-11) is a one year, full-time course which trains just a small number of trainees each year - meaning your experience is bespoke and personalised. \r\n\r\nOur centre-based training sessions are delivered by experienced teachers and advisors - throughout the course, theory and practice are closely linked. \r\n\r\nTrainees spend approximately 120 days in schools, putting the theory they have learned in centre-based training into practice. Trainees will experience at least two different schools, and are carefully matched with their placement schools to ensure their individual needs are met. \r\n\r\n","interviewProcess":"We make our decisions to offer a place based on your enthusiasm, aptitude and commitment to teaching as demonstrated by your application form, qualifications, reference and performance at the interview. \r\n\r\nYour Personal Statement forms a key part of the initial selection process. This not only provides you with an opportunity to evidence your ability to communicate clearly and accurately in writing, but also is where you can draw attention to those personal skills and qualities which you believe make you suitable for working within the Primary phase.\r\n\r\nSuccessful applicants will initially be invited to attend an interview session with us at Services for Education. During the interview process candidates will receive further information about the course. Candidates will also be required to undertake a series of short tasks and a formal interview. \r\n\r\nWhilst ensuring that we can provide the conditions and training required, trainees must be prepared to demonstrate their own suitability for an offer of a place. The SCITT has thorough and rigorous selection procedures to ensure that the strongest applicants are offered places on the programme. Applicants must demonstrate a potential to train as a primary teacher. \r\n\r\nAny offer is conditional upon receipt of a satisfactory medical report, police clearance and sight of original qualification certificates. \r\n\r\n","howSchoolPlacementsWork":"How school placements work\r\n\r\nServices for Education Primary SCITT provides you with all of your placements, within our partner schools, enabling you, the trainee, to concentrate fully on achieving your QTS. Aside from the time you spend at your 'home' school, you will also spend 6 weeks at a contrasting partnership Primary school, in order to gain valuable experience.\r\n\r\nAt the beginning of the course you are allocated a Professional Tutor who will introduce you to school life and help you work your way through the teachers standards, allowing you to develop your lesson planning, teaching and evaluation and actively participating in classroom teaching working towards 80% teaching time in your final placement. \r\n","personalQualities":"Teaching is a demanding but fulfilling profession. To succeed in it you need to possess and/or develop a number of key values, dispositions, skills and aptitudes. You must: \r\n-Have strong subject knowledge and understanding; \r\n-Have enthusiasm for teaching and a commitment to the educational process;\r\n-Be able to communicate sensitively and effectively with others and work constructively with them; \r\n-Have the will and capacity to engage in critical self-evaluation, learn from and with others, and engage in continuous professional development. ","otherRequirements":"Statutory guidance requires that teacher training providers ensure that entrants on all routes have been subject to DBS criminal records checks. \r\nApplicants offered a place will need to complete a DBS application prior to commencement of the programme. \r\nSuccessful applicants will be asked to confirm in writing that neither they nor, as far as they are aware, members of their household are disqualified from teaching. \r\nSuccessful applicants will be required to complete a health questionnaire designed to ensure that trainees have the health and physical capacity to teach and will not put children and young people at risk of harm.","status":1,"createdAt":"2021-07-06T10:55:29.833Z","updatedAt":"2021-08-24T08:25:26.714Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
