{"id":"1ed50e84-b4c9-49bc-b1c5-b6a429fda6ed","name":"Primary (5-11)","code":"U952","qualification":"pgce_with_qts","startDate":"2023-01-01T00:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"7197285b-dda3-448b-8932-7c93fed7b631","name":"London - Tower Hamlets","isPublished":"Y","status":"R"},{"id":"b0b25848-7c8d-44f1-a783-ba58393d13cc","name":"Lancaster","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"9be9f611-2d36-431a-9109-7fcbbfc88fc8","code":"C99","name":"University of Cumbria"},"profPost":"PG","degreeGrade":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We accept equivalency tests from:\n\nEquivalency Testing and A Star Equivalency.","courseLength":"OneYear","feesUK":9250,"feesInternational":13250,"aboutCourse":"Welcome to our excellent PGCE primary programme with Qualified Teacher Status (QTS) (January start).\r\n\r\nDuring this course you will undertake two masters level modules to gain your PGCE. These are titled ‘Building Professional Understanding’ and ‘Enhancing Professional Practice’. As well as gaining you 60 masters’ level credits, the learning you will gain on these modules will also help you develop in your skills, knowledge and understanding as a teacher. \r\n\r\nYou will undertake modules to support your teaching in school more explicitly: ‘Learning, teaching and subject pedagogy ’ introduces you to all primary subjects and also looks at general teaching skills such as planning, managing behaviour, assessment and working with children with Special Needs and Disability. ‘Cumbria Teacher of Reading’ helps develop your understanding of teaching systematic synthetic phonics and early reading. ‘Being a Teacher’ helps you explore wider issues around the professional role of the teacher and other skills such as working with other adults to support learning. Another module ‘Subject knowledge and pedagogy’ is student led and tutor facilitated assisting students developing their knowledge of subject and curriculum areas they may have less confidence in. As well as general primary you can also do pathways in lower primary and a range of specialist routes, currently Inclusion, Maths and PE, but these may change.\r\n\r\nSchool-based learning is woven into the programme throughout the year to allow students to grow and develop their skills as they learn and develop their understanding in university-based sessions. This may be experiential or assessed. The assessed placements are in three full time blocks, spread out over the academic year.\r\n \r\nOur most recent internal exit data has shown student satisfaction increasing year on year with 96% of students reporting the course to be good or very good. \r\n\r\nThe University of Cumbria PGCE primary team are very proud of the way they look after students, through the COVID19 pandemic and through ever changing times and uncertainty. Our most recent internal retention data shows 98% of students who began the programme completed it, due in part to the care and support received from the tutor team. Amy, a student from our Lancaster campus PGCE cohort wrote “I thoroughly enjoyed my time at Cumbria University. I was provided with great opportunities and would recommend the course to future teachers. I was continuously supplied with support and was able to form great relationships with all of my tutors.”            \r\n                               \r\n (https://www.cumbria.ac.uk/study/courses/postgraduate/general-primary-with-qts-5-11-years-/)\r\n","interviewProcess":"You may be invited to attend an interview for this programme and these will take place with our course team. If you are selected for an interview, you will receive full information about the day in advance so that you can prepare.\r\n\r\nDue to Covid-19 interviews are currently taking place virtually via Microsoft Teams. This is subject to change as the situation with the pandemic changes.\r\n","howSchoolPlacementsWork":"The University of Cumbria works in partnership with over 700 schools based across a wide geographical area including Cumbria, North Lancashire and London. \r\n\r\nAs the University is multi-site the schools used for placement depend on the campus a student is based at (i.e. Students based on the London campus attend placement in London). \r\n\r\nSchools are selected based on their current OFSTED grading and their understanding of the University’s programmes and grading criteria.  Schools provide a trained professional mentor who is supported by a dedicated university based academic tutor (Partnership Tutor). \r\n\r\nStudents will undertake three assessed placements that increase in length as they progress through the course experiencing over 120 days in a school setting. Students will experience all primary age ranges depending on the programme selected. From student feedback the average travel time to placement is as follows; less than 30 minutes - 53%, 31 to 60 minutes - 40%, 61 to 90 minutes - 7%. The University places a limit of 90 minutes travel time to placement. \r\n\r\nFurther information about placements can be found at (https://www.cumbria.ac.uk/about/partnerships/placements/education/placement-travel-accommodation-policy/)\r\n","status":1,"createdAt":"2021-11-03T12:34:55.521Z","updatedAt":"2021-11-03T12:52:04.592Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
