{"id":"44eed24c-3422-4473-a183-04cd4cfb6e42","name":"Physical Education","code":"C66X","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"74d64a54-5e34-4590-b6c7-528dd0cf26fe","code":"C6","name":"Physical education"}],"locations":[{"id":"b0b25848-7c8d-44f1-a783-ba58393d13cc","name":"Lancaster","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"9be9f611-2d36-431a-9109-7fcbbfc88fc8","code":"C99","name":"University of Cumbria"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We are happy to accept GCSE equivalency tests from:\nEquivalency Testing\nand\nA Star Equivalency","courseLength":"OneYear","feesUK":9250,"feeDetails":"Stated fees are subject to government confirmation.  ","aboutCourse":"The PGCE programme in your chosen subject will give you the necessary knowledge and skills to meet the standards for Qualified Teacher Status (QTS) and the PGCE award. The PGCE carries 60 credits at Masters Level which could later contribute towards a Master’s Degree in Education (180 credits).\r\n\r\nThe programme covers a wide range of topics set out by the DfE in the Core Content Framework that you will address as a teacher. These include managing behaviour, curriculum, pedagogy, assessment, professional behaviours as well as challenging disadvantage. The topics are research informed and are regularly revisited during the year in various contexts. This approach allows continual reinforcement and deepening of your knowledge and understanding of teaching and learning, and development as a professional, teacher and subject specialist.\r\n\r\nThe course duration is approximately 180 days. You will spend approximately 60 days outside of the classroom on many aspects of teaching. Most of these 60 days of training will be at the Lancaster campus. A number of days will be subject specific, designed to develop your knowledge of how to teach your subject known as Pedagogy for Learning (PFL) days. On these days both School Direct and university based students are taught together which supports a community of practice. The other 120 days will be in two contrasting school placements. For these placements you will be supported by both school and university colleagues to meet the standards for QTS. \r\n\r\nThe course is assessed in two different ways. The programme curriculum and placement involves continuous and formative assessment by school and university colleagues culminating in a pass/ fail summative judgement for the recommendation of QTS using all the accrued evidence. You will develop an electronic portfolio during the year to submit as evidence your development of the necessary knowledge and skills. The two Master's level modules are assessed by the submission of four written assignments on teaching and learning in your subject and wider educational issues. The four written assignments are spread across the year to try to even out workload and two of them are formative to help develop your Masters level writing towards the two summative assignments. They enable you to deepen and demonstrate your growing knowledge and understanding essential to being a competent classroom practitioner.\r\n\r\nThe University of Cumbria and its legacy institutions, St Martins and Charlotte Mason colleges, have a long history of training successful teachers.\r\n\r\nFor information:\r\n(https://www.cumbria.ac.uk/study/courses/postgraduate/secondary-education-with-qts-physical-education-pgce/)\r\n","interviewProcess":"You may be invited to attend an interview for this programme and these will take place with our course team. If you are selected for an interview, you will receive full information about the day in advance so that you can prepare.\r\n\r\nAll candidates undertake a range of tasks including a micro-teaching task, group discussions, individual interview and subject knowledge tasks to test the ability to think and write at Masters level.\r\n\r\nDue to Covid-19, interviews are currently taking place virtually. This is subject to change as the situation with the pandemic changes. ","howSchoolPlacementsWork":"The University of Cumbria works in partnership with over 700 schools based across a wide geographical area including Cumbria, North Lancashire and London. \r\n\r\nAs the University is multi-site the schools used for placement depend on the campus a student is based at (i.e. Students based on the London campus attend placement in London). \r\n\r\nSchools are selected based on their current OFSTED grading and their understanding of the University’s programmes and grading criteria.  Schools provide a trained professional mentor who is supported by a dedicated university based academic tutor (Partnership Tutor). \r\n\r\nStudents will undertake three assessed placements that increase in length as they progress through the course experiencing over 120 days in a school setting. Students will experience all primary age ranges depending on the programme selected. From student feedback the average travel time to placement is as follows; less than 30 minutes - 53%, 31 to 60 minutes - 40%, 61 to 90 minutes - 7%. The University places a limit of 90 minutes travel time to placement. \r\n\r\nFurther information about placements can be found at (https://www.cumbria.ac.uk/about/partnerships/placements/education/placement-travel-accommodation-policy/)","personalQualities":"We're looking for evidence of motivation and appropriate professional values. A strong personal statement conveying an enthusiasm for the subject, for working with young people and for teaching and learning.","otherRequirements":"*  A satisfactory Enhanced Disclosure and Barring Service (DBS) background clearance check.\r\n\r\n* Satisfactory Occupational Health medical check prior to starting the course\r\n\r\n* A satisfactory academic (University) or a satisfactory professional reference if it is more than 5 years since academic work.\r\n\r\n* Evidence of the potential to work at Masters level.","status":1,"createdAt":"2021-07-06T10:48:14.640Z","updatedAt":"2021-10-04T08:57:28.120Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
