{"id":"28b4ced1-769b-4a6c-99d1-45c711f21814","name":"Geography","code":"2QP2","qualification":"pgce_with_qts","startDate":"2024-07-31T23:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3f47e67b-7fa5-4947-a5a0-74d528cd2a87","code":"F8","name":"Geography"}],"locations":[{"id":"3c5a3c8e-5e37-4e2d-a570-7a54447bda1f","name":"North Leamington School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"b8e5946d-a5ef-4de3-8dac-74450e34375b","name":"Lawrence Sheriff School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"3170ade4-748d-4b09-98ea-2f07fa2fb0d9","code":"1GH","name":"Lawrence Sheriff School"},"accreditedBody":{"id":"ef09ce50-ccfc-4346-a0ce-43e840153dab","code":"W20","name":"The University of Warwick"},"profPost":"BO","degreeGrade":"1","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We can accept 3rd party tests from the following approved companies:\n\nEquivalency Testing - Offer a discounted rate of £160 (normal price £175)\n\nA Star Equivalency - Have a special offer for University of Warwick applicants for equivalency exams (all subjects) to be booked for £139 (normal price £165) Please contact cte.admissions@warwick.ac.uk for the discount code.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"You’ll have the opportunity to work alongside experienced teachers and colleagues who can offer examples of good practice and provide advice and support during your training. You’ll spend the majority of your training in your host school and will feel part of the school community. \r\n\r\nAs a guide, you will spend four days a week in your host school and one day a week at Warwick University to develop your subject and professional studies. You many also complete a few alliance training days at Lawrence Sheriff School. To broaden your experience, you will complete a six week placement in a contrasting school, usually after the Christmas break.\r\n\r\nIn order to develop expertise in your chosen subject area, you'll take three core modules. They're all designed to equip you with the knowledge, understanding and practical skills you'll need in your successful teaching career:\r\n\r\n*\tSubject Studies: You'll learn all aspects of how to teach your subject, including planning, teaching, assessment and classroom management.\r\n*\tProfessional Studies: You'll learn about working in classrooms and schools, and the broader context of teaching today.\r\n*\tProfessional Practice: You'll take placements with opportunities for observation, practice and investigation in partner schools.\r\n\r\nYou’ll be assessed in the following three modules:\r\n*\tSubject Studies (PG1) M Level: A series of assessments focussing on both educational theory and issues in your specialist subject (1 x 1500 word formative essay, and 1 x 4000-word essay, 1 x Academic Poster)\r\n*\tReflective Practice (PG2) M Level: A reflective case study on an area of educational practice in your placement school(s) supported by a literature review (1 x 5000-word essay)\r\n*\tProfessional Practice H Level: Meeting the Teachers’ Standards at a Good or Outstanding level (Regular observations by mentors and Teaching Fellows; Tutorials; Professional Digital Portfolio, Viva Voce)\r\n\r\nYou’ll also be assessed on whether you meet the Teachers’ Standards at a level appropriate for a newly qualified teacher.\r\n\r\nAll assignments are submitted in electronic form. Your tutors will give you formal feedback identifying the strengths of the academic piece, and offer any advice for future work.\r\n","interviewProcess":"Interviews are generally held at Lawrence Sheriff School or the partner school you have applied to. We will send you an email to let you know the arrangements, which can vary slightly depending on the school.\r\n\r\nThe selection process lasts approximately half a day, during which you will attend an interview, conduct a short teaching task (usually about 20-30 minutes) and meet members of the department or school team you will be working with. There may also be a tour of the school and for Secondary applicants a discussion relating to your chosen subject.\r\n\r\nAbove is the description of the usual selection process. However due to COVID-19 this is subject to change and some aspects may be conducted remotely.\r\n\r\nIf you are successful at interview, you will be informed via UCAS and the lead school.\r\n","howSchoolPlacementsWork":"You will be able to apply to your chosen school (known as your host school or training location) where you will spend the majority of your time. \r\n\r\nAll partner schools are within a reasonable travelling distance and we will try to ensure that for your six week placement you are placed in a school  that is convenient for you.","personalQualities":"We recommend that you have some experience in mainstream UK schools before applying. Whilst not compulsory, this will give you a flavour for your potential future career, and help you write your application.","otherRequirements":"Before starting your course you must also pass an occupational health check and a criminal record check.\r\n","status":1,"createdAt":"2021-07-06T10:56:19.731Z","updatedAt":"2021-10-04T14:42:30.445Z","canSponsorStudentVisa":"yes","cycle":"2024"}
