{"id":"50a5cb8c-778f-4c3f-b756-1413a33e2281","name":"Chemistry","code":"2WGB","qualification":"pgce_with_qts","startDate":"2024-07-31T23:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"912d4fb4-761b-42e9-8dc6-e968b791ea4e","code":"F1","name":"Chemistry"}],"locations":[{"id":"8fbdc7de-9626-4505-ab9d-1bc53a3d1298","name":"Avon Valley School","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"3170ade4-748d-4b09-98ea-2f07fa2fb0d9","code":"1GH","name":"Lawrence Sheriff School"},"accreditedBody":{"id":"828d1c59-36a8-4678-9a60-662565ae7172","code":"C03","name":"The Cambridge Partnership"},"profPost":"BO","english":"3","maths":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":null,"aboutCourse":"UPDATE 05/01/2021 - recruitment is currently suspended until schools reopen.\r\n\r\nAn intensive programme of initial teacher education which aims to develop your competence and confidence in the teaching of your chosen subject and in the general professional role of the teacher. \r\n\r\nThe intention is to provide you with a set of insights, perspectives and information upon which you can build as your career develops and to present a stimulating, challenging and enjoyable course.\r\n\r\nOn this course you will develop the following:\r\n*\ta broad range of practical teaching skills\r\n*\tappropriate personal qualities and professional attitudes\r\n*\tan informed understanding of curriculum and teaching methodology\r\n*\tthe capacity to reflect critically on professional practice\r\n\r\n\r\nIn school you will have the support of a trained mentor, with whom you meet every week and who oversees and guides your professional development. You are also allocated a Programme Manager and a Subject Tutor and receive at least six supportive visits during the year. In addition, supporting material is provided on the VLE.\r\n\r\nYou are assessed on your teaching in the classroom, written assignments and presentations completed during the year. You must also complete an extensive electronic professional portfolio demonstrating your achievement in relation to the Teachers' Standards for QTS and satisfy the Partnership that you have attended all parts of the course diligently throughout the year.\r\n\r\nYou will be employed and paid a salary by Avon Valley School and will work alongside outstanding practitioners. \r\n\r\nYou will spend Monday to Thursday in school and attend central training on a Friday. This includes Professional Days with the whole cohort together, which explore generic issues such as behaviour for learning and special educational needs, and Subject Days in smaller groups, which focus on subject-specific or phase specific pedagogy. \r\n\r\nThese days are held in a number of different venues (often in Peterborough) which can be quite a distance from Rugby. \r\n\r\nIn the second half of the year you will attend your placement school on a Friday.\r\n\r\nDuring the summer term and before the start of the course, you will need to arrange and carry out a two-day Primary school visit and a one-day visit to a Special School. This is to see how the practice in these schools compares with that in a mainstream secondary school. \r\n\r\nThe course will start in late August with two or three induction days (often in Peterborough).\r\n\r\n\r\n","interviewProcess":"Interviews are held at Avon Valley School. \r\n\r\nThe selection process lasts approximately half a day, during which you will attend an interview, conduct a short teaching task (usually about 20-30 minutes) and meet members of the department or school team you will be working with. There may also be a tour of the school and for Secondary applicants a discussion relating to your chosen subject.\r\n\r\nAbove is the description of the usual selection process. However due to COVID-19 this is subject to change and some aspects may be conducted remotely.\r\n\r\n","howSchoolPlacementsWork":"To gain additional experience you will attend a contrasting school for your placement. This will be on a Friday from mid-January until approximately the end of May.\r\n\r\nYou are expected to organise your own placement, but help can be provided if needed.","personalQualities":"","otherRequirements":"","status":2,"createdAt":"2021-07-06T10:56:19.771Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"\r\n\r\nYour salary will be point 1 on the unqualified teacher scale which is currently £18,169 (2020-21).\r\n\r\nIf you wish to complete a PGCE in addition to QTS, then the fee for this will be £2,000 (payable by the trainee).\r\n\r\n"}
