{"id":"a101246b-01c9-4fb2-ad56-d49d7ff4e473","name":"Primary","code":"2G8J","qualification":"pgce_with_qts","startDate":"2023-07-31T23:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"66fbed39-5e93-4a07-868f-aa8917d442cc","name":"Paddox Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"bdf0a72c-0eba-43d7-85b7-1133caebbdd0","name":"Moat House Primary School","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"3170ade4-748d-4b09-98ea-2f07fa2fb0d9","code":"1GH","name":"Lawrence Sheriff School"},"accreditedBody":{"id":"ef09ce50-ccfc-4346-a0ce-43e840153dab","code":"W20","name":"The University of Warwick"},"profPost":"BO","degreeGrade":"1","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"Equivalence tests will only be offered in specific circumstances. Please contact [cte.admissions@warwick.ac.uk](cte.admissions@warwick.ac.uk) for more information.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"You’ll have the opportunity to work alongside experienced teachers and colleagues who can offer examples of good practice and provide advice and support during your training. You’ll spend the majority of your training in your host school and will feel part of the school community. \r\n\r\nAs a guide, you will spend four days a week in your host school and one day a week at Warwick University to develop your subject and professional studies. To broaden your experience, you will complete a full terms placement in a contrasting school, running from after the Christmas break until the Easter holiday.\r\n\r\nIn order to develop expertise in your chosen subject area, you'll take three core modules. They're all designed to equip you with the knowledge, understanding and practical skills you'll need in your successful teaching career:\r\n\r\n\r\n*\tProfessional Studies\r\nYou'll develop a good understanding of the key factors in successful learning and teaching. You'll address central issues of planning, teaching, assessing and behaviour management as well as addressing such issues as the safeguarding of children.\r\n\r\n*\tSubject Studies\r\nYou'll cover core subjects (English, Mathematics and Science) and non-core (Foundation) subjects. Foundation subjects are covered through ‘taster’ sessions for each subject: Art and Design, Computing, Design and Technology, Geography and History, Music, Modern Foreign Languages (MFL) Physical Education (P.E.), Religious Education (R.E.) and PSHE.\r\n\r\n\r\n*\tProfessional Practice \r\nYou'll take placements in a different setting to broaden your experience. You'll develop an awareness of your professional development, reflect on progress on school placements and set targets for successful completion of the programme.\r\n\r\n\r\nWe will also ask you to choose a specialism: Early Years, Special Educational Needs, English, Mathematics or Science. The specialism is a unique opportunity to enhance your knowledge and skills in a critical area of Primary education.\r\n\r\nYou’ll be assessed in the following three modules:\r\n\r\n*\tProfessional Studies\r\nCoursework focusing on a key issue and combining theory with your practice in schools (Master's level assignment – 5,000 words)\r\n\r\n\r\n*\tSubject Studies\r\nCoursework focusing on one aspect of practice in each of the 3 core subjects (Master's level assignment – 3,000 words); and looking at practice in one strand within your Specialism across a range of contexts (e-presentation – 2,000 words).\r\n\r\n\r\n*\tProfessional Practice\r\nMeeting the Teachers’ Standards – at a Good or Outstanding level (weekly observations by School Mentor; visits by Link Tutor, and tutorials with Personal Tutor).\r\n\r\n","interviewProcess":"Interviews are held at the partner school you have applied to. We will send you an email to let you know the arrangements, which can vary slightly depending on the school.\r\n\r\nThe selection process lasts approximately half a day, during which you will attend an interview, conduct a short teaching task (usually about 20-30 minutes) and meet members of the school team you will be working with. There may also be a tour of the school.\r\n\r\nAbove is the description of the usual selection process. However due to COVID-19 this is subject to change and some aspects may be conducted remotely.\r\n \r\nIf you are successful at interview, you will be informed via UCAS and the lead school.\r\n","howSchoolPlacementsWork":"You will be able to apply to your chosen school (known as your host school or training location) where you will spend the majority of your time. \r\n\r\nAll partner schools are within a reasonable travelling distance and we will try to ensure that for your placement you are placed in a school  that is convenient for you.","personalQualities":"We recommend that you have some experience in mainstream UK schools before applying. Whilst not compulsory, this will give you a flavour for your potential future career, and help you write your application.","otherRequirements":"Before starting your course you must also pass an occupational health check and a criminal record check.\r\n","status":1,"createdAt":"2021-07-06T10:56:19.616Z","updatedAt":"2021-10-04T14:47:43.979Z","canSponsorStudentVisa":"yes","cycle":"2024"}
