{"id":"ea67ba89-ab67-4d45-8c2a-c55984209de0","name":"Primary","code":"2NXZ","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"64e9c5a5-c30d-4adc-b22b-706757d21bde","name":"Talavera Junior School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"1d85b1c7-dfc9-4826-81b5-a49f9cd7fbd3","name":"Alderwood School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"38473b38-c79c-47be-b5ef-7fc0b2ed6cd6","name":"St Michael's CE Infant School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"9c3cd484-3544-4904-bd52-284efa066913","name":"Talavera Infant School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"c2dbde32-9bf1-4457-9369-a3f61dc5103f","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"},{"id":"3231fc67-310d-4727-a1f6-856efc3b86d8","name":"Park Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"428ce10a-6e10-43fe-a948-e9391ed9c9b0","name":"Wellington Community Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"ccadfb5f-c68f-4b1e-b61b-d3dd371b8d34","name":"St Michael's CE Junior School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"829f9f39-4a5b-416a-bf01-8673634f6164","code":"175","name":"Newport Junior School"},"accreditedBody":{"id":"3700fb02-7007-40c8-9127-b070e146d6cb","code":"W76","name":"University of Winchester"},"profPost":"PG","degreeGrade":"0","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9000,"feeDetails":"Fees charged by the University of Winchester will be £9000. Trainees may apply for a student loan in order to finance the course. This is a non-salaried route.","aboutCourse":"This School Direct training programme will be delivered by Alderwood School (formerly Newport Junior School) in conjunction with the University of Winchester. Partner schools are: St. Michael's Infant and Junior Schools, Talavera Infant and Junior Schools, Park Primary and Wellington Primary – all schools in Aldershot.\r\nThe University of Winchester is its own examining and awarding body and has responsibility for setting assessments, moderating standards in accordance with regulations, quality assurance procedures and receiving feedback from all stakeholders. The University, in conjunction with the school, can offer either QTS or PCGE qualifications.\r\nFees charged by the University of Winchester will be £9000. Trainees may apply for a student loan in order to finance the course. This is a non-salaried route.\r\nTrainees must complete a minimum of 120 days on school placements. School placements must be carried out at 2 different schools and in 2 consecutive age phases. Infant and junior schools close to each other present an ideal opportunity for trainees to complete their training at linked sites. Where schools are all-through primary, links will be made with other local schools. Each trainee will be assigned an experienced link tutor from Alderwood School who will guide and support them throughout the training.\r\nWe prefer a minimum of an upper second class degree. However, we would be willing to consider a lower classification of degree for applicants if other qualifications and / or experience is strong. All applicants must have achieved a standard equivalent to a Grade C in the GCSE examinations in English, Mathematics and Science. ","interviewProcess":"The selection of candidates for interview is guided by DfE Initial Teacher Training (ITT) requirements. In calling candidates to interview, the University has expressed an initial satisfaction with their academic achievement and potential to successfully complete the School Direct route into training. Candidates will need to provide evidence of their qualifications to date and of their identity. \r\nInterviews are carried out at either Alderwood School or one of the linked partner schools. There would usually be a representative from the University of Winchester on the panel, along with 2 headteachers from the partner schools.\r\nThere is usually one interview, at which candidates are required to teach a group of pupils, undertake a written English task and a Maths task, and answer questions in a formal interview. The English task provides an opportunity to assess candidates’ ability to communicate using Standard English and their ability to read with understanding. The Maths task gives candidates the opportunity to demonstrate that they can apply basic maths skills to a range of problems. The whole interview process usually lasts around 3 hours.\r\n","howSchoolPlacementsWork":"Trainees must complete a minimum of 120 days on school placements. School placements must be carried out at 2 different schools and in 2 consecutive age phases. Infant and junior schools close to each other present an ideal opportunity for trainees to complete their training at linked sites. Where schools are all-through primary, links will be made with other local schools. Each trainee will be assigned an experienced link tutor from Alderwood School who will guide and support them throughout the training.","personalQualities":"Applicants should be able to demonstrate: \r\n•\tunderstanding of what constitutes excellence in primary education; \r\n•\ttheoretical knowledge of excellent and innovative practice; \r\n•\tgood communication skills;\r\n•\tenthusiasm, high expectations and a high level of commitment;\r\n•\tability to listen and to understand the whole personal development of children;\r\n•\tempathy with children.\r\n","otherRequirements":"","status":1,"createdAt":"2021-07-12T13:48:49.298Z","updatedAt":"2021-07-12T14:41:55.470Z","canSponsorStudentVisa":"yes","cycle":"2024"}
