{"id":"09c8599a-48aa-44b3-b1fd-344242a878e0","name":"Art and Design","code":"2V2F","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"d461a678-3335-4ca2-9616-1dc479d31a49","code":"W1","name":"Art and design"}],"locations":[{"id":"53bb71f1-15a8-47f7-acfd-fa3bd6161a95","name":"The Olympus Academy Trust","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"faeb2c5e-3f00-47d1-8a83-6e93d578b675","code":"25X","name":"The Olympus Academy Trust"},"accreditedBody":{"id":"e1473ef6-b29f-4e0b-adff-558ab367008a","code":"2AV","name":"Cabot Learning Federation SCITT"},"profPost":"BO","degreeGrade":"1","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feeDetails":"We are not able to support with travel costs, however, all schools are really close to each other – no further than 15-20 minutes travel time from our lead school in Bradley Stoke.","financialSupport":"You may be eligible for financial support while you study, including bursaries, scholarships and loans.","aboutCourse":"You will follow a blended course which sees you attending both Cabot Learning Federation Institute and school led training, based at the Olympus Academy Trust (OAT), and of course, two placements in our schools. We offer the School Direct route to PGCE. Further information can be found at [OAT](https://www.olympustrust.co.uk/Careers/Get-Into-Teaching/)\r\n\r\nAt Cabot Learning Federation Institute you will attend sessions on how to teach your subject and to ensure your subject knowledge continues to develop in order to be able to deliver the National Curriculum at KS3, KS4 and KS5. You will learn how to plan lessons and pedagogical theories relating to the delivery of your subject. You will learn in a group with other trainees who are following different routes allowing you share your own experiences and to learn from their experiences in other schools. These are supportive and practical sessions.  \r\n\r\nAt OAT you will attend sessions focused on Professional Development, learning all you need to know as a teacher about e.g. safeguarding; behaviour management; how to meet the needs of pupils with Special Educational Needs; assessment, marking and giving good quality feedback; lesson planning; working with parents and other professionals; how to manage workload and keep healthy etc. These sessions are lively, interactive and delivered so you also pick up ideas to use in your lessons in school. They are taught by teachers with many years of classroom experience. \r\n\r\nYou will teach for a minimum of 120 days in two of our schools, although in reality, this is often in excess of 135 days, as we organise our course to maximise your learning in our school settings. You will begin with observing teaching and work your way towards a full 80% teaching load over the year. However, it is not a race! We encourage you to develop at your own speed, focusing on delivering outstanding teaching as you slowly increase your contact time. You will teach at KS3 and KS4 and have access to teaching at Post 16.\r\n\r\nYour teaching will be assessed against the Teaching Standards at the end of the year. You will complete 4 academic assignments (set and marked by University of West of England tutors); at least two of these at Master’s level. The topics are carefully chosen to enhance your teaching and develop your understanding of how research can impact positively in the classroom.\r\n","interviewProcess":"If your academic qualifications are appropriate, your personal statement is convincing (and accurate in terms of grammar) and your references supportive, you will be called to interview.  Interviews will take place in one of our schools*. \r\n\r\nTypically, an interview day consists of:\r\n- working with groups of students\r\n-the opportunity to talk with students/staff\r\n-interview tasks to complete\r\n-an individual interview\r\n-the opportunity to demonstrate subject knowledge \r\n\r\nWe also include:\r\n-a tour of the school \r\n-a group discussion\r\n-a presentation\r\n\r\nYou will be interviewed by one of our ITT co-ordinators and either the Headteacher or Head of Department from the school you are interviewed at. If you need to prepare any materials you will be informed of this beforehand, however, we make no apologies for asking you to sometimes ‘think on your feet’; this is an essential skill you will need for teaching! You will be told if you are going to be offered a place as soon as we have decided – often by the following day.\r\nIt is a rigorous process, but we want to choose the best candidates to train at the Olympus Academy Trust.  We want prospective teachers who are enthusiastic and passionate about their subject, committed to a career in teaching and ready to face the challenges of the training year.\r\n\r\nDuring these unprecedented times – we may face  further restrictions on entry into schools or  further lockdowns. If this is the case, we will continue to recruit, but will run interviews remotely.\r\n","howSchoolPlacementsWork":"We select your teaching placements by considering your strengths, attributes and skills for your first placement. When we have got to know you a little more we then carefully select your second placement to allow you to develop still further. \r\n\r\nAll our schools are within South Gloucestershire, the furthest being 16 miles from our lead school, Bradley Stoke Community School. However, most are within 15 minutes travelling time. They vary from urban, suburban to rural in nature.\r\n\r\nAll schools are comprehensive and mixed schools with our primaries covering Early Years to Y6 and almost all our secondaries are 11-18 and all have Post 16 provision. We have 11 secondary schools and 9 primary schools. You will spend at least 120 days in school over the year – often very much more than this as we are deeply committed to a schools-based training programme. \r\n\r\nYou will be placed in two schools over your training, generally in two separate, consecutive blocks of time.\r\nThese are the schools we work with at Secondary– links to their websites and a brief description of each school is available on our website [OAT](https://www.olympustrust.co.uk/Careers/Get-Into-Teaching/) \r\n\r\nAbbeywood Community School;\r\nBradley Stoke Community School;\r\nBrimsham Green School;\r\nBristol Technology and Engineering Academy;\r\nThe Castle School, Thornbury;\r\nChipping Sodbury School;\r\nDownend School;\r\nMangotsfield School;\r\nMarlwood School, Alveston;\r\nPatchway Community School;\r\nWinterbourne Academy\r\n","personalQualities":"We are looking for creative and dynamic individuals who can motivate and inspire young people. \r\nResilience, good communication and inter-personal skills, determination, self-awareness and a willingness to learn through success and mistakes are essential personal attributes for a career in teaching. Being well-organised and reflective will help you to progress quickly.\r\nWe expect applicants to come from a wide range of backgrounds and have a wide range of skills. Whether you are coming straight from university or making a career change, all are very welcome; we believe our School Direct Programme is enriched by this variety. \r\n","otherRequirements":"*Complete the DBS process and health checks\r\n*Evidence of recent school experience in a state school (or a well-informed understanding).\r\n*Appropriate levels of numeracy and literacy (assessed)\r\n*You may need to complete an additional Subject Knowledge Enhancement course if, e.g., your first degree is different from the subject you wish to teach; you are applying to do the PE with Ebacc course; you are applying to do Design Technology. These courses are fully funded and often have a bursary attached. They are intended to deepen or extend your subject knowledge prior to teaching. This will be discussed at interview.\r\n\r\n","status":1,"createdAt":"2021-07-06T10:52:31.576Z","updatedAt":"2021-09-01T11:38:29.830Z","canSponsorStudentVisa":"no","cycle":"2024"}
