{"id":"2b3b1941-e742-448e-98fb-9d28c7939f2c","name":"Chemistry","code":"R909","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"912d4fb4-761b-42e9-8dc6-e968b791ea4e","code":"F1","name":"Chemistry"}],"locations":[{"id":"8f21751c-8d22-45c2-87e6-9a4d88aad481","name":"Forest Gate Community School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"74d2166e-2572-4063-bb56-4f103d0fe715","code":"3T1","name":"Forest Gate Community School, Community Schools Trust"},"accreditedBody":{"id":"fce142fe-a2a1-4f4d-b2db-2e508280e68f","code":"24M","name":"London District East SCITT"},"profPost":"PG","degreeGrade":"1","additionalDegreeSubjectRequirements":"false","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"At Forest Gate Community School (FGCS), you will be taught how to deliver the Chemistry specification as part of the Science GCSE programme of study.\r\n\r\nYou will be supported by a dedicated mentor, who will be a science specialist, where you will follow our bespoke curriculum model. \r\n\r\nWe have a  highly effective science curriculum that is clearly mapped out from years 7-11 that is broken down into key objectives (KOs). This is linked to our dynamic progress reporting system (DPR) with is the back bone of our curriculum plan.\r\n\r\nYou will be assessed weekly by your mentor as well as at key points throughout the programme. You will have key tasks that you will be supported and guided through to ensure that you are fully aware of what is expected of you throughout the programme.\r\n\r\nWe have a team of professionals who will support and guide you through your training, both in the science department and whole school. You will attend weekly training sessions with the other trainees in the school, often with trainees from the other schools in the trust too.\r\n\r\nYou will follow a well planned professional development (PD) programme that is designed to help you be an outstanding classroom practitioner. The PD programme is planned in a very logical and practical manner. This is so that you gain the most important skills first and then quickly build on them to rapidly acquire the many skills that you need to be successful in the demanding role of a teacher.\r\n\r\nWe have an extremely high pass rate for our trainees and have been delivering teacher training for many, many years. If you train at FGCS it will make you very employable, we find that 90% of our trainees are offered the first job that they apply for. Our trainees also find themselves employed in our trust, many securing middle and senior leadership roles as they progress through their careers.","interviewProcess":"If you are invited to interview you will usually be with us for most of the morning. The day will look something like this.\r\n\r\n1 Meet course leaders at Forest Gate Community School - 20 min\r\n2 Tour of the school- 30 min\r\n3 A task where you teach us a skill that you have (it can be anything) - 10 min\r\n4 A written task - 45 mins\r\n5 An interview with two members of staff- 45 mins\r\n\r\n\r\n","howSchoolPlacementsWork":"You will be based at FGCS for the majority of your placement. You will however undertake a second placement in a different school that we will organise for you.\r\n\r\nYour second placement is usually for half a term and will be either at one of the other schools in our schools in the trust, or with one of the schools that we partner with. Your second placement will be discussed with you and your mentor you well in advance so that it is a seamless transition.\r\n\r\nYou will be assigned a second mentor in your placement school but you will still be in contact with your main mentor at FGCS so they can continue to  support you.\r\n\r\nMost of the schools in the trust are 11-16, although we do have one with a 6th form that is a UTC in Norwich. This sounds a long way but you can be there in an hour by train, if 6th from experience is something that you would really like to experience.\r\n","personalQualities":"We are looking for candidates that want to make a difference to the life chances of the students in our trust. We want candidates that will go above and beyond to make this happen.\r\n\r\nWe are looking for candidates that are prepared to push themselves to be better, not because they are not good, but because we can all improve.\r\n\r\nWe want candidates that are open to advice and can take the support that is offered so that they constantly improve.\r\n\r\nWe want candidates that are reflective, resilient, caring and self motivated. \r\n","otherRequirements":"All our trainees will  to undergo an enhanced DBS check to check their suitability to work with children.","status":1,"createdAt":"2021-10-18T13:51:56.160Z","updatedAt":"2021-10-18T14:09:55.100Z","canSponsorStudentVisa":"no","cycle":"2024"}
