{"id":"b6986c65-d056-4ef3-b5bb-fb2037b19f4f","name":"Primary","code":"3CVK","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"80d0ef33-dd71-485f-b7d8-f57380a78502","name":"London Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"d2a4c8ba-c207-4905-9b58-9998ce068003","name":"Deansbrook Junior School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"343b3a1c-cf42-46e8-b081-1aba3813b8fc","name":"Fairway Primary School and Children's Centre","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"8c1b173d-7a58-4a5d-af75-98ad57a06ddb","code":"2FR","name":"AIM Alliance Schools"},"accreditedBody":{"id":"feecdec5-259c-45e3-b1cf-4e391936ee90","code":"H36","name":"University of Hertfordshire"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We accept equivalencies from equivalencytesting.com","courseLength":"OneYear","feesUK":9250,"aboutCourse":"As a school-led route the great majority of your time will be spent in your training school, and the content and focus of many aspects of the training programme will be targeted to meet your individual needs, by utilising the resources of the school and their alliance partners. In addition, at Hertfordshire University you will also benefit from access to the University's extensive resources, including those provided by the library and student support services.\r\n\r\nThe School Direct programme provides you with a series of subject enhancement sessions, and a programme of professional studies which will be run at the University. These may include sessions which:\r\n•Allow you to visit a variety of partnership schools and non-formal educational sites to enhance learning in specialist areas.\r\n•Provide you with opportunities to enhance your knowledge and pedagogy of your subject, or specialist areas of the curriculum.\r\n•Develop your understanding of key contemporary issues within education, such as those around inclusion or EAL and SEND provision in schools.\r\n","interviewProcess":"All Interviews will be held virtually with a 'panel' consisting of the Headteacher of the recruiting school, the mentor at the recruiting school and an Alliance representative.  You will also be asked to provide a practice lesson on a subject related topic with sample literacy and numeracy tasks.  \r\n\r\nYou will be asked to provide copies of your original certificates and photo identification.\r\n\r\n","howSchoolPlacementsWork":"When you are training with us you will train for the 1st and 3rd term within your 'host' school and then experience another school within the Alliance in the 2nd term.  \r\n\r\nOur lead mentor will visit you within your second setting to ensure you are supported throughout this time along with a mentor being provided every step of the way at the school. \r\n\r\nThis provides a chance to experience a different setting and perfect your practice whilst working towards the teaching standards.  You will then be able to learn your new skills and experience back at your host school.  \r\n\r\n","personalQualities":"Above all else we want to see that you like and can interact appropriately with children and young people. We want to see that you:\r\n•\tlike people and can interact with them appropriately\r\n•\tare determined, trustworthy and resilient\r\n•\tshow patience and kindness to others, and don’t harbour grudges\r\n•\tcan engage peoples’ attention, and adapt to situations as they unfold \r\n\r\nYou need to be very clear about why you want to become a teacher, the skills involved and what you can bring to the profession.\r\n","otherRequirements":"\r\nYou must complete a satisfactory Enhanced DBS check, submit a health questionnaire.  Further details will be sent to you on your offer. \r\n","status":1,"createdAt":"2021-07-06T10:49:13.551Z","updatedAt":"2021-09-14T13:17:09.929Z","canSponsorStudentVisa":"no","cycle":"2023"}
