{"id":"deb41740-61a0-4f93-8ec9-4b4e13c586bc","name":"English","code":"35X6","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3aed1aa8-ae46-4b68-92bb-a6cc20655c59","code":"Q3","name":"English"}],"locations":[{"id":"80d0ef33-dd71-485f-b7d8-f57380a78502","name":"London Academy","isPublished":"N","status":"N","vacancies":"F"},{"id":"d6dd80fd-5bff-4080-964f-42cb6f091cb4","name":"Mill Hill County High School","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"8c1b173d-7a58-4a5d-af75-98ad57a06ddb","code":"2FR","name":"AIM Alliance Schools"},"accreditedBody":{"id":"9188f17a-79c4-43a9-b459-4952815b739a","code":"M80","name":"Middlesex University"},"profPost":"PG","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feeDetails":"You will pay £9250 to the university however you may be entitled for a bursary. ","aboutCourse":"This is a PGCE course in partnership with Middlesex University.\r\n\r\nWhether you are attending University or additional professional sessions within your host school, you will be working towards meeting the national Teaching Standards. Within the school setting, as your confidence and knowledge develops, you will be mentored and guided to work towards managing a trainees teaching timetable by the final term of your course.  You will then be prepared to teach a Newly Qualified Teachers timetable the following year.  We will fully support you and tailor the programme as much as possible to accommodate  your needs.  In addition, at Middlesex you will also benefit from access to the University's extensive resources, including those provided by the library and student support services.\r\n\r\nThe Middlesex School Direct programme provides you with a series of subject enhancement sessions, and a programme of professional studies which will be run at the University and at your host school. These may include sessions which:\r\n•Allow you to visit a variety of partnership schools and non-formal educational sites to enhance learning in specialist areas.\r\n•Provide you with opportunities to enhance your knowledge and pedagogy of your subject, or specialist area of the curriculum.\r\n•Develop your understanding of key contemporary issues within education, such as those around inclusion or EAL and SEND provision in schools.\r\n\r\nYou will critically evaluate the effectiveness of a wide range of resources and your own lesson plans. You will analyse research data and critically evaluate how research has contributed to the knowledge and understanding of how to teach effectively.\r\n\r\nIn addition to developing the knowledge and skills required to teach, you will also be able to identify and evaluate effective strategies for assessing children's learning through formative and summative assessment strategies. You will learn to critically evaluate the effectiveness of a wide range of resources for your subject and understand the importance of literacy, numeracy and ICT in delivering the curriculum.\r\n\r\nFor further information please see www.mdx.ac.uk/courses/postgraduate/English\r\n","interviewProcess":"The Head of Department at the 'host' school will be interviewing you along with a member of the Senior Management Team.  A representative of the University will also be involved along with the Lead Phase Mentor.  You will also be asked to prepare a lesson or part of a lesson in your subject to deliver to a group of students in order to assess your interaction and communication skills with young people. You will also be asked to sit a brief literacy and numeracy task  \r\n\r\nYou will be asked to bring your certificates and photo identification with you on the day. \r\n\r\nOne interview will take place at the school and then a further interview may take place with the university. \r\n","howSchoolPlacementsWork":"\r\nWhen you are training with us you will train for the 1st and 3rd term within your 'host' school and then experience another school within the Alliance in the 2nd term.  \r\n\r\nOur lead mentor will visit you within your second setting to ensure you are supported throughout this time along with a mentor being provided every step of the way at the school. \r\n\r\nThis provides a chance to experience a different setting and perfect your practice whilst working towards the teaching standards.  You will then return to your host school to complete your training.  \r\n\r\n","personalQualities":"Above all else we want to see that you like and can interact appropriately with children and young people. We want to see that you:\r\n\r\n*\texcellent communication skills\r\n*      have a desire to teach and make a difference\r\n*      like people and can interact with them appropriately\r\n*\tare determined, trustworthy and resilient\r\n*\tshow patience and kindness to others, and don’t harbour grudges\r\n*\tcan engage peoples’ attention, and adapt to situations as they unfold \r\n*     good time management and organisational skills in order to meet the   demands of the profession\r\n","otherRequirements":"You must complete a satisfactory Enhanced DBS check, submit a health questionnaire and a suitability to teach declaration. \r\n ","status":2,"createdAt":"2021-07-06T10:49:13.340Z","canSponsorStudentVisa":"no","cycle":"2023"}
