{"id":"15ef2bb7-6974-476b-a310-ee23c7eb64b8","name":"Mathematics","code":"G1X1","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"72345aa7-096c-488f-8649-085b8178cadb","code":"G1","name":"Mathematics"}],"locations":[{"id":"dc4b9d68-b157-4d09-ae46-fcc4f5db9f20","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"ae32e7cd-13d7-420b-80f6-dd787ed28b38","code":"B84","name":"Brunel University London"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"The equivalency tests are only available for non-home students, as they will not have had the opportunity to take the GCSE qualifications in order to meet the entry criteria. For home students, it is a University requirement for applicants to have the actual qualification.  The GCSE equivalence demonstrates an applicant has achieved the equivalent of a grade C/level 4 at GCSE, it does not provide the actual qualification which is necessary.","courseLength":"OneYear","feesUK":9250,"feesInternational":16825,"feeDetails":"Fees for 2022/23 entry \r\n\r\n* UK/EU students full-time: £6,170 (Schools Direct); £9,250 (Core)\r\n(Note: European fees TBC shortly)\r\n\r\n* International students: £16,825 full-time \r\n\r\n* UK/EU students can opt to pay in six equal monthly instalments: the first instalment is payable on enrolment and the remaining five by Direct Debit or credit/debit card.\r\n\r\n* Overseas students can opt to pay in two instalments: 40% on enrolment, and 60% in January for students who commence their course in September (or the remaining 60% in March for selected courses that start in January).\r\n","financialSupport":"Brunel offers the following Postgraduate Scholarships, prizes and further fee reductions:\r\n\r\n•         Postgraduate Academic Excellence Scholarship – 15% tuition fee discount, plus additional 15% if a Brunel Graduate.  No application is required.  Brunel will automatically assess your suitability in the summer\r\n\r\n•         PGCE Access Scholarship - £2,500 with no application required.  Brunel will automatically assess your suitability in the summer.  \r\n\r\nFor full terms and conditions please visit the scholarships page on our website: http://www.brunel.ac.uk/scholarships","aboutCourse":"Brunel’s PGCE in Secondary Education (Mathematics) is designed to prepare you to teach pupils aged 11 to 16 in line with the National Curriculum for Mathematics (DfE, 2013) with a focus on developing their maths skills in preparation for compulsory exams and also for life beyond school.  \r\n\r\nThe need for qualified, enthusiastic teachers with an understanding of the demands society places on young people has never been greater. The opportunity to educate children and young people, and learn from them in return, is immensely rewarding.\r\n\r\nSchools are seeking teachers with high levels of pedagogical competence and skill, as well as advanced subject knowledge for teaching as well as knowledge of the theories, policies and systems relevant to education.\r\nThe focus of your studies will be on the principles and methods of teaching and learning delivered through three core modules, together with compulsory, practical school-based teaching placements.  Your progress will be assessed in both areas.\r\n\r\nAs part of your teacher education, you will be taught how to use subject knowledge and relevant course specifications to plan and deliver the curriculum for pupils from 11-16, including examination and vocational courses.\r\n\r\nYour placement will typically take you into partner schools or other educational settings in and around London for at least 120 days in block placements in two or more different contexts working with a school-based mentor.\r\n\r\nLinks with schools across our partnership enable you to undertake placements that will equip you with the skills to work with young people in a diverse range of educational contexts. Brunel's education department was highly praised for this partnership work in the 2015 Ofsted inspection – Ofsted graded Brunel’s Initial Teacher Education Partnerships as ‘Outstanding’ in all areas.\r\n\r\nAs you progress through your own development and learning on the course, you will be encouraged to reflect critically and constructively on your own and others’ teaching practices in relation to a range of aspects including national and regional priorities and policies, and current research.\r\n\r\nAt the heart of the programme is the commitment to ensuring that your practice will impact positively on pupil progress over time, and partnership activities with schools will contribute to school improvement in which you will play a central part.\r\n\r\nUpon successful completion of the course, you will receive both a postgraduate certificate in Education (PGCE) and a recommendation for Qualified Teacher Status (QTS).","interviewProcess":"If your UCAS application is successful, you will be invited to attend an interview. Depending on government guidance, the interview may take place online (for example, via the Zoom platform).  The interview process will normally include a subject knowledge task, a written communication task, a mini-lesson and a formal interview. These are led by members of the Initial Teacher Education team at Brunel.","howSchoolPlacementsWork":"School-based professional learning is a compulsory element of all programmes leading to a recommendation for QTS. The course involves the statutory requirement of at least 120 days of school experience in the form of block school placements undertaken in at least two different contexts.\r\n\r\nSchool experience will take place as planned, but in case of further disruption students will be able to continue working with the school, for example, working with small groups in a social distanced environment and supporting with the planning of online teaching and associated resources.  \r\n\r\nWe will work with DfE guidance in relation to any such advice about working with schools.  \r\n\r\nOur current partnership schools are mainly located in the West London area and adjoining Home Counties. We have developed close links with a number of very good schools over a number of years, and offer placements within carefully chosen schools that provide an appropriate professional learning experience. The ethnic and cultural diversity of the schools we work with is a distinctive aspect of our provision and we are equally proud of the diversity of our student teacher cohort, who reflect the communities in which many of them go on to work as teachers.\r\n\r\nWe also offer student teachers the opportunity to experience placements in alternative settings, which include special schools, Pupil Referral Units (PRUs), young offenders institutions. This further demonstrates our commitment to preparing teachers to work with young people in a diverse range of educational contexts.\r\n\r\nYou will be allocated a school-based mentor, selected for their experience and expertise, who is there to help you develop and learn while you are on placement. The importance of this person should not be underestimated. Teaching is a very challenging profession and with the help of your school-based mentor and your University tutor we aim to make sure that you have support every step of the way, encouraging reflection and development.\r\n\r\n","personalQualities":"To further strengthen your application, we also recommend that applicants have: •Modules within your degree course which should provide a foundation of preparatory knowledge for the phase or subject you are applying to teach;\r\n•An understanding of statutory requirements for your subject area within the state school sector;\r\n•An awareness of recent government policy or initiatives in education and your subject area\r\n•Recent and relevant experience of state school education in England;\r\n•The ability to communicate effectively in both spoken and written English;\r\n•An enthusiastic and energetic approach which communicates clearly your commitment to teaching and working with young people.\r\n","otherRequirements":"We ensure that all student teachers have been subject to Disclosure and Barring Service (DBS) criminal records checks, including a check against of the children’s barred list. \r\n\r\nWe undertake our responsibility to ensure that the student teachers are not, therefore, disqualified from childcare or that the student teacher has obtained a childcare disqualification waiver from Ofsted. \r\n\r\nThe DBS application costs £46.81 (this amount may be subject to change) and we will send further instructions. For further guidance visit: (https://www.brunel.ac.uk/study/admissions/professional-course-requirements) or email (dbs@brunel.ac.uk).\r\n\r\nPlease note, all student teachers are required to complete a medical questionnaire as part of the enrolment process.","status":1,"createdAt":"2021-07-06T10:48:49.080Z","updatedAt":"2021-10-04T08:13:12.341Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
