{"id":"1d54081e-13d4-48fd-8373-603063b8ff7a","name":"Modern Languages","code":"E778","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"P","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"9727f674-61ba-4efa-b1f2-21ec7e354442","code":"15","name":"French"},{"id":"ce8523ef-9236-4cd9-b260-d826c7a521b3","code":"ML","name":"Modern Languages"},{"id":"fbb00c08-2dbc-4f26-adb3-3b23afba18c1","code":"17","name":"German"},{"id":"e34fd2a3-a32e-44e9-aea1-666badf3ac03","code":"22","name":"Spanish"}],"locations":[{"id":"dc0567e2-372c-4210-8c42-4ea67343a1d2","name":"East Midlands & South Lincolnshire Hub","isPublished":"Y","status":"R","vacancies":"P"},{"id":"a6d33699-2d98-4814-a381-25ba61dd6188","name":"Oundle Hub","isPublished":"Y","status":"R","vacancies":"P"},{"id":"482fdb03-72ec-4871-b898-05870c7d80d0","name":"Humber and North Lincolnshire Hub","isPublished":"Y","status":"R","vacancies":"P"},{"id":"5d2c38da-7f79-4aaa-8b5e-258cf4a3e3e3","name":"Sheffield Hub","isPublished":"Y","status":"R","vacancies":"P"},{"id":"a0cbb2e4-b5fd-44c8-b6a6-4109a297342c","name":"South London Hub","isPublished":"Y","status":"R","vacancies":"P"},{"id":"7393fe42-093a-4469-9f49-4f566dd12877","name":"Abingdon and Oxfordshire Hub","isPublished":"Y","status":"R","vacancies":"P"},{"id":"eef0feb1-911f-4b75-9ee5-293d05dcaf2c","name":"South Manchester Hub","isPublished":"Y","status":"R","vacancies":"P"},{"id":"1290abc9-9010-4f01-8615-e919d6598571","name":"North London Hub","isPublished":"Y","status":"R","vacancies":"P"}],"trainingProvider":{"id":"481328de-4b05-44f3-abf1-d31b85941df9","code":"2F1","name":"The National Modern Languages SCITT"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Equivalent to GCSE Grade 4/C or above. \n\nIf English is not your first language, you must have an IELTS score of 7.0 with a minimum of 6.5 in all skills or equivalent.","courseLength":"TwoYears","feesUK":6000,"feesInternational":6000,"feeDetails":"Please be aware that the course fee is £6000 per annum. \r\n\r\nWe are not a licenced sponsor of student visas and can therefore not support an application from outside the EEA. Please use the link below for further information.\r\n(https://www.gov.uk/student-visa)\r\n","financialSupport":"You may be eligible for a loan to cover your fees from Student Finance England while you study.  The application can be completed online [here]( https://www.gov.uk/teacher-training-funding) and will include a full assessment of your eligibility.  If you’re from outside the UK, you may still be eligible for financial support, find out [here](https://getintoteaching.education.gov.uk/explore-my-options/overseas-graduates).","aboutCourse":"The National Modern Languages SCITT training programme will provide Qualified Teacher Status (QTS) and a Post Graduate Certificate in Education (PGCE) both of which are nationally and internationally recognised. The PGCE will be provided by Sheffield Hallam University. \r\nThe training programme will take place in a collaborative and supportive network of schools where you will gain experience in two contrasting schools and a variety of educational settings. This programme provides Masters’ Level accreditation (60 credits) which builds on the PGCE course. The National Modern Languages SCITT is in partnership with excellent schools from both the state and independent sector.\r\n\r\nOur part-time course has the same content as the full time course. In year one, you will focus on our training and gain valuable classroom experience while making progress towards QTS.  In year two, you will concentrate on your PGCE and be placed in a contrasting school setting, while continuing to work towards QTS. The part-time course will be designed around your specific circumstances. Please be aware that placements for part-time applicants are limited in each hub.\r\n\r\nYour training has been developed in close collaboration with Modern Languages experts from schools and universities and includes ‘day schools’ where we bring together all our trainees in Modern Languages for subject specialist training. The training will be delivered by our experienced classroom practitioners in collaboration with experienced ITT lecturers. You will have the opportunity to focus on your subject in every element of the programme. There are two clear strands to the programme: academic study and classroom practice.\r\n\r\nWe are confident that you will receive an excellent start to your teaching career with The National Modern Languages SCITT and that you will be well placed to gain employment. By joining our SCITT which is associated with the South Yorkshire Teaching Hub and the Sheffield Teacher Training Alliance, you will be able to access a clear path of Continued Professional Development (CPD) for excellent trainees who become Early Career Teachers (ECT), and future Middle and Senior Leaders. This is provided through our ECT support programme, Early Career Development Programme and links with the Department for Education Licensee provision for Middle and Senior Leaders. \r\n\r\nPlease be aware we are not a licenced sponsor of student visas and can therefore not support an application from outside the UK. Please use the link below for further information.\r\n(https://www.gov.uk/student-visa)\r\n","interviewProcess":"The National Modern Languages SCITT will shortlist candidates using a scoring matrix and invite successful candidates for interview at one of our hub lead schools. The interview process consists of two parts: the completion of two written tasks (one in English and one in the main language you wish to train to teach in), a teaching task and an interview with NML SCITT representatives. We are committed to providing a high quality experience for prospective trainees and have planned our interview days accordingly. The process may be longer than you have anticipated but the end result is that we have the best trainees training with the best schools.  We will contact all successful applicants at the end of the interview day. Similarly, we will provide feedback if we have not made an offer. ","howSchoolPlacementsWork":"Each trainee will gain experience in two contrasting schools where you will be supported by a subject specific mentor in school. During the placements, there will be further training provided by the schools, the SCITT and the PGCE provider. Each school has a specialised programme of training put in place by a senior mentor which is designed to complement SCITT training and academic input.  Some of this will take place across phases to provide experience in the relevant Key Stages.\r\n\r\nOver the two years of your training you will have the opportunity to teach children in Key Stage 3, 4 and 5.","personalQualities":"The potential to be an outstanding teacher with a passion for Modern Languages with sound subject knowledge. We would welcome applicants with an understanding of the educational context in England but will offer a programme of acclimatisation for those trainees who need to gain this experience. We are looking for applicants who have the ability to be reflective and can demonstrate good written English, personal resilience, enthusiasm, confidence and emotional intelligence. We expect you to be aware of the professionalism required to teach and draw on your empathy and understanding when considering how a child learns and develops cognitively. ","otherRequirements":"It is essential that you have near native fluency in at least one language and knowledge of a second language if your main language is not French, German or Spanish. \r\n\r\nOur hubs offer taster days, please contact the Hub Lead School for further information about these events or please check our website for details (https://www.nationalmodernlanguages.com/) Your application should include all experience you have gained in an educational setting and details of any future experience you may have planned. \r\n\r\nAs you will be working with children you are required to complete an enhanced DBS, Child Protection Training and a Health check.","status":1,"createdAt":"2021-07-06T10:49:00.627Z","updatedAt":"2021-09-24T14:16:20.628Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
