{"id":"13122e60-e63e-461d-a44c-98b7628e0c26","name":"Physics","code":"2XMQ","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"bf97cd0a-224c-43d3-a021-84143df13e8d","code":"F3","name":"Physics"}],"locations":[{"id":"e9fc4e77-5d6c-4c9b-88e7-550850f475a2","name":"St John's Marlborough","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"b3c401bb-2537-4a17-9df1-c05f21038699","code":"2BO","name":"Excalibur @ St John’s"},"accreditedBody":{"id":"4a3dc1e3-2ee8-496d-85d1-b5d9f9eae94f","code":"B20","name":"Bath Spa University"},"profPost":"PG","degreeGrade":"1","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We accept equivalency tests from equivalencytesting.com","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Our ten-month secondary School Direct programme is a blend of school-based teaching practice, in-school Core Curriculum and University studies. The programme is carefully designed in conjunction with Bath Spa University to support you to work with the 11-16 age range, and offering, where possible, the experience of A Level teaching.\r\nStudents have two placements in secondary schools during the year. In each  school you will be supported by our Lead Trainer and a subject mentor, as well as a university-based tutor. During your placements you will continue to be supported by our Lead Trainer, and will spend one afternoon each week at St John's Marlborough following our School Core Curriculum programme. This gives you the chance to share good practice and discuss your experiences and current issues with us, and with other School Direct trainees. You will also spend two blocks of time with Bath Spa University, in September/October and again in January/February.\r\nWe are proud of our School Direct training programme and offer a range of benefits including:\r\n* A bespoke School Core Curriculum programme exploring current teaching issues including Wellbeing, EAL, SEND, Mental Health, Recovery Curriculum, and supporting disadvantaged/disengaged students\r\n* Weekly meetings with other trainees and your Lead Trainer(LT), focusing on key topics\r\n* The benefit of the expertise of our LT, your Mentor and University Subject Tutor\r\n* An excellent training base at St John’s Marlborough, and access to evidence-based staff CPD programmes with keynote speakers, subject training and presentations on hot topics\r\n* Highly experienced, supportive, trained subject mentors\r\n* A ready-made, friendly support group with other trainees, including an induction event prior to starting the course in September\r\n* Confidence that we will work hard to match you to placement schools that are convenient for you and your family commitments\r\n* Knowing where your placement schools will be before the course starts\r\n* Excellent prospects: we work hard to ensure your training year makes you stand out at interview, ensure you are aware of prospects within our Trust, and support you in your applications\r\nWe receive extremely positive feedback from our PGCE students. Comments include:-\r\n* \"The support network is great and I know I will always have someone I can approach if I need help\"\r\n* \"The information we have been given is very well structured\"\r\n* \"My questions and concerns were answered before I had even thought to ask\"","interviewProcess":"We carefully consider all the applications we receive, in conjunction with the Admissions team at Bath Spa University. \r\nIf you are invited to interview we will notify you by email and on Apply. You will normally need to allow up to three hours, usually at St John's Marlborough, for your interview.\r\nThe interview process will include a short, observed teaching task with a group of students, usually from Year 7 or 8, a written task, and a formal panel interview. We will provide a brief for the teaching task in advance, as well as any other relevant information that will enable you to demonstrate your skills and qualities.\r\nYou will need to bring your original examination certificates with you to be checked, as well as some personal identification. If we intend to offer you a place on the course this will be checked and passed to Bath Spa University.\r\nFollowing your interview we will aim to notify you of the outcome on Apply within 2 working days.\r\nOffers may be conditional on completing your degree or other qualifications, or on completing a Subject Knowledge Enhancement course.\r\nIf you are offered a place on our course and choose to accept it, we will then contact you with further information about the course.","howSchoolPlacementsWork":"We aim to match placements to our students' individual needs wherever we can. Often, students will have family or childcare commitments and we aim to place them in schools that mean travelling time will be kept to a minimum.\r\nYou will have two placements. The longest, your Home Placement, will usually be at St John's Marlborough, Wiltshire, or at John O’Gaunt School in Hungerford, West Berkshire. The shorter, Complementary Placement, may be at another one of our partner schools in the area. In each school you will have a designated subject mentor who has experience of initial teacher training (ITT) and you will be in regular contact with St John’s School, through weekly School Core Curriculum Studies sessions at St John’s Marlborough.\r\nDuring your placements you will spend most of your time in the classroom. You will watch experienced teachers in action, and learn to teach, from initially taking the register, completing a short section of the lesson and gradually moving on to taking the whole class for full blocks of lessons. You will also have the opportunity to experience wider school life, including the role of a tutor in your placement schools, and you will have an experienced personal mentor to guide you.\r\nThe weekly School Core Curriculum sessions at St John's take place one afternoon each week while you are on placement, and give you the opportunity to come together with other trainees and with our Lead Trainer to share good practice, evidence-based approaches and discuss your experiences.","personalQualities":"Our aim is to train you to embrace the professional qualities and attributes necessary to be an outstanding teacher, and to maximise the outcomes of the children and young people you teach.\r\n\r\nBecoming a teacher is very much about being a team member and this will be reflected over the tenure of your programme. You will need to work effectively on joint projects, work collaboratively as a member of a team, and going forward in your career, accept leadership roles. You will need excellent communication skills and the ability to remain professional at all times, without exception. ","otherRequirements":"Successful applicants:\r\n* may receive offers conditional on completing a Subject Knowledge Enhancement course (where your degree does not closely match your chosen subject, or where there is a significant gap between completing your degree and commencing the PGCE).\r\n* will be required to complete a Health Questionnaire, ensuring trainees have the health and physical capacity to teach and will not put children and young people at risk of harm. \r\n* will be subject to Disclosure and Barring Service (DBS) barred list and criminal records check. \r\n","status":1,"createdAt":"2021-07-06T10:50:14.829Z","updatedAt":"2021-10-04T10:23:03.582Z","canSponsorStudentVisa":"yes","cycle":"2024"}
