{"id":"71a923f4-d29e-4f7b-94d1-9b02e2c7630e","name":"Mathematics","code":"2P92","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"72345aa7-096c-488f-8649-085b8178cadb","code":"G1","name":"Mathematics"}],"locations":[{"id":"f2c65d03-48b5-4ba2-b1eb-5f8b467cf206","name":"Havelock Academy","isPublished":"Y","status":"R"},{"id":"77271900-7f01-4c77-8002-90bebc0d21a8","name":"Humberston Academy","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"67f0a9e2-905a-4997-a923-180eaba135cc","code":"1FE","name":"David Ross Education Trust"},"accreditedBody":{"id":"0bc933b8-dad9-4149-8bb2-fd2041d567c2","code":"H72","name":"The University of Hull"},"profPost":"PG","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"Degree should have a minimum content of 50% of the subject intending to teach.","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feesInternational":12800,"feeDetails":"Student type\tFees to pay\r\nUK students\t£9,250\r\nEU students\t£9,250\r\nInternational students\t£12,800\r\n\r\nActual fee to be confirmed for 2020-21 entry, the fee published was for the fee for 2019-20 entry.\r\n\r\nPlease contact Hull University FACE Admissions Team on 01482 466530/465974 for any further information required on Fees.\r\n\r\nIf you are an International student from a non-EU country you will be charged the standard overseas student fee.\r\n\r\nTraining bursaries are available for some subjects for all UK and EU postgraduate teacher trainees. \r\n\r\nFor information visit the following website for information.\r\n(https://getintoteaching.education.gov.uk/funding-and-salary/overview)\r\n","aboutCourse":"The programme is aimed at those who want to teach children in the 11-16 age range, that is, at Key Stages 3 and 4.\r\nIn order to be awarded Qualified Teacher Status trainees must meet the Teachers' Standards set by the Government and so the programme is designed to enable trainees to achieve this by offering a balance of school and University-based periods during the year.\r\nThe programme is one-year, full-time and its structure is closely linked to the term dates of local schools, with registration taking place in early September and the course finishing at the end of June.\r\nYou will learn through a series of in school placements (usually 2) where you will learn your teaching craft and you will also attend theory based seminars and learning at the University. You will also undertake a series of assignments as part of the PGCE qualification, taught and assessed at the university.\r\n","interviewProcess":"You are interviewed by a member of the host school's leadership team and a  tutor from the University. As part of the interview process you will be expected to deliver a short 'teaching' session to a small group of students and then have a one-to-one interview with the school team member and the university tutor.","howSchoolPlacementsWork":"Trainees undertake two periods of teaching; one in the Autumn-Spring and one in the Spring-Summer term. The aim is to give every trainee a wide range of experience, encompassing pupils of different ages and schools of different size and type.\r\nFor each teaching placement, trainees are assigned a university tutor who offers support and guidance before and during the placement. This complements the role of the school mentor, who is able to monitor and assist the trainees’ development on a day-to-day basis.\r\nUniversity tutors and school mentors work closely in partnership with one another to ensure the best possible outcomes for all trainees.\r\nYou can select a preference for one of your training placements on your application using the relevant placement code.\r\n","personalQualities":"We are looking for applicants with\r\n•\tA commitment to secondary education\r\n•\tAn ability to motivate and inspire children of all abilities\r\n•\tEnergy and enthusiasm\r\n•\tEffective interaction with children\r\n•\tAn ability to work under pressure\r\n•\tPerseverance and flexibility\r\n•\tOral and written communication skills\r\n•\tThe ability to work co-operatively\r\n•\tAn awareness of current educational issues\r\n•\tA broad subject-knowledge base\r\n•\tReflection, self-evaluation and a willingness to learn\r\n•\tAwareness of what being a secondary teacher entails\r\n","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:49:09.110Z","updatedAt":"2021-08-06T09:46:12.878Z","canSponsorStudentVisa":"yes","cycle":"2024"}
