{"id":"9f468a45-3fb1-43c9-af41-f71427942fc6","name":"Primary","code":"2B6W","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"yes","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"374660d9-6324-46e6-b3c0-b03d7f67c0bb","name":"Bath Spa University","isPublished":"Y","status":"R","vacancies":"F"},{"id":"9a180473-7a21-4f81-8d9e-92de57b33989","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"},{"id":"d05f49b9-5a73-4d2f-b076-bcc675e93961","name":"Fosse Way School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"6e03b435-c3ed-4a63-9b5a-99cf8b6a60ac","code":"1UW","name":"The Partnership Trust"},"accreditedBody":{"id":"4a3dc1e3-2ee8-496d-85d1-b5d9f9eae94f","code":"B20","name":"Bath Spa University"},"profPost":"BO","degreeGrade":"1","english":"1","maths":"1","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"This programme is a high-quality PGCE including QTS (qualified teacher status) with credits towards a Master’s degree.  \r\nTrainees will spend a minimum of 120 days in schools and a minimum of 60 days training.  \r\nTrainees will be offered full access to the CPD programme for teachers within The Partnership Trust. \r\nThis year we will be offering a SEND route. When completing your application please make it clear whether you would like to apply for Primary General or Primary General (SEN Specialism). The route you choose will need to be reflected in your personal statement when completing the application. ","interviewProcess":"Interviews will be conducted by the programme lead as well as senior colleagues from partner schools.\r\nCandidates will be expected to take part in a group discussion, give a presentation to the recruitment panel, lead a short pupil group activity and undertake a written and numeracy task.\r\nNormally only one interview is needed.  \r\n","howSchoolPlacementsWork":"The Partnership Trust offers four placements across the year. The first and last of these are in the same \"home\" school which allows students to see the progress of the same children across an academic year.\r\nThe middle two placements will be in different key stages so all our students will have experience in KS1, and lower and upper KS2 by the end of the year.\r\nIf you opt for the SEND specialism, one of the middle placements will be in a special school.\r\nAll host schools are rated as good or outstanding.\r\nCandidates will be expected to provide their own transport to their placements, some of which are in rural locations. ","personalQualities":"You will need to:\r\n\r\n* Have experience of working with groups of children either in school or in other similar settings.\r\n* Be able to offer the teaching profession a high level of energy and commitment.\r\n* Be able to demonstrate resilience and determination.\r\n* Be passionate about engaging with children’s/young people’s learning journeys.\r\n* Can demonstrate holding high aspirations for yourself.\r\n","otherRequirements":"A DBS check will be required.","status":1,"createdAt":"2021-07-06T10:52:48.869Z","updatedAt":"2021-09-08T13:46:17.810Z","canSponsorStudentVisa":"yes","cycle":"2024"}
