{"id":"295bc14d-4d3b-4a54-acb2-b02b08e2f89e","name":"Music","code":"3BHM","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"7_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"24311bef-8673-41fb-933c-53f887fb6976","code":"W3","name":"Music"}],"locations":[{"id":"040f33e4-c0e1-4325-b49e-78c511b88e4e","name":"St Mary's College","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"677d370a-3abf-429d-8fb4-b32438cbcec7","code":"1RU","name":"St Mary’s College"},"accreditedBody":{"id":"bed96ffb-ddf2-4d78-a6cf-13b533b714df","code":"25O","name":"Hull SCITT"},"profPost":"PG","english":"3","maths":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":8325,"feeDetails":"QTS only programme = £8,325\r\nOptional PGCE = £925\r\nTherefore total QTS and PGCE = £9,250\r\n","aboutCourse":"Music (11-16) and Specialist Instrumental Tuition (7-18)\r\n\r\nThis salaried course is unique in the East of England since it combines secondary initial teacher training for the music curriculum (11-16) with specialist instruction in providing one-to-one/small group instrumental tuition (from beginner to advanced, for ages 7 to 18).  \r\n\r\nIt is offered by St Mary’s College Academy of Music and Performing Arts – a large, vibrant professional music teaching faculty, that employs over 12 music teachers and works across 9 primary and secondary schools in Hull (City of Culture).  \r\n\r\nThe programme provides an ideal balance of school-based experience with professional and subject-specific training. The course leads to Qualified Teacher Status (QTS), with the option to complete a Masters Level Post Graduate Certificate in Education (PGCE) with the University of Hull.\r\n\r\nYou will be fully integrated into the music department at your host school where you will learn from an experienced mentor and other host teachers. You will receive training in how to teach across the 11-16 age range, including techniques for managing classroom behaviour and ensuring pupils of all abilities and needs can learn and make good progress. You will also have opportunities to teach post-16 lessons and get involved in a range of extra-curricular music and performing arts activities, events and trips.\r\n\r\nYou will not be \"thrown in at the deep end\".  You will begin by observing \r\n lessons, then try team-teaching before starting to build up gradually towards a teaching timetable which includes Key Stage 3 and 4 classes and one-to-one/small group instrumental tuition (Key Stage 2 to 5). Some of these lessons will be supported by host teachers who can observe and give you feedback and set targets to help you improve further. Other lessons you will teach on your own and then hold follow-up discussions your mentor to reflect on the progress those classes and individual students are making. This approach helps to build your confidence within a manageable timetable so that, by the end of the course, you are able to make a smooth transition to the NQT timetable expected in your first teaching year.\r\n\r\nEach week you will receive high quality one-to-one mentoring from a Music specialist as well as core Professional Studies training delivered by Specialist leaders in Education (SLEs). There are also regular Music Subject Knowledge and Pedagogy (SKAP) training sessions, and university-led tuition to support your PGCE assignments.\r\n","interviewProcess":"All short-listed candidates will first be asked to complete a literacy and numeracy test, as well as an instrumental audition.  \r\n\r\nIf you pass these tests successfully, then you will proceed to the formal interview stage with a panel that consists of representatives from the School Direct partnership. The interview panel will seek to gauge your potential, motivation and suitability for the teacher training programme, and will ask about your previous school experience, subject/curriculum knowledge, as well as your understanding about education and the role of the teacher.  \r\n\r\nCandidates are also expected to deliver a mini lesson to some KS3 students as part of the interview.  Further details about this will be included in the interview invitation letter.\r\n","howSchoolPlacementsWork":"You will spend the full academic year in your host school, with a second placement in a contrasting secondary school.    You will be fully integrated into your host school, so that you feel truly like a member of staff.  You will be given responsibilities for morning registration time, your own personal academic tutees to mentor, and you will be invited to join in all relevant school events and activities.  \r\n\r\nYour two placements will be in high-achieving departments in successful schools so that you are guaranteed to be working alongside excellent classroom teachers, curriculum and pastoral leaders and learning from the best practice.   You will have at least one placement in St Mary’s College.   Your other placement is likely to be at Kelvin Hall School which is also rated as ‘outstanding’ by Ofsted and has an excellent music department.   \r\n\r\nDuring the course, you will also spend time in the Catholic primary schools within St Cuthbert's Academy Trust as well as at St Mary's College.  This will enable you to gain a breadth of experience at teaching your instrument across the age and ability range from beginner to advanced, and from ages 3 to 19.  \r\n","personalQualities":"A proactive mentality: you show initiative, are self-motivated and seek out useful learning experiences and opportunities. \r\n\r\nA love for learning:   you reflect upon what you have learnt and constantly strive to improve. \r\n\r\nA ‘can do’ attitude:  you are resilient, determined and flexible. \r\n\r\nA collaborative worker:  you work well in a team and engage with others to get the best out of situations. \r\n\r\nExcellent communication skills, especially communicating with young people\r\n\r\nExcellent organisational skills\r\n\r\nHumility, empathy and respect\r\n\r\nProfessional appearance and manner\r\n","otherRequirements":"Recent experience in a UK Secondary school in the UK which allows you to have a clear understanding of the role of a teacher in terms of relevant skills and time commitments required for the profession.\r\n\r\nA commitment to safeguarding young people, equal opportunities and raising standards\r\n\r\nFollowing successful interview, all conditional offers will include:\r\n\r\nHealth and physical capacity to teach standards met (assessed through an occupational health questionnaire)\r\n\r\nSatisfactory Disclosure and Barring Service (DBS) check\r\n\r\nSatisfactory criminal record check for overseas\r\n\r\nSatisfactory check to ensure there is no prohibition order to teach in UK or European Economic Area (EEA)\r\n","status":2,"createdAt":"2021-07-06T10:48:03.253Z","canSponsorStudentVisa":"no","cycle":"2024"}
