{"id":"b22ff822-71cb-488e-936a-d823d2ecf499","name":"Primary (3-7)","code":"36M7","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_7","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"040f33e4-c0e1-4325-b49e-78c511b88e4e","name":"St Mary's College","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"677d370a-3abf-429d-8fb4-b32438cbcec7","code":"1RU","name":"St Mary’s College"},"accreditedBody":{"id":"bed96ffb-ddf2-4d78-a6cf-13b533b714df","code":"25O","name":"Hull SCITT"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":8325,"feeDetails":"QTS only programme = £8,325\r\nOptional PGCE = £925\r\nTherefore total QTS and PGCE = £9,250\r\n","aboutCourse":"This Primary course focuses on the age group 3-7 years and leads to Qualified Teacher Status (QTS), accredited by Hull SCITT.   School placements and mentoring are coordinated by St Mary's College, an outstanding Catholic school and part of St Cuthbert's Academy trust, which includes the seven Catholic primary schools in Hull.   The core training programme is delivered by Hull SCITT and we also work with the University of Hull to provide the option to undertake the PGCE Masters-level qualification.   \r\n\r\nThis school-based course fully prepares you for the teaching profession.  You will spend approximately 160 days in school, working alongside a highly skilled mentor with further support from your School ITT-coordinator and SCITT tutors.   You will spend significant time in both foundation stage (3-5 years) and key stage one (5-7 years) developing your understanding of their curricula. \r\n\r\nYou will undertake a wide range of school tasks which will include significant opportunities to observe a range of teaching approaches in your host school, partnership schools and other early years providers.  You will be asked to reflect and record your learning in relation to these tasks  which will be followed up in training discussions and feedback.\r\n\r\nYou will work with your mentor to progress from team teaching and small group work to whole class teaching, both observed and, later, unobserved.  \r\n\r\nCore training provides a comprehensive introduction to the wide range of curriculum areas and pedagogy needed to become an excellent Primary school teacher.  This training is provided by current practitioners ensuring that theory is supported by current practice. Where possible our trainers conduct their sessions in school, for example, our PE trainer will invite you into her school wearing your PE kit ready to observe and engage in training opportunities with each other and the pupils.  \r\n \r\nHalf termly assessments are based upon reviewing the progress of the children you have been teaching.   This is evidenced through lesson observation and pupils' outcomes which are used to identify your achievements and future targets. This process is based upon the current accountability systems in our partnership schools.  \r\n","interviewProcess":"You will be interviewed by a group of Head teachers/senior leaders from our partnership schools.  Our interview day includes a number of tasks, one of which includes visiting one of our partnership schools to work with a group of our pupils.  \r\n\r\nOutcomes of the interviews are shared with candidates on the day.  As part of the interview process you will complete a written task and maths test.  ","howSchoolPlacementsWork":"Both your school placements will be in primary schools in St Cuthbert's Catholic Academy Trust.    Although we welcome applications from people of any faith background (or none), you will notice that the atmosphere of tolerance, respect, forgiveness and reconciliation within our Trust schools provides both staff and students with the ideal conditions for personal, academic and professional development.  \r\n\r\nYour host school is the school in which you will be predominantly based and you will become part of the school community.  Whilst in your host school you will experience teaching both key stages for which you are being trained foundation stage (3-5 years) and key stage one (5-7 years).  Within your host school you will have a mentor with whom you will spend the most significant amount of time. You will also spend 6 weeks in the alternative key stage for which you are being trained.  \r\n\r\nIn addition you will undertake a 6 week second placement (typically in the later part of the Autumn term) in a different primary school within our St Cuthbert's Trust.  \r\n\r\nFurther enhancement visits will also include schools with high proportion of pupils with English as an additional language (EAL), a special school, an early years provider and a nursery school.  \r\n\r\n","personalQualities":"A proactive mentality: you show initiative, are self-motivated and seek out useful learning experiences and opportunities. \r\n\r\nA love for learning:   you reflect upon what you have learnt and constantly strive to improve. \r\n\r\nA ‘can do’ attitude:  you are resilient, determined and flexible. \r\n\r\nA collaborative worker:  you work well in a team and engage with others to get the best out of situations. \r\n\r\nExcellent communication skills, especially communicating with young people\r\n\r\nExcellent organisational skills\r\n\r\nHumility, empathy and respect\r\n\r\nProfessional appearance and manner\r\n","otherRequirements":"You should have an informed understanding of the role of a primary teacher in terms of relevant skills and the time commitments required for the profession.\r\n\r\nA commitment to safeguarding young people, equal opportunities and raising standards\r\n\r\nFollowing successful interview, all conditional offers will include:\r\n\r\nHealth and physical capacity to teach standards met (assessed through an occupational health questionnaire)\r\n\r\nSatisfactory Disclosure and Barring Service (DBS) check\r\n\r\nSatisfactory criminal record check for overseas\r\n\r\nSatisfactory check to ensure there is no prohibition order to teach in UK or European Economic Area (EEA)\r\n","status":1,"createdAt":"2021-07-06T10:48:03.151Z","updatedAt":"2021-09-28T09:08:15.201Z","canSponsorStudentVisa":"no","cycle":"2024"}
