{"id":"c2883262-3fd3-4435-9c98-6ce6145bf32b","name":"Music","code":"29G5","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"24311bef-8673-41fb-933c-53f887fb6976","code":"W3","name":"Music"}],"locations":[{"id":"040f33e4-c0e1-4325-b49e-78c511b88e4e","name":"St Mary's College","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"677d370a-3abf-429d-8fb4-b32438cbcec7","code":"1RU","name":"St Mary’s College"},"accreditedBody":{"id":"bed96ffb-ddf2-4d78-a6cf-13b533b714df","code":"25O","name":"Hull SCITT"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":8325,"feeDetails":"QTS only programme = £8,325\r\nOptional PGCE = £925\r\nTherefore total QTS and PGCE = £9,250\r\n","aboutCourse":"This secondary teacher training programme provides an ideal balance of school-based experience with professional and subject-specific training.  The course leads to Qualified Teacher Status (QTS), with the option to complete a Masters Level Post Graduate Certificate in Education (PGCE) with the University of Hull. \r\n\r\nYou will be fully integrated into the Music department at your host schools where you will learn from experienced mentors and other host teachers.   You will receive training in how to teach across the 11-16 age range, including techniques for managing classroom behaviour and ensuring pupils of all abilities and needs can learn and make good progress.   You will be trained in all aspects of Music teaching including how to use current music software effectively, and how to develop students’ skills in listening, performance and composition. \r\n \r\nYou will not be “thrown in at the deep end”.   Instead the course has a carefully phased approach which allows you to begin by observing lessons and participate in team-teaching before teaching full lessons.  Typically, you would progress to teaching about 6 hours a week by Christmas, and 14 hours by July, as well as taking on increasing responsibility for form time and PSCHE.   This helps to build your confidence within a manageable timetable so that, by the end of the course, you are able to make a smooth transition to the timetable expected in your first teaching year.     \r\n\r\nEach week you will receive high quality one-to-one mentoring from a subject specialist as well as core Professional Studies training delivered by Specialist leaders in Education (SLEs).  There are also regular Subject Knowledge and Pedagogy (SKAP) training sessions, and university-led tuition to support your PGCE assignments.   \r\n\r\nAs well as your two main placements, we also arrange visits for you to spend time in a Primary school, Special School and Free School as part of your programme to enable you to gain further experience of the education sector.    \r\n\r\nYou are assessed at half termly review points throughout the course by your mentor in conjunction with a Link Tutor.  These assessments are based on reviewing the progress of the classes you have been teaching as well as your ‘evidence bundle’ of lesson plans, resources and observations which is kept electronically on a SharePoint Cloud system.   At each review point, personalised targets will be set to help you progress towards meeting the Teacher Standards by the end of the course.  \r\n","interviewProcess":"All short-listed candidates will be invited to an interview.  The interview panel will seek to gauge your potential, motivation and suitability for the teacher training programme, and will ask about your previous school experience, subject/curriculum knowledge, as well as your understanding about education and the role of the teacher.  \r\n\r\nCandidates are also expected to deliver a mini lesson to some KS3 students and take a short literacy test as part of the interview.  Further details about this will be included in the interview invitation letter.\r\n","howSchoolPlacementsWork":"You will spend the majority of the academic year on your main placement in your host school, with a six week second placement in a contrasting secondary school.    You will be fully integrated into your host school, so that you feel truly like a member of staff.  You will be given responsibilities for morning registration time, your own personal academic tutees to mentor, and you will be invited to join in all relevant school events and activities.  \r\n\r\nYour two placements will be in high-achieving departments in successful schools so that you are guaranteed to be working alongside excellent classroom teachers, curriculum and pastoral leaders and learning from the best practice.   You will have at least one placement in St Mary’s College - this could be the main placement or a second placement.   Your other placement will be at one of our partner secondary schools - The Marvell College, Kelvin Hall School or the Boulevard Academy.  \r\n","personalQualities":"A proactive mentality: you show initiative, are self-motivated and seek out useful learning experiences and opportunities. \r\n\r\nA love for learning:   you reflect upon what you have learnt and constantly strive to improve. \r\n\r\nA ‘can do’ attitude:  you are resilient, determined and flexible. \r\n\r\nA collaborative worker:  you work well in a team and engage with others to get the best out of situations. \r\n\r\nExcellent communication skills, especially communicating with young people\r\n\r\nExcellent organisational skills\r\n\r\nHumility, empathy and respect\r\n\r\nProfessional appearance and manner\r\n","otherRequirements":"Recent experience in a Secondary school in the UK which allows candidates to have a clear understanding of the role of a teacher in terms of relevant skills and time commitments required for the profession.\r\n\r\nA commitment to safeguarding young people, equal opportunities and raising standards\r\n\r\nFollowing successful interview, all conditional offers will include:\r\n\r\nHealth and physical capacity to teach standards met (assessed through an occupational health questionnaire)\r\n\r\nSatisfactory Disclosure and Barring Service (DBS) check\r\n\r\nSatisfactory criminal record check for overseas\r\n\r\nSatisfactory check to ensure there is no prohibition order to teach in UK or European Economic Area (EEA)\r\n","status":1,"createdAt":"2021-07-06T10:48:02.822Z","updatedAt":"2021-09-28T08:55:13.366Z","canSponsorStudentVisa":"no","cycle":"2024"}
