{"id":"422ce05d-591a-4e1f-876f-b36f1df03325","name":"Primary (5-11) Full time","code":"2N4B","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"80a69da2-67c5-40fb-b5ec-e13b8ffc9000","name":"Reeth Community Primary - Associate School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"672ca1b7-59f2-4844-9bad-49946426b68f","name":"Bedale CE Primary School - Associate School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"6182d8c4-b041-4692-8453-8bf7d95bfb14","name":"Crakehall CE Primary - Associate School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"3a1bc350-be8b-4c12-b7c8-3d19e7acf5d7","name":"Richmond Methodist Primary - Associate School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"42fc77b9-e612-4e54-8a21-f36683d8cb96","name":"Leeming and Londonderry Community Primary - Associate School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"85e474fa-c80c-45b7-bd66-b5e3b9f8189f","name":"Hutton Rudby Primary School - Associate School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"0d37f81a-d227-45d5-bc93-4bb43974a35a","name":"Bainbridge CE Primary  - BAWB Federation - Associate Schools","isPublished":"Y","status":"R","vacancies":"F"},{"id":"ec980afe-190e-4745-8cfc-f8ca5ffaaf28","name":"Leeming RAF Community Primary - Associate School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"c0260e6b-46e4-4c72-8717-769b58523788","name":"Masham Community Primary - Associate School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"cf5b9103-f475-481e-b409-fafdb71ef1f1","name":"Brompton-on-Swale CE Primary School - Lead School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"f450ba54-6862-4df4-bf23-49dd05bdb6d7","name":"Pickhill CE Primary - Associate School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"9134082f-192a-4b7a-bd14-1dab0861b9c8","name":"South Otterington CE Primary School - Associate School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"6991bf1b-b0b2-4b01-9c38-2f4208efa851","code":"1FG","name":"The Swaledale Alliance"},"accreditedBody":{"id":"dae8b113-3556-416a-8da0-57eb5aaff9e2","code":"H38","name":"High Force Education (SCITT)"},"profPost":"PG","degreeGrade":"1","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We do not accept Level 2 functional skills tests. Please contact us and we can advise you on the company we used for equivalency tests.","courseLength":"OneYear","feesUK":9250,"feesInternational":9250,"feeDetails":"You may be able to access additional financial support and tuition fee loans to cover fees.  Eligibility for this is assessed through the Student Loans Company and you should contact them directly.   If you are privately funding the programme, arrangements can be made direct with High Force Education SCITT to pay in instalments. \r\n\r\nThe DfE are continuing to support postgraduate places with a training bursary for degree graduates. All details of bursaries can be found on the course page.\r\n\r\n","financialSupport":"You may be able to access additional financial support and tuition fee loans to cover fees.  Eligibility for this is assessed through the Student Loans Company and you should contact them directly.    If you are privately funding the programme, arrangements can be made direct with High Force Education SCITT to pay in instalments. \r\n\r\nThe DfE are continuing to support postgraduate places with a training bursary for degree graduates. All details of bursaries can be found on the course page.\r\n\r\n","aboutCourse":"This programme is a unique partnership between the Swaledale Alliance , High Force Education SCITT and Northumbria University. It is a 10 month programme based at our Lead School: Brompton-On-Swale CE Primary. The programme is school led with strong relationships with employing schools. On successful completion of the programme, you will be a strong candidate to secure your first teaching position.   \r\n\r\nThe structure of the programme has been tailored in order to provide high quality training, effective mentoring and varied school experiences that develop your skill base and ensure you are fully equipped to enter the teaching profession.  \r\n\r\nThis is a professional, vocational and immersive course. As a post graduate trainee teacher, you will spend a significant amount of time in  the classroom with the PGCE complementing each aspect of your training. \r\n\r\nYou will be fully supported by the SCITT team and have dedicated Subject and Hub Learning Leads who have extensive knowledge of educational theory and have considerable expertise in effective practice in schools. They will provide you with the most up to date pedagogy and give you the opportunity to engage with recent and relevant educational research.  \r\n\r\nWe use a blended approach to learning with opportunities to learn at your Hub, the SCITT Centre and at home. We use technology to enable you to not only make use of learning resources, but also to inspire learners in school and establish yourself in the professional  and academic networks that will be important to your own career development. \r\n\r\n","interviewProcess":"High Force Education SCITT leads and manages the assessment process with the support from our Lead Hub school.\r\n\r\nTrainees are interviewed virtually via our Hub school- Brompton-on-Swale and High Force Education. \r\n\r\nThe interview consists of: \r\n-Pre Interview Task\r\n-Interview\r\n\r\nHigh Force considers a wide range of evidence to judge an applicant's potential to train to teach including the application process, references, results of assessment day tasks and interpersonal skills demonstrated throughout the interview. \r\n\r\nA decision to offer a place on the programme will be made as a result of the applicant's performance through all of the different tasks. All decisions from the assessment day will be made within 24 hours of the interview.  If you are successful, you will be offered a conditional place for the programme and complete an English test at induction. \r\n\t\t\t\t\t\t\t\t\t     \r\nWe offer all candidates the opportunity to receive feedback if they are unsuccessful at the assessment day. \r\n","howSchoolPlacementsWork":"As one of  four hubs for High Force Education, training with the Swaledale Alliance will take place based at our Lead School, Brompton-on-Swale CE Primary. Placements will also be undertaken in satellite schools near to where trainees live. On a Wednesday, for approximately 20 days, trainees from all four High Force hubs will come together for joint subject training.\r\n\r\nTraining in  the Hub School (Brompton-on-Swale Primary)is delivered one day a week by a blended approach of both face-to-face and remote learning by the Hub Learning Lead. Our Hub Learning Lead will also work with trainees during their placements in satellite schools and carry out key observations to nurture their progress.\r\n\r\nPlacements in our satellite schools will provide trainees with diverse school experiences in each phase of primary education and an opportunity to experience  a wide range of school environments, from small dales village schools to larger and more culturally diverse schools on near by Catterick Garrison.  You will be placed in 3 different schools across the year to gain a wealth of experience in a range of settings. \r\n\r\nSchool placements are specifically and carefully selected for you to meet your individual development needs and to widen your skills in working with a range of pupils. \r\n\r\nTwo of the placements are classed as assessed teaching practices where you will be required to be assessed in both Key Stage 1 and Key Stage 2. In addition to this, you will have the opportunity to observe in an Early Years Foundation Stage setting, a specialist school and a residential visit to schools in Bradford with a high proportion of children with EAL (English as an Additional Language).\r\n","personalQualities":"*Demonstrate a  passion to teach young children;\r\n*Motivate and inspire young children to reach their full academic and social potential in life;\r\n*Convey commitment and enthusiasm to primary teaching;\r\n*Demonstrate a strong desire to teach at an excellent level and continually improve and develop as a practitioner;\r\n*Communicate clearly and articulately in spoken and written standard English, with accurate spelling and grammar; \r\n*Demonstrate openness to learning, self- development and welcome feedback;\r\n*Demonstrate empathy, sensitivity and respect for children, families and colleagues;\r\n*Value and contribute to team work;\r\n*Show creativity, flair, innovation and adaptability;\r\n*Have resilience;\r\n*Be able to meet deadlines.\r\n","otherRequirements":"In addition to the specific entry requirements detailed above, the following ITT requirements must be met.\r\n\r\nThat all entrants:\r\n*Have satisfactory references \r\n* Have the physical capacity to train to teach\r\n*Have been subject to a Disclosure and Barring Service (DBS) enhanced disclosure check\r\n\r\n","status":1,"createdAt":"2021-07-06T10:57:21.510Z","updatedAt":"2021-09-15T08:00:40.135Z","canSponsorStudentVisa":"no","cycle":"2024"}
