{"id":"6b422d19-a9f5-4078-b988-dd7356afd066","name":"Physics","code":"F3X1","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"bf97cd0a-224c-43d3-a021-84143df13e8d","code":"F3","name":"Physics"}],"locations":[{"id":"917773df-704e-4ec9-bb95-a6e1289c4761","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"f3a93938-0208-4680-ac22-b564b18ff02b","code":"D86","name":"Durham University"},"profPost":"PG","degreeGrade":"1","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We do accept third party equivalency tests, there will be a fee to pay.","courseLength":"OneYear","feesUK":9250,"feesInternational":22250,"aboutCourse":"The PGCE Secondary course at Durham University is an exciting and innovative programme in Initial Teacher Training.  This programme is accredited by the Department for Education and will equip you to teach in your specialist subject in Key Stages Three and Four (ages 11-16). Successful completion of the course will provide you with a recommendation for Qualified Teacher Status (QTS), awarded by the Department for Education and a PGCE, awarded by Durham University. \r\n\r\nWe believe strongly that to be able to teach successfully you must acquire a good understanding of the ‘big ideas’ of science as well as learning about how to teach Chemistry.  We can help you channel the passion for your subject to be able to share your enthusiasm and knowledge with pupils in school; building your understanding of how children learn in science and the sequencing of learning to accommodate potential challenges. \r\n\r\nSubject pedagogy (how to teach the subject for understanding) is explored in an innovative university / partnership model known as the POD (Professional Opportunities and Development). The POD involves a ‘hybrid space’ where university tutors and classroom practitioners work together. This model provides trainees with the ‘best of both worlds’, opportunities to work with research relevant university professionals with an abundance of experience in teacher training and school practitioners with experience of delivering the National Curriculum and experts in current classroom practice. The ITE course is delivered using a blended approach and follows a ‘knowledge rich’ curriculum that is current and evidence based. \r\n\r\nThe university-based sessions focus on a weekly specific pedagogical theme, which is integrated with sessions devoted to your subject specialism, delivered by subject specialists in the University and the POD school.  Wellbeing is at the heart of the PGCE course, and you will receive personal, constructive, and friendly support from your University and School-Based Tutors and our Wellbeing Team.  \r\n\r\nApplicants should note that this programme starts earlier than the standard university term.\r\n","interviewProcess":"Recruitment to the course is robust and designed to identify candidates who are resilient and who can thrive on our programme. \r\n\r\nCandidates invited to attend an interview will receive an email with full details of an allocated interview slot. In the event of continuing Covid restrictions, the interview will be held online via Zoom, using a similar format to the one outlined below.\r\nThe interview will explore the interviewee’s potential and previous knowledge, skills or experience that is beneficial to the candidate’s role as a trainee teacher.  There will also be an opportunity for candidates to ask any questions they may have to the course team. \r\n\r\nThe interview offers candidates different ways to demonstrate their potential to be successful. The first opportunity is a short presentation, prepared in advance, and this is followed by several interview questions relating to the teaching profession and contemporary issues. The final activity is an in-tray task that is designed to highlight a candidate’s logical thinking and organisation\r\n","howSchoolPlacementsWork":"The university-based sessions complement the school-based experience you will gain in schools in the Durham University Schools Partnership, which will normally be a minimum of 120 days across the three terms.  The responsibility for training is shared between schools and the University, providing a supportive professional environment in which you can develop your knowledge, skills, understanding and expertise. Our mentors work in partnership with the University to give you the best possible encouragement and further development as you progress towards your Qualified Teacher Status. The Durham University Schools Partnership has schools across the North-East region and students are required to travel independently to these. The Partnership Team work hard to ensure that travel expectations are reasonable.\r\n\r\nDurham University Centre for Teacher Education school placements take place through two different formats. There is the attachment placement which is the main training school and in which trainees spend most of their time starting in the first term. The attachment placement input into the Durham ITE Curriculum ensures that key elements are revisited it to develop the trainees’ knowledge from a surface level to a much deeper and richer level of knowledge, skills and understanding.\r\n\r\nThen there is a shorter intensive practice placement which takes place in a different school and where the aim is to consolidate trainees understanding of how research and evidence should shape practice. They are characterised by relevant curricular input, focussed observation, deconstruction and analysis, and are designed to be demanding and to increase trainee competence and confidence. Once back in the attachment placement school it is anticipated that trainees will be able to apply their improved skills and knowledge in their classroom teaching.\r\n","personalQualities":"During the recruitment process, we will be evaluating your potential to become an effective teacher.  Our preferred applicants will have the following qualities:\r\n\r\n* a desire to teach and work with young people from all backgrounds\r\n* effective communication skills and a collegiate approach\r\n* a passion for your subject and strong subject knowledge\r\n* a commitment to teaching and the determination to succeed\r\n* consistently high standards of personal and professional conduct upholding the public trust in the profession\r\n\r\n\r\n","otherRequirements":"Admission to the course is subject to a satisfactory medical report, as you are required to meet the standards for ‘Fitness to Teach’. It is important that you disclose any medical condition or disability so that we can look at the best way of supporting you if you are offered a place on the course.\r\n\r\nYou will be subject to safeguarding checks which include an enhanced DBS check.\r\n","status":1,"createdAt":"2021-07-06T10:46:47.705Z","updatedAt":"2021-09-28T13:10:02.133Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
