{"id":"4ad12f5d-b43e-4c5c-9680-1def79354d89","name":"Primary","code":"B096","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"8b7408a6-f855-4699-a799-c35baeccd5cc","name":"The Heights Primary","isPublished":"Y","status":"R"},{"id":"0f5d0542-3bc2-4e47-a139-1289b2ebb8ef","name":"Main Site","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"bf3e7945-a19a-4d47-9f51-1df9f5dc5d05","code":"1QL","name":"Geoffrey Field Junior School"},"accreditedBody":{"id":"6439adcc-af64-4d3d-a1da-de045755db06","code":"R12","name":"The University of Reading"},"profPost":"PG","degreeGrade":"9","english":"1","maths":"1","science":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","aboutCourse":"The School Direct course runs for the academic school year and will provide successful trainees with qualified teacher status (QTS) which will enable you to teach as a qualified teacher in the UK.  \r\nAs a school based training programme you will be based in one main school for three out of four of your placements. You will be allocated a mentor in your main school who will meet with you for one hour a week to discuss your progress, set targets and feedback on teaching and learning. You will have the same mentor for the whole year although you will be working alongside different class teachers.  \r\n Your university based central training will take place over blocked weeks and on a Friday during the first term.  This is where you will learn about professional values, teaching theory and the subject knowledge of the curriculum that you will be teaching.  In school you will 4 separate placements usually working with different experiences teachers.  Initially you will be observing and working alongside them as you get to know the children and the class routines.  At a pace tailored to you, you will then begin to take on small, groups and then eventually you will be responsible for planning, teaching and assessing the children for 80% of their timetable.  This is a responsibility that you will be build up to across the year on a very individually tailored programme designed between yourself and your mentor.  \r\nThere are four separate placements three of which take place in your main school. The second placement takes place in another school, this is organised by The School Direct lead, Emma Berry, in your  lead school, Geoffrey Field Junior School.  The aim of this placement, where you will work towards leading 60% of the timetable, is that you experience an alternative setting.  For example, if your main school is a large school in an urban area you could be allocated a place in a smaller more rural school.  Another example might be to experience the differences in teaching and learning in a faith school or special needs setting.  \r\nPlaces may be offered on a salaried or fee paying basis.  Salaried trainees are employed by the school and receive a monthly salary.  Trainees on this route may be used for covering classes up to one day per week ( this would not usually be in the first half term) . ","interviewProcess":"Successful trainees will be invited to an interview morning or afternoon.  During this time they will be asked to make a presentation to the rest of the trainees and any attending Head teachers and ITTcos.  They will also be asked to complete a written exercise which could be to write about an issue in education or their own experience of schools and education.  Finally, candidates will be interviewed by a small panel of head teachers and ITTcos.  The interview session enables Heads to see a number of trainees at once and to see who they would like to invite to their school for a second interview.  It also means that candidates can meet Head teachers from a number of schools within the consortium.  If you are invited to a school you may be expected to teach a short session to a small group, this might be a book presentation.  ","howSchoolPlacementsWork":"Across the year you will have 4 placements in which the percentage of teaching that you are expected to take on will steadily increase.  This is personalised programme that you will design with your mentor and so it will move at a pace that is appropriate for each individual trainee.  You will for example begin working one to one and in small groups with children using the class teachers plans.  You will work your way up to teaching the whole class from your own planning in a variety of curriculum subjects.  Three of the placements will take place in your main school and one will be your second school placement.  This is an opportunity to teach in a school which will provide you will a contrast to your main school.  For example if you are training in large 3 form entry school you may be placed in small school as a contrast.  ","personalQualities":"We are looking for trainees with a passion for teaching and learning.  We are looking for a willingness to learn alongside pupils and colleagues and a desire to be the best teacher that they can be.  Trainees need to be highly motivated, organised and willing to reflect on their strengths as well as things that they would like to develop.  ","otherRequirements":"No classroom experience necessary but it will of course be useful if you have spent some time in a school recently.  ","status":1,"createdAt":"2021-07-06T10:46:29.955Z","updatedAt":"2021-10-05T19:48:27.349Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"unqualifies teachers pay scale"}
