{"id":"96a69975-c0e9-4a38-8ec9-dcd9e0fdbd43","name":"Chemistry","code":"H542","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"7_to_14","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"912d4fb4-761b-42e9-8dc6-e968b791ea4e","code":"F1","name":"Chemistry"}],"trainingProvider":{"id":"59579b9d-79e3-4ab9-a34e-6d11aad8263e","code":"1N1","name":"Gorse SCITT"},"profPost":"PG","english":"3","maths":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feesInternational":9250,"aboutCourse":"This programme provides you with the necessary skills to teach in Primary, Secondary or middle school settings. We advise you to read both our Primary Programme and the relevant subject description before making an application for the KS2/KS3 programme. \r\n\r\nYou will learn all of the practical skills and theory needed to teach Chemistry in an expert and assured manner. We will ensure that you have the subject knowledge and the means of structuring and planning lessons so that you are skilled and confident in the delivery of creative and stimulating lessons. You will learn from working alongside experienced school colleagues proficient in a range of scientific disciplines, whilst focusing, obviously, on Chemistry. We will promote a reflective and analytical view of your work in the classroom and in the laboratory, which sustains the high levels of progress we expect. From practising and expert teachers, you will learn about the science curriculum, from the framework provided by the National Curriculum through to the individual lesson plans that teachers use to support learning in their classrooms. We will support you in finding out how to use ICT effectively in your lessons and how to mark books and assess work You will work closely with Subject Mentors and host teachers to ensure that you get all of the support you need to become an excellent Chemistry and science teacher. \r\n\r\nYou will usually be in school three full days and two mornings every week. One afternoon a week you will receive general training and one afternoon a week subject specific training.\r\n\r\nAssessment will be against the teacher standards via continuous monitoring of your day to day engagement with teaching, including regular feedback from lesson observations. This will involve uploading evidence of your actual work to our assessment portal on a half termly basis - will be five times a year. For the PGCE element, which runs seamlessly alongside core practice, you will have to complete two university assignments. Guidance and support will be offered throughout the training year. \r\n\r\nYour assessment will be based upon your day to day practice.\r\n\r\nAll training will be at your host school, a nearby partner school, or GORSE SCITT’s Centre for Teacher Training. This includes the training for the Masters (PGCE) element of the programme.\r\n\r\nGORSE SCITT is an OFSTED Outstanding provider in Yorkshire and Humberside; your training will be in safe and experienced hands.\r\n","interviewProcess":"Our interview process is currently offered online. Because of our close relationship with our partner schools we may also be able to offer a school experience to applicants by negotiation.\r\n\r\nYou will usually be interviewed by a senior tutor of GORSE SCITT, a Subject Lead of GORSE SCITT and/or a Senior Leader from a partner school.\r\n\r\n•\tYou will make a short 3-5 minute presentation about why you want to teach and what you will bring to teaching; you should engage with the panel or pupils making clear why you want to be a teacher. \r\n\r\n•\tYou will participate in a lesson with a fully qualified teacher, interacting with students, helping them, answering questions and assisting the teacher with the lesson.\r\n\r\n•\tYou will have a formal interview which will give you the opportunity to discuss why you want to be a teacher, what you would bring to the profession, and also show us your resilience and initiative.\r\n\r\n•\tYou will be asked to complete a range of written work. These will include subjects such as current issues facing education, reasons for your subject being part of the curriculum, your desire to teach, the importance of safeguarding, and subject knowledge questions.\r\n\r\n•\tAfter your interview, we aim to let you know if you have been successful within 48 hours.\r\n\r\n•\tIf we regard you as a strong candidate who needs further development to be ready to join our programme we will facilitate this through our Subject Knowledge Enhancement programmes.\r\n","howSchoolPlacementsWork":"All of our placement schools are detailed on our website. Every school is carefully selected to ensure that you receive a quality experience. The majority of our schools are within a very short driving distance from our Training Centre. This means that travelling time is rarely more than 30 minutes for drivers and an hour for those using public transport. \r\n\r\nYou will experience and teach across two key stages. For Primary that will be Key Stage One and Key Stage Two (ages 4 to 11), for Secondary that will be Key Stage Three and Key Stage Four (ages 11-16) and for Secondary/Post 16 that will be Key Stage Four and Key Stage Five (14-18)\r\n\r\nYou will have a minimum of two placements, an Initial Development Placement from September to Christmas and a Sustained Development Placement which runs from January to June. A third placement maybe offered as applicable and if in your best interests.\r\n\r\n14-18 trainees will spend approximately half of their time, September to June, in Post-16 provision and half of their time in a 14-16 setting.\r\n\r\nYou will usually be in school three days and two mornings every week and expected to follow the timings, practices and culture of the school.\r\n\r\nGORSE SCITT believes that all trainees, morally, should understand where pupils have been on their educational journey so far, where your teaching will transport them to and how they will reach their ultimate destination. As such, all trainees will experience teaching from the Early Years to Year 13 and beyond through our Enriched Development Placements.\r\n\r\nAt GORSE SCITT, we offer trainees the opportunity to experience and engage with educational practice outside, beyond and parallel to the age groups they predominantly teach.\r\n\r\nEnhancement opportunities happen across the year. These enhancement opportunities serve a vital purpose for trainees in asking them to question how pupils learn in other contexts and age ranges. \r\n","personalQualities":"Has high moral purpose in their desire to become a teacher.\r\n\r\nIs able to respond positively to guidance towards self-improvement.\r\n\r\nHas an intrinsic passion for learning.\r\n\r\nIs fully prepared and demonstrates a clear understanding of teaching in a socially and culturally diverse society.\r\n\r\nAssumes a high level of responsibility for the well-being, attainment, progress and outcomes of pupils.\r\n\r\nPlans lessons that use appropriate, imaginative and creative strategies that match the individual learning styles and needs of pupils.\r\n\r\nDemonstrates excellent subject knowledge and is able to apply this and the appropriate learning and teaching pedagogy to support the pupils they teach.\r\n","otherRequirements":"Offers will be subject to an Enhanced DBS which will be organised for you. We encourage you to enrol to the DBS update service. An overseas DBS may be required for those who have spent time outside of the UK.\r\n\r\nAll applicants will be required to complete proficiency tests in English and Mathematics which will be delivered by GORSE SCITT.\r\n","status":2,"createdAt":"2021-07-06T10:47:49.267Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
