{"id":"dc8a6b72-744c-49f1-bd06-765720666b4c","name":"Physical Education","code":"239K","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"74d64a54-5e34-4590-b6c7-528dd0cf26fe","code":"C6","name":"Physical education"}],"locations":[{"id":"065be27f-84d6-4309-af58-bf4634df0c3a","name":"John Smeaton Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"38e01a8d-b8ea-47ba-8729-93e41209e209","name":"Hanson Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"438b6b8f-03cd-432c-a1b1-0d4ee34ba11c","name":"Buttershaw Business and Enterprise College","isPublished":"Y","status":"R","vacancies":"F"},{"id":"05de4489-8c3f-4023-9350-b3915825ee5b","name":"The Morley Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"43381907-d97b-4dff-a11e-3fca26013e95","name":"The Farnley Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"a528178d-f386-426c-bfe6-575705db3153","name":"The Ruth Gorse Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"4f966f9d-eb56-42ce-8058-495428aeaa39","name":"Bruntcliffe Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"325435c1-a76a-4dfe-b4d4-15670d58b35f","name":"Abbey Grange Church of England Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"eaaf2329-0628-4b2d-b8e1-db68cb2bd50e","name":"Lightcliffe Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"63d8bbd8-a74b-4a6b-b4ac-307994f9c76f","name":"Bishop Young Church Of England Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"2b39382f-30db-4839-aecb-ffc8b043a1df","name":"Boston Spa Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"6d2fcc75-ef48-4948-b627-547f8428220f","name":"Cockburn John Charles Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"b372ed69-6e03-4014-8c65-34760701dfe2","name":"Cockburn School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"cf1089aa-c054-40ab-ab14-bf19f143c0c9","name":"Elliott Hudson College","isPublished":"Y","status":"R","vacancies":"F"},{"id":"2dafc1cb-dc07-4a0b-9bba-92b19d799e99","name":"Carlton Keighley","isPublished":"Y","status":"R","vacancies":"F"},{"id":"913ce665-70f3-43c5-a7c6-c7dd9d3ab208","name":"Woodkirk Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"2a15d4df-9a8a-4877-b837-e2d7f6c66f46","name":"Headlands School","isPublished":"N","status":"S","vacancies":"F"},{"id":"ae2acfd3-7c42-4224-be7e-aa5c2293b72e","name":"Belle Vue Girls School (BDAT)","isPublished":"Y","status":"R","vacancies":"F"},{"id":"9812c627-5ac2-4757-9f2a-9e75dab88c76","name":"The Marvell College","isPublished":"Y","status":"R","vacancies":"F"},{"id":"330c8fbe-3401-4049-b615-2b8244e171b6","name":"Trinity Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"b6d15f0e-0b49-4acf-8dd3-e9b0d32c4c56","name":"Allerton High School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"f192bcc5-676b-4031-9917-72ec19c0a64f","name":"Baysgarth School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"59579b9d-79e3-4ab9-a34e-6d11aad8263e","code":"1N1","name":"Gorse SCITT"},"profPost":"BO","degreeGrade":"2","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We accept equivalencies passed prior to the programme commencing through equivalencytesting.com","courseLength":"OneYear","feesUK":9250,"feesInternational":9250,"aboutCourse":"As a PE trainee teacher, you will learn all the skills needed to become an expert and assured teaching professional.  We will ensure that you are confident in delivering all aspects of the curriculum and whatever your discipline or subject specialism, you will be, by the end of the programme, fully equipped to successfully teach all topics and subjects to a range of abilities and key stages.  You will be taught how to plan and successfully deliver engaging and creative lessons, effectively assess pupil progress, reflect on your practice and become a well-rounded teacher who engages fully in whole-school life.  You will work alongside, and be mentored by, a range of expert and experienced colleagues – Subject Leads, Professional Mentors, Placement Mentors and the SCITT team – who will all ensure that by the end of your training you are able to teach in any setting, in any context and in any location. \r\n\r\nAssessment for Qualified Teacher Status will be against our curriculum, the Core Content Framework, and ultimately, the Teachers’ Standards.  You will submit weekly evidence that demonstrates your progress in the classroom, as well as reflections on your training.  You will also receive regular and supportive feedback on your teaching from experienced colleagues.  For the PGCE element, which runs seamlessly alongside your school-based practice, you will complete two research-based university assignments; guidance and support for both QTS and PGCE will be offered throughout the year. \r\n","interviewProcess":"Our interview process is currently offered online. Because of our close relationship with our partner schools we may also be able to offer a school experience to applicants by negotiation.\r\n\r\nYou will usually be interviewed by a senior tutor of GORSE SCITT, a Subject Lead of GORSE SCITT and/or a Senior Leader from a partner school.\r\n\r\n•\tYou will make a short 3-5 minute presentation about why you want to teach and what you will bring to teaching; you should engage with the panel or pupils making clear why you want to be a teacher. \r\n\r\n•\tYou will participate in a lesson with a fully qualified teacher, interacting with students, helping them, answering questions and assisting the teacher with the lesson.\r\n\r\n•\tYou will have a formal interview which will give you the opportunity to discuss why you want to be a teacher, what you would bring to the profession, and also show us your resilience and initiative.\r\n\r\n•\tYou will be asked to complete a range of written work. These will include subjects such as current issues facing education, reasons for your subject being part of the curriculum, your desire to teach, the importance of safeguarding, and subject knowledge questions.\r\n\r\n•\tAfter your interview, we aim to let you know if you have been successful within 48 hours.\r\n\r\n•\tIf we regard you as a strong candidate who needs further development to be ready to join our programme we will facilitate this through our Subject Knowledge Enhancement programmes.\r\n","howSchoolPlacementsWork":"All of our carefully selected placement schools are detailed on our website.  We have worked hard to ensure that you will complete a minimum of two contrasting placements, each designed and personalised so that you will make real progress during the year.  Because of the rewarding and mutually-beneficial relationship between GORSE SCITT and its partner schools, your placements are guaranteed; you will not be offered a place on our programme if we do not have a quality placement experience to offer you.  We will organise and make all your placement arrangements for you.  In addition to your placements, your central and subject training will focus on what excellent classroom practice looks like, whilst always ensuring that you are aware of what effective and relevant evidenced-based practice looks like.   You will be taught how to take a reflective and analytical view of your teaching and know how to make effective progress.  You will work alongside, and be mentored by, a range of expert and experienced colleagues – Subject Leads, Professional Mentors, Placement Mentors and the SCITT team – who will all ensure that by the end of your training you are able to teach in any setting, in any context and in any location.\r\n\r\nYou will experience and teach across two key stages. For Primary that will be Key Stages One and Two (ages 4 to 11), for Secondary that will be Key Stages Three and Four (ages 11-16) and for Secondary/Post 16 that will be Key Stages Four and Five (14-19).\r\n\r\nYou will have a minimum of two placements, one from September to Christmas and one from January to June. A third placement maybe offered as applicable and if in your best interests.\r\n\r\nYou will usually be in school three days and two mornings every week and expected to follow the timings, practices and culture of the school.\r\n\r\nGORSE SCITT believes that all trainees, morally, should understand where pupils have been on their educational journey so far, and where their journey may take them.  As such, all trainees will experience teaching enhancements from Early Years to Year 13 and beyond.  \r\n","personalQualities":"Has high moral purpose in their desire to become a teacher.\r\n\r\nIs able to respond positively to guidance towards self-improvement.\r\n\r\nHas an intrinsic passion for learning.\r\n\r\nIs fully prepared and demonstrates a clear understanding of teaching in a socially and culturally diverse society.\r\n\r\nAssumes a high level of responsibility for the well-being, attainment, progress and outcomes of pupils.\r\n\r\nPlans lessons that use appropriate, imaginative and creative strategies that match the individual learning styles and needs of pupils.\r\n\r\nDemonstrates excellent subject knowledge and is able to apply this and the appropriate learning and teaching pedagogy to support the pupils they teach.\r\n\r\n","otherRequirements":"Offers will be subject to an Enhanced DBS which will be organised for you. We encourage you to enrol to the DBS update service. An overseas DBS may be required for those who have spent time outside of the UK.\r\n\r\nAll applicants will be required to complete proficiency tests in English and Mathematics which will be delivered by GORSE SCITT.\r\n","status":1,"createdAt":"2021-07-06T10:47:48.280Z","updatedAt":"2021-10-01T13:44:46.070Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
