{"id":"5fd05c59-c501-471e-a9fc-abf7f0a3eff8","name":"Primary","code":"3DJZ","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"1e17a859-4c54-49f9-b8e2-4d0e730ee402","name":"St Ives Primary and Nursery School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"78399a16-fc83-40db-918b-3d6b5dd32d73","code":"2BL","name":"St Ives Primary School"},"accreditedBody":{"id":"3700fb02-7007-40c8-9127-b070e146d6cb","code":"W76","name":"University of Winchester"},"profPost":"PG","degreeGrade":"0","english":"1","maths":"1","science":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feesInternational":13500,"aboutCourse":"Train to be a Primary Teacher through Holt Heath Alliance, Dorset.  The Holt Heath Alliance consists of six schools including both Primary and Pre School provision.  We are committed to outstanding teacher training provision and pride ourselves on providing the highest quality training for our teachers of tomorrow.\r\n\r\nSchool Direct gives an innovative opportunity to access high quality school based initial teacher training with our accredited HEI provider, the University of Winchester, to offer School Direct non salaried placements.  We have been a National Teaching School with a proven track record of training the next generation of teachers and now work in close collaboration with the Teaching Hub.\r\n\r\nTrainees will be placed in a base school for the school year, with a dedicated mentor, support from our teaching school and our tutor from Winchester University.  Training days are provided each Friday either at the University or at one of our six schools.\r\n\r\nThere will be 3 written assignments required over the course of the school year.\r\n\r\nWe will:\r\n•\tProvide an outstanding academic ‘hands on’ school based experience in a variety of settings\r\n\r\n•\tOffer a bespoke training package\r\n\r\n•\tOffer employment at the end of training where suitable vacancies arise, or assist with gainful employment within our alliance of schools","interviewProcess":"Following receipt of an application form for School Direct, this will be reviewed for shortlisting.  Applicants are notified of the outcome and if they have been successful are then invited for interview.\r\n\r\nOur selection process for our interviews has four main elements as follows:\r\n1.\tStory Telling Activity (30 minutes)\r\n2.\tMaths Task (45 minutes)\r\n3.\tEnglish Task (30 minutes)\r\n4.\tIndividual panel interview (30 minutes)\r\n\r\nThe results of all these aspects will be used to determine whether School Direct is the appropriate course for applicants.  During the interview process we may seek further clarification on information provided to us on application forms.\r\n\r\nAt the time of being invited for interview, applicants are provided with the following information:\r\n1.\tA timetable for the day, which outlines the time of the individual panel interview as well as the class that applicants have been assigned for the story telling activity.  \r\n2.\tFurther details on the story telling activity, in order to allow applicants to prepare for this activity.\r\n3.\tTwo articles, which applicants are advised to read to allow them to prepare for their English Task.  \r\n\t\r\nThe interview panel will consist of:\r\nLaura Crossley – Headteacher & Lead for Holt Heath Alliance – St. Ives Primary & Nursery School.\r\nA representative from the University of Winchester.","howSchoolPlacementsWork":"We are able to provide an outstanding academic \"hands on\" school based experience across a wide range of settings, by accessing the skills and experience of our schools, heads and staff within our six schools in our Trust.    We have five first schools and one primary school within our alliance/Trust.\r\n\r\nPrior to commencement of the programme trainees are asked for their preference for which key stage they would like to be placed in for their base school and where possible we try to accommodate this whilst also taking in to account the key stages each of our six schools can accommodate.  \r\n\r\nOur six schools are located in the following areas:\r\nSt. Ives Primary & Nursery School (St. Ives, Ringwood)\r\nThree Legged Cross First & Nursery School (Three Legged Cross, Wimborne)\r\nSt. Mary's CE First & Nursery School (West Moors, Ferndown)\r\nOakhurst Community First & Nursery School (West Moors, Ferndown)\r\nSixpenny Handley First School (Sixpenny Handley, Salisbury)\r\nSt. James' CE First School (Alderholt nr Fordingbridge)\r\n\r\nWith the combination of both the base school placement and 2nd placement each placement then provides a good range of experience to trainees across both Key Stage 1 and 2.\r\n\r\n2nd placements take place for the trainees during the Spring Term for a duration of 12 weeks.","personalQualities":"","otherRequirements":"Following interview, a conditional offer of a place on our programme includes the following:\r\n\r\nCompletion of a Disclosure and Barring Service (DBS) criminal records check and Prohibition Order check.\r\n\r\nCompletion of an Occupational Health check to confirm that you are fit to teach.\r\n\r\nThe University will provide you with full details and further information about these checks once you have accepted our conditional offer.","status":1,"createdAt":"2021-07-06T10:54:53.467Z","updatedAt":"2021-10-05T14:15:56.362Z","canSponsorStudentVisa":"yes","cycle":"2024"}
