{"id":"035ecbd4-5f28-4f68-9fc6-b1f80f82ddab","name":"Modern Languages","code":"R9X9","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"fbb00c08-2dbc-4f26-adb3-3b23afba18c1","code":"17","name":"German"},{"id":"e34fd2a3-a32e-44e9-aea1-666badf3ac03","code":"22","name":"Spanish"},{"id":"4608e5e3-2a1a-48a1-8236-56c7af5a139d","code":"24","name":"Modern languages (other)"},{"id":"ce8523ef-9236-4cd9-b260-d826c7a521b3","code":"ML","name":"Modern Languages"},{"id":"9727f674-61ba-4efa-b1f2-21ec7e354442","code":"15","name":"French"}],"locations":[{"id":"47d5d27a-6c49-4990-8071-bdb64f842c90","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"6019b3ce-f2f6-4b0e-b2a9-5813d74c4d54","code":"W80","name":"University of Worcester"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"University of Worcester equivalency tests are available. Please contact [admissionsb@worc.ac.uk](mailto:admissionsb@worc.ac.uk) or visit [https://www.worcester.ac.uk/study/find-a-course/how-to-apply/equivalency-tests.aspx](https://www.worcester.ac.uk/study/find-a-course/how-to-apply/equivalency-tests.aspx) for further information.","courseLength":"OneYear","feesUK":9250,"feesInternational":14100,"feeDetails":"Every course has day-to-day costs for essential books, stationery, printing and photocopying.\r\n\r\nIf you are in receipt of a bursary, you would be responsible for your own travel costs.\r\n\r\nWe organise occasional visits to increase subject knowledge. Travel costs are at your own expense but we do encourage car sharing. In addition there is sometimes a fee but this is not normally more than £20 in total.\r\n\r\nIn addition, we encourage you to join subject specific associations. The cost is typically between £25 to £50 for which you benefit from their support, guidance and resources.","aboutCourse":"The Modern Languages PGCE course seeks to enthuse you with a passion for working with young people. \r\n\r\nThe course is available as a single language course in French, Spanish, as well as the following combinations: French with German; French with Spanish; German with French; and Spanish with French.\r\n\r\nThe PGCE curriculum aims to enable trainees to become highly effective teachers. Trainees are encouraged to experiment with, apply, discuss, debate, compare and question current research-informed ideas. They work collaboratively to consolidate their subject knowledge and their understanding of pedagogy in the subject. \r\n\r\nTrainees work with trained school mentors from partnership schools who contribute to University subject sessions (teaching grammar, working with disadvantaged pupils and using data sensibly), they discuss and debate subject-specific approaches to pedagogy with their mentors in school. \r\n\r\nTrainees also take part in exciting projects and cross-curricular sessions with trainees from different PGCE subjects.\r\n\r\nThis includes:\r\n\r\n* taking part in the European Day of Languages in a secondary school\r\n* contributing to cross-curricular days organised in University and working with trainee teachers from different subject specialisms (English, Geography, History, Mathematics and Religious Studies).\r\n* planning a cross-curricular lesson collaboratively with primary trainee teachers and team-teaching it at a primary school.\r\n\r\nInternational and UK applicants are welcome. We have support systems in place to help all trainees write assignments at Master’s level and additional targeted support for international trainees. Modern Languages trainees get regular opportunities to work on their subject knowledge.\r\n\r\nThe UK Government has confirmed that EU students starting their course after August 2021 will no longer pay the home rate for fees or be eligible for undergraduate, postgraduate and advanced learner financial support from Student Finance England. However, at the University of Worcester we have decided that (with the exception of the Medicine MBChB), during this period of transition, EU students starting their studies in the academic year 2022/23 will continue to be eligible for the home rate of fees.\r\n\r\nIf you do not have experience of the English education system you will be invited to attend a pre-course induction day.\r\n\r\nVisit our website to find out more: [https://www.worcester.ac.uk/courses/pgce-secondary-modern-languages](https://www.worcester.ac.uk/courses/pgce-secondary-modern-languages)\r\n\r\nAssessment:\r\nYou will be assessed on your teaching practice and two academic assignments. One assignment requires you to generate some teaching resources that will help pupils to learn a particular topic and the second assignment will engage you in reviewing the teaching strategies that are effective in your subject.","interviewProcess":"The selection process: Trainees are recruited through a rigorous selection process. The team consider the personal statement and reference to decide whether to offer an interview.\r\n\r\nAt interview, you will be asked to complete:\r\n\r\n* A timed written task based on Modern Language subject knowledge\r\n* A short presentation (details sent out with the interview invite)\r\n* A group task (Currently interviews are conducted online and will not include a group task.)\r\n* An interview with two people usually a university tutor and a mentor from school\r\n\r\nReferences: For your application, you will need two references which are submitted online.\r\n\r\nA subject knowledge enhancement course may be available to anyone who would benefit from updating their language knowledge and skills. This will be discussed with you at interview.","howSchoolPlacementsWork":"We work with a range of school through the West Midlands region. The school you are placed in will be within commuting distance. The University will select your placement schools.\r\n\r\nThe course is designed with periods in University. University sessions are split between subject sessions and professional study sessions. Sessions also give you the opportunity to reflect on your future development. Former trainees have made positive comments on the balance between time in university and school, the carefully structured sessions, tutors’ commitment to supporting trainees and trainees supporting each other including sharing good practice.\r\n\r\nIn each school you will be supported by a Professional Mentor, as well as your Subject Mentor. Their job is to see that you get as much out of your teaching placements as possible and provide you with support and guidance. At interview you may meet teachers from our partnership schools as they take part in the selection process alongside University tutors.\r\n\r\nAge range:\r\nYou will be trained to teach 11-16 with post 16 enhancement. ","personalQualities":"We are looking for trainee teachers who are:\r\n\r\n* Resilient, supportive professionals with strong values and high standards of personal conduct.\r\n* Effective communicators who collaborate to support wider educational opportunities.\r\n* Ambitious participants who are creative and informed intellectuals and promote a love of learning.\r\n* Confident and critically reflective practitioners motivated to continuingly improve practice.\r\n* Highly-skilled and inspirational subject/phase specialists committed to ensuring the safety, well-being and educational progress of all learners.\r\n\r\nSchool experience is desirable, but not essential. At interview we will discuss relevant experience and any opportunities you have had to work with school-aged children.","otherRequirements":"Health and Physical Capacity to Teach: The DfE requires all trainees to satisfactorily complete a medical questionnaire to demonstrate their fitness to teach. People with disabilities or chronic illnesses may have the capacity to teach, just as those without disabilities or medical conditions may be unsuitable to teach.\r\n\r\nDBS: All entrants to ITE programmes will be subject to appropriate pre-selection checks, including an enhanced DBS (Disclosure and Barring Service), criminal records checks and children’s barred list information.","status":1,"createdAt":"2021-07-06T10:49:49.416Z","updatedAt":"2021-09-13T10:29:40.217Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
