{"id":"08eb8439-41da-4c95-b49c-365d82fe59ec","name":"Business Studies","code":"39F6","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"14_to_19","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"de6477b2-6027-48e6-b9f7-3206774705c2","code":"08","name":"Business studies"}],"locations":[{"id":"47d5d27a-6c49-4990-8071-bdb64f842c90","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"6019b3ce-f2f6-4b0e-b2a9-5813d74c4d54","code":"W80","name":"University of Worcester"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"University of Worcester equivalency tests are available. Please contact [admissionsb@worc.ac.uk](mailto:admissionsb@worc.ac.uk) or visit [https://www.worcester.ac.uk/study/find-a-course/how-to-apply/equivalency-tests.aspx](https://www.worcester.ac.uk/study/find-a-course/how-to-apply/equivalency-tests.aspx) for further information.","courseLength":"OneYear","feesUK":9250,"feesInternational":14100,"feeDetails":"Every course has day-to-day costs for essential books, stationery, printing and photocopying.\r\n\r\nIf you are in receipt of a bursary, you would be responsible for your own travel costs.\r\n\r\nWe organise occasional visits to increase subject knowledge. Travel costs are at your own expense but we do encourage car sharing. In addition there is sometimes a fee but this is not normally more than £20 in total.\r\n\r\nIn addition, we encourage you to join subject specific associations. The cost is typically between £25 to £50 for which you benefit from their support, guidance and resources.","aboutCourse":"The course consists of university-based sessions and teaching practice in partner schools. While on teaching practice you will be supported by a professional mentor who focuses on induction and whole school issues and an experienced subject mentor who will give opportunities to improve your subject knowledge and hold weekly meetings with you to guide you in preparation, teaching and reflecting on your lessons.\r\n\r\nYou will visit a variety of schools, including secondary schools, an independent school, a college of further education and a school for pupils with special educational needs. The training is active, engaging and involves a range of school teaching contexts from financial awareness and enterprise education through to GCSE, A Level and vocational courses. University tutors and school mentors work closely to support you and help you develop. Trainee teachers receive a very high level of support, which is a real strength of the course.\r\n\r\nDuring university-based sessions you will:\r\n\r\n* Explore business and economics concepts by engaging with a range of activities\r\n* Consider what effective learning and teaching looks like in a business and economics classroom through reflecting on your own learning and exploring research evidence\r\n* Discuss the place of business and economics in the curriculum and the current issues within business and economics education\r\n* Continue to develop your own subject knowledge throughout the course\r\n\r\nTypical university sessions include presentations by tutors, some school teachers and by fellow trainees, reflective workshops tasks for individuals, pairs and groups and investigative and creative tasks to take into school.\r\n\r\nFind out more: [https://www.worcester.ac.uk/courses/pgce-secondary-business-with-economics](https://www.worcester.ac.uk/courses/pgce-secondary-business-with-economics)\r\n\r\nCareer opportunities:\r\n\r\nAn integral part of the course is to support you in gaining a post as a teacher. Each year around 50% of our trainees gain employment in our partnership schools. Newly Qualified Teachers have one of the highest employment rates of all graduates and are very much in demand. Employment rates over the past 5 years have consistently been 95%+. At the end of the course we will support you in your transition from the PGCE year into your first teaching post.\r\n\r\nAssessment:\r\n\r\nYou will be assessed on your teaching practice and two academic assignments. One assignment requires you to generate some teaching resources that will help pupils to learn a particular topic and the second assignment will engage you in reviewing the teaching strategies that are effective in your subject.","interviewProcess":"The selection process:\r\n\r\nTrainees are recruited through a rigorous selection process. The team consider the personal statement and reference to decide whether to offer an interview.\r\n\r\nAt interview, you will be asked to complete:\r\n\r\n* A timed written task based on Business subject knowledge\r\n* A short presentation (details sent out with the interview invite)\r\n* A group task\r\n* An interview with two people usually a university tutor and a mentor from school\r\n\r\nCurrently interviews are conducted online and will not include a group task.\r\n\r\nReferences:\r\n\r\nFor your application, you will need two references which are submitted online.\r\n","howSchoolPlacementsWork":"We work with a range of school through the West Midlands region. The school you are placed in will be within commuting distance. The University will select your placement schools.\r\n\r\nThe course is designed with periods in University. University sessions are split between subject sessions and professional study sessions. Sessions also give you the opportunity to reflect on your future development. Former trainees have made positive comments on the balance between time in university and school, the carefully structured sessions, tutors’ commitment to supporting trainees and trainees supporting each other including sharing good practice.\r\n\r\nIn each school you will be supported by a Professional Mentor, as well as your Subject Mentor. Their job is to see that you get as much out of your teaching placements as possible and provide you with support and guidance. At interview you may meet teachers from our partnership schools as they take part in the selection process alongside University tutors.","personalQualities":"We are looking for trainee teachers who are:\r\n\r\n* Resilient, supportive professionals with strong values and high standards of personal conduct.\r\n* Effective communicators who collaborate to support wider educational opportunities.\r\n* Ambitious participants who are creative and informed intellectuals and promote a love of learning.\r\n* Confident and critically reflective practitioners motivated to continuingly improve practice.\r\n* Highly-skilled and inspirational subject/phase specialists committed to ensuring the safety, well-being and educational progress of all learners.\r\n\r\nSchool experience is desirable, but not essential. At interview we will discuss relevant experience and any opportunities you have had to work with school-aged children.\r\n","otherRequirements":"Health and Physical Capacity to Teach:\r\nThe DfE requires all trainees to satisfactorily complete a medical questionnaire to demonstrate their fitness to teach. People with disabilities or chronic illnesses may have the capacity to teach, just as those without disabilities or medical conditions may be unsuitable to teach.\r\n\r\nDBS:\r\nAll entrants to ITE programmes will be subject to appropriate pre-selection checks, including an enhanced DBS (Disclosure and Barring Service), criminal records checks and children’s barred list information.\r\n","status":1,"createdAt":"2021-07-06T10:49:48.796Z","updatedAt":"2021-09-13T09:40:28.140Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
