{"id":"0e19a856-f5b0-497c-a3db-3ad67670b117","name":"Art and design","code":"L080","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"d461a678-3335-4ca2-9616-1dc479d31a49","code":"W1","name":"Art and design"}],"locations":[{"id":"47d5d27a-6c49-4990-8071-bdb64f842c90","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"6019b3ce-f2f6-4b0e-b2a9-5813d74c4d54","code":"W80","name":"University of Worcester"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"University of Worcester equivalency tests are available. Please contact [admissionsb@worc.ac.uk](mailto:admissionsb@worc.ac.uk) or visit [https://www.worcester.ac.uk/study/find-a-course/how-to-apply/equivalency-tests.aspx](https://www.worcester.ac.uk/study/find-a-course/how-to-apply/equivalency-tests.aspx) for further information.","courseLength":"OneYear","feesUK":9250,"feesInternational":14100,"feeDetails":"Every course has day-to-day costs for essential books, trips, stationery, printing and photocopying.\r\n\r\nIf you are in receipt of a bursary, you would be responsible for your own travel costs.\r\n\r\nYou will need to buy some protective clothing to wear for practical work (apron, overall or chef’s jacket). You will also be expected to purchase materials and ingredients to make the products you will be teaching pupils to make.\r\n\r\nIn addition, we encourage you to join subject specific associations. The cost is typically between £25 to £50 for which you benefit from their support, guidance and resources.\r\n\r\nThe DfE requires all trainee teachers to obtain an Enhanced Disclosure & Barring Service (DBS) check, which you will need to pay for.","aboutCourse":"Art and design stimulates creativity and imagination. It provides visual, tactile and sensory experiences and a unique way of understanding and responding to the world. Pupils use visual elements such as colour, form, texture and pattern, together with a range of different materials and processes to communicate what they see, feel and think. Through art and design activities pupils learn to make informed value judgements and aesthetic and practical decisions, becoming actively involved in shaping environments. They explore ideas and meanings in the work of artists, craftspeople and designers. They learn about the diverse roles of artists, and the functions of art, craft and design in contemporary life and in different times and cultures, and they consider the many career paths in the creative industries.\r\n\r\nThis requires teachers who are dynamic, flexible, enquiring, and innovative, and this PGCE programme is designed to fully support trainees to become this kind of teacher, committed to making art and design accessible for all. The course is active and practical, developing trainees’ understanding of their specialisms as well working in new areas of the art and design curriculum; teachers with national reputations for excellence lead a series of curriculum workshops in disciplines such as drawing, ceramics, painting, photography and stained glass. The course also allows trainees to develop their professional competence through working with young people in partnerships schools and in the University. Trainees also share and discuss educational issues and study relevant and up to date educational research. \r\n\r\nTrainees may also work in collaboration with other subject trainees on cross-curricular projects, as well as with trainees from other art and design PGCE programmes across England. We will be forging links with artists, galleries and museums to create a broad experience for trainees.\r\n\r\nThe course is just the beginning of what we hope will be a process of continual professional development throughout a challenging and rewarding career.\r\n\r\n[Visit our website] (https://www.worcester.ac.uk/courses/pgce-secondary-art-and-design) to find out more.","interviewProcess":"The selection process: Trainees are recruited through a rigorous selection process. The team consider the personal statement and reference to decide whether to offer an interview.\r\nAt interview, you will be asked to complete:\r\n\r\n* A timed written task based on art and design subject knowledge\r\n* A short presentation (details sent out with the interview invite)\r\n* A group task (currently interviews are being conducted online and will not include a group task)\r\n* An interview with two people, usually a university tutor and a mentor from school\r\n\r\nReferences: For your application, you will need two references which are submitted online.\r\n","howSchoolPlacementsWork":"We work with a range of school through the West Midlands region. The school you are placed in will be within commuting distance. The University will select your placement schools.\r\n\r\nThe course is designed with periods in University. University sessions are split between subject sessions and professional study sessions. Sessions also give you the opportunity to reflect on your future development. Former trainees have made positive comments on the balance between time in university and school, the carefully structured sessions, tutors’ commitment to supporting trainees and trainees supporting each other including sharing good practice.\r\n\r\nIn each school you will be supported by a Professional Mentor, as well as your Subject Mentor. Their job is to see that you get as much out of your teaching placements as possible and provide you with support and guidance. At interview you may meet teachers from our partnership schools as they take part in the selection process alongside University tutors.","personalQualities":"We are looking for trainee teachers who are:\r\n\r\n* Resilient, supportive professionals with strong values and high standards of personal conduct.\r\n* Effective communicators who collaborate to support wider educational opportunities.\r\n* Ambitious participants who are creative and informed intellectuals and promote a love of learning.\r\n* Confident and critically reflective practitioners motivated to continuingly improve practice.\r\n* Highly-skilled and inspirational subject/phase specialists committed to ensuring the safety, well-being and educational progress of all learners.\r\n\r\nSchool experience is desirable, but not essential. At interview we will discuss relevant experience and any opportunities you have had to work with school-aged children.","otherRequirements":"Health and Physical Capacity to Teach: The DfE requires all trainees to satisfactorily complete a medical questionnaire to demonstrate their fitness to teach. People with disabilities or chronic illnesses may have the capacity to teach, just as those without disabilities or medical conditions may be unsuitable to teach.\r\n\r\nDBS: All entrants to ITE programmes will be subject to appropriate pre-selection checks, including an enhanced DBS (Disclosure and Barring Service), criminal records checks and children’s barred list information.\r\n","status":1,"createdAt":"2021-07-06T10:49:49.330Z","updatedAt":"2021-09-13T09:31:01.023Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
