{"id":"0fb9627f-8687-415f-840b-86a026da1019","name":"Biology","code":"39F2","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"HE","studyMode":"P","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"322cfc19-d51d-45db-91e3-bd7b4738470f","code":"C1","name":"Biology"}],"trainingProvider":{"id":"6019b3ce-f2f6-4b0e-b2a9-5813d74c4d54","code":"W80","name":"University of Worcester"},"profPost":"PG","english":"3","maths":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"Four terms","feesUK":9250,"feeDetails":"Every course has day-to-day costs for essential books, stationery, printing and photocopying.\r\n\r\nTravel costs for placements vary depending on the location of schools and your mode of transport, sometimes these may be reclaimed depending on your individual circumstances.\r\n\r\nWe organise occasional visits to increase subject knowledge. Travel costs are at your own expense but we do encourage car sharing. In addition there is sometimes a fee but this is not normally more than £20 in total.\r\n\r\nIn addition, we encourage you to join subject specific associations. The cost is typically between £25 to £50 for which you benefit from their support, guidance and resources. ","aboutCourse":"Are you passionate about Science? Do you want to inspire students in secondary schools? \r\n\r\nOur Science training courses culture a thought-provoking, constructive and positive environment with guaranteed support and commitment from our passionate subject specialist tutors. Not only will you receive specialist training within your discipline of Science, but we will also help you to build confidence in teaching the sciences outside of your specialism at key stages 3 and 4. Trainees speak highly about the quality of our teacher training programme, the excellent partnership between the University and schools and the fantastic employment rates. \r\n\r\nOur passion for inspiring the next generation of scientists permeates the whole course, with sessions that are predominantly practical and laboratory-based. We equip you with the skills you need to become an outstanding Science teacher, including behaviour management within the laboratory and 'wow' moments to engage students in their learning. \r\n\r\nTrainees have access to national organisations such as the Royal Societies for Biology and Chemistry and the Institute of Physics. All of our Science trainees have the opportunity to present at an international science conference. The University of Worcester is the STEM Ambassador Hub for the West Midlands; this provides further enrichment opportunities which can help you to foster, encourage and enhance pupils' interest in Science. \r\n\r\nA biology subject knowledge enhancement course is available to anyone who would benefit from updating their biology knowledge. This will be discussed with you at interview. \r\n\r\nVisit our website to find out more: [https://www.worcester.ac.uk/courses/pgce-secondary-science-biology](https://www.worcester.ac.uk/courses/pgce-secondary-science-biology)\r\n\r\nYou will be trained to teach 11-16 with post 16 enhancement. \r\n\r\nCareer opportunities:\r\nAn integral part of the course is to support you in gaining a post as a teacher. Each year around 50% of our trainees gain employment in our partnership schools. Newly Qualified Teachers have one of the highest employment rates of all graduates and are very much in demand. Employment rates over the past 5 years have consistently been 95%+. At the end of the course we will support you in your transition from the PGCE year into your first teaching post, and beyond. \r\n\r\nAssessment:\r\nYou will be assessed on the basis of course work including written assignments, a resource task and an oral presentation of a small research project, as well as on your teaching practice. ","interviewProcess":"The selection process:\r\nTrainees are recruited through a rigorous selection process. The team consider the personal statement and reference to decide whether to offer an interview. \r\n\r\nAt interview, you will be asked to complete: \r\n* A timed written task \r\n* A short presentation (details sent out with the interview invite) \r\n* A group task \r\n* An interview with two people, usually a university tutor and a mentor from school \r\n\r\nReferences:\r\nFor your application, you will need two references which are submitted online.","howSchoolPlacementsWork":"We work very closely with our partner schools, to provide you with high quality teacher training to prepare you for your first teaching job and beyond. Our partner schools provide a range of settings from rural to inner city. Most schools are within a 30 mile radius of the University. You will practise teaching in at least two schools. \r\n\r\nThe course is designed with periods in University to give you the opportunity to reflect on your future development. Former trainees have made positive comments on the balance between theory and practice, carefully structured sessions, tutors' commitment to supporting trainees and trainees supporting each other and sharing good practice. \r\n\r\nIn each school you will be supported by a Professional Mentor, as well as your Subject Mentor. Their job is to see that you get as much out of your teaching placements as possible, and provide you with support and guidance. At interview you may meet teachers from our partnership schools as they take part in the selection process alongside University tutors. ","personalQualities":"We are looking for trainees who are: \r\n\r\n* skilled and inspirational subject specialists\r\n* confident and reflective practitioners\r\n* effective communicators who can work in partnership\r\n* informed intellectuals who promote a love of learning\r\n* resilient professionals able to demonstrate high standards of personal conduct\r\n\r\nSchool experience is desirable, but not essential. At interview we will discuss relevant prior school experience or opportunities you have had to work with school-aged children. At this point we will discuss with you whether additional school experience would support you in deciding that teaching is right for you. ","otherRequirements":"Health and Physical Capacity to Teach:\r\nThe DfE requires all trainees to satisfactorily complete a medical questionnaire to demonstrate their fitness to teach. People with disabilities or chronic illnesses may have the capacity to teach, just as those without disabilities or medical conditions may be unsuitable to teach. \r\n\r\nDBS:\r\nAll entrants to ITE programmes will be subject to appropriate pre-selection checks, including an enhanced DBS (Disclosure and Barring Service), criminal records checks and children's barred list information. ","status":2,"createdAt":"2021-07-06T10:49:48.737Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
