{"id":"10ca205e-e396-4141-b6c4-1f92ca05a8b1","name":"Mathematics","code":"39FQ","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"HE","studyMode":"P","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"72345aa7-096c-488f-8649-085b8178cadb","code":"G1","name":"Mathematics"}],"trainingProvider":{"id":"6019b3ce-f2f6-4b0e-b2a9-5813d74c4d54","code":"W80","name":"University of Worcester"},"profPost":"PG","english":"3","maths":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"4 school terms","feesUK":9250,"feeDetails":"Every course has day-to-day costs for essential books, stationery, printing and photocopying.\r\n\r\nTravel costs for placements vary depending on the location of schools and your mode of transport, sometimes these may be reclaimed depending on your individual circumstances.\r\n\r\nWe organise occasional visits to increase subject knowledge. Travel costs are at your own expense but we do encourage car sharing. In addition there is sometimes a fee but this is not normally more than £20 in total.\r\n\r\nIn addition, we encourage you to join subject specific associations. The cost is typically between £25 to £50 for which you benefit from their support, guidance and resources. ","aboutCourse":"This popular course focuses on developing the knowledge and skills required of a specialist subject teacher of Mathematics working with students across the full secondary age and attainment range, including Post-16. You will develop your knowledge of the National Curriculum at Key Stages 2, 3, 4 and 5. You will explore effective approaches to teaching, learning and assessing mathematics and participate in lively discussions about current issues within mathematics education. \r\n\r\nAll subject sessions at university are delivered in a seminar format, which enables good practice to be exemplified in a supportive environment. Subject mentors in partner schools will continue to help you to develop and refine your practical teachings skills including lesson planning, assessment and feedback. Employment prospects at the end of the course are excellent locally and further afield. \r\n\r\nYou will be encouraged to register as a STEM Ambassador at the start of the course and will utilise this status when delivering Mathematics Masterclasses and developing in-school STEM activities. Our close connection with the local Maths Hub network means that there are a number of additional opportunities available to you, including Mathematics TeachMeet events and conferences. \r\n\r\nStudents joining the course come with a range of prior experience, thus enriching the discussion in subject sessions.\r\n\r\nA mathematics subject knowledge enhancement course is available to anyone who would benefit from updating their mathematics knowledge. This will be discussed with you at interview. \r\n\r\nIf you believe that every child can succeed in learning mathematics, are enthusiastic and have the capacity to work hard, we would like to receive an application from you. \r\n\r\nVisit our website to find out more: [https://www.worcester.ac.uk/courses/pgce-secondary-mathematics](https://www.worcester.ac.uk/courses/pgce-secondary-mathematics)\r\n\r\nAge range:\r\nYou will be trained to teach 11-16 with post 16 enhancement. \r\n\r\nCareer opportunities:\r\nAn integral part of the course is to support you in gaining a post as a teacher. Each year around 50% of our trainees gain employment in our partnership schools. Newly Qualified Teachers have one of the highest employment rates of all graduates and are very much in demand. Employment rates over the past 5 years have consistently been 95%+. At the end of the course we will support you in your transition from the PGCE year into your first teaching post, and beyond. \r\n\r\nAssessment:\r\nYou will be assessed on the basis of course work including written assignments, a resource task and an oral presentation of a small research project, as well as on your teaching practice.","interviewProcess":"The selection process:\r\nTrainees are recruited through a rigorous selection process. The team consider the personal statement and reference to decide whether to offer an interview. \r\n\r\nAt interview, you will be asked to complete: \r\n* A timed written task \r\n* A short presentation (details sent out with the interview invite) \r\n* A group task \r\n* An interview with two people, usually a university tutor and a mentor from school \r\n\r\nReferences:\r\nFor your application, you will need two references which are submitted online.","howSchoolPlacementsWork":"We work very closely with our partner schools, to provide you with high quality teacher training to prepare you for your first teaching job and beyond. Our partner schools provide a range of settings from rural to inner city. Most schools are within a 30 mile radius of the University. You will practise teaching in at least two schools. \r\n\r\nThe course is designed with periods in University to give you the opportunity to reflect on your future development. Former trainees have made positive comments on the balance between theory and practice, carefully structured sessions, tutors' commitment to supporting trainees and trainees supporting each other and sharing good practice. \r\n\r\nIn each school you will be supported by a Professional Mentor, as well as your Subject Mentor. Their job is to see that you get as much out of your teaching placements as possible, and provide you with support and guidance. At interview you may meet teachers from our partnership schools as they take part in the selection process alongside University tutors. ","personalQualities":"We are looking for trainees who are: \r\n\r\n* skilled and inspirational subject specialists\r\n* confident and reflective practitioners\r\n* effective communicators who can work in partnership\r\n* informed intellectuals who promote a love of learning\r\n* resilient professionals able to demonstrate high standards of personal conduct\r\n\r\nSchool experience is desirable, but not essential prior to an interview. At interview we will discuss relevant prior school experience or opportunities you have had to work with school-aged children. At this point we will discuss with you whether additional school experience would support you in deciding that teaching is right for you. ","otherRequirements":"Health and Physical Capacity to Teach:\r\nThe DfE requires all trainees to satisfactorily complete a medical questionnaire to demonstrate their fitness to teach. People with disabilities or chronic illnesses may have the capacity to teach, just as those without disabilities or medical conditions may be unsuitable to teach. \r\n\r\nDBS:\r\nAll entrants to ITE programmes will be subject to appropriate pre-selection checks, including an enhanced DBS (Disclosure and Barring Service), criminal records checks and children's barred list information.","status":2,"createdAt":"2021-07-06T10:49:48.835Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
