{"id":"1a66f70c-b4c8-48d1-b57e-2fd92d69ba1f","name":"Computing","code":"IX99","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"e6be6a9c-8696-4b88-8fbd-1ba1bef1b6fc","code":"11","name":"Computing"}],"locations":[{"id":"47d5d27a-6c49-4990-8071-bdb64f842c90","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"6019b3ce-f2f6-4b0e-b2a9-5813d74c4d54","code":"W80","name":"University of Worcester"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"University of Worcester equivalency tests are available. Please contact [admissionsb@worc.ac.uk](mailto:admissionsb@worc.ac.uk) or visit [https://www.worcester.ac.uk/study/find-a-course/how-to-apply/equivalency-tests.aspx](https://www.worcester.ac.uk/study/find-a-course/how-to-apply/equivalency-tests.aspx) for further information.","courseLength":"OneYear","feesUK":9250,"feesInternational":14100,"feeDetails":"Every course has day-to-day costs for essential books, stationery, printing and photocopying.\r\n\r\nIf you are in receipt of a bursary, you would be responsible for your own travel costs.\r\n\r\nYou may be given the opportunity to visit a museum related to computer science.  Personal travel and entry fees are at your expense.\r\n\r\nYou may wish to buy your own Raspberry Pi computer or BBC Micro:bit to experiment with at home.  This will further develop your skills and interest in physical computing projects.  A range of kits are available commercially. ","aboutCourse":"This PGCE will train you to teach in this exciting and fast moving curriculum area. Future teachers need to equip their pupils with a deeper understanding of the underlying principles of how a computer works. The course provides you with a chance to inspire the next generation of technology leaders, innovators and programmers as you will be trained to teach the concepts of computational thinking as well as practical programming and ICT skills. The course consists of university-based sessions (which make up approximately a third of the time) and teaching practice in two of our excellent partner schools. While in school you will be supported by an experienced ICT/computing mentor. \r\n\r\nThe university sessions are taught in a way that models effective teaching strategies. You will need to consider how to teach the principles of computer science as well as developing your personal skill set which will enable you to challenge and motivate your pupils in this dynamic curriculum area. The university sessions prepare you to become a confident, organised and reflective teacher as you will undertake considerable practical work to increase your knowledge of a range of software tools that are used in schools. You will also consider other aspects such as ethical, environmental and legal issues. You will discuss the place of computer science in the curriculum and continue to develop your own subject knowledge throughout the course and reflect on what it is to be a computational thinker. \r\n\r\nDuring the course you will be supported to develop your programming skills to meet the requirements of the GCSE and A level qualifications. You will learn to plan, prepare and teach engaging lessons in ICT and Computing as you also improve your behaviour management skills in a computer lab setting. \r\n\r\nA computer science subject knowledge enhancement course is available to anyone who would benefit from updating their computer science knowledge. This will be discussed with you at interview. \r\n\r\nVisit our website to find out more: [https://www.worcester.ac.uk/courses/pgce-secondary-computer-science-ict](https://www.worcester.ac.uk/courses/pgce-secondary-computer-science-ict)\r\n\r\nAge range:\r\nYou will be trained to teach 11-16 with post-16 enhancement. \r\n\r\nAssessment:\r\nYou will be assessed on your teaching practice and two academic assignments. One assignment requires you to generate some teaching resources that will help pupils to learn a particular topic and the second assignment will engage you in reviewing the teaching strategies that are effective in your subject.","interviewProcess":"The selection process:\r\nTrainees are recruited through a rigorous selection process. The team consider the personal statement and reference to decide whether to offer an interview. \r\n\r\nAt interview, you will be asked to complete: \r\n* A timed written task based on Computing subject knowledge\r\n* A short presentation (details sent out with the interview invite) \r\n* A group task \r\n* An interview with two people, usually a university tutor and a mentor from school \r\n\r\nCurrently interviews are conducted online and will not include a group task. \r\n\r\nReferences:\r\nFor your application, you will need two references which are submitted online.","howSchoolPlacementsWork":"We work with a range of school through the West Midlands region. The school you are placed in will be within commuting distance. The University will select your placement schools.\r\n\r\nThe course is designed with periods in University. University sessions are split between subject sessions and professional study sessions. Sessions also give you the opportunity to reflect on your future development. Former trainees have made positive comments on the balance between time in university and school, the carefully structured sessions, tutors’ commitment to supporting trainees and trainees supporting each other including sharing good practice.\r\n\r\nIn each school you will be supported by a Professional Mentor, as well as your Subject Mentor. Their job is to see that you get as much out of your teaching placements as possible and provide you with support and guidance. At interview you may meet teachers from our partnership schools as they take part in the selection process alongside University tutors.","personalQualities":"We are looking for trainee teachers who are:\r\n\r\n* Resilient, supportive professionals with strong values and high standards of personal conduct.\r\n* Effective communicators who collaborate to support wider educational opportunities.\r\n* Ambitious participants who are creative and informed intellectuals and promote a love of learning.\r\n* Confident and critically reflective practitioners motivated to continuingly improve practice.\r\n* Highly-skilled and inspirational subject/phase specialists committed to ensuring the safety, well-being and educational progress of all learners.\r\n\r\nSchool experience is desirable, but not essential. At interview we will discuss relevant experience and any opportunities you have had to work with school-aged children.\r\n","otherRequirements":"Health and Physical Capacity to Teach:\r\nThe DfE requires all trainees to satisfactorily complete a medical questionnaire to demonstrate their fitness to teach. People with disabilities or chronic illnesses may have the capacity to teach, just as those without disabilities or medical conditions may be unsuitable to teach. \r\n\r\nDBS:\r\nAll entrants to ITE programmes will be subject to appropriate pre-selection checks, including an enhanced DBS (Disclosure and Barring Service), criminal records checks and children's barred list information.","status":1,"createdAt":"2021-07-06T10:49:49.265Z","updatedAt":"2021-09-13T11:15:15.897Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
