{"id":"3e5c2329-b4ee-4892-a49d-c887f520c05e","name":"History","code":"V1X1","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"5a3609a0-5bbb-4377-b919-5d89932ab622","code":"V1","name":"History"}],"locations":[{"id":"47d5d27a-6c49-4990-8071-bdb64f842c90","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"6019b3ce-f2f6-4b0e-b2a9-5813d74c4d54","code":"W80","name":"University of Worcester"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"University of Worcester equivalency tests are available. Please contact [admissionsb@worc.ac.uk](mailto:admissionsb@worc.ac.uk) or visit [https://www.worcester.ac.uk/study/find-a-course/how-to-apply/equivalency-tests.aspx](https://www.worcester.ac.uk/study/find-a-course/how-to-apply/equivalency-tests.aspx) for further information.","courseLength":"OneYear","feesUK":9250,"feesInternational":14100,"feeDetails":"Every course has day-to-day costs for essential books, stationery, printing and photocopying.\r\n\r\nIf you are in receipt of a bursary, you would be responsible for your own travel costs.\r\n\r\nWe organise occasional visits to increase subject knowledge. Travel costs are at your own expense but we do encourage car sharing. In addition there is sometimes a fee but this is not normally more than £20 in total.\r\n\r\nIn addition, we encourage you to join subject specific associations. The cost is typically between £25 to £50 for which you benefit from their support, guidance and resources.","aboutCourse":"This history PGCE will seek to enthuse prospective teachers with a passion for planning and designing learning activities, resources and strategies that will engage the 21st century teenager. To support this we will explore a wide range of strategies for teaching history to all abilities in the 11-16 age range, with post-16 enhancement. We will also devote time to considering why we teach history and what history we teach to our pupils. All history teachers need a clear rationale and purpose to inform their teaching. This course sets out to help you find your vision for history teaching.\r\n\r\nThe overall aim of the course is to equip students to meet the demands of their early years in teaching and to give them a firm base for professional development. They will:\r\n\r\n* Understand the nature of the subject in professional terms and develop confidence and expertise in teaching history.\r\n* Develop an understanding of curricular developments affecting history, in particular the National Curriculum for history along with GCSE and A-level specifications.\r\n* Acquire practical classroom skills; select, develop and use a wide variety of resources and teaching strategies.\r\n* Develop an awareness and understanding of pupils’ achievements and difficulties and become familiar with the use of a range of assessment techniques to assess, record and report on the progress of pupils.\r\n* Develop a sympathetic response to pupils’ individual needs and a critical awareness of their own performances based upon evidence gained from a variety of sources.\r\n* Have opportunities to develop skills in planning learning outside the classroom activities.\r\n\r\nIt is recognised that students undertaking the course will have different backgrounds. Some will have completed their first degrees immediately prior to commencement of the course, some will already have some experience working in schools, whilst others may be undertaking a career change. We all benefit from this diversity of experience as each person brings their own perspectives and experiences to the course. Peer group support and discussion is integral to course.\r\n\r\nVisit our website to find out more: [https://www.worcester.ac.uk/courses/pgce-secondary-history](https://www.worcester.ac.uk/courses/pgce-secondary-history)\r\n\r\nYou will be trained to teach 11-16 with post 16 enhancement.\r\n\r\nAssessment: You will be assessed on your teaching practice and two academic assignments. One assignment requires you to generate some teaching resources that will help pupils to learn a particular topic and the second assignment will engage you in reviewing the teaching strategies that are effective in your subject.","interviewProcess":"The selection process: Trainees are recruited through a rigorous selection process. The team consider the personal statement and reference to decide whether to offer an interview.\r\n\r\nAt interview, you will be asked to complete:\r\n\r\n* A timed written task based on History subject knowledge\r\n* A short presentation (details sent out with the interview invite)\r\n* A group task\r\n* An interview with two people, usually a university tutor and a mentor from school\r\n\r\nCurrently interviews are conducted online and will not include a group task.\r\n\r\nReferences: For your application, you will need two references which are submitted online.","howSchoolPlacementsWork":"We work with a range of school through the West Midlands region. The school you are placed in will be within commuting distance. The University will select your placement schools.\r\n\r\nThe course is designed with periods in University. University sessions are split between subject sessions and professional study sessions. Sessions also give you the opportunity to reflect on your future development. Former trainees have made positive comments on the balance between time in university and school, the carefully structured sessions, tutors’ commitment to supporting trainees and trainees supporting each other including sharing good practice.\r\n\r\nIn each school you will be supported by a Professional Mentor, as well as your Subject Mentor. Their job is to see that you get as much out of your teaching placements as possible and provide you with support and guidance. At interview you may meet teachers from our partnership schools as they take part in the selection process alongside University tutors.","personalQualities":"We are looking for trainee teachers who are:\r\n\r\n* Resilient, supportive professionals with strong values and high standards of personal conduct.\r\n* Effective communicators who collaborate to support wider educational opportunities.\r\n* Ambitious participants who are creative and informed intellectuals and promote a love of learning.\r\n* Confident and critically reflective practitioners motivated to continuingly improve practice.\r\n* Highly-skilled and inspirational subject/phase specialists committed to ensuring the safety, well-being and educational progress of all learners.\r\n\r\nSchool experience is desirable, but not essential. At interview we will discuss relevant experience and any opportunities you have had to work with school-aged children.","otherRequirements":"Health and Physical Capacity to Teach: The DfE requires all trainees to satisfactorily complete a medical questionnaire to demonstrate their fitness to teach. People with disabilities or chronic illnesses may have the capacity to teach, just as those without disabilities or medical conditions may be unsuitable to teach.\r\n\r\nDBS: All entrants to ITE programmes will be subject to appropriate pre-selection checks, including an enhanced DBS (Disclosure and Barring Service), criminal records checks and children’s barred list information.","status":1,"createdAt":"2021-07-06T10:49:49.488Z","updatedAt":"2021-09-13T10:17:57.339Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
