{"id":"52c0e9cd-1fe1-4ea0-a1f7-3996e1f1994b","name":"Primary (5-11)","code":"X104","qualification":"pgce_with_qts","startDate":"2022-09-01T09:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"88ac1d51-4b8a-45c5-a61a-2ee5a75ca468","name":"Main site","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"192808f2-8aee-42e6-b897-bd0405e8c0f7","name":"Main Site","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"59d57567-9085-4680-ac79-9d7cf3fc476b","name":"Main Site - Southwark Campus","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"47d5d27a-6c49-4990-8071-bdb64f842c90","name":"Main Site","isPublished":"true","status":"running","vacancies":"full_time"}],"trainingProvider":{"id":"6019b3ce-f2f6-4b0e-b2a9-5813d74c4d54","code":"W80","name":"University of Worcester"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"University of Worcester equivalency tests are available. Please contact [admissionsb@worc.ac.uk](mailto:admissionsb@worc.ac.uk) or visit [https://www.worcester.ac.uk/study/find-a-course/how-to-apply/equivalency-tests.aspx](https://www.worcester.ac.uk/study/find-a-course/how-to-apply/equivalency-tests.aspx) for further information.","courseLength":"OneYear","feesUK":9000,"feeDetails":"The SCITT course is run over an academic year (September-July). The course is split into 3 terms and trainees get school and Jewish holidays.\r\nThe fees for 2022/23 are £9,000. Trainees are eligible for a full loan from the Student Loan Company. \r\n","aboutCourse":"SCITT, which stands for School Centred Initial Teacher Training, is a 1 year primary training programme that leads to Qualified Teacher Status (QTS) and a PGCE (post-graduate certificate of education) with 60 Masters Level credits. During the academic year you will spend part of your time being taught how to teach across the primary curriculum and be trained on how to be an outstanding teacher. You will spend 120 days training in high-performing schools.\r\nYou will learn how to be an amazing teacher. Excellent, relevant training is provided by experienced practitioners and subject specialists and tailored to the individual needs of trainees. You will cover the subject knowledge required to teach across the primary age range (3-11years) including teaching English, Maths, Science and foundation subjects. We place a real emphasis on practical elements of teaching with expert tuition in creating exciting lessons, using technology as well as class and behaviour managment.\r\n\r\nPLEASE NOTE:\r\nThe contact details below are incorrect.  For more information please email suzanne.wayland@lsjs.ac.uk or visit https://www.lsjs.ac.uk/the-scitt-course.php","interviewProcess":"LSJS will invite candidates for interview once a UCAS application has been received. Candidates will be sent the interview details including tasks that will be assessed by the panel on the interview day. The interview day is a chance for prospective trainees to find out further information on how the course is run, to meet with the programme managers and to have any questions answered.","howSchoolPlacementsWork":"LSJS are responsible for organising and supporting trainees to complete 3 assessed school placements across the training year (one per term). We have close relationships with high performing schools to aid your training.\r\n\r\nTrainees complete their first and final placement in a Jewish school and their second placement in a contrasting school. This takes place in a diverse, secular school and enables trainees to teach children from a variety of cultures and backgrounds. \r\nIn each school placement, trainees build up gradually their teaching and are supported by experienced mentors in school. They are also visited regularly by their own LSJS Professional Tutor who is responsible for monitoring their progress during school experiences.\r\n","personalQualities":"","otherRequirements":"","status":1,"createdAt":"2021-10-05T08:49:53.668Z","updatedAt":"2021-10-05T08:50:14.113Z"}