{"id":"60b0c0ff-51fd-4801-b20b-9d6dd4800f2d","name":"Design and Technology (Food)","code":"3CPV","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"118fabd7-86d0-4a40-9e9a-e5c302abe59b","code":"DT","name":"Design and technology"}],"locations":[{"id":"47d5d27a-6c49-4990-8071-bdb64f842c90","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"6019b3ce-f2f6-4b0e-b2a9-5813d74c4d54","code":"W80","name":"University of Worcester"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"University of Worcester equivalency tests are available. Please contact [admissionsb@worc.ac.uk](mailto:admissionsb@worc.ac.uk) or visit [https://www.worcester.ac.uk/study/find-a-course/how-to-apply/equivalency-tests.aspx](https://www.worcester.ac.uk/study/find-a-course/how-to-apply/equivalency-tests.aspx) for further information.","courseLength":"OneYear","feesUK":9250,"feesInternational":14100,"feeDetails":"Every course has day-to-day costs for essential books, stationery, printing and photocopying.\r\n\r\nIf you are in receipt of a bursary, you would be responsible for your own travel costs.\r\n\r\nYou will need to buy some protective clothing to wear for practical work (apron, overall or chef’s jacket). You will also be expected to purchase materials and ingredients to make the products you will be teaching pupils to make.\r\n\r\nIn addition, we encourage you to join subject specific associations. The cost is typically between £25 to £50 for which you benefit from their support, guidance and resources.","aboutCourse":"The Design and Technology PGCE course aims to produce high-quality teachers who are enthusiastic, reflective, and able to engage pupils in this dynamic subject.\r\n\r\nThe course is designed to develop trainees’ subject knowledge, skills and understanding of food and the design and technology curriculum. We welcome applications from graduates with subject-related degrees, but also consider applicants who have significant experience in the food industry and have graduated in another field. It is recognised that trainees undertaking the course will have different backgrounds; this diversity of experience enriches the course, as from the outset trainees are encouraged to collaborate and share their expertise. The spirit of collaboration is central to the ethos of the course and supports trainees to develop their practice.\r\n\r\nDuring the course, trainees are encouraged to explore a range of strategies for teaching within their specialist areas of design and technology (food) and food preparation and nutrition. There will also be opportunities during school placements for trainees to gain experience in other material and curriculum areas to enhance their employability.\r\n\r\nThe overall aim of the course is to equip trainees to meet the professional expectations of their early years in teaching and to give them a firm grounding for future professional development.\r\n\r\nBy the end of the course trainees will:\r\n\r\n* understand the nature of the subject in schools and have developed confidence and expertise in teaching design and technology and food preparation and nutrition.\r\n* have developed an understanding of recent curricular developments in the subject.\r\n* have developed an understanding of the latest examination specifications and expertise in planning and delivering lessons that meet these.\r\n* have developed practical classroom management skills; including the selection, development and use of a wide variety of resources and teaching strategies and addressing the significant health and safety issues that arise when teaching a practical subject.\r\n* know how to assess the subject and ensure that pupils are able to make progress, as well as knowing how to record and report on this progress.\r\n* know how to respond to pupils’ individual needs and develop a critical awareness of their own performance based upon evidence gained from a variety of sources.\r\n\r\nA design and technology (food) subject knowledge enhancement course is available prior to the commencement of the course.\r\n\r\nVisit our website to find out more: [https://www.worcester.ac.uk/courses/pgce-secondary-design-and-technology-food](https://www.worcester.ac.uk/courses/pgce-secondary-design-and-technology-food)\r\n\r\nYou will be trained to teach 11-16 with post 16 enhancement.","interviewProcess":"The selection process:\r\n\r\nTrainees are recruited through a rigorous selection process. The team consider the personal statement and reference to decide whether to offer an interview.\r\n\r\nAt interview, you will be asked to complete:\r\n\r\n* A timed written task based on Design and Technology (Food) subject knowledge\r\n* A short presentation (details sent out with the interview invite)\r\n* A group task\r\n* An interview with two people usually a university tutor and a mentor from school\r\n\r\nCurrently interviews are conducted online and will not include a group task.\r\n\r\nReferences:\r\nFor your application, you will need two references which are submitted online.","howSchoolPlacementsWork":"We work with a range of school through the West Midlands region. The school you are placed in will be within commuting distance. The University will select your placement schools.\r\n\r\nThe course is designed with periods in University. University sessions are split between subject sessions and professional study sessions. Sessions also give you the opportunity to reflect on your future development. Former trainees have made positive comments on the balance between time in university and school, the carefully structured sessions, tutors’ commitment to supporting trainees and trainees supporting each other including sharing good practice.\r\n\r\nIn each school you will be supported by a Professional Mentor, as well as your Subject Mentor. Their job is to see that you get as much out of your teaching placements as possible and provide you with support and guidance. At interview you may meet teachers from our partnership schools as they take part in the selection process alongside University tutors.","personalQualities":"We are looking for trainee teachers who are:\r\n\r\n* Resilient, supportive professionals with strong values and high standards of personal conduct.\r\n* Effective communicators who collaborate to support wider educational opportunities.\r\n* Ambitious participants who are creative and informed intellectuals and promote a love of learning.\r\n* Confident and critically reflective practitioners motivated to continuingly improve practice.\r\n* Highly-skilled and inspirational subject/phase specialists committed to ensuring the safety, well-being and educational progress of all learners.\r\n\r\nSchool experience is desirable, but not essential. At interview we will discuss relevant experience and any opportunities you have had to work with school-aged children.","otherRequirements":"Health and Physical Capacity to Teach:\r\nThe DfE requires all trainees to satisfactorily complete a medical questionnaire to demonstrate their fitness to teach. People with disabilities or chronic illnesses may have the capacity to teach, just as those without disabilities or medical conditions may be unsuitable to teach.\r\n\r\nDBS:\r\nAll entrants to ITE programmes will be subject to appropriate pre-selection checks, including an enhanced DBS (Disclosure and Barring Service), criminal records checks and children’s barred list information.","status":1,"createdAt":"2021-07-06T10:49:48.917Z","updatedAt":"2021-09-13T10:03:35.938Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
