{"id":"9a1343d6-ab38-42a2-bc09-a9ed9ae8e53b","name":"Geography","code":"3CPW","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3f47e67b-7fa5-4947-a5a0-74d528cd2a87","code":"F8","name":"Geography"}],"locations":[{"id":"47d5d27a-6c49-4990-8071-bdb64f842c90","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"6019b3ce-f2f6-4b0e-b2a9-5813d74c4d54","code":"W80","name":"University of Worcester"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"University of Worcester equivalency tests are available. Please contact [admissionsb@worc.ac.uk](mailto:admissionsb@worc.ac.uk) or visit [https://www.worcester.ac.uk/study/find-a-course/how-to-apply/equivalency-tests.aspx](https://www.worcester.ac.uk/study/find-a-course/how-to-apply/equivalency-tests.aspx) for further information.","courseLength":"OneYear","feesUK":9250,"feesInternational":14100,"feeDetails":"Every course has day-to-day costs for essential books, stationery, printing and photocopying.\r\n\r\nIf you are in receipt of a bursary, you would be responsible for your own travel costs.\r\n\r\nWe organise occasional visits to increase subject knowledge. Travel costs are at your own expense but we do encourage car sharing. In addition there is sometimes a fee but this is not normally more than £20 in total.\r\n\r\nIn addition, we encourage you to join subject specific associations. The cost is typically between £25 to £50 for which you benefit from their support, guidance and resources.","aboutCourse":"The PGCE course in Geography is an integrated programme of University and school-based work. The course is designed with periods in University to give you the opportunity to reflect on your development. \r\n\r\nUniversity sessions focus on a wide range of areas which include learning how to:\r\n\r\n* plan and deliver an engaging curriculum\r\n* embed education for sustainable development\r\n* manage young people’s behaviour constructively\r\n* encourage young people to carry on studying Geography beyond Key Stage 3 \r\n* make sure that the needs of the young people you work with are met\r\n\r\nYou will have the opportunity to enhance your learning outside the classroom and fieldwork skills, by designing and completing fieldwork with other trainees in a range of settings, including visits to Worcester Cathedral, the Lakeside Campus, Worcester City and Preston Montford FSC centre. You will experience the importance of geographical enquiry and develop resources to assist with your teaching.\r\n\r\nThe overall aim of the course is to equip you with the skills and knowledge to meet the demands of your teaching career. The course should ensure you are able to:\r\n\r\n* Understand the nature of the subject in professional terms\r\n* Develop confidence and expertise in the teaching of geography and education for sustainable development\r\n* Investigate and understand ‘Thinking Geographically’\r\n\r\nYou will gain an understanding of developments affecting the National Curriculum for Geography along with GCSE and A-level specifications. You will gain an awareness and understanding of pupils’ achievements and challenges. You will become familiar with the use of a range of assessment techniques.\r\n\r\nA geography subject development course is available to anyone who would benefit from updating their geographical knowledge. This would also be advantageous to anyone who has specialised in either Physical, Human or Environmental Geography.\r\n\r\nVisit our website to find out more: [https://www.worcester.ac.uk/courses/pgce-secondary-geography](https://www.worcester.ac.uk/courses/pgce-secondary-geography)\r\n\r\nAge range:\r\n\r\nYou will be trained to teach 11-16 with post 16 enhancement.\r\n\r\nCareer opportunities:\r\nAn integral part of the course is to support you in gaining a post as a teacher. Each year around 50% of our trainees gain employment in our partnership schools. Newly Qualified Teachers have one of the highest employment rates of all graduates and are very much in demand. Employment rates over the past 5 years have consistently been 95%+. At the end of the course we will support you in your transition from the PGCE year into your first teaching post, and beyond.","interviewProcess":"The selection process:\r\n\r\nTrainees are recruited through a rigorous selection process. The team consider the personal statement and reference to decide whether to offer an interview.\r\n\r\nAt interview, you will be asked to complete:\r\n\r\n* A timed written task based on Geography subject knowledge\r\n* A short presentation (details sent out with the interview invite)\r\n* A group task\r\n* An interview with two people, usually a university tutor and a mentor from school\r\n\r\nCurrently interviews are conducted online and will not include a group task.\r\n\r\nReferences:\r\nFor your application, you will need two references which are submitted online.\r\n","howSchoolPlacementsWork":"We work with a range of school through the West Midlands region. The school you are placed in will be within commuting distance. The University will select your placement schools.\r\n\r\nThe course is designed with periods in University. University sessions are split between subject sessions and professional study sessions. Sessions also give you the opportunity to reflect on your future development. Former trainees have made positive comments on the balance between time in university and school, the carefully structured sessions, tutors’ commitment to supporting trainees and trainees supporting each other including sharing good practice.\r\n\r\nIn each school you will be supported by a Professional Mentor, as well as your Subject Mentor. Their job is to see that you get as much out of your teaching placements as possible and provide you with support and guidance. At interview you may meet teachers from our partnership schools as they take part in the selection process alongside University tutors.","personalQualities":"We are looking for trainee teachers who are:\r\n\r\n* Resilient, supportive professionals with strong values and high standards of personal conduct.\r\n* Effective communicators who collaborate to support wider educational opportunities.\r\n* Ambitious participants who are creative and informed intellectuals and promote a love of learning.\r\n* Confident and critically reflective practitioners motivated to continuingly improve practice.\r\n* Highly-skilled and inspirational subject/phase specialists committed to ensuring the safety, well-being and educational progress of all learners.\r\n\r\nSchool experience is desirable, but not essential. At interview we will discuss relevant experience and any opportunities you have had to work with school-aged children.\r\n","otherRequirements":"Health and Physical Capacity to Teach:\r\nThe DfE requires all trainees to satisfactorily complete a medical questionnaire to demonstrate their fitness to teach. People with disabilities or chronic illnesses may have the capacity to teach, just as those without disabilities or medical conditions may be unsuitable to teach.\r\n\r\nDBS:\r\nAll entrants to ITE programmes will be subject to appropriate pre-selection checks, including an enhanced DBS (Disclosure and Barring Service), criminal records checks and children’s barred list information.","status":1,"createdAt":"2021-07-06T10:49:48.949Z","updatedAt":"2021-09-13T10:13:42.644Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
