{"id":"ba85b3c8-bb73-440f-929f-a9117106eec8","name":"Biology","code":"CX11","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"322cfc19-d51d-45db-91e3-bd7b4738470f","code":"C1","name":"Biology"}],"locations":[{"id":"47d5d27a-6c49-4990-8071-bdb64f842c90","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"6019b3ce-f2f6-4b0e-b2a9-5813d74c4d54","code":"W80","name":"University of Worcester"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"University of Worcester equivalency tests are available. Please contact [admissionsb@worc.ac.uk](mailto:admissionsb@worc.ac.uk) or visit [https://www.worcester.ac.uk/study/find-a-course/how-to-apply/equivalency-tests.aspx](https://www.worcester.ac.uk/study/find-a-course/how-to-apply/equivalency-tests.aspx) for further information.","courseLength":"OneYear","feesUK":9250,"feesInternational":14100,"feeDetails":"Every course has day-to-day costs for essential books, stationery, printing and photocopying.\r\n\r\nIf you are in receipt of a bursary, you would be responsible for your own travel costs.\r\n\r\nWe organise occasional visits to increase subject knowledge. Travel costs are at your own expense but we do encourage car sharing. In addition there is sometimes a fee but this is not normally more than £20 in total.\r\n\r\nIn addition, we encourage you to join subject specific associations. The cost is typically between £25 to £50 for which you benefit from their support, guidance and resources.\r\n","aboutCourse":"Are you passionate about Science? Do you want to inspire students in secondary schools?\r\n\r\nOur Science training courses culture a thought-provoking, constructive and positive environment with guaranteed support and commitment from our passionate subject specialist tutors. Not only will you receive specialist training within your discipline of Biology, but we will also help you to build confidence in teaching the sciences outside of your specialism at key stages 3 and 4. Trainees speak highly about the quality of our teacher training programme, the excellent partnership between the University and schools and the fantastic employment rates.\r\n\r\nOur passion for inspiring the next generation of scientists permeates throughout the whole course, with sessions that are predominantly practical and laboratory-based. We equip you with the skills you need to become an outstanding Science teacher, including behaviour management within the laboratory and ‘wow’ moments, followed by how to engage students in their learning.\r\n\r\nTrainees have access to national organisations such as the Association of Science Education, Royal Societies for Biology and Chemistry and the Institute of Physics.. The University of Worcester is the STEM Ambassador Hub for the West Midlands; this provides further enrichment opportunities which can help you to foster, encourage and enhance pupils’ interest in Science.\r\n\r\nA biology subject knowledge enhancement course is available to anyone who would benefit from updating their biology knowledge. This will be discussed with you at interview.\r\n\r\nVisit our website to find out more: [https://www.worcester.ac.uk/courses/pgce-secondary-science-biology](https://www.worcester.ac.uk/courses/pgce-secondary-science-biology)\r\n\r\nYou will be trained to teach 11-16 with post 16 enhancement.\r\n\r\nCareer opportunities: An integral part of the course is to support you in gaining a post as a teacher. Each year around 50% of our trainees gain employment in our partnership schools. Newly Qualified Teachers have one of the highest employment rates of all graduates and are very much in demand. Employment rates over the past 5 years have consistently been 95%+. At the end of the course we will support you in your transition from the PGCE year into your first teaching post, and beyond.\r\n\r\nAssessment: You will be assessed on your teaching practice and two academic assignments. One assignment requires you to generate some teaching resources that will help pupils to learn a particular topic and the second assignment will engage you in reviewing the teaching strategies that are effective in your subject.","interviewProcess":"The selection process: Trainees are recruited through a rigorous selection process. The team consider the personal statement and reference to decide whether to offer an interview.\r\nAt interview, you will be asked to complete:\r\n\r\n* A timed written task based on your Biology subject knowledge\r\n* A short presentation (details sent out with the interview invite)\r\n* A group task\r\n* An interview with two people, usually a university tutor and a mentor from school\r\n\r\nCurrently interviews are conducted online and will not include a group task.\r\n\r\nReferences: For your application, you will need two references which are submitted online.","howSchoolPlacementsWork":"We work with a range of school through the West Midlands region. The school you are placed in will be within commuting distance. The University will select your placement schools.\r\n\r\nThe course is designed with periods in University. University sessions are split between subject sessions and professional study sessions. Sessions also give you the opportunity to reflect on your future development. Former trainees have made positive comments on the balance between time in university and school, the carefully structured sessions, tutors’ commitment to supporting trainees and trainees supporting each other including sharing good practice.\r\n\r\nIn each school you will be supported by a Professional Mentor, as well as your Subject Mentor. Their job is to see that you get as much out of your teaching placements as possible and provide you with support and guidance. At interview you may meet teachers from our partnership schools as they take part in the selection process alongside University tutors.","personalQualities":"We are looking for trainee teachers who are:\r\n\r\n* Resilient, supportive professionals with strong values and high standards of personal conduct.\r\n* Effective communicators who collaborate to support wider educational opportunities.\r\n* Ambitious participants who are creative and informed intellectuals and promote a love of learning.\r\n* Confident and critically reflective practitioners motivated to continuingly improve practice.\r\n* Highly-skilled and inspirational subject/phase specialists committed to ensuring the safety, well-being and educational progress of all learners.\r\n\r\nSchool experience is desirable, but not essential. At interview we will discuss relevant experience and any opportunities you have had to work with school-aged children.","otherRequirements":"Health and Physical Capacity to Teach: The DfE requires all trainees to satisfactorily complete a medical questionnaire to demonstrate their fitness to teach. People with disabilities or chronic illnesses may have the capacity to teach, just as those without disabilities or medical conditions may be unsuitable to teach.\r\n\r\nDBS: All entrants to ITE programmes will be subject to appropriate pre-selection checks, including an enhanced DBS (Disclosure and Barring Service), criminal records checks and children’s barred list information.","status":1,"createdAt":"2021-07-06T10:49:49.094Z","updatedAt":"2021-09-13T09:29:59.014Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
