{"id":"c94c5f2e-6c60-46dd-b3f5-e64d2c3731d4","name":"Physical Education","code":"X9C6","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"74d64a54-5e34-4590-b6c7-528dd0cf26fe","code":"C6","name":"Physical education"}],"locations":[{"id":"47d5d27a-6c49-4990-8071-bdb64f842c90","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"6019b3ce-f2f6-4b0e-b2a9-5813d74c4d54","code":"W80","name":"University of Worcester"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"University of Worcester equivalency tests are available. Please contact [admissionsb@worc.ac.uk](mailto:admissionsb@worc.ac.uk) or visit [https://www.worcester.ac.uk/study/find-a-course/how-to-apply/equivalency-tests.aspx](https://www.worcester.ac.uk/study/find-a-course/how-to-apply/equivalency-tests.aspx) for further information.","courseLength":"OneYear","feesUK":9250,"feesInternational":14100,"feeDetails":"Every course has day-to-day costs for essential books, stationery, printing and photocopying.\r\n\r\nIf you are in receipt of a bursary, you would be responsible for your own travel costs.\r\n\r\nYou will be expected to purchase a University top that costs between £20 - £30.\r\n\r\nWe offer accredited courses during taught subject session times with a variable cost of between £50 - £75 for the year. There are many other nationally accredited courses available throughout the year with reduced costs that vary depending upon the course. These courses are optional and will depend on your developmental needs. We recommend that you undertake National Governing Body awards and accredited courses in order to increase your opportunities for employment.\r\n","aboutCourse":"Our PGCE in Secondary Physical Education is delivered with the highest expectations, informed by research, evidence and collaboration with many external partners.\r\n\r\nYou’ll be taught by energetic, innovative, and experienced tutors who bring a wealth of different experiences, expertise, and passions to the PE sessions. Our curriculum is carefully sequenced and considers what subject knowledge you’ll need to successfully teach PE – this builds cumulatively over the year through three phases and results in excellent outcomes.\r\n\r\nOn this course, we nurture your potential, not only in progressing towards a teaching qualification but in your confidence, competence, and ability to achieve a successful career.\r\n\r\nThere is an extensive programme of subject-specific University sessions together with teaching placements in schools with whom we have strong partnerships. This provision ensures teachers have a deep understanding of the complexities which surround education while being aware of the many ways to promote learning through PE. Trainees secure teaching posts having a breadth of subject knowledge and pedagogic experience which can be applied to motivate and engage young people. They feel prepared to respond to the diverse needs and life experiences of individuals and see themselves as part of the wider school community. On completion of the course, trainees are confident in engaging with colleagues and external organisations to develop pedagogy and drive educational change.\r\n\r\nExample of opportunities for enhancement within the course may include:\r\n\r\n* PE exclusive second subject enhancement activities.\r\n* Additional placements with specific focuses on EAL, SEND, ethnic minorities and post 16 teaching.\r\n* Further access to a wide range of coaching awards and qualifications at reduced costs. Additional time to complete these qualifications is offered.\r\n* A specific focus on Examination PE and classroom practice.\r\n* Job application and interview support.\r\n* Authentic, independent and innovative learning experiences.\r\n\r\nVisit our website to find out more: [https://www.worcester.ac.uk/courses/pgce-secondary-physical-education](https://www.worcester.ac.uk/courses/pgce-secondary-physical-education)\r\n\r\nAge range: You will be trained to teach 11-16 with post 16 enhancement.\r\n\r\nAssessment: You will be assessed on your teaching practice and two academic assignments. One assignment requires you to generate some teaching resources that will help pupils to learn a particular topic and the second assignment will engage you in reviewing the teaching strategies that are effective in your subject.","interviewProcess":"The selection process: Trainees are recruited through a rigorous selection process. The team consider the personal statement and reference to decide whether to offer an interview.\r\n\r\nAt interview, you will be asked to complete:\r\n\r\n* A timed written task based on Physical Education subject knowledge\r\n* A short presentation (details sent out with the interview invite)\r\n* A practical group task (currently interviews are conducted online and will not include a group task)\r\n* An interview with two people, usually a university tutor and a mentor from school\r\n\r\nReferences: For your application, you will need two references which are submitted online.","howSchoolPlacementsWork":"We work with a range of school through the West Midlands region. The school you are placed in will be within commuting distance. The University will select your placement schools.\r\n\r\nThe course is designed with periods in University. University sessions are split between subject sessions and professional study sessions. Sessions also give you the opportunity to reflect on your future development. Former trainees have made positive comments on the balance between time in university and school, the carefully structured sessions, tutors’ commitment to supporting trainees and trainees supporting each other including sharing good practice.\r\n\r\nIn each school you will be supported by a Professional Mentor, as well as your Subject Mentor. Their job is to see that you get as much out of your teaching placements as possible and provide you with support and guidance. At interview you may meet teachers from our partnership schools as they take part in the selection process alongside University tutors.","personalQualities":"We are looking for trainee teachers who are:\r\n\r\n* Resilient, supportive professionals with strong values and high standards of personal conduct.\r\n* Effective communicators who collaborate to support wider educational opportunities.\r\n* Ambitious participants who are creative and informed intellectuals and promote a love of learning.\r\n* Confident and critically reflective practitioners motivated to continuingly improve practice.\r\n* Highly-skilled and inspirational subject/phase specialists committed to ensuring the safety, well-being and educational progress of all learners.\r\n\r\nSchool experience is desirable, but not essential. At interview we will discuss relevant experience and any opportunities you have had to work with school-aged children.\r\n","otherRequirements":"Health and Physical Capacity to Teach: The DfE requires all trainees to satisfactorily complete a medical questionnaire to demonstrate their fitness to teach. People with disabilities or chronic illnesses may have the capacity to teach, just as those without disabilities or medical conditions may be unsuitable to teach.\r\n\r\nDBS: All entrants to ITE programmes will be subject to appropriate pre-selection checks, including an enhanced DBS (Disclosure and Barring Service), criminal records checks and children’s barred list information.","status":1,"createdAt":"2021-07-06T10:49:49.651Z","updatedAt":"2021-09-13T10:37:27.359Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
