{"id":"d47a89b2-9e31-4be0-be1b-2df7b2a0c1be","name":"Psychology","code":"C8X1","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"14_to_19","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"1878e739-30bb-4de9-841e-42dacfb1fa0c","code":"C8","name":"Psychology"}],"locations":[{"id":"47d5d27a-6c49-4990-8071-bdb64f842c90","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"6019b3ce-f2f6-4b0e-b2a9-5813d74c4d54","code":"W80","name":"University of Worcester"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"University of Worcester equivalency tests are available. Please contact [admissionsb@worc.ac.uk](mailto:admissionsb@worc.ac.uk) or visit [https://www.worcester.ac.uk/study/find-a-course/how-to-apply/equivalency-tests.aspx](https://www.worcester.ac.uk/study/find-a-course/how-to-apply/equivalency-tests.aspx) for further information.","courseLength":"OneYear","feesUK":9250,"feesInternational":14100,"feeDetails":"Every course has day-to-day costs for essential books, stationery, printing and photocopying.\r\n\r\nIf you are in receipt of a bursary, you would be responsible for your own travel costs.\r\n\r\nWe organise occasional visits to increase subject knowledge. Travel costs are at your own expense but we do encourage car sharing. In addition there is sometimes a fee but this is not normally more than £20 in total.\r\n\r\nIn addition, we encourage you to join subject specific associations. The cost is typically between £25 to £50 for which you benefit from their support, guidance and resources.","aboutCourse":"The aim of this Psychology PGCE is to train teachers who are:\r\n\r\n* dynamic, enthusiastic and well qualified teachers who are passionate about Psychology and have the skills to transfer their interest and enthusiasm to their pupils\r\n* Psychology teachers who strive to enable their pupils to demonstrate and appreciate the value of applying scientific principles to the understanding of human thought and behaviour\r\n* teachers who can take a Psychology examination specification and turn it into a curriculum that motivates and excites young people in the 14-19 range\r\n* teachers who can deliver activities which help students to develop skills, intellect and values, for example by focusing on thinking skills, on critical evaluation of sources and viewpoints, and on issues which pose moral dilemmas and require a judgment or a decision.\r\n* teachers have the confidence to allow space and time for the unexpected, so that topical events or local issues, significant news items or students’ personal activities can be used to motivate students and reinforce their learning\r\n* teachers who can respond to the diverse learning needs and life experiences of individual learners\r\n* teachers who will see themselves as part of the wider educational community and contribute to the development of the subject through engagement with colleagues and external organisations such as awarding bodies or teacher associations\r\n\r\nIn order to achieve these aims, trainees will be given opportunities within the taught component of their training to develop a range of skills which will enable them to become the very best teacher they can be. Trainees will leave the course with the knowledge of planning, teaching and assessing their pupils. They will be able to implement a range of strategies to manage behaviour in the classroom. They will be able to reflect on their own practice and identify future CPD needs.\r\n\r\nGood practice in school is modelled throughout subject sessions. To this end trainees have opportunities to refresh their memories about the issues in psychology through workshops and seminars where they plan mini lessons, starters and plenaries, and teach and assess each other using the principles of good teaching but in a safe environment. Trainees are then able to take their pedagogical and subject knowledge and apply it to their placement environment.\r\n\r\nVisit our website to find out more: [https://www.worcester.ac.uk/courses/pgce-secondary-psychology](https://www.worcester.ac.uk/courses/pgce-secondary-psychology)  \r\n\r\nAge range:\r\nYou will be trained to teach 14-19 year olds. ","interviewProcess":"The selection process: Trainees are recruited through a rigorous selection process. The team consider the personal statement and reference to decide whether to offer an interview.\r\n\r\nAt interview, you will be asked to complete:\r\n\r\n* A timed written task based on Psychology subject knowledge\r\n* A short presentation (details sent out with the interview invite)\r\n* A group task (currently interviews are conducted online and will not include a group task)\r\n* An interview with two people, usually a university tutor and a mentor from school\r\n\r\nReferences: For your application, you will need two references which are submitted online.","howSchoolPlacementsWork":"We work with a range of school through the West Midlands region. The school you are placed in will be within commuting distance. The University will select your placement schools.\r\n\r\nThe course is designed with periods in University. University sessions are split between subject sessions and professional study sessions. Sessions also give you the opportunity to reflect on your future development. Former trainees have made positive comments on the balance between time in university and school, the carefully structured sessions, tutors’ commitment to supporting trainees and trainees supporting each other including sharing good practice.\r\n\r\nIn each school you will be supported by a Professional Mentor, as well as your Subject Mentor. Their job is to see that you get as much out of your teaching placements as possible and provide you with support and guidance. At interview you may meet teachers from our partnership schools as they take part in the selection process alongside University tutors.","personalQualities":"We are looking for trainee teachers who are:\r\n\r\n* Resilient, supportive professionals with strong values and high standards of personal conduct.\r\n* Effective communicators who collaborate to support wider educational opportunities.\r\n* Ambitious participants who are creative and informed intellectuals and promote a love of learning.\r\n* Confident and critically reflective practitioners motivated to continuingly improve practice.\r\n* Highly-skilled and inspirational subject/phase specialists committed to ensuring the safety, well-being and educational progress of all learners.\r\n\r\nSchool experience is desirable, but not essential. At interview we will discuss relevant experience and any opportunities you have had to work with school-aged children.","otherRequirements":"Health and Physical Capacity to Teach: The DfE requires all trainees to satisfactorily complete a medical questionnaire to demonstrate their fitness to teach. People with disabilities or chronic illnesses may have the capacity to teach, just as those without disabilities or medical conditions may be unsuitable to teach.\r\n\r\nDBS: All entrants to ITE programmes will be subject to appropriate pre-selection checks, including an enhanced DBS (Disclosure and Barring Service), criminal records checks and children’s barred list information.\r\n","status":1,"createdAt":"2021-07-06T10:49:49.061Z","updatedAt":"2021-09-13T10:54:11.393Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
