{"id":"d9e8b6b9-d6ee-4f41-8b8b-62013affc7a4","name":"Primary Education (5-11)","code":"K297","qualification":"pgce_with_qts","startDate":"2023-01-01T00:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"HE","studyMode":"P","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"47d5d27a-6c49-4990-8071-bdb64f842c90","name":"Main Site","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"6019b3ce-f2f6-4b0e-b2a9-5813d74c4d54","code":"W80","name":"University of Worcester"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"University of Worcester equivalency tests are available. Please contact [admissionsb@worc.ac.uk](mailto:admissionsb@worc.ac.uk) or visit [https://www.worcester.ac.uk/study/find-a-course/how-to-apply/equivalency-tests.aspx](https://www.worcester.ac.uk/study/find-a-course/how-to-apply/equivalency-tests.aspx) for further information.","courseLength":"OneYear","feesUK":9250,"feesInternational":14100,"feeDetails":"Every course has day-to-day costs for essential books, stationery, printing and photocopying.\r\n\r\nTravel costs for placements vary depending on the location of schools and your mode of transport, sometimes these may be reclaimed depending on your individual circumstances.\r\n\r\nIf you have lived overseas for three months or more in the last five years a Certificate of Good Conduct from the country of residence will be required. More information and guidance on costs are available from the Home Office. You will also be subject to the usual prohibition list and criminal record checks.","aboutCourse":"The University of Worcester offers trainee teachers:\r\n\r\n* High-quality programmes and excellent innovative, research-informed teaching\r\n* 60 credits at Masters level\r\n* An internationally-respected route into a career in teaching\r\n* Personalised levels of academic and teaching support from University tutors and school mentors\r\n* Academic staff with excellent research/publication profiles\r\n* Support for newly-qualified teacher induction\r\n\r\nThe course offers:\r\n\r\n* School experience in different primary settings\r\n* Excellent preparation to teach all National Curriculum subjects\r\n* Opportunity to train as a teacher in the primary phase on a part time basis\r\n* A grounding in primary pedagogy across the whole curriculum\r\n* Research-informed teaching\r\n\r\nDuring the course, you will:\r\n\r\n* Apply theoretical and practical knowledge and understanding of how children learn and develop in classroom settings\r\n* Manage different patterns of organisation and styles of teaching to best support effective learning and provide equality of opportunity for all children\r\n* Develop an understanding of SEND through the application of inclusive teaching practices\r\n* Develop and demonstrate the knowledge, skills and teaching competence which will enable you to observe, plan, teach, organise and assess children’s progress and learning across the full primary range\r\n* Develop a clear framework for your own professional values and demonstrate a critical and reflective attitude towards your practice\r\n* Evaluate sequences of learning and their impact on pupil progress, linking it to current education research\r\n\r\nIndicative course structure (subject to adaptation):\r\n\r\n* The Developing Teacher: Covers a wide range of knowledge, skills and understanding required to be an effective, self-evaluating practitioner\r\n* The Learning Child: Covers learning theories, child development and subject pedagogies within the primary curriculum including English, mathematics, science and computing, art, design and technology, geography, history, languages, music, PE, RE and PSHE\r\n* Life In School: School Experience with 120-days minimum in school in line with current Department for Education guidance to achieve Qualified Teacher Status\r\n* Most weeks will be for three days with a mixture of school placement and university lectures.\r\n\r\nAssessment:\r\nIn addition to the module assignments and individual subject tasks, you demonstrate competency against the Teachers’ Standards during your school experience, all of which combine as components towards your final award.\r\n\r\nWe also offer Primary (3-7) (X124), Primary Mathematics Specialist (X00G), Primary (with Physical Education) (3DP6) and Primary School Direct (see [course page] (https://www.worcester.ac.uk/courses/pgce-school-direct-primary.aspx) ).\r\n","interviewProcess":"Trainees are recruited through a rigorous selection process that includes an initial check to ensure that all entry requirements are met. At interview, you may be asked to:\r\n\r\n* Complete tasks to establish subject knowledge in English and maths\r\n* Engage in observed professional discussions on a current educational topic\r\n* Engage in discussion with primary lecturers/school partners on a range of education-related questions\r\n* You will be encouraged to discuss current issues in primary and/or early years education, policy and practice\r\n\r\nApplicants invited for interview will receive a comprehensive interview pack with detailed information about the day. We want all our applicants to feel prepared and ready for the interview process.\r\n\r\nApplicants will be informed of the interview panel’s decision once all the necessary paperwork has been processed. Applicants can track their progress through the UCAS website.\r\n\r\nReferences: For your application, you will need two references.","howSchoolPlacementsWork":"We work with a range of school through the West Midlands region. The school you are placed in will be within commuting distance. The University will select your placement schools.\r\n\r\nThe course is designed with periods in University. University sessions are split between subject sessions and professional study sessions. Sessions also give you the opportunity to reflect on your future development. Former trainees have made positive comments on the balance between time in university and school, the carefully structured sessions, tutors’ commitment to supporting trainees and trainees supporting each other including sharing good practice.\r\n\r\nWe work very closely with our extensive range of partnership schools, to provide you with high quality, carefully chosen placements that, alongside your taught programme, prepare you for your first teaching post and Early Career Teacher (ECT) induction period.","personalQualities":"We are looking for trainee teachers who are:\r\n\r\n* Resilient, supportive professionals with strong values and high standards of personal conduct.\r\n* Effective communicators who collaborate to support wider educational opportunities.\r\n* Ambitious participants who are creative and informed intellectuals and promote a love of learning.\r\n* Confident and critically reflective practitioners motivated to continuingly improve practice.\r\n* Highly-skilled and inspirational subject/phase specialists committed to ensuring the safety, well-being and educational progress of all learners.","otherRequirements":"You will also be subject to the usual prohibition list and criminal record checks. In addition, the Regulatory Body requires all trainees to satisfactorily complete a medical questionnaire to demonstrate their fitness to teach. \r\n\r\nSchool experience is not essential prior to an interview but may support you in your decision to study this programme. \r\n","status":1,"createdAt":"2021-07-06T10:49:49.298Z","updatedAt":"2021-09-30T08:53:27.841Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
