{"id":"fccf6535-acf4-4fca-ba8e-8551acec11aa","name":"Primary","code":"2TQW","qualification":"qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_7","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"78bff606-69d5-4e54-a511-bef3f2256f53","name":"Bedgrove Infant School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"21cc212c-3fb3-441b-9eeb-ae77ae234ce5","code":"1YP","name":"Bedgrove Infant School"},"accreditedBody":{"id":"255c8ae2-bc9f-4e33-8b70-7492c9bf9615","code":"1WR","name":"Bourton Meadow Initial Teacher Training Centre"},"degreeGrade":"1","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":8750,"feeDetails":"In addition to the fees, you will also be required to cover the cost of a Disclosure and Barring Service (DBS) application (Approx.£60), which is a prerequisite for working in schools.\r\n\r\nAlso, immediately before starting the programme, you will be asked to sit a free, online diagnostic maths assessment through Elevate My Maths. If this assessment identifies any areas of fundamental maths skills requiring further subject knowledge development, you will be asked to complete an interactive module to enhance your skills in each of the required areas. Following this, you will then be able to complete a free summative test in order to demonstrate your proficiency in maths, prior to QTS. (There are 7 modules in total and the interactive modules cost £5 each. However, you will not need to complete all 7 modules - only the ones that require further study, as identified through the diagnostic assessment.)\r\n","aboutCourse":"This is a non-salaried primary specialist (3-7 years) course, leading to QTS. It prepares applicants to teach within the Early Years Foundation Stage as well as the full range of national curriculum subjects across Key Stage 1.\r\n\r\nThe vast majority of training takes place in schools. Each trainee will be given at least two placements across the partnership, during which they work closely alongside experienced teacher tutors who demonstrate outstanding practice and can provide daily coaching and support. More information about the school placements can be found below.\r\n\r\nIn addition to the school-based training, trainees attend weekly core training sessions at a range of venues and schools across the partnership. These usually take place on Fridays and provide a detailed programme, closely linked to the Teachers’ Standards, Early Years Foundation Stage and national curriculum, as well as covering areas such as safeguarding and e-safety.\r\n\r\nThese weekly sessions, along with post-session tasks enable trainees to develop a deeper understanding of key issues and pedagogical thinking by encouraging them to critically reflect on research in relation to their own classroom practice. They also provide an opportunity for trainees to compare notes with peers working in other schools and share experiences within a supportive environment.\r\n\r\nIn addition to the core (QTS) training, trainees on this course attend approximately 9 PGCE workshops with Oxford Brookes University (usually in Buckingham). On successful completion of three modules, trainees gain a PGCE with 60 Masters’ credits.\r\n\r\nTrainees are assessed against the Teachers’ Standards and their progress towards these standards is reviewed at regular intervals throughout the course. A wide range of evidence is used when making judgements such as observations, half termly reports, evidence bundles (collated by trainees on a half- termly basis), assignments and the trainees own reflections and self-evaluations.\r\n\r\nThe focus of all assessment activities is developmental -with the clear aim of helping trainees to further improve the quality of their teaching.\r\nA final assessment takes place in June and will consist of a paired observation, scrutiny of evidence against the Teachers’ Standards, a formal interview and a final report from the teacher tutor.\r\n\r\nA detailed and rigorous assessment procedure is in place, which is transparent, understood by all partners and consistently implemented. It has also been reviewed in line with the government’s workload initiative, ensuring that the collection of evidence is both meaningful and manageable.\r\n","interviewProcess":"It is our aim to recruit the highest quality applicants into the profession who have the capacity to become outstanding teachers.\r\nFor this reason we carry out a rigorous three-stage selection process.\r\n\r\nStage 1: An application sift is carried out by course leaders to check for minimum academic requirements as well as strong references.\r\n\r\nStage 2:  Under the current Covid-19 restrictions, all candidates who are invited for interview, will undertake this via video conferencing where they will take part in a range of activities including a presentation, interview, written tasks and planning a short teaching activity.\r\nThese tasks enable us to identify applicants who possess the desired characteristics and interpersonal skills.\r\n\r\nThe interview panel comprises the course leader, a member of the Bedgrove Infant School Senior Leadership team and sometimes a headteacher from the partnership.\r\n\r\nStage 3: Formal interview. \r\nThis interview lasts approximately 20 minutes and consists of a series of questions which enable the applicant to share more information about their previous experiences and to elaborate of the skills they bring to the profession.\r\n\r\nThroughout the whole selection process we look for evidence that the applicant has a thorough understanding of the roles and responsibilities of a class teacher and what this entails on a daily basis.\r\n\r\nFollowing a successful formal interview a conditional offer is made. This offer is conditional on the applicant obtaining any pending qualifications, an Enhanced DBS check and a ‘Fit to Teach’ health assessment.\r\n","howSchoolPlacementsWork":"Trainees will have two school placements during the course: a main placement and a second placement. They will work in these placement schools four days a week (Monday-Thursday), giving them approximately 140 days in school.\r\nMain placement: This is the school in which the trainee will spend two terms in an Early Years (nursery or reception) class. By remaining with this class for a large proportion of the year, trainees develop a secure understanding of pupils’ progress over time, how this is tracked and used to inform teaching.\r\nSecond placement: This takes place in the spring term and provides trainees with the opportunity to teach in a KS1 (year one or two) class and to experience a contrasting setting.\r\nEnhancement Visits: These visits are built into the core training programme so that trainees are given regular opportunity to spend time in different schools and settings, enabling them to focus on specific areas such as behaviour management and transition from pre-school to school as well as KS1 to KS2.\r\nThe aim of these placements and visits is to further enhance the training programme, equipping trainees with the knowledge, skills and understanding to teach in a wide range of contexts.\r\n\r\nBedgrove Infant School arranges all placements on behalf of trainees. \r\nFurther familiarisation days later in the autumn term, also provide trainees with an opportunity to spend time in their new school, prior to the placement commencing in January. This enables trainees to receive a thorough induction, form positive relationships with colleagues and pupils and familiarise themselves with planning, helping them to maximise their learning and progress during this vital phase of the training programme.\r\n","personalQualities":"We aim to recruit individuals who can:\r\n\r\n* demonstrate a passion for teaching and a genuine concern for children's welfare\r\n* demonstrate good subject knowledge and interest in early years education\r\n* show resilience and perseverance\r\n* be adaptable, creative and patient\r\n* work under pressure\r\n* proactively seek opportunities to enhance their training\r\n* communicate clearly and accurately in standard English\r\n* form positive relationships with colleagues\r\n* support the values, attitudes and ethos of our partnership schools\r\n* maintain a high standard of professionalism\r\n* reflect on their own practice and act upon advice\r\n","otherRequirements":"* Fit to Teach assessment\r\n* Enhanced DBS check\r\n* Prohibition check\r\n\r\nBefore starting the course we recommend that applicants gain a small amount of experience within a an Early Years or KS1 class. This will provide a small insight into the role of a teacher and may help to strengthen their performance at our selection day. However, this work experience is NOT a requirement and applications will still be considered from candidates without such experience.","status":1,"createdAt":"2021-07-06T10:48:44.199Z","updatedAt":"2021-10-04T08:46:35.169Z","canSponsorStudentVisa":"no","cycle":"2024"}
