{"id":"cfca468f-d792-42b6-bc8a-bbe269897f35","name":"Primary","code":"297K","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"3f19232c-bc21-420e-b19f-3743cf64ee8b","name":"Oasis Academy Warndon","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"f5823e44-faa4-4924-a880-226f0dfaaf67","code":"7K9","name":"Oasis Academy Warndon"},"accreditedBody":{"id":"0ab5238e-606a-4f42-9aea-90d321ad7dc8","code":"2B3","name":"Haybridge Alliance SCITT"},"profPost":"PG","degreeGrade":"1","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feeDetails":"Tuition fees are £9250 and you can apply for a loan to cover these fees and/or a means tested maintenance grant via the Student Loan Company. \r\n\r\n\r\n","financialSupport":"There are a range of bursaries and scholarships available and their value by phase, subject and degree classification can be found by visiting the Department of Education website:-\r\nhttps://getintoteaching.education.gov.uk/bursaries-and-funding   ","aboutCourse":"Our Primary programme is focussed on the study of teaching students between the ages of 5 and 11 years in all National Curriculum subjects, with particular emphasis on English, Mathematics, Science and ICT. You will learn the principles of curriculum design, planning and delivery, theories of learning and teaching pedagogy alongside developing practical insights and skills in the effective teaching and assessment of young children. \r\nYou will be offered a series of learning experiences linking different perspectives of primary teaching to the development of your professional skills and subject knowledge in the classroom. This will give you the opportunity to select a specialism.  You will teach and qualify for the 5 - 11 age range but will also experience short EYFS and KS3 placements as well.\r\nThe primary programme here at Oasis Academy Warndon will lead to Qualified Teacher Status (QTS) alongside a Postgraduate Certificate in Education (PGCE).  QTS is awarded by Haybridge Alliance SCITT and involves you gathering evidence against each of the Teacher Standards.  Trainees will spend a minimum of 120 days in school working towards the award of QTS.  The PGCE is awarded by Birmingham City University (BCU) and involves the completion of assignments that you will prepare throughout the course of the programme\r\n","interviewProcess":"During the day, we assess different skills via various tasks.  Skills assessed through individual tasks:\r\nTime management and organisation\r\nInteraction with students\r\nSubject Knowledge\r\nResilience and flexibility\r\nArticulacy\r\nCore Skills\r\nSkills are graded 1, 2, 3 or 4 with 1 being the highest.  Scores are examined as part of the decision process and used to identify areas where cadditional support may be required.\r\nFormal interview with Primary Lead Mentor\r\nTo evaluate applicants' rationale for wanting to become a teacher and suitability to carry out the role.\r\nSkills being assessed: resilience/flexibility/articulacy/core skills.\r\nTeaching Activity\r\nApplicants to prepare and deliver 30 minute activity on a specific topic with a group/ class of students.  This activity will evaluate applicants' ability to facilitate students' interaction with them and each other.\r\nSkills being assessed: time management/organisation/interaction with students/subject knowledge/resilience/flexibility/articulacy/core skills\r\nSubject knowledge interview\r\nFocuses on applicants' subject knowledge together with ability to engage and inspire.\r\nSkills being assessed: subject knowledge/articulacy\r\nPresentation \r\nTo undertake ten minute presentation with member of Senior Leadership Team on subject of “what makes an outstanding Teacher?”\r\nSkills being assessed: time management/organisation/articulacy/core skills.\r\nLesson observation\r\nApplicants' opportunity to observe a subject specific lesson and gain insightful knowledge about teaching techniques.\r\nSkills being assessed: interaction with students/articulacy.\r\nWritten Task\r\nBased upon lesson observation to assess applicants' literacy skills and ability to process, synthesise and evaluate information.\r\nSkills being assessed: time management/articulacy/core skills.\r\nMathematics Task \r\nTo assess applicants’ numeracy skills and ability to process, synthesise and evaluate information.\r\nSkills being assessed: time management/organisation/core skills\r\n","howSchoolPlacementsWork":"Trainees undertake two contrasting school placements in different schools and two different key stages along with the entitlement to experience in EYFS, a special school or behavioural unit and KS3.\r\nWe aim to place trainees no more than 30 minutes travelling distance from home.  Schools and mentors are carefully selected to match the trainee requirements.\r\nWe work with many schools across Worcestershire and the West Midlands and trainees have the opportunity to visit a wide and diverse range of settings.\r\n","personalQualities":"Teaching offers the chance to change other people's lives permanently for the better!\r\nAs a teacher you can help to develop somebody's subject knowledge and maybe even their mind and personality. \r\nTeaching is an incredibly rewarding thing to do and good teachers are needed everywhere! At Oasis Warndon we are looking for applicants who:\r\n1. Enjoy communicating their understanding to others.\r\n2. Have confidence.\r\n3. Have great organisational skills.\r\n4. Work effectively in groups and  teams.\r\n5. Motivate students to do their best.\r\n6. Empathise with students.\r\n7. Are able to give feedback.\r\n","otherRequirements":"Enhanced DBS clearance is required.\r\n","status":1,"createdAt":"2021-07-06T10:55:34.137Z","updatedAt":"2021-09-16T10:15:31.752Z","canSponsorStudentVisa":"no","cycle":"2024"}
