{"id":"52bf0957-27f0-43ac-97f4-7c65cc0b5ef9","name":"Physics","code":"F3X1","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"bf97cd0a-224c-43d3-a021-84143df13e8d","code":"F3","name":"Physics"}],"locations":[{"id":"cbc576be-f32a-46b1-8b1f-f38473108fcd","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"c6a3e493-f9eb-4285-9456-1558fb9b818e","code":"B60","name":"Bradford College"},"profPost":"PG","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"Your degree must be scientific in nature and reflect aspects of the relevant National Curriculum for either subject.","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9000,"aboutCourse":"Our aim is facilitate your transition from successful graduate to competent teacher.  In addition to being an academic course, the PGCE Secondary provides a professional qualification (QTS).  By the end of the course you should have achieved the Teachers’ Standards for Qualified Teacher Status (QTS) and be confident in teaching all aspects of the Secondary National Curriculum at the appropriate level.  You will become a reflective practitioner who will be able to improve continuously your own knowledge, understanding and skills.\r\n\r\nThe PGCE programme is 44 weeks long, commencing early September, with time divided between school placements and Bradford College.  The course prepares you to teach within the secondary age range of (11-16).\r\n\r\nYou will study all areas of the secondary curriculum and link practice to theory, completing 3 modules at Level 7.  Bradford College sessions are relevant, often practically-based, and address the subject knowledge, teaching techniques (pedagogy) and professional issues required to teach children accessing the Secondary National Curriculum.\r\n\r\nYou will also be required to attend a short field trip to improve your  subject knowledge and to demonstrate and practise the skills required to organise out of school visits.\r\n\r\nCollege sessions cover aspects such as planning and assessment, behaviour management, SEND, inclusion and safeguarding.  In addition to this, you have the support of subject specialist tutors, all of who have secondary teaching experience.\r\n\r\nFor the award of the PGCE you complete three assessed modules, each worth 20 Credit points at Masters Level.  These are:\r\n\r\n* Subject Specialist Pedagogy\r\n* Teaching Learning and Assessment\r\n* Educational Philosophy and Vision\r\n\r\nThe assessment of these modules comprises a range of strategies, including essays, academic posters and presentations.  The PGCE qualification is validated by the University of Bolton.\r\n\r\nBy the end of the course you will meet the required standards for newly qualified teachers (NQTs).  Your knowledge and understanding of teaching in Secondary schools will be secure.  You will be capable of planning, teaching and managing a class and your monitoring, assessment, recording and reporting skills will be well developed.  You will understand the issues of accountability and the many professional responsibilities required of a teacher.\r\n","interviewProcess":"The overall aim of the selection procedure is to explore your potential to be an excellent secondary teacher.\r\n\r\nInterviews are held as part of group sessions at which you will be asked to undertake a number of tasks: an interview, a presentation, a written task and a subject specialism audit.\r\n\r\nThere will be a group introduction at which you will be given a brief outline of the course and of your expected commitment in terms of attendance, professional behaviour and information about school placements.\r\n\r\n•         You will have an individual interview with tutor, lasting about 30 minutes, to assess your strengths, suitability for the course and for secondary teaching.\r\n\r\n•         You will be expected to talk about an object of your choice, relevant to your subject area, which you are asked to bring with you.\r\n\r\n•         The written task is a short comprehension task in Standard English, lasting 30 minutes, to evaluate your ability to communicate in writing. \r\n \r\n•         A subject specific audit will be completed to ascertain areas of strength and areas for development.\r\n\r\nThe interview sessions take approximately 4 hours in total.  Further information will be provided if you are selected for interview.\r\n\r\n","howSchoolPlacementsWork":"School experience is a vital part of your teacher training programme.  A key strength of the PGCE course is how theory and practice are related by working with children in two placement schools – at least 120 days are school-based with support provided by experienced school mentors and College link tutors.\r\n\r\nYou will experience two contrasting placements, the first starting in the autumn term and the second starting in the spring term.  The remainder of the time will be spent in Bradford College and or in other educational settings.\r\n\r\nYour placements will be arranged for you.  Every effort is made to ensure that the most appropriate placements are chosen for each trainee to enhance their professional development.  We have strong partnership links with local schools, whose staff make a significant contribution to your training.  Partnership schools are situated in Bradford and the neighbouring LEAs to give a wide range of experience and to meet the needs of students from across the region.\r\n\r\nEach placement begins with a pattern of serial days including periods of observation, work with small groups of children and the completion of school-based tasks.  Serial days lead to blocks of teaching practice with whole classes.\r\n\r\nProgress towards achieving Qualified Teacher Status (QTS) is assessed using the Teachers’ Standards (DfE 2013) whilst in placement.  You will need to accumulate and record evidence in your Individual Development Profile (IDP) to demonstrate, by the end of the course, that you have met all of the Teachers’ Standards and criteria in order that the College may recommend you for QTS.\r\n","personalQualities":"Passion to work in a challenging and rewarding career \r\nGood literacy and numeracy skills, with the ability to communicate clearly and accurately in spoken and written Standard English\r\nKnowledge of the three science subjects - although specialising in one subject (Biology, Chemistry or Physics) at 'A' level, trainees are expected to be able to teach all three subjects to GCSE standard.\r\nTime management skills\r\nPotential to work as a team member \r\nAwareness of contemporary education issues\r\nAwareness of multicultural issues in education\r\n","otherRequirements":"A satisfactory new DBS Disclosure will be required for the start of the course, which must be applied for through Bradford College.\r\n\r\nA health check is required before commencing on the course.\r\n","status":1,"createdAt":"2021-07-06T10:56:39.263Z","updatedAt":"2021-08-23T21:08:31.453Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
