{"id":"642790b3-690d-4937-b4f8-ecf0eab580c7","name":"Education and Training","code":"X341","qualification":"pgde","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"B","subjectLevel":"further_education","isSend":"no","subjects":[{"id":"9de4b2d2-5739-4c34-92d2-9b4384760298","code":"41","name":"Further education"}],"locations":[{"id":"cbc576be-f32a-46b1-8b1f-f38473108fcd","name":"Main Site","isPublished":"Y","status":"R","vacancies":"B"}],"trainingProvider":{"id":"c6a3e493-f9eb-4285-9456-1558fb9b818e","code":"B60","name":"Bradford College"},"profPost":"PG","degreeGrade":"9","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"Applicants will need an honours degree. In some subject specialisms you will be required to have at least a Level 3 qualification. A GCSE/ Level 2 qualification in English. A GCSE/Level 2 mathematics qualification is desirable but this can be achieved alongside the course.\n\nIn-service: you must have appropriate paid teaching or training, full-time or part-time, as your main role in the post secondary sector for 100 hours over two years, and a mentor to support you in your role.\n\nA satisfactory DBS (Disclosure and Barring Service) check is required for this course.","english":"9","maths":"9","science":"9","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"no","courseLength":"OneYear","feesUK":8750,"aboutCourse":"Postgraduate Diploma in Education and Training (Level 7) Full time. \r\n\r\nThis course meets the qualification requirements for QTLS (Qualified Teacher, Learning and Skills) status and is 120 Credits at Level 7. Those who wish to teach Literacy, ESOL, and Numeracy can also achieve a Specialist Diploma in their subject.\r\n\r\nYou will be able to gain QTLS (Qualified Teacher, Learning and Skills) status once you have passed your PG Dip. This is awarded by the Society for Education and Training (SET).\r\n\r\nThis professional course is for those who wish to teach 14-19 year olds and adults in Further and Higher education settings. You will undertake academic modules to provide you with the knowledge and skills required and work alongside a mentor and other colleagues to develop as a highly skilled professional.\r\n\r\nCourse Structure:\r\nThe full-time route starts with an intensive month long block of study after which you will normally be expected to attend formal taught sessions on one or two evenings per week. You will also need to be available for at least three days per week for teaching practice. This course is offered with the following pathways:\r\n\r\nWith ESOL\r\nWith Literacy\r\nWith Numeracy.\r\n\r\nModules Covered:\r\nTeaching, Learning and Assessment\r\nTheories that Underpin Teaching and Learning\r\nSubject Specialist Pedagogy*\r\nResearching Teaching*\r\nDesigning and Developing Curriculum\r\nDeveloping Professional Practice.\r\n\r\nIf you are taking a specialism in ESOL, Literacy or Numeracy you will study two specialist modules instead of the starred modules.\r\n","interviewProcess":"The overall aim of the selection procedure is to explore your potential to be an excellent teacher.\r\n\r\nInterviews are held as part of group sessions at which you will be asked to undertake a number of tasks: an interview, a micro-teach and a written task.\r\n\r\nThere will be a group introduction at which you will be given a brief outline of the course and of your expected commitment in terms of attendance, professional behaviour and information about school placements.\r\n\r\n• You will have an individual interview with a tutor, lasting about 30 minutes, to assess your strengths, suitability for the course and for teaching.\r\n• Your micro-teach will be to a tutor and a small group of other candidates. You are asked to bring an object and to teach for 4 to 5 minutes, telling us how and why you would use your object to stimulate learning. You should cover how you would use the resource to support learning and teaching, and what learning outcomes you might expect. We want to see how you will actively engage the learner.\r\n• The written task is a short comprehension task in Standard English to evaluate your ability to communicate in writing.\r\n","howSchoolPlacementsWork":"Placement will vary according to your chosen specialist subject. You will have the opportunity to work alongside experienced lecturers, and you will also have a mentor who will provide you with advice and support. Placements will be negotiated with the placement employer, but you would normally be expected to be available for up to three days per week for teaching practice, in addition to your academic study time. Offers will only be made if a suitable placement can be found.","personalQualities":"• A passion to work in a challenging and rewarding career\r\n• A desire and ability to develop your skills\r\n• Potential to work as a team member\r\n• Good literacy and numeracy skills, with the ability to communicate  \r\n   clearly and accurately in spoken and written Standard English\r\n• ICT competence\r\n• Knowledge of national curriculum subjects\r\n• Awareness of contemporary education issues\r\n","otherRequirements":"A satisfactory DBS (Disclosure and Barring Service) check is required for this course.\r\n\r\nA health check is required before commencing on the course.\r\n\r\nWe have Post-secondary Education and Training (PSET) courses available as pre-service or in-service, full or part-time options, leading to the award of Qualified Teacher Learning and Skills.   If you wish to apply for this course on a part time basis then contact the college direct at:\r\nheadmissions@bradfordcollege.ac.uk \r\n\r\n","status":1,"createdAt":"2021-07-06T10:56:39.466Z","updatedAt":"2021-08-23T21:01:31.106Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
