{"id":"00b34f74-4eac-4f77-84ce-245314f364f9","name":"Primary","code":"36QT","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"B","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"4beca62b-27d0-47b0-aa65-b05ede7c5c37","name":"Main Site","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"824ca597-a0d4-48f5-a7f9-241e05cc31bf","code":"1TP","name":"Claremont Primary School"},"accreditedBody":{"id":"2b8fac2f-ed98-4278-a7fc-fa3f418dfbef","code":"2EZ","name":"Teach Kent & Sussex"},"profPost":"BO","degreeGrade":"1","english":"1","maths":"1","science":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"Equivalency:\n\ni) The Administration Manager will review the Department of Education equivalency tables in order to ascertain an initial equivalence of overseas qualifications.  A NARIC comparability statement would be required by successful applicants which they are responsible for obtaining.\n\nii) If a potential trainee is deemed to have the relevant understanding and knowledge, but does not hold a GCSE qualification (or NARIC recognised equivalent) in either maths, English or science the trainee will undergo equivalency testing as specified by the SCITT strategic director.\n\nGiven the complexity of the overseas qualification process we will provide advice and support for potential applicants to support a prompt and accurate assessment of their situation, for equivalency issues related to both qualifications for entry and for financial support.","courseLength":"TwoYears","feesUK":null,"aboutCourse":"Over the course of an academic year, student teachers will train on the job in classrooms, from day one. Training in school is supported and enhanced by academic study and independent research. \r\n\r\nTrainees going through the salaried route are expected to take on a greater amount of solo teaching much earlier, and will need to be willing and able to teach lessons within the first fortnight of the academic year. Expectations of salaried trainees are also higher, and as a result, a significant amount of relevant experience is required. \r\n\r\nTrainees will spend four and a half days in school carrying out a range of professional activities. The remaining half day a week will be for professional development through weekly training sessions, facilitated by [Teach Kent and Sussex](https://www.teachkentandsussex.org.uk/about-teach-kent-sussex/) at Bennett Memorial Diocesan School, Tunbridge Wells. These sessions will cover the full range of pedagogy required to teach in a primary setting. [Click here](https://www.teachkentandsussex.org.uk/centre-based-training/) for more information.\r\n\r\nAll Trainees will be based in a class in their assigned school for the entire year, except during a six-week second school placement (which occurs halfway through the year). Trainees will be fully throughout the year by an assigned Mentor, an experienced teacher who will themselves be trained and supported by Teach Kent and Sussex. Trainees will benefit from weekly meetings, regular observations with constructive feedback, planning guidance and on-the-job advice, all provided by their Mentor.  [Click here](https://www.teachkentandsussex.org.uk/school-based-training/) for more information.\r\n\r\nTrainees will be regularly assessed against the Teaching Standards through a combination of informal and formal observations. All Trainees will need to be observed teaching in four separate year groups. They are also required to gather evidence in support of the Teaching Standards, which will inform three formal assessments at the end of each long term. Those who select the PGCE route will also be required to complete university assignments. \r\n\r\nTrainees have the opportunity to select from either a QTS or PGCE with QTS route. The PGCE route is the more academic option and essential if trainees wish to teach abroad. We offer this through the [University of Sussex](http://www.sussex.ac.uk/education/ite/pgcepp). [Click here](https://www.teachkentandsussex.org.uk/qts-pgce/) to find out more.\r\n\r\nWe offer the course full time (over one academic year) and part time (over two academic  years). \r\n\r\nPlease feel free to contact us at [traintoteach](mailto:traintoteach@claremont.kent.sch.uk) if you would like to discuss either the PGCE component or part time option.","interviewProcess":"Once an application is live on UCAS, it will be assessed for suitability. If an applicant is considered suitable, they will be invited to interview by Senior Mentor or senior member of staff within the partnership.\r\n\r\nAs part of our selection process you will need to:\r\n* Give a short presentation about how you have helped a small group of children or adults learn something (instructions will be given in advance).\r\n* Engage in a Reading Aloud task (instructions will be given in advance).\r\n* Participate in two informal discussions - one about the course and the other about the primary curriculum (no preparation is required in advance for the former and instructions will be given in advance for the latter)\r\n* Participate in a formal interview, during which you will be asked about why you wish to teach, and how you can show you have the capacity and personal characteristics to do so. \r\n* Complete a written task and a short Maths test (for which no preparation is required).\r\n* Complete our safe recruitment checklist and provide appropriate certificates (e.g. your degree certificate).","howSchoolPlacementsWork":"The candidate's school will be carefully selected in order to meet the needs of both the candidate and the schools within the network. All schools used for teacher training have been graded Good by Ofsted, and many are Outstanding. All schools used are within Tunbridge Wells or the surrounding area.\r\n\r\nTrainees will have one placement at their base school (which will cover the teaching of three year groups) and one short term placement (lasting about six weeks) in a contrasting school. All trainees are required to gain experience and be assessed in four year groups and both primary key stages.\r\n\r\nPart-Time Course Arrangements:\r\nThe part-time course has a more flexible approach to school placements. For the duration of the two year course, trainees will spend the equivalent of two days within their placement school. This could be four half days, two full days or a combination of both full and half days. Preferences will be explored as part of the interview process, and the pattern ultimatly agreed with the main placement school. The contrasting placement will take place over two short terms on the part-time course.\r\n\r\nAdditionally, part-time trainees will be required to attend Professional Development sessions every Wednesday afternoon for the entire duration of the course. During the first year this focuses on teaching pedagogy, skills and current aspects of education, followed by the PGCE sessions in year two. The Wednesday afternoon sessions are immovable and a flexible approach cannot be taken with them. Therefore all candidates interested in the part-time course must be available on a Wednesday afternoon for the full two years.\r\n\r\nTrainees will also need to attend twilight subject tutor sessions during the two years. These typically take place twice a short term and might involve trainees attending the sessions on a day they would not normally be at their placement school. \r\n\r\nPlease contact us at [traintoteach](mailto:traintoteach@claremont.kent.sch.uk) if you would like to further discuss the arrangements for the part-time course. ","personalQualities":"We are looking for people who are ambitious, determined and willing to work hard to make a difference to the lives of young people. You will need to be prepared to go the extra mile to secure academic progress for every child whilst playing a role in shaping their resilience and character. You will need to be committed to sharing our vision that great teaching transforms the life opportunities of all students.","otherRequirements":"Teach Kent & Sussex and our partner schools are committed to safeguarding and promoting the welfare of children. Offers to train with us are made on condition of:\r\n* Satisfactory Enhanced Disclosure and Barring Service (DBS) or equivalent\r\n* Satisfactory clearance of Prohibited Teachers check and Children’s Barred checklist\r\n* Satisfactory pre-employment health clearance\r\n* Berification of identity and entitlement to work in the UK\r\n* Receipt of two satisfactory references.\r\n\r\nWe cannot offer a salaried place without a candidate having already secured a salaried position in a school. Please contact us at [traintoteach](mailto:traintoteach@claremont.kent.sch.uk) before applying to discuss your options.","status":1,"createdAt":"2021-07-06T10:55:19.379Z","updatedAt":"2021-10-04T18:28:36.407Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"The salary for the year of employment is as an Unqualified Teacher, which currently starts at £18,169 (in 2020/21).\r\n\r\nFor trainees going through the salaried QTS only route, there are no tuition fees. For trainees going through the salaried PGCE with QTS route, there are fees in the region of £2,340  to cover the course costs with the University of Sussex (our accredited PGCE provider). \r\n\r\nPlease be aware that we cannot offer a salaried place without a candidate having already secured a salaried position in a school within Tunbridge Wells or the surrounding area. Please contact us at [traintoteach](mailto:traintoteach@claremont.kent.sch.uk) before applying to discuss your options."}
