{"id":"09bdc49d-8db4-401b-a148-6b789a1c5ed3","name":"Primary","code":"X100","qualification":"pgce_with_qts","startDate":"2024-07-31T23:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"5c10fb00-249f-4da9-b36e-1ac44ccbf3de","name":"Main Site","isPublished":"N","status":"S","vacancies":"F"},{"id":"8ef0215e-03a2-4d27-ae34-f010ee021527","name":"Clifton Campus","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"d2b7d074-fac9-42c5-a0d3-d5471b35f7d9","code":"N91","name":"Nottingham Trent University"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We accept the GCSE equivalency taken via equivalencytesting.com or astarequivalency.co.uk.","courseLength":"OneYear","feesUK":9250,"feesInternational":15200,"feeDetails":"Tuition fees for 2022 entry are yet to be confirmed. As a guide and to enable you to plan your finances, the fees for Home undergraduate students for 2021 are £9250. The current expectation is that the University may increase this for future and subsequent years of study in line with inflation and as specified by the Government","aboutCourse":"The PGCE in Primary Education aims to enable you to become a confident and competent Primary Teacher who can enable children to learn effectively across the whole curriculum. \r\n  \r\nThe course also develops your understanding of the demands of the National Curriculum, the Curriculum for the Foundation Stage and other Government initiatives. This PGCE will train you to teach children aged 3-11. You will choose to specialise in either the 3-7 or the 5-11 age ranges. \r\nIt provides training in all primary stage National Curriculum subjects, with a particular focus on mathematics, English and science. Successful completion of this PGCE leads to qualified teacher status (QTS). After this you will need to complete an induction period as a newly qualified teacher (NQT) through a three-term period of assessment in a single school, which will help to ensure that your teaching career is built on a firm foundation. \r\n  \r\nThe award of PGCE is offered at two levels: \r\n• Professional Graduate Certificate in Education; and \r\n• Postgraduate Certificate in Education, where 60 Masters-level credits can be gained. \r\n \r\nBoth of these are internationally recognised teaching qualifications, with the Postgraduate Certificate also allowing fast-track entry onto a Masters course. \r\n\r\n","interviewProcess":"Interviews will be completed online. The process will be led by an experienced interviewer and will consist of individual and collaborative elements. \r\n\r\nCollaborative task \r\n\r\nYou will work in a pair or a three, collaborating on a task relating to classroom practice. This will assess your understanding of issues relating to teaching and learning, as well as evaluating your capabilities for collaborative work \r\n\r\nWritten task \r\n\r\nYou will complete a piece of writing to a set title, drawing on a piece of research that you will have been asked to complete pre-interview. This will be used to evaluate your ability to write in clear and accurate Standard English, and also to gain insight into your academic writing capabilities. \r\n\r\nIndividual interview \r\n\r\nYou will have an individual interview lasting around 30 minutes which will explore your understanding of and opinions on aspects of the teaching profession and the practice of Primary classroom teachers. \r\n","howSchoolPlacementsWork":"Approximately two-thirds of your course time will be spent in primary schools. There are three main periods of school-based training: an initial two-week placement  during the autumn term, followed by two major block placements; a 12-week period starting in the autumn term and concluding in the summer term, and a 7-week period during the spring term. There are also 3 weeks of additional enhancement placements across the year, which will broaden your experience and support your ability to meet a range of children’s needs. \r\n\r\nWe are in partnership with a wide range of schools, so your placements may be in city centre, suburban or semi-rural locations. Over the course of the year you should therefore experience schools in a range of locations and serving varying demographics and needs. This variety provides opportunities for a wide range of teaching experiences and lays a good foundation for your future professional development. \r\n","personalQualities":"","otherRequirements":"You'll need to undergo a Disclosure and Barring Service check, a Prohibition Order check and complete a Fit to Practice (FTP) questionnaire before you start the course.\r\n\r\nWhat is an FTP?\r\nThe health questionnaire is part of the Fitness to Practice process that you are required to undertake, prior to you commencing an Initial Teacher Training course. Once you are Unconditional Firm with NTU, the QMC will email you a link to an online questionnaire. Once completed, the nurses at the QMC will carry out their assessment. This process is confidential.\r\n\r\n\r\n","status":1,"createdAt":"2021-07-06T10:55:19.143Z","updatedAt":"2021-10-04T15:55:02.745Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
