{"id":"2eb87b82-8775-49c1-94d2-5f2f1525f52b","name":"Business Studies","code":"N1X1","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"de6477b2-6027-48e6-b9f7-3206774705c2","code":"08","name":"Business studies"}],"locations":[{"id":"5c10fb00-249f-4da9-b36e-1ac44ccbf3de","name":"Main Site","isPublished":"N","status":"S","vacancies":"F"},{"id":"8ef0215e-03a2-4d27-ae34-f010ee021527","name":"Clifton Campus","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"d2b7d074-fac9-42c5-a0d3-d5471b35f7d9","code":"N91","name":"Nottingham Trent University"},"profPost":"BO","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"Your degree should contain at least 50% of which is in the subject you wish to teach or in a closely related subject. In exceptional circumstances applicants may be considered who do not have a strong degree match, but who have other relevant qualifications, including an A-level in the subject and extensive professional experience.","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We accept the GCSE equivalency taken via equivalencytesting.com or astarequivalency.co.uk.","courseLength":"OneYear","feesUK":9250,"feesInternational":15200,"feeDetails":"Tuition fees for 2022 entry are yet to be confirmed. As a guide and to enable you to plan your finances, the fees for Home undergraduate students for 2021 are £9250. The current expectation is that the University may increase this for future and subsequent years of study in line with inflation and as specified by the Government","aboutCourse":"This highly practical course enables you to gain the skills, knowledge, understanding and experience needed to build on a degree and teach at secondary level. The course will equip you to respond effectively to the issues currently affecting schools. We place a strong emphasis on developing your individual strengths and skills within the context of the contemporary education environment. \r\n\r\nThe award of PGCE is offered at two levels: \r\n\r\n*Professional Graduate Certificate in Education; and \r\n\r\n*Postgraduate Certificate in Education, where 60 Masters-level credits can be gained. \r\n\r\nBoth of these are recognised teaching qualifications but the postgraduate award will allow fast-track entry onto a Masters course.  Successful completion of the PGCE leads to Qualified Teacher Status. \r\n\r\nThe majority of your time will be spent on placement in schools or colleges. This practical teaching is supported by both face to face and online University lectures, seminars, workshops and tutorials exploring learning and teaching in your subject and in the wider context. Trainees also engage in an independent research project that draws together academic and professional practice. \r\n\r\nThe PGCE in Business Studies prepares students to teach across the 14 to 19 age range, helping them to develop the professional skills and attitudes to teach business in schools and colleges, as part of both academic (A level and GCSE) and BTEC courses. \r\n\r\nStudents will understand how business is taught in schools, how pupils learn and make sense of the evolving nature of business. The course reflects the range of business related courses that are now offered by schools, sixth forms and colleges, with the focus in some instances on entrepreneurship, work skills and new business technologies.","interviewProcess":"Before the interview, you will be asked to complete two tasks. The first is to plan a KS4 lesson on a pre-determined topic. The second task will be to complete a business subject knowledge audit. Both of these tasks need to be sent back to the university prior to your interview. \r\n\r\nThe interview day... what to expect:\r\n\r\nWritten task\r\nYou will complete an English test of your reading and writing ability so we can ensure that you have a good and accurate use of Standard English.\r\n \r\nIndividual interview\r\nYou will have an individual interview lasting around 15 to 30 minutes with at least one course tutor, and I’m some cases, by a senior teacher from one of our partnership schools or a current trainee on the PGCE business course. The interview will focus on your personal qualities and skills, your suitability for teaching, your experience of working with young children in school settings and your current studies or employment.\r\n \r\nYou will also be required to do other tasks during your interview, such as a presentation based on an aspect relating to the teaching of your subject area.\r\n","howSchoolPlacementsWork":"This may be subject to change during the Covid-19 pandemic. \r\n\r\nSchool or college experience is central to the Secondary PGCE at NTU. It is usual to spend a minimum of 24 weeks on placement in at least two secondary schools or colleges. For both placements, training is planned by mentors to enable students to attain QTS. This practical teaching element is assessed on a regular basis via formal observation by a school mentor and a University tutor, enabling us to monitor each individual trainee’s progress and effectively support their development. We are in partnership with a wide range of schools so your placements may be in city centre, suburban or semi-rural locations. This variety provides opportunities for a wide range of teaching experiences and lays a good foundation for your future professional development. ","personalQualities":"","otherRequirements":"You'll need to undergo a Disclosure and Barring Service check, a Prohibition Order check and complete a Fit to Practice (FTP) questionnaire before you start the course.\r\n\r\nWhat is an FTP?\r\nThe health questionnaire is part of the Fitness to Practice process that you are required to undertake, prior to you commencing an Initial Teacher Training course. Once you are Unconditional Firm with NTU, the QMC will email you a link to an online questionnaire. Once completed, the nurses at the QMC will carry out their assessment. This process is confidential.","status":1,"createdAt":"2021-07-06T10:55:19.010Z","updatedAt":"2021-10-04T16:25:58.122Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
