{"id":"b7d370fa-2f31-4425-9896-54105704fd42","name":"Music","code":"W3X1","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"24311bef-8673-41fb-933c-53f887fb6976","code":"W3","name":"Music"}],"locations":[{"id":"8ef0215e-03a2-4d27-ae34-f010ee021527","name":"Clifton Campus","isPublished":"Y","status":"R","vacancies":"F"},{"id":"5c10fb00-249f-4da9-b36e-1ac44ccbf3de","name":"Main Site","isPublished":"N","status":"S","vacancies":"F"}],"trainingProvider":{"id":"d2b7d074-fac9-42c5-a0d3-d5471b35f7d9","code":"N91","name":"Nottingham Trent University"},"profPost":"BO","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"Your degree should contain at least 50% of which is in the subject you wish to teach or in a closely related subject. In exceptional circumstances applicants may be considered who do not have a strong degree match, but who have other relevant qualifications, including an A-level in the subject and extensive professional experience.","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We accept the GCSE equivalency taken via equivalencytesting.com or astarequivalency.co.uk.","courseLength":"OneYear","feesUK":9250,"feesInternational":15200,"aboutCourse":"This highly practical course enables you to gain the skills, knowledge, understanding and experience needed to build on a degree and teach at secondary level. The course will equip you to respond effectively to the issues currently affecting schools. We place a strong emphasis on developing your individual strengths and skills within the context of the contemporary education environment.\r\n\r\nThe award of PGCE is offered at two levels:\r\n*Professional Graduate Certificate in Education; and\r\n*Postgraduate Certificate in Education, where 60 Masters-level credits can be gained.\r\n\r\nBoth of these are recognised teaching qualifications but the postgraduate award will allow fast-track entry onto a Master’s course. \r\nSuccessful completion of the course leads to Qualified Teacher Status. The majority of your time will be spent on placement in schools or colleges. This practical teaching is supported by university-based lectures, seminars, workshops and tutorials exploring learning and teaching in your subject and in the wider context. Trainees also engage in academic assignments that draw together academic and professional practice.\r\n\r\nThe PGCE in Music will enable you to teach young people how to express themselves by playing, composing and performing music and enjoy listening to music. The course offers a broad holistic training for the 11 to 16 age range across a wide range of perspectives and consists of a mix of practical, hands-on experience needed to equip trainees for the diverse range of challenges faced by music teachers. We are the only provider of PGCE Secondary Music in the East Midlands.\r\n\r\n","interviewProcess":"The interview day... what to expect  \r\n\r\nPlease note that interviews for the 2021-2022 academic year may be conducted online using Microsoft TEAMS. \r\n\r\n \r\n\r\nYou will be provided information regarding set tasks which need to be completed prior to the interview day.  These will form the basis of some discussion at the interview. \r\n\r\nYou will have an individual interview with one of the course tutors. The interview will focus on your personal qualities and skills, your suitability for teaching, your experience of working with young children in school settings and your current studies or employment. You may be required to do other tasks during your interview, such as a presentation based on your teaching subject area, or a group activity. \r\n\r\nYou will complete an English task of your reading and writing ability so we can ensure that you have a good and accurate use of Standard English \r\n","howSchoolPlacementsWork":"School or college experience is central to the Secondary PGCE at NTU. At minimum of 24 weeks are spent on placement in at least two secondary schools or colleges. For both placements, training is planned by mentors to enable students to attain QTS. This practical teaching element is assessed on a regular basis via formal observation by subject mentors and university tutors, enabling us to monitor each individual trainee’s progress and effectively support their development. We are in partnership with a wide range of schools so your placements may be in city centre, suburban or semi-rural locations. This variety provides opportunities for a wide range of teaching experiences and lays a good foundation for your future professional development.\r\n\r\n","personalQualities":"","otherRequirements":"You'll need to undergo a Disclosure and Barring Service check, a Prohibition Order check and complete a Fit to Practice (FTP) questionnaire before you start the course.\r\n\r\nWhat is an FTP?\r\nThe health questionnaire is part of the Fitness to Practice process that you are required to undertake, prior to you commencing an Initial Teacher Training course. Once you are Unconditional Firm with NTU, the QMC will email you a link to an online questionnaire. Once completed, the nurses at the QMC will carry out their assessment. This process is confidential.","status":1,"createdAt":"2021-07-06T10:55:19.077Z","updatedAt":"2021-10-04T16:04:03.084Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
