{"id":"120c938a-363b-4173-9556-b3639910e30a","name":"Primary with physical education","code":"2Q9L","qualification":"pgce_with_qts","startDate":"2024-07-31T23:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"5ae4c96e-1da2-4831-91a3-64439b606fed","code":"06","name":"Primary with physical education"}],"locations":[{"id":"fd519276-63d7-4b8b-804f-4fb6e15466ce","name":"Main Site (Placement Schools are located across the North East)","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"c60f7f80-8e3b-4cf1-950f-db247bcd7eb1","code":"25W","name":"John Spence Community High School"},"accreditedBody":{"id":"d04809d3-d34a-4034-ae20-11f666f3293c","code":"N55","name":"North East Partnership SCITT (Physical Education)"},"profPost":"BO","degreeGrade":"0","english":"1","maths":"1","science":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feeDetails":"Tuition fees for 2022/23 will be £9,250. You can choose to pay these as a one-off payment or to take out a tuition fee loan from Student Finance England. \r\n\r\nFor more information on tuition fee loans, maintenance loans and grants, please visit: Gov.UK and Student Loans Company.  Information about bursaries can be found on the Department for Education website.\r\n ","financialSupport":"You will be provided with an iPad and a keyboard for the duration of the course. \r\n\r\nWe also have contacts for holiday work at sports camps.   \r\n","aboutCourse":"John Spence Community High School is the Lead School and works with the North East Partnership SCITT, Northumbria University and 19 local schools to offer this innovative course which lasts for 40 weeks from September to June.  There is also a 2 week compulsory summer school at the end of August plus you will support end of year activities in your placement school during July.\r\n\r\nYou will be trained as a primary school teacher across the 5 to 11 age range, with a specialism in PE.\r\n\r\nThe course consists of 4 inter-related modules:\r\n\r\n* Professional Placements\r\n\r\nYou will gain teaching experience in 2 contrasting schools; a Host School and a Partner School.  You will spend the majority of the year in your Host School teaching KS2 and a 6 week block in your Partner School teaching KS1.   \r\n\r\n* Curriculum Studies\r\n\r\nIn this module you will develop your subject-specific knowledge and pedagogy in all areas of the primary curriculum, including; core subjects, physical education, foundation subjects, early reading and phonics and early maths.  Sessions are delivered by expert colleagues from partnership schools, the local authority and the Great North Maths Hub alongside the Primary Lead and a Primary PE Consultant.\r\n\r\n* Professional Studies\r\n\r\nIn this module you will develop your knowledge of education through a programme of conference days focusing on topics that are at the forefront of policy and practice. These include; safeguarding and child protection, behaviour management, pupil memory, assessment, inclusion,  teaching and learning, equality and diversity, and literacy and numeracy across the curriculum. Time is also allocated to preparing for employment.  These sessions are delivered by middle and senior leaders in partnership schools.\r\n \r\n* Curriculum Project\r\n\r\nFor this module you will carry out a small scale action research project during your final placement.  You will agree a focus with your tutors based on an area of interest, a development need in your placement school or current research in primary education.  \r\n\r\nSuccessful trainees exit the course with QTS plus a PGCE.  Placement performance is assessed against your mastery of the ITT curriculum and the teachers’ standards for the award of QTS.  For the award of PGCE you will complete two coursework assignments plus your action research project and have the opportunity to gain 60 Masters credits.  \r\n","interviewProcess":"To apply to for this Primary with a PE Specialism course you must use the DfE Apply for Teacher Training application system:\r\n\r\n* Course Code: North East Partnership SCITT  (Physical Education - SD) - 25W 2Q9L.  (Lead School is John Spence Community High School). \r\n\r\n* Applications can be submitted from October for a September entry the following academic year. \r\n\r\n* For the 2022/23 academic year we hope to recruit 14 primary trainees.  As demand for places is very high you are advised to apply as early as possible.  \r\n\r\n* The DfE systems will automatically forward applications to the programme team who will send an email acknowledging receipt. \r\n\r\n* Shortlisted applicants will be invited to an interview day at one of the partnership schools, these days will consist of; a group task, a literacy task, a numeracy task, a KS2 teaching episode, a KS1 engagement activity and a formal interview. The interview panel will comprise representatives from partnership schools. \r\n\r\n* You will be notified through DfE of the outcome of your interview.\r\n","howSchoolPlacementsWork":"We currently work with 19 schools across Durham, Northumberland, Tees Valley and Tyne and Wear.  \r\n\r\nYou will gain teaching experience in 2 of these schools; a Host School and a Partner School:  \r\n\r\n* Your Host School placement starts immediately in September with 2 serial days each week followed by an observation and planning period then a 6 week block between November and December.   You will return after Easter for a further 6 weeks.  Both Host School placements will be in KS2; upper and lower KS2.\r\n\r\n* Your Partner School Placement starts in January with 2 serial days each week followed by an observation and planning period then a 6 week block between February and Easter.  This will be a KS1 placement\r\n\r\nDuring the year you will progress from observation to collaboration to independence and from a 60% to a 70% per timetable.  Your timetable will be split predominantly between the core subjects and physical education plus some time will be spent observing, supporting and teaching the foundation subjects.  \r\n\r\nPlacements are organised using the following criteria: \r\n\r\n* Experience across the 5-11 age range\r\n* Experience in 2 contrasting schools\r\n* Experience gained prior to starting the course \r\n* Specialisms that the schools can offer you to develop gaps in your subject knowledge\r\n* Location of the schools in relation to where you live.  If you have the use of a car/bike or if you will be using public transport will be taken into account. \r\n\r\nIn addition, you will visit 2 other schools to gain experience of working with children who have SEND and EAL plus visit an early years setting and a secondary school.  \r\n\r\n","personalQualities":"We are looking for individuals who are well qualified with relevant and up-to-date experience and who have interests and talents that would enhance children’s learning experiences.  You should be enthusiastic, hardworking, resilient, happy to ‘think outside the box’ and have well developed organisation and communication skills.  You will need to be able to use your initiative, manage workload and work cooperatively and effectively with others.  You must be passionate about a career in teaching and enjoy working with young people, building warm relationships that promote learning.","otherRequirements":"\r\n* A broad and balanced PE, sport or dance background\r\n* The ability to swim 200 metres continuously using two different strokes\r\n* Work experience in a primary school is desirable but not essential\r\n* Competence in ICT\r\n* Have met the government’s requirements in terms of health and physical capacity to train to teach and have enhanced DBS clearance\r\n","status":1,"createdAt":"2021-07-06T10:47:35.133Z","updatedAt":"2021-07-19T11:49:35.688Z","canSponsorStudentVisa":"no","cycle":"2024"}
