{"id":"584462c5-44c2-4f13-96eb-5045eca36113","name":"Physical Education","code":"28ZX","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"74d64a54-5e34-4590-b6c7-528dd0cf26fe","code":"C6","name":"Physical education"}],"locations":[{"id":"76ab31e6-b616-4aa1-88bd-c35df18a82db","name":"Catholic Teaching Alliance Preston Main Site","isPublished":"Y","status":"R","vacancies":"F"},{"id":"71335948-450a-4ee7-91ef-312b83eacc68","name":"Catholic Teaching Alliance Cardinal Newman (14-19yrs) Hub","isPublished":"N","status":"S","vacancies":"F"},{"id":"37c45813-46f5-4b26-91a9-24251faedc21","name":"Catholic Teaching Alliance Blackburn Hub","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"b0661fea-19bc-4a44-b3a1-d521ca9a7608","code":"1GB","name":"Catholic Teaching Alliance (North)"},"accreditedBody":{"id":"9be9f611-2d36-431a-9109-7fcbbfc88fc8","code":"C99","name":"University of Cumbria"},"profPost":"PG","degreeGrade":"1","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"The University of Cumbria can advise on equivalency test providers that they, as the awarding body, will accept. Typically, there are costs involved in sitting equivalency tests.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Choose to train to be a teacher of PE with the Catholic Teaching Alliance (North) by age range and/or location.\r\n\r\n* Secondary level (11-16 yrs) courses are available based at either the main site in Preston or at our Blackburn hub.\r\n* Secondary with post 16 (14-19 yrs) course is available at our Cardinal Newman hub in Preston\r\n\r\nSelect the correct location code for your chosen course.\r\n\r\nNB, places are limited. However, additional places are available if you can also offer an *EBacc subject at grade C or above at A Level, \r\n [contact us] (https://find-postgraduate-teacher-training.education.gov.uk/course/1GB/292V#contact_section) directly as such applications are dealt with on a case by case basis. \r\n\r\n*Mathematics, English, History, Geography, Sciences, Modern Languages.\r\n\r\nIn line with the ITT core content framework, our School Direct PGCE with QTS programme allows you to engage with the necessary knowledge and skills to meet the Teachers’ Standards for Qualified Teacher Status (QTS) and the PGCE award. The PGCE carries 60 credits at Masters Level which could later contribute towards a Master’s Degree in Education (180 credits). Our programme is run in partnership with the University of Cumbria. Alongside school based training, you will also undertake two 30-credit masters level modules, to gain a PGCE taught by University of Cumbria lecturers, who work closely with our school direct programme team, to ensure that theory and practice are closely entwined to really inform your teaching and give you a useful toolkit to take forward in your career.\r\n\r\nIn summary, your PGCE course will usually include\r\n\r\n* 2 separate placements in  contrasting schools/colleges\r\n* 12 Pedagogy for Learning (PfL) days, an opportunity to specialise and enhance your subject knowledge and pedagogy. Usually at the University of Cumbria Lancaster Campus, they are spread over the year.\r\n* A block of training days before the start of each placement and once a week during the first term, delivered by experienced professionals, the majority of whom are outstanding practitioners in our alliance schools and colleges. \r\n* Two  modules connected to the PGCE, assessed by the submission of four written assignments, spread throughout the year, on teaching and learning in your subject and wider educational issues. \r\n\r\nTraining days, other than PfL days, will be delivered either at your principal campus, or at alliance providers in that area. Following current guidelines, we are delivering a ‘blended approach’ to learning, which combines ‘face to face’ sessions with opportunities for remote learning.","interviewProcess":"On the interview day we want you to demonstrate strong subject knowledge, display a passion for your subject, develop a positive rapport with pupils and have the ability to inspire learners.\r\n\r\nThe key parts of the interview day are: \r\n\r\n* A twenty-minute mini -teach. We will let you know the topic beforehand and you will teach a small group of pupils.  \r\n* Written tasks. The first is based upon the importance of managing behaviour; you will have chance to prepare this in advance. The other is a subject knowledge audit, i.e., questions on your chosen subject area.\r\n* Face to face interview with staff from the Catholic Teaching Alliance.\r\n\r\nDue to the current restrictions, we will be holding remote interviews, via Teams. You will still be required to complete the two written tasks, however the mini teach will be an opportunity to teach and explain your lesson to the interview panel. \r\nWe will provide more structured information nearer the time of interview.","howSchoolPlacementsWork":"* On secondary (11-16) courses you will usually have two contrasting school placements, both in Catholic schools.\r\n\r\nPlacement 1 (September to December) Initial Experience Phase: Monday - Thursday. Three weeks observing followed by a gradual build-up of teaching time to 7 hours per week in Key Stage 3 classes. \r\n\r\nPlacement 2 (January to June) Sustained Enactment Phase: Monday - Friday. Two weeks observing followed by a gradual build-up of teaching time to 12 hours per week in Key Stage 3 and GCSE classes.\r\n\r\n* On secondary with post 16 (14-19) courses you will have two contrasting placements, one in a secondary school and one in post 16 provider (sixth form). At least one placement will be in a Catholic establishment.\r\n\r\nPlacement 1 (September to December) Initial Experience Phase: Monday - Thursday. Three weeks observing followed by a gradual build-up of teaching time to 7 hours per week. \r\n\r\nPlacement 2 (January to June) Sustained Enactment Phase: Monday - Friday. Two weeks observing followed by a gradual build-up of teaching time to 12 hours per week.\r\n\r\nThroughout your placements you will have the support and guidance of trained mentors at your placement provider, together with alliance and university colleagues, to meet the standards for QTS.\r\n","personalQualities":"Passion, professionalism and purpose.\r\n\r\nWe are looking for people who have an ability to inspire others, a passion to transform young lives and a willingness to learn the profession of teaching from outstanding practitioners.\r\n\r\nInspire others, transform lives, teach.\r\n\r\n\r\n\r\n\r\n","otherRequirements":"A satisfactory Enhanced Disclosure and Barring Service Background clearance check prior to starting the course. \r\nSatisfactory Occupational Health medical check prior to starting the course.\r\n\r\nWe strongly recommend that you obtain some secondary school experience in a mainstream UK secondary school observing in your chosen teaching specialism before applying. \r\n\r\n\r\n","status":1,"createdAt":"2021-07-06T10:57:19.907Z","updatedAt":"2021-10-02T11:59:19.735Z","canSponsorStudentVisa":"yes","cycle":"2024"}
