{"id":"9991afce-167f-476c-8d9e-1521bffd5896","name":"Music","code":"2JQM","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"24311bef-8673-41fb-933c-53f887fb6976","code":"W3","name":"Music"}],"locations":[{"id":"71335948-450a-4ee7-91ef-312b83eacc68","name":"Catholic Teaching Alliance Cardinal Newman (14-19yrs) Hub","isPublished":"N","status":"S","vacancies":"F"},{"id":"76ab31e6-b616-4aa1-88bd-c35df18a82db","name":"Catholic Teaching Alliance Preston Main Site","isPublished":"Y","status":"R","vacancies":"F"},{"id":"37c45813-46f5-4b26-91a9-24251faedc21","name":"Catholic Teaching Alliance Blackburn Hub","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"b0661fea-19bc-4a44-b3a1-d521ca9a7608","code":"1GB","name":"Catholic Teaching Alliance (North)"},"accreditedBody":{"id":"9be9f611-2d36-431a-9109-7fcbbfc88fc8","code":"C99","name":"University of Cumbria"},"profPost":"PG","degreeGrade":"1","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"The University of Cumbria can advise on equivalency test providers that they, as the awarding body, will accept. Typically, there are costs involved in sitting equivalency tests.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"You can choose to train to be a teacher of Music with the Catholic Teaching Alliance (North) by age range and/or location.\r\n\r\nSelect the correct location code for your chosen course.\r\n*  Location code hyphen,(-) for the Secondary level (11-16 yrs) course at the Catholic Teaching Alliance Preston Main Site based at Our Lady's Catholic High School.\r\n* Location code M for the Secondary level (11-16 yrs) course at the Catholic Teaching Alliance Blackburn Hub based at St Bede's RC High School.\r\n* Location code 4 for the Secondary with post 16 (14-19 yrs) course at our Catholic Teaching Alliance Preston Hub based at Cardinal Newman College.\r\n\r\nIn line with the ITT core content framework, your teacher training with the Catholic Teaching Alliance (North) will give you the necessary knowledge and skills to meet the standards for Qualified Teacher Status (QTS) and the PGCE award. The PGCE carries 60 credits at Masters Level which could later contribute towards a Master’s Degree in Education (180 credits). \r\nOur programme is run in partnership with the University of Cumbria. Alongside school based training, you will also undertake two 30-credit masters level modules, to gain a PGCE. These modules are taught by the University of Cumbria lecturers, who work closely with our school direct programme team, to ensure that theory and practice are closely entwined to really inform your teaching and give you a useful toolkit to take forward in your career.\r\n\r\nAs a summary, your PGCE course will include\r\n\r\n* 2 separate placements in  contrasting schools/colleges\r\n* 12 Pedagogy for Learning (PfL) days when you will have the opportunity to specialise and enhance your subject knowledge and pedagogy in your own subject area.  These will take place mainly at the University of Cumbria Lancaster Campus and are spread over the year.\r\n* A block of training days before the start of each placement and once a week during the first term, delivered by experienced professionals, the majority of whom are outstanding practitioners in our alliance schools and colleges. \r\n* Two  modules connected to the PGCE  that are assessed by the submission of four written assignments, spread throughout the year, on teaching and learning in your subject and wider educational issues. \r\n\r\nTraining days, other than PfL days, will be delivered either at your principal campus, or at alliance providers in that area. ","interviewProcess":"On the interview day we want you to demonstrate strong subject knowledge, display a passion for your subject, develop a positive rapport with pupils and have the ability to inspire learners. \r\n\r\nThe key parts of the interview day are: \r\n\r\n* A twenty-minute mini -teach. We will let you know the topic beforehand and you will teach a small group of pupils.  \r\n* Written tasks. The first is based upon the importance of managing behaviour; you will have chance to prepare this in advance. The other is a subject knowledge audit, i.e., questions on your chosen subject area.\r\n* Face to face interview with staff from the Catholic Teaching Alliance. \r\n\r\nWe will provide more structured information nearer the time of interview.\r\n \r\n","howSchoolPlacementsWork":"* On secondary (11-16 yrs) courses you will usually have two contrasting school placements, both in Catholic schools.\r\n\r\nPlacement 1 (September to December) Initial Experience Phase: Monday - Thursday. Three weeks observing followed by a gradual build-up of teaching time to 7 hours per week in Key Stage 3 classes. \r\n\r\nPlacement 2 (January to June) Sustained Enactment Phase: Monday - Friday. Two weeks observing followed by a gradual build-up of teaching time to 12 hours per week in Key Stage 3 and GCSE classes.\r\n\r\n* On secondary with post 16 (14-19 yrs) courses you will have two contrasting placements, one in a secondary school and one in post 16 provider (sixth form). At least one placement will be in a Catholic establishment.\r\n\r\nPlacement 1 (September to December) Initial Experience Phase: Monday - Thursday. Three weeks observing followed by a gradual build-up of teaching time to 7 hours per week. \r\n\r\nPlacement 2 (January to June) Sustained Enactment Phase: Monday - Friday. Two weeks observing followed by a gradual build-up of teaching time to 12 hours per week.\r\n\r\nThroughout your placements you will have the support and guidance of trained mentors at your placement provider, together with alliance and university colleagues, to meet the standards for QTS.\r\n","personalQualities":"Passion, professionalism and purpose.\r\n\r\nWe are looking for people who have an ability to inspire others, a passion to transform young lives and a willingness to learn the profession of teaching from outstanding practitioners.\r\n\r\nInspire others, transform lives, teach.\r\n\r\n\r\n\r\n\r\n","otherRequirements":"A satisfactory Enhanced Disclosure and Barring Service Background clearance check prior to starting the course. \r\nSatisfactory Occupational Health medical check prior to starting the course.\r\n\r\nWe strongly recommend that you obtain some secondary school experience in a mainstream UK secondary school observing in your chosen teaching specialism before applying. \r\n\r\n\r\n","status":1,"createdAt":"2021-07-06T10:57:20.584Z","updatedAt":"2021-10-02T11:29:06.864Z","canSponsorStudentVisa":"yes","cycle":"2024"}
