{"id":"cb7c7291-95fa-4059-a744-d9e6cbd1b079","name":"Physics","code":"R787","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"14_to_19","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"bf97cd0a-224c-43d3-a021-84143df13e8d","code":"F3","name":"Physics"}],"locations":[{"id":"71335948-450a-4ee7-91ef-312b83eacc68","name":"Catholic Teaching Alliance Cardinal Newman (14-19yrs) Hub","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"b0661fea-19bc-4a44-b3a1-d521ca9a7608","code":"1GB","name":"Catholic Teaching Alliance (North)"},"accreditedBody":{"id":"9be9f611-2d36-431a-9109-7fcbbfc88fc8","code":"C99","name":"University of Cumbria"},"profPost":"PG","degreeGrade":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"The University of Cumbria can advise on equivalency test providers that they, as the awarding body, will accept. Typically, there are costs involved in sitting equivalency tests.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"This course is available at 'secondary with post 16 (ages 14-19)' level at the Catholic Teaching Alliance Cardinal Newman Hub in Preston. \r\n\r\nIn line with the ITT core content framework, our School Direct PGCE with QTS programme allows you to engage with the necessary knowledge and skills to meet the Teachers’ Standards for Qualified Teacher Status (QTS) and the PGCE award. The PGCE carries 60 credits at Masters Level which could later contribute towards a Master’s Degree in Education (180 credits). \r\nAlongside school based training, you will also undertake two 30-credit masters level modules, to gain a PGCE. These modules are taught by the University of Cumbria lecturers, who work closely with our school direct programme team, to ensure that theory and practice are closely entwined to really inform your teaching and give you a useful toolkit to take forward in your career.\r\n\r\nAs a summary, your PGCE course will include:\r\n\r\n* 2 separate placements\r\n* 12 Pedagogy for Learning (PfL) days when you will have the opportunity to specialise and enhance your subject knowledge and pedagogy in your own subject area.  These will take place mainly at the University of Cumbria Lancaster Campus and are spread over the year.\r\n* Additional training days are delivered throughout the course by experienced professionals, the majority of whom are outstanding practitioners in our alliance schools and colleges. \r\n* Two  modules connected to the PGCE  that are assessed by the submission of four written assignments, spread throughout the year, on teaching and learning in your subject and wider educational issues. \r\n\r\nTraining days, other than PfL days, will be delivered at either of the two main campuses in Preston or at alliance providers in the area.","interviewProcess":"On the interview day we want you to demonstrate strong subject knowledge, display a passion for your subject, develop a positive rapport with pupils and have the ability to inspire learners.\r\n\r\nThe key parts of the interview day are: \r\n\r\n* A twenty-minute mini -teach. We will let you know the topic beforehand and you will teach a small group of pupils.  \r\n* Written tasks. The first is based upon the importance of managing behaviour; you will have chance to prepare this in advance. The other is a subject knowledge audit, i.e., questions on your chosen subject area.\r\n* Face to face interview at Cardinal Newman College with staff from the Catholic Teaching Alliance. \r\n\r\nWe will provide more structured information nearer the time of interview.\r\n","howSchoolPlacementsWork":"On this secondary with post 16 (14-19 yrs) course you will have two contrasting placements, one in a secondary school and one in a post 16 provider (sixth form). At least one placement will be in a Catholic establishment.\r\n\r\n* Placement 1 (September to December) Initial Experience Phase: Monday - Thursday. Three weeks observing followed by a gradual build-up of teaching time to 7 hours per week. \r\n\r\n* Placement 2 (January to June) Sustained Enactment Phase: Monday - Friday. Two weeks observing followed by a gradual build-up of teaching time to 12 hours per week.\r\n\r\nThroughout your placements you will have the support and guidance of trained mentors at your placement institution and other alliance  colleagues, to meet the standards for QTS.\r\n","personalQualities":"Passion, professionalism and purpose.\r\n\r\nWe are looking for people who have an ability to inspire others, a passion to transform young lives and a willingness to learn the profession of teaching from outstanding practitioners.\r\n\r\nInspire others, transform lives, teach.\r\n\r\n\r\n\r\n\r\n","otherRequirements":"A satisfactory Enhanced Disclosure and Barring Service Background clearance check prior to starting the course. \r\nSatisfactory Occupational Health medical check prior to starting the course.\r\n\r\nWe strongly recommend that you obtain some school/college experience in a mainstream UK secondary school or sixth form college, observing in your chosen teaching specialism, before applying. \r\n\r\n\r\n","status":1,"createdAt":"2021-12-03T09:16:38.286Z","updatedAt":"2021-12-03T12:37:49.502Z","canSponsorStudentVisa":"yes","cycle":"2024"}
