{"id":"dc0351cb-e10a-4258-a01f-1c24a3396b52","name":"Primary (5-11)","code":"292W","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"76ab31e6-b616-4aa1-88bd-c35df18a82db","name":"Catholic Teaching Alliance Preston Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"b0661fea-19bc-4a44-b3a1-d521ca9a7608","code":"1GB","name":"Catholic Teaching Alliance (North)"},"accreditedBody":{"id":"9be9f611-2d36-431a-9109-7fcbbfc88fc8","code":"C99","name":"University of Cumbria"},"profPost":"PG","degreeGrade":"1","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"The University of Cumbria can advise on equivalency test providers that they, as the awarding body, will accept. Typically, there are costs involved in sitting equivalency tests.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"This Primary (5-11 years) course is based in our Training Centre at the Catholic Teaching Alliance Preston Main Site at Our Lady's Catholic High School, Fulwood. \r\n\r\nIn line with the ITT core content framework, our School Direct PGCE with QTS programme allows you to engage with the necessary knowledge and skills to meet the Teachers’ Standards for Qualified Teacher Status (QTS) and the PGCE award. The PGCE carries 60 credits at Masters Level which could later contribute towards a Master’s Degree in Education (180 credits). \r\n\r\nOur programme is run in an academic partnership with the University of Cumbria. Alongside school based training, you will also undertake two 30-credit masters level modules, to gain a PGCE. These modules are practically focused and titled ‘Raising the Achievement of Children’ and ‘High Quality Learning and Teaching’, both are designed to focus on your priorities and interests as you develop your teaching skills. They involve a total of 3 written assessments, one of which is a formative piece to support your academic development. These modules are taught by the University of Cumbria lecturers, who work closely with our school direct programme team, to ensure that theory and practice are closely entwined to really inform your teaching and give you a useful toolkit to take forward in your career. \r\n\r\nThe majority of your training will be delivered in school or at dedicated sessions in our Training Centre. You will benefit from the knowledge and experience of practising teachers and headteachers.\r\n","interviewProcess":"All of our interviews usually take place in a local school setting, led by our Primary Programme Lead.  You are required to complete three tasks – \r\n\r\n* Mini teach – You will be informed prior to the interview day about the age of the children and the curriculum area that is the focus. This is your opportunity to demonstrate your ability to plan an age appropriate task, linked to an area of the curriculum, whilst managing the behaviour of a small group. Your rapport with the children will also be observed. \r\n\r\n* A discussion task that will allow you to demonstrate your awareness of the level of academic required when studying at this level\r\n\r\n* Interview - The final part of the process is an interview which will allow the interviewers to gauge your ability and potential to complete the course.\r\n\r\nWe will provide more structured information nearer the time of interview.\r\n\r\n","howSchoolPlacementsWork":"When you train with the Catholic Teaching Alliance your placements will be in Catholic schools from our alliance. There are 3 placements in total.\r\n\r\nAt the start of the course you will be assigned a ‘Home School’ where you will undertake the first two placements: one in Key Stage 1 and one in Key Stage 2.\r\n\r\nYou will spend a great deal of time, other than on placement, in your home school so that you have the opportunity to observe and reflect first hand on quality teaching across all key stages.  You will have the chance to involve yourself in school life, develop your ability to manage other people within the classroom and learn essential skills to enable you to confidently plan, deliver and reflect on sequences of lessons across the curriculum.\r\n\r\nYour final ‘Extending' placement will, generally, be in a contrasting setting, in a Key Stage of your choice. \r\n\r\nWhen you train with Catholic Teaching Alliance you will be supported throughout all of your placements by a trained mentor within the school and supported by our Primary Programme Lead who will ensure that you have every support to enable you to achieve success. ","personalQualities":"Passion, professionalism and purpose.\r\n\r\nWe are looking for people who have an ability to inspire others, a passion to transform young lives and a willingness to learn the profession of teaching from outstanding practitioners.\r\n\r\nInspire others, transform lives, teach.\r\n\r\n\r\n\r\n\r\n","otherRequirements":"A satisfactory Enhanced Disclosure and Barring Service Background clearance check prior to starting the course. \r\nSatisfactory Occupational Health medical check prior to starting the course.\r\n\r\nWe strongly recommend that you obtain some primary school experience in a mainstream UK primary school. \r\n\r\n\r\n","status":1,"createdAt":"2021-07-06T10:57:20.417Z","updatedAt":"2021-10-02T13:02:43.949Z","canSponsorStudentVisa":"yes","cycle":"2024"}
