{"id":"295e5da3-8d13-43aa-9b21-09af4138f92d","name":"Primary","code":"38J2","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"7be11ccc-bafa-41be-bcd4-0bd679dfeda7","name":"Passmores Cooperative Learning Community (Primary training)","isPublished":"N","status":"N","vacancies":"F"},{"id":"fefc9f60-0333-4c7f-8480-a27d3fb09773","name":"Chelmsford Learning Partnership (Primary training)","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"0ee329d0-d333-4dac-be3e-80773559a8e6","code":"1OS","name":"Essex School Direct"},"accreditedBody":{"id":"de0e702b-b19b-4594-b433-aa49be29f4d9","code":"H40","name":"Tes Institute"},"profPost":"BO","english":"1","maths":"1","science":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":null,"aboutCourse":"Essex School Direct provides a very special, school based training experience in partnership with TES Institute who have a reputation for innovative on-line learning materials, especially in shortage subjects, with its Subject Knowledge Enhancement courses.  \r\n\r\nTES Institute, a leading teacher training provider and the newest member of the TES Global family, is delighted to be working in partnership with Passmores Co-operative Learning Community Trust  and its partners to deliver School Direct initial teacher training (ITT).  \r\n\r\nOur salaried and unsalaried School Direct programmes are accredited by the National College for Teaching and Leadership (NCTL) and they provide a blend of online learning and in-school experience leading to Qualified Teacher Status (QTS) and an option to add a Postgraduate Certificate in Education (PGCE). \r\n\r\nThe PGCE is accredited by our partner University and is subject to annual review.\r\n\r\nEssex School Direct Primary training programmes are run through two Partnerships. The Passmores Cooperative Learning Community (PCLC) in Harlow and the Chelmsford Learning Partnership (CLP), a multi-academy trust based in Springfield, Chelmsford. The schools within both PCLC and CLP believe that teaching is an exciting, challenging and rewarding profession.  Their vision is to offer the highest standard of education for all, both in the local communities and beyond. \r\n\r\nIn Harlow, our Primary training programme centres around several schools, including Purford Green Primary School, Potter Street Academy and The Downs Primary School. In Chelmsford, our training programme centres around Barnes Farm Infant School, Barnes Farm Junior School, The Beaulieu Park School, Perryfields Infant School and The Tyrrells School. \r\n\r\nBoth towns of Harlow and Chelmsford have excellent transport links via road and rail, and are accessible to London and Cambridge within 45 mins. Most candidates who train with us are local but because of good transport links in both areas, we have had numerous applicants from the wider West and Mid Essex areas and Hertfordshire.\r\n\r\n","interviewProcess":"The partnership schools will take part in a shortlisting process for each subject on offer. \r\n\r\nFollowing this, there will be an interview at a school, which will consist of:\r\n \r\n* An observation of a short teaching activity, which the applicant will be briefed on prior to the day of interview\r\n* A written task\r\n* A maths task\r\n* A formal interview\r\n\r\nApplicants who are successful at interview will be offered a conditional place, subject to the following being met: \r\n\r\n* Satisfactory references\r\n* Satisfactory medical assessment\r\n* Disclosure and Barring Service Check (DBS)\r\n* National and Local Terms & Conditions of Employment.\r\n\r\nNB: other conditions may also apply, and the interview process may be subject to variation due to Covid-19.\r\n\r\n","howSchoolPlacementsWork":"You will be trained in schools which have finely developed systems in place to nurture development of the whole teacher and equip the trainee teacher with the 'tools of the trade'. \r\n\r\nAll primary trainees will need to train to teach the 5 - 11 age range, with a placement in both key stages across the year.\r\n \r\nEach successful trainee is placed in one school for the majority of the placement and the training will be provided by expert practitioners. A second placement will take place in a contrasting school.","personalQualities":"* Ability to work using own initiative and manage own work load\r\n* Ability to combine work and study\r\n* Ability to work co-operatively and effectively with colleagues\r\n* Ability to build relationships with children that promote learning\r\n* To have excellent verbal and written communication skills\r\n* An interest in and enjoyment of working with children\r\n* An ability to reflect on own practice and to listen and learn from guidance and from teaching and learning experiences\r\n* An understanding of children’s needs\r\n* An understanding of the professional boundaries related to child protection procedures\r\n","otherRequirements":"You must have 2 references, and have DBS clearance from our provider.","status":2,"createdAt":"2021-07-06T10:47:54.652Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"With School Direct salaried programmes, you won’t need to pay any tuition fees. You’ll be employed and paid by a school directly as an unqualified teacher. This has previously been on Point 1 of the Unqualified Teaching Scale. The amount will be subject to tax."}
