{"id":"8b0dee91-a455-4fba-b200-626d97a8ad25","name":"Chemistry","code":"36Y8","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"14_to_19","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"912d4fb4-761b-42e9-8dc6-e968b791ea4e","code":"F1","name":"Chemistry"}],"locations":[{"id":"7aaea850-ecad-4049-beab-5b5ec749b3c8","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"426b1039-5a78-435d-bf2d-252a3bbb2ed9","code":"1QW","name":"Wessex Teach"},"accreditedBody":{"id":"3700fb02-7007-40c8-9127-b070e146d6cb","code":"W76","name":"University of Winchester"},"profPost":"PG","degreeGrade":"1","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"You will be based at the main school all year, with a placement of 6 weeks straight after Christmas.  \r\nThe school will organise a timetable that gives you access to KS3-5 classes - your commitment to teaching will increase as you progress through the course.  You will be assigned a mentor within your department who will work closely with you  on a day-to-day basis, meeting formally with you once a week.  \r\nAlongside your lessons you will complete three assignments for the University of Winchester (for the additional PGCE part of the qualification).  These are focused around behaviour management, curriculum and inclusion and diversity.  You will spend 6 days throughout the year at Winchester for subject knowledge sessions with a specialist teacher, alongside fellow trainees from your own subject across the area.  In addition to this you will have weekly professional learning sessions at school focusing on educational pedagogy that will support you both in the classroom and in completing your assignments.  We generally keep Fridays free from lessons for training and assignment purposes.\r\nThe second placement school takes place in the first half of the spring term - we will work with you individually according to preferences.  Winchester will allocate you a University mentor who will visit approximately once per half term to review progress - this will include a lesson observation and a look through your teaching files.\r\n","interviewProcess":"Well done - you have been invited for interview!!\r\n\r\nThe interview panel will include the subject leader/Head of Curriculum Area, ITEC and a representative from the University of Winchester ITE Partnership.  The day will include:\r\n* A tour of the school\r\n* A short written task (30 minutes)\r\n* Delivery of a lesson 'episode' (you will be given information prior to the    day)\r\n* Observations in the classroom\r\n* A more formal interview\r\n\r\nWhen invited to interview you will be asked to bring along some paperwork, including proof of address, proof of eligibility to work in the UK and examination certificates.","howSchoolPlacementsWork":"Your main school is called your 'formative placement'.  You will spend the majority of the year at your main school.\r\nIn January you will spend 6 weeks in another school - it is likely to include years 7 and 8 because Thomas Hardye is an Upper School and so KS3 experience is limited.  \r\nWe will discuss your placement early on, and we are very happy to consider your own personal requests.  We fully appreciate that many trainees are keen to attend schools close to home to minimise travel commitments.  We have strong relationships with many local upper, secondary and middle schools.","personalQualities":"You will be enthusiastic and passionate about your subject, and be able to convey this to others through a strong work ethic and the ability to form positive working relationships with others.  You will be able to articulate clearly how your skills and qualities equip you for this role, and why you would like to train with us.","otherRequirements":"We would like you to have completed a minimum of 10 days work experience in schools (any phase) prior to starting your ITT programme - this does not have to be completed prior to applying.","status":1,"createdAt":"2021-07-06T10:49:09.886Z","updatedAt":"2021-10-08T11:16:30.472Z","canSponsorStudentVisa":"yes","cycle":"2024"}
