{"id":"0d94858e-30b5-4f35-a404-0b38642d40c8","name":"Citizenship","code":"3FTH","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"7c98ffbf-d90d-46bb-91ea-7817a81848f5","code":"09","name":"Citizenship"}],"locations":[{"id":"a85e99d0-0fda-4a17-95ae-49b3133379c2","name":"Northfleet School For Girls","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"369ea7a4-0f87-43f3-a34a-9d92b2093273","code":"295","name":"Saint George’s Church of England School"},"accreditedBody":{"id":"757d0dca-c7a9-43c8-8c3b-96c0a81539b6","code":"K30","name":"Kent and Medway Training"},"english":"3","maths":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","aboutCourse":"The training year is from school term through to end of June the following year although you will contracted at the school for the remaining full academic year.\r\n\r\nThis practical course comprises a mix of classroom-based training with subject mentor support, to academic training where you will be working with experienced professionals on either generic \"Professional Studies\" lectures at a local KMT Hub training centre or \"Subject Studies\" training with the other English trainees at various locations across the partnership.\r\n\r\nA-placement:- As you are employed by the school, you will be given a 60% solo teaching timetable from day one. You may have your own form group and you will be undertaking all duties as a paid teacher of the school. Please be aware that mentors are likely to be teaching their own classes while you are teaching and that immediate support is often less likely to be accessible.\r\n\r\nB-placement:- the teaching load remains at 60%. The duration of the placement is no longer than four weeks. During this time, you can expect to follow a non-salaried course structure. You will quickly build to 60% solo teaching commitment through observation, team-teaching activities before going solo. At all times, there will be a classroom teacher available to support you.\r\n\r\nA2 placement:- you return to your home school for the full five days and continue with your timetable. There is one Thursday KMT twilight session that prepares you for your NQT year and the Awards Evening.\r\n\r\nYou will have at least, one formal lesson observation a fortnight and one meeting each week where you sit with your mentor, discuss your progress and make targets for the following week. You will be expected to attend all school events such as parents evenings, after school clubs, whole school and dedicated trainee training sessions and any other school activity as required.\r\n\r\nOver the year, you will be building up a portfolio of evidence demonstrating your progress towards meeting the Teaching Standards. There are also 7 Reflective, Practical Journals (RPJ) to complete of which 3 involve research and an essay; each totaling 1500 words.\r\n\r\nIn addition, for those wishing to top up their qualification to PGCE, you will have other assignment to complete at various times through the year as published by the University of Leeds Beckett. This course is delivered through a distance-learning package and training will take place in your local hub training centre.","interviewProcess":"To be considered for interview, we need a completed UCAS application.\r\nOnce received, your application is sent to your chosen campus for their consideration.\r\n\r\nPLEASE NOTE: At application you will need to demonstrate significant school experience that prepares you thoroughly for teaching classes with minimal support and that meets the government eligibility criteria concerning three year full-time work experience.\r\n\r\nIf selected for interview, a date will be arranged where you will;\r\n•\tvisit the school,\r\n•\tobserve and participate in lessons,\r\n•\tundertake a formal interview with the Subject Leader, the school's Professional Tutor and a representative from Kent and Medway Training.\r\n•\tsit the KMT entrance tests in English.\r\n\r\nPLEASE NOTE: You may be asked to teach a lesson or part lesson at interview.\r\n\r\nThe formal interview is approximately 50 minutes long.\r\n\r\nYou will be required to prepare a 10-minute presentation on what made a lesson that you have seen, good or not so good. Further questions are asked to ascertain your suitability for teaching.\r\n\r\nYou will be given a conditional offer only if all members of the panel agree to the placement. However, should you impress at interview but not be offered a place, you will be given the opportunity for your application to be considered by other partner schools without the need to sit a second formal interview.","howSchoolPlacementsWork":"All applicants have the opportunity at application, to apply for the school of their choice. If appointed, that school becomes the trainee's \"home\" school and is responsible for the majority of the training; subject to the course requirements and quality assurance of the accrediting provider, Kent and Medway Training. The training year is split into three placements:\r\n\r\n•\tPlacement A is at your home school and runs from the beginning of the academic year until the end of January. You are in school for four and a half days a week. Thursday afternoon is your KMT academic time where you will have either Professional Studies or Subject Studies training, led by experienced practitioners or subject specialists.\r\n\r\n•\tPlacement B is a contrasting school. For example, if your home school is a High School, you B placement could be a Grammar School.\r\nWhere possible, your B-placement school will be discussed with you in advance and you will be placed in the local area.\r\n\r\nThe placements runs from February for four weeks. Thursdays remain your KMT academic afternoon where you will have either Professional Studies, led by experienced practitioners or Subject Studies training, led by subject specialists. During this placement you can expect to observe teachers, gradually taking over the class teacher's lessons to a 60% timetable. The class teacher will be in attendance for additional support and guidance.\r\n\r\n•\tPlacement A2 is back at your home school where you remain from Easter beyond the completion of your course in June to the end of the academic year. You will be in school for the full 5 day week. Professional and Subjects studies are finished with just one further evening session preparing you for your NQT year.\r\n\r\nDuring this placement you will be finally assessed through both lesson observation and your completed portfolio to ensure that you have met the teaching standards in full. Our grades are then externally moderated and assuming all goes well, your Newly Qualified Teacher status is confirmed and celebrated at a local hub- centred Awards Evening.","personalQualities":"•\tStrong and dedicated professionals\r\n•\tResilient\r\n•\tProactive and creative\r\n•\tOpen to feedback and guidance\r\n•\tPassionate about developing pupil learning and well being\r\n•\tStrong in their subject knowledge\r\n•\tPositive in their communication skills\r\n•\tGenuinely aiming to become an outstanding practitioner\r\n•\tEnjoy working with children and young adults to enable them better\r\n        life opportunities\r\n","otherRequirements":"Before the course begins but not necessarily at application, you will need\r\n•\tat least 10 experience days in a secondary school or academy\r\n•\tat least 2 experience days in a primary school or academy\r\n•\tDBS check\r\n•\tHealth check declaration\r\nIt is useful to attend a school experience day before application so that you can get a feel for the chosen school and what it can offer as a training placement.\r\n","status":2,"createdAt":"2021-07-06T10:51:02.743Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"The salary is normally at the \"unqualified teacher\" point 1 on the salary scale although this may be negotiable to fall in line with current bursary payments available for non-salaried trainees.\r\n\r\nThe home school that employs you will pay for your Qualified Teacher Status (QTS) course only. Should you wish to top up your qualification to the full Post Graduate Certificate of Education (PGCE) you will be responsible for those extra fees of £1800\r\n\r\nFinancial support\r\nFinancial support isn’t available for this course because it comes with a salary.\r\nIf you choose a course without a salary, you may be eligible for financial support while you study, including bursaries, scholarships and loans.\r\n"}
