{"id":"89891b2d-a1ad-41f4-bda7-d5e6eb53d30d","name":"Primary","code":"2RTQ","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"d980c944-b276-4ae4-b17f-e4b903054a4f","name":"St Botolph's Church of England Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"73934fe9-03d0-4e7d-9f30-1362dc8802c0","name":"St George's Primary Phase","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"369ea7a4-0f87-43f3-a34a-9d92b2093273","code":"295","name":"Saint George’s Church of England School"},"accreditedBody":{"id":"757d0dca-c7a9-43c8-8c3b-96c0a81539b6","code":"K30","name":"Kent and Medway Training"},"degreeGrade":"9","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We accept Level 2 in English and Maths only.\n\nLevel 2 in Literacy and Numeracy are not accepted.\n\nWe accept equivalency in a single science (e.g. Biology)","courseLength":"OneYear","feesUK":7100,"feesInternational":7100,"feeDetails":"The fee of £7100 is the cost for all trainees leading to Qualified Teacher Status (QTS) only. This fee is payable by all non-salaried trainees.\r\n\r\nFor those wishing to \"top up\" their qualification to the full Professional Graduate Certificate in Education (PGCE) a further £1950 will be payable to  Leeds Beckett University. This fee is payable by both salaried and non-salaried trainees.","financialSupport":"You may be eligible for financial support while you study.\r\n\r\n","aboutCourse":"The course begins on the first day of INSET training with the rest of the staff, integrating you into the staff body, and will continue until the middle of June. You will also have a six-week placement which will offer you the opportunity to teach in the alternative Key Stage.\r\n\r\nYou will be in schools for four days a week where you will be involved in observations, teaching, staff training, parents’ evenings, school meetings, extra-curricular clubs: all the facets of a teacher’s school life. On Thursdays, you will have your pedagogical training with KMT that provides a mixture of subject specific sessions and more general ones which have a holistic approach to educational practices. After Easter, you will be in school four and a half days, KMT training will still take place on Thursday afternoons until the end of May.\r\nYou will be supported by a network of established professionals, including a school base mentor, your KMT Lead Mentors and Course Directors as well as the other teachers and trainees in your school. You will have a weekly mentor meeting to allow you to discuss the progress you have made and the support you might need to develop your practice effectively.\r\n\r\nTo begin the year, you will observe lessons, developing into leading small parts of a lesson or working with small groups, and building until you are teaching 70% of a full timetable by the end of the course. You will be supernumerary, meaning there will always be with a qualified teacher in the room with you. You will be formally observed once a week in order to receive constructive feedback that will help you develop into an effective teacher.\r\nAs well as your teaching, you will be working on charting your development and recording your skills through a Progress Tracker and Reflective Practice Assignments. At the late stage of your training, you are being assessed against the 8 Teachers Standards. \r\nIn addition, for those wishing to obtain the Professional Graduate Certificate in Education (PGCE) as well as Qualified Teacher Status (QTS), you will be able to top up your qualification by paying an extra fee and completing additional assignments if you decide to complete the Evidence Informed Practice offered through distance learning with Leeds Beckett University.\r\n","interviewProcess":"A structured interview forms a core part of the recruitment process and will involve the placement school as well KMT representation.\r\nA training provision checklist will be provided to candidates prior to the interview for them to read through. A short period of time will be allocated at the start of the interview to allow the candidates to ask any questions they may have in relation to the training provision offered by KMT.\r\nInterviews have a clear structure which helps keep the panel objective and focused throughout. However, this must allow flexibility and the necessary freedom for skilled interviewers to use probing, supplementary and additional questions as required to ascertain the candidate's motivation, resilience and dedication to teaching.\r\nAn interview format should cover:\r\n• Initial meeting between the candidate and the Course Director to discuss the training provision;\r\n• An introductory opening when the interview panel joins;\r\n• A schedule of questions which are asked by panel members;\r\n• Space for candidates to raise any issues or ask their own questions;\r\n• The close of the interview, explanation of what will happen next;\r\n• Maths and English proficiencies will be checked following an offer.\r\nIf the candidate is successful at interview, a conditional offer will be made.\r\n","howSchoolPlacementsWork":"You will have a ‘Home’ school which is where you will spend the majority of your training year, between September and mid-February, and Easter and June. You will be learning how to teach in either KS1 or KS2 by slowly building up to teaching full lessons and then building up your number of lessons. You will be supported by a mixture of expert teachers.\r\n\r\nYou will also have a six-week B Placement which will offer you the opportunity to teach in the alternative Key Stage. This will take place between Mid-February and Easter.\r\nIn April and May, you will be finally assessed through both lesson observations and your completed portfolio to ensure that you have met the Teachers’ Standards. If you are successful, your QTS award will be confirmed during our final Exam Board.\r\n","personalQualities":"•\tIn order to train with us you must be:\r\n\r\n* passionate about teaching children\r\n* highly motivated\r\n* organised\r\n* resilient and resourceful\r\n* independent and proactive\r\n* self-reflective\r\n* open to constructive criticism\r\n* professional\r\n* a strong and effective communicator\r\n","otherRequirements":"Before the course begins, you will need:\r\n* at least 10 experience days in a primary school or academy (dependent on Covid Government Guidelines)\r\n* DBS check\r\n* Health check declaration\r\nIt is useful to attend at least one school experience day before application so that you can get a feel for the chosen school and what it can offer as a training placement.\r\n","status":1,"createdAt":"2021-07-06T10:51:01.553Z","updatedAt":"2021-10-04T16:18:34.602Z","canSponsorStudentVisa":"no","cycle":"2024"}
