{"id":"8b1d35c2-3de2-4477-8349-339511a5522a","name":"Physical Education with Biology","code":"1AV2","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"74d64a54-5e34-4590-b6c7-528dd0cf26fe","code":"C6","name":"Physical education"},{"id":"322cfc19-d51d-45db-91e3-bd7b4738470f","code":"C1","name":"Biology"}],"locations":[{"id":"a85e99d0-0fda-4a17-95ae-49b3133379c2","name":"Northfleet School For Girls","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"369ea7a4-0f87-43f3-a34a-9d92b2093273","code":"295","name":"Saint George’s Church of England School"},"accreditedBody":{"id":"757d0dca-c7a9-43c8-8c3b-96c0a81539b6","code":"K30","name":"Kent and Medway Training"},"english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":6950,"feesInternational":6950,"feeDetails":"The fee of £6950 is the cost for all trainees leading to Qualified Teacher Status (QTS) only. This fee is payable by all non-salaried trainees but payable by the home school for salaried trainees.\r\n\r\nFor those wishing to \"top up\" their qualification to the full Post Graduate Certificate in Education (PGCE) a further £1800 will be payable to the University of Leeds Beckett who are our PGCE accredited body. This fee is payable by both salaried and non-salaried trainees.","financialSupport":"You may be eligible for financial support while you study, including bursaries, scholarships and loans.\r\n\r\nFinancial support if you’re from outside of the UK.","aboutCourse":"The training year commences at the beginning of the academic year through to middle of June the following year enabling you to take up employment from 1st July to schools that offer it.\r\nThis practical course comprises a mix of classroom-based teaching in a school to academic training on either generic \"Professional Studies\" lectures at a local KMT hub-training centre or \"Subject Studies\" training with the other Primary trainees at various locations across the partnership.\r\nFor the first two placements, you work in school for 4 days a week learning how to teach by leading lessons. Thursday is your academic day and in the afternoon you will attend either professional or subject studies sessions. When you return to you home school after Easter, you will be in school full time, for 5 days.\r\nYour studies gradually build from observing teachers and lessons to working with your mentor in team planning and teaching until by the end of the course, you are teaching 60% of a full timetable. At all times, there will be the classroom teacher available to support you nearby.\r\nYou will gain experience of parents evenings, clubs and many other after school events that make up the life of a teacher.\r\nThe course focuses on the teaching and learning of KS3 and KS4 students and you will be assessed on your teaching of classes from these key stages. However, because of Kent and Medway’s unique education system you may also be given the opportunity to experience KS5 teaching.\r\nThroughout the year, you will be building up a portfolio of evidence demonstrating your progress towards meeting the \"Teaching Standards.\" Academic research is through the completion of Reflective, Practical Journals (RPJ) and these are spread across the academic year.\r\nIn addition, for those wishing to top up their qualification to PGCE, you will have other assignment to complete at various times through the year as published by the University of Leeds Beckett. This course is delivered through a distance-learning package and training will take place in your local hub- training centre.\r\nTo aid your development, you will have one formal lesson observation and one dedicated mentor meeting each week. This is where you sit with your school mentor, discuss your progress and make targets for the following week. Their work is enhanced further by KMT lead mentors and course directors who further oversee and support all aspects of your studies.","interviewProcess":"To be considered for interview, we need a completed UCAS application.\r\nOnce received, your application is sent to your chosen campus for their consideration.\r\n\r\nIf selected for interview, a date will be arranged where you will:\r\n•\tvisit the school,\r\n•\tobserve and participate in lessons,\r\n•\tundertake a formal interview with the Subject/Key Stage Leader, the school's Professional Tutor and a representative from Kent and Medway Training.\r\n•\tsit the KMT entrance tests in Literacy and Numeracy.\r\n\r\nThe formal interview is approximately 50 minutes long.\r\n\r\nYou will be required to discuss a lesson plan you created prior to the interview to convey your classroom presence and your prior ability to plan lessons.\r\n\r\nYou will be given a conditional offer only if all members of the panel agree to the placement. However, should you impress at interview but not be offered a place, you will be given the opportunity for your application to be considered by other partner schools without the need to sit a second formal interview.","howSchoolPlacementsWork":"All applicants have the opportunity at application, to apply for the school of their choice. If appointed, that school becomes the trainee's \"home\" school and is responsible for the majority of the training; subject to the course requirements and quality assurance of the accrediting provider, Kent and Medway Training. The training year is split into three placements:\r\n\r\n•\tPlacement A is at your home school and runs from the beginning of the academic year until the end of January. You are in school for four days a week. Thursdays are your KMT academic days where you will have either Professional Studies, led by experienced practitioners or Subject Studies training, led by subject specialists.\r\n•\tPlacement B is at a contrasting school. For example, if your home school is a High School, you B-placement could be a Grammar School.\r\n\r\nWhere possible, your B-placement school will be discussed with you in advance and you will be placed in the local Medway or Maidstone area.\r\n\r\nThe placements runs from February to Easter where you continue to improve your teaching skills through teaching classes to school-led training sessions. Thursdays remain your KMT academic days where you continue with Professional Studies, led by experienced practitioners or Subject Studies training, led by subject specialists.\r\n\r\n•\tPlacement A2 is back at your home school where you stay from Easter until the completion of your course in June. You will be in school for the full 5-day week. Professional and Subjects studies are finished with just one further evening session preparing you for your Newly Qualified Teacher year.\r\nDuring this placement you will be finally assessed through both lesson observation and your completed portfolio to ensure that you have met the teaching standards in full. Our grades are then externally moderated and assuming all goes well, your Newly Qualified Teacher status is confirmed and celebrated at a local hub- centred Awards Evening.","personalQualities":"•\tStrong and dedicated professionals\r\n•\tResilient\r\n•\tProactive and creative\r\n•\tOpen to feedback and guidance\r\n•\tPassionate about developing pupil learning and well being\r\n•\tStrong in their subject knowledge\r\n•\tPositive in their communication skills\r\n•\tGenuinely aiming to become an outstanding practitioner\r\n•\tEnjoy working with children and young adults to enable them better\r\n        life opportunities\r\n","otherRequirements":"Before the course begins but not necessarily at application, you will need\r\n•\tat least 10 experience days in a secondary school or academy\r\n•\tat least 2 experience days in a primary school or academy\r\n•\tDBS check\r\n•\tHealth check declaration\r\nIt is useful to attend a school experience day before application so that you can get a feel for the chosen school and what it can offer as a training placement.\r\n","status":2,"createdAt":"2021-07-06T10:51:01.519Z","canSponsorStudentVisa":"no","cycle":"2024"}
