{"id":"17246585-3cec-4921-a735-82a6e04e6919","name":"Physics","code":"2DJQ","qualification":"qts","startDate":"2023-07-31T23:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"bf97cd0a-224c-43d3-a021-84143df13e8d","code":"F3","name":"Physics"}],"locations":[{"id":"9c21f527-0324-4129-a8e7-7a7b7ab20bf3","name":"NMAPS Head Office - various locations around our Hub network","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"c442d44a-4328-42dc-b564-61e5d2d9b3be","code":"1CH","name":"Wycombe High School"},"accreditedBody":{"id":"8fc9b0c3-acaf-447c-adb7-dd93bf530a8e","code":"2H8","name":"The National Mathematics and Physics SCITT"},"english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","aboutCourse":"This course is solely for applicants who have already made a successful application to the [Researchers in Schools (RiS) Programme](https://researchersinschools.org/).  \r\n\r\nThe RiS Programme offers a tailored route into teaching exclusively for PhD graduates. It is specifically designed to utilise their academic expertise to the benefit of pupils, schools and universities.\r\n\r\nThe programme is designed to run over three years, with the third year being optional. In their first year trainees will gain teaching experience with students aged 11-16 and sixth form. Participants achieving Qualified Teacher Status (QTS) at the end of their first year will go on to complete  their Newly Qualified Teacher (NQT) year in year two. \r\n\r\n[The National Mathematics and Physics SCITT (NMAPS)](http://www.nmapscitt.org.uk/), led by [Wycombe High School](https://www.whs.bucks.sch.uk/), provides the first year of training and awards RiS trainees QTS via this School Direct Salaried course.  \r\n\r\nDuring their first year in their placement schools, RiS trainees will be given a minimum of half a day of protected time each week to complete their [Research Leader in Education Award] (https://thebrilliantclub.org/researchers-in-schools/ris-applicants/rle/). \r\nThey will spend  one day per week in an [NMAPS Hub School](http://www.nmapscitt.org.uk/partnership-structure/) joining other SCITT trainees for Subject Knowledge and Professional Studies training, with the remaining time being spent in the classroom, building up teaching expertise through a structured programme of observation, advice and feedback, supported by an in-school subject mentor. ","interviewProcess":"Applicants who have been pre-selected by RiS will then be interviewed by NMAPS, either at one of our Hub Lead Schools, or a potential host placement school. \r\n\r\nWhere possible face-to-face interviews are preferred but, due to on-going issues with Coronavirus, may take place via Zoom. ","howSchoolPlacementsWork":"During August candidates will attend an Induction course with RiS. In addition to this and to prepare for their ITT year, all trainees are also required to attend the NMAPS three-day Induction Course (24-26 August 2021) at Headington School in Oxford.  \r\n\r\nTrainees will spend the majority of the year in their main placement school, which will be a non-selective state school, with a second placement in a contrasting state school. Trainees will be individually supported by a mentor in each school, who they will meet with weekly for support and to discuss progress. \r\n\r\nThe NMAPS programme allows trainee teachers to develop an understanding of their pupils and the education system in England today, with a variety of other short school experiences in, for example, a Pupil Referral Unit and Special School.  \r\n\r\nDuring the Spring Term we would expect trainees to be making good progress towards the Teachers' Standards and be on track to achieve QTS. Trainees will build an on-line portfolio of evidence to show the progress they have made, using our bespoke programme. \r\n\r\nOn successful completion of the training year, trainees are awarded QTS by NMAPS. Trainees can also opt to complete an on-line PGCE (Post Graduate Certificate in Education) with [The University of Buckingham](https://www.buckingham.ac.uk/), for a fee of £1,200.  \r\n\r\nThe programme also provides regular professional networking and social opportunities throughout the ITT year and beyond. Links with key professional associations, including The Institute of Physics, The Mathematical Association and the National Centre for Excellence in the Teaching of Mathematics (NCETM) will provide on-going high quality professional development.\r\n\r\nThe RiS programme continues into a second year and trainees remain in their main placement school. Whilst the NMAPS training course is completed in the first year, the relationship continues after the trainee gains QTS.  Former trainees continue to benefit from a range of alumni network meetings, events, career support, leadership development, coaching opportunities and professional association support. Masters opportunities beyond training are also a possibility. \r\n","personalQualities":"We are looking for ambitious trainee teachers who are passionate and enthusiastic about their subject with a desire to share that with young people of all abilities. Applicants should be confident and articulate communicators, who are keen to contribute to their subject team and the wider school community.\r\nPrevious school experience is not required, but applicants are advised to give details of all meaningful experience of working with young people. This may be school experience, but could also include any unpaid volunteering with, for example, a sports team, drama or youth club.\r\n","otherRequirements":"DBS Clearance and Occupational Health Check - all applicants will be required to undergo Disclosure Barring Service (DBS) and Enhanced Disclosure checks and an on-line Occupational Health Check. If you have lived overseas in the last 5 years additional checks may be required.\r\nEnglish Language proficiency requirements - applicants must demonstrate an excellent command of both written and spoken English.\r\nPlease visit our website for further details.\r\n","status":2,"createdAt":"2021-07-06T10:48:49.482Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"This is a salaried training post. Please refer to the [RiS website](https://researchersinschools.org/info-for-researchers/our-training-routes/the-salaried-route/) for further details. "}
