{"id":"88caddb9-14d3-4755-83bb-f9d13dc497e7","name":"English","code":"29VX","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3aed1aa8-ae46-4b68-92bb-a6cc20655c59","code":"Q3","name":"English"}],"locations":[{"id":"bff69605-23a5-4486-ae35-5ae32c384478","name":"Main Site","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"1794bba0-082c-48f9-beab-53738f7cf396","code":"1HM","name":"Whitley Bay Teacher Training"},"accreditedBody":{"id":"db2188d3-0047-44ee-92d2-64d1b5e1a939","code":"N21","name":"University of Newcastle Upon Tyne"},"profPost":"BO","degreeGrade":"0","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"We are willing to consider applicants who have a 2:2 who can demonstrate a real aptitude for teaching and learning.","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"The majority of your training will be based in school, although some time will be spent at Newcastle University, where part of professional studies aspect of the course will be delivered. \r\n\r\nOver the course of the School Direct training year, you will be placed in two schools where you will undertake the actual classroom practice.  These placements are chosen to offer you a high-quality, diverse training experience. From the beginning, you will be treated like a member of staff and will attend staff meetings and CPD training programmes in both training schools.\r\n\r\nIn each school, you will be allocated an experienced subject mentor who will oversee and monitor your progress and development. They will help introduce you to school life, give you support with lesson planning and preparation, and look at effective classroom practices. Furthermore, you will have weekly meetings with them to reflect on your teaching, with your mentor tailoring their support so that you have a training programme that meets your needs.\r\n\r\nDuring two teaching placements, your progress will be monitored and supported through weekly observations by your mentor or the staff within your department. In addition, you will receive observations from Whitley Bay’s School Direct Team, your school’s Professional Tutor and your University Tutor.\r\n\r\nTo further support you in becoming an outstanding practitioner, you will participate in a training programme with your School Direct peers.  Training will be delivered by Whitley Bay High School's training team and highly skilled teachers at our Partner Schools, and will cover areas such as: Safeguarding, Literacy, Meeting the needs of different learners, Questioning, Lesson Planning, Behaviour for Learning, Progress and Assessment for Learning, Stretching the most able and Preparing for Interview. In addition, you will receive rigorous support to develop your understanding of subject specific pedagogy.\r\n","interviewProcess":"Whitley Bay High is the lead school in our programme and we will co-ordinate the recruitment process. \r\n\r\nYou will be asked to prepare a ten-minute presentation on a topic relating to your subject, explaining how you would teach the lesson and make it engaging and challenging.  You will also meet with a subject specialist to discuss developments within your subject and your understanding of your subject within a school context.\r\n\r\nOur interviews are a rigorous and thorough process, designed to get the best match of applicant to the places available.\r\n\r\nAll offers to train with us are conditional. Conditions may include: a DBS; Fitness to Teach; as well as original documentary evidence of degree and GCSE qualifications. You may be required to complete a subject enhancement course (SKE) before your training begins. We also strongly recommend you spend time in school to gain insight into current educational organisations.\r\n","howSchoolPlacementsWork":"If you train with us, you will have two teaching placements in our Partnership of schools, which are conveniently located across the North Tyneside, Newcastle and Northumberland area. Given our locality, we are proud to offer a great diversity of age-ranges in our placement schools: we have First, Primary, Middle, Secondary and High Schools.  \r\n\r\nYour two placement schools are selected in order to provide you a unique opportunity to experience a diverse and varied range of teaching and learning opportunities and be immersed in schools with very different ethea.  Your previous experiences are also taken into account when allocating placement schools.  Regardless of where you are placed, highly experienced and inspirational practitioners will design a bespoke training programme, which will allow you to evolve into an outstanding and reflective teacher.\r\n\r\nApplicants must be aware that they may be placed in any of our excellent partner schools throughout the training year. We aim to provide a varied teaching experience in a range of different school contexts. All of our schools can be accessed via public transport. \r\n\r\nPlease visit https://www.whitleybayhighschool.org/teacher-training for the list of schools within our alliance. \r\n\r\nYou will spend a term in one school and one and a half terms in the other.  Secondary trainees will be trained for Key Stage 3 and 4 and you will also be offered Sixth Form experiences in order to develop your teaching skillset and employability.  During this time, you will also attend University for approximately one day a week.\r\n\r\n","personalQualities":"We are looking for dynamic, committed and ambitious trainees with a passion for teaching and learning.  You must have a desire to inspire young people and an ability to share and communicate your enthusiasm for your subject.  We would expect you to be well-organised, hard-working, empathetic, approachable and resilient. You need to be willing to evaluate your practice and be able to respond to feedback given.  \r\n\r\nIt is desirable that you will have experience of working with children in either a paid or voluntary capacity.  It would be advantageous if you have had some school experience.\r\n","otherRequirements":"It is desirable that you are able to tell us about recent experience in a relevant school setting.  Your references should be able to tell us about your skills, experience and the contribution you have made within a range of contexts for example: academic, business, educational.\r\n\r\n","status":1,"createdAt":"2021-07-06T10:53:24.078Z","updatedAt":"2021-07-23T12:02:11.322Z","canSponsorStudentVisa":"yes","cycle":"2024"}
