{"id":"e41cab4f-4bb8-4d72-a1d2-e5ff957b79c3","name":"Physical Education","code":"37WK","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"74d64a54-5e34-4590-b6c7-528dd0cf26fe","code":"C6","name":"Physical education"}],"locations":[{"id":"6163e40a-f7eb-44ac-a70b-d8d654872534","name":"Raynes Park High School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"c3d1bfaa-6145-4b53-a701-20a2651eee79","name":"St Mark's Church of England Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"16f9ba64-9168-4e74-b6de-8ee3ad20d7e4","name":"Ursuline High School Wimbledon","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"61878e05-5803-4a7c-986c-1ad0b48ffc87","code":"1ZO","name":"Teach Wimbledon"},"accreditedBody":{"id":"ef172d85-20e4-4aa2-96d0-9e3ae81f526d","code":"S64","name":"St Mary’s University, Twickenham"},"profPost":"BO","degreeGrade":"1","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Please note that Teach Wimbledon is able to accept GCSE equivalency tests through the following providers:\n\n* [A Star Equivalency](www.astarequivalency.co.uk)\n* [Equivalency Testing](www.equivalencytesting.com)","courseLength":"OneYear","feesUK":9750,"aboutCourse":"School Direct is a one-year route into teaching that offers you the opportunity to spend the majority of your time in the classroom from the very beginning, learning directly from experienced professionals. \r\n\r\nThe Physical Education teacher training programme is delivered in partnership with St Mary's University, who through lectures, workshops and assignments, provide the theoretical aspect of the programme, to support classroom practice. \r\n\r\nThe course will prepare you to teach all elements of Physical Education. You will learn about current developments in the teaching of this subject and its place within the curriculum. \r\n\r\nUpon successful completion of the course, you will be awarded with a PGCE, QTS and 60 credits at Masters level. \r\n\r\n","interviewProcess":"Should  you  meet  the  academic entry  requirements  for  the  course,  you  will  be  invited  to  attend  an interview with St Mary’s University. \r\n\r\nYou  will  then  be  invited  to  attend  a  second  interview  with  your  chosen  school,  should  you  be successful at this stage. You will also be asked to complete an online maths and English test prior to attending your interview. Your interview will generally consist of a teaching activity, panel interview and written task. ","howSchoolPlacementsWork":"When submitting your application to train to teach with Teach Wimbledon, you will be asked to select the school at which you wish to be placed in the first instance. You will spend the majority of your teacher training year at this school, known as your home school. \r\n\r\nYou will also have the opportunity to spend a period of time in a contrasting school, known as your away school. This will be arranged by Teach Wimbledon in the Autumn term.  \r\n\r\nAll schools at which trainees are placed are part of the Teach Wimbledon alliance and located within the London Borough of Merton, and should therefore be easily accessible. \r\n","personalQualities":"* Ability to uphold the Teachers’ Standards\r\n* Vision for teaching\r\n* Passion for subject\r\n* Strong speaking, reading and listening skills \r\n* Awareness of children’s physical, social, emotional and cognitive needs and to the attitudes and behaviours displayed by young people in school\r\n* Knowledge of current educational landscape\r\n* Commitment to continuing professional learning\r\n* Openness to advice, guidance and positive professional challenge\r\n* Resilience to meet the demands of the course\r\n* Ability to work independently and as part of a team \r\n* Professionalism, including organisation, punctuality, attendance \r\n* Commitment to equal opportunities\r\n* Relevant ICT skills","otherRequirements":"Please note that all offers are conditional and subject to the satisfactory outcome of a Disclosure and Barring  Service  (DBS)  and  health  check.  These  checks  will  be  completed  by  the  Higher  Education Institution  at  which  you  complete  your  teacher  training,  if  you  are  a  tuition  fee  trainee,  and  by  the school at which you complete your teacher training, if you are a salaried trainee.  ","status":1,"createdAt":"2021-07-06T10:54:33.679Z","updatedAt":"2021-10-04T07:03:57.513Z","canSponsorStudentVisa":"yes","cycle":"2024"}
