{"id":"c90a5f5c-2cca-4b73-b99d-13899e4861bc","name":"Primary","code":"AK29","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"other","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"f82dc5b1-8345-41c9-886c-e2ef9b649f66","name":"Exeter","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"81f8bc12-af45-49a9-a58f-164d3d725f27","code":"L10","name":"The London-Exeter Partnership"},"accreditedBody":{"id":"d41a1821-e35b-48eb-bf02-4842872b04a2","code":"E84","name":"University of Exeter"},"profPost":"PG","degreeGrade":"0","english":"1","maths":"2","science":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":19500,"financialSupport":"You may be eligible for a [loan while you study](https://getintoteaching.education.gov.uk/funding-my-teacher-training/tuition-fee-and-maintenance-loans).\r\nFind out about financial support if you’re from [outside the UK](https://getintoteaching.education.gov.uk/explore-my-options/overseas-graduates).\r\nFinancial support from the training provider\r\nFor information on Government loans and training bursaries, please visit the [Student Finance England](https://www.gov.uk/student-finance) and [Get into Teaching](https://getintoteaching.education.gov.uk/) websites.\r\nFor more information, please see our [Fees and finance webpages](https://www.exeter.ac.uk/teachertraining/apply/feesandfinance/).\r\n","aboutCourse":"We are looking for applicants with an interest in primary education who have the drive to become critically reflective teachers and change agents, and who are passionate and articulate in their vision and values for primary education.\r\nOur unique partnership enables applicants to learn both in Devon and in London. Students spend most of their first term studying at the University of Exeter, and then complete their teaching placements in highly successful primary schools in London.\r\nThe usual entry requirement for this course is a 2:1 or above in your first degree. Passes at GCSE in English, Mathematics and Science at Grade C/4. Please note that although the DfE requirement is a grade C/4, we will generally only consider applicants with a grade B/5 or above in Mathematics and English and a grade C/4 in Science.\r\nIn addition to the academic requirements listed, selection is based on performance at interview, a satisfactory fitness to teach assessment and a satisfactory DBS enhanced disclosure.\r\nAlthough not essential it would be an advantage to be able to reflect on any school-based experience or experience working with young people in another context at interview.\r\nThe ‘Qualifications’ section describes our standard offer. However, if you have a different academic background, equivalent to degree level, you are welcome to make an application through UCAS for consideration or contact our [PGCE Admissions team](https://www.exeter.ac.uk/teachertraining/contact/) for more information.\r\n\r\n","interviewProcess":"","howSchoolPlacementsWork":"We work with a variety of local primary schools across the exciting London  Borough of Tower Hamlets. There is also the opportunity to work with an ‘Outstanding’ special school.\r\nAll of the schools working with us are within Tower Hamlets and are very centrally located in London. Tower Hamlets is nationally recognised for its high standards and success in closing the attainment gap. All our schools are centres of innovation and ambition for all pupils. They all serve diverse communities in which schools and families work in close collaboration. \r\nYou will start at your designated 'home' school at the start of the academic year for a two week observational placement. There are two placements (one 'home school' and another primary placement) once the PGCE with Exeter has started.\r\n","personalQualities":"A genuine passion working with children and bringing teaching and learning to life is essential; as is providing the opportunity for children to develop their whole character through engaging and fun delivery of the curriculum.","otherRequirements":" ","status":1,"createdAt":"2021-07-06T10:54:01.182Z","updatedAt":"2021-09-28T09:00:59.904Z","canSponsorStudentVisa":"yes","cycle":"2024","applicationsOpenDateOther":"2021-10-30T00:00:00.000Z"}
