{"id":"f8747d83-4c23-4b89-b981-24e67cb14113","name":"Chemistry","code":"24KH","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"912d4fb4-761b-42e9-8dc6-e968b791ea4e","code":"F1","name":"Chemistry"}],"locations":[{"id":"fa9a3c3b-787c-44ad-86ee-64d56f1d680f","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"4f5080d8-c453-48d4-87b7-0bac79dce8ec","code":"1QK","name":"The Denbigh Alliance"},"accreditedBody":{"id":"eb4a38dd-1429-4c88-b2ee-a552369e4306","code":"1YK","name":"The Tommy Flowers SCITT Milton Keynes"},"profPost":"BO","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"Degree should be related to the subject you wish to teach.\n\nShould your degree not be in the subject for which you are applying to teach, you will require a minimum of a grade B at A level in that subject in order to meet the requirement for recommendation to a Subject Knowledge Enhancement course.","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feeDetails":"Our fees include the cost for both the Initial Teacher Training, leading to Qualified Teacher Status and the Post Graduate Certificate of Education (PGCE).","financialSupport":"Tuition fee loans\r\nYou can either pay for your fees out of private finance, or apply for a student loan from the Student Loans Company. \r\n\r\nMaintenance loans\r\nDepending on your personal financial circumstances, you may also be eligible for a maintenance loan to contribute towards your costs of living. This is means-tested and will be completely individualised to each applicant. This is paid termly, at the start of each term, by the Student Loans Company.\r\n\r\nSpecial circumstances\r\nThere are further avenues of funding available, such as Childcare Grants, Parents’ Learning Allowances or Disabled Students’ Allowances. Click here for a full list of the grants and loans available and the eligibility criteria. \r\n\r\nYour tuition fees and any other bursary or financial support depend on your status as a home, European Union (EU) or overseas student. All grants and bursaries are subject to conditions and you are not guaranteed funding, but you may be eligible for financial support, tuition fee loan and maintenance grant information. ","aboutCourse":"The Tommy Flowers SCITT secondary course leads to Qualified Teacher Status (QTS) and a Post-Graduate Certificate in Education (PGCE). You will train across the 11-16 age range with post 16 enhancement in our partnership schools, where you will learn from experienced practitioners, particularly your school mentor.\r\n\r\nFive days per week are spent on placement in our partnership schools. We run specialist TFSCITT training on a Monday afternoon and also a twilight session on a Thursday (4pm-6pm). At the training you will join the rest of your cohort for sessions developing strategies for teaching and learning. In grading the Tommy Flowers SCITT as ‘outstanding’, Ofsted described the training received by trainees as ‘exemplary’. Our curriculum is designed around six areas: \r\n* Pedagogy and how children learn \r\n* Behaviour management and setting high expectations\r\n* Adaptive teaching\r\n* Assessment of pupils\r\n* Professional behaviour, statutory responsibilities and wellbeing\r\n* Subject knowledge and curriculum\r\n\r\nThe curriculum is sequenced to progress your knowledge and understanding of teaching and is integrated through both your core training and school-based placements to provide consistency of approach. You will receive regular formative feedback in the way of observations, weekly mentor meetings, visits from Tommy Flowers SCITT staff along with informal conversations with colleagues at your school. By demonstrating that you have made satisfactory progress in the six curriculum areas, the Tommy Flowers SCITT will be able to award you QTS at the end of the course. 100% of our graduates have secured teaching positions upon completing the course.\r\n\r\nThis course is framed by a commitment to help you to develop into a graduate teacher who is reflective, creative, resourceful, independent, collaborative and resilient. It presumes you have the drive, organisation and commitment to undertake a course which is devised to develop your expertise in teaching and learning. \r\n\r\nYou can expect a wide range of support throughout the year. Your school mentor will be responsible for you on a daily basis and the mentors are supported in school by a nominated Professional Tutor. Tommy Flowers SCITT staff will provide pastoral, academic and professional support.\r\n\r\nThe PGCE is an academic qualification assessed through a group presentation on the topic of SEND and two further written assignments exploring the topics of behaviour management and how pupils learn or subject knowledge development. For more information, please visit our website (www.tommyflowersscitt.co.uk).\r\n\r\n","interviewProcess":"If you are selected for one of our interview days, you will be sent full information via email. The interview day is an opportunity for us to get to know you but also for you to find out more about us and the course.\r\n\r\nThe interview day includes the applicant undertaking the following:\r\n* 15 minute task with a group of 4 pupils\r\n* 5 minute presentation (the topic will be shared in advance)\r\n* An unseen written task\r\n* A selection of GCSE questions in your subject\r\n* A formal interview \r\nThere will also be a presentation from us which outlines our course.\r\n\r\n","howSchoolPlacementsWork":"Trainees have two contrasting placements, a base placement from 1st September to 30th June with a 7 week contrasting placement in the Spring term to allow you to teach in a different school and across different year groups. This enables you to experience a range of educational approaches, preparing you to work with the unique, dynamic and diverse communities Milton Keynes has to offer.\r\n\r\nOur secondary trainees teach across the 11-16 age range with some experience of teaching at KS5 (depending on the subject). You will spend five days per week in school and two afternoons training with the Tommy Flowers SCITT. We work with 14 partner schools across Milton Keynes and the surrounding area who share the same values, curriculum approach, high standards and commitment to partnership as us. Working in a close geographical area, our trainee teachers typically travel only a few miles from home to school.\r\n\r\nFrom day one, you will be regarded as a teacher. However, your teaching timetable will develop and grow to suit your own experience, pace and progress. Initially, you will observe teachers across your school so that you become familiar with the children and approach to teaching in your school. Gradually, you will build up your teaching so that you are lead teaching up to 6-8 hours a week before October half term. The proportion of lead teaching would then increase gradually each week until your timetable reaches approximately 16 hours per week.\r\n\r\n","personalQualities":"Applicants for our courses come from a diverse range of backgrounds and have a variety of prior experiences. Many applicants are recent or soon-to-be graduates from university, whilst others have been working in schools already, perhaps as teaching assistants, volunteers or office staff. For some applicants, they have already had a successful career in other industries and are looking for a career change, realising that teaching is rewarding and that they can make a significant difference to the lives of children.\r\n\r\nApplicants should be organised, reflective and professional, able to work with others and have strong subject knowledge.","otherRequirements":"A DBS check will be carried out after interview.\r\n\r\nIdeally, you should have 10 days’ experience in a secondary school. This could be voluntary work or employment, for example as a Teaching Assistant. It is good practice for this to be in place before you apply for a place on the course.\r\n\r\nENIC (formerly NARIC) certification of equivalency will be required if qualifications have been undertaken abroad. \r\n","status":1,"createdAt":"2021-07-06T10:49:15.499Z","updatedAt":"2021-09-27T12:12:04.929Z","canSponsorStudentVisa":"no","cycle":"2024"}
