{"id":"9ac3e830-9822-45d8-9a73-5034276f44b5","name":"Music","code":"2ZZN","qualification":"pgde_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"24311bef-8673-41fb-933c-53f887fb6976","code":"W3","name":"Music"}],"locations":[{"id":"70566c8e-b51a-453b-b926-50e25036d776","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"aa2902fe-fb2a-4c2b-80f4-d436b3239b8b","code":"K50","name":"King Edward’s Consortium"},"profPost":"BO","degreeGrade":"9","english":"2","maths":"2","acceptPendingGcse":"no","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"For English and maths, we only accept equivalency testing from [A* Teachers](https://astarequivalency.co.uk)\n\nFor English, as an alternative to the A* Teachers' test, candidates may present an IELTS Test Report Form dated within the last two years, with an overall score of 8.","courseLength":"OneYear","feesUK":9150,"feeDetails":"In addition to the course fee of £9,150, trainees on SCITT programmes will be required to pay £100 on acceptance of their place (this covers the cost of DBS and Health checks and is non-refundable).\r\n\r\nThe tuition fee of £9,150 is paid to the King Edward's Consortium in three instalments: 25% at the beginning of the autumn term; 25% at the beginning of the spring term; and 50% at the beginning of the summer term.\r\n\r\nYou can choose to pay your tuition fees up-front, or to take out a [tuition fee loan](https://www.gov.uk/student-finance) from Student Finance England. \r\n\r\n","aboutCourse":"The King Edward’s Consortium is rated the no.1 SCITT in the country in The Good Teacher Training Guide, 2017.  \r\n\r\nThis school-based training course is full-time. Trainees spend one day a week (Tuesday) at our training centre in Kings Heath and the other four working days in school.\r\n\r\nHow is the course structured?\r\n\r\n- Induction. All KEC trainees attend our two-day central induction programme and spend one or more days in their main school during the July before they join us.  This allows trainees to meet their peers, begin to engage with some key issues in teaching and familiarise themselves with the school department in which they will be based for the year;\r\n- Subject and Professional Trainers on each placement.  All trainees have weekly one-to-one tutorials with a subject specialist and regular meetings with their Professional Trainer to review their progress;\r\n- A school-based Professional Studies programme;\r\n- A central programme of Professional Studies on Tuesdays throughout the year at our high-quality Training Centre in Kings Heath.  All trainees are released by their schools to attend the morning session;\r\n- Fee-paying trainees have tutorial and library sessions to support PGDE (PGDipEd (QTS)) assignment writing on Tuesday afternoons while salaried trainees return to their schools;\r\n- Subject development days led by the KEC Subject Leader team;\r\n- An individual training plan built around your needs;\r\n- A gradual introduction to teaching, working alongside experienced teachers. The maximum number of hours trainees will be expected to teach is 12 hours. This is approximately 50% of a full-time, qualified teacher's timetable;\r\n- A carefully-selected second placement experience which complements your experience in your main school;\r\n- Visits to you in school by the Director of ITT and by your KEC Subject Leader;\r\n- Access to our central library and resources and loan of core texts for all trainees;\r\n- Extensive support with job applications and interviews;\r\n- Access to library facilities at the University of Birmingham for PGDE (PGDipEd (QTS)) trainees;\r\n- Support from a very close-knit ‘family’ of fellow trainees and trainers across our schools.  This lasts many trainees well-beyond the training year and supports them as they take up teaching posts and progress in their careers.\r\n","interviewProcess":"Successful applicants will be invited to a selection day at the King Edward's Consortium Training Centre. \r\n\r\nCandidates sit paper-based tests in numeracy and literacy and answer written questions relating to their chosen teaching subject.  The subject questions are sufficiently broad and general to allow all candidates with a background in the subject to tackle them with confidence.  Candidates are advised to look at GCSE and A Level specifications in their subject to familiarise themselves with the aspects of the subject normally studied in secondary schools.  \r\n\r\nCandidates then have an interview with the Director of Initial Teacher Training. \r\n\r\nOriginal certificates, proof of identity and proof of right to work/study must be brought to interview. \r\n\r\nIn addition to the paper-based tests, music applicants will be given a practical test. \r\n","howSchoolPlacementsWork":"The King Edward's Consortium is a partnership of 22 excellent, and very varied, secondary schools in the Birmingham and Solihull areas. The mixture of comprehensive, selective, mixed, single-sex, 11-16 and 11-18 schools in the partnership is a key strength.\r\n\r\nSo that trainees can be present in their school on the first day of the academic year, our programme starts on Monday 5 September 2022. \r\nThe programme finishes in mid-July.\r\n\r\nTrainees spend Tuesdays at the Consortium's training centre and the other four working days of the week in school.\r\n\r\nEach trainee is allocated a main placement school where they will spend most of the training year and a second placement school (placement for five weeks at the beginning of the spring term). Following a discussion at interview, the Director of ITT carefully selects and arranges placements taking into account the trainee's home address and travel arrangements as well as ensuring that they are placed in an excellent subject department. \r\n\r\nOn receipt of an offer from the King Edward's Consortium, successful candidates will also be offered a visit to the school that is likely to be their main placement school. This is not part of the assessment process but will give candidates a feel for where they will be training and also provides an opportunity to meet colleagues and pupils.\r\n\r\nAll trainees have the opportunity to teach A' Level (or equivalent) in at least one placement school. The Director also aims to give trainees a contrasting pair of placements across our very varied partnership of schools.\r\n\r\nWhilst we make every effort to take into account trainees' travel arrangements, we advise trainees not to live too far away from the Birmingham area. \r\n","personalQualities":"The King Edward's Consortium seeks to recruit applicants who:\r\n\r\n- have a passion for their subject;\r\n- are able to work effectively with young people;\r\n- are confident, motivated and well-organised;\r\n- can work constructively with other people in a team;\r\n- are self-aware and open to learning;\r\n- are able to communicate in accurate, confident written and spoken Standard English;\r\n- reveal insights into teaching and learning;\r\n- express a long-term commitment to teaching as a career;\r\n- wish to take up teaching employment in England  at the end of the programme.\r\n","otherRequirements":"All King Edward's Consortium schools are committed to safeguarding and promoting the welfare of children and young people and we expect all trainee teachers to share this commitment. Successful applicants will be subject to an enhanced DBS check. \r\n\r\nSuccessful applicants will also be required to take a health check to confirm their fitness to teach.\r\n\r\nSatisfactory [references](https://www.teachkec.org.uk/Apply/Entry-Requirements/). ","status":1,"createdAt":"2021-07-06T10:52:57.205Z","updatedAt":"2021-09-21T19:01:25.335Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
