{"id":"684589f0-42af-4985-857a-6aefbbb790e8","name":"Primary","code":"2CRX","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"23a0d0c5-e0d7-40b4-8e08-7f99a0be1d53","name":"Newlands Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"cd9d55cd-21ea-49f4-add3-96c1cbe1bae0","name":"Pluckley Church of England Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"f0817b2c-cdcd-48b3-a9d4-abef9992e2bf","name":"St. Paulinus CofE Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"71027bc2-18ca-402e-b81a-b35ffe145042","name":"Ore Village Primary Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"f1251998-75db-448f-926a-31e9a8319445","name":"East Wickham Primary Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"3bd64489-2643-4521-b75c-b17e30fee4ee","name":"Drapers Mills Primary Academy & Little Millers Nursery","isPublished":"Y","status":"R","vacancies":"F"},{"id":"8757a1c9-f97b-46df-a674-539f334bdb5e","name":"St. Paul's Cray CE Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"9c19d047-e2cc-43b9-b216-437976927a3c","name":"Old Bexley CofE Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"b1cb0ce9-6134-469e-acfe-f260e8d90b3f","name":"Hillsgrove Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"1487009a-b9ae-4ef6-9872-6178328f528c","name":"Lower Halstow Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"235b7c75-c8b8-4f2d-aaab-7935b651cd81","name":"Pebsham Primary Academy","isPublished":"N","status":"S","vacancies":"F"},{"id":"a008d396-e9d5-4ca5-a186-392f34d01d3a","name":"The Bewbush Academy","isPublished":"N","status":"S","vacancies":"F"},{"id":"345e3a9b-3f73-4b7f-a9f2-bd7b34980a7f","name":"Castilion Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"8fa6b4c4-effe-4fa0-8a0d-e3fcd6a52bbb","name":"Gray's Farm Primary Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"bc807063-d6bc-457d-8b74-5f9671dbe061","name":"Horton Kirby C of E Primary School","isPublished":"N","status":"S","vacancies":"F"},{"id":"44822747-342b-49b6-9f3c-31262b453cc1","name":"Belvedere Junior School","isPublished":"N","status":"S","vacancies":"F"},{"id":"bd28102b-d7af-4896-afc5-7a35ea085adc","name":"Smarden Primary School","isPublished":"N","status":"S","vacancies":"F"},{"id":"7a53a160-a1b3-46ea-a6e8-ebd6135d4a09","name":"Holy Trinity Lamorbey Church of England Primary School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"1b2e3a7d-f712-48ff-b866-4a49733b8ab0","code":"K13","name":"TKAT SCITT"},"profPost":"BO","degreeGrade":"1","english":"1","maths":"1","science":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We accept equivalences from the following organisations:\n\n* Equivalency Testing\n* A Star\n* Birmingham City University (BCU) Equivalency testing\n\nPlease note that the candidate has to meet all costs for equivalency tests.","courseLength":"OneYear","feesUK":7250,"feeDetails":"We offer two pathways leading to different qualifications. Fees for each pathway are as follows:- \r\n\r\n* Qualified Teacher Status (QTS) only - £7,250\r\n\r\nor\r\n\r\n* QTS with accreditation for Post- Graduate Certificate in Education \r\n   (PGCE) with 60 Masters Credits - £9,250\r\n\r\nBoth costs of these pathways are met by the trainee, although they may be eligible for a student loan via the Student Finance England (SFE). \r\n\r\nPrimary does not attract a government bursary.\r\n\r\n\r\n","aboutCourse":"Our programme prepares our trainees to be excellent teachers to enable them to deliver high quality, purposeful and inclusive learning experiences, inspiring a love of learning and successful outcomes.\r\n\r\nThis is achieved through:\r\n\r\n* A school-based programme where trainees work alongside expert colleagues four days a week.\r\n\r\n* Trainees develop their knowledge and understanding of teaching through a weekly Curriculum and Professional Studies (CPS) day delivered at a partner school, the Atkins Centre (Sidcup, DA14 5AA), or through live online learning.\r\n\r\n* All training is underpinned by current high-quality evidence, informed practice and research. \r\n\r\n* The Curriculum and Professional Studies programme combines a pedagogical approach to learning with practical strategies for use in the classroom.\r\n\r\n* Trainees will gain experience from practising teachers as well as specialist speakers in behaviour management, special educational needs and health and well-being, vocal and body language training and equality in education.\r\n\r\n* A two-week induction programme which provides every trainee with the knowledge and skill-base to prepare them for their placement schools, where they will observe expert colleagues in preparation for teaching.\r\n\r\n* Dedicated mentor support throughout the programme with weekly observations and mentor meetings where targets are set to support a trainee’s development in line with SCITT curriculum.\r\n\r\n* Primary subject and curriculum knowledge support from expert practitioners.\r\n\r\n* Experience and understanding of the key stages on either side of the training programme.\r\n\r\n* Supporting trainee teachers to develop strategies that will support their wellbeing and resilience and enable them to meet the professional challenges in their initial years of teaching.\r\n\r\n* Evidence of progress. The course is designed to help trainees demonstrate they have met the curriculum through planning, preparation and assessment of pupils. The programme is assessed through continual course work; there are no final exams.\r\n","interviewProcess":"Candidates take part in a selection and recruitment process designed to assess their suitability to train to teach. \r\n\r\nThe aim of the interview process is for candidates to demonstrate why they have chosen teaching as a career, demonstrate their subject knowledge and allow us to see their potential to work in the classroom setting.\r\n\r\nIf successful, candidates will be made a conditional offer of a place on the TKAT SCITT programme, subject to all course requirements being met.\r\n\r\nCandidates will be invited to attend an interview. This will either be held virtually online or face-to-face.\r\n\r\nCandidates will be asked to plan a lesson which will be discussed during the interview and to prepare a short presenation based on the topic provided.\r\n\r\nCandidates will also be given a maths and written task to complete.\r\n\r\nFull details will be set out in the candidate's interview offer letter.\r\n\r\n\r\n","howSchoolPlacementsWork":"Applicants apply for their preferred school (A) placement where they will spend the majority of their training year. \r\n\r\nTrainees are required to complete a second (B) placement as part of training. \r\n\r\nThe second placement (B) will be for six weeks in a contrasting setting. This enables us to ensure that we offer trainees a breadth of experience in their training year. Every effort is taken to place trainees in a school geographically convenient for them, without compromising their training needs.\r\n\r\nOur programme is full-time (term time only). Trainees spend four days a week in school and one day a week taking part in curriculum and professional studies at a partner school, the Atkins Centre (Sidcup, DA14 5AA) or via live online sessions. \r\n\r\nTrainees have the option of gaining a Distance Learning Postgraduate Certificate in Education (DLPGCE) through Leeds Beckett University. This is a distance learning programme which enhances the theoretical and research understanding of teaching and learning. \r\n\r\n\r\n","personalQualities":"We are seeking well-qualified graduates who have a passion for learning and a commitment to helping children be the best that they can be.\r\n\r\nCandidates will need to demonstrate a depth of understanding in their subject knowledge and have the ability and the willingness to develop curriculum and pedagogical knowledge appropriate to the age and phase of the pupils they will be teaching.\r\n\r\nCandidates will need to demonstrate their intellectual and academic capabilities to prove that they can meet the requirements of the teaching role.\r\n","otherRequirements":"* Disclosure Barring Service (DBS) Enhanced clearance;\r\n* A minimum of two satisfactory references;\r\n* Recommended as medically fit to teach.\r\n\r\n(TKAT SCITT meet the cost of the Enhanced DBS, however, if an overseas check is necessary, the additional cost will be met by \r\nthe trainee).\r\n\r\nTKAT is committed to safeguarding and promoting the welfare of our students, and expects all staff, trainees and volunteers to share this commitment.  Conditional offers will be subject to the full Safer Recruitment process, including an Enhanced Disclosure and Barring Service Check.\r\n","status":1,"createdAt":"2021-07-06T10:53:21.654Z","updatedAt":"2021-10-05T11:17:32.778Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
