{"id":"3789bcd4-0e78-4ded-b588-9b57f59ec40e","name":"Modern Languages (Spanish with German)","code":"RX4C","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"ce8523ef-9236-4cd9-b260-d826c7a521b3","code":"ML","name":"Modern Languages"},{"id":"e34fd2a3-a32e-44e9-aea1-666badf3ac03","code":"22","name":"Spanish"},{"id":"fbb00c08-2dbc-4f26-adb3-3b23afba18c1","code":"17","name":"German"}],"locations":[{"id":"52d63954-6cf1-435e-8a5d-b6b0e68414a8","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"992b9d4a-bdcf-44e8-9296-fb1fe3bb3315","code":"B78","name":"University of Bristol"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We will accept equivalency tests but only from certain providers. Please contact us for more details.","courseLength":"OneYear","feesUK":9250,"feesInternational":21100,"feeDetails":"Fees for EU students will be £21100","financialSupport":"You may be eligible for a bursary. Visit the ‘Get into teaching’ website to find out more: \r\n\r\nBursaries and Scholarships\r\n\r\nYou don’t have to apply for a bursary - if you’re eligible, you’ll automatically start receiving it once you begin your course. Find out about [eligibility] (https://getintoteaching.education.gov.uk/funding-my-teacher-training/bursaries-and-scholarships-for-teacher-training) and [how you’ll be paid](https://getintoteaching.education.gov.uk/funding-and-salary/overview/how-you-will-be-paid).\r\n\r\nYou may also be eligible for a [loan while you study](https://getintoteaching.education.gov.uk/funding-my-teacher-training/tuition-fee-and-maintenance-loans) - note that you'll have to apply for [undergraduate student finance](https://www.gov.uk/student-finance).  \r\n\r\nFind out about financial support if you’re from [outside the UK](https://getintoteaching.education.gov.uk/explore-my-options/overseas-graduates).  \r\n\r\n\r\nIn addition to teacher-training bursaries, the University of Bristol offers a small contribution to travel expenses during placements.\r\n\r\nWe have a dedicated department who can offer support and guidance on finances throughout your training year. Further information on additional sources of financial support can be found here: [Financial support](http://www.bristol.ac.uk/fees-funding/postgraduate/pgce/)","aboutCourse":"The MFL PGCE course at Bristol offers a challenging and exciting experience which will equip you to become a highly skilled and research-aware languages teacher.  The course is structured in a way which enables you to build confidence and expertise through a combination of university input and placement experience. Our students enter the water gradually – there is no ‘cliff edge’ experience!  \r\n\r\n\r\nBecause of a large cohort size and the availability of specialist tutors for each of the main languages offered (French, Spanish and German), we are able to offer MFL students a wide range of opportunities to prepare them effectively for their future lives as teachers of MFL. MFL specific content is delivered by the MFL tutors and by guest speakers who are often practising teachers in our partnership schools. In the autumn term a wide range of subject specific areas are covered, including:  \r\n \r\n\r\n* the national curriculum,  \r\n\r\n* the requirements of GCSE and A level examinations \r\n\r\n* presenting new language \r\n\r\n* teaching grammar \r\n\r\n* adaptive teaching \r\n\r\n* using the target language in the classroom.  \r\n  \r\nFor a number of these topics, 90-minute lectures are followed by language specific workshops, often run in the student’s main language. In the summer term the emphasis is on encouraging students to experiment and go ‘out of the box’ with sessions on topics such as film making and drama. \r\n\r\nMany students come to us with one main language and one which is weaker. We prioritise subject knowledge development throughout the course, asking students to track progress and set targets in their languages with the help of a working document known as a ‘subject knowledge log’. Initial targets are often set on the basis of an oral assessment carried out on the first day at university. Throughout the students’ time at university there are dedicated peer teaching sessions for language development in which students coach each other. Every year we have a number of Italian specialists on the course who deliver a GCSE course – those who wish to do so have the opportunity to sit an Italian GCSE at the end of the year, thereby gaining a useful additional qualification.  ","interviewProcess":"If the potential to be a good MFL teacher is evident in your application, we will invite you for an  online interview. Interviews take place every 3-4 weeks. You will be interviewed by one or two of the University MFL tutors and, where possible, a teacher mentor from a local school.   \r\n\r\nThe interview for the MFL course consists of 3 parts. Firstly, we ask candidates to undertake two practical tasks which are prepared in advance - teaching a 5-minute language lesson at beginner level and providing feedback on a piece of written work. Secondly, there is an interview lasting approximately 40 minutes; this includes some discussion in the language(s) offered, after which immediate feedback is given and specific recommendations made, such as enrolment on an SKE course.  Thirdly, candidates are asked to complete a further written task in the language(s) offered which is submitted to the interviewing teacher by 5pm on the day of the interview.  ","howSchoolPlacementsWork":"Our stable and well-established Partnership compromises approximately 65 schools. Some are in the City of Bristol itself, and others are typically within a day’s commute of Bristol (around one hour travelling) - in North Somerset, South Gloucestershire, Bath and North East Somerset as well as a small number in Gloucestershire, Wiltshire and Somerset. We work with some schools in South Wales (e.g., Chepstow). The Partnership comprises a diverse range of schools and we are therefore able to offer opportunities to experience different contexts across the year, for example including schools with higher numbers of BAME and/or EAL pupils. Where appropriate, we are also able to offer experience in a special school.  \r\n\r\n  \r\n\r\nYou will be placed in a minimum of two schools and when making placement decisions we take account of where you live as well as doing our best to accommodate personal circumstances. We know our Partnership schools well, however, and our priority is to place you in schools where your needs will be met, where you will be well-supported and have the opportunity to thrive. The majority of student teachers are required to travel for around one hour for at least one placement. \r\n\r\n  \r\n\r\nOur programme comprises three distinct phases. During the Induction Phase (Autumn Term), you will complete a short teaching placement (5 weeks). During the Assimilation Phase (Spring Term) you will complete your main placement (typically 12 weeks) in a second school. During the Extension Phase (Summer Term), you will complete a final, shorter placement (5 weeks). Typically, this is based in the main placement school, but can often involve tailored experiences in other schools, gaining additional experience such as teaching pupils with EAL, focusing on Key Stage 5 teaching or experience in a special school. Whilst the majority of our Partnership schools teach pupils 11-18, some teach 11-16 or 16-19. Therefore, a priority when selecting placement schools is to ensure that everyone has experience of teaching across the age ranges including A level/BTEC classes. ","personalQualities":"We look for applicants with passion and who want to inspire the next generation. The PGCE is demanding but we’ll support you to become a confident and successful qualified teacher. \r\nAs our aim is for you to thrive and become a confident and successful teacher; we look for:  \r\n* good subject skills \r\n* good understanding of the secondary curriculum \r\n* awareness of current effective teaching and learning in your subject \r\n* interest and awareness of what working with young people involves \r\n* commitment to the state sector \r\n* communication skills \r\n* critical analysis \r\n* good organisation \r\n* reflection \r\n* resilience ","otherRequirements":"In addition to the academic entry requirements, all applicants will be subject to suitability checks. This includes a full enhanced disclosure and barring check for child workforce, as well as clearance by our Occupational Health department. \r\n\r\nIf there are any concerns with either of the above, applicants will be referred to the University’s suitability panel. \r\n\r\nAs well as the statutory requirements, we also refer potential applicants to our competence standards, which are available on our website: \r\n[School of Education Application guidance]\r\n(https://www.bristol.ac.uk/education/study/initial-teacher-education/application-guidance/)","status":1,"createdAt":"2021-07-06T10:47:27.546Z","updatedAt":"2021-09-21T13:06:53.956Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
