{"id":"51757446-18bc-4407-ba12-2a9d135a321d","name":"English","code":"Q3X1","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3aed1aa8-ae46-4b68-92bb-a6cc20655c59","code":"Q3","name":"English"}],"locations":[{"id":"52d63954-6cf1-435e-8a5d-b6b0e68414a8","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"992b9d4a-bdcf-44e8-9296-fb1fe3bb3315","code":"B78","name":"University of Bristol"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We will accept equivalency tests but only from certain providers. Please contact us for more details.","courseLength":"OneYear","feesUK":9250,"feesInternational":21100,"feeDetails":"Fees for EU students will be £21100","financialSupport":"You may be eligible for a bursary. Visit the ‘Get into teaching’ website to find out more: \r\n\r\nBursaries and Scholarships\r\n\r\nYou don’t have to apply for a bursary - if you’re eligible, you’ll automatically start receiving it once you begin your course. Find out about [eligibility] (https://getintoteaching.education.gov.uk/funding-my-teacher-training/bursaries-and-scholarships-for-teacher-training) and [how you’ll be paid](https://getintoteaching.education.gov.uk/funding-and-salary/overview/how-you-will-be-paid).\r\n\r\nYou may also be eligible for a [loan while you study](https://getintoteaching.education.gov.uk/funding-my-teacher-training/tuition-fee-and-maintenance-loans) - note that you'll have to apply for [undergraduate student finance](https://www.gov.uk/student-finance).  \r\n\r\nFind out about financial support if you’re from [outside the UK](https://getintoteaching.education.gov.uk/explore-my-options/overseas-graduates).  \r\n\r\n\r\nIn addition to teacher-training bursaries, the University of Bristol offers a small contribution to travel expenses during placements.\r\n\r\nWe have a dedicated department who can offer support and guidance on finances throughout your training year. Further information on additional sources of financial support can be found here: [Financial support](http://www.bristol.ac.uk/fees-funding/postgraduate/pgce/)","aboutCourse":"English is a creative, arts-based subject to which the study of language – in all its forms – is essential. We aim to provide you with the knowledge and skills you need to become an innovative and flexible teacher whose pupils enjoy their learning and make progress. You will:  \r\n\r\n* celebrate the power and potential of literature, language, drama and multimodal texts; \r\n\r\n* secure an understanding of literacy, focusing on how children learn to speak, listen, read and write;  \r\n\r\n* be prepared to implement the National Curriculum for English and the relevant examination specifications for GCSE and A-Level.  \r\n\r\nUniversity sessions combine research-based teaching with practical classroom strategies from the outset. You will be involved in a broad range of intellectually challenging activities - including working with professional Shakespearean actors, engaging in writing workshops, and capitalising on technology in the classroom - and then be encouraged to apply these ideas in your classroom whilst on placement in a minimum of two different schools.  \r\n\r\nYou will work closely with an English University tutor (UT) throughout the year, which ensures someone is always on hand for bespoke advice and support. You will have at least five tutorials, focusing on anything from your subject knowledge development to your classroom practice to your wellbeing, and your UT will visit you in school to observe you teach. You will also be well-supported by an Associate Tutor (mentor) in school. Former PGCE student teachers have described their UT and mentors as ‘consistently brilliant’, ‘highly supportive’ and ‘inspirational’.  \r\n\r\nThere are four research-based assignments spread throughout the year. The two Educational and Professional Studies (EPS) assignments focus on inclusion in the curriculum and a school-based theme of your choice. The two English assignments ask you to design, deliver and reflect on a unit of work; and then to follow your own interests – previous student teachers have examined topics including decolonising the English curriculum, active approaches to teaching Shakespeare, and the application of cognitive science strategies in English.  \r\n\r\nTo support your development as a reflective and reflexive practitioner, you will keep a weekly Reflective Journal in a format of your choice. You will also contribute to our annual anthology of young adult literature reviews and submit a piece of creative writing for our course anthology. You would be welcome to join the local Teachers as Writers group, run by the course leader, and so work alongside local English teachers.  ","interviewProcess":"If the potential to be a good English teacher is evident in your application, we will invite to an online interview. Interviews take place every 3-4 weeks. The interview consists of two separate Teams meetings, each led by a different English tutor; where possible, a teacher mentor from a local school will also be involved.  \r\n\r\nOne Teams meeting is a group interview, where you will discuss the role of the English teacher, based on your reading and observations. This will be followed by a timed written commentary on an unseen poem. The second Teams meeting is with a single English tutor and will include a reflection on your subject expertise and your prior experience, and assessment and discussion of a piece of student’s work. There will be plenty of opportunities for you to find out more about the course and ask questions. ","howSchoolPlacementsWork":"Our stable and well-established Partnership compromises approximately 65 schools. Some are in the City of Bristol itself, and others are typically within a day’s commute of Bristol (around one hour travelling) - in North Somerset, South Gloucestershire, Bath and North East Somerset as well as a small number in Gloucestershire, Wiltshire and Somerset. We work with some schools in South Wales (e.g., Chepstow). The Partnership comprises a diverse range of schools and we are therefore able to offer opportunities to experience different contexts across the year, for example including schools with higher numbers of BAME and/or EAL pupils. Where appropriate, we are also able to offer experience in a special school.  \r\n\r\n  \r\n\r\nYou will be placed in a minimum of two schools and when making placement decisions we take account of where you live as well as doing our best to accommodate personal circumstances. We know our Partnership schools well, however, and our priority is to place you in schools where your needs will be met, where you will be well-supported and have the opportunity to thrive. The majority of student teachers are required to travel for around one hour for at least one placement. \r\n\r\n  \r\n\r\nOur programme comprises three distinct phases. During the Induction Phase (Autumn Term), you will complete a short teaching placement (5 weeks). During the Assimilation Phase (Spring Term) you will complete your main placement (typically 12 weeks) in a second school. During the Extension Phase (Summer Term), you will complete a final, shorter placement (5 weeks). Typically, this is based in the main placement school, but can often involve tailored experiences in other schools, gaining additional experience such as teaching pupils with EAL, focusing on Key Stage 5 teaching or experience in a special school. Whilst the majority of our Partnership schools teach pupils 11-18, some teach 11-16 or 16-19. Therefore, a priority when selecting placement schools is to ensure that everyone has experience of teaching across the age ranges including A level/BTEC classes. ","personalQualities":"We look for applicants with passion and who want to inspire the next generation. The PGCE is demanding but we’ll support you to become a confident and successful qualified teacher. \r\nAs our aim is for you to thrive and become a confident and successful teacher; we look for:  \r\n* good subject skills \r\n* good understanding of the secondary curriculum \r\n* awareness of current effective teaching and learning in your subject \r\n* interest and awareness of what working with young people involves \r\n* commitment to the state sector \r\n* communication skills \r\n* critical analysis \r\n* good organisation \r\n* reflection \r\n* resilience ","otherRequirements":"In addition to the academic entry requirements, all applicants will be subject to suitability checks. This includes a full enhanced disclosure and barring check for child workforce, as well as clearance by our Occupational Health department. \r\n\r\nIf there any concerns with either of the above, applicants will be referred to the University’s suitability panel. ","status":1,"createdAt":"2021-07-06T10:47:27.298Z","updatedAt":"2021-09-21T14:33:18.656Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
