{"id":"65c864b5-4109-4451-a315-8886892c2d5c","name":"Religious Education","code":"V6X1","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"724b5d16-28dd-4431-bc17-ea4be4daedc4","code":"V6","name":"Religious education"}],"locations":[{"id":"52d63954-6cf1-435e-8a5d-b6b0e68414a8","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"992b9d4a-bdcf-44e8-9296-fb1fe3bb3315","code":"B78","name":"University of Bristol"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We will accept equivalency tests but only from certain providers. Please contact us for more details.","courseLength":"OneYear","feesUK":9250,"feesInternational":21100,"feeDetails":"Fees for EU students will be £21100","financialSupport":"You may be eligible for a bursary. Visit the ‘Get into teaching’ website to find out more: \r\n\r\nBursaries and Scholarships\r\n\r\nYou don’t have to apply for a bursary - if you’re eligible, you’ll automatically start receiving it once you begin your course. Find out about [eligibility] (https://getintoteaching.education.gov.uk/funding-my-teacher-training/bursaries-and-scholarships-for-teacher-training) and [how you’ll be paid](https://getintoteaching.education.gov.uk/funding-and-salary/overview/how-you-will-be-paid).\r\n\r\nYou may also be eligible for a [loan while you study](https://getintoteaching.education.gov.uk/funding-my-teacher-training/tuition-fee-and-maintenance-loans) - note that you'll have to apply for [undergraduate student finance](https://www.gov.uk/student-finance).  \r\n\r\nFind out about financial support if you’re from [outside the UK](https://getintoteaching.education.gov.uk/explore-my-options/overseas-graduates).  \r\n\r\n\r\nIn addition to teacher-training bursaries, the University of Bristol offers a small contribution to travel expenses during placements.\r\n\r\nWe have a dedicated department who can offer support and guidance on finances throughout your training year. Further information on additional sources of financial support can be found here: [Financial support](http://www.bristol.ac.uk/fees-funding/postgraduate/pgce/)","aboutCourse":"Why train to teach religious education (RE) and which course will help me to become the RE teacher I want to be?   \r\n\r\nThese are two key questions; the first will you decide but the second will be yourself and our partnership. Together we can help you to become an outstanding RE teacher who will engage and challenge future students through stimulating and thought-provoking lessons.   \r\n\r\nReligious education is the subject where teachers and students engage in some of the most challenging questions, making sense of life and the issues raised from religious, ethical, philosophical and non-religious viewpoints.  \r\n\r\nThe University of Bristol RE PGCE provides opportunities to debate and explore the subject within the PGCE group, with specialist teachers or members of local religious and non-religious groups, as well as opportunities to visit centres of faith and places of interest. In addition, you will receive excellent and varied practical experience to develop your teaching skills, access to expert practitioners both in the University and during teaching placements. Here at Bristol, you will be supported by a very experienced subject specialist tutor, a national figure at the cutting edge of research and practice and will work with outstanding teachers from within the partnership.   \r\n\r\nYou will know that your RE course is held in the highest regard nationally; in 2021, all student teachers were successful in gaining a job in teaching and external scrutiny confirmed the quality of the programme (RE External Examiner’s Report 2021). You will be part of, experience and contribute to a vibrant and exciting introduction to teaching religious education. ","interviewProcess":"If the potential to be a good RE teacher is evident in your application, we will invite you an interview of 45 minutes in an online interview. Interviews take place every 3-4 weeks and we typically invite up 4-5 applicants at any one session, although you will have an individual time allocated. You will be interviewed by the University RE tutor and, where possible, a teacher mentor from a local school. The interview is subject-specific in nature, and you will be asked to do the following:  \r\n\r\n * Prepare the following and bring them to interview: a photograph and/or article from a newspaper showing how religion features in the news  \r\n\r\n* Prepare suggestions, on no more than one sheet of A4, as to how the issue might be referred to during an RE lesson  \r\n\r\n* A piece of written work that will be submitted after the individual interview ","howSchoolPlacementsWork":"Our stable and well-established Partnership compromises approximately 65 schools. Some are in the City of Bristol itself, and others are typically within a day’s commute of Bristol (around one hour travelling) - in North Somerset, South Gloucestershire, Bath and North East Somerset as well as a small number in Gloucestershire, Wiltshire and Somerset. We work with some schools in South Wales (e.g., Chepstow). The Partnership comprises a diverse range of schools and we are therefore able to offer opportunities to experience different contexts across the year, for example including schools with higher numbers of BAME and/or EAL pupils. Where appropriate, we are also able to offer experience in a special school.  \r\n\r\n  \r\n\r\nYou will be placed in a minimum of two schools and when making placement decisions we take account of where you live as well as doing our best to accommodate personal circumstances. We know our Partnership schools well, however, and our priority is to place you in schools where your needs will be met, where you will be well-supported and have the opportunity to thrive. The majority of student teachers are required to travel for around one hour for at least one placement. \r\n\r\n  \r\n\r\nOur programme comprises three distinct phases. During the Induction Phase (Autumn Term), you will complete a short teaching placement (5 weeks). During the Assimilation Phase (Spring Term) you will complete your main placement (typically 12 weeks) in a second school. During the Extension Phase (Summer Term), you will complete a final, shorter placement (5 weeks). Typically, this is based in the main placement school, but can often involve tailored experiences in other schools, gaining additional experience such as teaching pupils with EAL, focusing on Key Stage 5 teaching or experience in a special school. Whilst the majority of our Partnership schools teach pupils 11-18, some teach 11-16 or 16-19. Therefore, a priority when selecting placement schools is to ensure that everyone has experience of teaching across the age ranges including A level/BTEC classes. ","personalQualities":"We look for applicants with passion and who want to inspire the next generation. The PGCE is demanding but we’ll support you to become a confident and successful qualified teacher. \r\nAs our aim is for you to thrive and become a confident and successful teacher; we look for:  \r\n* good subject skills \r\n* good understanding of the secondary curriculum \r\n* awareness of current effective teaching and learning in your subject \r\n* interest and awareness of what working with young people involves \r\n* commitment to the state sector \r\n* communication skills \r\n* critical analysis \r\n* good organisation \r\n* reflection \r\n* resilience ","otherRequirements":"In addition to the academic entry requirements, all applicants will be subject to suitability checks. This includes a full enhanced disclosure and barring check for child workforce, as well as clearance by our Occupational Health department. \r\n\r\nIf there are any concerns with either of the above, applicants will be referred to the University’s suitability panel. \r\n\r\nAs well as the statutory requirements, we also refer potential applicants to our competence standards, which are available on our website: \r\n[School of Education Application guidance]\r\n(https://www.bristol.ac.uk/education/study/initial-teacher-education/application-guidance/)","status":1,"createdAt":"2021-07-06T10:47:27.727Z","updatedAt":"2021-09-21T10:06:11.200Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
