{"id":"6eaaceb9-9360-4229-aae6-e24270fa7269","name":"Mathematics","code":"G1X1","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"72345aa7-096c-488f-8649-085b8178cadb","code":"G1","name":"Mathematics"}],"locations":[{"id":"52d63954-6cf1-435e-8a5d-b6b0e68414a8","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"992b9d4a-bdcf-44e8-9296-fb1fe3bb3315","code":"B78","name":"University of Bristol"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We will accept equivalency tests but only from certain providers. Please contact us for more details.","courseLength":"OneYear","feesUK":9250,"feesInternational":21100,"feeDetails":"Fees for EU students will be £21100","financialSupport":"You may be eligible for a bursary. Visit the ‘Get into teaching’ website to find out more: \r\n\r\nBursaries and Scholarships\r\n\r\nYou don’t have to apply for a bursary - if you’re eligible, you’ll automatically start receiving it once you begin your course. Find out about [eligibility] (https://getintoteaching.education.gov.uk/funding-my-teacher-training/bursaries-and-scholarships-for-teacher-training) and [how you’ll be paid](https://getintoteaching.education.gov.uk/funding-and-salary/overview/how-you-will-be-paid).\r\n\r\nYou may also be eligible for a [loan while you study](https://getintoteaching.education.gov.uk/funding-my-teacher-training/tuition-fee-and-maintenance-loans) - note that you'll have to apply for [undergraduate student finance](https://www.gov.uk/student-finance).  \r\n\r\nFind out about financial support if you’re from [outside the UK](https://getintoteaching.education.gov.uk/explore-my-options/overseas-graduates).  \r\n\r\n\r\nIn addition to teacher-training bursaries, the University of Bristol offers a small contribution to travel expenses during placements.\r\n\r\nWe have a dedicated department who can offer support and guidance on finances throughout your training year. Further information on additional sources of financial support can be found here: [Financial support](http://www.bristol.ac.uk/fees-funding/postgraduate/pgce/)","aboutCourse":"Recent years have seen many changes to the mathematics curriculum and we expect the next few years to be ones of embedding and consolidating new practices.\r\n\r\nThere is no one way to teach Mathematics. Schools use a variety of approaches and this programme will allow you to discover how best to use your talents to teach maths effectively.\r\n\r\nResearch and latest developments will drive your teacher education. We now understand more about how children learn mathematics and how different teaching methods are needed. You’ll develop mathematical skills through:\r\n\r\n* discussion\r\n\r\n* practical activity\r\n\r\n* problem-solving\r\n\r\n* open-ended investigative work\r\n\r\n* mental methods of calculation and algorithms\r\n\r\n* the use of calculators and computers.\r\n\r\nYou’ll learn how to use all of these methods and how a focus of maths as a means of communication can help your pupils master the structures of mathematics.\r\n\r\nYou’ll work with your fellow student teachers and supporting each other you will learn by:\r\n\r\n* working on issues of teaching and learning\r\n\r\n* doing maths together\r\n\r\n* developing and extending your knowledge of maths\r\n\r\n* looking at activities for the classroom\r\n\r\n* thinking about what pupils might experience\r\n\r\n* sharing technical skills, such as computer equipment and packages.\r\n\r\n* working in at least two different schools with different approaches, supported by an Associate Tutor (AT) in each school;\r\n\r\n* having day visits to schools;\r\n\r\n\r\nYou will find a range of age, work experience, technological skills, mathematical interests and mathematical expertise within the group. The programme aims to use the strengths of the group of student teachers in partnership with the PGCE tutors and the ATs.","interviewProcess":"If the potential to be a good teacher of mathematics is evident in your application, we will invite you for a half day interview session at the University or to an online interview. Interviews take place every 3-4 weeks and in line with our commitment to collaborative learning, for face-to-face interviews, we typically invite up to 6 applicants at any one time. You will be interviewed by at least one of the University mathematics tutors and possibly a teacher mentor from a local school. The interview is subject-specific in nature and the following activities will take place as part of the selection process.  \r\n\r\n * a conversation where you get to ask questions about the course and here about the PGCE year form the tutors  \r\n* an activity where you work on a mathematics problem - in groups for face-to-face interviews  \r\n* a reflective discussion / piece of writing about the task  \r\n* an individual interview ","howSchoolPlacementsWork":"Our stable and well-established Partnership compromises approximately 65 schools. Some are in the City of Bristol itself, and others are typically within a day’s commute of Bristol (around one hour travelling) - in North Somerset, South Gloucestershire, Bath and North East Somerset as well as a small number in Gloucestershire, Wiltshire and Somerset. We work with some schools in South Wales (e.g., Chepstow). The Partnership comprises a diverse range of schools and we are therefore able to offer opportunities to experience different contexts across the year, for example including schools with higher numbers of BAME and/or EAL pupils. Where appropriate, we are also able to offer experience in a special school.  \r\n\r\n  \r\n\r\nYou will be placed in a minimum of two schools and when making placement decisions we take account of where you live as well as doing our best to accommodate personal circumstances. We know our Partnership schools well, however, and our priority is to place you in schools where your needs will be met, where you will be well-supported and have the opportunity to thrive. The majority of student teachers are required to travel for around one hour for at least one placement. \r\n\r\n  \r\n\r\nOur programme comprises three distinct phases. During the Induction Phase (Autumn Term), you will complete a short teaching placement (5 weeks). During the Assimilation Phase (Spring Term) you will complete your main placement (typically 12 weeks) in a second school. During the Extension Phase (Summer Term), you will complete a final, shorter placement (5 weeks). Typically, this is based in the main placement school, but can often involve tailored experiences in other schools, gaining additional experience such as teaching pupils with EAL, focusing on Key Stage 5 teaching or experience in a special school. Whilst the majority of our Partnership schools teach pupils 11-18, some teach 11-16 or 16-19. Therefore, a priority when selecting placement schools is to ensure that everyone has experience of teaching across the age ranges including A level/BTEC classes. ","personalQualities":"We look for applicants with passion and who want to inspire the next generation. The PGCE is demanding but we’ll support you to become a confident and successful qualified teacher. \r\nAs our aim is for you to thrive and become a confident and successful teacher; we look for:  \r\n* good subject skills \r\n* good understanding of the secondary curriculum \r\n* awareness of current effective teaching and learning in your subject \r\n* interest and awareness of what working with young people involves \r\n* commitment to the state sector \r\n* communication skills \r\n* critical analysis \r\n* good organisation \r\n* reflection \r\n* resilience ","otherRequirements":"In addition to the academic entry requirements, all applicants will be subject to suitability checks. This includes a full enhanced disclosure and barring check for child workforce, as well as clearance by our Occupational Health department. \r\n\r\nIf there any concerns with either of the above, applicants will be referred to the University’s suitability panel. ","status":1,"createdAt":"2021-07-06T10:47:27.264Z","updatedAt":"2021-09-21T10:01:11.592Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
