{"id":"818d716b-c699-4d26-acbd-2e12033df6cb","name":"Physics","code":"F3X1","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"bf97cd0a-224c-43d3-a021-84143df13e8d","code":"F3","name":"Physics"}],"locations":[{"id":"52d63954-6cf1-435e-8a5d-b6b0e68414a8","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"992b9d4a-bdcf-44e8-9296-fb1fe3bb3315","code":"B78","name":"University of Bristol"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We will accept equivalency tests but only from certain providers. Please contact us for more details.","courseLength":"OneYear","feesUK":9250,"feesInternational":21100,"feeDetails":"Fees for EU students will be £21100","financialSupport":"You may be eligible for a bursary. Visit the ‘Get into teaching’ website to find out more: \r\n\r\nBursaries and Scholarships\r\n\r\nYou don’t have to apply for a bursary - if you’re eligible, you’ll automatically start receiving it once you begin your course. Find out about [eligibility] (https://getintoteaching.education.gov.uk/funding-my-teacher-training/bursaries-and-scholarships-for-teacher-training) and [how you’ll be paid](https://getintoteaching.education.gov.uk/funding-and-salary/overview/how-you-will-be-paid).\r\n\r\nYou may also be eligible for a [loan while you study](https://getintoteaching.education.gov.uk/funding-my-teacher-training/tuition-fee-and-maintenance-loans) - note that you'll have to apply for [undergraduate student finance](https://www.gov.uk/student-finance).  \r\n\r\nFind out about financial support if you’re from [outside the UK](https://getintoteaching.education.gov.uk/explore-my-options/overseas-graduates).  \r\n\r\n\r\nIn addition to teacher-training bursaries, the University of Bristol offers a small contribution to travel expenses during placements.\r\n\r\nWe have a dedicated department who can offer support and guidance on finances throughout your training year. Further information on additional sources of financial support can be found here: [Financial support](http://www.bristol.ac.uk/fees-funding/postgraduate/pgce/)","aboutCourse":"Physics is one of the PGCE Science subjects that we offer and there are normally around 15-18 student teachers studying each of those subjects. Within the cohort on the PGCE Science programme we find a   diversity of age, experience and background. Some student teachers come straight from undergraduate studies, while others are undergoing a move from successful roles in other professions. There is no one model for learning to teach Science, but all our student teachers do share an enthusiasm for physics, the other sciences, and learning.  \r\n\r\nOur workshops at the University are designed to help you develop their subject knowledge across all the aspects of physics that are relevant to the school curriculum. You will also be developing your knowledge of biology and chemistry, enabling you to teach across the sciences to GCSE level in school. Hence, collaborative learning and teaching with student teachers from the other programmes will be an important feature of your work, with sessions at the University providing the opportunity to work in specialist and mixed subject groups.  \r\n\r\nWorkshop sessions are practical and active in approach, based in our facilities in the School of Education and in “We The Curious”, an internationally renowned hands-on Science Centre in Bristol. Both venues have up-to-date school laboratories and excellent technical support. Underpinning much of the work will be the development of concepts and pedagogy in key curriculum areas such as forces, energy, and electricity. Tackling the challenging areas of physics is a key component of the programme, along with thinking about how to help young people engage with difficult topics.  \r\n\r\n We are aware that some physics applicants may have an interest in teaching mathematics. There is scope within the programme for linking up with the PGCE Mathematics programme to take part in school-based projects and to examine some of the key issues involved in effective teaching and learning of mathematics.  \r\n\r\n The PGCE Physics programme is demanding and challenging, but our student teachers enjoy and value it. Employment rates are very high with many of our physics student teachers securing jobs in schools within Bristol and the surrounding area. We also take a long-term view of teacher development; enabling trainees to find that science teacher in them that will deliver sustained good practice for a number of years. Excellent practitioners, leaders and innovators emerge from our PGCE Physics programme.","interviewProcess":"If the potential to be a good physics teacher is evident in your application, we will invite you for a half day interview session at the University, or to an online interview. Interviews take place every 3-4 weeks and in line with our commitment to collaborative learning, for face to face interviews, we typically invite up to 10 applicants at any one time. You will be interviewed by one of the University Science tutors and, where possible, a teacher mentor from a local school. \r\nThe interview is subject-specific in nature and the following activities will take place as part of the selection process: \r\n\r\n* you will receive detailed information about the content and ethos of the PGCE Physics and Science programme so that you can sense whether the course is right for you; \r\n* you will take part in a task that will explore conceptual understanding in a science topic and pupils’ misconceptions; \r\n* you will give a short presentation explaining how you will teach a particular physics topic; \r\n* have a short individual interview with the course tutor and school mentor; \r\n* carry out a written task that focuses on assessment of pupils’ work and subsequent planning. ","howSchoolPlacementsWork":"Our stable and well-established Partnership compromises approximately 65 schools. Some are in the City of Bristol itself, and others are typically within a day’s commute of Bristol (around one hour travelling) - in North Somerset, South Gloucestershire, Bath and North East Somerset as well as a small number in Gloucestershire, Wiltshire and Somerset. We work with some schools in South Wales (e.g., Chepstow). The Partnership comprises a diverse range of schools and we are therefore able to offer opportunities to experience different contexts across the year, for example including schools with higher numbers of BAME and/or EAL pupils. Where appropriate, we are also able to offer experience in a special school.  \r\n\r\n  \r\n\r\nYou will be placed in a minimum of two schools and when making placement decisions we take account of where you live as well as doing our best to accommodate personal circumstances. We know our Partnership schools well, however, and our priority is to place you in schools where your needs will be met, where you will be well-supported and have the opportunity to thrive. The majority of student teachers are required to travel for around one hour for at least one placement. \r\n\r\n  \r\n\r\nOur programme comprises three distinct phases. During the Induction Phase (Autumn Term), you will complete a short teaching placement (5 weeks). During the Assimilation Phase (Spring Term) you will complete your main placement (typically 12 weeks) in a second school. During the Extension Phase (Summer Term), you will complete a final, shorter placement (5 weeks). Typically, this is based in the main placement school, but can often involve tailored experiences in other schools, gaining additional experience such as teaching pupils with EAL, focusing on Key Stage 5 teaching or experience in a special school. Whilst the majority of our Partnership schools teach pupils 11-18, some teach 11-16 or 16-19. Therefore, a priority when selecting placement schools is to ensure that everyone has experience of teaching across the age ranges including A level/BTEC classes. ","personalQualities":"We look for applicants with passion and who want to inspire the next generation. The PGCE is demanding but we’ll support you to become a confident and successful qualified teacher. \r\nAs our aim is for you to thrive and become a confident and successful teacher; we look for:  \r\n* good subject skills \r\n* good understanding of the secondary curriculum \r\n* awareness of current effective teaching and learning in your subject \r\n* interest and awareness of what working with young people involves \r\n* commitment to the state sector \r\n* communication skills \r\n* critical analysis \r\n* good organisation \r\n* reflection \r\n* resilience ","otherRequirements":"In addition to the academic entry requirements, all applicants will be subject to suitability checks. This includes a full enhanced disclosure and barring check for child workforce, as well as clearance by our Occupational Health department. \r\n\r\nIf there are any concerns with either of the above, applicants will be referred to the University’s suitability panel. \r\n\r\nAs well as the statutory requirements, we also refer potential applicants to our competence standards, which are available on our website: \r\n[School of Education Application guidance]\r\n(https://www.bristol.ac.uk/education/study/initial-teacher-education/application-guidance/)","status":1,"createdAt":"2021-07-06T10:47:27.196Z","updatedAt":"2021-09-21T09:57:23.060Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
