{"id":"9b4e9b4d-f7ee-4501-a904-156993d83236","name":"Music","code":"W3X1","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"24311bef-8673-41fb-933c-53f887fb6976","code":"W3","name":"Music"}],"locations":[{"id":"52d63954-6cf1-435e-8a5d-b6b0e68414a8","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"992b9d4a-bdcf-44e8-9296-fb1fe3bb3315","code":"B78","name":"University of Bristol"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We will accept equivalency tests but only from certain providers. Please contact us for more details.","courseLength":"OneYear","feesUK":9250,"feesInternational":21100,"feeDetails":"Fees for EU students will be £21100","financialSupport":"You may be eligible for a bursary. Visit the ‘Get into teaching’ website to find out more: \r\n\r\nBursaries and Scholarships\r\n\r\nYou don’t have to apply for a bursary - if you’re eligible, you’ll automatically start receiving it once you begin your course. Find out about [eligibility] (https://getintoteaching.education.gov.uk/funding-my-teacher-training/bursaries-and-scholarships-for-teacher-training) and [how you’ll be paid](https://getintoteaching.education.gov.uk/funding-and-salary/overview/how-you-will-be-paid).\r\n\r\nYou may also be eligible for a [loan while you study](https://getintoteaching.education.gov.uk/funding-my-teacher-training/tuition-fee-and-maintenance-loans) - note that you'll have to apply for [undergraduate student finance](https://www.gov.uk/student-finance).  \r\n\r\nFind out about financial support if you’re from [outside the UK](https://getintoteaching.education.gov.uk/explore-my-options/overseas-graduates).  \r\n\r\n\r\nIn addition to teacher-training bursaries, the University of Bristol offers a small contribution to travel expenses during placements.\r\n\r\nWe have a dedicated department who can offer support and guidance on finances throughout your training year. Further information on additional sources of financial support can be found here: [Financial support](http://www.bristol.ac.uk/fees-funding/postgraduate/pgce/)","aboutCourse":"“Music for all” is at the heart of all work. \r\n\r\n  \r\n\r\nYou’ll explore the unique contribution that music can have to a child’s development. We will prepare you to work within the National Curriculum for Music and to teach exam specifications, including: GCSE, A-level and BTECH. You’ll learn strategies and methods to engage students and to stimulate creative music making. The programme will also develop your reflective and analytical skills, useful in teaching and beyond. All the work will draw on the latest research into learning and teaching, and music pedagogy.  \r\n\r\nOne key aspect is music technology. We provide workshops to develop your music ICT skills. These are designed for beginners and for those with considerable experience. You’ll undertake individual and group sequencing and recording work and learn how technology can support musical learning in classrooms. There are opportunities to learn how new technologies support students with special needs/ disabilities to make music.  \r\n \r\nThere are many other practical activities on offer including workshops on conducting, steel band, and singing. In the summer term, you’ll also have the opportunity to develop skills in teaching drama. In past years, students have also taken active roles in community ventures: previous events include a music hub instrumental workshop, and a concert for primary school children across Bristol.  \r\n \r\nIn the Summer there’s also an opportunity to spend time in special schools working with students with additional needs/disabilities, and/or to take part in the Green Apple scheme.  \r\n \r\nWe will support you throughout your teaching experiences. You have a personal university mentor and a specially trained mentor in school.  \r\n\r\nThe University of Bristol PGCE Music postgraduates are sought after for first appointments locally and nationally, and employment rates are very high: 100% for the last 3 years’ cohorts.  \r\n\r\n PGCE Music student teachers comment on the course:  \r\n\r\n“The constant support from my university tutors has been amazing - whenever and wherever you need it.”  \r\n\r\n “SEN/D in music discussions -understanding how to differentiate effectively for a range of needs - were really good.”  \r\n\r\n “The technology support was great – I’d never used Cubase, Logic before. Excellent help… and how to apply to teaching.”  \r\n\r\n “Tutorials on masters writing were really helpful giving me a nudge in the right direction!” ","interviewProcess":"If the potential to be a good Music teacher is evident in your application, we will invite you for a half day interview session at the University or to an online interview. Interviews take place every few months according to the number of applicants at the time. Your interview is, typically with a University PGCE Music tutor and, where possible, a school music mentor.  \r\n\r\nTo gain an overview of your musical skills, we test the following:  \r\n\r\n* Aural: 2-part melody dictation;  \r\n\r\n* Reading skills through piano prepared sight reading at about grade 4 standard;  \r\n\r\n* History of music, including Classical and Pop repertoire;  \r\n\r\n* Your ability to sing in tune: you teach a song of your choice, suitable for a year 7 class;  \r\n\r\n* Your performance skills on your first instrument (which can be voice).  \r\n\r\n We also ask you to send in, and discuss, a piece of tonal harmony. This must be your own work and not an arrangement.  \r\n\r\nAt interview it is helpful to have had experience within a state school music department, even if you have developed considerable teaching skills through community ventures or instrumental teaching. We ask you to write 1-2 pages (A4) on good practice in teaching Music in the classroom, and how students learn in Music lessons.  This can refer to the visit, if you have been able to make one. You send this in advance of your interview. ","howSchoolPlacementsWork":"Our stable and well-established Partnership compromises approximately 65 schools. Some are in the City of Bristol itself, and others are typically within a day’s commute of Bristol (around one hour travelling) - in North Somerset, South Gloucestershire, Bath and North East Somerset as well as a small number in Gloucestershire, Wiltshire and Somerset. We work with some schools in South Wales (e.g., Chepstow). The Partnership comprises a diverse range of schools and we are therefore able to offer opportunities to experience different contexts across the year, for example including schools with higher numbers of BAME and/or EAL pupils. Where appropriate, we are also able to offer experience in a special school.  \r\n\r\n  \r\n\r\nYou will be placed in a minimum of two schools and when making placement decisions we take account of where you live as well as doing our best to accommodate personal circumstances. We know our Partnership schools well, however, and our priority is to place you in schools where your needs will be met, where you will be well-supported and have the opportunity to thrive. The majority of student teachers are required to travel for around one hour for at least one placement. \r\n\r\n  \r\n\r\nOur programme comprises three distinct phases. During the Induction Phase (Autumn Term), you will complete a short teaching placement (5 weeks). During the Assimilation Phase (Spring Term) you will complete your main placement (typically 12 weeks) in a second school. During the Extension Phase (Summer Term), you will complete a final, shorter placement (5 weeks). Typically, this is based in the main placement school, but can often involve tailored experiences in other schools, gaining additional experience such as teaching pupils with EAL, focusing on Key Stage 5 teaching or experience in a special school. Whilst the majority of our Partnership schools teach pupils 11-18, some teach 11-16 or 16-19. Therefore, a priority when selecting placement schools is to ensure that everyone has experience of teaching across the age ranges including A level/BTEC classes. ","personalQualities":"We look for applicants with passion and who want to inspire the next generation. The PGCE is demanding but we’ll support you to become a confident and successful qualified teacher. \r\nAs our aim is for you to thrive and become a confident and successful teacher; we look for:  \r\n* good subject skills \r\n* good understanding of the secondary curriculum \r\n* awareness of current effective teaching and learning in your subject \r\n* interest and awareness of what working with young people involves \r\n* commitment to the state sector \r\n* communication skills \r\n* critical analysis \r\n* good organisation \r\n* reflection \r\n* resilience ","otherRequirements":"In addition to the academic entry requirements, all applicants will be subject to suitability checks. This includes a full enhanced disclosure and barring check for child workforce, as well as clearance by our Occupational Health department. \r\n\r\nIf there are any concerns with either of the above, applicants will be referred to the University’s suitability panel. \r\n\r\nAs well as the statutory requirements, we also refer potential applicants to our competence standards, which are available on our website: \r\n[School of Education Application guidance]\r\n(https://www.bristol.ac.uk/education/study/initial-teacher-education/application-guidance/)","status":1,"createdAt":"2021-07-06T10:47:27.760Z","updatedAt":"2021-09-21T10:05:09.769Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
