{"id":"b2629084-f090-4de2-b86d-400f2257efc6","name":"Geography","code":"F8X1","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3f47e67b-7fa5-4947-a5a0-74d528cd2a87","code":"F8","name":"Geography"}],"locations":[{"id":"52d63954-6cf1-435e-8a5d-b6b0e68414a8","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"992b9d4a-bdcf-44e8-9296-fb1fe3bb3315","code":"B78","name":"University of Bristol"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We will accept equivalency tests but only from certain providers. Please contact us for more details.","courseLength":"OneYear","feesUK":9250,"feesInternational":21100,"feeDetails":"Fees for EU students will be £21100","financialSupport":"You may be eligible for a bursary. Visit the ‘Get into teaching’ website to find out more: \r\n\r\nBursaries and Scholarships\r\n\r\nYou don’t have to apply for a bursary - if you’re eligible, you’ll automatically start receiving it once you begin your course. Find out about [eligibility] (https://getintoteaching.education.gov.uk/funding-my-teacher-training/bursaries-and-scholarships-for-teacher-training) and [how you’ll be paid](https://getintoteaching.education.gov.uk/funding-and-salary/overview/how-you-will-be-paid).\r\n\r\nYou may also be eligible for a [loan while you study](https://getintoteaching.education.gov.uk/funding-my-teacher-training/tuition-fee-and-maintenance-loans) - note that you'll have to apply for [undergraduate student finance](https://www.gov.uk/student-finance).  \r\n\r\nFind out about financial support if you’re from [outside the UK](https://getintoteaching.education.gov.uk/explore-my-options/overseas-graduates).  \r\n\r\n\r\nIn addition to teacher-training bursaries, the University of Bristol offers a small contribution to travel expenses during placements.\r\n\r\nWe have a dedicated department who can offer support and guidance on finances throughout your training year. Further information on additional sources of financial support can be found here: [Financial support](http://www.bristol.ac.uk/fees-funding/postgraduate/pgce/)","aboutCourse":"There are many visions of Geography debated by geographers and geography educators. During the programme you will be engaging with these debates and developing your own clear vision of Geography which is an essential element in establishing a sound basis of competence. The course is structured to support your progression in becoming a confident and creative geography teacher able to teach geography to 11-19 year olds. The programme will also prepare you for playing an active and innovative leadership role in a geography department.  \r\n\r\nOur university subject sessions draw upon research evidence and professional knowledge, critically examining ideas for engaging young people in a geography education that really matters. Specific topics covered in these sessions include planning over a range of scales from individual lessons to the curriculum; development of teaching resources and their use in helping pupils to ‘think geographically’; supporting progress of all learners; assessment at GCSE and A-level; consideration of the place and value of information technology and of fieldwork. There is a residential field trip in which you will engage fully with the practical aspects of running a school trip as well as further strengthening your subject knowledge base.   \r\n\r\nAlongside the subject sessions you will have guided lesson observations in schools underpinned by the variety of effective classroom practices modelled in the University subject sessions. There are many opportunities for collaborative working with experienced practitioners in schools and your fellow student teachers. Within the geography cohort there will be a varied range of expertise in aspects of subject knowledge and there are opportunities, across the year, to learn from each other. In the autumn term the focus is on becoming familiar with the major issues in geography education, how geography is taught in schools and gaining experience through structured observations and supported teaching. The spring term allows the use of these ‘building blocks’ within the extended school placement, enabling the deepening of your understanding of issues of learning, including: meeting the needs of different learners and developing a meaningful geography curriculum. During the summer term, there are opportunities for you to widen your pedagogical approach to teaching geography, build autonomy in your teaching and to research your practice in order to confidently continue your own professional development. You’ll consider how the geographical community can support you, be a source of inspiration, and career development as you enter your ECT year. ","interviewProcess":"If the potential to be a good geography teacher is evident in your application, we will invite you for an online interview. Interviews take place every 3-4 weeks.  You will be interviewed by at least one of the University geography tutors and possibly a teacher mentor from a local school. We will keep the online interview process to within a maximum of one hour.  The interview is subject-specific in nature and the following activities will take place as part of the selection process:  \r\n\r\n i) A written review of your subject knowledge related to the Geography National Curriculum, to be sent through prior to your interview; \r\nii) a presentation revolving around one aspect of geography, selected from a range offered, during which you will describe potential methods of teaching about this aspect in a secondary classroom; \r\niii) interview questions exploring your ideas on geography and education more broadly. \r\n\r\nFurther details of all three aspects of the interview process are sent through with the invitation to interview. ","howSchoolPlacementsWork":"Our stable and well-established Partnership compromises approximately 65 schools. Some are in the City of Bristol itself, and others are typically within a day’s commute of Bristol (around one hour travelling) - in North Somerset, South Gloucestershire, Bath and North East Somerset as well as a small number in Gloucestershire, Wiltshire and Somerset. We work with some schools in South Wales (e.g., Chepstow). The Partnership comprises a diverse range of schools and we are therefore able to offer opportunities to experience different contexts across the year, for example including schools with higher numbers of BAME and/or EAL pupils. Where appropriate, we are also able to offer experience in a special school.  \r\n \r\n\r\nYou will be placed in a minimum of two schools and when making placement decisions we take account of where you live as well as doing our best to accommodate personal circumstances. We know our Partnership schools well, however, and our priority is to place you in schools where your needs will be met, where you will be well-supported and have the opportunity to thrive. The majority of student teachers are required to travel for around one hour for at least one placement. \r\n\r\n  \r\n\r\nOur programme comprises three distinct phases. During the Induction Phase (Autumn Term), you will complete a short teaching placement (5 weeks). During the Assimilation Phase (Spring Term) you will complete your main placement (typically 12 weeks) in a second school. During the Extension Phase (Summer Term), you will complete a final, shorter placement (5 weeks). Typically, this is based in the main placement school, but can often involve tailored experiences in other schools, gaining additional experience such as teaching pupils with EAL, focusing on Key Stage 5 teaching or experience in a special school. Whilst the majority of our Partnership schools teach pupils 11-18, some teach 11-16 or 16-19. Therefore, a priority when selecting placement schools is to ensure that everyone has experience of teaching across the age ranges including A level/BTEC classes. ","personalQualities":"We look for applicants with passion and who want to inspire the next generation. The PGCE is demanding but we’ll support you to become a confident and successful qualified teacher. \r\nAs our aim is for you to thrive and become a confident and successful teacher; we look for:  \r\n* good subject skills \r\n* good understanding of the secondary curriculum \r\n* awareness of current effective teaching and learning in your subject \r\n* interest and awareness of what working with young people involves \r\n* commitment to the state sector \r\n* communication skills \r\n* critical analysis \r\n* good organisation \r\n* reflection \r\n* resilience ","otherRequirements":"In addition to the academic entry requirements, all applicants will be subject to suitability checks. This includes a full enhanced disclosure and barring check for child workforce, as well as clearance by our Occupational Health department. \r\n\r\nIf there are any concerns with either of the above, applicants will be referred to the University’s suitability panel. \r\n\r\nAs well as the statutory requirements, we also refer potential applicants to our competence standards, which are available on our website: \r\n[School of Education Application guidance]\r\n(https://www.bristol.ac.uk/education/study/initial-teacher-education/application-guidance/)","status":1,"createdAt":"2021-07-06T10:47:27.230Z","updatedAt":"2021-09-21T09:53:28.876Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
