{"id":"7c3a6e73-db1d-4b3e-ade4-2ddc77d03b0d","name":"Religious Education","code":"2C93","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"724b5d16-28dd-4431-bc17-ea4be4daedc4","code":"V6","name":"Religious education"}],"locations":[{"id":"3e804588-5911-4dd3-a7c1-5005208bbe50","name":"St Bede's & St Joseph's Catholic College","isPublished":"Y","status":"R","vacancies":"F"},{"id":"e8e92113-90d9-4bf2-8365-94a2d8609cea","name":"The Holy Family Catholic High School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"7812257d-7100-4b99-a51f-67b8f7afd57f","code":"13K","name":"Blessed Christopher Wharton Catholic Academy Trust"},"accreditedBody":{"id":"19a3446e-382d-4c14-83bb-a76563cef3c1","code":"L24","name":"Leeds Trinity University"},"profPost":"BO","degreeGrade":"2","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"These can be accessed through Leeds Trinity University's partners. The admissions office will supply more information once you have the offer of a place on our programme.","courseLength":"OneYear","feesUK":9250,"feesInternational":12500,"feeDetails":"You will not have to pay these fees upfront. Eligible UK and EU students can apply for a tuition fee loan to cover the cost of tuition fees from the government.","financialSupport":"The CSP can provide:\r\n\r\n* A laptop for your year of training (if you do not have your own device) \r\n* Re-imbursement of any parking costs incurred when training at Leeds Trinity University.","aboutCourse":"You will be teaching groups and classes across the school from Year 7 to Year 11. Depending on your subject background, you may also work with Year 12 & 13.\r\n\r\nYou will attend training at Leeds Trinity as well as receiving weekly bespoke on the job training from teachers and leaders in each placement school. This training will stand you in good stead to be the teacher you've always wanted to be. The training you receive is in addition to the CPD each school will offer you as part of their whole staff team.\r\n\r\nYou will be teaching groups and classes across the keystages and, sometimes, supporting KS5.\r\n\r\nAssessment is based on written assignments and teaching performance.\r\n\r\nFollowing qualification, you will most likely be offered an opportunity to teach in one of your placement schools and so begin the career of a lifetime!","interviewProcess":"Once your application is uploaded to UCAS, it is checked to ensure it meets our entry requirements (Maths & English GCSEs, Appropriate A-Levels and Degree study)\r\nIf it does meet our requirements, it will then be read by the Director of the Teaching School and Secondary School Lead Mentors, who will decide whether to put you through to interview. You will be given a Subject Knowledge Audit to complete and return.\r\nYou will be interviewed by 2 senior leaders and it will be in 3 parts - a short teaching session with a group of children / supporting a teacher within a lesson; a subject knowledge test (COVID dependent) and a formal interview.\r\n\r\n\r\n","howSchoolPlacementsWork":"You will have 2 placements, 1 in St Bede's & St Joseph's Catholic College (Bradford) and 1 in Holy Family Catholic High School (Keighley). Stage A placements are in 1 school, with Stage B placements taking place in the alternative school. You will generally be in your first school with all other School Direct trainees and again in your second school. This is to give you more opportunities to network and support each other.\r\n\r\nStage A begins with serial days in September moving on to being in school full-time, finishing in December. Stage B begins in January and runs through to May.\r\n\r\nFull support will be given to you at each placement with a department mentor, a school lead mentor, the Director of the CSPTSA and a link tutor from Leeds Trinity University.\r\n\r\nIf there is any impact on school placements as a result of Covid 19, we will inform you before the course starts.","personalQualities":"Training with the CSPTSA requires you to be:\r\n\r\n* Committed\r\n* Creative\r\n* Engaging\r\n* Confident\r\n* Hard-working\r\n* A people person\r\n* Resilient\r\n* Happy\r\n ","otherRequirements":"If your degree does not directly relate to the subject you have chosen, you will be required to take a SKE (Subject Knowledge Enhancement) course.\r\n\r\nWhilst not a requirement, we look for our applicants to have shown commitment to teaching by having experience of working with children in a range of contexts.","status":1,"createdAt":"2021-07-06T10:54:21.446Z","updatedAt":"2021-09-29T15:12:24.517Z","canSponsorStudentVisa":"yes","cycle":"2024"}
