{"id":"37c41147-73a7-460e-9557-cd4a04c8cfca","name":"Primary","code":"T792","qualification":"qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"3_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"1e70f2e4-6f9e-45d7-bb93-f614d52ba37b","name":"Brodetsky Jewish Primary School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"0a0bfbe7-e343-40aa-9837-8763b3f85561","code":"3W3","name":"The Northern Jewish School Direct Primary Cluster"},"accreditedBody":{"id":"3662bd08-5f53-40bf-8768-4aeb4e5243e4","code":"28T","name":"London School of Jewish Studies (LSJS)"},"degreeGrade":"9","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We accept equivalency tests from A* Equivalency https://astarequivalency.co.uk","courseLength":"OneYear","feesUK":7500,"feeDetails":"This is an unsalaried course where candidates will be required to pay fees. You may be eligible for financial support while you study, including bursaries, scholarships and loans.","aboutCourse":"Why train with us?\r\n\r\nThe Northern Jewish School Direct Primary Cluster is a partnership of Northern Jewish faith-based schools who represent a spectrum of Judaism. Our accredited provider is the Jewish Teacher Training Partnership.\r\n\r\nOur mission is to increase the number of teachers delivering high quality primary education in the Limmudei Kodesh (Jewish Studies) sector. We offer a unique opportunity for specialist teachers of Limmudei Kodesh (Jewish Studies) and general primary practitioners to develop their teaching and professional conduct within our schools.\r\n\r\nThrough our programme, candidates will experience training and placements in schools which have experience of providing high quality teacher training support. \r\n\r\nAbout this training programme\r\n\r\nA broad programme offering training in a variety of active methods to meet the core teacher standards. We offer a specialist Limmudei Kodesh (Jewish Studies) route.\r\n\r\nCandidates in the programme will be based in a class setting at the Lead Host school and expected to lead a class. Mentoring support will be provided as well as time for training related tasks. Throughout the year candidates will be observed by the host school and external accreditors.\r\n•\tThe first term will focus on how to teach plus an initial placement in another programme school.\r\n•\tThe second term focuses on the development of subject knowledge.\r\n•\tThe third term includes an alternative school placement and submission of a portfolio to evidence the Teachers’ Standards.\r\n\r\nOpportunities have been built into the programme for trainees to work collaboratively. This is an unsalaried course where the candidates will be required to pay fees. (They may be eligible for a student loan to support these fees.) \r\n\r\n\r\n\r\n","interviewProcess":"Candidates will be required to attend an interview at our Lead Host school.\r\n\r\nDuring the interview you will be required to teach a lesson, complete a short task and be interviewed by a panel.\r\n\r\nFollowing the interview, successful candidates will either be:\r\n•\tconfirmed as being hosted by their existing school or\r\n•\tcandidates not from a school will be matched with a host school.\r\n\r\nCandidates will be required to pass a test of their fundamental literacy and numeracy skills tests by the end of the course. This is likely to take place either at interview or early in the course.\r\n","howSchoolPlacementsWork":"\r\nWhere you will train\r\n\r\nYou will be placed in different schools during your training. You cannot pick which schools you want to be in, but we will endeavour to place you in schools within your locality.\r\n\r\nThere will be two school placements during our course:\r\n\r\nThe first is a placement in a school within the cluster. Placements are managed to adapt to the candidates’ travel and home situations and appropriate year group placements.\r\n\r\nThe second is a placement in a non-cluster school. This is arranged with a local school near to your host school.\r\n","personalQualities":"What we are looking for:\r\n\r\n•\tprior relevant experience\r\n•\tthe desire to work within the Jewish schools sector \r\n•\tpassionate about education\r\n•\tcommitted to continuous professional development \r\n•\table to work as part of a team and inspire children\r\n","otherRequirements":"All applicants will be subject to an enhanced DBS check, right to work in the UK and dependent on two suitable references.","status":1,"createdAt":"2021-07-06T10:55:29.903Z","updatedAt":"2021-10-08T09:22:27.930Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
