{"id":"9c8cd698-9ba8-4824-b7f1-e8e84917b338","name":"Primary with Mathematics","code":"3FBW","qualification":"qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"B","ageRange":"3_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"286cf12f-b3e3-41c5-9f33-2ff7807d2df0","code":"03","name":"Primary with mathematics"}],"locations":[{"id":"5464f982-da65-414c-8f6d-5106d4d80cc5","name":"Main Site","isPublished":"N","status":"N","vacancies":"B"}],"trainingProvider":{"id":"6892e176-1e27-44da-bcec-b80292833aa3","code":"1ZH","name":"Harlow Teacher Training Partnership"},"accreditedBody":{"id":"00782614-9301-40e4-8832-9a74cc1bbb07","code":"E75","name":"Essex Teacher Training"},"degreeGrade":"1","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We advise applicants to use one of the two equivalency testing providers listed below.\n\n[Astarteachers.co.uk] (https://www.astarteachers.co.uk/gcse-equivalencies-assistance/)\n\nOR\n\n[Equivalencytesting.com] (https://www.equivalencytesting.com/)","courseLength":"1 year Full-time or 2 years Part-time","aboutCourse":"Trainees will achieve QTS and have the option to buy-in to a PGCE Programme with Anglia Ruskin University.  The cost of this is £1300 and payable in 2 instalments.  Training is majority school-based with some centre-based training. Training is a blend of face to face and online and occurs at various locations across Essex so we take into account your home address to try to keep travelling time to a minimum.  You will receive training on the general aspects of successful teaching and training and specific training on teaching maths in primary.\r\n\r\nIn school you will work closely with a subject / phase specific mentor and the ITT co-ordinator, who will meet regularly with you to assist you with your training plan.   You will also have an external tutor who works for Essex Teacher Training, who will visit you in school 5 times in the year to check on your progress towards meeting the Teachers' Standards.\r\n\r\nThe PGCE is delivered locally in Essex by Anglia Ruskin University and comprises 2 assignments and related tasks, which are spread across the course of the year.\r\n \r\nTrainees will have access to an online e-portfolio system and online resources along with face to face training sessions.  These along with the excellent support from in-school mentors and tutors from Essex Teacher Training, will mean you will feel fully prepared for working in the classroom.  Your teaching load will start small and increase gradually as the year progresses.  The rate at which this increases will be decided by you and your tutors and take into account any prior experience. \r\n \r\nAssessment is via observations of your teaching, reflective pieces of writing and specific tasks relating to the different Teachers' Standards. \r\n\r\nIf you wish to train on the part-time School direct programme, this is typically for 3 days a week over the course of 2 years.  The programme is very similar to the one year programme in terms of support and delivery, the only difference being that you will be in school 2 days per week and attend training on 1 day a week.  The majority of centre-based training will take place in Year 1 and you may be enrolled on the Masters programme for the PGCE in Year 2. \r\n\r\nThere is an optional additional support programme available, offered a few times during the school year by the Lead School.\r\n","interviewProcess":"You will be invited to an initial interview with our accredited provider, which will include a short presentation about why you wish to teach, a written task and formal interview with a small panel of representatives from Essex Teacher Training.  If successful at Phase I, you will be invited to an interview in one of our partner schools.  This interview could include: an activity with pupils eg teaching part of a lesson, or taking a group activity; a pupil panel interview and a formal interview with a small panel of representatives from the school and wider School Direct partnership.  If successful at Phase II, you will be given a conditional offer of a place to train. ","howSchoolPlacementsWork":"Full-Time Trainees will complete training in two different schools during the course of the year.  Typically, trainees spend the autumn term in their host school and then go to a second placement school during the first part of the Spring term and then return to their host school for the remainder of the year.  Trainees attend one day a week training and are in school for the other 4 days a week. \r\n\r\nTrainees on a part-time course attend one day a week training and are in a host school for the other 2 days a week in their first year. In their second year they are in school for 3 days a week and undertake a second placement during the Spring term then return to their host school for the summer term.\r\n\r\nWe endeavour to keep travelling time to school to a minimum so we will take into account your home address when allocating a school.   \r\nThe programme covers the primary age ranges 3-7 or 5-11 and you will be teaching within one of these age ranges. \r\n\r\nCurrently we have 11 partner schools in Harlow and the surrounding areas of Essex and Hertfordshire","personalQualities":"We are looking for high quality graduates with a passion for learning who are committed to transforming the lives of young people through education. ","otherRequirements":"Harlow Teacher Training Partnership and it's schools are committed to safeguarding and promoting the welfare of children and expects all trainees to support this commitment. Successful applicants will be subject to recruitment checks including enhanced DBS, children’s barred list, prohibition order check and a reference check.\r\n\r\n\r\n","status":0,"createdAt":"2021-07-06T10:57:04.903Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"Salary is calculated using the unqualified teachers' pay scales\r\n\r\nCourse fee is £0.\r\nTrainees will have the opportunity to sign up for the PGCE with the University of Derby. This is available at a cost of £1950. Access to the PGCE is offered locally - you do not need to travel to Derby for this."}
