{"id":"115cbed4-608d-40b1-950b-68ef97baeeb2","name":"Social Sciences","code":"2P3Y","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"14_to_19","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"bd9a2174-f682-4f18-9551-498c2f7a48f9","code":"14","name":"Social sciences"}],"locations":[{"id":"12876939-63c7-4f03-beba-3a362226876d","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"7f11aaed-7c3e-42c5-af7a-023d33b45fa3","code":"U80","name":"UCL, University College London"},"profPost":"PG","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"Your degree must have at least 50% Sociology or Psychology content.\n\nPreferably, you should have an A Level in main teaching subject, plus an additional social science or humanities subject.","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Applicants who do not offer a GCSE in English Language or Mathematics may demonstrate an equivalent standard by completing a test via [Equivalency Testing] (https://www.equivalencytesting.com/) or [A Star Equivalency] (https://astarequivalency.co.uk/) and achieving at least a grade 5. For Mathematics, equivalency tests in Mathematics Foundation or Mathematics Higher with grade 5 are accepted. We do not accept \"applied\" or \"additional\" GCSE subjects. We do not accept BTEC, functional skills or Access qualifications in place of GCSES.","courseLength":"OneYear","feesUK":9250,"feesInternational":22200,"aboutCourse":"The Social Science PGCE prepares students to teach the social sciences across the 14-19 age range in a flexible and exciting way. Tutors are committed to promoting interactive teaching and learning in their sessions; a collaborative ethos is encouraged so that PGCE students share materials, resources and ideas. The programme specialises in sociology and psychology teaching, with some opportunities to teach in other related curriculum subjects.\r\n\r\nWe draw on research at the UCL Institute of Education (IOE) and elsewhere to inform social science teaching, encouraging student teachers to engage with recent debates, literature and policy in the field. Our underlying aim is to develop students as reflective and highly skilled teachers. We promote themes of social justice and anti-racism in the curriculum and look at ways that the social sciences can advocate for a more equal and just society.  As a 14-19 programme, there is an explicit focus on teaching examination classes in an interactive way. \r\n\r\nTutors on the Social Science PGCE are skilled classroom practitioners with extensive experience in secondary schools and colleges, as well as in leadership, educational research and consultancy.\r\n\r\nAt UCL Institute of Education, students participate in a range of lectures, workshops and seminars designed to enhance their development as a teacher. These interactive sessions cover how children learn, assessment, lesson planning, promoting positive behaviour and subject-specific matters.\r\n\r\nDuring their teaching practice placements, students benefit from our partnership with over 200 secondary schools and colleges in Greater London and beyond, which enables each of our students to become a skilled and confident teacher in their chosen subject specialism. \r\n\r\nThe PGCE consists of three core modules: two Master’s-level (level 7) modules, assessed through written assignments, and the Professional Practice module, assessed by the observation of practical teaching in placement schools. The programme is delivered via a programme of subject sessions, seminars, workshops, tutorials, 'Debates in Education' and directed study days at the IOE, as well as time spent in placements. Assessment is by practical teaching, assignments and portfolio tasks.\r\n                                                                                                                                                           \r\nStudents will spend most of their time (120 days) in schools working with sociology or psychology mentors who provide support through two school placements. Student Teachers will teach their main social science subject (usually sociology and sometimes psychology) at A level. At GCSE, most students teach sociology and some teach psychology. In some placements there are opportunities to contribute to relevant vocational qualifications and Key Stage 3 humanities.\r\n","interviewProcess":"Candidates whose applications meet the entry criteria will be invited to interview either online or at our central London location, depending on the subject applied to. At your interview day, you will take part in a combination of group and individual interviews with members of the programme team, and may also be asked to undertake written or presentation tasks, depending on your subject or phase. You will have the opportunity to ask any pertinent questions.\r\n","howSchoolPlacementsWork":"The IOE works with over 300 placement schools, chosen for their quality, excellence in supporting teacher education and to provide comprehensive geographical coverage across a wide range of phases, subjects and specialisms. You will undertake two placements of approximately equal length (circa 60 days) in different schools, each with a dedicated subject mentor to support your development, with both schools carefully matched to your needs in terms of location, stage and subject, taking any mobility needs into account. London has more 'good' and 'outstanding' schools than any other region in England and is a world leader in narrowing the gap between the performance of children from a range of different backgrounds. Training in London will provide you with an ideal platform to launch your career in teaching. \r\n\r\n","personalQualities":"Great teachers are as diverse as the communities they serve. We look for candidates who have a real enthusiasm for engaging with young people, who are as excited about the process of learning as they are about teaching, and who understand that they will learn as much from their students as their students will from them. Sound subject knowledge is important, as well as students’ ability to break down their knowledge and see it through the eyes of someone for whom it is new. We particularly welcome a commitment to improving the lives of individuals and communities through education.\r\n\r\n\r\n","otherRequirements":"For information about all of UCL's statutory requirements linked to Teacher Training programmes please visit our [website] (https://www.ucl.ac.uk/prospective-students/graduate/teacher-training/entry-requirements/).","status":1,"createdAt":"2021-07-06T10:56:40.689Z","updatedAt":"2021-09-29T20:54:42.983Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
