{"id":"20b51dcb-a34c-4f91-a28a-e9707017d23f","name":"Music","code":"2P3P","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"24311bef-8673-41fb-933c-53f887fb6976","code":"W3","name":"Music"}],"locations":[{"id":"12876939-63c7-4f03-beba-3a362226876d","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"7f11aaed-7c3e-42c5-af7a-023d33b45fa3","code":"U80","name":"UCL, University College London"},"profPost":"PG","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"Other degree subjects will be considered if a high level of musicianship can be displayed.","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Applicants who do not offer a GCSE in English Language or Mathematics may demonstrate an equivalent standard by completing a test via [Equivalency Testing] (https://www.equivalencytesting.com/) or [A Star Equivalency] (https://astarequivalency.co.uk/) and achieving at least a grade 5. For Mathematics, equivalency tests in Mathematics Foundation or Mathematics Higher with grade 5 are accepted. We do not accept \"applied\" or \"additional\" GCSE subjects. We do not accept BTEC, functional skills or Access qualifications in place of GCSES.","courseLength":"OneYear","feesUK":9250,"feesInternational":22200,"aboutCourse":"This course is designed to develop innovative and highly skilled teachers who wish to inspire young people through music. Throughout the secondary PGCE course, we aim to develop your music teaching expertise in a variety of contexts, equipping you to plan and teach engaging and meaningful musical experiences for your school students.\r\n \r\nThe course is designed to support musicians’ understanding of what it means to be a highly effective and successful music teacher, introducing you to the broad scope of music as a curriculum subject across the 11-19 age range. Our priority is to develop your teaching expertise in a variety of situations, by exploring a range of approaches to teaching music. We will offer a broad range of perspectives on the principles of syllabus design, evaluation and assessment in the field of music education.  We aim to develop your teaching through engaging practical music workshops, lectures, seminars and tutorials and through critical reflection of teaching and learning with expert musicians and music educators. You will also benefit from the expertise of music teacher mentors on your two school placements. \r\n\r\nOur central London location means that we are able to draw on the world-leading expertise of professional musicians and music educators. For example, in recent years a number of subject sessions have been arranged in collaboration with expert musicians from The London Sinfonietta, LSO St Luke's (Gamelan) and the Kingdom Choir (Gospel).\r\n\r\nWhile undertaking placements in our network of partner schools, students also benefit from the wealth of expertise on offer in London and the opportunity to teach music in a vibrant setting.\r\n\r\nThe Secondary PGCE consists of three core modules: two Master’s-level (level 7) modules, assessed through written assignments and practical musicianship tasks, and the Professional Practice module, which is assessed by the observation of practical teaching in placement schools\r\n\r\nThe programme is delivered via a programme of  subject lectures, seminars, workshops, tutorials, 'Debates in Education' and directed study days at the IOE, as well as time spent in placements. Assessment is by practical teaching, assignments and portfolio tasks.\r\n\r\nYou will spend 120 days across two school placements, working with IOE tutors and a school-based music teacher mentor to support your teaching and planning. We are fortunate to have a good choice of schools with whom we work, including many outstanding mentors within highly respected school music departments. The Professional Practice module is assessed throughout these school placements.\r\n","interviewProcess":"Candidates whose applications meet the entry criteria will be invited to interview either online or at our central London location, depending on the subject applied to. At your interview day, you will take part in a combination of group and individual interviews with members of the programme team, and may also be asked to undertake written or presentation tasks, depending on your subject or phase. You will have the opportunity to ask any pertinent questions.\r\n","howSchoolPlacementsWork":"The IOE works with over 300 placement schools, chosen for their quality, excellence in supporting teacher education and to provide comprehensive geographical coverage across a wide range of phases, subjects and specialisms. You will undertake two placements of approximately equal length (circa 60 days) in different schools, each with a dedicated subject mentor to support your development, with both schools carefully matched to your needs in terms of location, stage and subject, taking any mobility needs into account. London has more 'good' and 'outstanding' schools than any other region in England and is a world leader in narrowing the gap between the performance of children from a range of different backgrounds. Training in London will provide you with an ideal platform to launch your career in teaching. \r\n\r\n","personalQualities":"Great teachers are as diverse as the communities they serve. We look for candidates who have a real enthusiasm for engaging with young people, who are as excited about the process of learning as they are about teaching, and who understand that they will learn as much from their students as their students will from them. Sound subject knowledge is important, as well as students’ ability to break down their knowledge and see it through the eyes of someone for whom it is new. We particularly welcome a commitment to improving the lives of individuals and communities through education.\r\n\r\n\r\n","otherRequirements":"For information about all of UCL's statutory requirements linked to Teacher Training programmes please visit our [website] (https://www.ucl.ac.uk/prospective-students/graduate/teacher-training/entry-requirements/).","status":1,"createdAt":"2021-07-06T10:56:40.352Z","updatedAt":"2021-09-29T20:49:07.640Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
