{"id":"633148e0-ffd0-4dfd-a1d8-91de2beb42c2","name":"Business Education","code":"2P37","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"14_to_19","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"de6477b2-6027-48e6-b9f7-3206774705c2","code":"08","name":"Business studies"}],"locations":[{"id":"12876939-63c7-4f03-beba-3a362226876d","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"7f11aaed-7c3e-42c5-af7a-023d33b45fa3","code":"U80","name":"UCL, University College London"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Applicants who do not offer a GCSE in English Language or Mathematics may demonstrate an equivalent standard by completing a test via [Equivalency Testing] (https://www.equivalencytesting.com/) or [A Star Equivalency] (https://astarequivalency.co.uk/) and achieving at least a grade 5. For Mathematics, equivalency tests in Mathematics Foundation or Mathematics Higher with grade 5 are accepted. We do not accept \"applied\" or \"additional\" GCSE subjects. We do not accept BTEC, functional skills or Access qualifications in place of GCSES.","courseLength":"OneYear","feesUK":9250,"feesInternational":22200,"aboutCourse":"The Business Education PGCE prepares students to teach across the 14–19 age range, helping them develop the professional skills and attitudes to teach business in schools and colleges, as part of both academic (GCSE and A-Level) as well as practical courses such as BTEC, Work Skill and entrepreneurship.\r\n\r\nThe Secondary PGCE full-time programme is suited to those wishing to gain Qualified Teaching Status (QTS) and who have fulfilled the appropriate entry requirements.\r\n\r\nStudents will understand how business/economics is taught in schools, how pupils learn and make sense of the evolving and dynamic nature of the subjects. This is reflected in the range of business related courses that are now offered by schools, sixth forms and colleges, with the focus in some instances on entrepreneurship, work skills and new business technologies. \r\n\r\nStudents will be joining the largest Business PGCE programme in the country, allowing them to benefit from a team of tutors with a wide range of expertise of business, both inside and outside of the classroom. Students will also be able to develop strong peer networks, share ideas, resources and advice amongst your cohort of fellow students.\r\nTutors on the Secondary PGCE are skilled classroom practitioners with extensive experience in secondary schools and colleges. We aim to give students insight into the continuously evolving subjects of business/economics and its application to classroom teaching. Our collaborative approach ensures that students develop into thoughtful and highly skilled teachers who can work confidently and flexibly within the broad framework of the 14-19 curriculum. The IOE offers students the unique ability to visit places such as the London Stock Exchange and the Bank of England; we also have strong links with the Economics and Business Education Association (EBEA), as well as The Business Review.\r\n\r\nThe Secondary PGCE consists of three core modules: two Master’s-level (level 7) modules, which are assessed through written assignments (providing 60 Master’s credits), and the Professional Practice module, which is assessed by the observation of practical teaching in placement schools.\r\n\r\nStudents will spend most of their time (120 days) in schools, working with business studies mentors who provide support through the two school placements. We are fortunate to have a vast and experienced choice of schools with whom we work, with many outstanding mentors and strong business studies departments. The Professional Practice module is assessed through these placements, associated tasks and a portfolio.\r\n","interviewProcess":"Candidates whose applications meet the entry criteria will be invited to interview either online or at our central London location, depending on the subject applied to. At your interview day, you will take part in a combination of group and individual interviews with members of the programme team, and may also be asked to undertake written or presentation tasks, depending on your subject or phase. You will have the opportunity to ask any pertinent questions.\r\n\r\n\r\n","howSchoolPlacementsWork":"The IOE works with over 300 placement schools, chosen for their quality, excellence in supporting teacher education and to provide comprehensive geographical coverage across a wide range of phases, subjects and specialisms. You will undertake two placements of approximately equal length (circa 60 days) in different schools, each with a dedicated subject mentor to support your development, with both schools carefully matched to your needs in terms of location, stage and subject, taking any mobility needs into account. London has more 'good' and 'outstanding' schools than any other region in England and is a world leader in narrowing the gap between the performance of children from a range of different backgrounds. Training in London will provide you with an ideal platform to launch your career in teaching. \r\n","personalQualities":"Great teachers are as diverse as the communities they serve. We look for candidates who have a real enthusiasm for engaging with young people, who are as excited about the process of learning as they are about teaching, and who understand that they will learn as much from their students as their students will from them. Sound subject knowledge is important, as well as students’ ability to break down their knowledge and see it through the eyes of someone for whom it is new. We particularly welcome a commitment to improving the lives of individuals and communities through education.\r\n\r\n\r\n","otherRequirements":"For information about all UCL's statutory requirements linked to Teacher Training programmes please visit our [website] (https://www.ucl.ac.uk/prospective-students/graduate/teacher-training/entry-requirements/)","status":1,"createdAt":"2021-07-06T10:56:39.763Z","updatedAt":"2021-09-29T20:38:04.329Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
