{"id":"69a476cf-5604-4986-89bf-c55ef9a7548c","name":"Art and Design","code":"2P35","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"d461a678-3335-4ca2-9616-1dc479d31a49","code":"W1","name":"Art and design"}],"locations":[{"id":"12876939-63c7-4f03-beba-3a362226876d","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"7f11aaed-7c3e-42c5-af7a-023d33b45fa3","code":"U80","name":"UCL, University College London"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Applicants who do not offer a GCSE in English Language or Mathematics may demonstrate an equivalent standard by completing a test via [Equivalency Testing] (https://www.equivalencytesting.com/) or [A Star Equivalency] (https://astarequivalency.co.uk/) and achieving at least a grade 5. For Mathematics, equivalency tests in Mathematics Foundation or Mathematics Higher with grade 5 are accepted. We do not accept \"applied\" or \"additional\" GCSE subjects. We do not accept BTEC, functional skills or Access qualifications in place of GCSES.","courseLength":"OneYear","feesUK":9250,"feesInternational":22200,"aboutCourse":"The Art and Design PGCE is a challenging and forward-looking programme which prepares students to teach across the 11–19  age range, encouraging them to relate art, craft and design education to contemporary art practice. It has a strong reputation for promoting innovation in education theory, practice and policy.\r\n\r\nThis programme aims to inform and inspire, to challenge orthodoxies and encourage a freshness of vision. It provides support and guidance for learning and teaching in art and design, identifying strategies to motivate and engage pupils in making, discussing and evaluating visual and material culture.\r\n\r\nThe IOE provides excellent studio space and facilities for Art and Design, including a computing suite where students can learn how technology is used in art and design education. The programme also has strong links with galleries, museums and other sites for learning, which are recognised as an important resource for engaging students in cultural and social issues.\r\n\r\nThrough seminars and studio-based activities, students will study the concepts, processes and skills of art, craft and design, sharing their knowledge and understanding with other student teachers and consider how it relates to the secondary curriculum. Towards the end of the PGCE, students will build on their own practice by initiating a curriculum development project, culminating in the display of their own work in a final exhibition that represents their personal philosophy for art and design education.\r\n\r\nThe Secondary PGCE consists of three core modules: two Master’s-level (level 7) modules, which are assessed through both visual and written assignments, and the Professional Practice module, which is assessed by the observation of practical teaching in placement schools, associated tasks and a portfolio. The programme is delivered via a programme of  subject lectures, seminars, workshops, tutorials, 'Debates in Education'  and directed study days at the IOE, as well as time spent in placements. \r\nYou will spend two-thirds of your time (120 days) in schools, working with art and design mentors who support you through your two school placements. We are fortunate to have a good choice of schools with whom we work, with some outstanding mentors and strong art and design departments.\r\n","interviewProcess":"Candidates whose applications meet the entry criteria will be invited to interview either online or at our central London location, depending on the subject applied to. At your interview day, you will take part in a combination of group and individual interviews with members of the programme team, and may also be asked to undertake written or presentation tasks, depending on your subject or phase. You will have the opportunity to ask any pertinent questions.\r\n\r\n","howSchoolPlacementsWork":"The IOE works with over 300 placement schools, chosen for their quality, excellence in supporting teacher education and to provide comprehensive geographical coverage across a wide range of phases, subjects and specialisms. You will undertake two placements of approximately equal length (circa 60 days) in different schools, each with a dedicated subject mentor to support your development, with both schools carefully matched to your needs in terms of location, stage and subject, taking any mobility needs into account. London has more 'good' and 'outstanding' schools than any other region in England and is a world leader in narrowing the gap between the performance of children from a range of different backgrounds. Training in London will provide you with an ideal platform to launch your career in teaching. \r\n\r\n\r\n","personalQualities":"Great teachers are as diverse as the communities they serve. We look for candidates who have a real enthusiasm for engaging with young people, who are as excited about the process of learning as they are about teaching, and who understand that they will learn as much from their students as their students will from them. Sound subject knowledge is important, as well as students’ ability to break down their knowledge and see it through the eyes of someone for whom it is new. We particularly welcome a commitment to improving the lives of individuals and communities through education.\r\n\r\n","otherRequirements":"For information about all UCL's statutory requirements linked to Teacher Training programmes please visit our [website] (https://www.ucl.ac.uk/prospective-students/graduate/teacher-training/entry-requirements/).","status":1,"createdAt":"2021-07-06T10:56:39.697Z","updatedAt":"2021-09-29T20:36:32.612Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
