{"id":"f8d2cc95-919f-46bb-8975-549937bf3917","name":"Primary Mathematics Specialist","code":"2P3T","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"286cf12f-b3e3-41c5-9f33-2ff7807d2df0","code":"03","name":"Primary with mathematics"}],"locations":[{"id":"12876939-63c7-4f03-beba-3a362226876d","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"7f11aaed-7c3e-42c5-af7a-023d33b45fa3","code":"U80","name":"UCL, University College London"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"Applicants who do not offer a GCSE in English Language, Science or Mathematics may demonstrate an equivalent standard by completing a test via [Equivalency Testing] (https://www.equivalencytesting.com/)  or [A Star Equivalency] (https://astarequivalency.co.uk/) and achieving at least a grade 5. For Mathematics, equivalency tests in Mathematics Foundation or Mathematics Higher with grade 5 are accepted. We do not accept \"applied\" or \"additional\" GCSE subjects. We do not accept BTEC, Functional Skills or Access course qualifications in place of GCSEs.","courseLength":"OneYear","feesUK":9250,"feesInternational":22200,"aboutCourse":"This programme will prepare students for the award of Qualified Teacher Status (QTS) in line with the requirements of the Teachers’ Standards (2012). UCL works in partnership with around 200 primary schools, enabling students to fully prepare to be a primary teacher. Students learn to teach all the primary curriculum subjects, with an emphasis on mathematics as a subject in its own right as well as the link between mathematics and other subject areas.\r\n\r\nOur Primary PGCE develops effective, confident teachers whose classroom practice is informed by an advanced knowledge of educational theory, and who will continue to learn and reflect throughout their careers. The Primary PGCE prepares students to teach in an inclusive urban environment, provide professional development in all national curriculum subjects with a strong focus on mathematics and demonstrate the positive attitudes and behaviour expected from pupils. \r\n\r\nStudents on the Primary PGCE programme benefit enormously from the complementary skills and expertise of staff in partnership schools and at the UCL Institute of Education (IOE). The schools offer placements for teaching experience, and their teachers serve as tutors, mentors and joint assessors for our student teachers. IOE tutors have extensive experience of teaching, school management, inspection, research and consultancy.\r\n\r\nPrimary PGCE mathematics specialist students spend time across the Foundation stage, Key Stage 1 and 2 and they gain experience of teaching across Key Stage 1 and Key Stage 2. Students will learn to teach all the primary curriculum subjects, with mathematics as a speciality. \r\n\r\nThe programme consists of three core modules, two at Master’s-level (level 7) and one at Undergraduate-level (level 6) and three school placements. You will have to pass all three modules in order to be recommended for QTS.\r\n\r\nThe programme is delivered via a combination of lectures, workshops, tutorials and self-study. Students will be supported though a virtual learning environment and will participate in school placements. Assessment is through assignments, presentations, audits, feedback and tutorials. A final assessment is based on a range of evidence including observations of teaching, assignments, subject knowledge development, professional conduct and responses to self-study.\r\n\r\nAs part of the programme students will spend time on placements at primary schools, during which time their teaching experience will be supported by a tutor and mentor. Students will spend 120 days on placements.\r\n","interviewProcess":"Candidates whose applications meet the entry criteria will be invited to a remote interview. On your interview day, you will take part in a combination of group presentations,  discussions and individual interviews with members of the programme team and school partners. You will also be asked to undertake written tests in English and maths. You will have access to our Recruitment Website with information about the programme and will have the opportunity to ask questions.\r\n","howSchoolPlacementsWork":"Our 200+ placement schools are chosen for their quality, excellence in supporting teacher education and to provide comprehensive geographical. You will undertake two substantial placements in different schools and one short, self-selected placement (120 days in total) each with a dedicated school mentor.  Both schools will be carefully matched to your needs in terms of location, phase and taking any mobility or carer needs into account. London has more 'good' and 'outstanding' schools than any other region in England and is a world leader in narrowing the gap between the performance of children from a range of different backgrounds. Training in London will provide you with an ideal platform to launch your career in teaching.\r\n\r\n","personalQualities":"Great teachers are as diverse as the communities they serve. We look for candidates who have a real enthusiasm for engaging with young people, who are as excited about the process of learning as they are about teaching, and who understand that they will learn as much from their students as their students will from them. Sound subject knowledge is important, as well as students’ ability to break down their knowledge and see it through the eyes of someone for whom it is new. We particularly welcome a commitment to improving the lives of individuals and communities through education.\r\n\r\n\r\n","otherRequirements":"For information about all of UCL's statutory requirements linked to Teacher Training programmes please visit our [website] (https://www.ucl.ac.uk/prospective-students/graduate/teacher-training/entry-requirements/).","status":1,"createdAt":"2021-07-06T10:56:40.514Z","updatedAt":"2021-09-29T20:58:06.607Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
