{"id":"40d96702-7143-4bdd-b1d1-40e33df39a11","name":"Primary (Special Educational Needs)","code":"23BS","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_7","subjectLevel":"primary","isSend":"yes","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"30f88983-487c-412a-adcf-06a4c17693ed","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"},{"id":"629af618-b926-4f3d-ab1e-152f277c75e0","name":"SCITT- Dovelands School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"b545fea3-2858-462b-9584-dfdfe3acb99f","code":"194","name":"Ash Field Academy School Direct"},"accreditedBody":{"id":"6cbdc52f-08fc-47e9-b2ee-831ac14e2d98","code":"L35","name":"Leicester & Leicestershire SCITT"},"profPost":"PG","degreeGrade":"9","english":"1","maths":"1","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feeDetails":"This is an unsalaried course","aboutCourse":"This unsalaried OFSTED Outstanding School Direct course, leading to QTS and a full PGCE, is for trainee teachers with an interest in special education and SEND pupils.  Trainees undertaking this programme will benefit from attending all the Leicester and Leicestershire SCITT Early Primary training sessions (3-7 yr old pupils), alongside trainees on other SCITT and School Direct programmes.  Training includes a training module entitled ‘Meeting Individual Needs’ that takes place in Ash Field Academy, led by a Senior Leader from the school.  All trainees will have opportunities to work alongside pupils from the school and trainees on the Ash Field SEN route normally choose to take their final teaching placement in a special school.  \r\n \r\nTraining sessions take place in bespoke training rooms within schools.   Sessions are dynamic and engaging. Each of the 30-35 trainees very quickly become known as unique individuals so SCITT trainers and management can mould training and select placements to fit each individual’s needs, working exactly as skilled teachers do with their pupils.  This is a key strength of our programme, making the training personalised so that trainees are challenged and supported at every step in becoming the best teacher they can be.   \r\n\r\nThe SCITT trainers are all leading experts in their fields, charismatic and passionate about making a difference in children’s lives. They include excellent practitioners from partner schools and consultants who will ensure trainees will swiftly establish an understanding of early learning and developmental progression and how these are fundamental in teaching in the early years. \r\n\r\nCentral training includes days spent working with exceptional teachers and their pupils, in exceptional partnership schools, so all trainees are exposed to best practice in teaching creatively and effectively. We want future pupils to love learning and our future teachers to love teaching!  \r\n\r\nAsh Field SD trainees will also benefit from being full members of the University of Leicester.  An integral part of the courses is a full University of Leicester PGCE, with Masters Level credits.  Trainees complete the equivalent of two 5000 word assignments within this internationally recognised PGCE award,  receiving additional training at the University and are recognised as students of the University. This includes access to the library, sports and learning support facilities.\r\n\r\n Leicester and Leicestershire SCITT has been [OFSTED](https://reports.ofsted.gov.uk/provider/41/70163) Outstanding continuously since 2008/09 and has the best [course retention rates](https://leics-scitt.co.uk/wp-content/uploads/2019/09/ITTPP2019_Provider_tables_East-West-Mids.xlsx) in Leicestershire.\r\n\r\nClick [HERE](https://leics-scitt.co.uk/our-courses/) for more information about the course design and timetables\r\n","interviewProcess":"The primary SCITT and School Direct partner alliances, will use a two stage interview process for candidates called to interview, normally held on two separate days. It may be possible to hold both interviews on the same day for candidates who need to travel further or candidates who will find attending interview for two half days particularly difficult.   \r\n\r\nAs part of our selection process all candidates will be asked to complete written audits in English and mathematics.  The written audits assess whether each candidate’s personal subject knowledge in English and mathematics is sufficient to form a secure base to underpin high quality teaching of these subjects in the primary school. \r\n\r\n [Audit Information and Preparation Advice](https://leics-scitt.co.uk/entry-requirements/our-interview-process/) \r\n\r\nThe interview process will also take place in our partner schools and will involve a combination of tasks including:  \r\n\r\n* a presentation, connected to current educational issues;  \r\n\r\n* a task working with a small group of early primary or primary pupils;  \r\n\r\n* a formal interview;  \r\n\r\n* a reading task.  \r\n\r\nEach part of the selection procedure will be graded to agreed criteria. The interview questions will be largely based on elements that will contribute to the Teachers’ Standards. Equal opportunities procedures will be followed to ensure that the selection procedures are open, fair and assessments are to agreed criteria.\r\n","howSchoolPlacementsWork":"The SCITT and SD partnerships know trainees can only reach their potential if given exceptional support in placements. Teaching is about relationships; and the relationship between a trainee and their class teacher on placement is vitally important.  The trust and loyalty of headteachers and teachers in our partner schools, built up over the last 15 years, is a key strength of our training. The SCITT is proud that ALL of the top four of Leicestershire’s primary schools [(The Real Schools Guide 2019)]( https://leics-scitt.co.uk/wp-content/uploads/2019/09/TOP-ten-schools-2019.pdf) are our partners, offering placements and employing many SCITT trained teachers.  \r\n\r\nThe consistently high quality of support on 3 different school placements, from dedicated and enthusiastic teachers, underpins our success, making us one of the top teacher training providers in the country [The Good Teacher Training Guides](https://www.buckingham.ac.uk/wp-content/uploads/2017/04/GTTG17fin.pdf).  This maximises opportunities for each trainee to learn from best practice in different settings.  Trainees on the Ash Field SEN route will be placed in  FS and KS1 settings, including two mainstream schools and a final  placement in a special school.  Trainees on the Ash Field SD route have the support and guidance of a Special School tutor throughout the year.  Our trainees complete training confident in KS1/ FS classes and fully prepared to work in a wide variety of schools, ready to serve diverse pupil populations.  \r\n\r\nPlacements are carefully matched to trainee’s development needs and SCITT management also take into account the fact that trainees may be using public transport to reach placement schools.  Trainees with children are always thought about carefully so as to best support them as they juggle teaching demands with their own childcare arrangements.  \r\n\r\nThe autumn placement sees trainees experience foundation stage within an 8 week block.  In spring, you’ll have a further 7 week placement in a different school in KS1.  The final 9 week summer placement can be in a Special School. Placements begin with a week-long introduction visit to get to know the children and school.  We have over 80 partner primary schools across the city and county which offers trainees a wide range of schools in which to gain experience.    \r\n\r\n\r\n","personalQualities":"We are looking for talented, creative individuals, with a passion for teaching across a wide range of subjects within the primary curriculum. Good communication skills are at the heart of effective teaching and all applicants are expected to demonstrate excellent interpersonal and communication skills.  \r\n\r\nTeachers in schools know that teaching demands stamina and perseverance. We look for applicants with the resilience and determination required to cope with the demands of teaching.  \r\n\r\nWe aim to recruit a range of good role models representative of the local population, particularly from minority ethnic communities and men. We also encourage LSAs and career changers.\r\n","otherRequirements":"A commitment to undertake teacher training is a major step. As such it is important applicants make this commitment based on a first hand understanding of the pressures and rewards of working in a British primary school in the twenty first century. Applicants are strongly encouraged to have a minimum of one week’s relevant and recent experience in a primary school. We feel this is advantageous to demonstrate your understanding of teaching and learning in your interview.    \r\n\r\nApplicants will need to pass health and DBS police checks and have the physical and mental fitness to teach.\r\n","status":1,"createdAt":"2021-07-06T10:54:59.525Z","updatedAt":"2021-09-24T12:52:50.304Z","canSponsorStudentVisa":"no","cycle":"2024"}
