{"id":"84a1214e-8313-4c1e-85db-89e5b44634ea","name":"Primary","code":"3DS2","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"01067e09-93c7-41dd-aa5d-0a5163a6f89c","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"0c380b9d-1362-43b8-9483-de84f284cc03","code":"2HQ","name":"Island Teaching Alliance"},"accreditedBody":{"id":"2b84ae64-ebca-4e4d-88b1-13effff3a411","code":"S27","name":"University of Southampton"},"degreeGrade":"1","english":"1","maths":"1","science":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feesInternational":18812,"feeDetails":"Students are responsible for meeting the cost of essential textbooks, and of producing such essays, assignments, laboratory reports and dissertations as are required to fulfil the academic requirements for each programme of study. ","financialSupport":"Scholarships, bursaries, sponsorships or grants may be available to support you through your course. Funding opportunities available to you are linked to your subject area and/or your country of origin. These can be from the University of Southampton or other sources. ","aboutCourse":"The programme will suit people who aspire to become excellent primary teachers and want to gain an understanding of some of the theory underpinning effective teaching and learning in order to improve their practice. \r\n\r\nWe aim for creative, reflective and dynamic practitioners who are committed to promoting the learning of all pupils in their classes and to help every child make progress in their primary education. Planned and delivered in close collaboration with practising teachers in local primary schools, the primary course introduces you to the whole primary curriculum while providing a secure basis for you to learn how most effectively to plan, teach and assess subjects of the National Curriculum and to organise and manage a classroom, for children aged 5-11 years. \r\n\r\nThe course aims to develop your subject knowledge through a range of teaching and learning approaches: workshops, seminars, lectures and demonstrations, fieldwork and micro-teaching activities, independent and group research, and through reading and writing activities. The assignments include a high degree of choice and strongly link theory and practice. \r\n\r\nAs well as preparing you to teach across the Primary Curriculum, you will also have several opportunities to personalise your course and begin exploring areas of specialism such as Science, MFL and English through additional opportunities. We have one specific specialism route: Mathematics. \r\n\r\nhttp://www.southampton.ac.uk/education/postgraduate/itt_courses/pgce_primary.page ","interviewProcess":"Candidates are selected for interview after applications are received and read thoroughly by tutors. It is important that all aspects of your application form are fully completed and that you pay particular attention to the content and presentation of your application. \r\n\r\nIf you are invited for interview you will be asked to prepare a short presentation to a small group of candidates, and engage in discussion. You will also be interviewed by one or more members of the course team. We also ask you to undertake some short written tasks to satisfy ourselves of your capability in written English, spelling and mathematics. \r\nYour performance will be assessed by several people, including senior staff from our partner schools, and decisions about acceptance are only made when all assessments are collated and discussed by the course team panel. \r\n\r\nWe would encourage all prospective students to spend time in a Primary School so you are informed about the school environment, to confirm your own wish to teach and inform your own views. As these views will be explored at interview, you need to be able to reflect on aspects of what teachers and schools do and be able to talk convincingly about teaching in primary schools.\r\n","howSchoolPlacementsWork":"The Island Teaching Alliance partners with six schools on the Isle of Wight. The course will cover age ranges 5-11, with an opportunity to experience the Early Years Foundation Stage, Key Stage 3 and a Special School. Each candidate will have two placements, covering 24 weeks between them and additional in school focus days, providing a range of face-to-face opportunities. All placements will be on the Isle of Wight. Schools are matched to individual candidates, ensuring a contrasting experience is provided.","personalQualities":"A passion for teaching and a commitment to all children’s learning is essential. This includes a love of learning and of children, with the resilience to manage the challenges of teaching in the 21st Century. We are looking for teachers who understand their accountability for every child's progress and wellbeing; going above and beyond for every child and the school.\r\n\r\nWe also require the ability to communicate clearly and effectively in both written and spoken English, as well as good basic knowledge of mathematics, science and IT. Evidence of wider interests and knowledge is valuable in teaching the whole curriculum.","otherRequirements":"You will be required to complete a form describing your state of health which will be checked against the Government Fitness to Teach criteria. \r\n\r\nBefore starting on a PGCE programme you will be required to provide an Enhanced Disclosure from the Disclosure and Barring Service (DBS) to confirm that there are no criminal offences on your record which should bar you from teaching. ","status":1,"createdAt":"2021-07-06T10:50:34.777Z","updatedAt":"2021-10-06T15:05:23.557Z","canSponsorStudentVisa":"yes","cycle":"2024"}
