{"id":"6e3a99ef-4507-4a22-bef5-ff381f797f2a","name":"Geography","code":"28XL","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3f47e67b-7fa5-4947-a5a0-74d528cd2a87","code":"F8","name":"Geography"}],"locations":[{"id":"06798b3b-df6e-4061-8849-e106571b10cf","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"e71fb6cf-eff8-4110-bc88-c6d60462c64b","code":"136","name":"Carlisle School Direct"},"accreditedBody":{"id":"9be9f611-2d36-431a-9109-7fcbbfc88fc8","code":"C99","name":"University of Cumbria"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Candidates should arrange their own equivalency tests","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Our Secondary PGCE with QTS programme is run in partnership with the University of Cumbria. We believe in providing you with a rich and broad experience of school contexts. This allows you to observe, practice and reflect on a variety of contrasting practice. As well as our school-led training (spread over two placements at schools in our alliance), you will undertake two 30-credit masters level modules to gain your PGCE. These modules are practically focused and designed to allow you to focus on your priorities and interests as you develop your teaching skills. You will complete three written assignments, one of which will be formative to support your academic development. The modules are taught by our University of Cumbria colleagues who work very closely with our programme. As a result you will be well equipped to move forward into your early teaching career.","interviewProcess":"The interviews are usually held at Trinity School, and are led by members of our programme team and  school staff from across the alliance.\r\nTypically, there will be one morning or afternoon process, involving a written task, a \"mini-teach\", and a formal interview.  \r\nNote:  Due to Covid-19 restrictions, interviews may be held online if there is a local outbreak","howSchoolPlacementsWork":"We are a large alliance of local schools, offering both assessed placements and school-led training. All schools have a trained subject mentor who will be responsible for supporting your development. You will spend most of your time with a pattern of four days per week in your placement schools and one day per week in collaborative training experiences. \r\n\r\nYou will be expected to travel to school placements and school-led training days which run in a range of our secondary schools. As a result you access a range of different and contrasting schools across the year.\r\n\r\nThe assessed aspects of our programme provide you with Key Stage 3, Key Stage 4, and sometimes Key Stage 5 teaching experience. You will complete two assessed placements; the first from September to December, the second from January to June.","personalQualities":"We are looking for individuals with drive, passion, resilience and commitment to develop into a great teacher.","otherRequirements":"All applicants are subject to appropriate DBS clearance in line with entry to Teacher Training Programmes in partnership with the University of Cumbria.","status":1,"createdAt":"2021-07-06T10:56:02.661Z","updatedAt":"2021-09-26T12:12:32.807Z","canSponsorStudentVisa":"yes","cycle":"2024"}
