{"id":"7c231f95-afc3-4fec-8e68-7a8a714fec94","name":"Primary","code":"2NY8","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"4_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"6228b77a-023f-41ab-bb08-4fc7ca1e75a5","name":"University of Hertfordshire","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"f0439376-da6f-452c-9efb-371f2dee4cec","code":"12M","name":"The Wroxham School"},"accreditedBody":{"id":"feecdec5-259c-45e3-b1cf-4e391936ee90","code":"H36","name":"University of Hertfordshire"},"profPost":"BO","degreeGrade":"1","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feeDetails":"Student grants are available to eligible applicants.","aboutCourse":"Trainees will spend 4 days a week in their host school, learning 'on the job', with one day a week training at The University of Hertfordshire.    \r\n\r\nYou will get to know your class very well right from the start and your teaching workload will build up gradually.  This means you won't be teaching classes on your own until your school thinks you're ready.  Trainees on this course are supernumerary.\r\n \r\nYou will have a teacher mentor who you meet with very regularly and who will guide your learning, help with planning, give advice and set targets which are individual to your needs.  You will have a Professional mentor within the school who will plan, oversee and support your training programme.  In addition, there will be a visiting tutor from the University of Hertfordshire who will moderate and support.  Within school you will have opportunities to observe in different classes.\r\n\r\nYou will have an alternative placement in an adjacent age group at another school for at least 6 weeks, usually in the Spring term.","interviewProcess":"All applications are processed by The Wroxham School, who will shortlist and invite candidates to interview if their application meets both The Wroxham School's and the University of Hertfordshire's criteria.  Candidates will usually have a visit to The Wroxham School where there training needs are discussed and a potential training school identified.\r\n\r\nThe interview takes place at The Wroxham School and will include a written task set by The University of Hertfordshire.  We will also ask you to read a story and lead a discussion (which you will have planned) with a class of children.  You will be able to request a particular age group.  \r\n\r\nFinally you will be interviewed by a panel of no more than three people, one of whom may be a member of staff from your potential training school.\r\n\r\nThe interview usually takes no longer than a morning or afternoon.  We usually make a decision on the day about whether to recommend you to the University of Hertfordshire.  They will then review your written task and interview records and let you know within two weeks if you are offered a place on the course.","howSchoolPlacementsWork":"You will spend most of your time at your host school. You will be based in one class but also have opportunities to observe in other classes and age groups.  One day a week at University.  Each week you will have a learning focus presented at the University which will be followed up as part of your School Based Training.\r\n\r\nYour second placement will be for around half a term based in a different  school and age group.  The Wroxham School will organise a placement at a school which is accessible to you and which will provide you with a different experience to your host school.","personalQualities":"You will need to show -\r\nSelf motivation,\r\n self  organisation,\r\n interpersonal skills and communication,\r\n leadership and passion,\r\n resilience and adaptability,\r\n that you are respectful and considerate,\r\nenthusiasm for teaching and a willingness to learn,\r\nunderstanding of primary education, gained from spending time in schools,\r\nunderstanding of the role of the teacher and the demands of the teaching profession,\r\nan ability to reflect on observational experience,\r\nwell written application form and personal statement that should include some reference to the above.\r\n","otherRequirements":"All applicants will be subject to criminal records checks.","status":1,"createdAt":"2021-07-06T10:56:48.306Z","updatedAt":"2021-09-15T16:49:19.432Z","canSponsorStudentVisa":"no","cycle":"2024"}
