{"id":"ab68855c-cb09-4189-b36a-eb04a868eb6e","name":"Primary","code":"2298","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"4_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"trainingProvider":{"id":"f0439376-da6f-452c-9efb-371f2dee4cec","code":"12M","name":"The Wroxham School"},"accreditedBody":{"id":"feecdec5-259c-45e3-b1cf-4e391936ee90","code":"H36","name":"University of Hertfordshire"},"english":"2","maths":"2","science":"2","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","aboutCourse":"Trainees will spend 4 days a week in their host school, learning 'on the job', with one day a week training at The University of Hertfordshire.  As you are paid by your training school you will become a member of staff for the training year.  \r\n\r\nYou will get to know your class very well right from the start and your teaching workload will build up gradually.  This means you won't be teaching classes on your own until your school thinks you're ready. \r\n \r\nYou will have a teacher mentor who you will work with very closely. In your weekly mentor meetings they will guide your learning, help with planning, give advice and set targets which are individual to your needs.  You will have a Professional mentor within the school who will plan, oversee and support your training programme.  In addition, there will be a visiting tutor from the University of Hertfordshire who will moderate and support.  Within school you will have opportunities to observe in different classes.\r\n\r\nYou will have an alternative placement in an adjacent age group at another school for at least 6 weeks, usually in the Spring term.\r\n","interviewProcess":"All applications are processed by The Wroxham Teaching School, who will shortlist and invite candidates to interview if their application meets both The Wroxham School's and the University of Hertfordshire's criteria.  Applicants will need to have a school committed to employing them for the training year before we can invite to interview. \r\n\r\nThe interview takes place at The Wroxham School and will include a written task set by The University of Hertfordshire.  We will also ask you to read a story and lead a discussion (which you will have planned) with a class of children.  You will be able to request a particular age group.  \r\n\r\nFinally you will be interviewed by a panel of no more than three people, one of whom may be a member of staff from your potential training school.\r\n\r\nThe interview usually takes no longer than a morning or afternoon.  We usually make a decision on the day about whether to recommend you to the University of Hertfordshire.  They will then review your written task and interview records and let you know within two weeks if you are offered a place on the course.","howSchoolPlacementsWork":"You will spend most of your time at your host school, where you will be an employee for the training period. You will be based in one class but also have opportunities to observe in other classes and age groups.  One day a week will be based at University.\r\n\r\nYour second placement will be for around half a term based in a different school and age group.  The Professional mentor at your host school will organise a placement at a school which is accessible to you and which will provide you with a different experience to your host school.","personalQualities":"You will need to show -\r\nSelf motivation\r\n Self  organisation\r\n Interpersonal skills and communication\r\n Leadership and passion\r\n Resilience and adaptability\r\n That you are respectful and considerate.\r\nEnthusiasm for teaching and a willingness to learn.\r\nUnderstanding of primary education, gained from spending time in schools is an advantage but not essential\r\nUnderstanding of the role of the teacher and the demands of the teaching profession.\r\nAn ability to reflect on observational experience.\r\nWell written application form and personal statement that should include some reference to the above.\r\n","otherRequirements":"All applicants will be subject to criminal records checks.","status":2,"createdAt":"2021-07-06T10:56:48.279Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"Trainees on this course will be employed by the school where they are based for most of the training year.  They will be paid using the unqualified teacher's pay scale for that area. \r\n\r\nUniversity course fees are paid by the Lead school, so there is no responsibility to the student or host school.\r\n\r\nYou will not be eligible for a bursary or student finance on the salaried route.  "}
