{"id":"aac47c5e-d6f5-4c26-a136-6a0997d90f0c","name":"Physics","code":"2SBK","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"bf97cd0a-224c-43d3-a021-84143df13e8d","code":"F3","name":"Physics"}],"locations":[{"id":"f49889ed-daf6-41e0-afd2-35f7d6de3f3b","name":"Mossley Hollins High School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"2ec44c7f-94f4-41df-a6eb-eeb66c94699a","code":"2A1","name":"everyonelearning@ Hawthorns, Kingfisher, Mossley Hollins Teaching Partnership"},"accreditedBody":{"id":"9be9f611-2d36-431a-9109-7fcbbfc88fc8","code":"C99","name":"University of Cumbria"},"profPost":"PG","degreeGrade":"9","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Equivalency Test requirements will be discussed at interview and in collaboration with the University of Cumbria.","courseLength":"OneYear","feesUK":9250,"financialSupport":"For further information regarding finance for the School Led tuition fee route into teaching please visit the following links. \r\n\r\n(https://getintoteaching.education.gov.uk/funding-your-training)\r\n\r\n(https://getintoteaching.education.gov.uk/funding-your-training#bursaries-and-scholarships)\r\n\r\n(https://getintoteaching.education.gov.uk/funding-your-training#if-you-come-from-outside-england)\r\n","aboutCourse":"The everyonelearning@ Hawthorns, Kingfisher, Mossley Hollins  Teaching Partnership commitment to you.\r\nA comprehensive Secondary school-led training programme delivered by Mossley Hollins High School and outstanding practitioners and leaders from across Partner Schools.\r\nYou will visit the University throughout the course of the programme. Further training is facilitated by experienced practitioners in our partner schools.\r\n https://www.everyonelearning.co.uk/meet-the-team/\r\n\r\nWhat to expect:\r\n* 2 contrasting school placements \r\n* A University-led PGCE programme leading to the award of PGCE with QTS and 60 Masters Level credits on completion of 3 academic assignments that are related to educational practice.\r\n* Guided and tailored support from your dedicated school-based mentor, classroom teacher and Professional Programme lead in partnership with the University of Cumbria Programme Lead.\r\n* Opportunities to observe outstanding teaching in General Primary, Specialist and Sixth Form settings\r\n* Opportunity to immerse yourself in the day to day life of a professional  working school whilst retaining the role of trainee teacher.\r\n* A range of facilitators  including Head Teachers, Senior Leaders and Specialist Leaders of Education\r\n* Opportunities to share professional practice through Quality First development days\r\nThe expectation of employment.\r\nWe aim to continue our excellent track record of employment rates and guide and support all our trainees into teaching positions across our diverse range of Partner Schools.\r\n* For further information email: \r\n*Mrs E Duggan  Partnership Manager - e.duggan@mossleyhollins.com\r\n\r\n* https://www.mossleyhollins.com/initial-teacher-training/198.html\r\n* https://www.everyonelearning.co.uk/school-direct-secondary-pgce-with-qts/\r\n* Twitter: @every1learning\r\n* Twitter:@MossleyHollins\r\n \r\n","interviewProcess":"When an application is received, it will be checked against initial criteria for qualifications and experience.\r\nFollowing this, the everyonelearning@  Hawthorns, Kingfisher, Mossley Hollins Teaching  Partnership will read the application and assess the applicants commitment and motivation to teach, ability to reflect on practice and enthusiasm for the profession.\r\nRelevant and recent school experience will be considered and references referred to.\r\nSuccessful applicants will be invited to participate in either a virtual or face to face interview at Mossley Hollins High School .\r\nSecondary applicants  will be expected to:\r\n\r\n* lead a 20 minute subject lesson with a class of children followed by 2 minutes of questions\r\n* Compile a written response to a think piece, in advance of the interview day. This will be assessed for spelling, punctuation and grammar together with a general understanding of the think piece and an ability to reflect.\r\n* Complete a subject knowledge audit \r\n* Participate in a formal 20 minute interview. This is conducted by experienced professionals from the everyonelearning@Teaching Partnership.\r\nUpon successful completion of the interview process, School Direct Places are then offered in partnership with The University of Cumbria.\r\nAll School Direct places will lead to qualified teacher status (QTS) and a postgraduate certificate in education (PGCE) validated by the University of Cumbria\r\n","howSchoolPlacementsWork":"Where possible, school placements are arranged to meet the needs of the trainee.  We aim, where possible to ensure trainees are not travelling for more than 40 minutes at the start and end of the day. Consideration is also given to those trainees who don't drive.\r\nTrainees will complete 2 contrasting placements during their training year. September- December and January- June. The programme is designed in such a way that trainees have numerous opportunities to visit other schools/settings throughout the course of the programme.  ","personalQualities":"The everyonelearning@ Hawthorns, Kingfisher, Mossley Hollins Teaching Partnership is keen to meet with candidates who have the qualities required for a career in teaching and who are determined to make a difference to the lives of children and young people. \r\nAre you:\r\n* Friendly\r\n* Enthusiastic\r\n* Hard Working\r\n* Passionate \r\n* Resilient\r\n\r\n If so, we would really like to hear from you to understand your commitment to making a difference as a teacher.\r\n\r\n\r\n","otherRequirements":"Any recent work experience within a school setting would be helpful.","status":1,"createdAt":"2021-07-06T10:55:31.190Z","updatedAt":"2021-10-03T22:54:40.629Z","canSponsorStudentVisa":"yes","cycle":"2024"}
