{"id":"d7de114b-89b8-4dfb-b40c-fdce14096f53","name":"Dance","code":"W5X1","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"49dcc400-03df-4732-af93-1c56ae22897f","code":"12","name":"Dance"}],"locations":[{"id":"8ca27381-628b-4b12-86d8-8929855fb246","name":"Harlow","isPublished":"Y","status":"R","vacancies":"F"},{"id":"f9959a6b-2a1f-47b1-943d-f18334d0aff8","name":"Basildon","isPublished":"Y","status":"R","vacancies":"F"},{"id":"4dd8b102-6b22-40b8-af27-c41de872855e","name":"Chelmsford","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"00782614-9301-40e4-8832-9a74cc1bbb07","code":"E75","name":"Essex Teacher Training"},"profPost":"BO","degreeGrade":"9","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We advise applicants to use one of the two equivalency testing providers listed below.\n\n[Astarteachers.co.uk] (https://www.astarteachers.co.uk/gcse-equivalencies-assistance/)\n\nOR\n\n[Equivalencytesting.com] (https://www.equivalencytesting.com/)","courseLength":"OneYear","feesUK":9150,"aboutCourse":"Essex Teacher Training is a large provider, offering a variety of different school-based routes to QTS.  We train around 150 trainees a year in partnership with schools across Essex and its adjoining counties.  Working with so many schools we can offer you training in your local area, which is tailored to suit your individual requirements.  We offer training in both primary and secondary schools, both full time and part-time (over 2 years) and we also offer the primary programme in special schools too.  \r\n\r\nWe have a great partnership with our schools and headteachers value the contribution trainee teachers can make to their schools.  As a result, trainees enjoy their training and the vast majority gain employment in one of our partner schools, once qualified.  \r\n\r\nAll of our tutors are experts in their field and many are still teaching, so you benefit from their knowledge and experience, helping you develop your own teaching as you progress through the course.  We pride ourselves on the support we offer our trainees and put trainee wellbeing at the heart of what we do.  You will be supported by an in-school mentor as well as an external tutor from us.  Our programme leaders are both mental health first aid instructors and all our core staff have completed mental health training with MHFA England.  We are committed to providing a supportive environment for you to complete your training.\r\n","interviewProcess":"You will be invited to an initial interview with our accredited provider, which will include a short presentation about why you wish to teach and formal interview with a small panel of representatives from Essex Teacher Training.  If successful at Phase I, you will be invited to an interview in one of our partner schools.  This interview could include: an activity with pupils eg teaching part of a lesson, or taking a group activity; a pupil panel interview and a formal interview with a small panel of representatives from the school and wider School Direct partnership.  If successful at Phase II, you will be given a conditional offer of a place to train.","howSchoolPlacementsWork":"Trainees will complete training in two different schools during the course of the year.  Typically trainees spend the autumn term in their host school and then go to a second placement school during the first part of the spring term and then return to their host school for the remainder of the year.  Trainees are in school 4 days a week and attend training on the 5th day. We endeavour to keep travelling time to school to a minimum so we will take into account your home address when allocating a school.  \r\n\r\nThe programme covers the secondary age range 11-16 and you will be required to teach at both KS3 and KS4.  You will also have the opportunity to teach KS5 but it is not a requirement.","personalQualities":"We are looking for high quality graduates with a passion for learning who are committed to transforming the lives of young people through education.  ","otherRequirements":"Satisfactory recruitment checks including enhanced DBS, children’s barred list, prohibition order check and reference check.","status":1,"createdAt":"2021-07-06T10:49:43.886Z","updatedAt":"2021-09-25T10:15:26.207Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
