{"id":"d549edbd-10e7-4e23-80ae-733de9c696b7","name":"Physics","code":"3D3C","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"bf97cd0a-224c-43d3-a021-84143df13e8d","code":"F3","name":"Physics"}],"locations":[{"id":"494e4223-1b2c-4001-be9d-06ac8d1d96fe","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"4daac859-d081-45ad-834c-4237f112924a","code":"25Q","name":"Cheshire East SCITT"},"profPost":"PG","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"Ideally, we accept candidates with a 2:2 or above. We would consider candidates with a 3rd class degree if there were extenuating circumstances.","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feeDetails":"Tuition fees are £9,250 and you can apply for a loan to cover these fees and /or means tested maintenance grant via the student loan company. \r\n\r\nThere are a range of bursaries and scholarships available and their value by phase, subject and degree classification can be found by visiting the Department of Education website:\r\n [Bursaries and Scholarships](https://getintoteaching.education.gov.uk/funding-and-salary/overview)\r\n","aboutCourse":"The course is a non-salaried PGCE (SCITT) QTS award and you will gain a PG Certificate (60 M-level CATS points).\r\n\r\nScience is a core subject at secondary level and since there is a national shortage of Physics teachers, it is a subject that is much in demand.  Science teachers will specialise at A-level, but often teach all three sciences to GCSE and our course is designed to give you the skills and the confidence to be a successful science teacher.\r\n\r\nYou will develop your Physics skills by working in one of our placement schools from day one, where your dedicated subject mentor will support you to become a competent Physics teacher, able to inspire students to achieve in your subject.  Working in partnership with the school subject and professional mentors, the SCITT director and support team and the subject specialist lead, will ensure that your course prepares you for the reality of teaching a practical subject.  You will develop your classroom skills, as well as your knowledge and understanding of Physics alongside strategies to communicate this with your students.\r\n\r\nWhatever your route into teaching, whether you are coming straight from university, from academia or industry,  you will enjoy the support and guidance of experienced and passionate professionals as you begin your journey into science teaching.\r\n","interviewProcess":"The assessment day will involve a range of activities including the delivery of a short lesson, followed by an interview with the SCITT team and a representative of colleagues from our alliance schools. You will be assessed on your subject knowledge during the day. You will also be interviewed by our student panel and complete a written think piece. \r\nAll interviewers will consider the following: \r\n-\tYour communication skills \r\n-\tCommitment to teacher training and resilience\r\n-\tKnowledge and understanding of the qualities of a teacher \r\n-\tYour ability to reflect and evaluate your own practice and the practice of others\r\n-\tPersonal qualities and knowledge and understanding of the qualities of a teacher\r\n-\tYour subject knowledge\r\n-\tYour ability to interact with both adults and young people \r\nIt is a rigorous and thorough selection process, designed to recruit the very best candidates and ultimately the best trainee teachers for our students.\r\n\r\n","howSchoolPlacementsWork":"You will complete two placements in our partner schools, where you will have both a Subject Mentor and a Professional Mentor. Your role in the classroom increases gradually, at a pace you and your mentor feel is right for you. The first placement will begin in September with focused lesson observations, and then you will begin to deliver starts to lessons, undertake some team teaching and then plan and deliver whole lessons. The second placement begins after February half term, where you will be allocated to a different school within the partnership, which will give you a contrasting experience and broaden your professional development. \r\nAll of our partner schools have comprehensive intakes and you will have the experience of working with young people of all abilities. \r\nYou will have the opportunity of spending time in a primary setting to focus on transition, as well as gaining SEND experience, giving you an insight into all types of learners. At least one of your placements will give you access to post 16 learners to give you the experience of working with learners in all phases and contexts. \r\nThe first placement will start early September and involves teaching practice in school each week, with the majority of Fridays being conference days or subject-based days. Subject-based days are run by Subject Experts. Our conferences are planned and delivered by outstanding classroom practitioners from within our partner schools. \r\nYou will have full access to the facilities of both The Cheshire East SCITT Training Centre and The Manchester Metropolitan University. The majority of your time will be school based but there are a number of days where you will be based at the Training Centre at Holmes Chapel Comprehensive School and approximately five days at University, to focus on your Masters level work - far reduced compared to a traditional PGCE route.\r\n","personalQualities":"We are looking for ambitious, energetic, dedicated, well-qualified, independent and enthusiastic trainee teachers who are passionate about their subject and have the desire, drive and commitment to inspire all abilities in the secondary age range. Successful applicants will have an understanding of the resilience and emotional intelligence needed to become an outstanding teacher and future leader and to be reflective learners. We are looking for applicants who have excellent subject knowledge and the ability to deliver it in an engaging and creative way to inspire learning. It is key to be an effective communicator and a responsible,  accountable professional.","otherRequirements":"* A satisfactory DBS check,  including a check of the children`s barred list.\r\n* An academic reference which is very positive in terms of academic achievement and highly recommends the applicant for a career into teaching. The reference should confirm the person's suitability to work with children, as well as their personal qualities and attributes.\r\n* Fitness to teach check.\r\n*  School experience is not a requirement for entry to the course, however successful candidates will demonstrate an understanding of teaching and learning within an appropriate educational context.","status":1,"createdAt":"2021-07-06T10:51:22.483Z","updatedAt":"2021-09-14T08:07:01.006Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
