{"id":"434b3d90-a1f8-4b5d-8fe7-76f3640f96fc","name":"Drama","code":"2D2P","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"69052223-ca45-4781-a8d3-cb92447a6d78","code":"13","name":"Drama"}],"locations":[{"id":"768725cd-8199-4728-a224-29e00c32608a","name":"London Partnership","isPublished":"Y","status":"R","vacancies":"F"},{"id":"aa5c32b7-8be5-4296-bf9e-95838abada30","name":"Hertfordshire Partnership","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"42bce8af-e86c-4e4a-b811-3dc72ef20ed4","code":"P58","name":"Future Teacher Training"},"profPost":"BO","degreeGrade":"0","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feesInternational":9250,"feeDetails":"Tuition fee loans are available through Student Finance England to support with paying your tuition fee which is £9,250. Please note that while the tuition fee is the same for international students as for UK and EU students, we are not able at this time to support applicants who do not have the right to study or work in the UK.\r\n\r\nInternational applicants:\r\n\r\nPlease see the information on our website for more guidance \r\nhttps://www.futuretraining.org/page/?title=Overseas+applicants+and+qualifications&pid=49\r\n\r\n\r\n\r\n","aboutCourse":"Future Teacher Training (formerly Pimlico - London SCITT) is part of Future Academies, a family of schools which has built a reputation for achieving the highest standards for all its pupils. There are 10 schools in the Multi Academy Trust across London and Hertfordshire and are all committed to the same vision which is guided by our motto: ‘libertas per cultum’, (Freedom Through Education) offering a traditional education that is knowledge-rich and furnishes children with the freedom to choose a path in life that they value. At Future Teacher Training we have an unrelenting focus on producing trainee teachers of the highest calibre, characterised by their deep subject knowledge and desire to become expert teachers and leaders who level the playing field for their students, giving them the same opportunities as their more advantaged peers. \r\nOur ITT curriculum is unique and the central focus of our teacher training programme, designed intentionally and sequenced iteratively, building upon what we know about cognitive science and the road to becoming an expert teacher. We deliver weekly training sessions where we aim to disseminate a research-informed aspect of training that links to our curriculum strands. Our training is rooted in exploitation of examples, and often, non-examples to exemplify how this aspect of training can be applied to your teaching practice most impactfully. Along the way, we endeavour to bust lingering educational myths and ensure our trainees have access to exemplar curriculum resources. We combine these sessions with practice-based, often subject-specific training to empower trainees with opportunities to apply the pedagogical principles to their own subject and classroom with the oversight of subject experts who can model best practice, support with the application of training and give feedback as well as to work collaboratively with your subject/phase peers. It is our philosophy that trainees should be given regular opportunities to practice in advance of a lesson and receive clear, specific, actionable feedback. \r\nYou will train for one year and gain Qualified Teacher Status and the Post Graduate Certificate Education from Sussex University. \r\nYou will have a subject-specialist mentor in your school to guide and support you with your subject knowledge development and application of educational research in the classroom. \r\nFor more information: https://www.futuretraining.org/page/?title=Routes+On+offer&pid=14\r\n. \r\n\r\n\r\n","interviewProcess":"There are 2 stages to our interview process.\r\n\r\nStage 1\r\n\r\nPre-interview Tasks \r\nYou will be required to complete a lesson planning task based on a set learning objective relevant to your subject or phase. You will also compose a short essay on what makes great teaching. Both tasks must be completed before the interview. \r\n\r\nOnline Interview\r\nInterviews will be conducted online, last about 30 minutes and will usually be conducted by two members of the Future Teacher Training team. We will ask a series of questions about why you have chosen teaching as a career, why you have chosen our route and us as a provider. There will also be the opportunity to ask us any questions.\r\n\r\nSubject-Knowledge Task \r\nAfter the interview you will need to complete a subject-knowledge task. This is usually a past GCSE paper, for which no preparation is required. \r\nYou will be informed within 48 hours if you have been successful and invited to a stage 2 interview.\r\n\r\nStage 2\r\n\r\nTeaching Episode\r\nThis is an in-person interview at a potential placement school where you will be required to deliver a short teaching episode with 10 students. This will be followed by an interview where you will be asked to reflect on the lesson you have just taught.\r\nWe will inform you of our decision within 48 hours\r\n","howSchoolPlacementsWork":"We run a compulsory induction programme for two weeks in July before the start of your placement to fully to prepare to teach from the start in September.\r\nYou will begin your placement at the start of the September term where you will become fully immersed in the school community. You will remain in this placement school for most of your training year as we believe this is the most effective way to experience all aspects of school life. To supplement this, you will also participate in focused placements, conducting a three-week placement in the spring term, which will offer you a contrasting experience within our network of excellent schools. This network includes many independent, grammar and specialist schools. \r\nAs part of your ongoing development, you will be released by your placement school for one afternoon per week to attend centralised training: Professional Studies. This weekly programme runs throughout the whole and includes. \r\n1.\tKeynote lectures that give an in-depth understanding of key debates within education policy and practice. \r\n2.\tPractice Perfect sessions help you develop teaching techniques. The opportunity to build automaticity and receive feedback outside the live environment of the classroom. \r\n3.\tBook Group allows you to discuss educational texts. \r\n4.\tSubject knowledge lectures are given by a range of academics and external speakers and develop expertise in subjects.\r\n\r\n","personalQualities":"We also assess applicants for the following qualities in their preliminary applications and interviews: \r\n\r\n * A strong academic record and passion for your subject \r\n * Effective communication and leadership skills.\r\n * The enthusiasm required to work with children\r\n * Applicants are at an advantage if they have gained school experience.\r\n \r\n","otherRequirements":"In addition to the required qualifications above, before the start of the course, you will need to:\r\n\r\n * Provide proof of all qualifications\r\n * Complete an Enhanced Disclosure and Barring Service check  \r\n * Undergo an occupational health assessment to assess fitness for teaching.\r\n\r\n","status":1,"createdAt":"2021-07-06T10:46:51.838Z","updatedAt":"2021-10-07T15:31:52.086Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
