{"id":"858367f0-37b0-4798-b8ec-728873aed9da","name":"Chemistry","code":"3XYC","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"912d4fb4-761b-42e9-8dc6-e968b791ea4e","code":"F1","name":"Chemistry"}],"locations":[{"id":"90c6ba70-49e4-4525-9a9d-c6e9b378e8ff","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"10d4c862-a0d1-45bb-bf1b-0bc2d5409158","code":"2LA","name":"Coastal Teaching Partnership South"},"accreditedBody":{"id":"3700fb02-7007-40c8-9127-b070e146d6cb","code":"W76","name":"University of Winchester"},"profPost":"PG","degreeGrade":"1","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":13800,"financialSupport":"There are three types of funding available for teacher training - depending on your circumstances, you could receive all three:\r\n\r\n1. Tax-free bursary or scholarship\r\n2. Tuition Fee Loan and Maintenance Loan\r\n3. Additional financial support if you’re a parent, have an adult dependent or have a disability\r\n\r\nFurther information on tuition fee and maintenance loans and additional financial support can be found on the [Get into teaching website](https://getintoteaching.education.gov.uk/funding-my-teacher-training/bursaries-and-scholarships-for-teacher-training)","aboutCourse":"This Schools Direct Teacher Training course is deliberately arranged so that your “hands-on” experience in the classroom, always under the close supervision and guidance of an experienced teacher, is complemented by the input from the University of Winchester plus Professional Development days across the consortium to contextualize and inform what you are experiencing in the classroom setting on a weekly basis. ","interviewProcess":"Once invited for interview you will be asked to teach a 25 min lesson in the subject area that interests you. You will, of course, be given information about the numbers of students, topic focus plus any other relevant information. We will also ask you to complete a short written and numeracy exercise plus deliver a 5 min presentation followed by questions. The process culminates in a 25 min interview. ","howSchoolPlacementsWork":"You will be placed at a “home-school” where you will base yourself Monday to Thursday, for most of the academic training year. Between January and February half term (broadly) you will be placed in a second, ideally contrasting, school for Monday to Thursday. Fridays are set aside for University or Consortium training and reflection days.","personalQualities":"We are looking for aspiring teachers who have a passion for their subject specialist area and who delight in sharing their love of learning with young people. You should be an organised and efficient self-starter who is willing to take on critical feedback in this undeniably intensive but hugely rewarding year of professional and personal growth. You should be resilient and resourceful. ","otherRequirements":"The Department for Education has withdrawn the requirement for ITE applicants to complete literacy and numeracy Skills Tests.  \r\nDuring the selection process and as part of your training, you will be required to demonstrate competency in Fundamental skills in English and mathematics.","status":1,"createdAt":"2021-07-06T10:54:02.457Z","updatedAt":"2021-09-07T10:58:38.299Z","canSponsorStudentVisa":"yes","cycle":"2024"}
