{"id":"1a9697c3-9b0b-43b2-8fe8-214b9371cdb1","name":"Primary","code":"AM01","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"other","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_7","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"938c8dca-9b5e-42e7-9741-fe54b337b0e1","name":"Franche Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"ee576170-bcc7-47a0-9919-73d660e24470","name":"Anderton Park Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"4e76c76e-048c-431c-87b4-2c131fb242b8","name":"Main Site, Charford First School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"e18a7f92-debf-4f21-b643-2e9fd08810ef","name":"Blackwell First School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"a8b71089-f3a8-40d5-a8e6-8afd650f0e54","name":"Catshill First School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"4583557a-6174-49f9-8923-a2aac6a2f4be","code":"2HU","name":"Bromsgrove Primary Alliance"},"accreditedBody":{"id":"4aa8177a-27b8-4566-b77a-c45515e46739","code":"N36","name":"Newman University"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Age Range 3-7years:\r\n\r\nThis programme is based on a shared vision for educational excellence between Newman University and Bromsgrove Primary Alliance. Trainees on the programme benefit from working with outstanding teachers in schools and at University. The school based elements of the programme allow trainees opportunities to spend time in school and to make links between their observations and experiences and the taught programme in University. In school trainees will be provided with a variety of opportunities to observe best practice which addresses the trainees’ development needs.\r\nThe Foundation Stage/Key Stage 1 course (3-7 years) includes a specialist study of the early years’ foundation stage curriculum and the distinctive pedagogies encountered in reception/nursery classrooms and children’s centres. School placements will be completed in relevant age phases. You will learn the principles of curriculum design and delivery, and theories of learning and teaching, alongside developing practical insights and skills in the effective teaching and assessment of young children.  Trainees are encouraged to develop into reflective teachers who can respond effectively to the learning needs of children of all abilities and needs.  You are assessed against the Teacher Standards through regular lesson observations with supportive feedback and ongoing self-reflection on your progress. Our PGCE course maximises your experience in classrooms, but also takes advantage of the depth and breadth of experience of University tutors.\r\nYou will benefit from regular University tutor visits and training at Newman University, focused on pedagogy, professional studies and support with academic writing.  Our partnership with the University will support you in completing two Master’s Level assignments of 4000 words each, plus subject audits in English, Maths and Science, leading to the award of Post Graduate Certificate in Education (PGCE) alongside Qualified Teacher Status (QTS)  These assignments show how practice and research combine to provide a framework within which you teach, refer to practical pedagogy in the classroom, research of academic literature and both reflection and evaluation.  Assessment of the PGCE Primary programme therefore combines course assignments and professional practice in school, aimed at enhancing your early career prospects and enabling you to be the best teacher you can be.\r\n\r\n","interviewProcess":"We review all applications to assess eligibility and potential suitability for the programme to which a candidate is applying. We recruit and fill places from when UCAS opens in October, so do not delay in submitting your application. \r\n\r\nWe work with our university partners to co-ordinate the recruitment process and hold interviews on a regular basis. Interviews will be held in one of the alliance schools, where possible, with representatives from Newman University and BPA. Where this is not possible, interviews will be held virtually.\r\n\r\nThese interviews will help us to assess your suitability for the course applied for and to work with you to discuss school placement requirements.\r\n","howSchoolPlacementsWork":"Candidates will have two placements throughout the year. The main one will be for the majority of the year in the same class, in the same school. This will be called their 'home school.' The second placement will be shorter and in a different school and a different key stage to their home school placement, providing candidates with a varied experience. Where it is not possible to provide a candidate with a second placement in a separate school, they will be placed in their 'home' school but in a different key stage.\r\n\r\nPlacement schools in the alliance are:\r\n\r\nCharford First School. This is a large 3 form entry first school in Bromsgrove, taking children up to Year 4, with a large Early Years department with nurseries for 2 year olds, rising 3s and 3 year olds.\r\n\r\nBlackwell First School. This is a small one form entry first school in the village of Blackwell, with 150 children on roll, taking children up to Year 4. The school also has a forest school nursery.\r\n\r\nCatshill First School. This is a 2 form entry first school in Bromsgrove, taking children up to Year 4. It also has a Nursery. Catshill First is also federated with Catshill Middle School.\r\n\r\nAnderton Park Primary School . This is a large multicultural school in Birmingham, taking children up to Year 6. There is also a Nursery on site. \r\n\r\nFranche Primary School. This is a large 4 form entry school in Kidderminster, taking children from 3 months to 11 years.\r\n\r\nNelson Mandela Primary School. This is a larger than average sized multicultural school in Birmingham taking children from ages 3 to 11 years\r\n\r\n","personalQualities":"We are looking for candidates that have a genuine passion for teaching, with a commitment to the value of education for all children. \r\nCandidates should also value the whole child and the communities in which they live.\r\n","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:55:27.831Z","updatedAt":"2021-09-24T14:10:26.063Z","canSponsorStudentVisa":"no","cycle":"2024","applicationsOpenDateOther":"2021-10-25T00:00:00.000Z"}
