{"id":"2ea7c41a-04b0-4d0b-a15b-b5d48f2b956e","name":"Primary","code":"H908","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"0d8c97f9-808c-44dd-946d-7b8d0e7501d5","name":"Westacre Middle School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"d8c7fdae-cf9a-4ba3-8ff2-d462464dc60b","name":"Chawson First School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"4e76c76e-048c-431c-87b4-2c131fb242b8","name":"Main Site, Charford First School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"a8b71089-f3a8-40d5-a8e6-8afd650f0e54","name":"Catshill First School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"e18a7f92-debf-4f21-b643-2e9fd08810ef","name":"Blackwell First School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"ee576170-bcc7-47a0-9919-73d660e24470","name":"Anderton Park Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"938c8dca-9b5e-42e7-9741-fe54b337b0e1","name":"Franche Primary School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"4583557a-6174-49f9-8923-a2aac6a2f4be","code":"2HU","name":"Bromsgrove Primary Alliance"},"accreditedBody":{"id":"9e30a2ef-61ee-4ffb-8862-b6ea936ff561","code":"2ET","name":"Prince Henry’s High School & South Worcestershire SCITT"},"profPost":"PG","degreeGrade":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Age Range 5-11 years \r\nThis programme is based on a shared vision for educational excellence between Prince Henry’s and South Worcestershire SCITT and Bromsgrove Primary Alliance. Trainees on the programme benefit from working with outstanding teachers in carefully selected partner schools and as part of the SCITT at Prince Henry’s.  The school based elements of the programme allow trainees opportunities to spend time in school and to make links between their observations and experiences and the taught programme through Bromsgrove Primary Alliance, as part of Prince Henry's SCITT. In school, trainees will be provided with a variety of opportunities to observe best practice which addresses the trainees’ development needs.\r\nThis is a full-time, one-year course focused on the 5-11 age range.  The course has been designed towards a more school-based approach to Initial Teacher Training (SCITT) with the placement aspects of the programme ensuring a strong alignment between the SCITT and school-based elements. The programme features the following strands: \r\n•\tCore (English, Mathematics and Science)\r\n•\tProfessional Studies\r\n•\tFoundation (all other National curriculum subjects and RE)\r\n•\tSchool Based Training. \r\nThese strands are developed throughout the year of study to enable trainees to build up their knowledge, understanding and skills in each key area. \r\nFor the PGCE element of the award we are building on our successful partnership with Newman University who will be delivering this aspect of the award\r\n\r\nTrainees will also develop their teaching skills through carefully designed School Based Training (SBT) experiences . \r\nThe programme is designed to recognise that trainees develop their understanding and skills of teaching gradually.  For the first block practice trainees will plan and develop their teaching with support from the class teacher.\r\nThe second block of SCITT sessions allows trainees to reflect upon their experiences in school and prepare them for subsequent placements.  \r\nThe final block practice will involve trainees taking responsibility for teaching about 80% of the class timetable.  Towards the end of this practice (SBT2) trainees will be summatively assessed against the Teachers’ Standards and graded as pass or fail.\r\n","interviewProcess":"We review all applications to assess eligibility and potential suitability for the programme to which a candidate is applying. We recruit and fill places from when UCAS opens in October, so do not delay in submitting your application. \r\n\r\nWe work with our SCITT partner  to co-ordinate the recruitment process and hold interviews on a regular basis. Interviews will be held in one of the alliance schools, where possible with representatives from BPA. Where this is not possible, interviews will be held virtually.\r\n\r\nThe interview consists of an observed teaching activity, involving a small group of children, where we gauge your ability to interact with children. You will be given information about this in advance. There is also a set of formal interview questions where we evaluate your experience of working with children to date, your subject knowledge, and your commitment to, and understanding of, the role of a trainee and teacher.\r\n\r\nWe will also ask you to give a short presentation on a given topic.\r\n\r\nThese interviews will help us to assess your suitability for the course applied for and to work with you to discuss school placement requirements.\r\n","howSchoolPlacementsWork":"Candidates will have two placements throughout the year. The main one will be for the majority of the year in the same class, in the same school. This will be called their 'home school.' Where possible, the second placement will be shorter and in a different school and a different key stage from their home school placement, providing candidates with a varied experience. Where it is not possible to provide candidates with a second school, they will remain in the 'home school' but in a different key stage.\r\n\r\nPlacement schools in the alliance are varied and example schools are listed below:\r\n\r\nCharford First School. This is a large 3 form entry first school in Bromsgrove, taking children up to Year 4, with a large Early Years department with nurseries for 2 year olds, rising 3s and 3 year olds.\r\n\r\nBlackwell First School. This is a small one form entry first school in the village of Blackwell, with 150 children on roll, taking children up to Year 4. The school also has a forest school nursery.\r\n\r\nCatshill First School. This is a 2 form entry first school in Bromsgrove, taking children up to Year 4. It also has a Nursery. Catshill First is also federated with Catshill Middle School.\r\n\r\nAnderton Park Primary School . This is a large multicultural school in Birmingham, taking children up to Year 6. There is also a Nursery on site. \r\n\r\nFranche Primary School. This is a large 4 form entry school in Kidderminster, taking children from 3 months to 11 years.\r\n\r\nCrown Meadow First School. This is a two form entry first school in Alvechurch, taking children up to Year 4. It also has a Nursery.\r\n\r\nNelson Mandela Primary School. This is a larger than average sized multicultural school in Birmingham taking children from ages 3 to 11 years.\r\n","personalQualities":"We are looking for candidates that have a genuine passion for teaching, with a commitment to the value of education for all children. \r\nCandidates should also value the whole child and the communities in which they live.\r\n","otherRequirements":"","status":1,"createdAt":"2021-08-04T14:32:38.279Z","updatedAt":"2021-09-24T13:56:43.396Z","canSponsorStudentVisa":"no","cycle":"2024"}
