{"id":"fd351f46-c9ab-45e1-946f-002c3c5bd2bd","name":"Primary","code":"39Z4","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_7","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"4be39e63-52fd-40a4-a7d1-cbcd9bb8a81c","name":"Crown Meadow First School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"ee576170-bcc7-47a0-9919-73d660e24470","name":"Anderton Park Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"170ddbc4-8678-4ef0-9c97-8f9d021c6537","name":"Nelson Mandela Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"a8b71089-f3a8-40d5-a8e6-8afd650f0e54","name":"Catshill First School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"4e76c76e-048c-431c-87b4-2c131fb242b8","name":"Main Site, Charford First School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"938c8dca-9b5e-42e7-9741-fe54b337b0e1","name":"Franche Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"e18a7f92-debf-4f21-b643-2e9fd08810ef","name":"Blackwell First School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"4583557a-6174-49f9-8923-a2aac6a2f4be","code":"2HU","name":"Bromsgrove Primary Alliance"},"accreditedBody":{"id":"62d5803b-89ca-4e21-bb6f-5c74944c56ad","code":"B25","name":"Birmingham City University"},"profPost":"PG","degreeGrade":"1","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Age Range 3-7 years \r\nThis programme is based on a shared vision for educational excellence between BCU and Bromsgrove Primary Alliance (BCU). Trainees on the programme benefit from working with outstanding teachers in schools and at University.  The school based elements of the programme allow trainees opportunities to spend time in school and to make links between their observations and experiences and the taught programme in university. In school, trainees will be provided with a variety of opportunities to observe best practice which addresses the trainees’ development needs.\r\nThis is a full-time, one-year course focused on the 3-7 age range.  The course has been designed towards a more schools-led approach to Initial Teacher Training (ITT) with the placement aspects of the programme ensuring a strong alignment between the university-based and school-based elements. The programme features four strands: \r\n•\tCore (English, Mathematics and Science and/or the prime and specific areas of learning from the Early Years Foundation Stage Curriculum)\r\n•\tProfessional Studies\r\n•\tFoundation (specific areas of learning from the Early Years Foundation Stage Curriculum)\r\n•\tSchool Based Training. \r\nThese strands are developed throughout the year of study to enable trainees to build up their knowledge, understanding and skills in each key area. \r\n\r\nTrainees will also develop their teaching skills through carefully designed School Based Training (SBT) experiences (120 days school based training).The work undertaken in school is closely aligned to the academic modules.\r\nThe programme is designed to recognise that trainees develop their understanding and skills of teaching gradually.  The first block of university teaching prepares trainees for their first teaching block placement. In the first block practice trainees will plan and develop their teaching with support from the class teacher\r\nThe second block of university teaching allows trainees to reflect upon their experiences in school and prepare them for subsequent placements. \r\nYour final block practice will involve trainees taking responsibility for teaching about 80% of the class timetable.  Towards the end of this practice (SBT2) trainees will be summatively assessed against the Teachers’ Standards and graded as pass or fail.\r\nAll trainees will complete module assessments for the three credit bearing modules which must be passed - all are marked in percentages.  The remaining non-credit bearing module will be assessed through teaching practice against the DfE Teachers’ Standards (2012).\r\n","interviewProcess":" We review all applications to assess eligibility and potential suitability for the programme to which a candidate is applying. We recruit and fill places from when UCAS opens in October, so do not delay in submitting your application. \r\n\r\nWe work with our university partners to co-ordinate the recruitment process and hold interviews on a regular basis. Interviews will be held in one of the alliance schools, where possible with representatives from BCU and BPA. Where this is not possible, interviews will be held virtually.\r\n\r\nThe interview consists of an observed teaching activity, involving a small group of children, where we gauge your ability to interact with children. You will be given information about this in advance. There is also a set of formal interview questions where we evaluate your experience of working with children to date, your subject knowledge, and your commitment to, and understanding of, the role of a trainee and teacher.\r\n\r\nWe will also ask you to complete a written task and give a short presentation on a given topic.\r\n\r\nThese interviews will help us to assess your suitability for the course applied for and to work with you to discuss school placement requirements.\r\n\r\n\r\n","howSchoolPlacementsWork":"Candidates will have two placements throughout the year. The main one will be for the majority of the year in the same class, in the same school. This will be called their  'home school.' Where possible, the second placement will be shorter and in a different school and a different key stage to their home school placement, providing candidates with a varied experience. Where it is not possible to provide candidates with a second school, they will remain in the 'home school' but in a different key stage.\r\n\r\nPlacement schools in the alliance are:\r\n\r\nCharford First School. This is a large 3 form entry first school in Bromsgrove, taking children up to Year 4, with a large Early Years department with nurseries for 2 year olds, rising 3s and 3 year olds.\r\n\r\nBlackwell First School. This is a small one form entry first school in the village of Blackwell, with 150 children on roll, taking children up to Year 4. The school also has a forest school nursery.\r\n\r\nCatshill First School. This is a 2 form entry first school in Bromsgrove, taking children up to Year 4. It also has a Nursery. Catshill First is also federated with Catshill Middle School.\r\n\r\nAnderton Park Primary School . This is a large multicultural school in Birmingham, taking children up to Year 6. There is also a Nursery on site. \r\n\r\nFranche Primary School. This is a large 4 form entry school in Kidderminster, taking children from 3 months to 11 years.\r\n\r\nNelson Mandela Primary School. This is a larger than average sized multicultural school in Birmingham taking children from ages 3 to 11 years\r\n","personalQualities":"We are looking for candidates that have a genuine passion for teaching, with a commitment to the value of education for all children. \r\n\r\nCandidates should also value the whole child and the communities in which they live.","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:55:27.712Z","updatedAt":"2021-09-24T14:10:11.972Z","canSponsorStudentVisa":"yes","cycle":"2024"}
