{"id":"8c740106-368e-47af-bf5f-3af1e3109979","name":"Primary (Special Educational Needs)","code":"2W2Q","qualification":"pgce_with_qts","startDate":"2024-07-31T23:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"yes","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"fbe4ef06-dd0c-4336-8448-745c6ee88fc4","name":"Nuneaton & Bedworth","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"a334a6f9-3905-4953-9079-44974a2e0f6d","code":"23E","name":"Gateway Alliance (Midlands)"},"accreditedBody":{"id":"ef09ce50-ccfc-4346-a0ce-43e840153dab","code":"W20","name":"The University of Warwick"},"profPost":"PG","degreeGrade":"1","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We will consider candidates who need to take a GCSE equivalency test in English, maths or science.\n\nWe can accept 3rd party tests from the following approved companies: Equivalency Testing - Offer a discounted rate of £160 (normal price £175) A Star Equivalency - Have a special offer for University of Warwick applicants for equivalency exams (all subjects) to be booked for £139 (normal price £165) Please contact cte.admissions@warwick.ac.uk for the discount code.","courseLength":"OneYear","feesUK":9250,"financialSupport":"Home and EU students can apply to the Student Loans Company for a tuition fee loan to cover the cost of the fees.","aboutCourse":"This 1-year postgraduate course will recommend you, on completion, for Qualified Teacher Status (QTS) with full PGCE, to teach children aged 5-11 in primary, infant, junior, first and middle schools (including 90 CATS points towards a Masters). \r\n\r\nFor the majority of the training year you will be based at your 'host school' which will be a special school  setting. You will also spend 1 term on a complementary placement, in a mainstream primary school setting.\r\n\r\nYou will be supported by an in-school 'professional mentor', a 'personal tutor' at the University and a 'moderation tutor' also from the University. Gateway also provides access to a 'lead mentor' who will support your professional development, facilitate opportunities for you to network with other trainees and ensure the support received throughout the training year is of the highest quality. \r\n\r\nThe training programme has been developed to help you to feel part of the school team from day 1. You will undertake a pre-course induction prior to starting your training and this will be followed by a University induction during late August. \r\n\r\nYou will be in school from the first day of the school year so from the very start you will be treated as a member of staff and will attend staff meetings and development days. Your learning will be supported through structured training days at the University, complemented by your time in school to put the theory into practice and begin to develop your own skills in the classroom. Throughout the training year the amount of teaching that you take on will be gradually increased at a pace to suit you, supported at all times by in-school and academic mentoring. \r\n\r\nRunning alongside the University taught programme are a series of training days led by the Gateway Alliance, these sessions focus on key areas of practice and also provide a great opportunity for networking with other Gateway trainees.\r\n\r\n\r\n\r\n","interviewProcess":"The Gateway Alliance will be leading the recruitment process working in partnership with the University of Warwick. \r\n\r\nShort-Listing\r\nWe will shortlist against the selection criteria and successful applicants will usually be invited to interview in one of our partner schools.\r\n\r\nPlease note: \r\n* All candidates must meet the minimum entry requirements\r\n* Where candidates are from overseas please contact the University of Warwick or NARIC to check equivalency of qualifications.\r\n* Where there are gaps within work history then this may delay your application as further checks may have to take place.\r\n\r\nInterviews\r\nAll shortlisted candidates will be invited to attend a school based interview. (Please note that interview arrangements may vary due to the COVID-19 pandemic).\r\n\r\nThis will involve the following: \r\n\r\n* 10-15 minute observed teaching task\r\n* Group discussion activity\r\n* Panel interview\r\n\r\n","howSchoolPlacementsWork":"As part of the selection process, candidates are asked to share their preferences regarding location of school.  We support a wide partnership of over 30 schools in a range of locations across Warwickshire and Coventry and will use the recruitment and selection process to match you to a school which is best placed to meet your individual training needs.  \r\n\r\nOn this programme you will undertake the majority of your training in a special school. You will spend a term in each of the 3 primary age groups: Key Stage 1, Lower Key Stage 2 and Upper Key Stage 2. Alongside your time in school, trainees will spend approximately 1 day per week at the University for the formally taught element of the programme.\r\n\r\nFor the majority of the training year you will be based at your 'host school', however you will spend 1 term on a complementary placement, in a mainstream primary school setting. You will also have the opportunity to  spend time in a number of the other partner schools to widen your experience of school life. \r\n","personalQualities":"We look for candidates with the following strengths: \r\n\r\n* Passion for learning and an interest in/knowledge of education\r\n* Excellent communication skills (both written and verbal)\r\n* Ability to stay calm and deal with stressful situations\r\n* Drive to succeed and resilience in the face of difficulty\r\n* Experience of working with children with Special Educational Needs\r\n* Being part of a team and working collaboratively\r\n* Sense of fun!\r\n* Reflective practitioner who is fully committed to their own professional development\r\n* Willing to travel/ able to work in a range of locations\r\n","otherRequirements":"\r\nAlthough there is no set amount of school experience that we require, the experience that you have gained should be meaningful, relevant and significant and it should enable you to talk about learning in a range of settings. Please reflect on this experience and explain in your application form what you have learnt from it. \r\n\r\nIt should also have given you an insight into the workload expectations and how highly demanding the role of a teacher is. \r\n","status":1,"createdAt":"2021-07-06T10:50:05.466Z","updatedAt":"2021-09-30T13:21:29.395Z","canSponsorStudentVisa":"yes","cycle":"2024"}
