{"id":"49ea0efe-485e-4639-a6d8-379976e6ce91","name":"Chemistry","code":"FX11","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"P","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"912d4fb4-761b-42e9-8dc6-e968b791ea4e","code":"F1","name":"Chemistry"}],"locations":[{"id":"304c911c-20d4-4b51-84c7-0a1322934ab3","name":"Main Site","isPublished":"Y","status":"R","vacancies":"P"}],"trainingProvider":{"id":"049fe65f-08dc-4686-9ac8-606dce490128","code":"G56","name":"Goldsmiths, University of London"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We accept equivalency tests, please contact Goldsmiths directly to confirm if the test you are planning to take is acceptable. We may be able to offer equivalency tests dependent on regulations relating to Covid 19 and would communicate this if you are offered a place.\n[GCSE equivalencies](https://www.gold.ac.uk/pgce/apply/entry-requirements/gcse-accepted-equivalencies/)","courseLength":"TwoYears","feesUK":4625,"feeDetails":"Part Time Fees: £4625 per year\r\n\r\n","financialSupport":"[Scholarships and bursaries](https://www.gold.ac.uk/pgce/fees-funding/scholarships/)","aboutCourse":"\r\nThe programme is grounded in the view that the process of gaining QTS with a PGCE must essentially be an educational one. Drawing upon your specialism in Chemistry, we encourage you to form your own opinions on education through first-hand experience and reflective thinking. We anticipate that you'll develop qualities that will enable you to become teachers who will not only be outstanding classroom practitioners, but will also be in a position to participate in and influence the development of science education for the future. The Subject Studies Module will be assessed in Year 1 of the programme.\r\n\r\nIn Studies and Professional Issues in Research in Education (SPIRE)  sessions you will be asked to: consider issues relating to diversity and inclusion; engage with research and policy and link all of this to your own experience in the classroom. In your written assignment you'll choose one area from this module to reflect upon more deeply. The SPIRE module will be assessed in Year 2 of the programme. \r\n\r\nYou'll spend a minimum of 120 days in school. They are divided into two block school experiences allowing you to develop a broad understanding of the role of the teacher in contrasting settings. In addition to school placements you will spend the equivalent of 8 weeks in University. In this time you will have mix of lectures and small group seminars which are designed to support you in developing a strong and confident knowledge of your subject area. This module will assessed across Years 1 and 2. \r\n\r\nUnderpinning the programme is the Professional Studies course which is designed to prepare you fully for the wider roles and responsibilities of the teacher. This programme will be enhanced by ongoing training during school experience and will include aspects such as: behaviour management, working with pupils with English as an Additional Language and Special Educational Needs. Assessment of this module is through a portfolio of evidence and will require you to demonstrate your engagement across all eight of the Teachers’ Standards.\r\n\r\n\r\nThe programme is taught and assessed at masters level. In addition to a recommendation for QTS, if you pass all academic elements of the programme, you will also leave with 120 masters level credits which is equivalent to one third of a masters degree. Academic support is provided to ensure you are fully prepared for assessment regardless of your prior experiences. \r\n\r\n\r\n\r\n[PGCE Part-time Chemistry](https://www.gold.ac.uk/pgce/secondary-flexible/)","interviewProcess":"Interviews take place either at Goldsmiths or in one of our partnership schools.\r\n\r\nThe interview will require you to demonstrate your own knowledge in the subject you are intending on teaching as well as including activities to gauge your understanding of the teaching profession.\r\n\r\nActivities at interview will include:\r\n\r\n*  A written English test;\r\n*  An opportunity to demonstrate group work skills;\r\n*  An individual interview;\r\n* In Science Interviews you are required to prepare a short presentation to show your understanding of a current issue in Science education.\r\n","howSchoolPlacementsWork":"This programme offers you the opportunity to specialise in the 11-18 age range.\r\n\r\nWe work with a partnership of over 300 schools across London and beyond. This means that during your time on the PGCE (QTS) programme you will have the opportunity to work in contrasting schools and settings which will provide breadth to your understanding of the role of the teacher.\r\n\r\nYou will have two extended placements  which will be divided across the two year programme.  Placements are allocated for you once you have enrolled onto the programme. \r\n\r\n*Please note that the second school experience for part time students will require you to be in school on a full time basis. \r\n\r\nIn placing you we take into account any care responsibilities or personal circumstances and we will locate a school for you that is within a reasonable travelling distance from your home in the light of this\r\n\r\n\r\n","personalQualities":"In addition to a strong subject knowledge, we are looking for applicants that have an understanding of the nature of working in an urban setting and have a clear commitment and enthusiasm for working with young people. \r\n\r\nYou must be able to show resilience and be willing to work with others.","otherRequirements":"You do not need to have extensive school experience before applying but we will expect you to have a clear understanding of some of the realities you will face in the classroom. \r\n\r\nYou will also need to fulfil our [Fitness to Train requirements](https://www.gold.ac.uk/fitness-to-train/)\r\n","status":1,"createdAt":"2021-07-06T10:56:02.128Z","updatedAt":"2021-09-15T14:46:40.115Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
