{"id":"f699c39f-5afa-4ba0-94a1-ae017cbe746b","name":"Drama","code":"W4X1","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"69052223-ca45-4781-a8d3-cb92447a6d78","code":"13","name":"Drama"}],"locations":[{"id":"304c911c-20d4-4b51-84c7-0a1322934ab3","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"049fe65f-08dc-4686-9ac8-606dce490128","code":"G56","name":"Goldsmiths, University of London"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We accept equivalency tests, please contact Goldsmiths directly to confirm if the test you are planning to take is acceptable. We may be able to offer equivalency tests dependent on regulations relating to Covid 19 and would communicate this if you are offered a place.\n[GCSE equivalencies](https://www.gold.ac.uk/pgce/apply/entry-requirements/gcse-accepted-equivalencies/)","courseLength":"OneYear","feesUK":9250,"financialSupport":"[Scholarships and Bursaries](https://www.gold.ac.uk/pgce/fees-funding/scholarships/)","aboutCourse":"We recognise the importance and potential of theatre as an art form, and it is our goal to use it to promote the personal, social, spiritual and cultural development of all pupils, including the ones you'll go on to teach. This programme is designed to create teachers who will operate as artists in education, empowering young people through Drama, and encourage you to reach your full potential as a qualified teacher. It integrates process and performance, teaching both through and about the art form. In this way, you’ll be able to benefit from a whole host of transferable skills, enabling you to develop personally and professionally through both practical and theoretical enquiry. \r\n\r\nThe Studies and Professional Issues in Research in Education ( SPIRE) module focusses on issues that most impact upon the young person’s experience of education in the 21st Century. In sessions you will be asked to: consider a range of issues relating to diversity and inclusion; engage with research and policy and link all of this to your own experience in the classroom. \r\n\r\nYou'll spend a minimum of 120 days in school. Divided into two block school experiences this will allow you to develop a broad understanding of the role of the teacher in contrasting settings. You will also spend the equivalent of 8 weeks in University, with a mix of lectures and small group seminars which are designed to support you in developing a strong and confident knowledge of your subject area.\r\n\r\nUnderpinning the programme is the Professional Studies course which prepares you for the wider roles and responsibilities of the teacher. This will be enhanced by ongoing training during school experience and will include aspects such as: behaviour management, working with pupils with English as an Additional Language and Special Educational Needs. Assessment of this module is through a portfolio of evidence and will require you to demonstrate your engagement across all eight of the Teachers’ Standards.\r\n\r\nThe programme is taught and assessed at masters level. In addition to a recommendation for QTS, if you pass all academic elements of the programme, you will also leave with 60 masters level credits, equivalent to one third of a masters degree. Full academic support is provided to ensure you are fully prepared for assessment regardless of your prior experiences. \r\n\r\n[PGCE Drama](https://www.gold.ac.uk/pgce/secondary-drama/)\r\n","interviewProcess":"Interviews take place either at Goldsmiths or in one of our partnership schools. \r\n\r\nInterviews will require you to demonstrate your own knowledge in the subject you are intending on teaching as well as including activities to gauge your understanding of the teaching profession. \r\n\r\nActivities at interview will include:\r\n \r\n*\tA written English test;\r\n*\tAn opportunity to demonstrate group work skills; \r\n*\tAn individual interview; \r\n*\tPractical work with groups of learners and the opportunity to work as a group to demonstrate your understanding of effective drama practice; \r\n\r\n\r\n\r\n","howSchoolPlacementsWork":"The Secondary PGCE Programme at Goldsmiths offers you the opportunity to specialise in the 11-18 age range.\r\n\r\nWe work with a partnership of over 300 schools across London and beyond. This means that during your time on the PGCE (QTS) programme you will have the opportunity to work in contrasting schools and settings which will provide breadth to your understanding of the role of the teacher. \r\n\r\nYou will have two extended placements during your programme during the Autumn and Spring/ Summer terms. \r\n\r\nPlacements are allocated for you once you have enrolled onto the programme. In placing you we take into account any care responsibilities or personal circumstances and we will locate a school for you that is within a reasonable travelling distance from your home in the light of this. \r\n","personalQualities":"In addition to a strong subject knowledge, we are looking for applicants that have an understanding of the nature of working in an urban setting and have a clear commitment and enthusiasm for working with young people. \r\n\r\nYou must be able to show resilience and be willing to work with others.","otherRequirements":"You are expected to be practitioners in your own right with experience in the theatre industry. \r\n\r\nIf you would like to discuss this before application please contact Amanda Kipling by email: a.kipling@gold.ac.uk\r\n\r\nYou will also need to fulfil our [Fitness to Train requirements](https://www.gold.ac.uk/fitness-to-train/)","status":1,"createdAt":"2021-07-06T10:56:02.331Z","updatedAt":"2021-09-15T14:49:32.166Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
