{"id":"e2cd3fac-3813-4010-886d-81abc95a450b","name":"Primary","code":"2VDM","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"3_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"30fc05e2-ef20-48cf-8070-6f443f0e082a","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"90f55747-ad64-4808-817b-80436a6247c9","code":"1RR","name":"Henry Maynard Primary School"},"accreditedBody":{"id":"e4195146-aae7-4f6c-9d14-91edd0962da4","code":"2AW","name":"Henry Maynard Training E17"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","science":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"no","courseLength":"OneYear","feesUK":null,"aboutCourse":"Please note: We can only accept applications from candidates currently employed in a school and where the school is willing to pay the candidate's full salary plus training costs.\r\n\r\nThis programme leads to the award of Qualified Teacher Status (QTS) and the academic award of a Post Graduate Certificate in Education (PGCE).  The PGCE is currently validated by the University of Brighton.\r\n\r\nTrainees on the School Direct Salaried programme are employed as an unqualified teacher by the school in which they are based and learn ‘on the job’ alongside experienced teachers. As a paid employee there is an expectation that you will be able to teach classes or groups from day one and that you will be “up and running” quite quickly. You can be expected to teach up to 90% of a teacher’s timetable from September.\r\n\r\nTrainees on the School Direct Salaried programme will attend centre-based training at Henry Maynard Primary School. Initially this will be 2 days per week but as the year progresses it will reduce to one day a week and then less frequently. The remaining days will be spent in school teaching and completing school based tasks.\r\n\r\n","interviewProcess":"Candidates are short-listed following reference to the person specification and, if successful, are invited for interview. The interview day can take place at Henry Maynard Primary or in your own school. \r\n\r\nDuring the interview you will:\r\n\r\n*be observed delivering a 30 minute maths or English lesson to a class or, if visits to schools are not possible, delivering a short video presentation \r\n*have an interview with a panel consisting of the Henry Maynard Training E17 Manager and headteachers or representatives from our partner schools\r\n*We will assure the fundamental maths and English skills of all applicants.  Applicants will complete our internal maths and writing tests. (The tests are intended to assess your ability to communicate effectively in written English and your competence in a range of mathematical skills. Maths will be at approximately KS3 level and literacy will be an extended writing task.)","howSchoolPlacementsWork":"When applying for the School Direct Programme, you must have a school that is willing to employ you as an unqualified teacher as we are unable to find a school for you.\r\nYou will select to train in either 3-7 or 5-11 phase. In the 3-7 phase you will have one placement in EYFS and one in KS1. In the 5-11 phase you will have one placement in KS1 and one in KS2. \r\nYou will complete a second placement of 6 weeks in a contrasting school. We will arrange the second placement. Our partner schools are in Waltham Forest, Islington and Hackney.","personalQualities":"\r\n*The ability to communicate clearly and accurately in Standard English \r\n*A commitment to teach and a motivation to learn\r\n* Well developed personal qualities and skills such as self-organisation, resilience and reflectiveness\r\n*A commitment to equal opportunities\r\n*An understanding of, and commitment to, the safeguarding of children\r\n","otherRequirements":"It is the duty of all schools to protect vulnerable children and adults. If you are offered a place on the programme, the school will apply for a DBS check for you.\r\nThe form will contain details of any cautions, convictions, reprimands or any warnings recorded against your name (even where they would generally be considered spent), or will confirm that you have none. It will allow the school to make an assessment of your suitability for access to these vulnerable groups.\r\nPlease visit: www.gov.uk/disclosure-barring-service-check/overview","status":1,"createdAt":"2021-07-06T10:56:29.709Z","updatedAt":"2021-09-28T09:38:37.011Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"Trainees will be paid on at least post 1 of the Unqualified Teacher pay scale.\r\nThere are no fees for this course."}
