{"id":"66405a9b-fb90-498c-b7b5-39b99ac9510f","name":"Primary","code":"L911","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"other","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"e0e198f5-5f6c-45f2-9d7e-d8c3ac705d97","name":"Trumpington Park Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"f4444263-2784-48fc-97e2-5537aed1886d","name":"Abbots Green Community Primary School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"43b1a864-362f-4bc3-a929-616100971340","code":"1MJ","name":"Barrow CEVC Primary School"},"accreditedBody":{"id":"16075b74-df88-4bcc-b3ce-6e42f63261d5","code":"1WO","name":"The Cambridge Teaching Schools Network, CTSN SCITT"},"profPost":"PG","degreeGrade":"1","english":"1","maths":"1","science":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"You would need to have GCSE qualifications (grade C/4 or better) in Mathematics, English and Science, or a confirmed equivalent qualification.","courseLength":"OneYear","feesUK":9250,"feeDetails":"£9,250, often covered with a student loan.  You would also qualify for a means tested maintenance loan.  For further information please follow the link to the [Department for Education - Get into Teaching Website](https://getintoteaching.education.gov.uk/funding-my-teacher-training).","aboutCourse":"As a school based provider of initial teacher training, CTSN SCITT is very much grounded in the life of its local schools.  All the tutors on the course are experienced teachers, able to guide trainees into a thorough understanding of all aspects of the primary curriculum and appropriate pedagogy, informed by both research and the tutors’ own practice.  During the course, trainees will spend one day (usually Thursdays) in Core Training, and the remaining 4 days a week in school.  Whilst in school, trainees carry out specific teaching tasks, which will increase throughout the year, but also have plenty of time to get involved in other training activities: observing expert teachers; working with children in smaller groups; one-to-one tutoring; time for assessment and planning; reading, writing and research into effective learning and teaching.  Every trainee has a mentor (usually the class teacher) with whom teaching and other tasks are planned and evaluated at weekly mentor meetings; these meetings are the hub of the school based training.  In addition, each trainee is assigned to one of the senior tutor team who visit the trainee in school and support their learning throughout the year.  This provides a strong support network for the trainee throughout the course.  Trainees will have a choice of attending core training in either Cambridge or Bury St Edmunds.  The course will lead to the award of both QTS and PGCE (Anglia Ruskin University).  For further details please follow the link to [CTSNSCITT](https://ctsnscitt.info).","interviewProcess":"At interview you will usually be asked to teach a Key Stage One or Key Stage Two class for 15 minutes; you will be advised of the year group prior to interview.  In addition there will be a short written task, a maths test  and an interview with a SCITT Senior Tutor, together with a senior teacher from one of our partnership schools.","howSchoolPlacementsWork":"We have excellent relationships with a wide range of good and outstanding schools, across the Eastern region, which gives us considerable flexibility in placing trainees in local schools, within reach from their home. You will spend the first term in one school and then, after Christmas, move to a contrasting school for the remainder of the course.","personalQualities":"As a school based ITT provider, CTSN SCITT works very closely with its partnership schools, and the vast majority of our trainees get jobs working in these local schools.  We are looking for creative, proactive, positive applicants who share our commitment that children in our local schools should have the best possible teachers, and a desire and determination to make this commitment a reality.","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:50:05.704Z","updatedAt":"2021-10-01T15:59:47.071Z","canSponsorStudentVisa":"no","cycle":"2024","applicationsOpenDateOther":"2021-10-15T00:00:00.000Z"}
