{"id":"a1fb108f-bcbd-4582-9b41-0643ef948409","name":"Primary","code":"3FDQ","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"08e7e88a-2115-415f-b322-eb0cbaa3f9ed","name":"Suffolk and Norfolk Primary SCITT","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"43b1a864-362f-4bc3-a929-616100971340","code":"1MJ","name":"Barrow CEVC Primary School"},"accreditedBody":{"id":"89831af6-535f-471b-aa97-098bd1a93291","code":"S13","name":"Suffolk and Norfolk Primary SCITT"},"profPost":"PG","degreeGrade":"1","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"Please note, we do accept Level 2 qualifications in Numeracy and Literacy as equivalencies.","courseLength":"OneYear","feesUK":9250,"feesInternational":9250,"financialSupport":"You may be eligible for a loan while you study.\r\nFinancial support if you're from outside the UK. ","aboutCourse":"We offer specialisms in General Primary and Early Years. We provide a unique opportunity across Norfolk and Suffolk for trainees to immerse themselves in a diverse range of teaching and training experiences which by the final term are highly personalised.\r\n\r\nThe training comprises of 3 placements in 2 contrasting schools over the course of the year combined with approximately 55 days in centre training. \r\n\r\nThe centre based training is provided by expert trainers, many of whom are still serving teachers. It covers all National Curriculum subjects and key aspects of primary education such as behaviour management, SEND and assessment. Trainees also have sessions focused on the two assignments and one presentation which contribute to their PGCE qualification (including 60 credits at M Level).\r\n\r\nAll trainees have a personal tutor who is committed to supporting each trainee over their training year.  This includes weekly email contact, visits to observe teaching and end of term progress interviews. \r\n\r\n","interviewProcess":"The Tuition SCITT team will be co-ordinating the recruitment process with partnership school head teachers. \r\n\r\nYou will be invited to a task day where you will undertake a short written activity to gauge your fundamental English skills and a group task focused on interpersonal skills.  \r\n\r\nThis will be followed by an interview that will begin with you giving a short presentation.\r\n\r\n","howSchoolPlacementsWork":"We have access to the SCITT partnership of over 250 schools. This is well-established and we have clear and strong working relationships with a range of primary schools across Suffolk and Norfolk. We go to great lengths, through quality assurance and our local knowledge, to ensure that all placements are of a high standard. Trainees are supported by school mentors who are enthusiastic, committed and well-trained individuals. \r\n\r\nTrainees spend approximately 26 weeks on school placement. Most of this is in the main placement school in the autumn and summer terms, with the spring term in a contrasting school.\r\n\r\nThe distance to school placements will vary. These take into account the trainee’s home address, whether they have their own transport and the placement that the school is able to offer. Our policy is to endeavour to keep journey times to school to a maximum of 50 minutes each way.\r\n\r\n","personalQualities":"We are looking for committed, resilient individuals who are ready to undertake an exciting but rigorous training year. We are interested in people who are passionate and enthusiastic about children's learning and have a desire to promote the best outcomes for all children. You need to be open to constructive feedback and see it as a tool to help you to achieve your potential by the end of the year.  You must be organised and self-motivated as although you will be well supported, you also need to be focused on the commitment involved within this training year.  ","otherRequirements":"- Confirmation of clear enhanced DBS check before you start the course. This is paid for by Primary SCITT. It is expected that you join the update service (£13 per year at a cost to you).\r\n- Meet the 'Fit to Teach' criteria. Primary SCITT use an Occupational Health provider to assess Fitness to Teach. The initial screening is paid for by Primary SCITT, trainees may be asked to contribute towards further costs.\r\n- You may require a certificate of good conduct if you have lived overseas in the past five years.\r\n\r\n","status":1,"createdAt":"2021-07-06T10:50:05.673Z","updatedAt":"2021-10-05T10:49:24.943Z","canSponsorStudentVisa":"no","cycle":"2024"}
