{"id":"5f9af7fc-8186-4dfd-a251-18757a0faf44","name":"Primary","code":"AT88","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"B","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"2ef46a21-f0f2-427b-b001-01fc559393c1","name":"Chesterton Primary School","isPublished":"N","status":"N","vacancies":"B"},{"id":"f25c3139-5ca9-46bb-bae1-b74dd81c16c5","name":"Upwell Academy","isPublished":"N","status":"N","vacancies":"B"},{"id":"357525b0-1f05-4cd9-8988-7ed448f402e0","name":"Earith Primary School","isPublished":"N","status":"N","vacancies":"B"},{"id":"994407cd-aefb-4831-85e8-9f8917293f49","name":"Isle of Ely Primary School","isPublished":"N","status":"N","vacancies":"B"},{"id":"8c698a7b-9d93-4e1f-9ac5-2988afab2a24","name":"Burrowmoor Primary School","isPublished":"N","status":"N","vacancies":"B"},{"id":"79337092-1998-45a8-bb08-d2a548a4fd7b","name":"Main Site (Cromwell Community College)","isPublished":"N","status":"N","vacancies":"B"}],"trainingProvider":{"id":"334aaa65-76f2-48e6-b8a8-ebbdea6aec3d","code":"2KL","name":"Active Teacher Training"},"accreditedBody":{"id":"af388cc3-644a-4fd3-bd71-55503b74fc21","code":"B22","name":"University of Bedfordshire"},"profPost":"PG","english":"3","maths":"3","science":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"The course is designed to help you fulfil a wider teaching role, including that of pastoral care, within your chosen educational context. \r\n\r\nCompletion of this course will provide you with a PGCE and Qualified Teacher Status (QTS). \r\n\r\nOur course provides you with placements in two contrasting schools and one day a week will be spent with our partners at The University of Bedfordshire. You will have experienced subject specialist mentors in both of your placement schools as well as a team of academic staff ready to guide and assist you at University.\r\n \r\nYou will be given the opportunity to follow a professional development programme throughout the year and you can expect to attend a range of lectures and seminars as well as, of course, lots of hands-on classroom experience. You will be introduced to your new role in stages, beginning with observation and work with individual pupils, then small groups and eventually you will be working with your own classes on 80% of a regular teacher's timetable.\r\n\r\nAssessment is carried out across both placements against the Teachers' Standards. \r\n\r\nWhen you decide to apply to train to teach with us, you will be choosing a provider with decades of experience. Our experienced teaching staff will provide you with lots of advice, challenge and support.\r\n","interviewProcess":"All our trainees who are shortlisted for interview are typically invited to complete some of the following activities: \r\n\r\n•\tShare your views about why you'd like to be a teacher.\r\n\r\n•\tComplete a face to face interview with a small panel.\r\n\r\n•      Complete a classroom based exercise, where you will be observed interacting with children or young people.\r\n\r\nWhen you're shortlisted, we'll tell you exactly what to expect.\r\n","howSchoolPlacementsWork":"Your first two weeks are typically spent on the University campus. \r\n\r\nThereafter, most of your training weeks involve 4 days a week in your placement school teaching, planning and observing and one day a week at university working on teaching pedagogy, helping you learn the skills to make you an effective teacher. \r\n\r\n\r\nWe always aim to place candidates in schools which match their needs. We will do everything we can to match your ability to travel to the schools we place you in. \r\n\r\nWe usually operate an A-B-A model. This means that you'll begin and end at one school, and spend time in your second contrasting placement school in the second, middle term.\r\n","personalQualities":"We're looking for applications from people who are motivated to work with children in order to help them achieve their very best.\r\n\r\nWe also think it's helpful to be resilient,\r\n","otherRequirements":"In addition to your degree and GCSEs in English and maths, you'll need to complete a DBS check and will need to be in good general health.","status":2,"createdAt":"2021-07-06T10:54:49.947Z","canSponsorStudentVisa":"yes","cycle":"2024"}
