{"id":"f464fa28-d280-4e2e-8bf8-4f6abcf93595","name":"Primary","code":"Z346","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"B","ageRange":"3_to_7","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"b9dd5b2c-6a86-4db9-80cf-4c883dbfa0ad","name":"Pakefield Primary School","isPublished":"N","status":"N","vacancies":"B"},{"id":"27f1a5f3-c17f-47cd-8b06-0d5c3c15adb3","name":"Gusford Primary School","isPublished":"N","status":"N","vacancies":"B"},{"id":"4cd0d513-c2f7-4fda-ba93-552769b22edf","name":"Hillside Primary School","isPublished":"N","status":"N","vacancies":"B"},{"id":"550c31c9-f789-4a91-a150-88a4ed718221","name":"Sidegate Primary School","isPublished":"N","status":"N","vacancies":"B"},{"id":"5ed1d5df-6519-4f7e-b1f9-45799cdacab7","name":"Reydon Primary School","isPublished":"N","status":"N","vacancies":"B"},{"id":"2c2ef4f2-1459-4102-a2f4-a113b21a7dd8","name":"Red Oak Primary School","isPublished":"N","status":"N","vacancies":"B"},{"id":"6874ce8a-1fdb-45e3-8820-7a20f9dc463f","name":"Westwood Primary School","isPublished":"N","status":"N","vacancies":"B"},{"id":"e03f1aee-a301-4eb8-9e64-b931593f16a6","name":"Grove Primary School","isPublished":"N","status":"N","vacancies":"B"},{"id":"c1d40864-bd93-460e-ba25-af12e5975a6c","name":"Albert Pye Primary & Ravesmere Infant School","isPublished":"N","status":"N","vacancies":"B"},{"id":"f25c3139-5ca9-46bb-bae1-b74dd81c16c5","name":"Upwell Academy","isPublished":"N","status":"N","vacancies":"B"},{"id":"357525b0-1f05-4cd9-8988-7ed448f402e0","name":"Earith Primary School","isPublished":"N","status":"N","vacancies":"B"},{"id":"994407cd-aefb-4831-85e8-9f8917293f49","name":"Isle of Ely Primary School","isPublished":"N","status":"N","vacancies":"B"},{"id":"8c698a7b-9d93-4e1f-9ac5-2988afab2a24","name":"Burrowmoor Primary School","isPublished":"N","status":"N","vacancies":"B"},{"id":"2ef46a21-f0f2-427b-b001-01fc559393c1","name":"Chesterton Primary School","isPublished":"N","status":"N","vacancies":"B"},{"id":"79337092-1998-45a8-bb08-d2a548a4fd7b","name":"Main Site (Cromwell Community College)","isPublished":"N","status":"N","vacancies":"B"}],"trainingProvider":{"id":"334aaa65-76f2-48e6-b8a8-ebbdea6aec3d","code":"2KL","name":"Active Teacher Training"},"accreditedBody":{"id":"79af57c6-053f-4e75-995a-2eae20fe2ed1","code":"2B2","name":"Yorkshire and Humber Teacher Training"},"english":"3","maths":"3","science":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Teaching is a vibrant, fast-paced and exciting career and we’d love you to train with us. We believe that our accredited mentors and support team ensure that we deliver the very best teacher training around.\r\n\r\nIt’s hands on, hard work in the classroom Monday-Thursdays and then on Friday’s it’s professional studies sessions which are delivered in our brand new in-house teacher training suite on site in Cromwell in Chatteris for trainees in Cambridgeshire or for those studying in Suffolk, your base will be either Ipswich or Lowestoft.\r\n \r\nWe provide unique teacher training opportunities in a supportive and forward-thinking environment. We believe that our teachers who work in schools day in, day out with young people are best placed to provide teacher training. When you join our training programme you will work alongside an assigned mentor and subject specialist tutor who will provide you with bespoke experiences and challenges to help you make progress each week.\r\n\r\nCompletion of this course will provide you with Qualified Teacher Status (QTS). \r\n\r\nDuring the course, you’ll spend time in two school placements and you’ll be assigned a subject specialist mentor so you’ve always got professional support and guidance.\r\n\r\nAssessment is carried out across both placements against the Teachers' Standards. \r\n\r\nTo date, we have helped 100% of our trainees who have wanted our help to find them a job to secure employment.\r\n\r\nThe teachers in our partnership are outstanding practitioners who share a desire to be at the forefront of curriculum innovation, making learning topical, purposeful and thought-provoking.\r\n\r\nWe look forward to working with you!\r\n","interviewProcess":"All our trainees who are shortlisted for interview are typically invited to complete some of the following activities: \r\n\r\n•\tSpend some time in school with us to take a tour, meet children and share your views about why you'd like to be a teacher.\r\n\r\n•\tComplete a face to face interview\r\n\r\n•      Complete a classroom based exercise, where you will be observed interacting with children or young people.\r\n\r\nWhen you're shortlisted, we'll tell you exactly what to expect.\r\n","howSchoolPlacementsWork":"You will be based in your placement school Monday to Thursday. At this time, you’ll have the opportunity to teach, plan, observe and research. \r\n\r\nOn Fridays, you’ll be invited into our teacher training centre in Cromwell Community College in Chatteris if you're based in Cambridgeshire or Ipswich or Lowestoft in Suffolk. This is when you’ll have the opportunity to complete our outstanding professional studies programme which draws on exceptional experts from across our network of schools in Cambridgeshire and Suffolk. \r\n\r\nWe always aim to place candidates in schools which match their needs. We will do everything we can to match your ability to travel to the schools we place you in. \r\n\r\nWe operate an A-B-A model. This means that you'll begin and end at one school, and spend time in your second contrasting placement school in the second, middle term.\r\n","personalQualities":"We're looking for applications from people who are motivated to work with children in order to help them achieve their very best.\r\n\r\nWe also think it's helpful to be resilient, hard-working, inquisitive and have a good sense of humour.\r\n\r\nYou'll need to be a team player as well as be able to work as part of a group. You will have excellent communication skills and presence.\r\n","otherRequirements":"You'll need to complete a DBS check and should be in good general health.","status":2,"createdAt":"2021-07-06T10:54:53.210Z","canSponsorStudentVisa":"no","cycle":"2024"}
