{"id":"a43d2007-d971-4ba6-a171-f892f78c5aa7","name":"Physical Education","code":"38HY","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"74d64a54-5e34-4590-b6c7-528dd0cf26fe","code":"C6","name":"Physical education"}],"locations":[{"id":"dd28f9de-ac16-40fd-9f87-d42eedb380f8","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"eff03c14-006a-4fd8-8ae8-1b3e7f955455","code":"1OM","name":"Valentines High School"},"accreditedBody":{"id":"2e1ce675-b5df-42ab-bb63-1e0435ef5722","code":"E28","name":"University of East London"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We recommend A Star Equivalency https://astraequalivalency.co.uk and equivalencytesting.com. There are costs involved,","courseLength":"OneYear","feesUK":9250,"feeDetails":"Bursaries and scholarships are available for certain courses. Please see\r\n\r\nhttps://getintoteaching.education.gov.uk/funding-my-teacher-training/bursaries-and-scholarships-for-teacher-training","aboutCourse":"The School Direct Programme is designed to ensure that the trainee has a diverse school based experience that allows them to develop their skills in school based settings. You will be placed in schools within the Teaching School Alliance for your main and second placements. \r\n\r\nAs part of the SD programme you will join a highly successful secondary PGCE course at a leading London university and have full access to the University’s facilities. During the PGCE you will work with national and international experts in secondary education and in the teaching of your subject, and draw on the results of research studies in education. Successfully completing all aspects of the course will gain you the award of Postgraduate Certificate in Education (PGCE) which also carries 60 M level credits that may be used towards a subsequent master’s degree. The course also leads to the award of QTS (Qualified Teacher Status).","interviewProcess":"You will be interviewed by two members of the Valentines Teaching School team.\r\n\r\nThe interview process may include some or all of the following activities:\r\n\r\nSubject knowledge activity \r\n\r\nDelivery of a half hour teaching activity to students\r\n\r\nWritten task\r\n\r\nInterview by panel\r\n\r\nYou may be asked to attend a follow up interview at the partner university","howSchoolPlacementsWork":"For the majority of your time with us you will be in school for four days a week with a day spent at university. You will be assigned an experienced mentor in school who will support you by meeting with you weekly, by observing lessons, by drawing up a suitable timetable that will develop your skills and broaden your experience. You will be placed in a school within the Teaching School Alliance for your main placement. In addition to the main placement you will also be placed in a second school  in the Spring term. This will enable you to experience a different environment and work with different pupils. We aim to ensure that student teachers have the opportunity to teach across the 11-18 range at some point within their two placements. You will have the opportunity to spend a day or a short placement at a special school to learn about behaviour management strategies with more challenging students. ","personalQualities":"We are looking for the following qualities and attributes:\r\n\r\n• enjoyment of your subject and the ability to communicate this to young people to stimulate interest in lessons and promote learning\r\n\r\n• the capacity to be reflective and evaluate your teaching and students’ learning\r\n\r\n• adaptability and the ability to work under pressure\r\n\r\n• good inter-personal and team working skills\r\n\r\n• good attendance, punctuality and professionalism\r\n\r\n• good spoken and written English\r\n\r\n• previous experience of working with children and young people\r\n\r\n• familiarity with recent educational developments and trends\r\n","otherRequirements":"Please ensure you have at least observed lessons in secondary schools before interview.","status":1,"createdAt":"2021-07-06T10:52:18.054Z","updatedAt":"2021-09-23T13:08:26.418Z","canSponsorStudentVisa":"yes","cycle":"2024"}
