{"id":"396ded34-3fb5-4984-8aa7-f7a0e1d9638a","name":"Primary","code":"W452","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"65bebf07-5be4-45a0-a19e-d576c5174989","name":"Main Site","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"3040a229-0a4e-4b8f-a4eb-5afb6aca3f50","code":"1NP","name":"East Lancashire Inclusion Partnership"},"accreditedBody":{"id":"76c55af9-5232-41bd-a308-9fc5a4270cdd","code":"P38","name":"Pennine Lancashire SCITT"},"degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"Any equivalency tests completed must be equivalent to GCSE level. We do not accept adult learning courses as these do not offer the breadth of knowledge that the GCSE curriculums cover.\n\nWe recommend using Edgehill University or those offered by Prestolee SCITT. Links to both of these websites are below:\n\nhttps://www.edgehill.ac.uk/study/equivalency/?tab=standalone-tests\n\nhttps://www.prestoleescitt.co.uk/Equivalency-Testing/","courseLength":"OneYear","feesUK":7750,"aboutCourse":"As a partnership we have invested both time and money in ensuring that our student teachers have the best possible foundations to become outstanding teachers. The key philosophy behind our programme is its flexibility for students to study general Primary (mainstream), SEND or both.  \r\n\r\nYou will be allocated a ‘host’ school where you will complete school experience days and your Beginning and Extending placements.  Your Beginning placement takes place in the second half of the Autumn term and lasts for 4 weeks. Your Developing placement takes place in the second half of the Spring term and lasts for 6 weeks. This will be in a different school and contrasting Key Stage. Your final Extending placement lasts for 9 weeks and starts in the first half of the Summer term and continuing through to early July.\r\n\r\nWhen you start in September, up until the start of your Beginning placement, you will be gaining school experience in your host school for two days per week (Tuesday and Thursday) and at Tor View for three days per week receiving lectures studying our ITT curriculum (Monday, Wednesday and Friday).  \r\n\r\nIn addition, you will study Core Units in English, Maths, Science, and all of the Foundation subjects including: History, Geography, RE, PE, Computing, Art & Design, Design & Technology, Music and Modern Foreign Languages as well as Professional Practices content including: Safeguarding. Behaviour Management, Lesson Planning, Assessment, Child Development, Classroom Management, Partnerships, SEND, Transitions and Applying for Jobs.\r\n\r\nThese units introduce you to key concepts and principles in teaching and learning, whilst aiming to develop knowledge, skills and understanding in core areas of teaching: curriculum design, assessment, planning and managing a classroom. The units also aim to develop your ability to reflect on your own practice, professionalism and underpinning values.\r\n\r\nWe are also pleased to offer a range of ELIP modules that are additional to the core programme, and unique to ELIP.  These fall broadly into Mainstream/SEN/Early Years categories, although you are encouraged to select options which appeal, irrespective of which of our programmes you have chosen.  \r\n\r\nPlease email teachingschool@theviewtrust.org if you have any questions about any of this.","interviewProcess":"Once you have submitted your application, it will be reviewed and, if shortlisted, we will contact you to arrange an interview.  Usually, we hold interviews every 2 weeks, and we aim to give you 7 days notice to give you adequate time to prepare.\r\n\r\nYour invite to interview letter will set out the interview day, including a brief for your mini-teach that you will be required to plan and deliver. Usually, interviews are held at local partner schools though applicants to our SEN programme may  be interviewed at Tor View.\r\n\r\nAt the interview, you will conduct a mini-teach session with up to 6 pupils either from a mainstream or SEND primary school.  The brief will reflect the year group of the children.  Your mini-teach will be observed by at least two professionals, usually ELIP's Senior Personal Tutor or Director of Programmes and another Headteacher or Deputy Headteacher from our partner schools.\r\n\r\nFollowing a successful mini-teach, you will complete some assessments in literacy and mathematics. Finally, you will have a face-to-face interview with the same people who observed you during the mini-teach.\r\n\r\nDepending on the number of people being interviewed, the interview process could take several hours to complete but we aim to keep this to a minimum.\r\n\r\nReferences are verified by confirming content and source with the referee. Any issues are clarified with referee and/or candidate.\r\n\r\nWe will also ask to see the original copies of your ID and certificates.","howSchoolPlacementsWork":"East Lancashire Inclusion Partnership partners with over 30 schools providing quality mentoring to our trainee teachers.  These schools are a combination of mainstream and special schools. Our placement opportunities are not only throughout the Rossendale Valley, but also Burnley, Pendle, Hyndburn and Blackburn.  We work with a network of special schools throughout Lancashire and we continue to work with other partners including schools within our Teaching School Hub region to provide placements out of area to assist students with their travel commitments.\r\n\r\nWhen placing students we take a number of factors into consideration, including travel time and whether you are using a car or public transport.  We try to place students close to home, but this is not always possible.  On average our students would not travel more than 45 minutes to get to placement, although many are much closer than this and we would ask for your flexibility and understanding with this, depending on the particular circumstances.\r\n\r\nDuring the course you will have 3 placements.  Primary (General) trainees will have 3 mainstream placements, although we do also offer trainees on this programme the chance to work in a special school to complete their Developing placement. Your Beginning and Extending placements will take place in your host school. Prmary (SEN) trainees complete their Beginning and Extending placements in a special school and the Developing placement will be in a contrasting key stage in a mainstream primary school. Trainees on our Early Years programme complete their Beginning placement in a Nursery school, Developing placement in a mainstream KS1 classroom and their Extending placement in a mainstream Reception class. These don't necessarily all take place in different schools.\r\n\r\n•\tBeginning placement : 4 weeks long, 2nd half of the Autumn term.\r\n•\tDeveloping placement : 6 weeks long, 2nd half of the Spring term.*\r\n•\tExtending placement : 9 weeks long, Summer term.\r\n\r\nYou will also be in your host school for 2 days a week outside of your official placements.\r\n\r\n*We also now have a partnership to offer international placements in Brussels, Prague and Rome. Information can be provided on request.","personalQualities":"We seek trainees with: \r\n\r\n-commitment to protect and safeguard children and young-people; \r\n\r\n-passion to deliver the highest quality of educational standards; \r\n\r\n-genuine liking for and understanding of children and young-people; \r\n\r\n-high standards of personal and professional conduct; \r\n\r\n-an ability to be an independent and autonomous learner; \r\n\r\n-commitment to continual personal and professional development. \r\n\r\nOur trainees will have the following competencies: \r\n\r\n~Humility, respect and empathy.\r\n\r\n~Respect and value the different experiences, ideas and backgrounds of others. \r\n\r\n~Excellent communication skills.\r\n\r\n~Work collaboratively and supportively with colleagues. \r\n\r\n~Manage time effectively. \r\n\r\n~Find solutions to complex situations or issues. \r\n\r\n~Adapt to new situations.\r\n\r\n~Be reflective. ","otherRequirements":"As a safer recruitment provider, we are committed to safeguarding children.  A satisfactory Enhanced Disclosure and Barring Service (DBS) check is a course requirement and is completed ahead of starting the programme.\r\n\r\nWe complete checks of relevant suspension and prohibited lists. We ask you to disclose any information that would subsequently be made known to us through the DBS process, and/or other relevant disclosures to be investigated as part of our safeguarding responsibilities.\r\n\r\nIf successful, you will also be required to complete a health check to assess if you are fit to teach.","status":1,"createdAt":"2021-07-06T10:55:57.379Z","updatedAt":"2021-10-05T10:37:27.424Z","canSponsorStudentVisa":"no","cycle":"2024"}
