{"id":"840ba3b2-ded1-4d24-a13e-d9981209e6d1","name":"Primary (Mainstream and SEND routes, 3-7 & 5-11)","code":"29MQ","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_11","subjectLevel":"primary","isSend":"yes","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"34098f40-3c3e-4c28-a829-db5035de766e","name":"BTSA based at Belgrave St Bartholomew's Academy","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"af5b5b1e-a874-4ac6-ab44-9a9bdf84bcce","code":"14D","name":"BTSA (Bart’s Training and Support Alliance)"},"accreditedBody":{"id":"aa023df3-b71e-4249-b9c4-41fca8bd135e","code":"D39","name":"University of Derby"},"profPost":"PG","degreeGrade":"1","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We accept equivalency tests from the following:\n\nwww.equivalencytesting.com\n\nUniversity of Derby in-house equivalency test","courseLength":"OneYear","feesUK":9250,"feeDetails":"Fee for UK and EU students: £9,250 per year (2019/20)\r\n.\r\nPlease note that all fees may be subject to annual increase.\r\n\r\n\r\n","financialSupport":"To pay for your tuition fees and living costs, you may be able to take out a student loan. These loans don’t usually need to be paid back until you have graduated and are earning a good salary.\r\n\r\nSometimes, bursaries and scholarships are also available - it depends on your circumstances and which country you usually live in. These don’t need to be paid back.\r\n\r\nPlease visit the University of Derby website for more information or call the helpline on 01332 592000. \r\n","aboutCourse":"BTSA is an alliance of schools, and other partners, who are working together to train the next generation of outstanding teachers. Every member of the Alliance has a track record of being totally committed to delivering on this National College priority area.\r\n\r\nWhy choose BTSA?\r\n\r\n* A strong, well established partnership\r\n* A successful track record\r\n* An employment record well above the national success rate\r\n* In partnership with The University of Derby – an outstanding provider for ITT\r\n* Opportunities for varied placements in great schools\r\n* A unique opportunity for an enhanced international placement in Holland\r\n* A wide range of experts to provide practical help and support\r\n* Excellent track record of trainees rated as good or outstanding and securing NQT posts following completion of the programme\r\n\r\nThe School Direct teacher training route is led by BTSA, working in partnership with local schools and The University of Derby. You have the option to choose a route that matches your career aspirations - choose Early Years (3-7), Primary (5-11) or Special Educational Needs and Disability (SEND) which encompasses either Early Years (3-7) or Primary (5-11). As well as Qualified Teacher Status, you will also gain a PGCE equivalent to a third of a master’s degree with The University of Derby upon completion of the programme.\r\n\r\nAway from the classroom, you’ll receive practical training sessions from Specialist Leaders of Education, experienced teachers and the team at BTSA. These training sessions will take place at the BTSA hub located in Longton, Stoke-on-Trent. The University of Derby will also lead sessions to support your academic development; these sessions will take place at the university site in Derby.\r\n\r\nHow are you assessed?\r\n\r\nAll assessments relate to your school placements; you will complete three assessed teaching placements, two in your main school and one in a second school, and additional enhanced school opportunities which will provide you with the challenging and varied experiences you need. There will be in-depth teacher enquiry on school-based issues. There are a variety of assessment modes which you will encounter e.g. presentation, academic poster, essay.\r\n\r\nYou'll also have the opportunity to reflect on and discuss your developing subject knowledge of the core and wider curriculum subjects, as well as developing your skills in research-informed practice.\r\n","interviewProcess":"Our interview process has been tailored to ensure that all candidates have the opportunity to demonstrate their potential to train to teach in a warm and welcoming environment. ","howSchoolPlacementsWork":"All of our schools are quality assured, effective schools. Most schools belong to St. Bart’s Trust or are Strategic Partnership schools. We will work with you to place you in the best school to meet your training needs and to ensure that you are placed in a school located closely to where you live. The responsibility of allocating placements rests with BTSA. \r\n\r\nYou will complete a main placement in a Key Stage of your choice. This will cover the Autumn term and the Summer term. In the Spring term, you will complete a second placement in a contrasting school and Key Stage. There will also be enhanced placements e.g. Special Educational Needs, Early Years, as well as a week long international placement in Holland.\r\n","personalQualities":"","otherRequirements":"Trainees completing an Initial Teacher Training Programme must demonstrate the required competencies in the Fundamentals of English and Maths outlined by the Department for Education before Qualified Teacher Status is awarded. \r\n\r\nTo ensure trainees meet the required competencies, you will be required to undertake and pass the University’s agreed assessment which will take place when you commence your course. Full details of the required competencies and assessment will be provided in due course.  Please note it is the trainee’s responsibility to secure these fundamental skills.","status":1,"createdAt":"2021-07-06T10:49:14.883Z","updatedAt":"2021-10-05T11:58:10.681Z","canSponsorStudentVisa":"yes","cycle":"2024"}
