{"id":"b4dc041d-23be-464a-99f0-f39d32341ac8","name":"Primary","code":"J510","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"3c679574-c091-4bc3-a279-0d99e01be0a3","name":"The Catholic School of St Gregory the Great","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"4e8e0d83-c8f6-4338-ad0d-b5e8865e2b84","code":"26P","name":"Cotswold Edge Teaching Alliance"},"accreditedBody":{"id":"9aa67012-b776-4027-89f4-5531efb3a9d2","code":"G50","name":"The University of Gloucestershire"},"profPost":"PG","degreeGrade":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"You will be trained in a highly supportive and aspirational environment and will develop the rigour, professional knowledge, understanding and skills necessary for the delivery of creative, purposeful and challenging teaching and learning.\r\n\r\nMuch of the training will be delivered by expert teachers in the partnership schools. This will be enhanced by attendance at the University of Gloucestershire. You will be assigned to one of the schools in the partnership in which you will do a teaching placement in the autumn and summer terms. Part of your spring term will be a teaching placement in a contrasting school.\r\n\r\nYou will be assigned a mentor from the staff of your placement school.   From the beginning you will be treated like a member of staff and will attend staff meetings and development days. You will be in school from the first day of the school year so you will feel part of the team from day one.\r\n\r\nOur mentors are outstanding teachers but they are required to undertake a rigorous training programme to develop their mentoring skills. This includes coaching, effective classroom observation and feedback skills. Therefore, although teacher training is demanding, you are assured of a high level of personal and professional support in a programme which is well managed at all levels.\r\n\r\nFormal assessment for the School Direct programme takes place throughout the year. There is no final written examination.\r\n\r\nAssessment takes the form of assessed practical teaching against the Teachers’ Standards and course work assignments set by your HEI link partner (PGCE)\r\n\r\nSuccessful completion of the programme requires passes in practical teaching and in all assignments; the marking criteria for both scales are against a comprehensive range of criteria explicitly linked to the standards for Qualified Teacher Status (QTS).\r\n\r\n\r\n","interviewProcess":"You will have one interview to take place at one of our partner primary schools.","howSchoolPlacementsWork":"We are a partnership of  primary schools in the Stroud, Cheltenham and Cirencester areas. Please specify your preferred placement school when you apply, although we cannot guarantee this choice.","status":1,"createdAt":"2021-09-27T12:28:24.165Z","updatedAt":"2021-09-27T12:34:09.006Z","canSponsorStudentVisa":"no","cycle":"2024"}
