{"id":"0961c47e-e4ce-40e2-975d-87aeeb4c3f46","name":"Primary","code":"3BM6","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"7_to_14","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"a097d918-40e6-46ae-a25d-e76ae5ff02d7","name":"Main Site","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"fb3ca289-04a0-4871-a554-e534f98e3783","code":"2JU","name":"Whitefield Alliance"},"accreditedBody":{"id":"2e1ce675-b5df-42ab-bb63-1e0435ef5722","code":"E28","name":"University of East London"},"profPost":"BO","english":"3","maths":"3","science":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feeDetails":"The amount providers charge varies – for UK and EU students, it can be up to £9,250 per year for a full-time programme starting in 2018. It’s a big investment, but there’s often funding available to help you. UCAS does not arrange student finance, but can give you information and advice about funding and support to help point you in the right direction.\r\n•Bursaries – tax-free bursaries are available for training to teach a range of subjects. The level of funding and eligibility will vary depending on the subject you choose to teach, and your degree classification. For more information, visit Get Into Teaching.\r\n•Tuition fee and maintenance loans – if you’re not eligible to receive a bursary or scholarship, you can still apply for a student loan to cover your training programme fees and living costs. Find out more from Student Finance England.\r\n•Extra student funding – if you have dependents, you could access further funding to support your teacher training, such as Parents' Learning Allowances, Childcare Grants, or Child Tax Credits. The student finance calculator from Student Finance England allows you to estimate the level of funding that may be available.\r\n•Disabled students and care leavers – universities and colleges have different ways of supporting you in higher education. Check if you are entitled to additional support and funding.\r\n","aboutCourse":"This PRIMARY (SEN) UNSALARIED School Direct training programme is being offered at Whitefield Academy Trust (www.whitefield.org.uk) and the university of East London (UEL).\r\n\r\nEntry requirements: GCSE Maths/English/Science of grade C or above, and a degree of 2:2 or above. \r\n\r\nAll successful candidates are recommended to undertake some school experience prior to the start of the course. The experience of working with children in an educational setting will give you a clearer insight into the learning environment, new teaching methods, and the chance to observe the teaching skills of experienced practitioners.\r\n\r\nWhat we are looking for:\r\nExperience of working with SEN pupils\r\nInterest in, and commitment to, education and young people.\r\nEnthusiastic about working with SEN children, and possess an ability to relate to them. On the training programme, you will be supported to develop good working relationships with teachers and their pupils.\r\n\r\nCommunication skills are very important to a teacher's role and your skills can grow and develop through teaching and your school experience. Throughout the course, you will have the chance to take part in discussions, and read/respond to written materials. We provide training that will help you develop a wide range of interpersonal, communication and writing skills to meet your needs and professional demands.\r\n\r\nBecoming a teacher is very much about being a team member, and this will be reflected over the tenure of your programme. You will need to work effectively on joint projects, work as a member of the team and accept leadership roles. It may be beneficial to have a keen interest or hobby as you could bring this to the school as an extra-curricular activity.\r\n\r\nHow we select our trainees\r\nWe require two references, of which one will be academic. For applicants who finished their studies more than five years ago, we realise that this may not be the most appropriate. In such cases, employers or teachers from the school(s) you visited whilst gaining your school experience can be used to provide a reference; they would be able to comment on your suitability for the teaching profession.\r\n","interviewProcess":"We interview all shortlisted candidates prior to making an offer to train with us. If invited to interview, you will be expected to be familiar with key issues and developments in schools.\r\n\r\nInterviews may include any of the following:\r\n*Small group or class teaching\r\n*Meeting pupils and staff\r\n*Tour of school\r\n*Introduction to the training programme\r\n*Group discussion of general issues in education/what it means to be a teacher\r\n*Presentations by applicants\r\n* Individual interviews.\r\n\r\nYou will be judged on your ability to communicate clearly and on your engagement with the audience.\r\n\r\nYou will participate in a written task. All teachers need to be able to write English clearly without errors of spelling, grammar or punctuation because it is part of their job to teach pupils to do this. This task with help identify any difficulties you may have to address before joining the programme. The individual interview will explore subject specific issues as well as your reasons for teaching. It will explore your attitudes to young people and your understanding of what teaching entails. \r\nYou will be judged against the criteria listed below:\r\n*Appropriateness of subject qualifications and relevance to subject teaching\r\n*Capacity to extend subject knowledge\r\n*Awareness of the role/responsibilities of a teacher\r\n*Teaching experience\r\n*Resilience\r\n*Ability to communicate effectively\r\n*Enthusiasm for, and commitment to teaching\r\n*Awareness of personal strengths/weaknesses\r\n","howSchoolPlacementsWork":"Unsalaried / Training is open to high quality graduates. You will be based at the University of East London (UEL) and the course will run for one year. You will also spend plenty of time in your placement schools – a minimum of 24 weeks. This will help you develop your practical teaching skills and ability to manage and plan classes effectively. Our course will lead to qualified teacher status (QTS) and PGCE. \r\nYou could be eligible for a tax free bursary, depending on the degree class that you hold. \r\n","personalQualities":"*Interest in SEN, and commitment to education and young people\r\n*Enthusiastic about working with SEN children, and possess an ability to relate to them. \r\n*Communication skills \r\n*Interpersonal skills and aptitude for learning\r\n*Ability to work effectively on joint projects, work as a member of the team and accept leadership roles. It may be beneficial to have a keen interest or hobby as you could bring this to the school as an extra-curricular activity.\r\n","otherRequirements":"DBS FOR PRIMARY\r\nIt is the duty of all schools to protect vulnerable children and adults. If you are offered a place on the programme, the school will apply for a DBS check for you, as it is a vital entry requirement for this training programme.\r\nThe form will contain details of any cautions, convictions, reprimands or any warnings recorded against your name (even where they would generally be considered spent), or will confirm that you have none. It will allow the school to make an assessment of your suitability for access to these vulnerable groups.\r\nPlease visit: www.gov.uk/disclosure-barring-service-check/overview\r\n","status":2,"createdAt":"2021-07-06T10:51:24.499Z","canSponsorStudentVisa":"yes","cycle":"2023"}
