{"id":"d209f932-0ba5-4028-9cee-1752cf30a300","name":"Primary","code":"3BBF","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"a097d918-40e6-46ae-a25d-e76ae5ff02d7","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"fb3ca289-04a0-4871-a554-e534f98e3783","code":"2JU","name":"Whitefield Alliance"},"accreditedBody":{"id":"2e1ce675-b5df-42ab-bb63-1e0435ef5722","code":"E28","name":"University of East London"},"degreeGrade":"9","english":"3","maths":"3","science":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"no","courseLength":"OneYear","feesUK":null,"aboutCourse":"This PRIMARY (SEN) SALARIED School Direct training programme is being offered at Whitefield Academy Trust (www.whitefield.org.uk) and the university of East London (UEL).\r\n\r\nEntry requirements: GCSE Maths/English/Science of grade C or above, and a degree of 2:2 or above. \r\n\r\nAll successful candidates are recommended to undertake some school experience prior to the start of the course. The experience of working with children in an educational setting will give you a clearer insight into the learning environment, new teaching methods, and the chance to observe the teaching skills of experienced practitioners.\r\n\r\nWhat we are looking for:\r\nExperience of working with SEND pupils\r\nInterest in, and commitment to, education and young people.\r\nEnthusiastic about working with SEND children, and possess an ability to relate to them. On the training programme, you will be supported to develop good working relationships with teachers and their pupils.\r\n\r\nCommunication skills are very important to a teacher's role and your skills can grow and develop through teaching and your school experience. Throughout the course, you will have the chance to take part in discussions, and read/respond to written materials. We provide training that will help you develop a wide range of interpersonal, communication and writing skills to meet your needs and professional demands.\r\n\r\nBecoming a teacher is very much about being a team member, and this will be reflected over the tenure of your programme. You will need to work effectively on joint projects, work as a member of the team and accept leadership roles. It may be beneficial to have a keen interest or hobby as you could bring this to the school as an extra-curricular activity.\r\n\r\nHow we select our trainees\r\nWe require two references, of which one will be academic. For applicants who finished their studies more than five years ago, we realise that this may not be the most appropriate. In such cases, employers or teachers from the school(s) you visited whilst gaining your school experience can be used to provide a reference; they would be able to comment on your suitability for the teaching profession.\r\n","interviewProcess":"We interview all shortlisted candidates prior to making an offer to train with us. If invited to interview, you will be expected to be familiar with key issues and developments in schools.\r\n\r\nInterviews may include any of the following:\r\n*Small group or class teaching\r\n*Meeting pupils and staff\r\n*Tour of school\r\n*Introduction to the training programme\r\n*Group discussion of general issues in education/what it means to be a teacher\r\n*Presentations by applicants\r\n* Individual interviews.\r\n\r\nYou will be judged on your ability to communicate clearly and on your engagement with the audience.\r\n\r\nYou will participate in a written task. All teachers need to be able to write English clearly without errors of spelling, grammar or punctuation because it is part of their job to teach pupils to do this. This task with help identify any difficulties you may have to address before joining the programme. The individual interview will explore subject specific issues as well as your reasons for teaching. It will explore your attitudes to young people and your understanding of what teaching entails. \r\nYou will be judged against the criteria listed below:\r\n*Appropriateness of subject qualifications and relevance to subject teaching\r\n*Capacity to extend subject knowledge\r\n*Awareness of the role/responsibilities of a teacher\r\n*Teaching experience\r\n*Resilience\r\n*Ability to communicate effectively\r\n*Enthusiasm for, and commitment to teaching\r\n*Awareness of personal strengths/weaknesses\r\n","howSchoolPlacementsWork":"Our School Direct salaried route or apprenticeship pathway is open to high quality graduates. Both pathways lead  to Qualified Teacher Status validated by the University of East London. A PGCE add on is also available. The Trainee is based in one of the special schools within our Alliance located in Waltham Forest. An experienced member of staff with current or recent classroom experience will encourage you to reflect on your practice and work with you to develop your progress. We actively encourage further study at Postgraduate and Masters Levels (Autism or Complex Needs). \r\nYou will carry out one 8 week mainstream placement throughout your training, and further experience during the Spring term. \r\nEach Friday during the first two terms, you will have training at UEL.  \r\nThis will help you develop your practical teaching skills and ability to manage and plan classes effectively. ","personalQualities":"*Interest in SEN, and commitment to education and young people\r\n*Enthusiastic about working with SEN children, and possess an ability to relate to them. \r\n*Communication skills \r\n*Interpersonal skills and aptitude for learning\r\n*Ability to work effectively on joint projects, work as a member of the team and accept leadership roles. It may be beneficial to have a keen interest or hobby as you could bring this to the school as an extra-curricular activity.\r\n","otherRequirements":"DBS FOR PRIMARY\r\nIt is the duty of all schools to protect vulnerable children and adults. If you are offered a place on the programme, the school will apply for a DBS check for you, as it is a vital entry requirement for this training programme.\r\nThe form will contain details of any cautions, convictions, reprimands or any warnings recorded against your name (even where they would generally be considered spent), or will confirm that you have none. It will allow the school to make an assessment of your suitability for access to these vulnerable groups.\r\nPlease visit: www.gov.uk/disclosure-barring-service-check/overview\r\n","status":1,"createdAt":"2021-07-06T10:51:24.468Z","updatedAt":"2021-12-06T15:17:51.662Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"Point 2 on the unqualified teachers salary scale outer London, plus\r\nSEN point 1 allowance.\r\n\r\nPlease visit the NASUWT union website for up to date figures:  https://www.nasuwt.org.uk\r\n\r\n"}
