{"id":"bec8ed89-1ea7-4e9c-9c7c-d80da9cc817b","name":"Chemistry","code":"36CG","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"912d4fb4-761b-42e9-8dc6-e968b791ea4e","code":"F1","name":"Chemistry"}],"trainingProvider":{"id":"003123bb-d64e-4faf-803e-f84a83c629f4","code":"2G4","name":"Belle Vue Girls’ Academy"},"accreditedBody":{"id":"58e814cb-bf42-4d3d-9486-b3ea827fd9e2","code":"259","name":"Bradford Birth to 19 SCITT"},"profPost":"BO","english":"3","maths":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"The course is designed to help you fulfil a wider teaching role (including that of pastoral care) within your chosen educational context. Throughout the course, we place particular emphasis on providing equal opportunities for all students working in a diverse, multi-ethnic society.\r\nThis course will provide you with a PGCE at Masters level and Qualified Teacher Status (QTS). Working closely with Bradford specialist staff in placement schools, you will gain the knowledge, skills and understanding needed to be a newly qualified teacher.\r\nStrength of the course is the way in which theory and practice are related as a result of extensive time spent working with children in two placement schools.\r\nAt least 120 days are school-based with support provided by experienced school subject mentors.\r\nThe course builds upon the subject knowledge and independent study skills which, as a graduate, you will have already acquired. Our school based sessions are also concerned with the professional skills which all teachers need. Course tutors work closely with managers, mentors and teachers in our school to provide you with advice and support for the progressive development of your teaching expertise.\r\nA large proportion of your teaching and training will be in our schools, delivered by both highly experienced, inspiring school teachers and leaders. School based sessions consist of lectures, seminars, tutorials, micro-teaching environments and observations of teaching in school and, where relevant, workshop or lab work. This is very much a practical course, where you learn by doing.\r\nAssessment is carried out across both placements against the Teaching Standards. We are able to offer our trainees a Key Stage 5 (A- level) enhancement as well as the opportunity to get experience of a primary school, alternative provision or special school environment.\r\n","interviewProcess":"All trainees who are shortlisted for interview will be invited into one of our schools. If you are asked for interview, we will provide more details about tasks you will be asked to complete.\r\nAll our interviews have the same elements:\r\n1. A classroom based exercise, where you will be observed interacting with children.\r\n2. Written tasks which are designed to assess your written communication skills, your ability to be numerate, your capacity to access higher level study and subject knowledge.\r\n3. Face to face interview with a panel of School Leaders.\r\nDBS\r\nIf you are successful at interview stage, you will be made an offer of a training place subject to satisfactory enhanced DBS clearance. For more information, see the guidance on line at;\r\nhttps://www.gov.uk/disclosure-barring-service-check\r\n","howSchoolPlacementsWork":"We carefully consider school placements for all of our trainees.  We match strengths as well as support needs.  \r\n\r\nAll our trainees will train to teach both KS3 and KS4.  We are also able to offer our trainees a Key Stage 5 (A- level) enhancement where applicable as well as the opportunity to get experience of a primary school, alternative provision or special school environment.\r\n\r\nAll trainees will have at least 2 different school placements. The schools in partnership are varied and therefore we are able to offer diverse experience. ","personalQualities":"We don't have a fixed picture of what kind of a person we are looking for. Teaching is a creative, dynamic profession which has space for innovative thinking, for people who can break free from what's expected. Our schools are clear that we want trainees to have a rapport with children, a passion for their subject, and to have the ambition to become excellent teachers. You will have a relentlessly positive outlook, show initiative and be good team player, ready to work hard in a challenging but wonderfully rewarding profession.","otherRequirements":"If you are successful at interview stage, you will be made an offer of a training place subject to satisfactory enhanced DBS clearance. \r\n","status":2,"createdAt":"2021-07-06T10:55:40.563Z","canSponsorStudentVisa":"no","cycle":"2024"}
