{"id":"a8d982b7-1956-41ca-b25b-b3a051653774","name":"Chemistry","code":"35QJ","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"912d4fb4-761b-42e9-8dc6-e968b791ea4e","code":"F1","name":"Chemistry"}],"locations":[{"id":"3f36a104-e385-4aea-821f-fe68a917edc3","name":"Main Site","isPublished":"Y","status":"S"},{"id":"33222b8e-04bc-40b7-8999-b69dc959f203","name":"City College Norwich","isPublished":"Y","status":"S"}],"trainingProvider":{"id":"fa85c065-4efa-4005-846d-c7410c152ba6","code":"2GG","name":"Attleborough Academy"},"accreditedBody":{"id":"1f91f989-047b-4bbc-a73e-d45ffcfc1f28","code":"N43","name":"Norfolk Teacher Training Centre"},"degreeGrade":"9","english":"3","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9000,"aboutCourse":"On this course you will learn how to develop your subject knowledge within the context of the secondary curriculum, from Key Stage 3 to Key Stage 5.\r\n\r\nWe will support you as you explore ways of translating your subject knowledge in to effective and engaging learning activities. Throughout your training year you will encounter and explore different methods for using your knowledge and enthusiasm to grow into a teacher whose work inspires young minds.\r\n\r\nWe will involve you in developing your own understanding of the structure of the secondary curriculum, and you will learn how to use this as the basis from which to build consistently strong lessons. You will learn the craft of lesson planning, creating learning-centred activities alongside a clear vision for how young minds learn. You will be supported in learning how to assess pupil progress and how to use the results of your assessments to refine your lessons. All our programmes help trainee teachers to channel their enthusiasm for their subject specialism into lessons which are grounded in key principles of the Core Content curriculum and a commitment to see pupils achieve. You will explore how data is used in education to monitor and plan for progress.\r\nIn addition, you will learn how different examination boards structure their GCSE and A level papers, develop an understanding of how these are marked and model your own teaching to prepare pupils for the rigours of exams. Importantly, you will also come to share our vision of how your subject contributes to the whole curriculum and have opportunities to explore cross curricular links working with colleagues.\r\n\r\nAs with all our programmes, you will learn a range of strategies for promoting and securing excellent behaviours for learning which have achievement and self-confidence at their core.\r\n\r\nYour school-based experience will be underpinned by a professional development programme. You will grow your understanding of the teaching profession and the key issues which shape educational provision for young people. The programme provides you with constant opportunities to reflect on your professional practice and to acquire a depth of professional understanding of teaching, learning and assessment.\r\n\r\nThroughout the programme, you will be supported by your mentor who will be an Subject specialist who understands your needs and with whom you can work in partnership to ensure you have a fantastic and fulfilling year.","interviewProcess":"We are looking for resilient people who can show that they are committed to working with young people and joining the teaching profession. We will check any applications against the Children’s’ Barred list and require a full DBS check should you be successful in your application. \r\nWe are particularly interested in talking to people who have a proven track record in another industry or profession and wish to re-train as teachers.\r\nIf your previous professional experience is directly related to the subject you would like to teach, we want to hear from you.\r\n\r\nHow we select our trainees\r\n\r\nInterviews will be held at one of our academies (if Covid19 allows) and will involve candidates in a full day of activities designed to test suitability to teach. Candidates will be asked to take part in structured lesson observations, group exercises and have a one to one interview. You will receive a brief from us, so you know what to prepare for your interview. We strongly believe that interviews should be a two-way process, so we aim to give you as much information on NTTC as possible and answer the questions we know you will have. If we are unable to hold our interviews in school, we will hold them online. You will be asked to prepare a 10-minute activity to share with us and then we will ask you a series of questions to help us decide if we think you are a suitable candidate for Teacher Training. ","howSchoolPlacementsWork":"We work with over 45 schools in our region, so it is vital that we make the right match between school placement and trainee. Placements are based on where we know we can offer excellent mentoring and great opportunities to develop subject knowledge.\r\nAll trainees follow a programme of 4 days per week in school and 1 day at college. You will be placed at a minimum of two schools during the year which will offer you contrasting experiences of education in our region.\r\nAll trainees will gain experience teaching 11 to 16-year olds. \r\nFor those who want to develop their post 16 teaching experience we can facilitate a range of bespoke options for you to follow from 6th Forms, to a FE College.\r\n","personalQualities":"Most importantly, you will be able to demonstrate why you want to work with young people and prove your commitment to your subject.","otherRequirements":"Most candidates will be able to demonstrate experience working with young people. However, we evaluate each application on a person-by-person basis and we are keen to take all your experience in to account. \r\nWe understand that from time to time it can be difficult for candidates to organise school experience for themselves. Therefore, for successful applicants, we are happy to organise school experience for you prior to the start of the course if you need us to. So, you may submit your application even if your school experience has yet to be completed.","status":3,"createdAt":"2021-07-06T10:57:09.997Z","updatedAt":"2021-08-24T14:27:17.402Z","canSponsorStudentVisa":"no"}
