{"id":"2aea2a10-7648-423a-93af-46f0a5d2cabf","name":"Primary","code":"K215","qualification":"pgce_with_qts","startDate":"2024-06-30T23:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"TA","fundingType":"apprenticeship","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"1ebc535e-eef4-4046-98b5-c7be6dd82133","name":"West Monkton Church of England Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"2dc84bdd-47d6-4cd1-92e2-a06d11d838c1","name":"Somerset SCITT Consortium","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"8832fbf6-34bb-42bd-8b92-3e32e40dec44","code":"5S2","name":"Somerset SCITT - Oak Partnership"},"accreditedBody":{"id":"be897ea1-5b41-4b40-8eaf-877a15ad688b","code":"S31","name":"Somerset SCITT Consortium"},"profPost":"PG","degreeGrade":"9","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","aboutCourse":"Our Primary Teacher Teaching Apprenticeship (PGTA) is a nationally recognised, work-based route into teaching. It offers a postgraduate-level qualification with no tuition fees and the opportunity to earn while you learn.\r\nIt is aimed primarily at candidates who have a good understanding of what it means to work in a school and have built up some experience, perhaps as a teaching assistant or in similar role. Many candidates are working in schools already and are looking to make the next step.\r\nYou will be employed by a school on the Unqualified Teacher pay scale. \r\n\r\nYou will undertake off-the-job training, which will occupy 20% of your teaching time; this is split between face-to-face training at Somerset SCITT and independent key tasks in the workplace.\r\n\r\nYou will be placed in a contrasting school for 6 weeks during Term 2.  This will enrich your PGTA experience.\r\nYou will be required to be employed as an unqualified teacher on a full-time basis and paid according to the unqualified teacher (UQT) pay scale at point one or higher. \r\nYou may be working with a school already; in which case it is possible that your school will be willing to arrange an apprenticeship training position for you.\r\n\r\nSomerset SCITT will expect you to take the lead in managing your own learning. However, will provide guidance and support from our team of dedicated tutors and placement moderators to compliment the support from your host school.\r\n\r\nYour curriculum is based on our INSPIRE principles:\r\n•\tInclusivity\r\n\r\n•\tNurturing Behaviour\r\n\r\n•\tSupport and progress of pupils though assessment\r\n\r\n•\tPromoting high expectations\r\n\r\n•\tInstilling confidence\r\n\r\n•\tResponse to and critically engage with research and national developments\r\n\r\n•\tEnhance PGTA’s subject and pedagogical knowledge\r\n\r\nYou will be encouraged to reflect upon your own practice and to critically engage with current research, policy and pedagogy, leading to a PGCE award with 60 Master’s Level credits and Qualified Teacher Status (QTS).  \r\n","interviewProcess":"In most cases the PGTA requires a two-stage interview process, with an interview at the host school followed, for successful candidates, by an invitation to complete Somerset SCITTs assessment process.  Where possible these will be combined with Somerset SCITT being part of the school based interview process.","howSchoolPlacementsWork":"You will be placed in a contrasting school for 6 weeks during Term 2.  This will enrich your PGTA experience.","personalQualities":"","otherRequirements":"Fully Enhanced DBS and fitness to work check.","status":1,"createdAt":"2021-10-05T08:49:26.315Z","updatedAt":"2021-10-05T10:09:23.187Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024"}
