{"id":"8d7cefc4-df06-4486-b65c-4bb56e5da397","name":"Art and Design","code":"2C5K","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"d461a678-3335-4ca2-9616-1dc479d31a49","code":"W1","name":"Art and design"}],"locations":[{"id":"4c30138b-bfc0-43c8-95ab-6d27d509e27b","name":"Kirklees & Calderdale SCITT  (for core training)","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"74d0e1b3-80ac-4a0e-b93d-f19cb6587144","code":"1WK","name":"Kirklees and Calderdale SCITT"},"profPost":"BO","degreeGrade":"9","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":7500,"feeDetails":"We offer 2 options\r\n\r\n£7500 for Qualified Teacher Status alone (QTS) \r\n\r\n£9250 for  QTS with PGCE. This PGCE element equates to 60 Masters credits which we offer through the University of Huddersfield.","financialSupport":"If required, we will support you through the Student Finance process for fees and maintenance grants, administer SKE funding as well as signpost to other possible funding streams. ","aboutCourse":"You are in school from the first day of term and therefore seen as a staff member by everyone.  You’re in one school four days a week to the end of the school year, spending Spring half term at a contrasting school.  One day a week you will be at our central venue alongside other trainees, sharing and learning from each other’s experiences.  Our model enables you to experience a full year in school and fully appreciate the demands/rewards that brings.\r\n\r\nWorking alongside your mentor, you will identify your ongoing level of knowledge, skills and experience and from that draw up and work continuously on your training.  This will involve observing experienced teachers and training activities leading to delivering whole class.\r\n\r\nYour core training is extremely diverse from theoretical input to observing excellent practice.  We support our trainees throughout their training year, enabling them to be fully prepared for teaching during their training and beyond.\r\n\r\nWe are one of a few providers who are fully supported by their local authority learning partners specialising across different education areas.\r\n\r\nOur moderation report (2019) said…\r\n\r\n4.3 The SCITT is able to draw from a bank of considerable expertise and resources, developed and acquired over time… ‘tried and tested’ trainers…acknowledged practitioners in their field…range of ITE resources … ensures that the ITE curriculum is covered comprehensively over the course of the year … \r\n\r\n4.5 … the SCITT manager is forward-looking and committed to adopting best practice to ensure that all trainees receive a ‘good deal’ and are equipped with all of the essential tools they need to teach effectively and impact positively on pupil progress. \r\n\r\nYou will benefit from 10 Subject days, giving you the opportunity to further enhance your subject knowledge.\r\n\r\nBy the end of the training year you will be fully equipped to deliver your subject from Year 7 to 11 including the GCSE specification.\r\n\r\nIn order to gain Qualified Teacher Status (QTS) you have to be judged competent against the Teacher Standards.  \r\n\r\nAssessment is;\r\n\r\n- Half-termly Tutor visit reports and obs\r\n- 3 termly reports\r\n- 2nd placement report\r\n- 2 tasks and 2 assignments\r\n\r\nWe work hard to create a reduced workload approach to assessment, basing many of our judgements on professional dialogue - not paper trails. Assessment is based upon day-to-day practice and should complement your teaching and reduce the amount of additional work required.\r\n","interviewProcess":"Once we receive your application, we’ll acknowledge by email and update Apply if you are invited to interview. We’ll e-mail or call you with the details.  \r\n\r\nYou’ll be interviewed in Heckmondwike by one of our SCITT team alongside a senior colleague from one of our schools.  You’ll be expected to answer a range of questions designed to explore your personal qualities and meeting the course criteria. \r\n\r\nThe interview gives you the opportunity to discuss why you want to teach, what you would bring to the profession, and show us your resilience and initiative.  You will be asked to bring a prepared task and you’ll undertake a written task on the day demonstrating your ability to read effectively and communicate clearly and accurately in Standard English.\r\n\r\nYou’ll need to bring interview original certificates of all qualifications and proof of identity as part of our Safeguarding processes.\r\n\r\nIf you are successful, we’ll offer you a place. Ideally within 48 hours.  We’ll update Apply and contact you.\r\n\r\nIf you accept, we’ll recommended you to a partner school as a prospective trainee.  Once confirmed as the host school you should expect to visit; follow its Safeguarding processes, meet the department/class and mentor and maybe a tour of the school.\r\n\r\nBefore commencing the programme we’ll ask you to sign a contract between you, the host school and us so that everyone agrees to the same supporting principals and requirements of your training year.\r\n\r\nWe will carry out a criminal background check and other requisite checks.\r\n","howSchoolPlacementsWork":"We will source and arrange your school placement.  If you have a school in mind, you’re welcome to approach us about it and we’ll work with you to arrange the best experience for you.  You will be placed in a school which we feel will fully support you in your subject specialism.\r\n\r\nYou are training to teach 11-16 age range but some of our schools do have 6th forms which obviously enhances your training opportunity.\r\n\r\nYou will spend most of the year in one school with a second experience in a contrasting school (usually Christmas to February half term).  This enables you to deepen your experience and ensures that you have the opportunity to meet all the Teacher Standards.  When in school, you are expected to follow the timings, practices and culture of the school.  Having an extended practice in one main school means that you can develop your practice well and show that you have a positive impact on your pupils, in your own classes.\r\nWe always try to take into consideration the location of our trainees and their placement schools to assist in their daily commute and try to work around other personal situations\r\n\r\nWe work with many schools, too many to list but visit our website to view the map of schools we have worked with over the last four years.\r\n","personalQualities":"We look for; \r\nGood communication skills \r\nAbility to write in Standard English and model accurate and effective spoken language.\r\nCommitment to teaching and learning\r\nUnderstanding of children as learners\r\nClear educational philosophy\r\nUnderstanding educational issues\r\nKnowledge/understanding of the subject within the curriculum\r\nAbility to use ICT, establish effective working relationships and take responsibility for own professional development\r\nUnderstanding the demands of a school-based route into teaching\r\nResilience\r\n\r\nRecent experience of your subject in a secondary school or National Curriculum in a primary school is preferable in order for you to have a greater understanding of the demands of school life.\r\n","otherRequirements":"Remember, we are looking at your potential to train to teach.\r\n\r\nOffers will be subject to an Enhanced DBS which will be organised for you. An overseas check may be required for those who have spent time outside of the UK.You will also be subject to the following checks: health, identity, relevant work qualifications, right to work in the UK, professional registration, references and a Childcare Disqualification and Disqualification by Association Declaration.\r\n\r\nPlease make sure that you double check your personal statement on your application and that it is grammatically correct. \r\n","status":1,"createdAt":"2021-07-06T10:55:47.979Z","updatedAt":"2021-09-21T12:38:58.610Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
