{"id":"7be16788-3219-474b-a1b2-8c83b79142b9","name":"Chemistry","code":"J599","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"912d4fb4-761b-42e9-8dc6-e968b791ea4e","code":"F1","name":"Chemistry"}],"locations":[{"id":"dd9749b5-fd05-417a-9f1c-1ce179c26d07","name":"Appleby Grammar School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"d17b5c81-c2fd-440c-aff9-74e199f33905","name":"The Lakes School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"f6348bd0-3a12-44d7-80f0-bc08df2691a1","name":"Queen Elizabeth School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"2e3601c7-4e25-4b87-a136-1b583a35a06e","name":"Kirkbie Kendal School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"339356dd-c1dc-4f3a-a64a-076ac5cc310f","name":"Settlebeck School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"215cec53-c998-49e9-a16c-0268d8ca07e5","name":"Kendal College","isPublished":"Y","status":"R","vacancies":"F"},{"id":"c8f6bb17-69bd-4d28-b023-d2cc7fd386c4","name":"Dallam School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"122daf6c-ce0a-4fb3-a7f4-567fe79dfa16","name":"Queen Elizabeth Grammar School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"7434fcb4-7494-436e-9cb8-01fb13e103e9","name":"John Ruskin School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"3611d610-5eed-4112-aa33-64b2266f864f","name":"Ulverston Victoria High School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"73e04c14-e496-408e-9a24-989a1cf1a88d","name":"Dallam Teaching Alliance","isPublished":"Y","status":"R","vacancies":"F"},{"id":"b83c0437-8f0c-4f23-9833-92144c519e42","name":"Queen Elizabeth Studio School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"12b0c520-ab1e-4119-9807-b29c4aef5479","code":"3DS","name":"Dallam Teaching Alliance"},"accreditedBody":{"id":"9be9f611-2d36-431a-9109-7fcbbfc88fc8","code":"C99","name":"University of Cumbria"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","science":"9","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":9250,"financialSupport":"Visit Get into Teaching for more information about bursaries, scholarships and financial support for 2020/21.","aboutCourse":"The majority of the course will be delivered by expert teachers in our alliance schools around South Cumbria. There will also be full support and academic preparation from tutors and our University programme leaders at the University of Cumbria, although most of the course will be delivered in school.\r\n\r\nOur School Direct Programme starts in early September and involves teaching practice in school each week from Monday to Thursday.  Conference days are allocated to Fridays where you will take part in sessions hosted and delivered by outstanding classroom practitioners who currently teach in our partner schools or at the University of Cumbria Lancaster campus.  The conferences will cover aspects such as safeguarding, lesson planning, behaviour management and assessment. Our conference deliverers model the teaching and learning strategies which we know work in the classroom. \r\n\r\nIn addition, there will be subject pedagogy days during the year where trainees will focus on teaching KS3 and KS4 Science and Chemistry specifically. These will be delivered by a Lead Subject specialist for Chemistry. During the training you will be able to work with other trainees from other School Direct programmes with the University of Cumbria on your subject expertise. The programme includes opportunities where you can gain assignment support with your University Programme Leader and you will have full access to the University learning and support services throughout the course which will enable you to access library resources and assistance with your academic work. We have allocated time for Professional Reading, Subject Knowledge Enhancement sessions as necessary and Assignment Writing Days which will aid both your assignment writing and your classroom practice.\r\n\r\nYou will audit your subject knowledge for the topics you will need to teach at KS3, KS4 and KS5. Lead Subject Mentors will guide you towards great resources and you will gain  IT access which will enable you to share resources with each other and school mentors. \r\n\r\nThe programme gives you a PGCE and recommendation for QTS; the PGCE is awarded by the University of Cumbria and this element of the course is taught at their Lancaster site by a university tutor. The modules perfectly compliment the training we deliver and you will gain 60 Master’s level credits.\r\n","interviewProcess":"Applicants apply through UCAS and are short listed following reference to the entry requirements and if successful are invited for interview at one of the Dallam Teaching Alliance schools. On the morning of interview you will be taken on a tour of the school, your documentation will be reviewed including examination certificates and ID. There are four parts to the interview which generally takes place over a full morning. A written task, subject knowledge audit, short teaching task and panel interview. Pupils will be involved in the teaching task.\r\n\r\nDoing some research about the Dallam Teaching Alliance and the University of Cumbria is good preparation and we will of course provide you with plenty of opportunities to ask questions on the day. We are looking for the potential to be an excellent trainee, someone who is ready to start training in a school setting from early September. We are also looking for potential employees in our schools.\r\n\r\nFollowing the interview we update UCAS which is followed up by the University’s formal offer letter to confirm your place, if successful. There may be targeted conditions depending on assessment at interview, for example more observations in school or a Subject Knowledge Enhancement course.\r\n","howSchoolPlacementsWork":"The Dallam Teaching Alliance consists of schools situated in and around the Lake District in South Cumbria. We select our schools carefully and the vast majority have been graded Good or Outstanding by Ofsted. We pride ourselves on the strong relationships we have developed over the years and are committed to a warm welcome and a supportive environment for all. You will be training in placement schools which will provide you with a wide experience of how different pupils are taught and learn. We aim to offer the best and most suitable provision possible.\r\n\r\nYou will complete placements in two partner schools. You will attend your first placement school for four days a week (Monday-Thursday) with Fridays allocated as conference days where you will receive training on the key themes in education. The first placement will begin in September, an excellent time to see how expectations and routines are established at the start of the academic year. You will start with focused lesson observations across the whole school before you join your subject department and begin to plan and teach parts of lessons. After a few weeks you will be planning and delivering whole lessons, building up to approximately 7 hours per week by Christmas. \r\n\r\nThe second placement runs from January to June in a different school which will give you a contrasting experience and broaden your professional development. You will attend your second placement school full time, five days a week, gradually increasing your teaching timetable to 12 hours per week.\r\n\r\nPlacements are selected for you on the basis of high quality mentoring, strong subject departments, contrasting schools and reasonable commuting distance. ","personalQualities":"We are looking to recruit talented trainees who have the qualities and attributes suited to a career in teaching and ambition to develop into outstanding practitioners. This is an ideal opportunity if you have just completed your degree or are looking to change career. Successful applicants will have a real commitment to a career in teaching, a love of their subject and positive attitude towards young people are essential qualities. If you have good communication and interpersonal skills, if you have a passion for your subject area and a love of learning then we would love to hear from you.","otherRequirements":"Before applying we do advise you to spend some time in a Secondary school. You will be able to observe teaching in action and we can help you gain this experience in one of our partner schools or on one of our School Experience Days at Dallam School. The details of our School Experience Days are regularly updated on our Dallam Teaching Alliance website.\r\n\r\nAll applicants who are successful  will need the following before they \r\nstart the programme:\r\n\r\n•\tDBS and barred list check\r\n•\tMedical check\r\n\r\nWe welcome applicants of all ages, from university graduation to mature career changers.\r\n","status":1,"createdAt":"2021-07-12T13:49:09.898Z","updatedAt":"2021-07-15T10:44:22.821Z","canSponsorStudentVisa":"yes","cycle":"2024"}
