{"id":"7b6d3e4a-fb18-4e3f-ad50-380eaca0b850","name":"Physics","code":"38XY","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"bf97cd0a-224c-43d3-a021-84143df13e8d","code":"F3","name":"Physics"}],"locations":[{"id":"c18eb507-f087-4fef-984d-7def9b3d3586","name":"Altrincham Grammar School for Girls (Secondary)","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"290240bc-d8da-4793-9288-a6df2cc94c46","code":"1JT","name":"Altrincham Grammar School For Girls"},"accreditedBody":{"id":"cb360fcd-0c3a-4fc2-a4df-521e9475cd1c","code":"G65","name":"Bright Futures SCITT"},"english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","aboutCourse":"This course is designed to enable you to become a successful teacher of physics (science). \r\n\r\nOver 150 days of the course will be spent in schools working alongside highly professional and well qualified colleagues. Specific subject knowledge training will enable you to build up a strong knowledge of the mathematics curriculum for Key stage 3 and 4.\r\n\r\nAs this is a salaried route you will undertake the majority of your training in your already secured employment based school where you will spend your time in  school working alongside highly skilled professionals and well qualified colleagues. \r\n\r\nAll trainees gain experience of both key stage 2 (upper primary) and Key stage 5 (post 16).\r\n\r\nProgress is monitored by subject mentors and SCITT moderation will take place throughout the year. Trainees reflect on progress on a weekly basis, culminating in termly written reports produced jointly with mentors. \r\n\r\nThroughout the course, trainees engage with professional development  training, this training takes an evidence-informed approach to teaching and learning.  Whilst the majority of training takes place at Altrincham Grammar School for Girls, some training will take place in partner schools across Greater Manchester and Lancashire.\r\n\r\n\r\n“The high quality face-to-face training, assignments and placements combine to give trainees a firm basis on which to develop their skills and knowledge” Ofsted 2017\r\n\r\n“Employers of trainees comment very favourably on the significant improvements in trainees’ expertise and knowledge, brought about by their training” Ofsted 2017\r\n","interviewProcess":"Following an application that meets our criteria, the SCITT will arrange  an interview. Interviews  could be in person within a partner setting, or via an on-line platform. \r\n\r\nThe interview:  you will asked to prepare and or complete: \r\n\r\n* A short lesson planning activity, which you will talk through/ teach lasting  around 15 minutes\r\n* An formal interview with staff from the SCITT\r\n* A written communication task\r\n\r\nYou might also be asked to complete a subject knowledge audit. \r\n","howSchoolPlacementsWork":"This is an employment based route therefore the suitable candidate must have a current role within a school/setting. \r\n\r\nIdeally the candidate will have worked for a minimum of two years within a support role linked to this subject area. \r\n\r\nA contrasting placement within a second setting is compulsory, and all trainees gain experience of both key stage 2 (upper primary) and Key stage 5 (post 16)\r\n\r\nEmployment based school will be https://www.st-annes.stockport.sch.uk/","personalQualities":"* A passion for the subject you wish to teach\r\n* The potential to train to teach\r\n* Excellent subject knowledge\r\n* Resilience\r\n* Enthusiasm\r\n\r\nApplicants must produce a well written and clear personal statement that sets out how they meet the course requirements. The personal statement is part of the application process.\r\n","otherRequirements":"All applicants must undergo a suitability to teach check: this included a disclosure and barring service check and a fitness to teach check.\r\n\r\n\r\n[Full admissions policy]( http://allianceforlearning.co.uk/scitt/policies/)\r\n","status":2,"createdAt":"2021-07-06T10:49:50.472Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"You will be paid an unqualified teachers' salary  of at least UQ1"}
