{"id":"b0c16574-f316-439a-871d-d5e881aa20c6","name":"Primary","code":"2SD6","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"8a124544-7152-4325-a2d6-57d7a885745b","name":"Tyldesley Primary School","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"728bdb90-941c-4a34-af32-02b501dff390","code":"1UY","name":"Learning Futures Partnership"},"accreditedBody":{"id":"9be9f611-2d36-431a-9109-7fcbbfc88fc8","code":"C99","name":"University of Cumbria"},"profPost":"PG","degreeGrade":"9","english":"1","maths":"1","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"Recognised equivalency examinations providers. Email us to discuss your options further. enquiries@learningfuturespartnership.net","courseLength":"OneYear","feesUK":9250,"feesInternational":9250,"financialSupport":"Anyone who applies for a place can also apply for financial support through the Student Loan Company.\r\nTo find out more, visit: https://www.gov.uk/apply-for-student-finance\r\n\r\n\r\nBursaries, scholarships and financial support for 2020/21 will be announced soon.","aboutCourse":"Teacher Training with Learning Futures Partnership, Wigan\r\nOur mission is to recruit, develop and retain exceptional professionals by offering highly supportive initial teacher training in and around the Tyldesley and Wigan area.\r\nLearning Futures Partnership are a collaboration of  like-minded educational establishments. Tyldesley Primary School is the lead school within our alliance, all  primary partners have outstanding teacher training at their heart and we are passionate about making a difference in our pupils' lives. \r\nAt Learning Futures Partnership we are invested in your development and will support you with your application from the very first time you contact us. \r\nWe pride ourselves on our personal approach and are committed to ensure that you make the best decision for you and your future career. We choose our subject mentors carefully and are confident that their guidance will be second to none. Our mentors are committed, outstanding teachers, who have a full appreciation of the enormous impact that a supportive mentor will have on your development throughout the year.  \r\nTrainees with the LFP will be in familiar, local surroundings, perhaps even learning to teach in the school that they went to.  They’ll gain confidence from truly understanding the local area and the backgrounds of the pupils they’ll be teaching.  This sense of place and belonging will give our teachers of the future that extra boost in their trainee year.\r\nOur training programme has been very carefully designed by outstanding practitioners from each alliance school. We are passionate about ensuring that each training session allows you to collaborate, reflect upon your own development and furnishes you with skills essential for a successful teaching career. During your final term you will be provided with the opportunity to further concentrate on an area of education that has ignited your interest. Thus providing a bespoke element that responds to your needs and future aspirations.\r\n\r\n\r\nIf you would like to arrange school experience or discuss your options before applying please email Di Atkin at Tyldesley Primary School. [d.atkin@tyldesley.llat.org.uk]\r\n\r\n","interviewProcess":"You will be asked to do a number of tasks on the day:\r\n•\tA written task in response to pre-interview reading\r\n•\tA Subject Knowledge Audit\r\nCandidates will be asked to complete a subject audit in their main subject specialism. This will take the form of a short discussion with an experienced teacher.\r\n•\tA Mini-Teach\r\nYou will be asked to prepare a 20-30 minute activity based on a Key Stage 3 topic that has captured your interest. The purpose of this activity is to show us that you can make your subject interesting and accessible and that you can communicate your enthusiasm for the subject to your audience. We are also interested in how you respond to the feedback that you will be given following your ‘mini teach’.\r\n•\tAn Individual interview\r\nYour individual interview will normally last 15-20 minutes. The interview will usually be conducted by school staff and/or university tutors and will seek to determine your commitment to teaching, identify gaps in your subject knowledge outside of your main subject (there are a number of paths available for improving subject knowledge) and probe your reasons for wanting to enter the profession. We do not expect candidates to have spent some time in a secondary school in but we would like candidates to be able to talk about the reality of working in school. We would also expect all candidates to have some familiarity with the current national curriculum in their subject.\r\n","howSchoolPlacementsWork":"\r\nAt Learning Futures Partnership, you have 2 placements.\r\nAn initial placement from September to December followed by a main placement from January to July.\r\n\r\nIf you would like to arrange school experience or discuss your options before applying please email Di Atkin at Tyldesley Primary School. [d.atkin@tyldesley.llat.org.uk]","personalQualities":"We are looking for applicants that are passionate about their subject with a real desire to inspire and improve the outcomes for all of our students. You will need to be reflective and appreciative of the demands and rewards that a career in teaching offers.","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:47:11.928Z","updatedAt":"2021-07-16T11:19:37.310Z","canSponsorStudentVisa":"yes","cycle":"2024"}
