{"id":"aebd931c-f9c0-4c1d-8df5-df94d94c75ae","name":"Social Sciences","code":"2LM5","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"14_to_19","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"bd9a2174-f682-4f18-9551-498c2f7a48f9","code":"14","name":"Social sciences"}],"locations":[{"id":"a6414321-3d31-4280-8958-bd9d54ddcb6e","name":"Main Site","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"5d691db0-3d77-4a57-a4a2-5392b1ed8fc1","code":"24U","name":"North Wiltshire SCITT"},"profPost":"PG","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"- NWSCITT prefer your degree to be at least a 2:2 or higher.  However, we will consider other degrees.\n- NWSCITT require at least 50% of your degree to be related to your main Social Science subject area. \n- An A-level in your main and second Social Science subject  is also preferred.","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"NWSCITT only accept equivalency tests from:\n- [Equivalency Testing] (https://www.equivalencytesting.com/)\n- [A Star Equivalency] (https://astarequivalency.co.uk/)\n\n- If you have an equivalency test from another provider, you will be required to retake one of the above tests.\n\n- Equivalency tests are only suitable for someone who has previously taken a GCSE and not achieved grade C/4 or higher. If you have not attempted the GCSE,  you will be required take a full GCSE.","courseLength":"OneYear","feesUK":9250,"financialSupport":" - Substantial tax-free bursaries of up to £30,000 are available in certain subjects.  Your eligibility depends upon: \r\n - the subject you want to teach and your degree classification.  \r\n - You must also be entitled to receive funding from the Student Loans Company (even if you are wishing to self-fund your tuition fee).","aboutCourse":"Course Awards:\r\n- QTS and PGCE with 60 Masters credits\r\n\r\nCourse Structure:  \r\n- The course structure is predominately school based with central and subject training held either at the Teacher Education Centre (TEC) in Royal Wootton Bassett or within one of our partnership schools.   \r\n- Trainees are allocated a 'host school' but will also spend time in a second 'complementary' school. \r\n\r\nSupport:  \r\n- Each trainee will be directly supervised by a school-based Mentor, who will organise school timetables, observe lessons, set targets etc and provide feedback to the trainee in regular weekly progress meetings. \r\n- Additionally, each school has a Professional Tutor who maintains overall responsibility for all trainees in that school.  They will support the trainee and organise additional training opportunities whilst on placement.\r\n- Each trainee will also be assigned an NWSCITT Subject Lead Tutor, who will provide them with subject specific training, advice and guidance.\r\n\r\n\r\nQTS Award: \r\n- To be awarded Qualified Teacher Status (QTS), trainees must evidence that they have met all of the Teachers' Standards by the end of the programme.  \r\n\r\nPGCE: \r\n- The Post Graduate Certificate of Education (PGCE) is accredited by Bath Spa University and successful completion will result in a PGCE with 60  Masters credits.  \r\n- Trainees will be required to pass all three PGCE assignments. \r\n- There will be three assignment launch lectures (held at either our Royal Wootton Bassett training centre or one of our partnership schools,) Q&A sessions and tutorials organised by Bath Spa University tutors. \r\n- There are no expectations for trainees to travel to Bath Spa University, as all resources are available online.  However, they will be registered as a student of the University and are welcome to use their facilities should they wish to do so. \r\n\r\nCovid-19\r\n- In the event of Covid-19 restrictions impacting on schools, we will monitor, re-evaluate and amend the training and delivery of the programme where necessary in response to guidance from the Government, Public Health England, DfE and NASBTT in order to protect pupils, staff and trainees, whilst continuing to offer a high quality programme.\r\n\r\n","interviewProcess":"- Interviews will be held at regular intervals starting in early November.\r\n\r\n- Due to Covid-19 restrictions, these interviews may take place virtually. \r\n  \r\nInterviews will consist of, but not limited to:\r\n- A small teaching task, \r\n- A self-reflection task,  \r\n- A subject knowledge interview\r\n- A formal interview with senior staff and subject leaders.  \r\n\r\n- You will be expected to present original qualification and identification for verification at interview. You will also be expected to present these in person prior to starting the course.\r\n\r\n- If you are provided with a conditional offer, you will also be expected to sit short fundamental key skills maths and literacy diagnostic assessments. These will not form part of any offer made to you, but you will be expected to have demonstrated competency in these skills prior to us awarding your QTS. \r\n","howSchoolPlacementsWork":"Main Placements:\r\n- You will have 2 contrasting placement schools during your training year.  \r\n- You will attend your Host placement school from September - December and then again from Easter – June.  \r\n- You will attend your Complementary placement school from January – Easter. \r\n- We have over 40 secondary and primary partnership schools across Wiltshire, Swindon and surrounding areas that offer placements to our trainees.  \r\n- NWSCITT will arrange your placement schools for you.\r\n- When placing our trainees, we look at their subject, location and the capacity within our partnership schools to support our trainees.  \r\n- Where possible we aim to place you within approximately a 30-40 minute commute of your home. \r\n \r\nAlternative Placements:\r\n- In addition to the two main school placements, we aim to offer trainees the experience of short primary and specialist school placements to provide an understanding of alternative phase and alternative provision schools (Covid restrictions permitting).\r\n\r\nTeaching Timetable and Hours Worked:\r\n-  The programme starts at the beginning of the school year in your Host placement school. \r\n- Trainees will initially observe classes and work alongside the class teacher.\r\n- This will increase to team-teaching and small group teaching. Eventually, trainees will take on responsibility for entire classes, lesson planning and lesson sequencing.\r\n- Trainees can expect to begin by following a 40% teaching timetable, gradually increasing to 70%-80% by the end of the year.  By this point trainees should have developed high level teaching skills.\r\n- Please expect to work full days during your course. It is also highly likely that you will be working outside of normal working hours at home.\r\n-Please expect subject and central training days to run from 09.00am-4.00pm, subject to variation.\r\n\r\nCovid-19:\r\n- In the event of Covid-19 restrictions continuing to have an impact on schools, we will monitor, revaluate and amend our programme where necessary in response to guidance from the Government, Public Health England, DfE and NASBTT.  This may include the structure of placements if necessary, or removal of alternative placements if not feasible.\r\n","personalQualities":"We look for:\r\n- Inspirational trainees, with a passion for Social Sciences, who are committed to education.\r\n- Trainees must demonstrate a knowledge of their main and second Social Science subjects at interview\r\n- Flexibility, initiative, resilience.\r\n- Be a confident communicator.\r\n- Excellent time management skills\r\n- Be able to remain calm and focused under pressure. \r\n-  A team player. \r\n- Prepared to work hard and be organised.\r\n\r\nSchool Experience:\r\n- Whilst not a requirement of the course, it is beneficial to gain some school experience to understand the role of a teacher in the classroom.\r\n\r\n\r\n","otherRequirements":"Safeguarding Commitment:\r\n- You will be required to undergo an enhanced (DBS) and barred list check.  You will also be checked against the Teacher Regulation Agency.\r\n- If you have lived abroad in the last 10 years, you will be required to present a Certificate of Good Conduct or Police Check from that country.\r\n- We reserve the right to check references and work history\r\n\r\nFitness to teach:\r\n- You will be required to complete a satisfactory medical report to show you meet the standards for 'Fitness to Teach'.\r\n\r\n\r\n\r\n\r\n\r\n\r\n  \r\n","status":1,"createdAt":"2021-07-06T10:55:22.503Z","updatedAt":"2021-09-27T10:06:10.435Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
