{"id":"381e7596-1acf-4f74-9b43-98cf54f824c8","name":"Primary","code":"2CYH","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"8e7934f1-dcac-4433-811d-ea1dcabdcc75","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"eddd5b3b-1897-4709-af8d-def2ab73001d","code":"1CV","name":"Robert Bloomfield Academy"},"accreditedBody":{"id":"d1392666-2454-4973-8848-d743beecfc33","code":"B31","name":"The Bedfordshire Schools Training Partnership"},"profPost":"BO","degreeGrade":"9","english":"1","maths":"1","science":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"A* Equivalency\nEquivalencytesting.com","courseLength":"OneYear","feesUK":9250,"aboutCourse":"The School Direct Primary training course operates over one school academic year and is a full time programme. All PGCE tuition fee trainees will be in school for the equivalent of  four days per week increasing to five days per week in the final term. This course is offered through the Lead Schools of St Thomas More Catholic Teaching School, Bedford and Robert Bloomfield Academy Shefford.\r\n\r\nDuring the training year, applicants will be allocated a  trained mentor within the appropriate age phase  to oversee their training and development in both their main school placement and also in their six week complementary placement.\r\n\r\n Applicants will also be required to attend the twice weekly taught course sessions which underpin the practical, school based element of the training. These are the Professional Studies course which aims to connect theory and practice and addresses the Standards for QTS and will involve assessment via the successful of completion of  assignments & Reflective Journals. Additionally, all trainees will attend the Subject Application course which will be delivered by specialists in the relevant Primary age group and will address subject knowledge and appropriate pedagogical approaches and which will cover the curriculum requirements for the Core and Foundation subjects. \r\n\r\n\r\n\r\n\r\n","interviewProcess":"Applications received by The Bedfordshire Schools' Training Partnership are subject to initial shortlisting by the Programme Manager. Shortlisted candidates are then invited to attend an interview which consists of a written task, a practical classroom focussed exercise as well as basic literacy & numeracy testing. Successful candidates are then informed of the outcome within two working days of the interview date.\r\n\r\nWhere the application is for a Schools Direct Salaried training place - applicants may be required to attend a second interview with their placement school\r\n","howSchoolPlacementsWork":"\r\nAs part of the training programme, all applicants will have two school placements which will enable them to teach across two consecutive age ranges focusing on KS1 & 2.These will take the form of a main school placement in a Lower, Primary or Middle school and a shorter complementary placement.\r\nDuring the training year, applicants will be allocated a dedicated mentor within the appropriate age phase to oversee their training and development in both their main school placement and also in their six week second placement.\r\n","personalQualities":"We welcome applications from all suitably qualified applicants. We would encourage applicants to familarise themselves with the Teacher Standards and the Primary National Curriculum - as well as the current issues effecting education and schools.\r\nAdditionally, we are looking for applicants with excellent communication skills and who can demonstrate  commitment, enthusiasm and a genuine interest in working with young people.\r\n","otherRequirements":"In line with current safeguarding practice,  we (or the employing school) will carry out a number of pre-employment checks, including taking up references and a DBS Clearance check for all trainees prior to the start of the course.\r\n\r\n","status":1,"createdAt":"2021-07-06T10:49:20.777Z","updatedAt":"2021-09-14T13:27:20.755Z","canSponsorStudentVisa":"no","cycle":"2024"}
