{"id":"4c6b14e0-b6b5-4ea3-893f-77a1effbad1f","name":"Business studies","code":"M193","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"de6477b2-6027-48e6-b9f7-3206774705c2","code":"08","name":"Business studies"}],"locations":[{"id":"38857a66-eda8-47c4-a420-b09a37b46649","name":"Queens' School","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"08c1836b-f0d2-432a-b182-0365a728c7a4","code":"1D5","name":"Parmiter’s School"},"accreditedBody":{"id":"feecdec5-259c-45e3-b1cf-4e391936ee90","code":"H36","name":"University of Hertfordshire"},"english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","aboutCourse":"The School Direct teacher training programme is a full time, one year Initial Teacher Education qualification introducing you to the requirements for teaching to the 11 – 16 age range. Where appropriate, opportunities to experience post 16 provision will be available. It has been designed to enable you to demonstrate evidence of having met the Teachers’ Standards that lead to Qualified Teacher Status. The School Direct salaried programme allows you to work towards securing 30 Master's level credits. This is an integral part of the programme. We strongly believe that innovative and effective teaching and learning is made possible through a teacher’s full engagement with research informed practice and underpinning theories of learning. This is fostered in two modules and developed through School Based Training. You will be well supported in becoming a critically reflective teacher capable of inspiring pupils to learn, achieve and flourish.\r\n\r\nYou will be supported and taught by specialist tutors with excellent experience, knowledge and research informed expertise. Partnership schools provide opportunities for you to learn about pedagogical approaches relevant to your subject specialism and the professional responsibilities of all teachers.\r\n\r\nYou will have a six week second school experience with a contrasting school in the Spring term, where, with the support of a teacher mentor and a university subject tutor, you will develop your skills to become an excellent classroom teacher. Training to teach is exciting, rewarding and demanding. By the end of the course you will be well prepared for employment as a Newly Qualified Teacher (NQT). \r\n","interviewProcess":"The selection process requires candidates to  \r\n* teach a lesson (topic provided in advance)\r\n* subject knowledge interview\r\n* 45 minute written English task\r\n* panel interview \r\n\r\n","howSchoolPlacementsWork":"Trainees will train in a partner school within the Herts and Bucks Teaching School Alliance, the home school is determined at interview. Generally speaking, every effort is made to match trainees to a school of their choice. Trainees spend six weeks in a contrasting school in the Spring term. Secondary school trainees will spend a day observing lessons in a primary school and primary general trainees will spend a day observing lesson in a secondary school. Trainees will benefit from the support of departmental colleagues, a subject/teacher mentor and a professional mentor. Trainees are supported by weekly mentor meetings. ","personalQualities":"","otherRequirements":"","status":2,"createdAt":"2021-07-06T10:53:21.031Z","canSponsorSkilledWorkerVisa":"no","salaryDetails":"The salary is unqualified teaching scale point one. "}
