{"id":"6e83554b-cf89-4035-b368-336aa4e76ffe","name":"Primary","code":"2XS8","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"16785fc9-1db6-4c13-983e-a90417ade7e9","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"b6d44f7c-44cb-4edc-a0fd-f726cc82d1b5","code":"2BE","name":"Ashbourne Dove Valley Federation ITT"},"accreditedBody":{"id":"aa023df3-b71e-4249-b9c4-41fca8bd135e","code":"D39","name":"University of Derby"},"profPost":"PG","degreeGrade":"1","english":"1","maths":"1","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"The ADVF will cover the costs, up to £175, for the Science equivalency through a equivalency testing provider.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"There are 20 places for 2022/23!\r\n\r\nThe ADVF provides teaching placements for the whole academic year; meaning you are in a school throughout the year rather than having short blocks in a school and other blocks at University. The University and CPD part is done weekly, where you will have one day out of school each week to have training with the rest of the trainees- these will be based either at The University of Derby or at a location chosen by the Federation. These training days are focused specifically on a particular area of the curriculum, or teaching in general, and are delivered by professional University lecturers or experienced teachers who specialise in the given area and who are therefore extremely knowledgeable and passionate about their subject.\r\n\t\r\nADVF works in true collaboration with placement schools, as it believes that investing in the School Direct Programme will contribute positively towards the education of young children, so enforcing teaching and learning. \r\n\r\nWhat makes us stand out:\r\n-The personal touch- we spend a lot of time matching the trainee to a school to ensure the experience is as effective as possible for both the trainee and the school. Consideration of where you live and how far you have to travel is also of high priority to us. We support you throughout the year and are always on the end of the phone.\r\n Trainees are informed very early in the year regarding which host school they will be placed in.\r\n\r\n-All our schools are Ofsted rated ʻgoodʼ or ʻoutstandingʼ.\r\n\r\n-Part of our training programme offers support writing personal statements and interview preparation guidance and modelling. \r\n\r\nADVF will give you:\r\n\r\n•Academic input and professional studies from our HE partner Derby University, leading to qualified Teacher Status (QTS) with Post Graduate Certificate of Education (PGCE). Derby University is the awarding institution.\r\n\r\n•Experience across two placements in the differing Primary Phases. (Four days a week in School and one day a week of training in the Federation Hub or at Derby University.\r\n\r\n•Enrichment opportunities in a variety of educationalist establishments. (Three weeks)\r\n\r\nAssessment: Three practical performance assessments (one each term)\r\n\r\nFor further information please visit our website:\r\n(http://www.teachashbourne.com)\r\n\r\n\r\n","interviewProcess":"The interview process would usually consist of the following: \r\n\r\n-An Observation task; this will involve leading a group of 6 x Year 3 pupils for 20-30mins. You have a choice of either leading an activity on the theme of a 'story' or a 'mathematical activity'. The time allocation will include setting up and tidying away. You will be expected to bring your own resources. \r\n-A one to one interview.\r\n-Possibly a group interview/discussion.\r\n-Maths and English review. \r\n-Interview panel will consist of ADVF ITT Director.\r\n\r\nHowever, due to Covid protocols, there is no confirmed process for how interviews will be conducted. Applicants will be notified following their application regarding the process for interview.","howSchoolPlacementsWork":"Candidate schools are selected depending on distance of travel from their home. No more than 15 miles. \r\nWe offer primary training in 3-7 years and 5-11.\r\nWe currently partner with 35 schools. \r\n\r\nYou will be placed in a ʻMainʼ placement school for the Autumn Term (September to Christmas) and will return to this school at the end of the Spring Term until the end of the Summer Term (April to July). In between (8 weeks), you will be placed in your ʻSecondʼ placement school that will be in a contrasting year group to your ʻmainʼ placement. \r\n\r\nDuring the Spring Term, you will also have two enrichment weeks- you will visit schools that specialise in different SEN areas. You will also be given the opportunity to experience other educational establishments, a secondary school environment or a different year group in your host or second school.  This means that by the end of your training year, you will be provided with an extensive experience of a range of schools and age groups, to prepare you for becoming an Early Career Teacher.\r\n\r\n","personalQualities":"The ADVF is looking for talented hardworking individuals who demonstrate enthusiasm and commitment to work with young children across the Primary Phase.\r\nExperience in Primary School can be arranged prior to starting the course in September 2021.\r\n","otherRequirements":"","status":1,"createdAt":"2021-07-12T13:48:10.159Z","updatedAt":"2021-09-27T15:28:11.335Z","canSponsorStudentVisa":"yes","cycle":"2024"}
