{"id":"47a15fd9-0dca-4955-bfb4-10d88ae78894","name":"Primary with Mathematics","code":"X00G","qualification":"pgde_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"286cf12f-b3e3-41c5-9f33-2ff7807d2df0","code":"03","name":"Primary with mathematics"}],"locations":[{"id":"1526eb33-cd39-4f65-9984-eec624b3555c","name":"University of Birmingham","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"c357e0fa-802e-471b-818a-d0cd1434f9cd","code":"B32","name":"University of Birmingham"},"profPost":"PG","degreeGrade":"1","english":"1","maths":"1","science":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"You will need to undertake and pass your equivalency test prior to making an application.\nPlease use this website to undertake the test: https://www.equivalencytesting.com","courseLength":"38 weeks","feesUK":9250,"feesInternational":18450,"feeDetails":"When you apply for this course, it is important that you also take into account living costs and should ensure that you will have sufficient funds to finance the full duration of your studies. Our PGDipEd programmes include a significant amount of time spent on placements in a variety of schools at different locations, and so when budgeting to study you should also allow for travel to and from placements, as well as textbooks, printing, photocopying and stationery that you may need.","aboutCourse":"The Primary Mathematics Specialist teacher training course is ideal if you want to teach young children and you have a strong interest in mathematics.\r\n\r\nThe Postgraduate Diploma in Primary Education is a teacher training programme leading to Qualified Teacher Status (QTS).  This Primary Mathematics Specialist programme will enables you to develop your subject expertise within a primary context. You will learn to teach all the primary curriculum subjects, and will develop specialist expertise in mathematics.  The course lays the foundations for you becoming a future leader in mathematics. You will be prepared for employment in a generalist role at the start of your career, where you will ‘champion’ mathematics and inspire children and teachers.  The course also prepares you for employment in a more specialist role, teaching mainly or solely mathematics.\r\n\r\nWe are looking to recruit graduates with strong mathematics subject knowledge who demonstrate an enthusiasm for mathematics and an understanding of the primary context. \r\n\r\nThe programme offers the equivalent of 120 credits and these may be used towards our MA in Teaching Studies. Additionally, the School also offers a number of specialised Professional Development programmes which will enable you to further develop your career.\r\n\r\n[Visit our course page to find out more](https://www.birmingham.ac.uk/postgraduate/courses/taught/edu/teacher-training-primary-mathematics.aspx)","interviewProcess":"Selection is rigorous and designed to identify candidates with the strongest aptitude. Successful applicants will undertake an online interview where you will:\r\n\r\n* meet course tutors\r\n* find out more about the course\r\n* complete a written task (where relevant)\r\n* have a one to one interview\r\n* show GCSE and Degree certificates (where these are available).\r\n\r\nWe work closely with partner schools to select candidates and applicants will often have the opportunity to meet senior colleagues from partner schools when they join us for interview day.\r\n\r\n","howSchoolPlacementsWork":"The school-based placements will enable you to put into practice what you have learned and to develop and refine your teaching skills. You will have the opportunity to teach mathematics and the wider primary curriculum in two different schools. In both schools, you will work with one base class, and also another supplementary class.  You will experience both Key Stage 1 and Key Stage 2 during your training year, and you can express preference for phases, which we accommodate if we can.  You will also spend shorter Special Interest Placements in the Early Years Foundation Stage and in Key Stage 3.  These experiences will develop your understanding of progression in children’s mathematical learning and hence your leadership potential.\r\n\r\nOur partnership schools vary in size, phase and context, giving you the opportunity to broaden your teaching experience. You will visit outstanding schools and meet primary mathematics leaders. By the end of the course you will have had the experience and support to begin your career as an effective and confident primary teacher, and an enthusiastic mathematics ‘champion.’","personalQualities":"* Relevant academic profile and intellectual capacity\r\n* Strong subject knowledge\r\n* Awareness of contemporary educational issues\r\n* Motivation, enthusiasm and a clear rationale for teaching\r\n* Responsibility, maturity, open-mindedness\r\n* Appropriate ethics and values, including equal opportunities \r\n awareness\r\n* Effective spoken and written Standard English\r\n* Commitment to teaching as a career.\r\n","otherRequirements":"* have a GCSE in Maths (grade 7 or above), English (grade 4 or above), or an equivalent qualification obtained before application. If not already obtained, GCSE Science (Grade 4) must be attained as a condition of entry. If you are offering an alternative qualification check with us before applying.\r\n\r\n* complete an enhanced Disclosure and Barring Service (DBS) check;\r\n\r\n* complete relevant checks to ensure you have the health and physical capacity to teach;\r\n\r\n* agree to abide by the University of Birmingham Code of Professional Conduct and Fitness to Practise. \r\n","status":1,"createdAt":"2021-07-06T10:47:53.178Z","updatedAt":"2021-10-04T15:42:46.716Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
