{"id":"da2dbf2b-fd59-4255-b795-929783d60917","name":"Primary","code":"X100","qualification":"pgde_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"3_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"1526eb33-cd39-4f65-9984-eec624b3555c","name":"University of Birmingham","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"c357e0fa-802e-471b-818a-d0cd1434f9cd","code":"B32","name":"University of Birmingham"},"profPost":"PG","degreeGrade":"1","english":"1","maths":"1","science":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"You will need to undertake and pass your equivalency test prior to making an application.\nPlease use this website to undertake the test: https://www.equivalencytesting.com","courseLength":"38 weeks","feesUK":9250,"feesInternational":18450,"feeDetails":"When you apply for this course, it is important that you also take into account living costs and should ensure that you will have sufficient funds to finance the full duration of your studies. Our PGDipEd programmes include a significant amount of time spent on placements in a variety of schools at different locations, and so when budgeting to study you should also allow for travel to and from placements, as well as textbooks, printing, photocopying and stationery that you may need.","aboutCourse":"The Postgraduate Diploma in Primary Education (PGDipEd) will enable you to teach in state-maintained and special schools in England and Wales. Our specialist programme offers high quality training and support, which will prepare you to teach in the 3-11 age range and is run in close partnership with schools. Once you have secured a place on this Primary PGDipEd course, you will opt to specialise either as General Primary teacher (5-11 years) or as an Early Years teacher (3-7 years). Rated outstanding by Ofsted in 2013, this is a course which offers high quality training and support as well as excellent employment prospects.\r\n\r\nLike a Postgraduate Certificate in Education (PGCE) the Postgraduate Diploma in Primary Education is a teacher training programme leading to Qualified Teacher Status (QTS) but it also offers the equivalent of 120 credits and these may be used towards our MA in Teaching Studies.  Additionally, the School also offers a number of specialised Professional Development programmes which will enable you to further develop your career.\r\n\r\n[Visit our course page to find out more](https://www.birmingham.ac.uk/postgraduate/courses/taught/edu/teacher-training-primary.aspx)","interviewProcess":"Selection is rigorous and designed to identify candidates with the strongest aptitude. Successful applicants will undertake an online interview where you will:\r\n\r\n* meet course tutors\r\n* find out more about the course\r\n* complete a written task (where relevant)\r\n* have a one to one interview\r\n* show GCSE and Degree certificates (where these are available).\r\n\r\nWe work closely with partner schools to select candidates and applicants will often have the opportunity to meet senior colleagues from partner schools when they join us for interview day.\r\n","howSchoolPlacementsWork":"School-based experiences are a central part of these programmes, with students normally spending a total of 24 weeks in schools. During the programme you benefit from the experience of spending a significant length of time in two schools and work  with at least two different year groups.\r\n\r\nThe final assessment of teaching is based on the spring/summer term school placement. Assessment is shared between University tutors, staff responsible for students in schools, and external examiners. All aspects of your contribution to the life of the school are taken into account, in particular teaching in your chosen phase.\r\n\r\nDuring the course, supervised experience and practice are arranged in schools. We are fortunate in being able to work with various kinds of partnership schools, with an opportunity for you to experience a range of ages between 3-11. Many of the schools offer opportunities to work with pupils from a wide variety of cultural backgrounds.  \r\n\r\n. ","personalQualities":"Relevant academic profile and intellectual capacity\r\n\r\n* Strong subject knowledge\r\n* Relevant work/volunteering experience\r\n* Awareness of contemporary educational issues\r\n* Motivation, enthusiasm and a clear rationale for teaching\r\n* Responsibility, maturity, open-mindedness\r\n* Appropriate ethics and values, including equal opportunities awareness\r\n* Effective spoken and written Standard English\r\n* Commitment to teaching as a career.\r\n","otherRequirements":"* have a GCSE in Maths, English (grade 4 or above), or an equivalent qualification obtained before application. If not already obtained, GCSE Science (Grade 4) must be attained as a condition of entry. If you are offering an alternative qualification check with us before applying.\r\n\r\n* complete an enhanced Disclosure and Barring Service (DBS) check.\r\n\r\n* complete relevant checks to ensure you have the health and physical capacity to teach.\r\n\r\n* agree to abide by the University of Birmingham Code of Professional Conduct and Fitness to Practise.","status":1,"createdAt":"2021-07-06T10:47:53.210Z","updatedAt":"2021-10-04T15:42:39.551Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
