{"id":"f53102c3-2f92-4646-8d2a-40f426519ad6","name":"Geography","code":"F8X1","qualification":"pgde_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3f47e67b-7fa5-4947-a5a0-74d528cd2a87","code":"F8","name":"Geography"}],"locations":[{"id":"1526eb33-cd39-4f65-9984-eec624b3555c","name":"University of Birmingham","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"c357e0fa-802e-471b-818a-d0cd1434f9cd","code":"B32","name":"University of Birmingham"},"profPost":"PG","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"All applicants to the Secondary PGDipEd(QTS) Geography course must hold a degree from a UK Higher Education Institution or an equivalent qualification. This will normally be a minimum 2:2 classification and will be a condition of any offer where the degree has not already been awarded. We will expect your first degree to consist of at least 50% geography (either Physical or Human, but preferably a balance of both). Degrees in Environmental Science, Geology, Geosciences, etc. may be considered, but the university must be certain that such degrees contain at least 50% geography. You will be expected to show a broad base of geographical knowledge (both human and physical) at the interview.","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"You will need to undertake and pass your equivalency test prior to making an application.\nPlease use this website to undertake the test: https://www.equivalencytesting.com","courseLength":"36 weeks","feesUK":9250,"feesInternational":18450,"feeDetails":"When you apply for this course, it is important that you also take into account living costs and should ensure that you will have sufficient funds to finance the full duration of your studies. Our PGDipEd programmes include a significant amount of time spent on placements in a variety of schools at different locations, and so when budgeting to study you should also allow for travel to and from placements, as well as textbooks, printing, photocopying and stationery that you may need.","aboutCourse":"Our PGDipEd (QTS) Geography course is recognised as one of the strongest in the country. The course benefits from its supportive partnerships with geography mentors in a variety of schools in the West Midlands. It offers opportunities to learn in a range of settings, including a week of residential fieldwork with children. The course encourages you to combine the theory and practice of geographical education, whilst also developing your professional understanding and competence as a geography teacher. The programme also includes a residential Geography fieldcourse. \r\n\r\nAt the University of Birmingham we believe we should provide student teachers with the highest level of teacher training possible, and this is why we offer a Post-Graduate Diploma in Education (PGDipEd also known as a PGDE) rather than a Post-Graduate Certificate in Education (PGCE). Both qualifications lead to Qualified Teacher Status (QTS) but the PGDipEd also offers the equivalent of 120 credits towards a masters (out of 180 credits), which makes it a highly rewarding course by combining both theory and practice.\r\n\r\nFollowing satisfactory completion of this course, plus a successful induction year in school and references, you can return to complete an MA in Teaching Studies. Additionally, the School also offers a number of specialised Professional Development programmes which will enable you to further develop your career.\r\n\r\n[Visit our course page to find out more.](https://www.birmingham.ac.uk/postgraduate/courses/taught/edu/teacher-training-secondary-geography.aspx)","interviewProcess":"Selection is rigorous and designed to identify candidates with the strongest aptitude. Successful applicants will undertake an online interview where you will:\r\n\r\n* meet course tutors\r\n* find out more about the course\r\n* complete a written task (where relevant)\r\n* have a one to one interview\r\n* show GCSE and Degree certificates (where these are available).\r\n\r\nWe work closely with partner schools to select candidates and applicants will often have the opportunity to meet senior colleagues from partner schools when they join us for interview day.\r\n","howSchoolPlacementsWork":"School-based work is an important part of the programme, with students normally spending a total of 24 weeks in schools. During the programme you benefit from both carefully supported introductory work in different schools and the experience of spending a significant length of time in two schools.\r\n\r\nThe final assessment of teaching is based on the spring/summer term school placement. Assessment is shared between University tutors, staff responsible for students in schools, and external examiners. All aspects of your contribution to the life of the school are taken into account, in particular the teaching of your main subject.\r\n\r\nDuring the course supervised experience and practice are arranged in schools of various kinds across the 11–18 age range. We are fortunate in being able to work with a wide range of partnership schools, including mixed comprehensives, single-sex schools, sixth-form colleges and our own University Training School (www.uobschool.org.uk). Many of the schools offer opportunities to work with pupils from a wide variety of cultural backgrounds.  ","personalQualities":"In selecting candidates for a place on a University of Birmingham ITE programme, University and school-based colleagues look for: \r\n\r\n* Relevant academic profile and intellectual capacity\r\n* Strong subject knowledge\r\n* Relevant work/volunteering experience\r\n* Awareness of contemporary educational issues\r\n* Motivation, enthusiasm and a clear rationale for teaching\r\n* Responsibility, maturity, open-mindedness\r\n* Appropriate ethics and values, including equal opportunities awareness\r\n* Effective spoken and written Standard English\r\n* Commitment to teaching as a career.\r\n","otherRequirements":"You must also have:\r\n\r\n* a GCSE in Maths and English (Grade 4 or above) or an equivalent qualification which must be attained before the application; \r\n\r\n* complete an enhanced Disclosure and Barring Service (DBS) check.\r\n\r\n* complete relevant checks to ensure you have the health and physical capacity to teach.\r\n\r\n* agree to abide by the University of Birmingham Code of Professional Conduct and Fitness to Practise. \r\n","status":1,"createdAt":"2021-07-06T10:47:52.890Z","updatedAt":"2021-10-04T15:41:20.475Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
