{"id":"4c64edb8-9467-406d-b33e-d700027e7ee7","name":"Primary","code":"38YD","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"TA","fundingType":"apprenticeship","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"e866ba56-b26b-4b9c-941d-8ca7e84afcc7","name":"Southwold Primary School","isPublished":"N","status":"S","vacancies":"F"},{"id":"bb57069f-4015-476d-bf94-842376d88a44","name":"Hoxton Garden","isPublished":"N","status":"S","vacancies":"F"},{"id":"8996f582-0e32-4475-8f47-fec9bcce4428","name":"Orchard School","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"d540e070-63f7-46ae-b5d8-5eb04c06e813","code":"2CN","name":"The Viridis Schools Partnership"},"accreditedBody":{"id":"30bda414-7b00-426c-956b-18a187efe967","code":"L68","name":"London Metropolitan University"},"profPost":"PG","degreeGrade":"1","english":"1","maths":"1","science":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feeDetails":"With Postgraduate Teaching Apprenticeship programmes, you won’t need to pay any tuition fees. You'll be employed by a school full time, as an unqualified teacher and your employer (the school) will pay the tuition fees.","aboutCourse":"The Viridis Schools Postgraduate Apprenticeship Programme offers a school-led, employment-based, postgraduate initial teacher training which leads to Qualified Teacher Status (QTS & PGCE) in partnership with London Metropolitan University.\r\n\r\nhttps://www.londonmet.ac.uk/applying/postgraduate/teacher-training/graduate-teacher-apprenticeships/  \r\n\r\nPostgraduate Teaching Apprenticeship programmes are a nationally-recognised, work-based route into teaching. It is an alternative to a traditional full-time university course, offering a postgraduate-level qualification, no tuition fees, and the opportunity to earn while you learn. Our apprentices have achieved very achieve highly: in its first year of running, our trainees were all graded Outstanding in their teaching practice and almost all gained distinctions in the academic work. All have continued in employment in their schools. This exciting and  challenging route is the perfect preparation for your career in teaching. \r\nYou will be employed by a school as an unqualified teacher while you learn on the job with an inner London salary of £22, 849 with the possibility of being employed by the school as a teaching assistant in the Summer term of 2022 to support your induction.\r\nIf you’re currently working as an unqualified teacher or teaching assistant, it offers new opportunities for career progression, plus higher earning capacity, recognition, and status. You’ll receive a combination of classroom teaching and off-the-job training as you to work towards Qualified Teacher Status (QTS). Our unique training partnership with London Metropolitan University will also prepare you for a PGCE qualification with face to face training at University along with independent tasks.\r\nSimilar to School Direct (salaried) programmes, you’ll be employed directly by the school. Unlike School Direct (salaried) programmes:\r\n•\tPostgraduate Teaching Apprenticeship programmes combine paid work with on and off-the-job training. The design of the programme is led by our schools partnership specifically for apprentices.\r\n•\tApprentices will split their time between school and university study. You’ll receive practical, school-led training alongside experienced staff, and spend at least 20% of your time off-timetable to learn the pedagogy of teaching including one day every fortnight in attendance at London Metropolitan University.\r\n•\tIn addition to working towards QTS on successful completion of the course, apprentices will also complete an end point assessment (EPA) in the Autumn Term to consolidate learning from initial teacher training.\r\n\r\n","interviewProcess":"Congratulations you've been invited to interview...\r\n\r\nShortlisted applicants are invited to interview by email. In the first instance you will be interviewed at Orchard School and asked to teach a class of 30 children for 20 minutes. This task is designed to see how children respond to you, and how you respond to them. If successful you will then be invited to meet the team at London Metropolitan University.\r\n\r\nYou should expect to be on campus (Holloway Road site)  for up to 4 hours for the full interview process to be completed. There will be a literacy test in the form of a written task, a teaching exercise/presentation and an individual interview with a course tutor to discuss your application and merits for the course.  \r\n\r\nIf you cannot attend interview by the deadline specified Apply will reject your application. If unsuccessful with your other choices you could then use APPLY2 to be reconsidered with us. For further details on this process contact the admissions office.\r\n","howSchoolPlacementsWork":"Our partnership currently consists of seven Hackney primary schools:\r\nOrchard Primary\r\nSouthwold Primary\r\nHoxton Garden Primary\r\nLondon Fields Primary\r\nShoreditch Park Primary\r\nWentworth Nursery School\r\nLondon Fields Primary\r\n\r\nYou will be placed in a class, gradually taking over responsibility for their learning, building to 80% teaching time by the end of the year.\r\n\r\nWho will teach me during my training?\r\nExperienced classroom teachers, educational consultants, subject specialists and lecturers from London Metropolitan deliver the training.\r\n\r\nWill I earn a salary?\r\nYou will be employed by a school as an unqualified teacher while you learn on the job with an inner London salary of £22, 849 with the tuition fees being met from the apprenticeship levy at no cost to the student.\r\n\r\nHow will I be assessed?\r\nA number of different people are responsible for assessing your progress towards the standards. Your practical teaching will be assessed by your mentor, link tutor and other experienced teachers. Tasks and assignments are marked by link tutors and moderated by lecturers from UEL. Rigorous quality assurance procedures ensure that assessment is carried out effectively and fairly.\r\n\r\nWhat support will I get during the programme?\r\nYou will be allocated a Link Tutor who will visit you at least once every half term to observe your teaching and give you feedback. You will also meet your Link Tutor half termly for a review meeting to discuss progress and targets. You will also be allocated a school-based mentor; this may be your class teacher or it may be another experienced member of the school staff. Your mentor will observe you and give you feedback on your teaching at least once a week. They will also meet you weekly to discuss your training plan, targets and progress.\r\n\r\nAdditional support is available as necessary. If you have a special need or disability we urge you to discuss this with us as early as possible so that we can make any necessary adjustments and provide the support that you need.\r\n","personalQualities":"We are looking for applicants who:\r\nAre self-reflective and seeking to be the best at their profession\r\nHave a professional outlook and thrive on challenge\r\nHave a passion for teaching, and are ambitious for children, and for making a difference.\r\nGenuinely enjoy the company of children and can see the fun as well as the serious side of teaching \r\nUnderstand that different children learn in different ways\r\n","otherRequirements":"Ideally (but not essentially) some recent experience of working with children in educational settings.\r\nThe ability to communicate clearly and accurately in Standard English (both written and orally)\r\nA commitment to teach and a motivation to learn\r\nWell-developed personal qualities and skills such as self-organisation, resilience and reflectiveness\r\nA commitment to equal opportunities\r\nHave passed the professional skills tests (you may apply before you have passed the skills tests but we would expect you to book them as soon as possible and to have passed them by the deadline set as part of your offer)","status":1,"createdAt":"2021-07-06T10:53:46.639Z","updatedAt":"2021-10-29T18:17:45.439Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024"}
