{"id":"08b0b0e9-b923-44e5-ac71-d97381a2348a","name":"Primary (5-11)","code":"3CFZ","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"8b98869a-438e-4dcd-a5a8-68f73a4b5263","name":"The University of Northampton","isPublished":"N","status":"N","vacancies":"F"},{"id":"27fec846-ebe7-4cfa-9c2e-290d022bd3b1","name":"University of Northampton Waterside Campus","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"3188762f-4fac-46f3-b660-49507ccaa225","code":"1YY","name":"InMAT Northamptonshire"},"accreditedBody":{"id":"d4a65e61-defa-4861-b837-17ef2a1157c7","code":"N38","name":"University of Northampton"},"profPost":"BO","english":"2","maths":"2","science":"2","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feeDetails":"Not applicable","aboutCourse":"This course is part of the InMAT Northamptonshire School Direct route.  Throughout the PGCE primary programme you will develop your subject knowledge across the primary National Curriculum and gain a deeper understanding of how young children learn.  The theory, underpinning pedagogy, will be taught to you at the Waterside Campus at the University of Northampton.  You will study 2 modules - Teaching, Learning and Assessment and Professional Studies.  Your University based study will be in blocks of 2-3 weeks across the year.\r\n\r\nInMAT will arrange your school experience and support you through this. Teaching practice is organised as three school placements which are usually arranged in two different primary school settings.  You will gradually increase your teaching commitment as the year progresses, taking increased responsibility for leading the class.  We aim to give our students choice about their preferred location for professional training.  In the Autumn term you will learn in School One;  in the Spring term, School Two and finally returning to School One for the Summer term.  Occasionally, students elect to take a placement in a different school for the Summer term.  \r\n\r\n You will qualify with QTS and a PGCE.\r\n\r\nFor the purpose of assessment, you will be required to complete four assignments, two in each level 7 module.  These are spread out across the year.  Your learning will be supported by highly experienced tutors and mentors and the University's contemporary site hosts excellent library resources.\r\n\r\nOur partner, The University of Northampton is rated as Gold in the Teaching Excellence Framework and Inspire is a highly successful Teaching School with an alliance of over 45 primary schools. Together, we will help you to become the teacher that you wish to be and to inspire minds and change lives.\r\n\r\n\r\n\r\n","interviewProcess":"For this route into teaching you will be required to attend one interview.  Following submission of your application through UCAS, you may be invited to attend an interview at the Waterside Campus based in Northampton.  A teacher from InMAT, or one of our partnership schools, and a member of staff from the University will explore your commitment to teaching and your awareness of current  educational contexts.  The purpose of this interview is to give you an opportunity to demonstrate your enthusiasm for your chosen career and for us to consider your communication and interpersonal skills.  You are not expected to demonstrate an extensive knowledge of teaching practices at this early stage.  \r\n\r\nSchool experience is not a requirement of this course but to help you to prepare for interview, it is advisable that you arrange to spend some time in a primary school setting.\r\n\r\nWe are an inclusive organisation and no applicant will be prejudiced as a result of any disability.  Reasonable adjustments will be made to mitigate unfair discrimination.  Any candidate with a disability is actively encouraged to identify and request support for actual or potential circumstances.\r\n\r\nTo be eligible for selection you will need to hold an honours degree from  a UK University at 2:1 or a First.  Applicants with a  2:2 will be considered if they can evidence a lot of professional experience working with children.  You will need to bring your certificates to interview.\r\n\r\n","howSchoolPlacementsWork":"All of InMAT schools are Early Years or Primary settings; this means that we can offer you vast expertise in your chosen route into teaching and excellent training opportunities into your career.  We know and understand primary practice.  We are also privileged to have access to a wealth of teachers who have already transformed the lives of many children; they can help you to do the same.  Having so many varied primary schools within our alliance means that we can offer you a range of contexts to support your interests and professional development needs. \r\n\r\nWe make every attempt to accommodate the needs of our students when determining placements.  If successful at interview, we will follow up with a meeting to ask you about your preferences in terms of location, type of schools and Key Stage.  Our promise to you is that we will make every attempt to meet your needs. \r\n\r\nYou will complete a placement in Key Stage One and Key Stage Two at two different schools.  The longer placement will be in the first school as most students return to this in the Summer term.  You are also given the opportunity to arrange a self-organised placement, for a week, so that you can explore some career options or experience an alternative phase.\r\n\r\nThe school placements begin in September and end in June.  The placements are supported by periods based at the University so that you can develop your knowledge of the theory that you will apply in practice.\r\n\r\nOur aim is to develop inspirational and reflective teachers who learn their craft through supportive training opportunities.  For this reason, you will be guided, in school, by experienced mentors who engage in a training programme themselves so that they are better able to support you.","personalQualities":"We seek people who genuniely like, and believe in, children.  People who want the best for them, setting high expectations irrespective of their start in life.  People who are not afraid to make a change in themselves, and continue to learn, if that is what is needed to make things better for children.\r\n\r\nThank for considering InMAT Northamptonshire as a possible provider to help you to enter, what we believe to be, the most rewarding profession in the world.  We hope that you will join us, but wherever you train, we wish you every success for your bright future!","otherRequirements":"\r\n\r\nA DBS and Disqualification by Association and Prohibition checks will be undertaken.\r\n\r\nRelevant work experience with children will also be considered.\r\n\r\nA sense of humour is helpful.","status":2,"createdAt":"2021-07-06T10:53:02.243Z","canSponsorStudentVisa":"no","cycle":"2024"}
