{"id":"748699f5-be58-438f-9b41-c8d596e1db1c","name":"Primary","code":"K939","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"TA","fundingType":"apprenticeship","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"6f3522c9-36ef-449f-b4d6-91fc870ac066","name":"Plume Community Teaching Partnership","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"95a86878-fff5-4b62-ae22-50cba5e030ed","code":"1XB","name":"Plume Community Teaching Partnership"},"accreditedBody":{"id":"de0e702b-b19b-4594-b433-aa49be29f4d9","code":"H40","name":"Tes Institute"},"degreeGrade":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","aboutCourse":"The Postgraduate Teacher Apprenticeship leading to Qualified Teacher Status (QTS) is aimed at candidates who are already employed in a school.\r\nIt is a nationally recognised work-based route into teaching.\r\n\r\nWe work with TES Institute and your employing school to ensure you access your 20% off the job training as well as your in-school professional development.\r\n\r\nThe course is set over 4 academic terms.\r\n\r\nThe Apprentice will be assigned a school based mentor that will help guide you through the ITT Programme and meet with you regularly to discuss progress.\r\n\r\nThe Apprentice will also be assigned a pathway tutor who will provide regular feedback on your progress and coach and mentor you on subject knowledge and teaching-skill development.  They will also visit and support you in school and with your online work.\r\n","interviewProcess":"Interviews are currently taking place remotely, via Zoom.\r\nThis is followed by a face to face visit to Plume, Maldon's Community Academy to complete a Fundamental Mathematics and English assessment.","howSchoolPlacementsWork":"\r\nYour placement will be with your employing school for the majority of your apprenticeship.\r\n\r\nHowever, you will need to complete a minimum of 20 days at a contrasting placement during the training year and this will be arranged by Plume Partnership in one of our partnership schools.\r\n\r\nYou will also experience one day in a secondary school as part of your training.","status":1,"createdAt":"2021-11-22T16:02:36.429Z","updatedAt":"2021-12-03T10:58:25.457Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024"}
