{"id":"96e7c8c6-6a1b-484c-9952-15bb18e09cac","name":"Art and Design","code":"2F6W","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"d461a678-3335-4ca2-9616-1dc479d31a49","code":"W1","name":"Art and design"}],"locations":[{"id":"6f3522c9-36ef-449f-b4d6-91fc870ac066","name":"Plume Community Teaching Partnership","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"95a86878-fff5-4b62-ae22-50cba5e030ed","code":"1XB","name":"Plume Community Teaching Partnership"},"accreditedBody":{"id":"de0e702b-b19b-4594-b433-aa49be29f4d9","code":"H40","name":"Tes Institute"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Plume Community Teaching Partnership Institute can arrange equivalency tests for suitable applicants who are able to demonstrate a strong commitment and potential to teach.  Applicants should contact the partnership in advance of applying for further information.","courseLength":"OneYear","feesUK":9250,"feeDetails":"£8,625 QTS\r\n£9,250 QTS + PGCE","aboutCourse":"Candidates will be trained in schools which have finely developed systems in place to nurture development of the whole teacher and equip that trainee teacher with the skills required to meet the professional standards.\r\n\r\nEach successful candidate is placed in a school for the majority of the placement and the training will be provided by expert practitioners.  A dedicated Professional Studies programme takes place each week in the placement school.  In the spring term, there is a six-week second placement in a contrasting school setting usually one of the partnership schools.\r\n","interviewProcess":"Due to current COVID-19 circumstances we have had to make some changes to our interview process with the main difference being a virtual interview rather than face-to-face. Additionally there will be no lesson observation. \r\nWe would ask for you to deliver a short, five minute presentation for which you can provide a Powerpoint or other supportive resources if you would like to. This would then be followed by some questions that explore your desire and motivation for entering the teaching profession. \r\n\r\nWe may in the course of the year take the decision to return to face to face interviews and if we do candidates will be informed of  the interview process when they have been shortlisted.","howSchoolPlacementsWork":"Trainees spend the majority of their year in a single school, but also complete a six-week placement in a contrasting school in January and February. All schools that form part of the Plume Community Teaching Partnership are judged at least as ‘Good’ and are within a twenty minute drive of the Lead School, Plume Academy.\r\n\r\nThe Partnership offers ample opportunity for trainees to gain experience of 11-16 and 11-18 teaching. \r\n","personalQualities":"We are looking for innovative trainee teachers with a passion for working with children and a passion for their subject who will create in our pupils an appetite for learning, regardless of their ability.  This will usually be demonstrated by previous work experience in schools but might also encompass other settings where working with children from 11-18 has been a consistent aspect of the potential trainee's life.","otherRequirements":"","status":1,"createdAt":"2021-07-12T13:48:02.531Z","updatedAt":"2021-09-24T10:04:31.998Z","canSponsorStudentVisa":"no","cycle":"2024"}
