{"id":"91a361d3-0a02-492a-aa22-0c02cdf7a32f","name":"Modern Languages","code":"2G9S","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"4608e5e3-2a1a-48a1-8236-56c7af5a139d","code":"24","name":"Modern languages (other)"},{"id":"ce8523ef-9236-4cd9-b260-d826c7a521b3","code":"ML","name":"Modern Languages"}],"locations":[{"id":"56b2c54a-c520-411a-af25-d9ae15e678e6","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"51b38b3e-a028-41de-bafb-44037569e6ca","code":"12L","name":"Watford Grammar School for Girls"},"accreditedBody":{"id":"feecdec5-259c-45e3-b1cf-4e391936ee90","code":"H36","name":"University of Hertfordshire"},"profPost":"BO","degreeGrade":"1","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feeDetails":"See University of Hertfordshire","aboutCourse":"Spending four days a week in school and one day a week at the University of Hertfordshire this Masters level professional training programme introduces you to the requirements for teaching this subject to the 11-16 age range and leads to recommendation for Qualified Teacher Status. You will be introduced to the principles and theories of secondary teaching through both subject studies and a developing professional practice course. Training is undertaken in partnership with Hertfordshire University.\r\nThe programme is structured to allow you to develop the skills required by a teacher and to develop specific expertise for making a distinctive contribution to secondary practice.\r\nWe pride ourselves in providing a stimulating and supportive environment. We have a very effective partnership with the University at all levels. A wide range of teaching and learning methods are used. Tutor led sessions at University which will include lectures, seminars and workshops and where active participation is encouraged. In School trainees are supported by both a subject mentor and a professional mentor with weekly meetings to support the individual needs of the trainee. There are a wide range of opportunities for observation, training and complementary experiences within our consortium. You will be based for the majority of the time in a single, named school, but will also spend 6 weeks on a second placement to broaden school experience.\r\nRecommendation for QTS is based on continuing assessment of practice.\r\nFor information on aspects of the masters credits please consult the University of Hertfordshire website.\r\n\r\nThis differs from our other course in the subject by being unsalaried but awarding a PGCE in addition to QTS.\r\n","interviewProcess":"Applications will be invited to visit one of the schools in the consortium to discuss their application. Candidates will be observed teaching a short lesson.\r\nThere will be an interview in the placement school and a Panel interview held at the Lead school, this will include a written test and an examination of qualifications.\r\n","howSchoolPlacementsWork":"All of the schools in our consortium offer training in the 11-16 age range, but in addition can offer experience of sixth form work. Schools are selected according to location and capacity to train in a particular subject. We have 7 schools in the consortium and trainees will experience 2 placements. The majority of time in their named training school and 6 weeks in the second school placement.","status":1,"createdAt":"2021-07-06T10:56:24.538Z","updatedAt":"2021-09-16T13:56:36.490Z","canSponsorStudentVisa":"no","cycle":"2024"}
