{"id":"a459e4ab-e5c6-475a-bef7-21e28395a257","name":"Primary","code":"JK98","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"TA","fundingType":"apprenticeship","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"8c075815-121a-4e22-acfa-4afada98b180","name":"5 Wells Development Centre","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"3d2272b0-97ac-4128-873b-13e3ebaec6c3","code":"5J7","name":"Redwell Primary School"},"accreditedBody":{"id":"30bda414-7b00-426c-956b-18a187efe967","code":"L68","name":"London Metropolitan University"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"no","courseLength":"OneYear","feesUK":null,"aboutCourse":"Please note that Redwell Primary is the Lead School and NOT the placement school which will be your own school.  \r\n\r\nThe Postgraduate Teaching Apprenticeship is a nationally recognised, work-based route into teaching; an alternative to a traditional full-time university course, offering participants a postgraduate-level qualification, no tuition fees, and the opportunity to earn while they learn.\r\nOur apprentices achieve very highly: in it's first year of running, our trainees were all graded Outstanding in their teaching practice and almost all gained distinctions in the academic work. All have continued in employment in local schools. This exciting and challenging route is the perfect preparation for your teaching career. \r\n\r\nTraining will be mostly in your own school and you will undertake another placement in a contrasting setting and key stage, giving you a variety of hands-on experience. You will have 20% guaranteed off-the-job training, split between 'university' days and school-based training tasks.\r\n\r\nThis is a Level 6 (degree level) course leading to Qualified Teacher Status (QTS). Our apprentices also undertake a Level 7 (Master’s Level) PGCE. This structure gives you room to develop your classroom practice and to examine the underlying principles and values around education. This course has two modules designed to help you develop an understanding of your future role as a primary school teacher:\r\n\r\n•\tThe Curriculum Studies module introduces you to the issues of teaching within urban, multicultural and multilingual schools. You'll address the challenges of language, diversity and equality across the curriculum and learn how to teach core subjects including English, Mathematics and Science. \r\n\r\n•\tThe Professionalism and Inclusive Practice (PIP) module gives you an understanding of the broader contexts and a framework for meeting the needs of all the children you'll teach, linking to the United Nations Convention on the Rights of the Child (UNCRC), \r\n\r\nYou will be supported by your school-based mentor and university tutors. The latter will also lead your university sessions, ensuring there is continuity of support throughout your training. By working in both environments, you will reflect on the links between your own teaching theory and practice. \r\n\r\nLMU training is highly rated by Ofsted, who praised the 'inclusive, welcoming and open ethos and culture created by course leaders. Combined with the tailored and personalised support apprentices receive, which enables them to successfully complete their training and confidently go on to gain employment.' (Ofsted 2016)","interviewProcess":"Potential applicants are required to be employed as a full-time unqualified teacher (UQT) in their own school and paid according to the UQT scale at point 1 or higher. You may already be employed in the school in which you will train, or you may join the school deliberately because it is part of the Teacher Apprentice Scheme.\r\n\r\nOnce your application is received, we will confirm with your school that they are able to sponsor your journey.\r\n\r\nAll applications are handled by LMU. Once received, your application will be checked and assessed to confirm your suitability.\r\n\r\nShortlisted applicants will be invited to interview.\r\n \r\nOnce you're interviewed we will normally confirm the decision within one week. If you're offered a place we will additionally email you to confirm how to meet any conditions of your offer.\r\n\r\nIf you're unsuccessful at any stage the decision will be communicated to you. We do try to indicate the reason that we have not been able to you offer a place.\r\n\r\nIf you have any queries relating to your application you should contact the Admissions Office at London Metropolitan University.\r\n\r\nApplications close - July 2022.","howSchoolPlacementsWork":"Apprentices will work with a variety of year groups ranging from Reception to Year 6 during the programme.\r\n\r\nThe majority placement will be within the apprentice's own school with a 6 week element at another school in an alternative key stage (10 weeks for SEN Schools).\r\n\r\n* Schools are required to provide 20% non teaching time to include PPA and professional development.\r\n\r\n* 20 face to face sessions with a university quality assured trainer will be held at 5 Wells Development Centre, usually on alternate Thursdays.\r\n\r\n* Schools will be required to provide a mentor to support the apprentice for the duration of the programme.","personalQualities":"We are looking for dynamic, energetic, enthusiastic and caring apprentices. As a teacher you will need to be passionate and enthusiastic about your work and your specialism. You will have a desire to share this and make a real difference to young people's lives and futures. Ideally, you:\r\n\r\n•\tare able to express why you want to teach.\r\n•\thave visited a local school in order to observe and gain experience of how teaching and learning is organised.\r\n•\thave participated on the School Experience Programme.\r\n•\tcan discuss current educational thinking e.g. The Times Educational Supplement.\r\n","otherRequirements":"Interviews will include a series of tasks assessing your ability and appropriateness for the course, including a presentation to other applicants, an individual interview and a series of online and hand-written tasks. Apprentices are subject to enhanced DBS checks and required to make a declaration about any criminal convictions.\r\n\r\nIf you receive an offer, you will need to produce originals of documents, qualification certificates etc. before you are enrol on the course. If you do not have original certificates, you should apply immediately for replacements. This is a time-consuming process and could prevent you from joining the programme.","status":1,"createdAt":"2021-07-12T13:49:32.785Z","updatedAt":"2021-09-15T11:37:55.108Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024"}
