{"id":"7c4f464d-6ecd-468a-9da8-d8e7b53a0210","name":"Modern Languages","code":"L709","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"fbb00c08-2dbc-4f26-adb3-3b23afba18c1","code":"17","name":"German"},{"id":"ce8523ef-9236-4cd9-b260-d826c7a521b3","code":"ML","name":"Modern Languages"},{"id":"a9a2321a-fe0e-49fd-96b0-304880d1eed2","code":"16","name":"English as a second or other language"},{"id":"5e94c647-7b7e-4d02-a3b4-7667296fbf0a","code":"18","name":"Italian"},{"id":"e34fd2a3-a32e-44e9-aea1-666badf3ac03","code":"22","name":"Spanish"},{"id":"440c1e5c-0a7b-49ae-9534-184528468511","code":"20","name":"Mandarin"},{"id":"9727f674-61ba-4efa-b1f2-21ec7e354442","code":"15","name":"French"}],"locations":[{"id":"27b15376-b917-4b68-81d7-213dbae83329","name":"Bolton","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"19d8dbd6-01c5-41e8-befb-b477b26de3c8","code":"8N5","name":"University of Bolton"},"profPost":"PG","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"If this is not in a subject aligned to the course then you may be required to complete a Subject Knowledge Enhancement Programme (SKE) to ensure you meet the minimum subject expertise to begin your Initial Teacher Training. A further skills audit will identify subject specialist skills and will inform your action plan for your training programme.","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"This Secondary (11-16) PGCE with QTS will support you to gain the skills and knowledge needed to teach modern foreign languages in the secondary sector and inspire the next generation of young people. Combining university and school-based experience with expert tuition from our experienced educationalists, this ITT course aims to ensure you can learn what it takes to teach. \r\n\r\nThis master's level Initial Teacher Training (ITT) programme offers you a range of experience in secondary schools. You will gain knowledge of diverse socio-economic settings and students with different needs and abilities. Your subject-specialist mentor will support you throughout your training, and university tutors will help you develop research-informed approaches to teaching in secondary schools. Our bespoke Subject Specialist Studies (SSS) programme will focus on building your knowledge of the MFL national curriculum and support your teaching during your placements.\r\n\r\nCourse Highlights:\r\nThis programme offers you the opportunity to gain a PGCE (Secondary 11-16) MFL and Qualified Teacher Status.\r\nSchool-based-experience is a core component of this course and you will undertake at least two teaching placements, totalling a minimum of 120 days’ experience in local secondary schools.\r\nOur highly qualified and dedicated Education team offer a wealth of experience of teaching in the secondary sector.\r\nOur Subject Specialist Studies (SSS) enhanced learning programme offers you the chance to explore and develop your skills in teaching MFL and is aligned to the national curriculum.\r\n\r\nKey Features:\r\nThis is a pre-service Initial Teacher Training course – you do not need prior experience of teaching or current employment in education.\r\nThe University of Bolton is one of the largest providers of teacher training for further and higher education in the UK, sitting at the heart of an extensive network of educational partners.\r\nDuring the course, you will have the opportunity to gain diverse placement experiences in other institutions to enhance your professional development.","interviewProcess":"After you have applied you will be invited in to a Fundamental English and Maths Initial Assessment. Once you have successfully passed the initial assessments, you will be invited to a Selection day interview which will take place at a Teach Lead Bolton Consortium school. \r\nThe Selection day will consist of a formal interview, a group collaboration task, and you will be required to prepare a 5 minute presentation to share with the panel. \r\nThe Selection Day panel will consist of 2 or 3 colleagues from the University of Bolton and Teach Lead Bolton Consortium schools.\r\n","howSchoolPlacementsWork":"You will have 2 main school placements: School Experience A and School Experience B.   There will also be the opportunity for you to complete a spring-term Diverse Placement in a local school in a different sector, for example a SEN/D placement, 6th form, or primary setting, to enable you to experience a diverse range of sector experience to enhance your professional development. \r\n\r\nPlacement schools will predominantly be in the Bolton area, and will be selected for you with input from both your personal preference and local school requirements. ","personalQualities":"We are looking for enthusiastic and motivated candidates that have a  passion for teaching, and a passion for their specialist subject. \r\n\r\nWhilst there is no requirement for you to have any experience of teaching, you are expected to have some knowledge of the secondary sector and be able to express why you wish to train to teach. ","otherRequirements":"This course involves working unsupervised with children and/or vulnerable young people and adults and you must gain an Enhanced Disclosure certificate from the Disclosure and Barring Service (DBS) before starting your studies. Charges are payable to cover the cost of the DBS Enhanced Disclosure application and annual registration with the online Update Service.","status":1,"createdAt":"2021-07-06T10:46:46.125Z","updatedAt":"2021-10-12T09:51:12.114Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
