{"id":"c7cab1d4-e50b-4644-9977-104ddc831eb7","name":"Biology","code":"25DH","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"322cfc19-d51d-45db-91e3-bd7b4738470f","code":"C1","name":"Biology"}],"locations":[{"id":"4f33d26a-460a-4493-b28b-3d6ef35c627b","name":"Handsworth Grange Community Sports College","isPublished":"Y","status":"R","vacancies":"F"},{"id":"b2ec64ca-aec2-46f6-81ac-05d7258b6a03","name":"Westfield School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"234b7f20-2882-4f74-a2c6-c8a53a444d7d","name":"Sheffield","isPublished":"Y","status":"R","vacancies":"F"},{"id":"3de29c15-7b58-4b83-9b5d-e253d1b48bbf","name":"Silverdale School (Lead School)","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"bf021103-5dc6-4332-b557-32d1c883d6e8","code":"1N5","name":"Chorus Education Trust and Sheffield Teacher Training Alliance"},"accreditedBody":{"id":"899178cc-20a7-4df5-951a-ee83c1b3d4d1","code":"S21","name":"Sheffield Hallam University"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"If English is not your first language, you must have an IELTS score of 7.0 with a minimum of 6.5 in all skills or equivalent.","courseLength":"OneYear","feesUK":9250,"financialSupport":"You may be eligible for a loan to cover your fees from Student Finance England while you study.  The application can be completed online [here]( https://www.gov.uk/teacher-training-funding) and will include a full assessment of your eligibility.  If you’re from outside the UK, you may still be eligible for financial support, find out [here](https://getintoteaching.education.gov.uk/explore-my-options/overseas-graduates).","aboutCourse":" The Sheffield Teacher Training Alliance (STTA) was founded in 2012 and has, at its heart, outstanding schools and outstanding teaching. As one of the first teaching schools, STTA has honed best practice from our partner schools and provides an outstanding programme of teacher development for new teachers which combines the latest education theory with sustained, focused classroom led practice.\r\nYour journey will be led by outstanding practitioners who teach children every day and by experienced academics who are at the cutting edge of educational research. Year on year, our trainees achieve the very best provision and support and are amongst the highest performing in the city. \r\nWe collaborate with all our educational partners and are proud of our close partnership with Sheffield Hallam University and the University of Sheffield ensuring you receive excellent support and provision from both an academic and practical stance.\r\n \r\nYou will have the best start to your teaching career with Sheffield Teacher Training Alliance and be one of the high number of trainees to gain employment within the Alliance and the region. \r\n\r\nWhen you join our course, you join a supportive family of educators, dedicated to giving our young people the very best provision and life chances we can. \r\n\r\n","interviewProcess":"Our interview process is designed to bring out the best in our future colleagues and allow us to assess your potential to be a great teacher.  On the day, we ask you to prepare a short teaching task on a topic related to your subject specialism, take part in a discussion with our panel and complete some written work. Full details about the process will be communicated prior to your interview.  We contact all our successful applicants quickly to make conditional offers. Once you have accepted our offer, we have a full programme of support to guide you towards your first day in school. Come and join a fantastic teacher training alliance with an outstanding track record.\r\n","howSchoolPlacementsWork":"As a trainee teacher, you will teach children in two contrasting school settings, this is part of DfE regulations for Initial Teacher Training but one we have always felt is important as it is the perfect introduction to our profession and its varying needs.\r\nOur job is to place you in two schools in our network of over 70 schools.  The DfE ‘Find Postgraduate Teaching Training’ only allows us to list some of our schools as training locations so we have selected schools which show you the breadth of our network. Please select one of these locations but remember there are many other schools not on this list.  We will do our best to place you in a school of your choice but can’t guarantee you will receive your first choice.  Please discuss your preference with us at interview so we can assess your needs and how these can be met by our schools.\r\n","personalQualities":"We are looking for people who have a passion for your subject and an understanding of the educational context in England. We also welcome applications that can demonstrate resilience, enthusiasm, and the ability to reflect.  We expect you to be aware of the professionalism required to teach and demonstrate your empathy and understanding when considering child development. Your application should also detail any experience you have gained in an educational setting.","otherRequirements":"You will be required to complete a declaration of criminal convictions and health check forms.  \r\n\r\n","status":1,"createdAt":"2021-07-06T10:50:31.392Z","updatedAt":"2021-10-04T12:43:32.166Z","canSponsorStudentVisa":"no","cycle":"2024"}
