{"id":"284dee0a-2cd5-4631-8c12-144401510c59","name":"Design and Technology (Food)","code":"3FBK","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"P","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"118fabd7-86d0-4a40-9e9a-e5c302abe59b","code":"DT","name":"Design and technology"}],"locations":[{"id":"4096d47c-db26-4c17-9ad4-a32f4e2b81ca","name":"Main Site","isPublished":"N","status":"N","vacancies":"P"}],"trainingProvider":{"id":"cc6609d9-1db9-4a79-bb76-a1f1471a7f1d","code":"1L7","name":"The Northworthy Alliance"},"accreditedBody":{"id":"aa023df3-b71e-4249-b9c4-41fca8bd135e","code":"D39","name":"University of Derby"},"profPost":"PG","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"TwoYears","feesUK":9250,"feeDetails":"Studying for a postgraduate qualification is a good investment in your future, but you need to carefully consider how you’re going to pay for your course and your living costs.\r\nMost students will be able to apply for loans and depending on where you live and your circumstances, bursaries and scholarships might also be available.\r\n\r\nOur postgraduate courses are competitively priced and all the essential equipment and activities are included.\r\nThey vary slightly from course to course depending on what facilities and resources are required. For example, online courses tend to be slightly cheaper because they use fewer facilities.\r\n\r\nThe most up-to-date fees will be listed on the course page – search for your course on our website and look for the section on fees.\r\n\r\nThe fees are slightly different depending on whether you normally live in the UK/EU or outside of the EU.\r\n","financialSupport":"To pay for your tuition fees and living costs, you may be able to take out a student loan. These loans don’t usually need to be paid back until you have graduated and are earning a good salary.\r\n\r\nSometimes, bursaries and scholarships are also available - it depends on your circumstances and which country you usually live in. These don’t need to be paid back.\r\n\r\nPlease visit our website for more information or call our helpline on 01332 592000. \r\n","aboutCourse":"From the beginning of the academic year, you will be a full member of the department in your school and engage in all areas of school and department life.\r\n\r\nYou will be based in your school 2 days a week where you will gradually build up your teaching time, observe examples of best practice, participate in tutor group activities and wider professional development.  You will have a dedicated mentor who will meet with you formally  fortnightly to discuss your progress and help you succeed.\r\n\r\nThere will be dedicated professional development sessions delivered at both the University of Derby and at our hub base at The Long Eaton School.\r\n\r\nThe university sessions will predominantly focus on the Masters level modules and assessment for the PGCE element.  The hub sessions have a strong focus on classroom based teaching and learning with lots of practical ideas for you to take away and use.\r\n\r\nYou will also have subject based sessions with other trainees in your subject area within the alliance.  These are led by an experienced practising classroom teacher to explore the best teaching and learning approaches in your subject.","interviewProcess":"We have a thorough interview process to ensure that we are matching potential trainees to the right schools and departments. \r\n\r\nOur interviews involve:\r\n\r\n* tour of the school\r\n* a short teaching task\r\n* numeracy and literacy assessments\r\n* and a formal interview with a 5 minute presentation\r\n\r\nFull details are provided prior to the interview.\r\n\r\nGetting to know trainees background and prior experience has ensured that our placements are successful with 100% retention and completion rates.\r\n","howSchoolPlacementsWork":"All trainees are allocated a main placement school which they are based in during the first year of training.  During the second year trainees have a second placement school where they develop their skills in an alternative context.\r\n\r\nThere are also opportunities during this term to pursue areas of personal interest such as SEND, Overseas visits, Primary and Alternative Provision.\r\n\r\nThroughout your placement, you will have a dedicated mentor who will support you and work closely with our Alliance team.\r\n\r\nInformation regarding all of our placement schools is available on our website: [Alliance Schools](http://www.northworthytrust.org.uk/teacher-training/alliance-schools)\r\n\r\nWe will consider specific requests made by you but may not be able to guarantee your first choice of placement school.  Reasonable consideration will be given for travel and personal circumstances.","personalQualities":"We are looking for ambitious trainee teachers who are passionate and enthusiastic about their subject and have a desire to share that with young people of all abilities in the secondary age range.\r\n\r\nTeaching is a very rewarding but demanding job and as such we are looking for trainees who are resilient, committed, reflective and prepared to embrace all aspects of school life.","otherRequirements":"School Experience is desirable.\r\n\r\nYou must pass enhanced DBS check prior to starting the course.  This is completed after an offer has been accepted.\r\n\r\nTrainees completing an Initial Teacher Training Programme must demonstrate the required competencies in Fundamentals of English and Maths outlined by the Department for Education before QTS is awarded. \r\nTo ensure trainees meet the required competencies you will be required to undertake and pass the University’s agreed assessment when you commence your course. Full details of the required assessment will be provided in due course.   Please note it is the trainee’s responsibility to secure these fundamental skills.","status":2,"createdAt":"2021-07-06T10:48:55.722Z","canSponsorStudentVisa":"yes","cycle":"2024"}
