{"id":"fc2ebac6-6b62-4008-9ac5-5fe68c30db13","name":"Physical Education","code":"2C37","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"13_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"74d64a54-5e34-4590-b6c7-528dd0cf26fe","code":"C6","name":"Physical education"}],"locations":[{"id":"f0aa5873-d227-4622-a6d6-1a32eaea9c5f","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"f6a7120c-ffbb-4f8c-ae14-d9b3cd3ee59f","code":"14K","name":"Biddulph High School"},"accreditedBody":{"id":"0a682589-92ed-447b-b564-6958b3b02b41","code":"S72","name":"Staffordshire University"},"profPost":"BO","degreeGrade":"1","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"After an Induction Programme at the university, you will be in school on two block placements to gain a supported understanding of the role of the teacher. Within a school, you will receive expert support from a subject or class mentor who will hold weekly meetings with you to help you to prepare, teach and review lessons and develop your subject knowledge. Each school or college will have a professional mentor who will help you to understand the organisation of the school, pastoral care systems and the legal and social framework of school including supporting services. Associate Teachers have a phased introduction to teaching that will reflect your personal needs. Initially you will observe the regular teacher, help with group work and then move towards sharing classes with the teacher before eventually taking classes yourself. As well as teaching your subject, you will be required to contribute generally to the life of the school. The University element of the course is designed to engage Associate Teachers in critical reflection on the nature of education. Group and individual tutorials in the university will give you an opportunity to discuss your ideas and the challenges you may face.","howSchoolPlacementsWork":"The school experience is based in local, carefully selected partnership schools. \r\n*You will complete 2 placements, covering the age range 11-18.\r\n*The first placement will run from September to the end of January and the second from February to mid-June.","status":1,"createdAt":"2021-07-06T10:53:46.205Z","updatedAt":"2021-08-10T09:53:31.571Z","canSponsorStudentVisa":"yes","cycle":"2024"}
