{"id":"0e700418-38e3-4050-bcd2-d79b08d14458","name":"Primary","code":"D918","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"dd5db3fb-6739-4352-8836-89b4f5f5c25d","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"62e4cde1-8489-4194-b004-e2d7e0d874eb","code":"2KD","name":"Swindon Teacher Training Partnership"},"accreditedBody":{"id":"da8e5252-e14a-470a-8247-00b835a79010","code":"B80","name":"University of the West of England, Bristol"},"profPost":"PG","degreeGrade":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"This one-year postgraduate course prepares you to take your place in primary schools as generalist teachers of children aged 5 -11 years. \r\nYou will join your placement school at the start of term so you can observe, first hand, experienced teachers as they go through the process of building rapport and routines with new classes.\r\nThe first few weeks of your placement will be focused on induction and you will:\r\n\r\n* Be assigned a mentor.\r\n* Attend professional development sessions both within the partnership and at UWE that will introduce such topics as ‘behaviour management’ and ‘lesson planning’.  When in UWE you will be working with research-active academic staff to understand the pedagogic underpinning of teaching early years and primary aged children. You graduate with 60 Masters level credits following successful completion of the course.\r\n* Be given reading time to help you to understand school policy and subject specific schemes of work.\r\n\r\nIn your first two terms, you will be looking to build up to around ten hours of teaching a week. As your confidence grows this will increase to fifteen hours of teaching. \r\n\r\nAt the STTP we have the flexibility to tailor our training to suit your individual needs, you can be reassured that teaching time will be allocated to you at a pace that you feel comfortable with.\r\nYou will have two placements within the partnership which will add breadth to your experience and allow you to see how different schools operate.\r\n","interviewProcess":"Interviews will be carried out via Microsoft TEAMS throughout the year as long as places remain available.\r\nSuccessful applicants will be asked in advance to prepare a five minute presentation outlining their motivation for primary teaching and to plan a lesson to meet specific learning objectives. The interview will begin with the presentation and the applicant will have the opportunity to talk through the process of planning the lesson.\r\nThe interview is a good opportunity for you to reflect on any recent classroom experience that you have had. This may be part of an employed role that you have had or observations that you have carried out as part of your research into a teaching career. Please contact us if you would like to visit a school before submitting your application,\r\nAny offers made by the STTP are conditional on:\r\n\r\n* A DBS check and satisfactory checks to cover any time spent overseas.\r\n* Provision of original documentary evidence of degree and GCSE qualifications.\r\n","howSchoolPlacementsWork":"You will complete two placements.  The most likely pattern is that placement one will run from the start of term in September to the February half term. Your second placement will then run to the end of the course. If we feel for any reason that a trainee would benefit from a different pattern of placements then we would have the flexibility to consider that.","personalQualities":"The most effective teachers are reflective. They consistently and critically review their practice to identify areas of strength and to develop strategies that will help to deliver greater pupil progress. The ability to self-reflect and to put into practice feedback from your mentor will be essential. You will also need to show resilience, positivity and strong organisational and time management skills throughout this challenging and rewarding training year.","otherRequirements":"It will be beneficial to you if you can discuss at interview some recent experience that you have of being in a school. If you would like some help in organising this, please contact the partnership and we can arrange for you to spend some time in schools across the partnership at a time which is convenient for you.\r\nOffers of a place on the STTP are conditional on a satisfactory DBS criminal records check.\r\n","status":1,"createdAt":"2021-11-23T21:19:07.010Z","updatedAt":"2021-11-23T21:26:59.980Z","canSponsorStudentVisa":"yes","cycle":"2024"}
