{"id":"4eb6d320-36a4-420b-96cb-e4c56c66c8d8","name":"Art and Design","code":"3B36","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"d461a678-3335-4ca2-9616-1dc479d31a49","code":"W1","name":"Art and design"}],"locations":[{"id":"84218477-9b5a-476e-aad0-51ffa51c4acd","name":"Commonweal School","isPublished":"Y","status":"R"},{"id":"06bc42fb-5d1b-4d9c-8b93-bcc4ed1161d7","name":"St Joseph s Catholic College","isPublished":"Y","status":"R"},{"id":"0015954d-36be-425d-9d41-acaf339bd2c7","name":"Lydiard Park Academy","isPublished":"Y","status":"R"},{"id":"43c9cf83-1fa4-4a2f-b94a-c264dc0b22b9","name":"Highworth Warneford School","isPublished":"Y","status":"R"},{"id":"58a24935-20bf-404d-ace2-19487d78849f","name":"Abbey Park School","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"62e4cde1-8489-4194-b004-e2d7e0d874eb","code":"2KD","name":"Swindon Teacher Training Partnership"},"accreditedBody":{"id":"da8e5252-e14a-470a-8247-00b835a79010","code":"B80","name":"University of the West of England, Bristol"},"profPost":"BO","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"A degree with at least 50% of content related to  your teaching specialism.  In order to access any bursaries, the degree needs to be 2:2 or above.  \n\nStrong candidates that show at interview that they have outstanding qualities may be considered with less than 50% related content and offered to attend a subject knowledge enhancement course.","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"If your qualifications are from overseas, you will need to demonstrate their equivalence or you may need to sit equivalency tests.  Visit [Naric](https://www.naric.org.uk/naric/) or [equivalency testing](https://www.equivalencytesting.com/) for more information.","courseLength":"OneYear","feesUK":9250,"feeDetails":"Please note that fees are subject to final confirmation from The University of the West of England.  You may be eligible for help with your tuition costs[Teacher training funding](https://www.gov.uk/teacher-training-funding)","aboutCourse":"The duration of the course is one academic year. You will join your placement school at the start of term so you can observe, first hand, experienced teachers as they go through the process of building rapport and routines with new classes. \r\n\r\nThe first few weeks of your placement will be focused on induction and you will:\r\n\r\n* Be assigned a mentor from within your department. \r\n* Observe experienced teachers as they build relationships with new tutor groups and teaching classes. \r\n* Be attached to a tutor group. \r\n* Carry out a 'pupil pursuit' whereby you will follow the timetable of one student for one day. \r\n* Attend professional development sessions both within the partnership and at UWE that will introduce such topics as 'behaviour management' and 'lesson planning'. \r\n* Be given reading time to help you to understand school policy and subject specific schemes of work. \r\n\r\n\r\nAs you begin to settle into school life, you will begin to follow your own timetable.  In your first two terms, you will be looking to build up to around ten hours of teaching a week.  As your confidence grows this will increase to fifteen hours of teaching.  At the STTP we have the flexibility to tailor our training to suit your individual needs, you can be reassured that classes will be allocated to you at a pace that you feel comfortable with.  \r\n\r\nYou will have two placements within the partnership which will add breadth to your experience and allow you to see how different schools operate. ","interviewProcess":"Interviews will be carried out throughout the year as long as places remain available. Successful applicants will be asked in advance to prepare a ten minute teaching activity related to their subject that will be presented on the day.  There will also be a formal interview with the professional tutor and a member of the leadership team.\r\n\r\nThe interview is a good opportunity for you to reflect on any recent classroom experience that you have had. This may be part of an employed role that you have had or observations that you have carried out as part of your research into a teaching career.\r\n\r\nAny offers made by the STTP are conditional on: \r\n* A DBS check and satisfactory checks to cover any time spent overseas.\r\n* Provision of original documentary evidence of degree and GCSE qualifications.  \r\n\r\nIn some cases, it may be necessary for you to complete a subject knowledge enhancement course (SKE) before your training begins, this can be discussed at interview.","howSchoolPlacementsWork":"You will complete two placements within the 5 schools that make up the partnership.  The most likely pattern is that placement one will run from the start of term in September to the February half term.  Your second placement will then run to the end of the course.  If we feel for any reason that a trainee would benefit from a different pattern of placements then we would have the flexibility to consider that.  ","personalQualities":"The most effective teachers are reflective. They consistently and critically review their practice to identify areas of strength and to develop strategies that will help to deliver greater pupil progress.  The ability to self-reflect and to put into practice feedback from your mentor will be essential.  You will also need to show resilience, positivity and strong organisational and time management skills throughout this challenging and rewarding training year.","otherRequirements":"It will be beneficial to you if you can discuss at interview some recent experience that you have of being in a school.  If you would like some help in organising this, please contact the partnership and we can arrange for you to spend some time in schools across the partnership at a time which is convenient for you.\r\n\r\nOffers of a place on the STTP are conditional on a satisfactory DBS criminal records check. ","status":1,"createdAt":"2021-07-06T10:51:16.083Z","updatedAt":"2021-09-23T09:25:30.882Z","canSponsorStudentVisa":"yes","cycle":"2024"}
