{"id":"79dfe42b-ec0d-43d6-b447-cd49acf7d13b","name":"Primary","code":"3DZT","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_7","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"0f48efc4-c916-4df6-a86d-fdd15d1105da","name":"St Paul's Nursery School","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"30330059-c616-423e-9e2d-ef07d44e1724","code":"1LF","name":"Bristol Early Years Teaching Consortium"},"accreditedBody":{"id":"e1473ef6-b29f-4e0b-adff-558ab367008a","code":"2AV","name":"Cabot Learning Federation SCITT"},"profPost":"BO","english":"3","maths":"3","science":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"financialSupport":"You can apply for student finance in the usual way.","aboutCourse":"Teaching in the Early Years is complex as young children need experiences and provision that support their development as well as their learning. In order for you to build your skills, approaches and knowledge we have created a unique and exciting Initial Teacher Training Course that will provide a solid foundation for teaching in the EYFS or Primary age range.\r\n\r\nYou will learn about:\r\nInclusion, child development, the philosophy and principles of early years pedagogy, the role of the adult, quality interactions, the theory of learning and teaching, approaches to planning and assessment including high quality observations and ethical assessment and teaching a range of curriculum subjects.\r\nUnderpinning all our work is our commitment to:\r\n* The rights of the child and child-centred learning \r\n* Professional learning, embedded in research and based on reciprocity\r\n* Developing a democratic community that is reflective, self-evaluative, emotionally intelligent and resilient, fostering pride and purpose\r\n* Pushing the boundaries, making opportunities and being innovative \r\n* Building a cultural community in which all learners can and do thrive\r\n* Reducing inequality in educational achievement and life chances.\r\n\r\nOur course offers:\r\n\r\n * Centre-based training days with us at BEYTSA and at the CLF Institute. You will be learning in collaboration with Early Years, Primary and Secondary trainees as well as learning as a smaller Early Years BEYTSA group. \r\nThe training is led by a range of experts from Bristol who have up to date knowledge and expertise in their specialism. We will engage in professional learning conversations, learn from experts and from each other. The course is a blended approach comprising of face to face days, high quality virtual learning and professional learning networks. \r\n\r\n* A BEYTSA Professional Tutor is there to support your emotional well-being as well as monitor and review your progress.  To carry out regular meetings with you to guide reflection, develop thinking around teaching and learning themes and monitor progress against targets.  \r\n\r\n* School-based training – you will spend the majority of the year in a host school with a class based Mentor.\r\n\r\n*  Host schools based in Bristol which are culturally diverse, inspiring, supportive and are all committed to providing the best outcomes for our children and families. \r\n\r\n* Directed study, self-directed study, reading and research for you to engage in throughout the course to enable you to deepen your subject knowledge. There are two UWE assignments for you to complete. \r\n","interviewProcess":"\r\nThe interview will take place online until restrictions are lifted.\r\nThe panel will include the BEYTSA Programme Lead and a member of the Teaching School. There will be one interview for 2 hours. \r\nThe process is designed to enable you to demonstrate your potential to teach, share your values about teaching in early years and about you as a learner. It is an opportunity for you to shine, tell us about yourself and your passion for teaching. \r\n\r\nYou will be required to:\r\n\r\nPlan and tell a story. You will be assessed on your:\r\n* choice of story - relevance for young children\r\n* quality of preparation and resources\r\n* presence – use of voice, gesture, emotional connection\r\n* story telling skills.\r\n\r\nPrepare a presentation. You will be assessed on your:\r\n* values and ethos\r\n* communication skills\r\n* understanding of teaching and learning\r\n* presentation skills (engagement of audience organisation, effective use of resources, structure and pace)\r\n* willingness to reflect on your experience and relate this to your potential as a teacher. \r\n\r\nEngage in a discussion based on an article. You will be assessed on your:\r\n* communication skills and how you interact within a group\r\n* research skills and how you use reading to inform your subject knowledge\r\n* ability to interpret and analyse information \r\n* ability to take on the viewpoints of others and through exchange further develop your own thinking ability to think critically.\r\n\r\nAt present there is are no tests for you to complete. \r\n\r\n","howSchoolPlacementsWork":"\r\nBristol is an exciting, creative and diverse city to study in. Our partner schools are all situated in Bristol and the surrounding area, offering opportunities for you to learn in rich and culturally diverse environments and teaching children from a range of backgrounds with a range of needs.\r\n\r\nYou will learn teaching strategies to close the attainment gap for our children including those with English as an additional language (EAL) and children with Special Educational needs and disabilities (SEND). You will learn to challenge all learners and ensure all fulfil their potential and capabilities. \r\n\r\nWe have strong partnerships with our schools. They consist of Nursery Schools, Infant and Primary Schools and Academies.\r\n\r\nDuring the year’s training you will have two placements. Most of the year will be spent in your home school, with nine weeks in the alternate key stage. \r\nOver the year you will teach in the Early Years Foundation Stage (EYFS) \r\n3 - 5 year olds and Key Stage 1 (KS1) 5-7 year olds.\r\nTo begin with you will be in school for a minimum of three days a week which increases over the year five days, enabling you to become more involved in the life of the school.\r\n\r\nYou will have a school-based mentor – the class teacher, who is there alongside you to develop your expertise as a teacher. They will model best practise, make learning explicit, be a supportive guide and encourage you to take risks in order for you to progress, be courageous and learn new skills. \r\n\r\nYour mentor with facilitate professional dialogue, nurture creativity and innovation, encourage self-reflection, celebrate your strengths and identify areas to develop through supportive, constructive feedback and target setting. \r\n\r\nWe are committed to inclusion and take into consideration many factors when organising your school placements including; distance from home to school, access to transport, preferred key stage where possible, ethos of individual schools, individual family circumstances, disability and additional learning needs. The PGCE route is an intense year so we are committed to accommodating your needs as much as we can to ease unnecessary challenges.\r\n","personalQualities":"We are looking for people who have genuine passion and commitment for teaching in the Early Years; who want to work alongside our youngest, most fascinating, capable learners who require inspiring, interested and creative adults.\r\nAre you:\r\n*  values driven with a strong morale purpose? \r\n* committed to providing the best outcomes for children?\r\n* open minded and happy to be challenged in your thinking?\r\n* able to take responsibility for your personal and professional development?\r\n* able to reflect on and respond to feedback?\r\n* motivated and resilient with self-belief?\r\n* an effective communicator who thrives learning with others?\r\n\r\n\r\n\r\n","otherRequirements":"All applicants will need a enhanced Disqualification and Barring Service (DBS) before commencing the course and prohibition checks and appropriate ID will be required for this. \r\nYou will be required to provide a full employment history and references supporting your suitability into teaching in line with the Keeping Children Safe in Education requirements.\r\nYou will be required to complete an occupation health self-declaration about your fitness and wellness to teach. \r\nEvidence of at least two weeks experience of working with young children, for example; forest school, voluntary work in schools/ playgroups, after school. \r\n\r\n","status":2,"createdAt":"2021-07-06T10:48:48.729Z","canSponsorStudentVisa":"no","cycle":"2024"}
