{"id":"6ebc572d-fbc3-411b-a9c4-29458bf82f26","name":"English","code":"2CX6","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3aed1aa8-ae46-4b68-92bb-a6cc20655c59","code":"Q3","name":"English"}],"locations":[{"id":"30103be3-7204-4234-bc24-9b1e9281deea","name":"The Bedfordshire Schools Training Partnership","isPublished":"N","status":"N","vacancies":"F"},{"id":"3439962d-e65f-466c-96b0-96fe597c0a29","name":"Main Site","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"ff146457-094d-4fc8-a4fd-1d6aecc71d72","code":"1T2","name":"INSPIRIT, St Thomas More TSA, Bedford"},"accreditedBody":{"id":"d1392666-2454-4973-8848-d743beecfc33","code":"B31","name":"The Bedfordshire Schools Training Partnership"},"degreeGrade":"2","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"We would ideally like candidates to have at least 50% relevancy within their degree to the subject that they wish to apply for. We will however, consider this on a case by case basis.","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We will prioritise candidates who already have their GCSE English & Maths at a grade C/4 or above - but we will accept Equivalency Tests from the following Providers:\n\nEquivalency Testing \nA Star Equivalency \nBirmingham City University\n\n\nApplicants with qualifications from overseas must have a Statement of Comparability from UK ENIC/ NARIC for the purposes of their GCSEs and degree qualifications.","courseLength":"OneYear","aboutCourse":"The School Direct Salaried training course operates over one school academic year and is a full time programme. This course is offered through the Lead Schools of St Thomas More Catholic Teaching School, Bedford and Robert Bloomfield Academy Shefford.\r\n\r\nAs a Salaried School Direct applicant, you will be employed and paid on the bottom of the unqualified teacher scale by your placement school for the duration of your training placement.There are no tuition fees attached to this course and upon successful completion of the training programme, applicants will receive the award of QTS. There is also the option for suitably qualified applicants to add on the award of PGCE at an additional cost\r\n\r\nDuring the training year, applicants will be allocated a subject specialist mentor to oversee their training and development in both their main school placement and also in their six week complementary placement.\r\nAs a Salaried School Direct trainee, it will be necessary to fulfil both the academic requirements of the course and the contractual obligations of working as an unqualified teacher. Therefore, in addition to the commitment of a  teaching timetable from the outset - applicants will also be required to attend the twice weekly taught course sessions which underpin the practical, school based element of the training. These are the Professional Studies course which aims to connect theory and practice and addresses the Standards for QTS and will involve assessment via the successful of completion of  assignments. Additionally, all trainees will attend the Subject Application course which will be delivered by the Subject Leaders as a small group subject based tutorial programme - addressing the required subject knowledge for teaching.\r\n\r\n\r\n","interviewProcess":"Applications received by The Bedfordshire Schools' Training Partnership are subject to initial shortlisting by the relevant Subject Leader. Shortlisted candidates are then invited to attend an interview which consists of two subject knowledge based tasks (one written), a practical classroom focussed exercise as well as basic literacy & numeracy testing. Successful candidates are then informed of the outcome within two working days of the interview date.\r\nWhere the application is for a Schools Direct Salaried training place - applicants will be required to attend a second interview with their placement school\r\n","howSchoolPlacementsWork":"For the Salaried School Direct programme - school placements are allocated in line with local need and where a training vacancy exists within one of our Partnership schools.\r\nAs part of the training programme, all applicants will have two school placements which will enable them to teach across two consecutive age ranges focusing on KS3 & 4.These will take the form of a main school placement in a Secondary or Upper school and a shorter complementary placement.\r\nDuring the training year, applicants will be allocated a subject specialist mentor within the appropriate age phase to oversee their training and development in both their main school placement and also in their six week second placement.\r\n","personalQualities":"We welcome applications from all suitably qualified applicants. We would encourage applicants to familarise themselves with the Teacher Standards and the relevant Secondary GCSE curriculum - as well as the current issues effecting education and schools. As Salaried applicants are required to deliver a teaching timetable from the outset - it would be helpful if they have had some previous relevant experience - although this is a recommendation and not an entry requirement.   Additionally, you should be able to demonstrate an enthusiasm and genuine interest in and understanding of young people and the teaching profession.","otherRequirements":" In line with current safeguarding practice,  we (or the employing school) will carry out a number of pre-employment checks, including taking up references and a DBS Clearance check for all trainees prior to the start of the course.","status":2,"createdAt":"2021-07-06T10:56:36.615Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"As a Salaried School Direct applicant, you will be employed and paid on the bottom of the unqualified teacher scale by your placement school for the duration of your training placement.There are no tuition fees attached to this course and upon successful completion of the training programme, applicants will receive the award of QTS. There is also the option for suitably qualified applicants to add on the award of PGCE at an additional cost"}
