{"id":"01b4cd81-42f7-4074-b34c-bf0b67f9296d","name":"Design and Technology","code":"2JNG","qualification":"pgce_with_qts","startDate":"2024-07-31T23:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"118fabd7-86d0-4a40-9e9a-e5c302abe59b","code":"DT","name":"Design and technology"}],"locations":[{"id":"31dbe333-9947-4cc1-be76-505ef6eb499b","name":"Clare Mount Specialist Sports College","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"050ffe1a-712f-4595-9a57-5607cea87d72","code":"21D","name":"Weatherhead High School"},"accreditedBody":{"id":"ec34b77c-cba3-4598-93be-23f0471adff1","code":"L51","name":"Liverpool John Moores University"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feesInternational":14000,"feeDetails":"There are a range of ways in which you can arrange to pay your course fees, including in monthly instalments.","financialSupport":"\r\n","aboutCourse":"The Design and Technology (Food) PGCE with QTS course offered by the Weatherhead Teaching School Alliance (WTSA) in partnership with Liverpool John Moores University (LJMU) provides a rigorous training experience, focused on developing your skills and knowledge needed for embarking on a teaching career.\r\n\r\nThe WTSA initial teaching curriculum is designed in collaboration with LJMU to provide a blend of school-led and university-based training.  We draw on the experience of our teaching teams across our teaching alliance partner schools to deliver high-quality school-based training.\r\n\r\nDuring the course you will spend at least 120 days in school, with regular training sessions in WTSA partner schools and at LJMU. During the first term, you will attend training sessions at LJMU on Fridays, with regular training sessions at Weatherhead High School or in partner schools throughout the course.  You will also attend LJMU for 5 full training weeks during the course. \r\n\r\nShortly after interview, if successful, you will be assigned a home school, where you will be based for the majority of the year.  You will experience an alternate placement for 6 weeks in January/February in a different education setting within our partner schools, before returning to your home school to complete your course.\r\n\r\nAll partner schools are experienced in supporting trainees and excel at providing an inspirational and rewarding training experience.\r\nThe programme will focus predominantly on developing your subject knowledge and subject pedagogy so that you have the knowledge, understanding and skills needed to become a confident Food Technology  teacher.\r\n\r\nUniversity-led lectures and seminars will develop your confidence in a range of relevant issues such as classroom and behaviour management; meeting individual needs and inclusion; planning and assessment.\r\n\r\nSchool-led sessions will also develop your understanding in key areas such as the role of the form tutor, working as part of a department team, curriculum planning and delivery, and participation in extra-curricular activities. You are encouraged to develop into an inclusive and reflective teacher, with the skills, energy and resilience needed to start your career.\r\n\r\nIn order to achieve Qualified Teacher Status, you will demonstrate that you are able to meet all the requirements of the Teachers’ Standards. This aspect of assessment is undertaken by our experienced school-based subject mentors in partnership with your LJMU Liaison Tutor. LJMU staff are in regular contact with all trainees on placement, undertake co-observations of their teaching and Quality Assure the school-based training across the Partnership.\r\n","interviewProcess":"Candidates who meet the criteria will be invited by email to attend a one-day selection process giving candidates the opportunity to show their potential for this course. Normally interviews will be held in a school based setting, but due to the current situation this may not be possible. Interviews may be conducted over the telephone and candidates will be informed of this.\r\n\r\nThere will be a number of activities to be undertaken on the day:\r\n\r\n* Deliver a 5 minute presentation to the interview panel.\r\n* Prepare and deliver a 30 minute lesson from your subject area, to a class of Key Stage 3 students.\r\n* Formal interview.\r\n\r\nThe selection process may or may not take place at your alliance school and candidates will normally be informed of the outcome within 24 hours.\r\n","howSchoolPlacementsWork":"Your school-based experience takes place largely in a home school, supported by well-trained mentors. This arrangement allows you to be fully integrated into school life from the first day of term – you get to know staff, students and your subject mentor extremely well, to the benefit of all involved. A member of LJMU staff is attached to each school (Liaison Tutor) and will visiting your regularly to provide support to trainees and their mentors.\r\n\r\nAll trainees will have weekly meetings with their mentors and tutorials with LJMU staff to review progress and provide feedback. This “wraparound” care ensures that you are consistently supported from start to finish, both personally and professionally.\r\n\r\nAlthough the LJMU programmes focus on 11-16 experience, many trainees also gain experience of Post-16 planning and teaching during their school experience.\r\n \r\nSchool-based training is structured in Phases, beginning with an observation phase, so that you can develop appropriate confidence and competence, only taking on greater responsibility for planning and teaching as the year progresses. Your final assessment for QTS is conducted at the end of the year.\r\n","personalQualities":"What we look for in a candidate:\r\n\r\n* Passion and enthusiasm for your subject\r\n* Desire to share your passion with students and make a difference to their education\r\n* Excellent organisational skills, punctual and willing to support your school and its students\r\n* An ability to reflect on your own practice, accept guidance and constructive criticism\r\n* Self-motivated and proactive.\r\n\r\n","otherRequirements":"You will also be required to meet the Department for Education’s standards for physical and mental fitness to teach and clearance to work with children. Further information, including a Declaration of Health questionnaire and details of how to apply for a Disclosure and Barring Service (DBS) Enhanced Disclosure will be sent to you after you have firmly accepted an offer.\r\n\r\nYour offer is conditional on completing ALL conditions of entry. These will be made available on UCAS.\r\n","status":1,"createdAt":"2021-07-06T10:53:03.093Z","updatedAt":"2021-10-15T14:31:37.318Z","canSponsorStudentVisa":"yes","cycle":"2024"}
