{"id":"7ee84666-c086-4186-a4b4-abf892b7a96d","name":"Modern Languages","code":"3FDK","qualification":"pgce_with_qts","startDate":"2024-07-31T23:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"ce8523ef-9236-4cd9-b260-d826c7a521b3","code":"ML","name":"Modern Languages"},{"id":"4608e5e3-2a1a-48a1-8236-56c7af5a139d","code":"24","name":"Modern languages (other)"}],"locations":[{"id":"d5e9b6fa-d4f7-46bd-9cb8-311331097dd9","name":"Weatherhead High School","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"050ffe1a-712f-4595-9a57-5607cea87d72","code":"21D","name":"Weatherhead High School"},"accreditedBody":{"id":"ec34b77c-cba3-4598-93be-23f0471adff1","code":"L51","name":"Liverpool John Moores University"},"profPost":"BO","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","aboutCourse":"This route allows you to learn ‘on the job’ and earn a salary while you train towards Qualified Teacher Status (QTS). School Direct (salaried) route is an employment-based route for high quality graduates, at least 2 years experience in a school-based setting.\r\n\r\nThe Weatherhead Teaching School Alliance MFL Salaried PGCE course, offered in collaboration with Liverpool John Moores University, is taught by experienced and friendly staff, who were all successful teachers and maintain strong links with schools. Trainees are employed by their home school during the duration of their PGCE and therefore are expected to fulfil the professional role of an unqualified teacher at their respective schools, teaching up to 90% of a teacher's timetable. Trainees must be prepared to plan and teach lessons from the onset. \r\n\r\nThe sessions to support trainees in gaining QTS and passing their PGCE are held at the I M Marsh Campus in Liverpool, which begins with a Summer School during the last week of August. \r\n\r\nIn order to achieve Qualified Teacher Status, you will demonstrate that you are able to meet all the requirements of the Teachers’ Standards. This aspect of assessment is largely undertaken by our school-based mentors. LJMU staff are in regular contact with all trainees on placement, undertake co-observations of their teaching and Quality Assure the school-based training across the Partnership.\r\n\r\nPlease note some schools offer employment beyond the salaried school direct training year, there is no guarantee of employment.","interviewProcess":"Candidates who meet the criteria will be invited by email to attend a one-day selection process giving candidates the opportunity to show their potential for this course. Normally interviews will be held in a school based setting, but due to the current situation this may not be possible. Interviews may be conducted over the telephone and candidates will be informed of this.\r\n\r\nThere will be a number of different activities to be undertaken on the day:\r\n\r\n* Deliver a 5 minute presentation to the interview panel.\r\n* Prepare and deliver a 30 minute lesson from your subject area, to a class of Key Stage 3 students.\r\n* Formal interview.\r\n\r\nThe selection process may or may not take place at your alliance school and candidates will normally be informed of the outcome within 24 hours.\r\n","howSchoolPlacementsWork":"Your school-based experience takes place largely in a Home School, supported by well- trained mentors. We have found that being in a Home School ensures that you are fully integrated into school life and get to know staff, pupils and your subject mentor extremely well, to the benefit of all involved. A member of LJMU staff is attached to each school and is responsible for visiting regularly in order to support all trainees and their mentors.\r\n\r\nAll trainees are entitled to weekly review and feedback meetings with their mentors and to tutorials with LJMU staff. This “wraparound” care ensures that you are consistently supported from start to finish, both personally and professionally.\r\n\r\nIn addition to the time spent in a Home School, you will also undertake an alternative placement of  a minimum of 2 weeks at a time negotiated with the employing school, based on the trainee’s individual needs. Although the LJMU programmes focus on 11-16 experience, many trainees may also gain experience of Post 16 planning and teaching during their school experience.\r\n\r\n\r\n","personalQualities":"What we look for in a candidate:\r\n\r\n• Candidates must be dedicated to the students\r\n• We are looking for staff who are passionate and enthusiastic about teaching\r\n• Eager, keen to learn and can reflect and plan\r\n• Excellent organisational skills, punctual and willing to give your own time to the school and its pupils\r\n• An ability to reflect on own practice, accept guidance and constructive criticism\r\n• Guide and drive your own learning, use your initiative and be proactive.\r\n","otherRequirements":"You will also be required to meet the Department for Education’s standards for physical and mental fitness to teach and clearance to work with children. Further information, including a Declaration of Health questionnaire and details of how to apply for a Disclosure and Barring Service (DBS) Enhanced Disclosure will be sent to you after you have firmly accepted an offer.\r\n\r\nYour offer is conditional on completing ALL conditions of entry. These will be made available on UCAS.\r\n","status":2,"createdAt":"2021-07-06T10:53:03.650Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"For more information on salary please contact schooldirectPCGE@weatherheadhigh.co.uk\r\n"}
