{"id":"7d3aa262-8c6e-425b-ac15-e6c8ae28951c","name":"Physics","code":"22C9","qualification":"pgce_with_qts","startDate":"2024-07-31T23:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"bf97cd0a-224c-43d3-a021-84143df13e8d","code":"F3","name":"Physics"}],"locations":[{"id":"7be2674d-e939-4ab2-8efe-e33d060f7bdd","name":"Main Site","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"f2eb33a1-d224-4e37-b415-21ff0467ca2d","code":"13A","name":"Shireland Teacher Training"},"accreditedBody":{"id":"ef09ce50-ccfc-4346-a0ce-43e840153dab","code":"W20","name":"The University of Warwick"},"profPost":"PG","degreeGrade":"1","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","aboutCourse":"The University of Warwick, as a Russell Group university, brings quality and depth to the academic side of training together with a wealth of experience in initial training to ensure the highest standard of pedagogical provision. Hence it is a partner that Shireland is proud to work with.\r\n\r\nShireland Teaching School Alliance is an alliance of both secondary and primary schools across the West Midlands. As the lead school, Shireland Collegiate Academy delivers the strategic vision, and provides the capacity and expertise to promote excellence across the Teaching Schools agenda.\r\n\r\nThe School Direct teacher training course runs for an academic year and leads to qualified teacher status (QTS), a postgraduate certificate in education (PGCE) and 60 masters-level credits. ","interviewProcess":"You will be invited to attend a selection day, the structure of which will depend on the phase and subject you have applied for. The day will include a literacy and numeracy test for primary applicants and a literacy test for secondary applicants (this does not replace the Professional Skills Tests). All applicants will be observed working with students and undergo a formal interview. In some instances applicants may be invited to a further interview at their potential host school. ","howSchoolPlacementsWork":"The training is a blend of theory and practice. You will attend university for regular days during the year giving you strong theoretical foundations and subject knowledge. Your school will give you lots of practical experience and expert support, giving you a solid foundation to build your career. You will be in the classroom from day one so once you have learned something new you can put it straight into practice. You will have an extensive support network with support from university tutors and mentors, mentors within your own school and the Teaching School Director. In addition you will have weekly training with other trainees across the Alliance. You will spend the majority of the year in your host school with a 4 – 6 week second placement in the spring term. ","personalQualities":"Candidates should have some experience of mainstream UK schools/early years settings to become familiar with the atmosphere and demands of the age phase they are applying for. ","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:51:04.737Z","updatedAt":"2021-08-10T10:29:59.045Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":" - Unqualified Teaching Scale 1\r\n - Course fees are paid for by provider\r\n- £2000 PGCE fee funded by trainee"}
