{"id":"fbd8a91a-8b79-41f3-b4ea-c6c58eb5399a","name":"Dance","code":"37J5","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"49dcc400-03df-4732-af93-1c56ae22897f","code":"12","name":"Dance"}],"locations":[{"id":"7be2674d-e939-4ab2-8efe-e33d060f7bdd","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"f2eb33a1-d224-4e37-b415-21ff0467ca2d","code":"13A","name":"Shireland Teacher Training"},"accreditedBody":{"id":"4aa8177a-27b8-4566-b77a-c45515e46739","code":"N36","name":"Newman University"},"profPost":"PG","degreeGrade":"1","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"financialSupport":"There are three types of funding available for teacher training - depending on your circumstances, you could receive all three:\r\n1.Tax-free bursary or scholarship\r\n2.Tuition Fee Loan and Maintenance Loan\r\n3.Additional financial support if you’re a parent or have a disability\r\n\r\n","aboutCourse":"Newman is a values-driven university where students are central to all that the\r\nuniversity does. Students are encouraged to engage with theories and\r\nconcepts, discuss ideas with tutors and become self-motivated, independent\r\nlearners and creative thinkers able to make a difference in the world.\r\n- Top 10 for Overall Student Satisfaction\r\n- 95% Graduate Employment Rate\r\n- Research classed as Internationally Excellent and World Leading\r\n\r\nShireland Teaching School Alliance is an alliance of both secondary and primary schools across the West Midlands. As the lead school, Shireland Collegiate Academy delivers the strategic vision, and provides the capacity and expertise to promote excellence across the Teaching Schools agenda.\r\n\r\nThe School Direct teacher training course runs for an academic year and leads to qualified teacher status (QTS), a postgraduate certificate in education (PGCE) and 60 masters-level credits. ","interviewProcess":"You will be invited to attend a selection day, the structure of which will depend on the phase and subject you have applied for. \r\nAll applicants will be observed working with students, undergo a formal interview and possibly complete a literacy and/or numeracy assessment. \r\nIn some instances, applicants may be invited to a further interview at their potential host school.\r\n","howSchoolPlacementsWork":"The training is a blend of theory and practice. You will attend university for regular days during the year giving you a strong theoretical foundation and subject knowledge.\r\nThe course starts in September, where you will begin in your main placement school.  You will stay with your host school until Christmas.  When you return in January, you will spend a minimum of 6 weeks in a complimentary placement school. In March you will return to your original school placement, where you will stay until June, when you have completed the course.  You will attend university for regular days throughout the year.\r\nA trainee will begin by observing their mentor and other experienced staff within the school.  They will agree with their mentor their phased introduction to teaching.  For some trainees this may be starters/plenaries and for others whole lessons.  They will eventually build up to a 14 hour a week teaching timetable, the timescale for which is agreed with their mentor and can vary from trainee to trainee. You will be in the classroom from day one so once you have learned something new you can put it straight into practice.\r\nYou will also spend approximately 6 weeks in a complimentary placement school.  This is to ensure you experience a full variety of different school environments, communities and methods of teaching and learning.\r\nSecondary trainees will also spend 5 days placement at a Primary school.\r\n","personalQualities":"Candidates should have some experience of mainstream UK schools/early years settings to become familiar with the atmosphere and demands of the age phase they are applying for. ","status":1,"createdAt":"2021-07-06T10:51:05.381Z","updatedAt":"2021-08-10T09:42:28.183Z","canSponsorStudentVisa":"no","cycle":"2024"}
