{"id":"d9602824-57b1-4fa9-a2f9-5107933dd81d","name":"PE with EBacc","code":"C813","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"74d64a54-5e34-4590-b6c7-528dd0cf26fe","code":"C6","name":"Physical education"}],"locations":[{"id":"38541478-ddc3-4555-84cc-4efcdb2c55ee","name":"John Hanson Community School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"75d4530a-108c-4da0-819f-bccfbaaba45b","name":"Crestwood College for Business and Enterprise","isPublished":"Y","status":"R","vacancies":"F"},{"id":"320db009-997f-4283-9517-ecb74e8d455c","name":"The Romsey School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"f1898056-6e12-41af-9927-a116683222f3","name":"Robert May's School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"60c888b1-4b89-4cd9-9d33-5f8bda640228","name":"Perins School - A Community Sports College","isPublished":"Y","status":"R","vacancies":"F"},{"id":"11de7383-6993-4317-a8ee-286ed3558ae6","name":"Harrow Way Community School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"8f4461a3-98e9-4b94-8217-b3d9d67513c7","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"},{"id":"58b85e23-e76c-4600-ac24-b837bc7bd8f0","name":"Brighton Hill Community School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"c3880476-89a1-44bb-9ec2-718e44e2910a","name":"The Henry Beaufort School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"879f790e-847c-4d5d-b4be-4a2ccb0be0c1","name":"Eggar's School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"8e326c02-890b-40db-b8e7-ad9fa8e78697","name":"The Mountbatten School - A Language and Sports College","isPublished":"Y","status":"R","vacancies":"F"},{"id":"be199ec8-94af-4164-b82e-ef29c3115d56","name":"Toynbee School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"113c549b-e314-4bbb-bde7-20ed63d7dfb4","code":"1X9","name":"The Hampshire SCITT Partnership"},"profPost":"PG","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"a minimum of 50% of the degree modules should be in the subject wishing to train to teach.\n\nFor applicants with an A-level grade C or above in an Ebacc subject, training to teach PE with this additional subject would enhance employment possibilities.","acceptPendingGcse":"no","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9000,"feesInternational":9000,"feeDetails":"For 2022/23 our tuition fees will be £9,000 for non-salaried trainees.  Salaried trainees do not pay tuition fees.  \r\n\r\nSuccessful applicants with The Hampshire SCITT Partnership will be subject to a Disclosure and Barring Service (DBS) check at their own expense. Further information regarding this process will be provided to successful applicants.\r\n","aboutCourse":"From the very start of your training, you will be part of the teaching team in your school. Your programme will include training days across a number of schools in The Hampshire SCITT Partnership, training in your own school, subject specialist days led by outstanding practitioners and personalised training. \r\n\r\nMost of the training is delivered by practitioners in some of the best secondary schools in Hampshire.  You will be assigned to one of the schools in our partnership for most of your training (your ‘home’ school) and you will have a second school placement, typically six weeks, which will give you opportunities to extend your practice in a different setting.  We prepare our trainees to teach the 11-16 age range.  All our partnership schools have comprehensive intakes and you will be working with young people of all abilities.  \r\n\r\nStaff from the University of Reading will prepare you for the two academic assignments, the successful completion of which is required for the award of a PGCE and you will have access to the University Library for your academic research. Each Friday will be dedicated to training in one of our partnership schools.  On those days, there will be opportunities for discussion, both formal and informal with practitioners and with your peers.  You will benefit from being part of a highly supportive, professional network.\r\n\r\nYou will be assigned two members of staff in your ‘home’ and second placement schools, one from your subject area and one who has responsibility for all the trainees in that school.   From the beginning you will be treated like a member of staff and you will attend staff meetings and professional development days.  \r\n\r\nEach year, we offer some salaried places.  Successful applicants will have a contract with their home school and will earn a salary during the training.  In return for the salary, you will be expected to teach some classes on your own from the start of the school year.  For this reason, salaried places are best suited to those who have some experience of working in a school in either a support role or as an unqualified teacher.  Salaried vacancies can be found under provider code 16P.\r\n\r\n","interviewProcess":"Candidates invited to interview will participate in the following process:\r\n-\tAn interview with a panel typically comprised of the Director of The Hampshire SCITT Partnership and a subject specialist\r\n-\tA subject knowledge task to assess the candidate's subject knowledge against the requirements of the school curriculum \r\n-\tA lesson planning task\r\n\r\nThroughout this process, the emphasis is placed on generating a pleasant, informal and welcoming atmosphere in which candidates are able to gain as much information about the programme as they require in order to accept a place if it is offered subsequently.\r\n\r\nApplicants for salaried places will have a second round of interviews at the school(s) offering those places.  This will involve an interview with school leaders and a teaching task which will typically be a full lesson to a whole class.  \r\n\r\nApplicants will be sent interview details in advance so they have plenty of time for preparation.  Decisions about the offer of places are made very soon after the interviews and the outcomes communicated through the Apply system. Unsuccessful candidates are offered feedback on their performance.\r\n\r\n","howSchoolPlacementsWork":"Across our partnership, we work with some of the best secondary schools in Hampshire. All our partner schools are committed to providing outstanding initial teacher training and typically, they offer places in subjects in which they are needing to recruit. Although there is no guarantee of a job in your home school, each year at least 85% of our trainees gain full time teaching posts in one of these schools.  \r\n\r\nAll safer recruitment procedures are followed by The Hampshire SCITT Partnership.  All the schools in our partnership are committed to safeguarding and promoting the welfare of children and young people and they expect all staff and trainees to share responsibility for this.\r\n\r\nWhen selecting a school for an applicant, the SCITT Director looks very carefully at travel time because we want our trainees to spend their time developing their practice rather than travelling.  The average distance our trainees travel to their schools is 6 miles.\r\n\r\nWe prepare our trainees to teach the 11-16 age range.  Trainees start the programme in their “home” school, then have a placement in a second school in the first half of the Spring Term before returning to their “home school” until the programme finishes at the end of June.\r\n","personalQualities":"We warmly welcome applicants from all backgrounds for whom becoming a highly effective teacher is their career aim.\r\n\r\nIn applications and during the interview process, we look for the following:  \r\n-\tA desire to teach and enthuse young people\r\n-\tAn awareness of the challenges of teaching\r\n-\tAn awareness of the challenges of the training programme\r\n-\tCommitment\r\n-\tStrong subject -based academic background\r\n-\tGood communication skills\r\n-\tAn ability to engage young people in learning\r\n-\tAn awareness of current educational issues\r\n-\tFamiliarity with the curriculum for the relevant key stages\r\n-\tAdaptability, resilience and professionalism\r\n","otherRequirements":"With your application, we will need to receive satisfactory references, generally from academic referees. Mature applicants who are changing careers may use professional referees.\r\n\r\nYou must demonstrate competency in fundamental Mathematics and English before the end of the programme.\r\n\r\nSuccessful applicants will be subject to a Disclosure and Barring Service (DBS) check at their own expense.  Trainees are also obliged to complete the SCITT’s Health Declaration form.\r\n\r\nIf English is your second language you will need to demonstrate at interview the correct and fluent use of standard English, both spoken and written, which is a requirement for Qualified Teacher Status\r\n","status":1,"createdAt":"2021-10-08T08:32:07.355Z","updatedAt":"2021-10-08T08:35:10.117Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
