{"id":"e3f5f947-4ff0-41ce-a56f-2a775edf9ba6","name":"Mathematics","code":"27R7","qualification":"pgce_with_qts","startDate":"2023-07-31T23:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"72345aa7-096c-488f-8649-085b8178cadb","code":"G1","name":"Mathematics"}],"locations":[{"id":"95c6679b-767d-4564-810b-bef307bb05c3","name":"Caludon Castle School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"7d993440-a3ed-4ec7-9e83-a223d1832f00","code":"179","name":"Caludon Castle School"},"accreditedBody":{"id":"ef09ce50-ccfc-4346-a0ce-43e840153dab","code":"W20","name":"The University of Warwick"},"profPost":"BO","degreeGrade":"1","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"•\tEquivalency Testing. Offer a discounted rate £160 (normal price £175).\n•\tA Star Equivalency. Offer a special rate for The University of Warwick applicants for equivalency exams (all subjects) to be booked for £139 (normal price £165) Please contact cte.admissions@warwick.ac.uk for discount code.","courseLength":"OneYear","aboutCourse":"School Direct programmes contain a core Professional Studies element and a series of Subject Studies sessions designed for your chosen specialism.  Some of these take place at the placement school and some at the University of Warwick.\r\n\r\nTrainees then take what they have learned in the training room directly into the classroom where they put it into practice under the supervision and guidance of mentors and fellow colleagues who will provide support, feedback and key guidance to ensure that all trainees make the required progress. Professional Studies sessions, based at Caludon Castle School, are facilitated by leading practitioners who have a track record of excellence in teaching.\r\n\r\nTopics covered include:\r\n\r\nUnderstanding learning\r\nBehaviour for learning\r\nOutstanding lesson planning\r\nUsing ICT to enhance learning and teaching\r\nLiteracy and numeracy\r\nQuestioning techniques\r\nDifferentiation\r\n\r\nThe course will include developing:\r\n\r\n•\tsubject knowledge in Mathematics\r\n•\tmaking Maths accessible\r\n•\tpresenting abstract ideas\r\n•\tdeveloping Schemes of Learning to inspire learners\r\n•\tmaking the most STEM\r\n•\tsupporting literacy in Mathematics\r\n•\tdesigning and supporting learning outside the classroom\r\n•\tlinking Mathematics to the wider curriculum\r\n•\tpost-16 Mathematics teaching\r\n\r\n\r\nTrainees will have experience in at least two secondary or primary schools (depending on phase and potential Covid restrictions) and have the opportunity to immerse themselves in school life, participating in extra-curricular activities, parent meetings, and cross-curricular events.  Trainees, also get the chance to spend some time working with children with special educational needs.\r\n\r\nAll programmes lead to QTS and PGCE status, including the award of 90 CATS credits towards Master’s accreditation, upon meeting the assessment criteria, specified by the University of Warwick.\r\n","interviewProcess":"If shortlisted for selection, applicants will be invited to an interview day, where they will be involved in a range of activities, including teaching a short lesson to students, undertaking a literacy exercise, and undergoing a panel interview.  All applicants offered a place will subsequently be required to produce a clear enhanced disclosure certificate from the Disclosure and Barring Service and to pass the 'Fitness to Teach' requirements laid down by the Department for Education, before taking up their place on the course.","howSchoolPlacementsWork":"Successful School Direct candidates will complete their Post Graduate Certificate of Education (PGCE 11-18) with the University of Warwick, allowing them to achieve Qualified Teacher Status (QTS) as well as gaining 90 CATs points towards their Master’s. Practical, school-based training will take place at the lead school.  The School Direct programme will involve candidates being supported in and engaged with the schools from the beginning of September 2022, developing relevant professional skills and learning from the wealth of experience that exists both within the schools and the university. High quality support will be available at all times from the schools and the university to help candidates on their journey towards becoming outstanding classroom practitioners. ","personalQualities":"Applicants need to have a passion for teaching and show a sincere professional interest in working with children.  Applicants need to be in good health.  Applicants are required to show a commitment to their subject, as well as a desire to train in a school-based environment. They are encouraged to highlight in particular any prior teaching experience in their application.","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:52:26.210Z","updatedAt":"2021-09-27T11:54:11.345Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"Salary will be .1 on the unqualified teachers scale.\r\n\r\nUnqualified pay scale commences from £18,419."}
