{"id":"0f50aa13-bc39-465f-9bfb-8b5c4e300161","name":"Primary","code":"3BWL","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"65bd693e-d797-49b9-a9bb-37a6154298ed","name":"Rowner Junior School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"45f96e2d-95ba-4373-a25b-76cf210ad029","name":"Gomer Junior School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"2e7f34f3-5fde-410e-b84e-be2558c1b6e8","code":"1AS","name":"Gosport and Fareham Multi-Academy Trust"},"accreditedBody":{"id":"3700fb02-7007-40c8-9127-b070e146d6cb","code":"W76","name":"University of Winchester"},"profPost":"BO","degreeGrade":"1","english":"1","maths":"1","science":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We work to the requirements of the University of Winchester.","courseLength":"OneYear","feesUK":9250,"feesInternational":13800,"feeDetails":"At time of publication, the tuition fees for September 2021 entry are £9,250 for UK, Republic of Ireland, Channel Islands and Isle of Man students. EU fees to be confirmed. The tuition fee for International students  is £13,800. Please contact (studentsandmoney@winchester.ac.uk) for confirmation of the fee.\r\n\r\nAs the GFM Academy Trust work in partnership with Winchester University, you will not be employed by the school during your training year, so will be required to pay the fees specified by the University.  To see if you are eligible for funding through tuition fee loans, training bursaries or scholarships, please consult the Get into Teaching website.","aboutCourse":"The course prepares you to teach across the age ranges 4-11 and is structured around a combination of taught modules based at the University and placement modules based in schools or educational settings.\r\n\r\nYou will undertake studies in all elements of primary education; extend your knowledge of teaching and learning, of the breadth and scope of the curriculum and the professional skills associated with high-quality teaching. You will then apply these areas of understanding and skill to classroom practice throughout the year, including during two assessed placements in schools or educational settings.\r\n\r\nUpon successful completion of the course you will be awarded a PGCE with recommendations for the award of Qualified Teacher Status (QTS).\r\n","interviewProcess":"If your DfE Apply application is selected, you will be contacted and invited to one interview. As part of the interview, candidates are normally expected to teach 30 minutes of a lesson. In light of Covid, our interview process is currently being held virtually.  As such, the practical teaching element has been suspended.  However, candidates will still be expected to submit a lesson plan for a teaching episode in order to demonstrate appropriate subject knowledge.   In addition, all candidates will need to complete a written English task and a Maths skills test.\r\n\r\nCandidates will then have the opportunity to participate in an interview (about half an hour) with the Manager of Initial Teacher Training, the Department Lead and when available, a representative from Winchester University. Under normal circumstances, candidates will also be offered an optional tour of the school.  The interview process is complete within a half day.\r\n\r\nCandidates will be notified of the interview decision via personal contact from the Manger of Initial Teacher Training and the DfE Apply notification procedure.","howSchoolPlacementsWork":"Bay House School & Sixth Form is the lead school for Initial Teacher Training within the GFM. Trainees focus on the Junior phase, with a short placement within an Infant school.\r\n\r\nWithin the GFM family currently, are Bay House School and Sixth Form, Brune Park Community School, an 11-16 school also within Gosport. Gomer Junior and Rowner Junior are our primary schools within Gosport. Lord Wilson School, a specialist secondary provision on the outskirts of Fareham. This diversity offers a broad spectrum of experiences. \r\n\r\nWe are partnered with other schools in the Fareham area, with whom we share resources to offer placements, allowing our trainees to gather even wider and more diverse experience of a variety of schools.","personalQualities":"We will look for evidence of a commitment to the teaching profession, an understanding of professional requirements, and an awareness of current educational issues in an application. Prior experience in a school is not essential, however prospective students may find experience in a school useful for obtaining an insight into the classroom setting. Experience in a school or similar setting may also provide reassurance to prospective students that teaching is the right choice for their career.\r\n","otherRequirements":"If you accept an offer of a place you will be required to complete a Disclosure and Barring Service (DBS) criminal records check and Prohibition Order check. If you have spent time overseas in the last 5 years you may also be required to obtain criminal records checks from each of the countries you visited. You will also be required to complete an occupational health check to confirm that you are fit to teach. The University of Winchester will send you more information about when and how you need to complete each of these checks if you accept our offer.\r\n","status":1,"createdAt":"2021-07-06T10:56:29.628Z","updatedAt":"2021-09-29T11:00:37.536Z","canSponsorStudentVisa":"yes","cycle":"2024"}
