{"id":"05e1764a-d5cd-452d-8bcf-5efdad7e926c","name":"Business studies","code":"X745","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"TA","fundingType":"apprenticeship","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"de6477b2-6027-48e6-b9f7-3206774705c2","code":"08","name":"Business studies"}],"locations":[{"id":"af746acf-e1fc-4a1a-a6f1-e0786fd17c4c","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"1c270488-81f1-4dd3-a69c-a6d3f05dd9fa","code":"26J","name":"Teach in Kent"},"accreditedBody":{"id":"de0e702b-b19b-4594-b433-aa49be29f4d9","code":"H40","name":"Tes Institute"},"degreeGrade":"9","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We offer equivalency tests through TES Institute if required.","courseLength":"OneYear","aboutCourse":"Our course maximises your school experience so that you spend as much time as possible learning from professionals in the classroom. The online learning element of the course offers our trainees a large degree of flexibility in when they choose to study. The online learning is bespoke to your learning needs and factors in your previous experience; there is no \"one size fits all\" with our course.\r\n\r\nBefore you start your training, you will already have been given the opportunity to get to know your home school. By the time you start, you will already know the people who will be supporting you every day in your training.\r\n\r\nYou will receive support and advice on how to plan, teach and assess learning. During your course, we will organise visits to different types of schools and specialist contexts to give you a rounded educational experience to prepare you for an exciting career in teaching.\r\n\r\nTrainees complete 3 assignments during the course. The advice and support offered ensure that we have a high success rate to empower you to reflect effectively on your teaching at the start of your career.\r\n\r\nWe assess your progress throughout the course to build up an overall picture of the teacher you are becoming. Our innovative online systems gathers your evidence throughout the course which avoids unnecessary workload on trainees.\r\n\r\nAs well as your school-based mentor, your pathway tutor will visit you each term to ensure that you are progressing well and offer your advice on your teaching, assignments and evidence gathering.","interviewProcess":"Interviews are conducted in our partnership schools, usually in the school you will be training in.\r\n\r\nThe interview includes:\r\n*a 30 minute lesson observation.  We aim to see that you have the communication skills and presence to be a teacher. \r\n*a 40 minute interview\r\n*an English and Maths test\r\n\r\nTo prepare you for interviews, we will be delighted to organise school experience days for you to help you get ideas for your own interview lesson. ","howSchoolPlacementsWork":"Our trainees spend most of their year in their home school. They will arrive on day 1 of the term in September and become fully immersed in school life. \r\n\r\nWe then organise for a second placement in January for 6 weeks. This placement school will be a contrasting context. You will then return to your home school with your new skills until the end of the school year.\r\n\r\nWe will also organise various days during the school year to ensure we have covered the full range of educational contexts available in the UK.","personalQualities":"We are seeking passionate people who are looking for a career in teaching. Our schools are dedicated to finding the best role models for their students. If you have the drive and enthusiasm to inspire young people, we want to meet you.","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:47:41.572Z","updatedAt":"2021-10-11T08:12:46.865Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024"}
