{"id":"29b1b893-821f-4fa9-aae4-57b1660f079d","name":"Mathematics","code":"2JFX","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"72345aa7-096c-488f-8649-085b8178cadb","code":"G1","name":"Mathematics"}],"locations":[{"id":"c0848f2a-ea13-49d0-b9a4-7d8116e01630","name":"Priory School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"18438266-53f0-4db5-8655-71f2bb19fe82","name":"Bohunt School Liphook","isPublished":"Y","status":"R","vacancies":"F"},{"id":"40004625-a696-40cb-b996-7f6b28ab1e49","name":"The Costello School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"d5862b0e-3d05-439d-851d-986db6bebf3a","name":"The Petersfield School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"8bf0a1c5-fb1e-43eb-8224-525245592708","name":"Bohunt School Horsham","isPublished":"Y","status":"R","vacancies":"F"},{"id":"041ec28d-a284-4ff7-a7ea-0089f7d1c376","name":"Bohunt School Worthing","isPublished":"Y","status":"R","vacancies":"F"},{"id":"b3b19085-ec7d-47fc-bb60-9a17a387731e","name":"Steyning Grammar School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"a7556aa1-0a32-4f98-9013-2aa3d255d396","name":"Bohunt Education Trust (main site)","isPublished":"Y","status":"R","vacancies":"F"},{"id":"ee345307-7be9-4e0d-b0a3-9da4e056086d","name":"Bohunt School Wokingham","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"7cdf0a26-446c-459d-8293-68a294150a3e","code":"1DP","name":"Bohunt Education Trust"},"accreditedBody":{"id":"3700fb02-7007-40c8-9127-b070e146d6cb","code":"W76","name":"University of Winchester"},"profPost":"BO","degreeGrade":"1","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":15000,"feeDetails":"The course fees for domestic/international students for our School Direct (non-salaried) programme are in line with our partner Universities. Please see University websites for further details.\r\n\r\nPlease be aware that International student’s fees are different and are not always eligible for Bursary support. This means it is likely that your training course will be self-funded. In terms of bursaries it is your responsibility to check what you are entitled to based on your qualifications you have. Alternatively, there is a salaried route, please enquire if this is available for your subject/school. \r\n \r\n \r\n\r\n \r\n","aboutCourse":"The School Direct programme is a one-year, Postgraduate route into teaching that allows you to graduate with: \r\n- a wealth of classroom experience \r\n- a full PGCE (Postgraduate Certificate in Education) \r\n- Qualified Teacher Status.\r\n\r\nThe School Direct programme is open to domestic and international students. Please note Visa sponsorship is possible but not guaranteed for international candidates.\r\n\r\nSchool Direct differs from University based PGCE in that you apply to the Teaching School through UCAS and you will be told which school you will be based in. This allows you to ensure you can organise travel arrangements, childcare and other commitments you may have alongside studying for the PGCE. You will still obtain a PGCE qualification at the end. In addition, because it is school based, it means you will be in school from day one; when staff return in September you join them at the staff INSET, which allows you to see how class teachers set out their lesson plans and routines for their new classes.\r\n \r\nYour training is managed by Bohunt Education Trust (BET) and delivered in collaboration with our partner Universities. This ensures you have a trio of support: your school mentor, your BET professional tutor and the University link tutor. \r\n\r\nTraining comprises: \r\n- 15 days of Trust-based training where you travel to different schools within the Trust for various training themes\r\n- University days where you are often taught alongside their PGCE. Please be aware that each University has different set ups, lecture timetables and course end dates. If you are unsure about this and the travel commitment involved please ensure that, you ask about this on School Experience or at Interview.\r\n","interviewProcess":"1.Apply through the UCAS site. Recruitment will be on-going until we fill our allocated places. \r\n\r\n2. Once you have applied through UCAS please also register your interest with us by email and attach a copy of your Curriculum Vitae: SchoolDirect@bohunt.hants.sch.uk  \r\n\r\n3. As this is a centralised system candidates are likely to be notified in a variety of ways. First through the UCAS site itself that your application has been sent. Then all applicants will receive an email and/or letter from the Trust notifying you that your application is being processed. \r\n\r\n4. At this point one of three things is likely to happen: \r\n- you are invited in for school experience within a partnership school\r\n- you are invited for interview and school experience \r\n- you are rejected. \r\n\r\n5. Short-listed candidates will be invited by email to attend a selection day comprising an interview, teaching activity and evaluation task to assess your suitability for, and commitment to, the teaching profession. \r\n\r\nIn the majority of cases, candidates are then invited for a second interview at the University with their professional mentors and course leaders. This is usually when a University are not able to attend the initial interview. It is then a decision between both the School and University to offer a training position. \r\n","howSchoolPlacementsWork":"You will spend the majority of the time, starting in September, at your main placement school, with training sessions delivered by Bohunt Education Trust schools and the partner University for your subject. University sessions differ between providers. Some have training every Friday, others blocks of a week or more. So please ask at Interview. \r\n\r\nThere is an expectation that you will attend the August/September INSET day(s) alongside school staff so please be advised to check the dates that you need to start when booking summer holidays. In addition there is an Induction date in July.\r\n \r\nYou will also have a second placement usually in February-March, before returning to your main placement school to finish your training.\r\nThe School Direct programme gives you a much greater say in where your training is based. Whilst we can never guarantee a placement before interview, we can guarantee you will be placed within our partner schools and that the earlier you apply the more likely you are to be placed in a school of your choice. \r\n\r\nWhere there is limited vacancies – you list your three preferred schools within our alliance and you will be placed at one of these schools. \r\n","personalQualities":"We are looking for high quality candidates who are ambitious, creative, confident, dynamic and forward thinking. Ideal candidates are team players with good presentation and communication skills. Above all we want people with a passion to inspire our students about their subject and about learning.  \r\n\r\n","otherRequirements":"If you have non-UK qualifications, you will need a Statement of Comparability from UK NARIC.\r\n\r\nUpon successful interview, you need to pass the Professional Skills \r\nTests in Literacy and Numeracy before training begins \r\n\r\nPassing of a DBS check (for international candidates a police clearance is required from any country they have lived in for more than 12 months).\r\n\r\nSuccessful completion of Subject Knowledge Enhancement course prior to training (if required). \r\n\r\nThese requirements will be a conditional part of any offer and must be met before training starts.\r\n\r\nIt is the applicant’s responsibility to ensure they check the qualification requirements.\r\n","status":1,"createdAt":"2021-07-06T10:50:49.955Z","updatedAt":"2021-10-08T11:26:07.564Z","canSponsorStudentVisa":"yes","cycle":"2023"}
