{"id":"69db6d25-5c52-47a0-bf6b-58b2d5a6c805","name":"History","code":"2YVY","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"5a3609a0-5bbb-4377-b919-5d89932ab622","code":"V1","name":"History"}],"locations":[{"id":"1d8b3b0f-8aef-4d27-8a0f-a943bddde5dd","name":"Blessed Thomas Holford Catholic College","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"5a0db7e7-e141-423e-8110-a88bdcc435b2","code":"1YR","name":"Blessed Thomas Holford Catholic College"},"accreditedBody":{"id":"9d03acb4-95ce-41e1-8458-0b4bec147b6b","code":"M20","name":"The University of Manchester"},"profPost":"BO","degreeGrade":"0","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"Minimum 2:1 honours degree in history or a related subject.\n104 UCAS points including a B in history or a related subject at A-level (or equivalent).","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":20000,"aboutCourse":"The PGCE History course consists of a variety of learning experiences designed for those wishing to train as teachers. The majority of the course focuses on training in teaching and learning related skills. This is underpinned by the development of participants' knowledge and understanding of educational theories, ideas and concepts and by enhancing their awareness of current educational issues and developments. \r\n\r\nThe Secondary course prepares graduates to teach the National Curriculum and related national strategies, GCSE, AS and A2 level. For the purposes of gaining Qualified Teacher Status, trainees focus on the 11-18 age range. Learning takes place through a number of school and university based elements. There will be extended periods of school experience which will provide opportunities to work in a Primary setting and to teach in at least two different Secondary Schools.  A total of approximately 25 weeks during the PGCE will be spent experiencing and working in different types of School.\r\n\r\nAt the end of the course, your lead school may offer you a permanent role.","interviewProcess":"BTHCC is the Lead School in the partnership and will be coordinating the recruitment process. \r\n\r\nYou are welcome to visit the school prior to application - please contact school on 0161 911 8090.\r\n\r\nInterviews will usually take place at BTHCC.\r\nWhen you come for a School Direct interview there are likely to be other applicants being interviewed alongside you. We are keen to see that you can work collaboratively with others. The criteria we will use at interview to decide whether or not we offer you a place on the course are:\r\n\r\n-      an awareness of current educational issues\r\n-      a realistic and positive view of schools and schooling\r\n-      an open and enquiring mind\r\n-      clear reasons for wanting to teach \r\n-      motivation and commitment to teaching pupils of all levels of ability\r\n-      maturity and self-confidence\r\n-      an appropriate level of subject knowledge in your chosen subject for secondary applicants\r\n\r\nYou will be expected to plan and deliver a 20 minute teaching session - a topic will be supplied in advance of the interview and you will be given information regarding the age and ability of the pupils.\r\n\r\nFurther details about the interview process will be sent when invited to interview.\r\n","howSchoolPlacementsWork":"Your School Direct Programme will consist of a combination of classroom practice and relevant training. You will be given the opportunity to spend much of your time developing and practising your teaching skills with high quality school placements from across our partner schools.\r\n\r\nYou will also be offered a programme of training and development delivered by your placement school and university provider. You will be supported along the way by a number of different colleagues at Blessed Thomas Holford Catholic College and will be assigned a school-based Subject Mentor, a Professional Mentor and a University-based Tutor.\r\n\r\n\r\nThe 2 main placements work on an A/B/A  rotation where Blessed Thomas Holford Catholic College, as the lead school, is usually the A placement although this may not always be the case.\r\n\r\n","personalQualities":"-      maturity and self-confidence\r\n-      an open and enquiring mind\r\n-      a genuine passion and clear reasons for wanting to teach \r\n-      motivation and commitment to teaching pupils of all levels of ability\r\n-      an awareness of current educational issues\r\n-      an awareness of the role and responsibilities of the teacher\r\n-      a realistic and positive view of schools and schooling\r\n-      a good standard of written English","otherRequirements":"Relevant work experience\r\nWe recommend that you spend at least two days observing in a UK state secondary school prior to attending an interview.\r\n\r\nReferences which support the suitability of the candidate for teaching\r\n\r\nA personal statement\r\n\r\n\r\n\r\n","status":1,"createdAt":"2021-07-06T10:53:25.877Z","updatedAt":"2021-09-29T14:16:50.464Z","canSponsorStudentVisa":"yes","cycle":"2024"}
