{"id":"9e0b334d-35ed-4d12-93c7-8f10230f6f22","name":"Design and Technology","code":"G122","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"118fabd7-86d0-4a40-9e9a-e5c302abe59b","code":"DT","name":"Design and technology"}],"locations":[{"id":"1d8b3b0f-8aef-4d27-8a0f-a943bddde5dd","name":"Blessed Thomas Holford Catholic College","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"5a0db7e7-e141-423e-8110-a88bdcc435b2","code":"1YR","name":"Blessed Thomas Holford Catholic College"},"accreditedBody":{"id":"812b70c4-7fc4-46fc-975b-3e4d00f77dc4","code":"M40","name":"The Manchester Metropolitan University"},"profPost":"PG","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"You will normally have a minimum of a 2:2 undergraduate honours degree awarded by a UK university, or an equivalent higher education qualification. Your degree needs to support the subject knowledge requirements of the National Curriculum for Design and Technology. For exceptional candidates, particularly those with substantial relevant work experience in schools or relevant occupations, we will consider applications from those who hold a 3rd class degree.","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"You will also need GCSEs at grade C/4 or above in English language and mathematics. However, Equivalency tests in English, Mathematics and Science are provided by Manchester Metropolitan University. The School of Teacher Education will accept these equivalency tests for any of its initial teacher education programmes, at undergraduate or postgraduate level. This will be at the discretion of the admissions tutor, and only offered if considered appropriate after interview.\n\nWe do not accept the following qualifications as equivalent to GCSE: Adult numeracy and literacy, Functional Skills or Key Skills.","courseLength":"OneYear","feesUK":9250,"feesInternational":17500,"aboutCourse":"Our one-year Postgraduate Certificate in Education (PGCE) prepares you to teach across the Design and Technology secondary (food, textiles and product Design) school curriculum.\r\n\r\nStudying topics from textiles and electronics, food and electronics, to textiles and product design you’ll focus on creating the projects you might teach your class. Past projects include creating a pencil case with LEDs, building a basic circuit, and using a 3D printer to print textiles.\r\n\r\nThrough these practical workshops you’ll explore some of the issues students might have, such as using complex machinery or working with soldering irons. You’ll also look at ways to make sure you’re imparting educational knowledge through each project, such as electronic calculations or weaves of fabric.\r\nYou’ll attend Critical Skills lectures and workshops once a week in mixed groups with students from other subject areas.\r\n\r\nThese sessions help you to develop skills outside of your subject knowledge. Some of the topics you’ll explore include behaviour management, mental health and emotional wellbeing, teacher persona, and non-verbal communication (such as body language).\r\n\r\nYou’ll also develop your research skills during these lectures, analysing the latest educational research and theories. \r\n\r\nWhen you go for interviews for your first teaching post, you’ll be expected to present a portfolio of your work alongside your interview. To make sure your portfolio is ready for interviews, you’ll work on it from December. This gives you time to make sure that you have all of the pieces of work that you’d like to showcase to schools.\r\n\r\nYou’ll go on your first block placement in late September, where you’ll put the skills you’ve learnt at University into practice and build your confidence in the classroom.\r\n\r\nYou’ll be involved in all aspects of teaching, from marking work to delivering lessons to helping with parents’ evenings.\r\n\r\nWhen you’re on placement, you’ll have a school mentor (often the class teacher) to help you with day-to-day matters, and receive regular visits from your personal tutor and visiting tutor.\r\n\r\nIn the spring term, you’ll complete a short placement in a primary school. This experience helps to broaden your knowledge of teaching methods and develop your teaching skills.\r\n\r\nUnits on this course may include:\r\n\r\nSubject Pedagogy\r\nCritical Studies\r\nReflection on Professional Development\r\nPractice Credit Unit – Placement Block A\r\nPractice Credit Unit – Placement Block B\r\n","interviewProcess":"BTHCC is the Lead School in the partnership and will be coordinating the recruitment process. \r\n\r\nYou are welcome to visit the school prior to application - please ring the school reception 0161 911 8090 \r\n\r\nInterviews will usually take place at BTHCC.\r\nWhen you come for a School Direct interview there are likely to be other applicants being interviewed alongside you. We are keen to see that you can work collaboratively with others. The criteria we will use at interview to decide whether or not we offer you a place on the course are:\r\n\r\n-      an awareness of current educational issues\r\n-      a realistic and positive view of schools and schooling\r\n-      an open and enquiring mind\r\n-      clear reasons for wanting to teach \r\n-      motivation and commitment to teaching pupils of all levels of ability\r\n-      maturity and self-confidence\r\n-      an appropriate level of subject knowledge in your chosen subject for secondary applicants\r\n\r\nYou will be expected to plan and deliver a 20 minute teaching session - a topic will be supplied in advance of the interview and you will be given information regarding the age and ability of the pupils.\r\n\r\nFurther details about the interview process will be sent when invited to interview.\r\n\r\n","howSchoolPlacementsWork":"Your School Direct Programme will consist of a combination of classroom practice and relevant training. You will be given the opportunity to spend much of your time developing and practising your teaching skills with high quality school placements from across our partner schools.\r\n\r\nYou will also be offered a programme of training and development delivered by your placement school and university provider. You will be supported along the way by a number of different colleagues at Blessed Thomas Holford Catholic College and will be assigned a school-based Subject Mentor, a Professional Mentor and a University-based Tutor.\r\n\r\n\r\nThe 2 main placements work on an A/B  rotation where Blessed Thomas Holford Catholic College, as the lead school, is usually the A placement although this may not always be the case.\r\n\r\n\r\n\r\n","personalQualities":"-      maturity and self-confidence\r\n-      an open and enquiring mind\r\n-      a genuine passion and clear reasons for wanting to teach \r\n-      motivation and commitment to teaching pupils of all levels of ability\r\n-      an awareness of current educational issues\r\n-      an awareness of the role and responsibilities of the teacher\r\n-      a realistic and positive view of schools and schooling\r\n-      a good standard of written English","otherRequirements":"Relevant work experience\r\nWe recommend that you spend at least two days observing in a UK state secondary school prior to attending an interview.\r\n\r\nReferences which support the suitability of the candidate for teaching\r\n\r\nA personal statement\r\n\r\n","status":1,"createdAt":"2021-07-06T10:53:26.111Z","updatedAt":"2021-09-29T11:01:32.607Z","canSponsorStudentVisa":"yes","cycle":"2024"}
