{"id":"be44fd17-77d8-499a-953f-036bbd07d18d","name":"Modern Languages (French and Spanish)","code":"2NJF","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"e34fd2a3-a32e-44e9-aea1-666badf3ac03","code":"22","name":"Spanish"},{"id":"9727f674-61ba-4efa-b1f2-21ec7e354442","code":"15","name":"French"},{"id":"ce8523ef-9236-4cd9-b260-d826c7a521b3","code":"ML","name":"Modern Languages"}],"locations":[{"id":"1d8b3b0f-8aef-4d27-8a0f-a943bddde5dd","name":"Blessed Thomas Holford Catholic College","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"5a0db7e7-e141-423e-8110-a88bdcc435b2","code":"1YR","name":"Blessed Thomas Holford Catholic College"},"accreditedBody":{"id":"9d03acb4-95ce-41e1-8458-0b4bec147b6b","code":"M20","name":"The University of Manchester"},"profPost":"BO","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"Minimum 2:2 honours degree. If you are not a native French/Spanish speaker, approximately 50% or more of your degree content should have focused on French/Spanish.\n\nA strong academic record at A-level (or equivalent), including French, German or Spanish.\n\nYou should also be able to speak a second language (French or German). If this is at beginners' level, you would be required to develop it through a funded Subject Knowledge Enhancement course, available at various institutions.","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"In addition to a grade of C at GCSE in English Language, applicants whose first language is not English are required to meet the following language requirements:\n\nIELTS 6.5 overall, 6.5 in writing, no sub-section below 6.0, or\n\nTOEFL iBT overall score of 90 with a minimum score of 22 in writing and 20 in the other sub-sections, or\n\nPearson PTE overall score of 62 with a minimum score of 62 in writing and 59 in the other sub-sections, or\n\nCambridge CAE grade A or Cambridge CPE grade C (please note that the Cambridge First Certificate in English is not acceptable).","courseLength":"OneYear","feesUK":9250,"feesInternational":20000,"aboutCourse":"PGCE Secondary School Direct Modern Languages (French & Spanish) provides you with the practical training and theoretical knowledge required to become an outstanding Languages teacher.\r\n\r\nCompared with non-School Direct teacher trainees, you will benefit from additional time in school before the PGCE starts and follow a modified version of the course. Throughout, you will focus on the 11-16, 11-18 or 14-19 age ranges in order to gain Qualified Teacher Status (QTS), learning to teach the National Curriculum and related national strategies surrounding GCSE, AS and A2-level study.\r\n\r\nThe majority of the course focuses upon practical training in teaching and learning-related skills. You will enjoy extended periods of school experience, which will provide opportunities to work in a Primary setting and to teach in at least two different Secondary schools. In total, 25 weeks of your PGCE will be spent experiencing and working in different types of school.\r\n\r\nThis practical training is underpinned by the development of your knowledge and understanding of educational theories, ideas and concepts, including current issues and developments.\r\n\r\nAt the end of the course, your lead school may offer you a permanent role.","interviewProcess":"BTHCC is the Lead School in the partnership and will be coordinating the recruitment process. \r\n\r\nYou are welcome to visit the school prior to application - please contact school on 0161 911 8090.\r\n\r\nInterviews will usually take place at BTHCC.\r\nWhen you come for a School Direct interview there are likely to be other applicants being interviewed alongside you. We are keen to see that you can work collaboratively with others. The criteria we will use at interview to decide whether or not we offer you a place on the course are:\r\n\r\n-      an awareness of current educational issues\r\n-      a realistic and positive view of schools and schooling\r\n-      an open and enquiring mind\r\n-      clear reasons for wanting to teach \r\n-      motivation and commitment to teaching pupils of all levels of ability\r\n-      maturity and self-confidence\r\n-      an appropriate level of subject knowledge in your chosen subject for secondary applicants\r\n\r\nYou will be expected to plan and deliver a 20 minute teaching session - a topic will be supplied in advance of the interview and you will be given information regarding the age and ability of the pupils.\r\n\r\nFurther details about the interview process will be sent when invited to interview.\r\n","howSchoolPlacementsWork":"Your School Direct Programme will consist of a combination of classroom practice and relevant training. You will be given the opportunity to spend much of your time developing and practising your teaching skills with high quality school placements from across our partner schools.\r\n\r\nYou will also be offered a programme of training and development delivered by your placement school and university provider. You will be supported along the way by a number of different colleagues at Blessed Thomas Holford Catholic College and will be assigned a school-based Subject Mentor, a Professional Mentor and a University-based Tutor.\r\n\r\n\r\nThe 2 main placements work on an A/B/A  rotation where Blessed Thomas Holford Catholic College, as the lead school, is usually the A placement although this may not always be the case.\r\n\r\n\r\n","personalQualities":"-      maturity and self-confidence\r\n-      an open and enquiring mind\r\n-      a genuine passion and clear reasons for wanting to teach \r\n-      motivation and commitment to teaching pupils of all levels of ability\r\n-      an awareness of current educational issues\r\n-      an awareness of the role and responsibilities of the teacher\r\n-      a realistic and positive view of schools and schooling\r\n-      a good standard of written English","otherRequirements":"Relevant work experience\r\nWe recommend that you spend at least two days observing in a UK state secondary school prior to attending an interview.\r\n\r\nReferences which support the suitability of the candidate for teaching\r\n\r\nA personal statement\r\n\r\n\r\n\r\n\r\n","status":1,"createdAt":"2021-07-06T10:53:25.677Z","updatedAt":"2021-09-29T14:31:09.881Z","canSponsorStudentVisa":"yes","cycle":"2024"}
