{"id":"ce78c011-5666-447f-9100-7cbf561ab2fe","name":"Art and Design","code":"3BZF","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"d461a678-3335-4ca2-9616-1dc479d31a49","code":"W1","name":"Art and design"}],"locations":[{"id":"1d8b3b0f-8aef-4d27-8a0f-a943bddde5dd","name":"Blessed Thomas Holford Catholic College","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"5a0db7e7-e141-423e-8110-a88bdcc435b2","code":"1YR","name":"Blessed Thomas Holford Catholic College"},"accreditedBody":{"id":"812b70c4-7fc4-46fc-975b-3e4d00f77dc4","code":"M40","name":"The Manchester Metropolitan University"},"profPost":"BO","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"Your degree needs to support the subject knowledge requirements of the National Curriculum for Art and Design. For exceptional candidates, particularly those with substantial relevant work experience in schools or relevant occupations, we will consider applications from those who hold a 3rd class degree.","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"As per Government requirements for teacher training courses, we are not able to accept Key Skills, Adult Numeracy and Literacy or Functional Skills as an alternative to GCSE English Language and Mathematics qualification. However, Equivalency tests in English, Mathematics and Science are provided by Manchester Metropolitan University.  The School of Teacher Education will accept these equivalency tests for any of its initial teacher education programmes, at undergraduate or postgraduate level.  This will be at the discretion of the admissions tutor and only offered if considered appropriate after interview.","courseLength":"OneYear","feesUK":9250,"feesInternational":16500,"aboutCourse":"Our one-year School Direct Postgraduate Certificate in Education (PGCE) prepares you to teach the art and design secondary school curriculum.\r\n\r\nYou’ll learn teaching methods through interactive workshops – we teach you as if you’re in a school art class.This helps you to experience what it’s like to learn the same way as students, and explore the different ways you could teach art activities.You’ll have sessions across art, craft and design, from drawing to printmaking, ceramics to lens based media such as photography.\r\n\r\nFor specialist mediums, such as ceramics and paper craft, we organise a series of guest lectures, inviting artists with expertise in these practices to teach you. And, you’ll share your specialist art and design skills with your group too (students from past years have shared skills including bookbinding and Photoshop).\r\n\r\nWhile you’re at Manchester Met, you’ll mainly study with your art and design group. You’ll consider how to plan lessons, reflect on your planning, look at ways to develop your teacher persona and understand how research can develop and influence your teaching practice.\r\n\r\nYou’ll spend at least 120 days on placements in schools – gradually becoming the class teacher.\r\n\r\nTrainees will be introduced to different models of critical engagement and be involved in a number of gallery education workshops at various stages in the course.  You will explore the relationship between curriculum development and assessment for and of learning in art, craft and design and particular concerns, such as drawing for different purposes and needs.  In addition you will follow a series of workshops that embrace a range of art, craft, design and new media disciplines.  You will be shown how to apply resulting insights in your teaching to the benefit of your pupils.","interviewProcess":"BTHCC is the Lead School in the partnership and will be coordinating the recruitment process. \r\n\r\nYou are welcome to visit the school prior to application - please email robertmcguinness@bthcc.org  or ring  0161 911 8090\r\n\r\nInterviews will usually take place at BTHCC.\r\nWhen you come for a School Direct interview there are likely to be other applicants being interviewed alongside you. We are keen to see that you can work collaboratively with others. The criteria we will use at interview to decide whether or not we offer you a place on the course are:\r\n\r\n-      an awareness of current educational issues\r\n-      a realistic and positive view of schools and schooling\r\n-      an open and enquiring mind\r\n-      clear reasons for wanting to teach \r\n-      motivation and commitment to teaching pupils of all levels of ability\r\n-      maturity and self-confidence\r\n-      an appropriate level of subject knowledge in your chosen subject for secondary applicants\r\n\r\nYou will be expected to plan and deliver a 20 minute teaching session - a topic will be supplied in advance of the interview and you will be given information regarding the age and ability of the pupils.\r\n\r\nFurther details about the interview process will be sent when invited to interview.\r\n","howSchoolPlacementsWork":"\r\nYour School Direct Programme will consist of a combination of classroom practice and relevant training. You will be given the opportunity to spend much of your time developing and practising your teaching skills with high quality school placements from across our partner schools.\r\n\r\nYou will also be offered a programme of training and development delivered by your placement school and university provider. You will be supported along the way by a number of different colleagues at Blessed Thomas Holford Catholic College and will be assigned a school-based Subject Mentor, a Professional Mentor and a University-based Tutor.\r\n\r\n\r\nThe 2 main placements work on an A/B  rotation where Blessed Thomas Holford Catholic College, as the lead school, is usually the A placement although this may not always be the case.\r\n","personalQualities":"-      maturity and self-confidence\r\n-      an open and enquiring mind\r\n-      a genuine passion and clear reasons for wanting to teach \r\n-      motivation and commitment to teaching pupils of all levels of ability\r\n-      an awareness of current educational issues\r\n-      an awareness of the role and responsibilities of the teacher\r\n-      a realistic and positive view of schools and schooling\r\n-      a good standard of written English","otherRequirements":"Relevant work experience\r\nWe recommend that you spend at least two days observing in a UK state secondary school prior to attending an interview.\r\n\r\nReferences which support the suitability of the candidate for teaching\r\n\r\nA personal statement\r\n\r\n\r\n\r\n\r\n","status":1,"createdAt":"2021-07-06T10:53:25.931Z","updatedAt":"2021-09-29T08:54:55.113Z","canSponsorStudentVisa":"yes","cycle":"2024"}
