{"id":"61a063d9-e353-4ac5-8b0b-efc0b75abfbf","name":"Primary","code":"3F9B","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"2eff5031-e3fa-4c75-926c-b2b593d9544e","name":"Andrew Smith","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"70a77e57-f3e3-4562-91e7-94b969caf179","code":"2JT","name":"Godalming Learning Partnership"},"accreditedBody":{"id":"3700fb02-7007-40c8-9127-b070e146d6cb","code":"W76","name":"University of Winchester"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We use specific agencies for equivalency tests. The cost of these is the responsibility of the student. The equivalency tests need to be in place before the course starts","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Anyone already in education will tell you that teaching is one of the toughest jobs out there. It's also one of the most rewarding. To make sure you’re a successful and confident teacher in the 21st-century, we have devised a vibrant programme informed by research and constantly reviewed to ensure students are equipped with the most up-to-date developments in primary education.\r\n School Direct teacher training with the Godalming Learning Partnership allows you to be part of a school from day one and to learn the craft of the classroom from enthusiastic and knowledgeable professionals. You will be allocated a mentor whose role is to oversee your day to day development and to work with you on planning, teaching and assessment;  helping to ensure you develop the qualities necessary to meet the Teachers' Standards and to work towards becoming an outstanding practitioner.\r\nThe course prepares you to teach across the age ranges 5-11 and is structured around six modules - a combination of taught modules based at the University of Winchester and placement modules based in schools or educational settings.\r\nThe University of Winchester is recognised by Ofsted as an ‘Outstanding’ provider of teacher education at both primary and secondary level and has a long history of training teachers. Our passion is to provide you with a university experience that helps you reach your full potential and make a real difference in the world. We can offer you a stimulating and supportive learning environment that challenges and inspires, in a beautiful, historic cathedral city, located an hour from London by train.\r\nThe city of Winchester has a rich heritage and vibrant contemporary culture, and is consistently ranked as one of the best places to live in the UK (Halifax Quality of Life Survey), so whether you will be living here or commuting, there is plenty to enjoy in the city and surrounding area.\r\n\r\nYou will undertake studies in all elements of primary education; extend your knowledge of learning and teaching, of the breadth and scope of the curriculum and the professional skills associated with high-quality teaching. You will then apply these areas of understanding and skill to classroom practice throughout the year, including during two assessed placements in schools or educational settings.\r\n\r\nUpon successful completion of the course you will be awarded a PGCE with recommendations for the award of Qualified Teacher Status (QTS).\r\n","interviewProcess":"If you already meet or are expected to meet our entry requirements, and have demonstrated your passion and commitment to teaching in your application, you will be invited to attend an interview. The interview is your chance to demonstrate your potential to become a successful teacher.  Information about the format of the day will be sent to you via email in advance of the interview date. The interview is also your chance to find out more about the Godalming Learning Partnership, the course, our group of schools and to meet some of the teachers. So if you are invited to interview please take the opportunity to ask as many questions as you want to and explore our area. ","howSchoolPlacementsWork":"Teaching placements will predominantly be in  one of our 12 Infant, Junior or Primary schools, although all placements include a shorter period of time in a second school. As the 'in school' training takes place across all our schools there is a good opportunity to see a wide variety of schools in action. To see more information about our schools please go to:\r\n(http://godalmingconfed.org) ","personalQualities":"We are looking for passionate people, keen to develop every aspect of their pupils – academic, creative, social, moral and cultural; who share a belief in the importance of high achievement, high standards and high enjoyment in learning through a broad and creative curriculum.\r\nPeople who want to share our creative approach to the curriculum, believing that children learn best when they are given opportunities to express themselves and learn transferable skills in every area of the curriculum.","otherRequirements":"If you accept an offer of a place you will be required to complete a Disclosure and Barring Service (DBS) criminal records check and Prohibition Order check. If you have spent time overseas in the last 5 years you may also be required to obtain criminal records checks from each of the countries you visited. You will also be required to complete an occupational health check to confirm that you are fit to teach. The University of Winchester will send you more information about when and how you need to complete each of these checks if you accept our offer.","status":1,"createdAt":"2021-07-06T10:48:48.080Z","updatedAt":"2021-09-16T13:52:07.186Z","canSponsorStudentVisa":"yes","cycle":"2024"}
