{"id":"399beff5-ba37-4f51-a57a-83b24ae015c8","name":"Modern Languages (French)","code":"S740","qualification":"qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"9727f674-61ba-4efa-b1f2-21ec7e354442","code":"15","name":"French"},{"id":"ce8523ef-9236-4cd9-b260-d826c7a521b3","code":"ML","name":"Modern Languages"}],"locations":[{"id":"a3dd80b6-2290-4bc1-8f5d-4f517614744c","name":"Folkestone Academy","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"1722b419-05e7-4994-ab16-9741d0975c21","code":"1FN","name":"Thames Gateway Teaching School Hub"},"accreditedBody":{"id":"757d0dca-c7a9-43c8-8c3b-96c0a81539b6","code":"K30","name":"Kent and Medway Training"},"english":"3","maths":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","aboutCourse":"The training year commences in very late August whereby you attend a three-day induction programme run by Kent & Medway Training. During these three days, you learn the basics including how to plan a lesson, behaviour management strategies, safe-guarding, and go through your online portfolio. You then join your home school for additional induction days which allows you to settle in before the students arrive back for the new year. The course is full-time i.e Monday-Friday, and runs through to late June/early July the following year. You then see the final few weeks of the summer term out with your home school and celebrate your successes before breaking up for the school holidays.\r\n\r\nThis practical element of the course comprises a mix of classroom-based training with subject mentor support, to academic training where you will be working with experienced professionals on both broader \"Professional Studies\" lectures at a local KMT hub training centre and more detailed \"Subject Studies\" training with the other trainees training in the same subject/key stage as you at various locations across the partnership.\r\n\r\nAll trainees complete two placements during the year in contrasting schools to give variety in your teaching experience. You will have at least one formal lesson observation a fortnight and one mentor meeting each week where you sit with your mentor, discuss your progress and make targets for the following week. You will be expected to attend all school events such as parents’ evenings, after-school clubs, whole school and dedicated trainee training sessions and any other school activity as required.\r\n\r\nOver the year, you will be building up a portfolio of evidence demonstrating your progress towards meeting the National Teaching Standards. There are 7 Reflective Professional Journals to complete; three of which involve research and an essay, each totalling 1500 words. Deadlines are published well in advance for the RPJs to ensure you can manage your workload.\r\n\r\nFor those completing their PGCE, there are additional assignments set at various times through the year.\r\n\r\nThroughout the year there will be a number of networking events held to provide you with even more support, and we have a Graduation Event at the end of the year to celebrate your huge achievements.","interviewProcess":"The interview will be held in the potential ‘home-school’.  It includes the opportunity to observe and participate in lessons, and deliver part of a lesson for 30 minutes (all information is provided well in advance so that you can prepare).  We ask you to attend a formal interview with the subject mentor, the academy's Professional Tutor, representatives from Kent & Medway Training and Medway Teaching School Alliance.  This interview will last an hour.  We will also ask you to complete the KMT entrance tests in your chosen subject area and in English and Maths (these are provided on the day and need no prior planning).\r\n\r\nIf you are successful on the day you will be made a conditional offer verbally, which will be followed up electronically via the UCAS portal.\r\n\r\nPlease rest assured that the interview process is not designed to cause stress or anxiety – rather we want to make you feel comfortable so that you can perform at your very best. Remember, we are assessing you as a candidate who has the potential to train to teach… we are not expecting to see the finished article.","howSchoolPlacementsWork":"All trainees complete two placements during the year;\r\n\r\nPlacement A: This is the longest placement spanning nearly the whole academic year whereby you are based at your ‘home school’. You are in your school for four and a half days a week. Thursday afternoon is your KMT academic time where you will have either Professional Studies or Subject Studies training, led by experienced practitioners or subject specialists. As you are employed by the school, you will be given a 60% solo teaching timetable from day one. You will have your own form group and will be undertaking all duties as a paid teacher of the school.\r\n\r\nPlacement B: You will be based at a different school for up to 4 weeks, typically around February time, which is considered to be a ’contrast placement’ i.e if your placement A is within a comprehensive school, it’s likely that you’ll be based at a grammar school for placement B, and vice versa. The teaching load remains at 60% and during this time there is a mixture of solo teaching, observations, team-teaching activities, etc. At all times, there will be a classroom teacher available to support you. You then return to your home school to complete the course. Where possible, your B-placement school will be discussed with you in advance and you will be placed in the local area.\r\n\r\nPlacement A(2) is back at your home school where you remain until the end of the academic year. At this point, you’ll be in school for the full 5 days of the week. Professional and Subjects Studies are finished with just one further evening session preparing you for your NQT year.\r\n\r\nDuring your placements and duration of the course, you will be assessed through both lesson observations and your completed portfolio to ensure that you have met the Teaching Standards in full. Our grades are then externally moderated and assuming all goes well, your Newly Qualified Teacher status is confirmed and celebrated at a local Awards Evening.","personalQualities":"If you answer 'yes' to the following statements, you have the wider-skills that we are seeking;\r\n\r\n* I am seeking a career that promotes creative thinking\r\n* I enjoy working with children/young adults and have a passion to improve their lives\r\n* I am patient with a calm demeanour\r\n* I can multi-task when in a distracting environment\r\n* I am open-minded and adaptable\r\n* I strive to find solutions when faced with a problem\r\n* I am a confident public speaker\r\n* I have a genuine passion for my subject\r\n* I have excellent time management and organisational skills","otherRequirements":"Medway Teaching School Alliance is committed to safeguarding children and successful applicants will be subject to an Enhanced DBS check. Our commitment to safeguarding is underpinned by robust processes and checks which are in place across the Trust.\r\n\r\nFor a salaried teacher training place, you will also need to evidence a minimum of 3 years' work experience to be eligible for this route.","status":2,"createdAt":"2021-07-06T10:55:33.562Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"The salary is in line with the National Unqualified Teacher Payscale and the point you are placed on depends on your experience. We are open to negotiation, where suitable.\r\n\r\nThe home school that employs you will pay, on your behalf, for your Qualified Teacher Status (QTS) course only. Should you wish to top up your qualification to the full Post Graduate Certificate of Education (PGCE) you will be responsible for the additional fee."}
