{"id":"b4a7aa9a-4963-4502-93fe-31f49455a6fc","name":"Physics","code":"C550","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"bf97cd0a-224c-43d3-a021-84143df13e8d","code":"F3","name":"Physics"}],"locations":[{"id":"cb673cd3-8f90-44e1-8ff4-ffd39e2025c4","name":"The Howard School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"924e005b-c6bf-453e-98f9-2721349c088e","name":"Herne Bay High School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"2412aa42-4241-459b-8673-86c81dc14a0b","name":"Turner Free School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"ebdc61f7-73b7-4e8d-88b7-47cc87bd90f1","name":"Dover Grammar School for Girls","isPublished":"Y","status":"R","vacancies":"F"},{"id":"1335292d-d8dd-4f12-a256-33b8c1894171","name":"Sir Joseph Williamson's Mathematical School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"da60a9d0-b229-4670-9b2d-f415dd0e2025","name":"Astor College","isPublished":"N","status":"S","vacancies":"F"}],"trainingProvider":{"id":"1722b419-05e7-4994-ab16-9741d0975c21","code":"1FN","name":"Thames Gateway Teaching School Hub"},"accreditedBody":{"id":"757d0dca-c7a9-43c8-8c3b-96c0a81539b6","code":"K30","name":"Kent and Medway Training"},"degreeGrade":"9","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Grade 4 (C) or above in English and maths, or equivalent qualification\n\nCandidates with pending GCSEs will be considered Equivalency tests will be accepted in English or maths.\n\nWe accept Level 2 in English and Maths only.\n\nLevel 2 in Literacy and Numeracy are not accepted.","courseLength":"OneYear","aboutCourse":"The course begins on the first day of INSET training with the rest of the staff, integrating you into the staff body, and will continue until the end of the academic year. You will also have a three-week placement in a contrasting school to help to broaden your experience.\r\n\r\nYou will be in schools for four and a half days a week where you will be involved in observations, teaching, staff training, parents’ evenings, school meetings, extra-curricular clubs: all the facets of a teacher’s school life. On Thursday afternoons, you will have your pedagogical training with KMT that provides a mixture of specific Subject Studies, looking at aspects of teaching your specialism, and the more general Professional Studies sessions, which have a holistic approach to educational practices. \r\n\r\nYou will be supported by a network of established professionals, including a subject mentor in your school, usually a subject specialist, your Professional Tutor, your KMT Lead Mentor and Hub Director as well as the other teachers and trainees in your school. You will have a weekly mentor meeting to allow you to discuss any issues and organise any support you may need.\r\n\r\nFrom the beginning of the year, you will be given a teaching timetable of a maximum of 70%. You will focus on teaching KS3 and KS4 but may also get the opportunity to teach some KS5. You will be formally observed once a week in order to receive feedback and make progress.\r\n\r\nAs well as your teaching, you will be working on charting your development and recording your skills through a Progress Tracker and Reflective Practice Assignments. At the late stage of your training, you are being assessed against the 8 Teachers Standards. At the Early and Mid Stage of your training, we are using the KMT Curriculum to monitor your progress.\r\n\r\nIn addition, for those wishing to obtain the Professional Graduate Certificate in Education (PGCE) as well as Qualified Teacher Status (QTS), you will be able to top up your qualification by paying an extra fee and completing additional assignments if you decide to complete the Evidence Informed Practice offered through distance learning with Leeds Beckett University.","interviewProcess":"A structured interview forms a core part of every recruitment process. Non-salaried trainees will be required to give a presentation to the interview panel following instructions that will be provided within the interview invitation. For salaried trainees an interview involving planning and teaching a lesson will be required as part of the suitability assessment criteria.\r\n\r\nA training provision checklist will be provided to candidates prior to the interview for them to read through. A short period of time will be allocated at the start of the interview to allow the candidates to ask any questions they may have in relation to the training provision offered by Kent and Medway Training (KMT).\r\n\r\nSuccessful interviews have a clear structure which helps keep the panel objective and focused throughout. However, this must allow flexibility and the necessary freedom for skilled interviewers to use probing, supplementary and additional questions as required to ascertain the candidate's resilience and dedication to teaching.\r\n\r\nAn interview format should cover:\r\n• initial meeting between the candidate and the Hub Director to discuss the training provision;\r\n• an introductory opening when the interview panel joins;\r\n• a schedule of questions which are asked by panel members;\r\n• space for candidates to raise any issues or ask their own questions;\r\n• the close of the interview, explanation of what will happen next;\r\n• Maths and English proficiencies will be checked.\r\n\r\nIf the candidate is successful at interview, a conditional offer will be made.","howSchoolPlacementsWork":"You will have a ‘Home’ school which is where you will spend the majority of your training year.  You will be supported by  a mixture of expert teachers in order to learn how to teach your subject.\r\n\r\nYou will also have a three-week placement in a contrasting school. For example, from a non selective to a Grammar School or a single-sex school to a mixed school. This will usually take place before Easter.\r\n\r\nIn April and May, you will be finally assessed through both lesson observations and your completed portfolio to ensure that you have met the Teachers’ Standards. If you are successful, your QTS award will be confirmed during our final Exam Board. ","personalQualities":"• In order to train with us you must be:\r\n\r\n* passionate about your subject\r\n* resilient and resourceful \r\n* dedicated to educating and supporting young people\r\n* self-reflective\r\n* open to constructive criticism\r\n* professional\r\n* proactive\r\n* a strong communicator\r\n* be organised","otherRequirements":"Before the course begins, you will need:\r\n\r\n* at least 10 experience days in a secondary school or academy (if School and Government Guidelines allow)\r\n* at least 2 experience days in a primary school or academy (if School and Government Guidelines allow)\r\n* DBS check\r\n* Health check declaration\r\n\r\nIt is useful to attend at least one school experience day or informal chat with a school representative before applying so that you can get a feel for the chosen school and what it can offer as a training placement.","status":1,"createdAt":"2021-07-06T10:55:32.146Z","updatedAt":"2021-09-30T14:52:56.571Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"Salaried Trainees are paid according to the Unqualified Teacher Pay Scale.\r\nThe school will cover your fees to KMT for QTS.\r\nIf you wish to complete the PGCE there is an additional cost of £1,950 (subject to change).\r\n"}
