{"id":"ba0f1d82-c639-4eda-9a7e-30a08a9e8651","name":"Art and Design","code":"2PPY","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"d461a678-3335-4ca2-9616-1dc479d31a49","code":"W1","name":"Art and design"}],"locations":[{"id":"6d1fd773-21a5-4017-8517-6290bc5c4680","name":"Crispin School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"0fd2de51-736a-4516-81ce-94659d58951d","code":"M84","name":"Mid Somerset Consortium for Teacher Training"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We recommend a third party company for equivalency tests.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"We have a strong and successful longstanding partnership with schools across Somerset and North Dorset. We are friendly and supportive aiming to get the best out of each of our trainees and make them the best teachers that they can be. \r\nThe training course has a simple structure. Trainees spend Monday, Wednesday, Thursday and Friday training on the job in their schools. They then meet together as a group on Tuesdays with the MSC at Crispin School for Professional Training. \r\nProfessional Training is run by current practitioners and MSC staff and is tailored to ensure that trainees have appropriate pedagogical input at the different stages of their development as teachers.  We practice what we preach ensuring a balance of modelling techniques and strategies with current research. We also visit other partnership schools which are leaders in their particular fields of expertise so that trainees get a great breadth of training and are fully prepared for their first year in teaching.\r\nOur trainees are able to build up their teaching hours from the beginning of the course at a pace which suits them. A mentor in school is at hand to offer advice and support to each trainee.\r\nOur programme starts on 1st September and ends on 30th June. Trainees are in school from day 1 and are regarded as full members of the school community.\r\nTrainees are able to gain QTS and PGCE with us. Assessment for QTS is through weekly lesson observation and portfolio tasks which are specifically designed to allow trainees to showcase their practice. Our PGCE is delivered through the MSC's Professional Training (accredited by Bath Spa University). Assessment is in the form of three written assignments at Masters' level.\r\nWe have excellent outcomes for our trainees; we were ranked 27 out of 153 secondary trainers across the UK in the Good Teacher Training Guide 2017.","interviewProcess":"The MSC operates a two stage interview process. \r\n\r\nStage 1 Interview-\r\nSuccessful applicants will be invited to an initial interview at the MSC Training Centre after which shortlisting will take place.The interview will be conducted by MSC personnel and representatives from the partnership. This will generally take place at the MSC's lead School, Crispin School, Street. The interview will include\r\n* a general panel interview\r\n* a 30 minute written task\r\n* a pupil activity\r\n\r\nAs a trainee teacher, teachers will be expected to deliver aspects of the Personal, Social and Health Education/Citizenship programme with pupils. Part of the selection process during interview 1 will involve applicants leading a 12 minute activity on a pre-chosen topic. \r\n\r\nStage 2 Interview-\r\nIf successful at stage 1, an offer of a second interview will be sent to successful candidates. The second stage of the interview takes place in a partnership school and is subject specific; candidates will normally be expected to work with a group of pupils. It aims to match the candidate with an appropriate department for training. In this way a \"best fit\" for the school, department and trainee can be established which results in the best possible outcomes for all parties. The interview will include\r\n* a general panel interview\r\n* approximately a 30 minute micro teach (subject specific) \r\n\r\n\r\nCandidates should be prepared to attend 2 interview dates. \r\n","howSchoolPlacementsWork":"We try and match candidates with their home schools at second interview; this enables both the school and candidate to make informed decisions before they offer/accept a place to train. We try to ensure that travel times are kept as low as possible between trainees' schools and home. Getting it right before the training course starts ensures a more successful placement. \r\nTrainees have to spend 6 weeks in a second school. The trainee is free to choose where this is as long as it provides a complementary experience from the home school. This placement takes place straight after Christmas. The trainees then return to their home schools.\r\nWe work with most of the secondary schools in Somerset and North Dorset. The majority of our schools are 11-16 although some do have sixth forms. We try and ensure that all trainees have some experience of post sixteen during their course.","personalQualities":"Well Organised.\r\nResilient.\r\nHard working.\r\nPatient.\r\nCreative.\r\nGood communicator.\r\nPassionate about working with young people.\r\nEnthusiastic about your subject area.\r\n\r\n\r\n\r\n","otherRequirements":"DBS clearance.\r\nSatisfactory References.\r\nEligibility to study in the UK.\r\nProof of adequate subject knowledge to teach your subject if your degree is in another subject.","status":1,"createdAt":"2021-07-06T10:56:27.208Z","updatedAt":"2021-09-15T07:02:38.499Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
