{"id":"5106471d-e9e7-44f0-91c7-f064ba1baff5","name":"Primary","code":"3DPB","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"ff1c9965-2f88-4a43-be9c-3d829916b0f4","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"0bc173b7-6163-493a-968f-62c5301d1611","code":"1XW","name":"Primary Advantage"},"accreditedBody":{"id":"7f11aaed-7c3e-42c5-af7a-023d33b45fa3","code":"U80","name":"UCL, University College London"},"profPost":"BO","degreeGrade":"1","english":"1","maths":"1","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"UCL will accept equivalency tests from:-\n•\tA Star Equivalency Testing https://astarequivalency.co.uk/\n•\tEquivalencyTesting.com https://www.equivalencytesting.com/\n\nFor UCL's full entry requirements please see:\nhttps://www.ucl.ac.uk/prospective-students/graduate/teacher-training/entry-requirements","courseLength":"OneYear","feesUK":9250,"feeDetails":"UCL’s fee for 2021-22 was £9,250.  Please check their pages for up to date fees for 2022 entry.\r\n","aboutCourse":"Primary Advantage Federation is seeking to appoint excellent applicants like you for the School Direct Primary PGCE (Tuition Fee) Programme 2022-23.\r\n\r\nThis route looks identical to the PGCE programme on offer at UCL - the only difference is that you apply directly to our schools rather than the university itself. That way you know where you'll be placed for the entire year. \r\n\r\nThis training route is provided with UCL Institute of Education (IOE); The IOE is a global leader in teacher education.  Their programmes are recognised by Ofsted as “outstanding” in every criterion across Primary and Secondary Education. All our School Direct students have full access to UCL student support services and facilities.\r\n\r\nThe primary PGCE is a highly popular course known to develop effective, confident teachers whose classroom practice is informed by an advanced knowledge of educational theory, and who continue to learn and reflect throughout their careers. \r\n\r\nAs a trainee you will be warmly welcomed and supported in our schools. \r\n\r\nYou will start the year at university and later in September join one of our schools for your first placement.  You will have the chance to observe and participate in class at first and gradually be coached to lead activities and teach small group and whole classes as your placement progresses, with the guidance, nurture and  support of your class teacher. \r\n\r\nYou will spend about a third of your training at the Institute of Education and the remainder on placement at our schools.\r\n\r\nYou will benefit from a very strong support network which includes an IOE tutor, school mentors, class teacher mentors and the student peer group. Most importantly you will love working with our children. \r\n\r\nAs part of our support programme you'll come together for weekly ITT Hub training sessions with some of the best teachers in our Federation for training, observations, and reflecting on practice. We have found this creates a really strong peer group which students find incredibly supportive and valuable. It also adds an important third dimension to your teacher training experience. \r\n\r\nFull course details can be found at:\r\nhttps://primaryadvantage.co.uk/train-to-teach/school-direct-post-graduate-teaching-apprenticeships/school-direct-primary-tuition-fee/\r\n\r\nhttps://www.ucl.ac.uk/ioe/courses/teacher-training/primary-pgce\r\n\r\n","interviewProcess":"The training route follows the same pattern as the PGCE at UCL, the difference being that you have the opportunity to choose us at the application stage as the schools you will train in.  \r\n\r\nYour application comes to us directly, we interview you and then your application is forwarded to the IOE for the final decision.  Full details of the interview process will be given at the time.  Interviews may be online depending on the current situation, and if possible later in the year we will resume face to face interviews.    We usually ask you to prepare a short activity or presentation, you will have an interview with our team, and you will be asked to complete English and maths audits, in line with guidance from our partner the IOE.  \r\n\r\n","howSchoolPlacementsWork":"You will gain experience working across Early Years Foundation, Key Stage 1 and Key Stage 2 during the course of the year.   You will start in one of our schools for the first placement from around the start of October, until February.\r\n\r\nYou will then do a short 2-week alternative placement outside our Federation half way through the year to broaden your experience, and then rotate into one of our other primary schools in Hackney in the final term of the year, teaching in a different age phase. \r\n\r\nThese placements will be co-ordinated and finalised between us and the IOE by the start of the programme.  \r\n\r\nThe advantage of applying to us directly is that you will know your 2 main placements will be in our schools. We can usually let you know by July which school your first placement will be in, and you can start to get to know your school early.\r\n\r\nWe can often arrange optional school visits, in your placement school, in July and September, so that by the time you start your first placement you will have had the opportunity to get to know your school and meet the staff and children. Students find this very useful as they start their first placement already knowing the school and many of its routines.","personalQualities":"Our schools are exciting places to work, filled with inquisitive children, supported by a community of diverse families and inspiring organisations, striving to ensure all children thrive. \r\n\r\nWe are looking for you to: \r\n \r\nBe enthusiastic, hardworking and committed to supporting all pupils\r\n\r\nHave excellent organisational and interpersonal skills\r\n\r\nBe open to developing highly reflective practice\r\n\r\nHave creative ideas with an ability to translate them into inclusive practice\r\n\r\nBe committed to improving student outcomes\r\n","otherRequirements":"You are expected to be proficient in English, and will need to obtain an enhanced DBS and health checks (done via UCL before the start of the course).\r\n\r\nWe recommend that you gain some experience in a classroom prior to interview, or starting the programme, if possible.  \r\n\r\n\r\n","status":1,"createdAt":"2021-07-06T10:53:16.641Z","updatedAt":"2021-09-10T13:59:59.021Z","canSponsorStudentVisa":"yes","cycle":"2024"}
