{"id":"7412cf4a-e4a4-4c92-9d0c-f95a8e31b019","name":"Primary","code":"D006","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"TA","fundingType":"apprenticeship","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"ff1c9965-2f88-4a43-be9c-3d829916b0f4","name":"Main Site","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"0bc173b7-6163-493a-968f-62c5301d1611","code":"1XW","name":"Primary Advantage"},"accreditedBody":{"id":"30bda414-7b00-426c-956b-18a187efe967","code":"L68","name":"London Metropolitan University"},"profPost":"PG","english":"1","maths":"1","science":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":null,"aboutCourse":"Primary Advantage Federation is seeking to appoint excellent applicants like you to train through the Post Graduate Teaching Apprenticeship route, Primary (Age 5-11) for the academic year 2021-22.\r\n\r\nThis route is provided in partnership with London Metropolitan University.\r\n\r\nThe Postgraduate Teaching Apprenticeship is a nationally recognised, work-based route into teaching; an alternative to a traditional full-time university course, offering participants a postgraduate-level qualification, no tuition fees, and the opportunity to earn while they learn.\r\n\r\nYou will benefit from a very strong support network which includes a London Met tutor, school mentors, and student peer group. Most importantly you will love working with our children. \r\n\r\nYou will be welcomed as a member of our staff in our schools on the first day of the school year and be completely immersed in your school, participating in all aspects of day to day life and working the full school year. You will be coached to teach whole classes from early on in your placement, with the guidance, nurture and  support of your class teacher. \r\n\r\nYou will have 20% guaranteed off the job training, split between university days and school-based training tasks. \r\n\r\nYou will be based and employed in your 'home' school from the start of the year, and be based in 1 main class for that year, where you will gradually take on teaching responsibilities, supported by the class teacher, your mentor.  \r\n\r\nHalf way through the year you will be placed in one of our other schools, gaining experience teaching in a different age phase. In the summer term you will return to your same class in your home school by which time you will be teaching that class the majority of the week.\r\n\r\nThroughout your year, your school-based mentors and university tutors will support you in the classroom. The latter will also teach your university sessions, ensuring there is continuity of support throughout your training. \r\n\r\nPrimary Advantage has an outstanding track record of supporting student teachers, and many of our previous trainees are now teachers and leaders in our schools.  As part of our programme, along with our other trainees, you will have additional training sessions with some of the best teachers in our Federation. We have found this creates a strong peer group which students find incredibly supportive and valuable. It also adds an important third dimension to your teacher training experience. \r\n\r\nFull course details can be found on:\r\nhttps://www.londonmet.ac.uk/applying/postgraduate/teacher-training/graduate-teacher-apprenticeships/ ","interviewProcess":"Interviews are currently online, though may be face to face later in the year.\r\n\r\nShortlisted applicants are invited to an online interview, initially with London Met, then, if successful, with Primary Advantage.  \r\n\r\nThe interview process will include a series of tasks aimed at assessing your ability and appropriateness for the course. This will include a presentation, an individual interview and a series of online and hand-written tasks to assess your basic maths and English skills. \r\n\r\nApprentices are subject to enhanced DBS checks and are required to make a declaration about any criminal convictions.\r\n\r\nOnce you have completed both university and school interviews, the university will confirm the decision through UCAS. If you are offered a place, they will email you to confirm how to meet any conditions of your offer.\r\n\r\nIf unsuccessful at this stage, you may also be offered an alternative route into teacher training.\r\n\r\nPlease note, if you receive an offer, the university will need to see originals of documents, qualification certificates etc. before you are able to enrol on the course.  If you do not have original certificates, you should apply early to get replacements. This can be a time-consuming process and might prevent you from joining the course if unsuccessful.\r\n\r\nFor any queries regarding your application contact the Admissions Office at London Met: ITT@londonmet.ac.uk\r\n","howSchoolPlacementsWork":"At your interview with us at Primary Advantage we try to match you with the school that best suits your needs and interests, and also try to place you in the age group of your choice, if you have a preference, though we cannot guarantee these preferences.\r\n\r\nYou will be placed at the start of the year in one of our schools which will be your main setting and you will rotate on placement to one of our other schools to experience different settings and key stages at certain points later in the year.  \r\n\r\nThroughout the year you will have plenty of opportunities to experience working with pupils at all key stages and learn from outstanding practitioners in different settings.","personalQualities":"Our schools are exciting places to work, filled with inquisitive children, supported by a community of diverse families and inspiring organisations, striving to ensure all children thrive. \r\n\r\nWe are looking for you to: \r\n \r\n-Be enthusiastic, hardworking and committed to supporting all pupils\r\n\r\n-Have  excellent organisational and interpersonal skills\r\n\r\n-Be open to developing  highly reflective practice\r\n\r\n-Have creative ideas with an ability to translate them into inclusive practice\r\n\r\n-Be  committed to improving student outcomes\r\n","otherRequirements":"This employment-based route into teaching is highly competitive and we are looking for high-quality graduates with previous work experience. Three years’ full time work experience in any field is desirable and ideally some experience in schools or with children.\r\n\r\nA minimum of 2 weeks’ classroom experience is usually expected, though in current times we understand this might not be possible to obtain.\r\n\r\nProficiency in English, confirmation you have the health and physical capacity to commence training, eligibility to work in the UK and an enhanced DBS certificate will also be required.\r\n","status":2,"createdAt":"2021-07-06T10:53:16.738Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024"}
