{"id":"4bfa9939-187a-423f-954a-64fa73278724","name":"Primary","code":"P658","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"8620cf94-dc93-4d9d-b578-971db0b80dd4","name":"Finham Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"e82c222f-d0c6-427c-a39f-30f380316dbe","name":"Park Hill Primary School","isPublished":"Y","status":"R"},{"id":"4d997fa3-a508-4f72-9223-d26d8da93d6c","name":"Moseley Primary School","isPublished":"Y","status":"R"},{"id":"ac3e608d-4307-4cfe-b48b-b9824ac5bea2","name":"Earlsdon Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"efdcc858-4ba9-4563-bae0-8dffed6351e1","name":"Templars Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"88a2e327-7375-409f-bfd8-16f3e12b7128","name":"Pearl Hyde Community Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"2107a9e1-f911-439c-a9e7-8a5692afc984","name":"Eastern Green Junior School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"9ce7da5f-fb81-45e3-a721-004fbb27d820","name":"Crackley Hall School","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"a6f3d97f-bfe0-4a8a-a4f0-1e40ab598574","code":"1K1","name":"The Lion Alliance"},"accreditedBody":{"id":"26797ebf-f835-47c8-9369-7d6d67fb2343","code":"C85","name":"Coventry University"},"profPost":"PG","degreeGrade":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We work with the University on a case by case basis.\n\nCoventry University accepts equivalency tests in English, Mathematics and Science from:\n* Equivalency Testing - www.equivalencytesting.com\n* A Star Equivalency - www.astarequivalency.co.uk","courseLength":"OneYear","feesUK":7500,"feeDetails":"You may be asked to pay for a DBS check by the University.","aboutCourse":"Please visit the Coventry University website for specific details of the course. \r\n[coventry.ac.uk]\r\n(https://www.coventry.ac.uk/study-at-coventry/faculties-and-schools/school-of-education-and-teaching/students/)\r\n\r\nThis course will develop you to teach in a Primary school (ages 5-11). During the Autumn Term you will be based full time in your school before moving to your complementary placement later in the year. We  offer a complementary placement to all trainees where you'll be able to experience a different Primary school within our Alliance - an invaluable experience when growing your understanding of different children and different settings. \r\n\r\nYour subject mentor and professional mentor in school will support and develop you into the best classroom practitioner you can be; you will observe lessons and gradually teach classes. There is a clear focus on reflecting upon your practice to identify ways to further develop. Throughout the training year you will be formally observed, supported to teach and contribute to the wider context of the school. For example you will also have a tutor/mentor group. In partnership with the University, we will assess your progress against the Teaching Standards and support you to meet these across the year. At university you will work in virtual subject groups and complete assignments as part of the course.","interviewProcess":"You will be asked to attend an individual, virtual interview with The Lion Alliance. This will last approximately 1 hour and during that time you will be asked to deliver a short lesson followed by a series of questions. \r\n\r\nYour panel will consist of the Head of the Lion Alliance, the ITT Lead from your chosen school and a subject representative from your chosen school. \r\n\r\nFollowing the interview you may be asked to complete a literacy and numeracy test. You may also be asked to visit your chosen school. \r\n\r\nFor more information about how to prepare please visit our website: \r\n[thelionalliance.co.uk]\r\n(https://thelionalliance.co.uk/home/itt-pgcewithqts-applications/)","howSchoolPlacementsWork":"During your training year, you will spend the majority of your time in one school and later in the year you will spend a shorter time in a second, complementary placement. This is to give you a contrasting experience of schools and an opportunity to work with different learners and different practitioners from different schools. \r\n\r\nWe have several Secondary and Primary school partners in our Alliance and are able to offer you the opportunity to really consider the school in which you’d like to spend your training year. On application you will of course select your preferred school and although these placements are subject to availability, the size of our Alliance means we can sometimes offer you a second school to consider if your first choice is full. \r\n\r\nPlease visit our website to see the list of our strategic partner schools: \r\n[thelionalliance.co.uk]\r\n(https://thelionalliance.co.uk/our-strategic-partners/)\r\n\r\nEach of our partner schools have a wealth of experience in their subject mentors. Please visit our website for more details:\r\n[thelionalliance.co.uk]\r\n(https://thelionalliance.co.uk/itt-pgcewithqts-whattoexpect/)\r\n\r\n\r\n","personalQualities":"Please visit our website for helpful questions to consider before applying:\r\n[thelionalliance.co.uk]\r\n(https://thelionalliance.co.uk/home/itt-pgcewithqts-applications/)","otherRequirements":"Ideally we like to see applicants who have some experience in a school setting or in working with young people. This could take the form of work experience/time spent in a school on an observation or voluntary basis or work with extra curricular groups or charity organisations, youth groups, etc.\r\nOf course, although relevant experience will support your application it is not a requirement.","status":1,"createdAt":"2021-09-15T12:27:46.339Z","updatedAt":"2021-10-01T13:23:33.176Z","canSponsorStudentVisa":"no","cycle":"2024"}
