{"id":"81bf38ef-a17e-4ab2-b1cd-a4800aa050c5","name":"Physics","code":"39PK","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"bf97cd0a-224c-43d3-a021-84143df13e8d","code":"F3","name":"Physics"}],"locations":[{"id":"981b9ae1-4f81-46b6-ab4d-8aba6a4c1860","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"},{"id":"fb423311-b338-4d35-b57a-f9868847070d","name":"Archbishop's School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"9bad52e5-8857-4b48-bac7-711949e57346","code":"1FO","name":"Canterbury Teaching Alliance"},"accreditedBody":{"id":"1165d5fd-11f4-4dab-99c9-47b309481463","code":"C10","name":"Canterbury Christ Church University"},"degreeGrade":"0","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feeDetails":"This fee is based on the figure for 2021-2022 and will be updated once the information for 2022-2023 has been released.  Bursaries are available subject to eligibility.\r\n\r\n","aboutCourse":"School Direct: Physics @ Simon Langton Girls' Grammar School\r\n\r\nThe Physics School Direct teacher training programme at Simon Langton Girls' Grammar School allows student teachers to train on the job in a supportive and well organised environment. We pride ourselves on our personalised professional development programme which will enable you to develop your strengths as a leader in the classroom. \r\n\r\nWe work together with Christchurch University to offer Qualified Teacher Status with the option of an add-on PGCE qualification (Post Graduate Certificate of Education). \r\n\r\nYou will spend the majority of your time at Simon Langton Girls' Grammar School.  A contrasting secondary school placement will be organised for a 6 week period, a primary school for 5 days and you will spend 15 study days at Christchurch University. \r\n\r\n","interviewProcess":"Potential applicants should apply through UCAS from October 2021.\r\nInterviews will be held at Simon Langton Girls' Grammar School for the post of School Direct: Physics\r\n","howSchoolPlacementsWork":"Your main base school will be Simon Langton Girls' School, where you will spend the majority of your time training on the job. \r\nA 6 week alternative school placement will be organised for you during your training year. This is to provide a contrast to your experience so far at Simon Langton Girls'. You will also complete 5 days in a primary school to aid your knowledge of the prior key stage and can also be organised by the school. \r\nAs we work with a range of schools in our partnership, it is very easy to organise a placement for you in a contrasting environment. \r\n","personalQualities":null,"otherRequirements":null,"status":1,"createdAt":"2021-07-06T10:50:11.139Z","updatedAt":"2021-07-06T14:10:38.794Z","canSponsorStudentVisa":"yes","cycle":"2024"}
