{"id":"e8767239-2b92-48a4-8add-718860e7fd9c","name":"Primary","code":"A659","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"860893f7-b1ad-448e-a6df-8392b255e0db","name":"Rutland","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"624b09d2-36f0-4d34-8d12-275d584d9442","code":"3N6","name":"The Rutland Learning Trust"},"accreditedBody":{"id":"d2b7d074-fac9-42c5-a0d3-d5471b35f7d9","code":"N91","name":"Nottingham Trent University"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We accept the GCSE equivalency taken via equivalencytesting.com or astarequivalency.co.uk.","courseLength":"OneYear","feesUK":9250,"feeDetails":"As a School Direct trainee, you will be entitled to the same financial support as trainees on other postgraduate teacher training courses.\r\n\r\nIf you are a UK or EU trainee, you should be eligible for a student loan, maintenance loan and maintenance grant to cover the cost of your study and will only start paying the loans back when you start earning over £21,000 per annum.\r\n\r\nYou may be eligible to receive a training bursary, dependent on the subject you train for and a degree classification.","aboutCourse":"This teaching degree’s structure is designed to meet the current and developing changes in primary schools in the United Kingdom. The module structure allows sufficient flexibility to address the planned governmental curricular changes, as well as reflect effective research based practice both nationally and internationally. It is vital that the entire primary curriculum is reflected across the course and is supported by a professional studies module and is closely linked to the professional placement. The course structure is designed to support trainees in the early stages of their career as well as providing a lasting support for their future careers.\r\n\r\nThe course’s four modules run concurrently throughout the year. With the exception of Primary Professional Practice, which is taught at level 6, each module is offered at either level 6 or Masters level.\r\n\r\nAt the end successful trainees will gain a PGCE qualification. \r\n","interviewProcess":"You will be invited to an interview with one of The Rutland Learning Trust partner schools as part of the selection process. At this interview, you will have an opportunity to take part in a number of school-based activities during a normal school day. They will include:\r\n\r\nAn opportunity to meet with the Team Leader and other colleagues\r\nTeach part of a lesson to a small group\r\nIndividual Interview\r\n\r\nYou will also be invited to a second interview at Nottingham Trent University.","howSchoolPlacementsWork":"The lead school organises your placements within either the Multi Academy Trust or any local school partners outside of our Trust.\r\n\r\nThe School Direct course is a flexible approach to teacher training. The majority of your time will be spent in the school, training in the classroom and being supported by experienced teachers and mentors. Trainees spend Fridays at the University.\r\n\r\nTrainees have a main base school where they spend 5 of their 6 terms training.  From January to February half term (Term 3) trainees are offered an alternative placement in an alternative key stage. ","personalQualities":"We are looking for hard-working individuals who want to develop and learn to support young people in their education.  Passion and enthusiasm are key to a successful career in teaching. ","otherRequirements":"You will need to complete a DBS criminal record check before starting on the course. ","status":1,"createdAt":"2021-07-06T10:51:32.281Z","updatedAt":"2021-10-04T11:06:44.298Z","canSponsorStudentVisa":"yes","cycle":"2024"}
