{"id":"d0390b8d-ec75-4a28-ac46-fb2f62be87fd","name":"Mathematics","code":"24BD","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"72345aa7-096c-488f-8649-085b8178cadb","code":"G1","name":"Mathematics"}],"locations":[{"id":"3e5fd1d3-d28f-4b0e-88bf-06f112a05ab4","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"5a4fec49-a7bb-4fb6-a805-0e18a8c1fd18","code":"1NA","name":"Beal High School (NELTA)"},"accreditedBody":{"id":"36425fae-da68-4e79-89de-8b41ea733c37","code":"K60","name":"King’s College London (University of London)"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":19800,"aboutCourse":"Located in the heart of London, PGCE courses at King’s are rated Outstanding by Ofsted with excellent tutors on hand to support you through your training. In the last research assessment exercise, the department was rated second in the UK (REF, 2014). You will have the opportunity to work with experienced tutors who are actively engaged in research in their subject and in pedagogy more widely. 94% of 2018 graduates who sought teaching posts were employed within 6 months of qualifying. In our 2019 student survey, 92% of trainees rated the quality of their training as very good or good.\r\n\r\nThe PGCE Mathematics is a full-time course that consists of four required modules and two blocks of teaching experience based in secondary schools within London and Greater London. You will complete the course within ten months, studying September to June. You must take modules totalling 120 credits to meet the requirements of the qualification. Two assessed pieces of coursework give you 60 Master’s-level credits – a third of an MA – which puts you well on the way to a Master’s degree in your chosen profession\r\n\r\nThe principle of the mathematics course at King’s is a view of teaching based on the process of planning ‐ teaching ‐ reflection. The process looks at relevant research, the principles of the mathematical topic which is being taught and links with other areas of the mathematical curriculum. In general mathematics sessions are workshops where we consider how to build upon pupils’ prior knowledge and address any misconceptions they might have. A sequence of lessons can then be planned to enable successful learning and teaching. Suitable responses from pupils are identified to assess their progress and understanding, and the effectiveness of the teaching approach used.\r\n\r\nAdditional areas covered in the mathematics programme include:\r\n\r\n-Growth mindset\r\n-Motivation and engagement\r\n-Mathematical modelling\r\n-Problem solving\r\n-Reasoning and proof\r\n-Assessment methods\r\n-Resources beyond textbook\r\n-Government initiatives\r\n","interviewProcess":"Before a place is offered all applicants will be invited for an interview. The interview is looking to see whether you have a reasonable understanding of mathematics for teaching pupils aged 11‐18 years, to see if you can communicate with an audience, to see that you have prepared yourself for taking a career move towards teaching and to look at your commitment to teaching. You will complete a written task and a mathematics task and an individual interview. The individual interview will explore your views about teaching in general and more specifically teaching some aspects of the secondary mathematics curriculum. \r\nDuring the individual interview and the mathematics task, we will be looking for:\r\n-An ability to explain concepts at a school level\r\n-How you engage with the audience\r\n-Understanding of the subject you wish to teach\r\n-Confidence\r\n\r\nIn your written task we will be looking for:\r\n-An ability to express yourself clearly\r\n-A considered view of the profession you wish to enter\r\n-Accurate grammar and spelling\r\n","howSchoolPlacementsWork":"You will have two different school placements during the course. Both placements will be at one of the lead school's (Beal High School) partner schools located in the London Borough of Redbridge.\r\n\r\nWe try to ensure that all trainees have a reasonable journey to school and to ensure that you have a balanced teaching experience including the full secondary age (11-18) and ability range.\r\n","personalQualities":"Personal qualities we look for include:\r\n-Commitment to teaching\r\n-Good communication skills\r\n-Potential to manage young people effectively\r\n-Ability to engage interest and communicate your own enthusiasm for mathematics\r\n-Commitment to working with young people\r\n-Ability to explain ideas clearly and to think on your feet\r\n-Evidence of good interpersonal skills\r\n-Awareness of current educational issues\r\n-Commitment to equal opportunities ","otherRequirements":"The Department for Education requires the Disclosure and Barring Service (formerly the Criminal Records Bureau) to vet the background of persons working in their schools. Candidates offered a place on a PGCE course will be asked to complete an enhanced check with the DBS to ensure they do not have a criminal background which might prevent them from working as a teacher. This must be completed before you register on the programme.\r\n","status":1,"createdAt":"2021-07-06T10:56:25.847Z","updatedAt":"2021-10-04T10:54:57.297Z","canSponsorStudentVisa":"no","cycle":"2024"}
