{"id":"dda761d2-9192-4643-91c9-878207806d75","name":"Geography","code":"24C3","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3f47e67b-7fa5-4947-a5a0-74d528cd2a87","code":"F8","name":"Geography"}],"locations":[{"id":"3e5fd1d3-d28f-4b0e-88bf-06f112a05ab4","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"5a4fec49-a7bb-4fb6-a805-0e18a8c1fd18","code":"1NA","name":"Beal High School (NELTA)"},"accreditedBody":{"id":"7f11aaed-7c3e-42c5-af7a-023d33b45fa3","code":"U80","name":"UCL, University College London"},"profPost":"PG","degreeGrade":"1","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":21600,"aboutCourse":"We are committed to delivering a comprehensive and bespoke training experience and supporting the development of the next generation of teachers and school leaders.\r\n\r\nThis programme is highly supportive of the realities of the modern classroom. \r\n\r\nYour training will be divided between time spent at UCL and teaching experience in local schools. During the placements you will gradually be introduced to teaching; spending some time observing lessons, working with small groups and individuals in the classroom, leading activities, team teaching and then building up to about 10 hours of whole class teaching per week. There is a comprehensive programme of mentoring, training and support delivered by the school and UCL.\r\n\r\nAs well as the school-based support from your subject mentor there is also a team of dedicated UCL tutors who will deliver training and fully support your school placement experience. \r\n\r\nThis course aims to prepare you to: \r\n\r\n* Become outstanding secondary school teachers \r\n* Become knowledgeable subject specialists who can support the leadership of curriculum development \r\n* Become good classroom managers \r\n* Become successful form tutors and collaborative colleagues. \r\n\r\n“UCL Institute of Education (IOE) is a global leader in teacher education.  Their programmes are recognised by Ofsted as “outstanding” in very criterion across Primary and Secondary Education.”\r\n\r\n\r\nAll UCL School Direct students have full access to UCL student support services and facilities.\r\n\r\nFull details of the PGCE programme can be found here [Teacher Training](https://www.ucl.ac.uk/ioe/courses/teacher-training).\r\n\r\nPlease use the search boxes provided to progress to more detailed information about the Geography programme. ","interviewProcess":"There will be two interviews\r\nOne will be at the lead school and if successful at the school interview you will be invited to a second-stage interview at UCL Institute of Education. At your interview day you will take part in a combination of group and individual interviews with members of the programme team, and may also be asked to undertake written or presentation tasks, depending on your subject. You will have the opportunity to ask questions and take a self-guided campus tour.\r\nThe interview process within school may include some or all of the following activities: \r\n\r\n* Subject knowledge activity (set before interview day) \r\n* Delivery of a half hour teaching activity to students \r\n* Written task\r\n* Interview by panel \r\n\r\nWe do not give automatic feedback to all candidates rejected at interview. This is due to the large numbers of interviews that we carry out and the additional workload involved in feeding back to candidates. \r\nWe recommend that you aim to gain some experience in a classroom prior to interview.\r\n","howSchoolPlacementsWork":"Most placements will be within our alliance of 14 secondary schools which includes community schools (maintained and academies), faith schools, boys and girls grammar schools and an independent school. We can also offer opportunities to complete some of your training in special schools or a 14-19 alternative provision to widen your experience of different learning environments.\r\n\r\nAll of our schools are geographically close, with most being within the London Borough of Redbridge which means that trainees can easily engage with more than one school in the partnership. We do look at home addresses and journey times when considering placements. \r\n\r\n\r\n\r\n\r\n","personalQualities":"We are looking for ambitious trainee teachers who are passionate and enthusiastic about their subject and have a desire to share that with young people of all abilities in the secondary age range. You need to want to make a real difference to young people’s lives. You should be resilient, have the potential to be able to communicate with an audience and be able to develop positive professional relationships with young people and colleagues. We want you to be able to continually reflect on their practice and respond positively to feedback. The best teachers are learners themselves.","otherRequirements":"For subject and phase requirements visit the relevant UCL page to check the “entry requirements” in the “key information” panel.\r\n\r\nConfirmation you have the health and physical capacity to commence training.\r\n\r\nA Disclosure and Barring Service (DBS) certificate\r\n\r\nWe recommend that you aim to gain some experience in a classroom prior to interview\r\n\r\nThe English language level for teacher training programme is Good. See UCL web site for details of accepted qualifications and grades.\r\n","status":1,"createdAt":"2021-07-06T10:56:26.025Z","updatedAt":"2021-10-04T11:12:54.657Z","canSponsorStudentVisa":"yes","cycle":"2024"}
