{"id":"c5e9283a-f4c1-450f-9303-043950e67e28","name":"Primary","code":"2S8T","qualification":"qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"c7b24d91-44f5-4cbe-9bc1-0180d81c5ae0","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"33bbde51-c9e1-4203-9682-b04ade9740e6","code":"2AO","name":"Growing Expert Teachers"},"accreditedBody":{"id":"be897ea1-5b41-4b40-8eaf-877a15ad688b","code":"S31","name":"Somerset SCITT Consortium"},"degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"Please contact Somerset SCITT to check on equivalency tests that are accepted","courseLength":"OneYear","feesUK":9250,"aboutCourse":"The School Direct programme involves both practical learning in school together with training at the SCITT headquarters in Somerset. The current training pattern is as follows:\r\n\r\n* First half of each term: Mon - Wed = school based; Thurs + Fri = training \r\n* Second half of each term: Mon - Fri = school based only\r\n\r\nThere are three main written assignments required of trainees over the course of the training period, including one that involves some action research. Full guidance and support are offered to trainees.\r\n\r\n \r\n\r\n","interviewProcess":"Candidates' applications are short-listed by Somerset SCITT. Successful candidates are then invited to interview. The selection process for this programme includes a group task with pupils, a presentation and a formal interview. \r\n\r\nThe interview panel consists of Headteachers from the Consortium and colleagues from Somerset SCITT. ","howSchoolPlacementsWork":"Trainees spend the majority of their teaching experience in one school (known as the host school) in one class or year group. During the Spring term, trainees have a second placement (known as Placement B) in a different school within the Consortium; this placement must be in a different Key Stage from the main placement.","personalQualities":"Candidates need to demonstrate their ability to 'hit the ground running' from Day 1. They need to be confident, highly motivated, organised and flexible. \r\n\r\nIdeally, candidates will be able to describe their relevant experience working with children, whether voluntarily or within a school context. ","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:48:17.673Z","updatedAt":"2021-11-17T09:12:59.474Z","canSponsorStudentVisa":"no","cycle":"2024"}
