{"id":"9fcc1d9d-83d3-4b1e-86db-d00752f414c9","name":"Primary","code":"D417","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"TA","fundingType":"apprenticeship","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"3e1dcc62-cc65-4f09-824b-12255d90f26e","name":"Elston Hall Primary School","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"3e12cc37-28f0-4b37-b77a-3b78044d48ba","code":"2JA","name":"Elston Hall Learning Trust (St Bartholomew’s Multi Academy Trust)"},"accreditedBody":{"id":"4da5abb2-b287-451e-8d75-c5b79e11c2bb","code":"W75","name":"University of Wolverhampton"},"degreeGrade":"0","english":"1","maths":"3","science":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"yes","courseLength":"4 terms","aboutCourse":"Elston Hall Learning Trust and St Bartholomew's Multi Academy Trust offers trainee teachers the unique opportunity to work and learn in a range of exciting and innovative primary schools within (Authority / region). The partnership between Trusts offers cultural and socio-economic diversity within its range of settings\r\nAll schools share a common ethos and approach to pedagogy, ensuring that pupils become confident learners achieving the highest standards possible with a core focus on:\r\n\r\n•\tLearning and Teaching policies built around the principles of AfL.\r\n•\tChildren as learners and their all-round development at the heart of all schools\r\n•\tThe quality of learner experience rather than coverage\r\n•\tPedagogy which views knowledge as something constructed by children not merely transmitted by teachers.\r\n\r\nBoth Lead schools - Elston Hall Primary School and St Bartolomew's CE Primary School are outstanding and along with the other good schools, have a proven track record of local school improvement.  We have an established background of working in partnership with Wolverhampton University, Local Authorities and importantly, each other. \r\nAcross the two Trusts we have many members of staff who provide specialist support in other schools:\r\n\r\n•\tOfSTED trained inspectors\r\n•\tHead Teacher consultants\r\n•\tFormer LA advisors and consultants\r\n•\tNational Leaders of Education (NLEs)\r\n•\tSpecialist Leaders of Education (SLEs)\r\n•\tNational Professional Qualifications (NPQs)\r\n•\tLocal Leaders of Education\r\n•\tAdvanced Skills Teachers\r\n\r\nWe are passionate about developing future leaders and believe that the ‘QTS Full time Teaching Apprenticeship’ offers an unrivalled opportunity for trainees to learn and develop in our vibrant schools. By working in schools across our Trusts, apprentices will experience a range of contrasting experiences that will make you highly sought-after in the current job market.\r\n\r\nOur excellent partnership with Wolverhampton University means that students will receive high-quality support. This will continue into your ECT induction period and throughout your career.  Staff are expert at meeting your needs and will ensure you receive outstanding CPD.\r\n\r\nWolverhampton University is one of the Midlands’ largest providers of teacher education.  Tutors are experienced teachers who have worked with our partnership and family schools for many years.\r\n\r\nOfsted say:\r\n'particularly effective in developing highly professional teachers with the skills to reflect critically on the quality of their teaching in order to improve it'\r\n'excellent reputation' \r\n‘Employment rates are high'\r\n","interviewProcess":"Applicants should apply through the new DfE 'Find postgraduate teacher training' service. The application will be jointly considered by the University and both Trusts. \r\n\r\nApplicants will be invited to interview and to complete a set of short professional scenarios involving reading, writing and numerical tasks. You may be asked to attend support sessions in English and Maths as one of the conditions of acceptance of the course. \r\n\r\nThose successful in audits and at interview will be required to meet enhanced DBS checks, fitness to teach and medical check and prohibition order check requirements. You will be expected to complete these forms once you have been successful and have a conditional offer. \r\n\r\nThe charge for the DBS is £44 and ID check is £6. \r\n\r\nAll offers will be made via UCAS.","howSchoolPlacementsWork":"There are five placement schools within the Elston Hall Learning Trust; four schools within the Wolverhampton area and one school within Walsall. The St Bartholomew's MAT is formed of seven schools; located across the Staffordshire district. Students can be placed in any of these schools across the two Trusts for their teacher training placements. \r\n\r\nPlacements will be within at least two of the schools. \r\n\r\nCandidates will teach pupils across the 3-11 age range and students will be based according to their suitability for the school/year group. \r\n\r\nAcross the year, we will endeavour to ensure students experience schools of varying sizes/profiles and different year groups/Key Stages. \r\n\r\nIt is the candidates’ responsibility to travel to each school and to the Wolverhampton University when required.","personalQualities":"We are looking for candidates with motivation, enthusiasm and a clear rationale for teaching. It is important that students are committed to teaching as a long-term career, and also hold the relevant academic profile and intellectual capacity. We would like candidates to have a strong subject knowledge, relevant school experience, and be responsible, open-minded and show a professional level of maturity. An awareness of contemporary educational issues would be an advantage. Effective spoken and written Standard English, having equal opportunities awareness and possessing appropriate ethics and values are also of prime importance.","otherRequirements":"Before taking up a place, all applicants must complete an enhanced Disability and Barring Service check, agree to abide by Wolverhampton University Code of Professional Conduct and Fitness to Practice and complete relevant checks to ensure they have the health and physical capacity to teach.  \r\n\r\nApplicants should have at least three years careers experience when applying for this route.\r\n\r\nExperience in a primary school may be set as a condition following interview.","status":1,"createdAt":"2021-07-06T10:54:55.662Z","updatedAt":"2021-09-30T13:55:10.664Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024"}
