{"id":"a0501b6b-1018-43ac-b3b4-c6caa6a770de","name":"Primary","code":"39KP","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"3e1dcc62-cc65-4f09-824b-12255d90f26e","name":"Elston Hall Primary School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"3e12cc37-28f0-4b37-b77a-3b78044d48ba","code":"2JA","name":"Elston Hall Learning Trust (St Bartholomew’s Multi Academy Trust)"},"accreditedBody":{"id":"c357e0fa-802e-471b-818a-d0cd1434f9cd","code":"B32","name":"University of Birmingham"},"profPost":"PG","degreeGrade":"0","english":"1","maths":"1","science":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"financialSupport":"Information about student support for postgraduate students at the University of Birmingham can be found at http://www.birmingham.ac.uk/students/support/index.aspx","aboutCourse":"Students on School Direct primary routes at schools partnered with the University of Birmingham will undertake a Postgraduate Certificate in Education with Qualified Teacher Status (QTS) which will provide 60 credits contributing to Master's level. \r\n\r\nAs part of the programme, students will spend around 26 timetabled days within the academic year at university. The remaining time during the academic year will be within the schools of the Elston Hall Learning Trust or St Bartholomew's Multi Academy Trust .\r\n\r\nFollowing successful completion of the 60 (level 7) credit PGCE (QTS) year, students may then opt to progress onto the Postgraduate Diploma in Teaching Studies and then the MA in Teaching Studies with the University of Birmingham. Students who have completed the 120 credit PGDipEd (QTS) year may progress directly onto the MA in Teaching Studies. \r\n","interviewProcess":"Applicants should apply through UCAS and the application will firstly be considered by the university. If a candidate passes this stage, they will then be invited to interview. This is likely to be held at one of the schools within the Elston Hall Learning Trust or St Bartholomew's Multi Academy Trust.\r\nThe interview process is likely to include a formal interview, a mathematics and English test, and may also include a school based task. \r\nThe interview panel will then make a recommendation to the University surrounding an offer. \r\nAll offers will be made via UCAS.  ","howSchoolPlacementsWork":"There are five placement schools within the Elston Hall Learning Trust and seven placement schools within the St Bartholomew's Multi Academy Trust.\r\nAs the placements will be across the two Trusts, students will have the opportunity to be placed any of these schools for their teacher training placements. \r\n\r\nCandidates will  teach pupils across the 3-11 age range and students will be based according to their suitability for the school/year group. \r\nAcross the year, we will endeavour to ensure students experience schools of varying sizes/profiles and different year groups/Key Stages. \r\n\r\nIt is the candidates responsibility to travel to each school and to the University when required. ","personalQualities":"We are looking for candidates with motivation, enthusiasm and a clear rationale for teaching. It is important that students are committed to teaching as a long-term career, and also hold the relevant academic profile and intellectual capacity. We would like candidates to have a strong subject knowledge, relevant school experience, and be responsible, open-minded and show a professional level of maturity. An awareness of contemporary educational issues would be an advantage. Effective spoken and written Standard English, having equal opportunities awareness and possessing appropriate ethics and values are also of prime importance. ","otherRequirements":"Before taking up a place, all applicants must complete an enhanced Disability and Barring Service check, agree to abide by the University of Birmingham Code of Professional Conduct and Fitness to Practice and complete relevant checks to ensure they have the health and physical capacity to teach.  \r\n\r\nExperience in a primary school may be set as a condition following interview.","status":1,"createdAt":"2021-07-06T10:54:55.633Z","updatedAt":"2021-09-30T13:01:58.670Z","canSponsorStudentVisa":"yes","cycle":"2024"}
