{"id":"c23fcec5-f1cc-4d16-ab6d-1a0a441cd987","name":"Primary","code":"N527","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"3e1dcc62-cc65-4f09-824b-12255d90f26e","name":"Elston Hall Primary School","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"3e12cc37-28f0-4b37-b77a-3b78044d48ba","code":"2JA","name":"Elston Hall Learning Trust (St Bartholomew’s Multi Academy Trust)"},"accreditedBody":{"id":"4da5abb2-b287-451e-8d75-c5b79e11c2bb","code":"W75","name":"University of Wolverhampton"},"degreeGrade":"0","english":"1","maths":"3","science":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","aboutCourse":"Students on School Direct primary routes at schools partnered with the University of Wolverhampton will undertake a Postgraduate Certificate in Education with Qualified Teacher Status (QTS) which will provide 60 credits contributing to Master's level. \r\n\r\nAs part of the programme, students will spend around 120 days on placement and typically 50 days at university. School placements will be within the Elston Hall Learning Trust and St Bartholomew's MAT. ","interviewProcess":"Applicants should apply through the new DfE 'Find postgraduate teacher training' service. The application will be jointly considered by the University and both Trusts. \r\n\r\nApplicants will be invited to interview and to complete a set of short professional scenarios involving reading, writing and numerical tasks. You may be asked to attend support sessions in English and Maths as one of the conditions of acceptance of the course. \r\n\r\nThose successful in audits and at interview will be required to meet enhanced DBS checks, fitness to teach and medical check and prohibition order check requirements. You will be expected to complete these forms once you have been successful and have a conditional offer. \r\n\r\nThe charge for the DBS is £44 and ID check is £6. \r\n\r\nAll offers will be made via UCAS.\r\n","howSchoolPlacementsWork":"There are five placement schools within the Elston Hall Learning Trust; four schools within the Wolverhampton area and one school within Walsall. The St Bartholomew's MAT is formed of seven schools; located across the Staffordshire district. Students can be placed in any of these schools across the two Trusts for their teacher training placements. \r\n\r\nPlacements will be within at least two of the schools. \r\n\r\nCandidates will teach pupils across the 3-11 age range and students will be based according to their suitability for the school/year group. \r\n\r\nAcross the year, we will endeavour to ensure students experience schools of varying sizes/profiles and different year groups/Key Stages. \r\n\r\nIt is the candidates’ responsibility to travel to each school and to the University of Wolverhampton when required.","personalQualities":"We are looking for candidates with motivation, enthusiasm and a clear rationale for teaching. It is important that students are committed to teaching as a long-term career, and also hold the relevant academic profile and intellectual capacity. We would like candidates to have a strong subject knowledge, relevant school experience, and be responsible, open-minded and show a professional level of maturity. \r\n\r\nAn awareness of contemporary educational issues would be an advantage. Effective spoken and written Standard English, having equal opportunities awareness and possessing appropriate ethics and values are also of prime importance.","otherRequirements":"Before taking up a place, all applicants must complete an enhanced Disability and Barring Service check, agree to abide by the University of Wolverhampton Code of Professional Conduct and Fitness to Practice and complete relevant checks to ensure they have the health and physical capacity to teach.  \r\n\r\nApplicants should have at least three years careers experience when applying for this route.\r\n\r\nExperience in a primary school may be set as a condition following interview.\r\n","status":1,"createdAt":"2021-07-06T10:54:55.697Z","updatedAt":"2021-09-30T14:03:11.115Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"Unqualified teacher rate -  school will pay fees for this course."}
