{"id":"c9635376-a256-4ca3-8092-57f2190a8711","name":"English","code":"2X9B","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3aed1aa8-ae46-4b68-92bb-a6cc20655c59","code":"Q3","name":"English"}],"trainingProvider":{"id":"ea707d39-b1cb-4826-a63b-e02e52c9c787","code":"2B8","name":"Thames Teaching Alliance"},"accreditedBody":{"id":"1165d5fd-11f4-4dab-99c9-47b309481463","code":"C10","name":"Canterbury Christ Church University"},"profPost":"BO","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feesInternational":14040,"feeDetails":"Fees are set by the university on an annual basis. This fee includes QTS and PGCE status.\r\n\r\nShould you decide to do QTS Only, the cost would be £5960\r\n\r\nThis is subject to change","aboutCourse":"This course is very much school based.  Our aim, is to make sure,  you will never feel alone, whilst training with us.  There will be trained Mentors both at the University and your host school  as well as the support from the  Thames Teaching Alliance.  All of whom will be there to guide you through your training.  \r\n\r\nYour training will begin in the summer term before your official September start date.  You will undertake an induction week where you will be able to get to know the teaching school staff and the other student teachers within the cohort.  You will also have time to work in your host school and start to understand those procedures.  Finally, we give you the opportunity to experience teaching outside of the phase in which you have chosen to start your career.  \r\n\r\nIn September, you will start at your host school.  You will receive  supported planning and assessment opportunities as swell as take part in staff training and development.  We expect our student teachers to take advantage of being part of all aspects of school life.  You will be assessed and reported on periodically, as well as being expected to complete a portfolio of evidence showing that you are able to teach effectively.  Your assessment will be based on those reports and your portfolio as well as your abilities in the classroom.  \r\n\r\nIn addition, you will receive 15 days of training at Canterbury Christ Church University.  The Thames Teaching Alliance also provides 10 days of training for you.  In  this way, we ensure that your subject knowledge, understanding of teacher theory and pedagogy are not neglected.  \r\n\r\nAt some point you will complete a 6 week second placement at a contrasting school, chosen for you depending on your needs at that time in your training.\r\n\r\nIf you choose to complete a PGCE as well as qualified teacher status, you will have further essays to do as well as additional costs to meet.","interviewProcess":"You will be contacted by a member of the Thames Teaching Alliance, once they have received your  application.  An interview will be arranged with your chosen school.  Interviews will vary between the heads of school's, however in all cases, you will be asked to prepare and present a short lesson (subject and key stage advised beforehand).  Canterbury also ask for you to complete their own Literacy and Numeracy tests.\r\n\r\n  Canterbury Christ Church University, no longer require to interview, but do hold the right to reject from your application.\r\n\r\nThe Alliance, has the responsibility to action your application within 40 days.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n","howSchoolPlacementsWork":"We work as a Teaching School Alliance collegiality with 20 schools across North Kent.  Our range of schools means that your placements can be very diverse.  We can offer placements at all kinds of schools, including:\r\n\r\nPrimary\r\n\r\n- 5-11 primary schools \r\n- infant schools\r\n- junior schools \r\n- special schools\r\n- schools in central Gravesend and Dartford\r\n- schools in the commuter belt villages around North Kent.\r\n\r\nSecondary\r\n\r\n- 11-16 mixed sex high schools\r\n- 11-18 single sex high schools\r\n- 11-18 special schools\r\n- 11-18 single sex grammar schools\r\n\r\nWe also have links to colleges, independent schools and pupil referral units for those students who have an interest in different kinds of educational experiences.\r\n\r\nWe select your second school to ensure you have a contrasting experience. We also consider your needs and make sure that the school will give you the opportunity to fill any gaps in experience or skills that you might have at that time.\r\n","personalQualities":"Being a teacher is not just about standing in front of a classroom reading from a book, we are looking for  individuals who have the enthusiasm, drive and patience to work with a variety of young people from various backgrounds and  who enjoy a challenge.\r\n\r\nTaking responsibility for your own development as a  teacher will give you the rewarding fulfillment, knowing that you have the potential to actually make a difference to a child's life.\r\n\r\n\r\n\r\n\r\n\r\n","otherRequirements":"Ideally we would like to see some relevant work experience with children or young people planned or undertaken when you apply to us.  On acceptance of post, we would strongly recommend time spent in your host school prior to commencement of start date. \r\n\r\nYou will be required to complete an enhanced criminal record check, barred list check and identity checks. \r\n\r\nWe will need to see any leave to remain documentation that might be applicable.  \r\n\r\nSchools will also ask you to complete an occupational health check. ","status":2,"createdAt":"2021-07-06T10:51:09.326Z","canSponsorStudentVisa":"yes","cycle":"2024"}
