{"id":"078c9b03-0c6a-4c44-a2db-4da400971547","name":"Computing","code":"E332","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"TA","fundingType":"apprenticeship","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"e6be6a9c-8696-4b88-8fbd-1ba1bef1b6fc","code":"11","name":"Computing"}],"locations":[{"id":"2474b509-189f-436a-a5aa-62e197181c75","name":"Nower Hill High School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"cc8fa7c1-63a8-42ed-8e7f-d086b58807fe","code":"1EF","name":"Harrow Collegiate Alliance"},"accreditedBody":{"id":"9188f17a-79c4-43a9-b459-4952815b739a","code":"M80","name":"Middlesex University"},"degreeGrade":"1","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Prior to enrolling on your teacher training course, you must have:\n* GCSE grade C / grade 4 or above in English and Mathematics or be retaking them this year.\n* We also accept the equivalency tests by [Equivalency Testing](https://www.equivalencytesting.com/), [A Star Teachers](https://astarequivalency.co.uk/) or any other appropriately accredited provider.\n* We cannot accept functional skills or key skills or IELTS.","courseLength":"OneYear","aboutCourse":"Our Computer Science Postgraduate Teaching Apprenticeship will equip you with the range of academic, professional and vocational knowledge, understanding, skills and values necessary to become a high quality and skilled teacher of the subject. You will learn to teach all aspects of computing, including computer science, digital literacy and information technology.\r\n\r\nThe programme aims to develop reflective and analytical skills as well as providing practical experience in planning effective lessons and learning strategies, hands-on classroom experience, and opportunities to further your own subject knowledge. \r\n\r\nYou will have the opportunity to interact with the latest specialist computer science and computing software and tools in schools in order to both increase trainees' knowledge of computer science, digital literacy and information technology, and support and enhance other aspects of teaching and learning in secondary schools.","interviewProcess":"If selected you would be required to attend an interview at the host school. This will include:\r\n\r\n* a tour of the school\r\n* literacy/numeracy tests\r\n* classroom/teaching exercise\r\n* panel interview\r\n\r\nYou may be asked to teach a short segment of a lesson, in which case full details will be provided in advance. Do not worry! This is an opportunity for us to see you in a classroom setting, and we are fully aware you may have had no previous teaching experience. The lesson may not go as planned, but it's important to be honest with your thoughts when we ask you about the lesson during the subsequent interview panel.\r\n\r\nFurther details of the interview structure will be emailed as part of your interview confirmation.\r\n\r\nIf you are successful at the school interview (Stage 1), our university partner will review your application and the interview paperwork before potentially ratifying the decision. Following a review of your application, the university may call you for Stage 2 of interview at the university if there are any aspects of your application that they wish to explore further (e.g. concerns over the extent of your subject knowledge).\r\n\r\nIf you are rejected at Stage 1 (school interview), we will contact you and upload the rejection to UCAS including reasons for the rejection that you (alone) would be able to see.\r\n\r\nIf you are rejected at Stage 2 (university interview), the university will get in touch to outline the reasons for their decision.","howSchoolPlacementsWork":"The Postgraduate Teaching Apprenticeship is an employment-based route offering you a way to qualify as a teacher while based mainly in a school. This course runs from June to the following July.\r\n\r\nThis programme is closely aligned to our PGCE and School Direct routes, meaning you benefit from high-quality central training, delivered by research-leaders and academics. You will have the opportunity to gain a postgraduate qualification, the PGCert Teaching, which can be used towards a Masters award in the future, enabling you to develop your skills for teaching and for understanding the interrelationship between learning and teaching, as you develop into a critically reflective practitioner.\r\n\r\nFrom the beginning, you will be treated like a member of the teaching staff by fellow professionals. Your subject mentors are experienced teachers and undertake rigorous training to develop their mentoring skills to support your teacher training. Your time in school provides you with the opportunity to develop your teaching expertise and relationships with young people in a familiar environment.\r\n\r\nDuring your first half-term you follow an initial programme of observations and research. This allows you to become familiar with the organisation and working of the school and department (e.g. student groups and pastoral systems, curriculum, methods of teaching, lesson planning etc.). You will co-teach elements of certain lessons, enabling you to become ready to take sole responsibility for a number of classes from September.\r\n\r\nYour training will be predominantly based at your host/employing school other than\r\n\r\n* every other Monday you will be at the university throughout the year\r\n* your second placement at another school for approx. 6 weeks in the second term\r\n\r\nYour shorter second teaching placement is intended for you to apply and develop your teaching whilst also widening your experience of the school system in a new context. You return to your host school after this placement.\r\n\r\nWhile in your host school and during your second placement, your university tutor will visit to monitor your progress and discuss your development with you and your mentors. You will maintain close links with your host school throughout the programme.","personalQualities":"You should be:\r\n* Enthusiastic about your subject;\r\n* Able to communicate clearly in written and spoken English;\r\n* Open to advice and positive professional criticism;\r\n* Diligent, organised, smartly dressed, punctual and committed to full attendance;\r\n* Able to shoulder individual responsibility and work collaboratively;\r\n* Committed to equal opportunities;\r\n* Willing to work with pupils beyond the school day.\r\n\r\nYou should also have:\r\n* Basic computing skills, with a commitment to developing these;\r\n* Good health, physical and mental;\r\n* A sense of humour;\r\n* A vision of teaching more than just giving information or crowd control","otherRequirements":"We strongly encourage you to undertake school experience observation in UK secondary schools before applying. Although this is not mandatory, this will enable you to explore your motivation to teach, and your understanding of what teaching is like, when you are discussing this at interview.\r\n\r\nThis school experience does not need to be in the school you are applying to, but should be in the subject you are planning to teach (or a closely-related discipline).\r\n\r\nAll teacher trainees will undergo an Enhanced Criminal Records check, Health checks and Prohibition to Teach checks. Further information can be obtained at interview.","status":1,"createdAt":"2021-07-06T10:48:45.368Z","updatedAt":"2021-10-05T10:27:32.963Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024"}
