{"id":"0d93c0ce-b925-46c3-8708-98f594d620d6","name":"Biology","code":"AT74","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"322cfc19-d51d-45db-91e3-bd7b4738470f","code":"C1","name":"Biology"}],"locations":[{"id":"2baaec82-4b22-4ffb-aaf8-84cba4a835c4","name":"Bentley Wood High School for Girls","isPublished":"Y","status":"R","vacancies":"F"},{"id":"2474b509-189f-436a-a5aa-62e197181c75","name":"Nower Hill High School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"cc8fa7c1-63a8-42ed-8e7f-d086b58807fe","code":"1EF","name":"Harrow Collegiate Alliance"},"accreditedBody":{"id":"9188f17a-79c4-43a9-b459-4952815b739a","code":"M80","name":"Middlesex University"},"degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Prior to enrolling on your teacher training course, you must have:\n* GCSE grade C / grade 4 or above in English and Mathematics or be retaking them this year.\n* We also accept the equivalency tests by [Equivalency Testing](https://www.equivalencytesting.com/), [A Star Teachers](https://astarequivalency.co.uk/) or any other appropriately accredited provider.\n* We cannot accept functional skills or key skills or IELTS.","courseLength":"OneYear","aboutCourse":"Are you passionate about inspiring young people to learn about diverse topics from the human body to the natural world? Then our Biology School Direct course is for you.\r\n\r\nThis course will help you to develop the professional skills and knowledge you need to teach all aspects of science to pupils at least up to age 16, as well as biology to pupils aged up to 18. We are committed to creative approaches to teaching science, and you will be encouraged to develop resources during the programme. You are working with experienced classroom practitioners, many of whom have experience in industry and are on hand to support you to develop your skills in planning, teaching and assessment.\r\n\r\nThe course begins with a stimulating mix of biology, chemistry and physics education. You will then focus fully on biology, allowing you to specialise in the teaching of this diverse and engaging subject at Key Stage 4.\r\n\r\nThe range of specialist science and teaching facilities in your host school and at Middlesex will provide you with a solid foundation on which to develop your skills and experience. We have excellent relationships with schools in and outside London and during your studies, you also will undertake teaching placements in at least two secondary schools and have the chance to acquire skills in the application of new technologies in teaching and learning. Schools are carefully selected to suit each individual and expose them to a variety of imaginative and thought provoking learning strategies. Key experts from our partner schools are on hand to offer invaluable mentoring and support.\r\n\r\nYou will acquire a critical understanding of current debates and issues relating to science education and, particularly biology, and we will guide and support you in developing your subject knowledge. You are expected to engage with reading and research in science education and to regularly reflect upon your own progress.\r\n\r\nThroughout the course you will learn how to:\r\n* develop the confidence and competence of all pupils in thinking scientifically\r\n* teach and assess pupils' understanding of the different branches of science\r\n* help pupils to develop as independent and collaborative learners\r\n* use practical exercises, Information and Communication Technology (ICT) and ‘the real world’ in the teaching of science.","interviewProcess":"If selected you would be required to attend an interview at the host school. This will include:\r\n\r\n* a tour of the school\r\n* literacy/numeracy tests\r\n* classroom/teaching exercise\r\n* panel interview\r\n\r\nYou may be asked to teach a short segment of a lesson, in which case full details will be provided in advance. Do not worry! This is an opportunity for us to see you in a classroom setting, and we are fully aware you may have had no previous teaching experience. The lesson may not go as planned, but it's important to be honest with your thoughts when we ask you about the lesson during the subsequent interview panel.\r\n\r\nFurther details of the interview structure will be emailed as part of your interview confirmation.\r\n\r\nIf you are successful at the school interview (Stage 1), our university partner will review your application and the interview paperwork before potentially ratifying the decision. Following a review of your application, the university may call you for Stage 2 of interview at the university if there are any aspects of your application that they wish to explore further (e.g. concerns over the extent of your subject knowledge).\r\n\r\nIf you are rejected at Stage 1 (school interview), we will contact you and upload the rejection to UCAS including reasons for the rejection that you (alone) would be able to see.\r\n\r\nIf you are rejected at Stage 2 (university interview), the university will get in touch to outline the reasons for their decision.","howSchoolPlacementsWork":"Your training will be predominantly based at the host school, your employing school other than\r\n\r\n* every other Monday you will be at the university throughout the year\r\n* your second placement at another school for approx. 6 weeks in the second term, i.e. after Christmas.\r\n\r\nThrough an initial programme of observations and research you will become familiar with the organisation and working of the school and department (pupil groups and pastoral systems, staffing, curriculum, resources, facilities, methods of teaching, lesson planning, and assessment).\r\n\r\nFrom the beginning, you will be treated like a member of the teaching staff by fellow professionals. With your departmental mentor and Professional Coordinating Mentor (PCM), you will feel supported as you progress and become ready to teach as the placement progresses. Our mentors are experienced teachers and undertake rigorous training to develop their mentoring skills to support your development as a teacher. Your time in school provides you with the opportunity to develop your teaching expertise and relationships with children and young people in a familiar environment.\r\n\r\nYour shorter second teaching placement is intended for you to apply and develop your teaching skills whilst also widening your experience of the school system in a new context. We would endeavour to ensure that this second school is one of our HCTSA partner schools but cannot absolutely guarantee this. Please be assured that the quality of the training will be quality assured by the HCTSA and the university. You return to your host school after this placement.\r\n\r\nWhile in your main host school and during your second placement, your university tutor will visit to monitor your progress and discuss your development with you and your mentors. You will maintain close links with your host school throughout the programme.","personalQualities":"You should be:\r\n* Enthusiastic about your subject;\r\n* Able to communicate clearly in written and spoken English;\r\n* Open to advice and positive professional criticism;\r\n* Diligent, organised, smartly dressed, punctual and committed to full attendance;\r\n* Able to shoulder individual responsibility and work collaboratively;\r\n* Committed to equal opportunities;\r\n* Willing to work with pupils beyond the school day.\r\n\r\nYou should also have:\r\n* Basic computing skills, with a commitment to developing these;\r\n* Good health, physical and mental;\r\n* A sense of humour;\r\n* A vision of teaching more than just giving information or crowd control","otherRequirements":"We strongly encourage you to undertake school experience observation in UK secondary schools before applying. Although this is not mandatory, this will enable you to explore your motivation to teach, and your understanding of what teaching is like, when you are discussing this at interview.\r\n\r\nThis school experience does not need to be in the school you are applying to, but should be in the subject you are planning to teach (or a closely-related discipline).\r\n\r\nAll teacher trainees will undergo an Enhanced Criminal Records check, Health checks and Prohibition to Teach checks. Further information can be obtained at interview.","status":1,"createdAt":"2021-07-06T10:48:45.120Z","updatedAt":"2021-10-05T10:22:20.006Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"The successful candidate will be paid a full-time salary by the employing host school on the non-qualified teacher pay range, at a level depending on your qualifications and experience.\r\n\r\nThe tuition fee for this course will be covered by the employing school.\r\n\r\nTrainees on salaried programmes are not eligible for bursaries or scholarships."}
