{"id":"3ce07259-329d-4024-9e64-73069928c0af","name":"Primary","code":"253H","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"trainingProvider":{"id":"93403f90-42d5-495f-b569-c58b45daebd7","code":"1R5","name":"Harvills Hawthorn Primary School"},"accreditedBody":{"id":"4da5abb2-b287-451e-8d75-c5b79e11c2bb","code":"W75","name":"University of Wolverhampton"},"profPost":"PG","english":"3","maths":"3","science":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"financialSupport":"\r\nOur HEI partner (The University of Wolverhampton),  have  a  financial support system and details of this can be found at the address below.\r\n\r\n(https://www.wlv.ac.uk/study-here/money-matters/financial-support/)","aboutCourse":"                     For 2021-2022 WTSA will be offering places in:\r\n                                 School Direct Tuition, Primary-PGCE.\r\n\r\nOur School Direct Tuition programme has been designed to ensure that our student teachers are expertly trained to take up posts as outstanding NQTs. \r\n\r\nCourse Overview:\r\n\r\n- an introduction to the course both at WTSA and the university\r\n\r\n- university taught sessions in all subject areas led by outstanding lecturers and staff members\r\n\r\n- WTSA led sessions on Professionalism and Well Being\r\n\r\n- university led assessments and accreditation \r\n\r\n- two main teaching placements in WTSA family schools (one in Key stage 1 and one in Key Stage 2)\r\n\r\n- additional experience in nursery and secondary settings\r\n\r\n- opportunities to enhance and further develop subject area knowledge (e.g. English, Maths, SEND, PE etc)\r\n\r\n- opportunity to experience teaching abroad\r\n\r\nIn School Experience:\r\n\r\n- student teachers know their first placement school from September\r\n\r\n- nursery, secondary and enhancement placements in schools and settings\r\n\r\nAccreditation and Assessment:\r\n\r\n- successful completion of the course will result in QTS and a PGCE with 60 Masters Level credits\r\n\r\n- assessment is through 5 masters level modules throughout the year (which includes your 2 teaching placements)\r\n\r\n- the modules are assessed by the University of Wolverhampton\r\n\r\n- each module is accessible via Canvas (Virtual Learning Environment) and the CANVAS app\r\n","interviewProcess":"Harvills Hawthorn Primary School is the lead school in WTSA and as such will be coordinating the recruitment process. \r\n\r\nIf shortlisted, applicants are not allowed to visit the school due to local restrictions in Sandwell due to Covid-19. However you will be invited into school at the earliest opportunity.\r\n\r\nThe interview process is likely to be done virtually. The interview panel will consist of headteachers and senior leaders from the alliance as well as a representative from the University of Wolverhampton.\r\n\r\n","howSchoolPlacementsWork":"Wednesbury Teaching School Alliance offers a School Direct Primary PGCE (age 5-11 years) . The student teachers will have the following placements in schools:\r\n- a placement in  Key Stage 1 for approximately 10 weeks \r\n- a placement in Key Stage 2  for approximately 13 weeks\r\n- a placement in a nursery setting for 1 week\r\n- a placement in a secondary school for 1 week\r\n- a placement in a school to further develop specific subject knowledge for 2 weeks\r\n\r\nOur School Direct partnership for 2021-2022 consists of local primary and infant schools:\r\n- all are either judged as good or  outstanding by Ofsted\r\n- all  are situated  in Sandwell  with the majority of them being situated in the  Wednesbury area itself\r\n- all have worked consistently and extensively with our PGCE programme over the past 6 years\r\n\r\nThis means that our student teachers do not have to travel far to benefit from the extensive training and teaching opportunities that we offer and that they are in schools that are vastly experienced in supporting the delivery of our PGCE programme.\r\n\r\n   \"I am so grateful for the sheer volume of people that I have been introduced to, and feel that I can call on for support as a result\"          PGCE \r\n                  ","personalQualities":"We are looking for student teachers who are:\r\n- committed to transforming the lives of the pupils that they teach\r\n-  genuinely passionate  about working with young children and have the drive and ambition to be an outstanding, innovative practitioner\r\n- striving to inspire the children that they teach\r\n- aware of current educational issues\r\n\r\n\r\nTime and time again, we find that the student teachers who stand out are those that have worked in, or undertaken voluntary experience in, a school.\r\n\r\n            \"Help develop the future in your local area.Train with WTSA\"\r\n                                                                PGCE 2017","otherRequirements":"'Safeguarding is everyone's responsibility'\r\n\r\nIf you are offered a place on the PGCE programme, the University of Wolverhampton will apply for a DBS check (Disclosure, Barring Service) on your behalf. This is a vital requirement for this programme.\r\n\r\nFor more information , please see:(www.gov.uk/disclosure-barring-service-check/overview)","status":2,"createdAt":"2021-07-06T10:54:35.360Z","canSponsorStudentVisa":"yes","cycle":"2024"}
