{"id":"c0a1f05e-aeac-48f9-9c1c-e196c7825bee","name":"Primary","code":"38SY","qualification":"qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"TA","fundingType":"apprenticeship","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"81f7fd23-410e-420d-b22b-57395c6448a0","name":"The Kingfisher School","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"9350f256-339d-4110-a60f-6fef570ee65e","code":"1Y6","name":"South Worcestershire and ITT Consortium"},"accreditedBody":{"id":"6019b3ce-f2f6-4b0e-b2a9-5813d74c4d54","code":"W80","name":"University of Worcester"},"english":"3","maths":"3","science":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Why train with us?\r\n\r\nSchool Direct Trainee- 2014-2015 \r\n\r\n‘This course surpassed my expectations and I have no regrets about choosing the Schools Direct route; it has fully prepared me to begin teaching and me confident in my ability to do so. The Schools Direct route has offered extensive support both within the school and at university and has allowed me to experience every aspect of school life.’ \r\n\r\nWorcester has an excellent reputation locally, nationally and increasingly internationally and attributes its growing success to: Highly relevant, very professional courses Excellent, inspiring teaching A truly friendly, inclusive approach with excellent student support and outstanding record of graduate employment. Excellent partner schools. \r\n\r\nThe PG Teacher Apprenticeships allows you train in your chosen school whilst also continuing to receive a salary.  You will also receive 20% off site training through the University of Worcester.  This programme is very similar to the School Direct Salaried route and also gives you Masters Credits.\r\n\r\nPG Teacher Apprenticeship Course features and Benefits.\r\n\r\n* An inspiring school based immersion model of Initial Teacher Education underpinned by the Professional Teaching Standards Parts 1 and 2. \r\n* You are part of the School community from Day 1, an early integration into school life. \r\n* An innovative and creative teaching programme with a clear focus inclusion for all with the Early Years and National Curricula. \r\n* Excellent student and academic support from the University Team including experts: in Phonics, Behaviour Management, SEND Sport and Disability. \r\n* A personalised training programme that meets individual trainees and school needs. \r\n* A programme underpinned by a clear focus on the theory of how children learn and the barriers that may affect them.\r\n\r\nThe PG Teacher Apprenticship route is underpinned by a coaching and mentoring model to ensure you receive the highest quality teacher training experience. Throughout your training you will have regular built in opportunities to observe and learn from outstanding teaching in a range of contexts. \r\n\r\nOur partner schools include a range of settings from rural to inner city. You will practice teaching in at least two schools and across two key stages based on your entry pathway. \r\n\r\nThe course is designed with periods in University developing a Masters' level understanding of the complex nature of teaching and learning, taught by expert University tutors and come together in peer group subject communities to reflect on your professional development.\r\n","interviewProcess":"The ITT programme is an intensive year, demanding full time commitment. Colleagues across the partnership will go the extra mile to support  trainees throughout the year so long as they demonstrate the commitment needed to succeed on the course. \r\n\r\nThe selection process is rigorous, robust and transparent and is designed to help us decide whether we believe you should train with us, and to help you decide if teaching is the right career for you. The interview is a 2 way process, teaching and the school has to be right for you and vice versa. \r\n\r\nApplication form.\r\n\r\nSubject and curriculum knowledge: \r\n\r\n*Strong subject-based academic background. \r\n*An awareness of current educational issues. \r\n*Familiarity with the curriculum for the relevant key stages. \r\n*Capacity to extend subject knowledge.\r\n\r\nAptitude for teaching. \r\n\r\n*A desire to teach and enthuse young people. \r\n*An awareness of the challenges of teaching and the training year. \r\n* Commitment. \r\n* Good written communication skills. \r\n*Good oral communication skills. \r\n* Team work. \r\n* An ability to engage young people in learning. \r\n* Adaptability. \r\n* Perseverance. \r\n* Professionalism. \r\n* Awareness of personal strengths and weaknesses \r\n\r\nOur Selection Process.\r\n\r\n* A lesson observation if appropriate. \r\n* A tour of the school. \r\n* Teaching task ( Where appropriate). \r\n* Subject Knowledge audit. \r\n*Formal panel interview. \r\n* A 5 minute presentation.\r\n* Group task to evaluate team work and communication skills. \r\n* Fitness to teach questionnaire.\r\n* Written task.\r\n","howSchoolPlacementsWork":"Teaching Practice and Partner Schools.\r\n\r\nWe work very closely with our outstanding partner schools to carefully craft inspiring and innovative initial teacher training programmes. The School Direct route is underpinned by a coaching and mentoring model to ensure you receive the highest quality teacher training experience. Throughout your training you will have regular built in opportunities to observe and learn from outstanding teaching in a range of contexts. \r\n\r\nOur partner schools include a range of settings from rural to inner city. You will practice teaching in at least two schools and across two key stages based on your entry pathway. \r\n\r\nThe course is designed with periods in University where you will: develop a Masters' level understanding of the complex nature of teaching and learning, be taught by expert University tutors and come together in peer group subject communities to reflect on your professional development as a trainee teacher. You will be allocated a personal Pedagogy and Management (PAM) tutor who will oversee your training journey and act as one of the key links in thi.\r\n\r\nIn each school you will be supported by a Lead Mentor, as well as your classteacher and University supervisory Tutor. Your progress will be supported and developed by this key team as part of a three way tripartite model, underpinned by professional dialogue between Trainee, School and University.\r\n\r\nYou will receive an inspiring range of additional professional development across your training for example Early Years conferences, training in Child Exploitation and Online Protection (CEOPS) trips and recognised external speakers. Your progress and development will be regularly reviewed with additional support and or enrichment and extension for high performing trainees. Throughout your training your Reflective Portfolio (RP) will enable you to gather evidence of your professional development against the Teaching Standards Parts 1 and 2 \r\n\r\n","personalQualities":"What We Are Looking For.\r\n\r\nInterest in and commitment to education and children.\r\n\r\nYou will need to be enthusiastic about working with children, and possess an ability to relate to them. On the course, you will be encouraged to develop good working relationships with teachers and their pupils. \r\n\r\nOral and written communication.\r\n\r\nCommunication skills are, of course, vital to the teacher's role and your skills will be developed through all course elements. \r\n\r\nInterpersonal skills.\r\n\r\nYou will need to work co-operatively on joint projects, work as a member of a team and accept the responsibility of leadership roles.\r\n","otherRequirements":"DBS Check.\r\n\r\nAll trainees need to have an enhanced DBS check prior to the start of the course. \r\n\r\nThe enhanced DBS check will be carried out by the Accredited Provider prior to commencing your training. You will be required to bring your DBS certificate to admissions at Prince Henry's and South Worcestershire SCITT along with proof of identity so that your DBS number can be recorded.\r\n\r\nFitness to Teach.\r\n\r\nThe DfE requires all trainees to satisfactorily complete a medical questionnaire to demonstrate their fitness to teach. This will we provided at interview if your application is successful.\r\n","status":2,"createdAt":"2021-07-06T10:55:29.728Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024"}
