{"id":"9520477f-4f39-4a28-9ff6-5ca8e55b5427","name":"Primary","code":"N222","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"344fb972-f539-484e-ab74-dbac12998ecf","name":"The Roseland Academy","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"99185cf6-08b6-4194-8ca4-626a89f3b107","code":"4B2","name":"The Roseland Academy"},"accreditedBody":{"id":"0f3abdaf-7b36-422e-a700-046f8a641c60","code":"C79","name":"Cornwall School Centred Initial Teacher Training. (Cornwall SCITT)"},"profPost":"PG","degreeGrade":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"All entrants must have achieved a minimum of a grade C/Level 4, or equivalent standard, in English, Science and Mathematics. Qualifications in key and functional skills at level 2 may represent the same level of attainment as GCSE grade C/Level 4 and above in the national qualifications framework (NQF). However, they are not equivalent to GCSEs in terms of content, and applicants with key and functional skills certificates but without GCSEs at grade C or above in English, Science and Mathematics are advised to take the equivalency tests. For equivalency information visit: www.equivalencytesting.com or www.3atutors.co.uk","courseLength":"OneYear","feesUK":9250,"feesInternational":9250,"financialSupport":"The Roseland Academy is a lead school for School Direct programme accredited by Cornwall SCITT. As such all the student teachers undertaking this course are highly likely to be eligible for Student Finance support. As part of our access to learning fund, we may be able to support those in financial hardship with course-related costs incurred during training. We also offer a termly contribution to all trainees with a household income lower than £25,000 as assessed by Student Finance.","aboutCourse":"The Primary course is a one year full-time course, which runs from September through to July and comprises of 11 weeks of centre based training spread throughout the year, leading to Qualified Teacher Status (QTS). Trainees also complete a Level 7 Postgraduate Certificate of Education (PGCE) alongside QTS. The course covers the age range 5 to 11 years although trainees also spend a short time in an EYFS class.\r\nThe centre based training sessions are delivered by a range of specialists including educational consultants, specialist teachers and headteachers. Most centre based training sessions take place at Primary Cornwall SCITT centre at Heartlands. Some sessions take place at a local outdoor education centre, in the woods and in schools.\r\n\r\nTrainees are assigned a trained school based trainer within each school that they are placed. This person is responsible for supporting and guiding the trainee’s professional development and ensuring that they have the opportunities that they need within the school.\r\nA trainee’s progress is assessed through regular formal and informal monitoring of teaching and written work.\r\nTraining in school progresses from observing and working alongside an experienced teacher to taking full responsibility, firstly for groups, and later for the whole class during the academic year. The course will produce qualified teachers who are competent and reflective across Key Stage 1 and Key Stage 2.\r\n","interviewProcess":"All applications are reviewed by our management team prior to selection: those successful will be invited to interview. Applicants will be asked to prepare several tasks, including a pre-interview subject knowledge audit and a short written reflection on an educational topic.\r\n\r\nAll candidates will be asked to deliver a short teaching episode to an interview panel of up to three people, including a member of the management team and a subject leader, with the panel assuming the role of learners. Following the teaching episode, the interview panel will discuss the application in greater detail, including reflections on school experience gained prior to interview, subject knowledge and preparedness to enter the teaching profession.  Candidates are also asked to bring a small portfolio of their design work, and samples of made products if suitable.\r\n","howSchoolPlacementsWork":"Your training will be organised into blocks of centre based and school based weeks, with the school based weeks developing sequentially as the terms and training year progress. You will have a dedicated course tutor and a school based mentor during this time. I addition, you will undertake the PGCE qualification. This allows you to embed theory and practice in a measured and manageable way, and develop in confidence as you progress towards your final assessment and, moving towards, your first employed post. \r\n\r\nWe aim to give student teachers a broad range of experiences during the course and aspire to offer contrasting placements. Student teachers will experience two school placements: either spending both placements within TRT schools, or alternatively, have the second placement in one of the Cornwall SCITT Primary’s partnership schools in Cornwall. Placements will focus on the 5-11 age range, but Early Years & Foundation experience will be gained in one of TRT placement, with an additional opportunity to participate in the transition process of Year 6 pupils into the secondary school, thus offering enhancement to develop understanding of Key Stage 3 context and curriculum. They will also explore how the SEND provision functions in the primary school settings.\r\n\r\nYou will be able to develop strategies related to the latest research.  When training with TRT you will also access the Trust-wide CPD. Whilst involved in your placement in the school you will be fully immersed in school life. The Roseland Academy is a designated Teaching School Hub for East Cornwall and you will be able to explore opportunities for your future development.\r\n \r\n \r\n\r\n","personalQualities":"\r\n•\tConvey commitment and enthusiasm to teaching in the primary age range.\r\n•\tArticulate clear and appropriate reasons for wanting to teach primary children.\r\n•\tHave a strong recommendation to train as a primary school teacher from an appropriate referee.\r\n•\tAwareness of current educational issues;\r\n•\tIntrinsic passion for learning;\r\n•\tCommitment to own professional development;\r\n•\tExcellent organisational, communication and interpersonal skills;\r\n•\tFlexibility and a willingness to act upon advice;\r\n•\tEmotional and physical resilience \r\n\r\n","otherRequirements":"As part of our commitment to safer recruitment, all successful candidates will undergo the full range of safeguarding checks, including their health & physical capacity to teach.\r\nFor those who have spent more than 3 months working or living abroad you may be required to gain a letter of good conduct or a workplace reference.\r\nWe are expected to make an assessment of fundamental English and mathematics knowledge before QTS is awarded. Any work to address shortfalls in English and mathematics must be undertaken by the trainee teacher in addition to other aspects of their training.\r\n","status":1,"createdAt":"2021-09-29T18:55:03.579Z","updatedAt":"2021-10-01T10:13:30.470Z","canSponsorStudentVisa":"no","cycle":"2024"}
