{"id":"1862d79d-d8a8-48a1-9fc7-7a2159adef5c","name":"Primary","code":"3DFY","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"37ca5b20-9dda-4499-aa63-165138c4f8d0","name":"North Essex Teacher Training","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"720f43e5-52a2-4475-be16-f4dddf9c945c","code":"2L4","name":"NETT"},"accreditedBody":{"id":"389953cd-bd3c-4ec9-a3f0-676acb78e274","code":"N46","name":"North Essex Teacher Training (NETT)"},"profPost":"BO","degreeGrade":"1","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We accept equivalencies from:\nwww.equivalencytesting.com\nand\nwww.astarteachers.co.uk","courseLength":"OneYear","feesUK":8900,"aboutCourse":"NETT (Primary) offers a full time, one year course leading to the award of Postgraduate Certificate of Education (University of Suffolk) with Qualified Teacher Status (QTS).  There is an option to opt out of PGCE and take a QTS only route.\r\n\r\nThe rigorous and relevant school-based programme has been developed by a group of Headteachers in the Tendring area and includes significant school experience, block teaching practices, training and tutorials. The majority of training sessions are delivered at the NETT centre, using other partnership school venues as appropriate. School experience and teaching practices take place in two different schools within the local area. There is a choice of age range: Pathway One 3-7 years (Early Years and Key Stage 1) and Pathway Two 5-11 years (Key Stages 1 and 2).\r\n\r\nPlease note this course is the same as course 33KX on North Essex Teacher Training (NETT).","interviewProcess":"1. Short listing\r\n\r\nApplications are first checked against the NCTL criteria for entry to ITT. We look for your experience in a primary school and/or working with primary aged children;\r\n\r\n2. Interviews\r\n\r\nThe interview consists of a presentation; a practical teaching task with a group of children; a written evaluation of this activity; a formal interview; a written task and a maths test. We are looking for potential to teach; an understanding of the physical and emotional demands of the job (as well as the intellectual capacity needed); and your availability and commitment to the full SCITT programme.\r\n\r\nFinal Selection\r\n\r\nOur decision to offer you a place is made based on recommendations from all members of the partnership involved in the interview process. You are selected on your merit, taking into account all elements of the selection process.","howSchoolPlacementsWork":"During the Autumn Term, trainees move through a sequence of graduated teaching and learning experiences: observations: one to one work with pupils: group work; collaborative planning and teaching with a Mentor: and finally supervised whole class teaching. The pace of this progression is adjusted according to the trainee’s perceived strengths and needs. By the end of the Autumn Term, all trainees will have taught a number of whole lessons in readiness for the Spring Term.\r\n\r\nDuring the Spring Term placement, trainees are expected to take an active role involving whole class teaching and to record development in key areas. It is expected that during the block practice, trainees will teach and plan for approximately 50% of a teacher’s normal workload.\r\n\r\nDuring the second block practice in the Summer Term the teaching timetable increases to 80% of a primary school teacher’s timetable. The other 20% is made up from PPA time: observing good practice and completing final tasks. By this point in the course, it is necessary to consider new challenges e.g. trainee’s involvement in after-school clubs, community work, organising visits. The need to consolidate experience is vital, yet this placement should not become a plateau of learning.","personalQualities":"We look for a commitment to lifelong learning, a sense of humour and a genuine ability to engage in the reflective processes required.\r\n\r\nWe would expect all applicants to have had a minimum of 10 days experience in a school setting before interview. Clear evidence for this should be included on the application form. We reserve the right to offer a place subject to gaining more primary school experience prior to the start of the course.","otherRequirements":"In order to be accepted onto the course you will also need to meet these criteria:\r\n\r\nsatisfied the entry qualifications as set out in the NCTL ITT Criteria;\r\n\r\n* presented evidence of a satisfactory enhanced level DBS check; and\r\n\r\n* had a satisfactory medical check.","status":1,"createdAt":"2021-07-12T13:49:14.466Z","updatedAt":"2021-09-21T12:05:15.361Z","canSponsorStudentVisa":"no","cycle":"2024"}
