{"id":"283cf7d7-fc0e-49eb-ac20-c608fdd6244b","name":"Physical education","code":"H953","qualification":"pgce_with_qts","startDate":"2024-07-31T23:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"74d64a54-5e34-4590-b6c7-528dd0cf26fe","code":"C6","name":"Physical education"}],"locations":[{"id":"d2ab308d-dbb3-4195-9a11-ff9b685a0f84","name":"The Corley Centre","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"5d7930d7-6afb-4f30-ad36-5f0c54a181ec","code":"1CM","name":"Sherbourne Fields School"},"accreditedBody":{"id":"ef09ce50-ccfc-4346-a0ce-43e840153dab","code":"W20","name":"The University of Warwick"},"profPost":"PG","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","aboutCourse":"About the Placement:  Corley Centre is a secondary special school for children with complex social and communication difficulties. A significant number of students have an autism diagnosis.  Student attainment covers the full National Curriculum and GCSE/vocational range. \r\n\r\nThe school was awarded Autism Accreditation from the National Autistic Society in 2018.  The school has recent success both in teacher training and subsequent NQT support.  Our 2018 Schools Direct Trainee was awarded the Warwick University Ann Barnes Memorial Prize for Inspirational Teaching.\r\nWe are seeking a trainee PE teacher to join an outstanding department consisting of two specialist PE teachers and two specialist PE TAs. Training opportunities will involve all key stages and the full ability range. The opportunity will be available to support the delivery of KS4 BTEC Sport as well as a number of Enrichment activities and work alongside community based sports coaches.\r\nThe trainee will work collaboratively with staff to develop their skills in delivering quality provision, contributing to our drive to close attainment gaps and improve Key Stage 4 outcomes across the whole curriculum. PE and Sport are vital elements of our curriculum; PE staff are fundamental in supporting students’ personal development and wellbeing, as well as their sporting and academic progress.\r\n\r\nWe are looking for a trainee teacher who is committed to improving outcomes for children by continually striving to adapt provision and delivery to meet need, someone who will be prepared to self-reflect and work collaboratively with others to improve their practice to develop into an outstanding practitioner.\r\n\r\nOur students are a credit to our school and bring with them a wide variety of needs, abilities, aspirations and behaviours; they provide both inspiration and challenge.  \r\n\r\nAdditional information about Corley Centre can be found at www.corleycentre.co.uk, including the school’s 2017 Ofsted Inspection Report.\r\n","interviewProcess":"Interview process\r\n•\tApplication forms are considered by both Corley Centre and the University of Warwick.\r\n•\tAll successful applicants will have an interview at both Corley Centre and the University of Warwick. The Corley Centre interview will consist of:\r\no\ta written task to assess understanding of a relevant issue and a candidate’s standard of written English\r\no\tan interview with a group of students\r\no\tthe leading of a short teaching and learning activity (pre-provided) with a small group of students\r\no\ta formal interview \r\n•\tApplicants should be able to demonstrate:\r\no\tprofessionalism\r\no\tcommitment\r\no\thigh level interpersonal skills\r\no\ta realistic understanding of the pressures of the course and the profession\r\no\tsome awareness of Corley Centre and the needs of its students\r\no\tcreativity\r\no\torganisational skills\r\no\tability to remain calm when under pressure with a measured response to challenging events\r\no\tability to listen to and act upon constructive advice and self-reflect to improve practice\r\n","howSchoolPlacementsWork":"Each trainee will have one placement during their School Direct year. Our  school mentor will find a suitable placement on your behalf. \r\n\r\nComplimentary School placements usually take place at one of our neighbouring schools. The average distance for each candidate to travel is approximately 2 miles. \r\n","personalQualities":"•\tClear understanding of the education system in England and of what good teaching involves\r\n•\tRecognition that the job of the teacher is first and foremost that of teaching and that the understanding of the pedagogy of teaching and learning is essential\r\n•\tHigh level of sport ability together with knowledge of PE as a subject, with full commitment to further developing this knowledge base\r\n•\tInterest in and some understanding of special educational needs\r\n•\tInterest in and some understanding of autism education\r\n•\tAbility and willingness to self-reflect and work collaboratively with others to improve own performance\r\n","otherRequirements":"","status":2,"createdAt":"2021-07-06T10:55:56.508Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"The School Direct Trainee salary is on the Unqualified teacher Pay Scale - usually Scale Point  1 at £17,682.00, plus 1 SEN point at £2,209.00."}
