{"id":"4935b426-d81e-4ad8-9518-9d9c36eefb78","name":"English","code":"4R01","qualification":"pgce_with_qts","startDate":"2024-07-31T23:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3aed1aa8-ae46-4b68-92bb-a6cc20655c59","code":"Q3","name":"English"}],"locations":[{"id":"b214c960-0432-4983-a401-316c483c9346","name":"Woodfield School","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"5d7930d7-6afb-4f30-ad36-5f0c54a181ec","code":"1CM","name":"Sherbourne Fields School"},"accreditedBody":{"id":"ef09ce50-ccfc-4346-a0ce-43e840153dab","code":"W20","name":"The University of Warwick"},"profPost":"PG","english":"3","maths":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":null,"financialSupport":"The successful applicant will be paid as an Unqualified Teacher on the Unqualified Teacher pay scale (UQT point 1 =  £21,582, plus 1 SEN point at £2,270). \r\n ","aboutCourse":"We are looking for a trainee teacher who is committed to improving outcomes for children by continually striving to adapt provision and delivery to meet need, someone who will be prepared to self-reflect and work collaboratively with others to improve their practice to develop into an outstanding practitioner.\r\n\r\nOur students are a credit to our school and bring with them a wide variety of needs, abilities, aspirations and behaviours; they provide both inspiration and challenge.  \r\n\r\n","interviewProcess":"Interview process\r\n•\tApplication forms are considered by both Woodfield School and the University of Warwick. The interview will consist of a formal interview \r\n\r\nApplicants should be able to demonstrate:\r\no\tprofessionalism\r\no\tcommitment\r\no\thigh level interpersonal skills\r\no\ta realistic understanding of the pressures of the course and the profession\r\no\tsome awareness the needs of its students\r\no\tcreativity\r\no\torganisational skills\r\no\tability to remain calm when under pressure with a measured response to challenging events\r\no\tability to listen to and act upon constructive advice and self-reflect to improve practice\r\n","howSchoolPlacementsWork":"Each trainee will have one placement during their School Direct year. Our  school mentor will find a suitable placement on your behalf. \r\n\r\nComplimentary School placements usually take place at one of our neighbouring schools. The average distance for each candidate to travel is approximately 2 miles. \r\n","personalQualities":"\r\n•\tRecognition that the job of the teacher is first and foremost that of teaching and that the understanding of the pedagogy of teaching and learning is fundamentally essential\r\n•\tA solid knowledge of the academic subjects of English Language and English Literature, with full commitment to further developing this subject knowledge base\r\n•\tAn interest in and some understanding of special educational needs\r\n•\tAn interest in and some understanding of autism education\r\n•\tAbility and willingness to self-reflect and work collaboratively with others to improve own performance\r\n•\tInterested in involvement in the extra-curricular life of the school.\r\n\r\n","otherRequirements":"","status":2,"createdAt":"2021-07-06T10:55:56.473Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"Salary will be paid on the Unqualified Teacher Pay Scale along with 1 SEN point. "}
