{"id":"b3ea3e06-b1f6-4b1b-b73d-2022935b7418","name":"Primary","code":"33NQ","qualification":"pgce_with_qts","startDate":"2024-07-31T23:00:00.000Z","applicationsOpenDate":"other","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"3_to_7","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"b4952c00-4ff9-4ad6-9203-6c4e09f54901","name":"Main Site","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"5d7930d7-6afb-4f30-ad36-5f0c54a181ec","code":"1CM","name":"Sherbourne Fields School"},"accreditedBody":{"id":"ef09ce50-ccfc-4346-a0ce-43e840153dab","code":"W20","name":"The University of Warwick"},"profPost":"PG","degreeGrade":"1","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"no","courseLength":"OneYear","feesUK":null,"aboutCourse":"You’ll be part of a school based teaching team from the very start; receiving intensive support from experienced teachers and mentors. \r\n\r\nYou have the opportunity to become immersed in school life through your training year, which means when you begin your first job as a teacher you are better prepared for life in school. \r\n\r\nYou will access an outstanding academic programme of study at the University of Warwick which will support you to understand the theory behind teaching whilst developing and practicing your skills in an all age special school.\r\n\r\nSherbourne Fields School Direct Partnership is made up of a wide range of special schools from across Coventry. We work together with the University of Warwick, to offer the best possible teacher training experience.  Our strong partnership represents a mixture of large and small special schools. Through the training year we make full use of the strengths of our partnership and offer trainees access to a wide range of experiences and learning opportunities. \r\n\r\nThis is an exciting opportunity as we continue to develop our nurture provision to ensure our students have inclusive access to a broad and balanced curriculum, aimed at enhancing their literacy, numeracy and life skills, as well as their citizenship and understanding of the world around them, so maximising their employment opportunities as adults. \r\nOur nurture provision emulates a primary school model, including the curriculum; largely built around Cornerstones and incorporating students’ individual interests.  Creativity and differentiation are essential elements of our teachers’ planning.  \r\n\r\nSupport will be provided throughout the year from a range of trainee teacher coaches, with direct support and guidance from our nurture specialists and SENCo.  \r\n\r\nWhilst the course is a salaried placement, the successful applicant will be expected to pay their own tuition fees (£2k). \r\n\r\n\r\n","interviewProcess":"Interviews are completed by a panel of three people - this includes the Headteacher and Deputy Headteacher. \r\n\r\nYou will only be required to attend one interview. As part of the interview process you will be required to teach a class of students whilst being observed. Information on the lesson will be given to you prior to the interview taking place. ","howSchoolPlacementsWork":"Each trainee will have one placement during their School Direct year. Our  school mentor will find a suitable placement on your behalf. \r\n\r\nComplimentary School placements usually take place at one of our neighbouring schools. The average distance for each candidate to travel is approximately 2 miles. \r\n","personalQualities":"We are looking for a creative, inspirational, enthusiastic and imaginative class teacher, who can teach a broad range of students with special needs across our school.\r\n\r\nWe are looking for someone who is excited about trying different teaching methods: someone who is able to think outside the box in order to reach and bring out the very best of our students. A person who can excite and empower our students and bring the classroom environment to life. The successful candidate will be energetic and passionate about their chosen career. \r\n","otherRequirements":"A minimum of 3 years SEN classroom experience is required for the salaried route. ","status":1,"createdAt":"2021-07-06T10:55:56.436Z","updatedAt":"2022-01-10T13:17:50.340Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","applicationsOpenDateOther":"2022-01-17T00:00:00.000Z","salaryDetails":"The School Direct Trainee salary is on the Unqualified teacher Pay Scale - usually Scale Point  1 at £17,682.00, plus 1 SEN point at £2,209.00."}
