{"id":"c0875d3b-2927-42f0-83cf-ab2462054b79","name":"Mathematics","code":"2XKX","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"72345aa7-096c-488f-8649-085b8178cadb","code":"G1","name":"Mathematics"}],"locations":[{"id":"2a42b212-1547-46b9-a5c3-dd85181ff313","name":"Brentside High School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"6adeae9e-c30b-4062-8fae-333f7a8a929c","code":"1KV","name":"Teach West London Teaching School Hub"},"accreditedBody":{"id":"ef172d85-20e4-4aa2-96d0-9e3ae81f526d","code":"S64","name":"St Mary’s University, Twickenham"},"profPost":"BO","degreeGrade":"1","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Unfortunately we don't offer equivalency tests, but our university partners may do, although this may be at a cost to the candidate.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Brentside High School is a popular and oversubscribed secondary school with a sixth form. We have 1400 students, serving an ethnically diverse community. Approximately 60 languages are spoken by the students at Brentside; we are proud of our inclusive community where students and staff learn and achieve together.\r\n\r\nOur vision is that Brentside High School challenges everyone to achieve excellence as lifelong learners  no exceptions, no excuses  and this permeates everything we do. In 2014 we were recognised by the Minister of State for Schools as one of the top 56 performing schools in England. Value added scores are consistently high and progress measures in English, mathematics, the EBacc and best 8 GCSEs are well above national averages. Students 'are extremely complimentary about their school and the staff who work with them. They want to do well, regularly attend and work hard.' (Ofsted 2016)\r\n\r\nThe School Direct Maths programme at Brentisde High School begins in September 2022. Upon successful completion of the training programme in summer 2023, you will gain a Postgraduate Certificate in Education (PGCE), as well as Qualified Teacher Status (QTS).\r\n\r\nAll schools in the Teach West London Ealing secondary partnership are highly supportive and inspirational environments where you will develop the necessary skills and acquire a true appreciation of the practice essential for outstanding teaching and learning. You will learn your craft in a safe environment which allows you to experiment with teaching styles, strategies and ideas.\r\n\r\nYour training will be delivered by expert teachers within the school. You will participate in weekly professional development sessions which will cover a wide range of topics and school policies which will be of use to you in your subject area and in the school as a whole. You will also attend Alliance-wide Golden Day  training events along with fellow trainees. Your school-led training will be complemented by attendance at St Mary's University.\r\n\r\nYou will be assigned an experienced mentor from within your subject area at Brentside who will support you in your development over the course of what will be a challenging and rewarding year. All mentors are excellent teachers who are well-trained in mentoring, coaching, lesson observations and feedback skills. You will also work closely with a member of the Senior Leadership team who will oversee your training and will provide an invaluable perspective on your role as a teacher and the wider issues of education leadership.","interviewProcess":"Shortlisted applicants should expect to first attend an interview at St Mary's University. \r\n\r\nIf successful, applicants will then be invited to an interview at school and to take part in some or all of the following activities: a presentation; a written task; small group teaching; curriculum discussion and an interview. You will be told in advance if you are required to prepare a presentation or to teach. \r\n\r\nIt is a rigorous and thorough process designed to ensure successful applicants are well placed to succeed.\r\n\r\nPlease note that we recruit on a rolling basis and usually offer only one position per subject area (unless otherwise stated). We suggest that you apply early as popular subjects are filled quickly.\r\n","howSchoolPlacementsWork":"As well as your main training placement at Brentside High School, you will complete a six-week placement in a contrasting context within Ealing.\r\n\r\nThis will afford you the opportunity to experience working with different students, within different structures and with a wider range of colleagues.","personalQualities":"We seek to appoint applicants who exhibit a passion for and excellent knowledge of their subject and a commitment to the education of all young people. \r\n\r\nIt is anticipated that all successful applicants will participate fully in the life of the school and therefore it is essential that trainees are very well organised, hardworking and enthusiastic. \r\n\r\nWe look to appoint those with the potential to become outstanding teachers, with this in mind, it is crucial that applicants are resilient, reflective and responsive to advice.\r\n","otherRequirements":"School experience is also essential if you are interested in applying for School Direct at one of the Teach West London Ealing secondary partnership schools. We prefer that candidates have up to 10 days of recent experience in a UK school. If you have arranged some classroom experience but it is yet to take place, please make a note of this in your application.\r\n\r\n","status":1,"createdAt":"2021-07-06T10:50:01.339Z","updatedAt":"2021-10-06T13:02:36.302Z","canSponsorStudentVisa":"yes","cycle":"2024"}
