{"id":"f9476280-42ac-4e66-8cb9-562fc6f1bf60","name":"Chemistry","code":"3CSX","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"912d4fb4-761b-42e9-8dc6-e968b791ea4e","code":"F1","name":"Chemistry"}],"locations":[{"id":"d3dac17d-0697-49b4-9002-4eb2fab48aa8","name":"Ealing Fields High School","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"6adeae9e-c30b-4062-8fae-333f7a8a929c","code":"1KV","name":"Teach West London Teaching School Hub"},"accreditedBody":{"id":"ef172d85-20e4-4aa2-96d0-9e3ae81f526d","code":"S64","name":"St Mary’s University, Twickenham"},"degreeGrade":"1","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We do not offer equivalency tests ourselves, but our university partners may do although these may be at a cost to the candidate.","courseLength":"OneYear","aboutCourse":"Ealing Fields High School joined the highly successful Twyford CoE Academies Trust in September 2017. It is a flourishing comprehensive school with a small, family-feel. The school opened in September 2016 for its first 120 students and is now at full capacity with years 7 to 11. The school supports its students to make exceptional progress through its innovative curriculum design; students study EBAC subjects every morning and then have extended lessons in the afternoon focussing on the more practical and creative areas of the curriculum.  In 2021 the first year of students sat their GCSEs with 81% achieving grade 5+ in English and Maths. \r\n\r\nThe Trust's ethos is strongly and distinctively Christian, with an emphasis on developing socially responsible individuals with a sense of their own capacity to do and be good.  The Twyford Trust prides itself on embracing 'life lived to the full' - a Christian-based concept it has developed as the 10:10 ethic.\r\n\r\nThe School Direct Chemistry programme at Ealing Fields begins in September 2022. Upon successful completion of the training programme in summer 2023, you will gain Qualified Teacher Status (QTS).\r\n\r\nAll schools in the Teach West London Ealing secondary partnership are highly supportive and inspirational environments where you will develop the necessary skills and acquire a true appreciation of the practice essential for outstanding teaching and learning. You will learn your craft in a safe environment which allows you to experiment with teaching styles, strategies and ideas.\r\n\r\nYour training will be delivered by expert teachers within the school. You will participate in weekly professional development sessions which will cover a wide range of topics which will be of use to you in your subject area and in the school as a whole. You will also attend training events along with fellow trainees. Your school-led training will be complemented by attendance at St Mary's University in Twickenham.\r\n\r\nYou will be assigned an experienced mentor from within your subject area at Ealing Fields who will support you in your development over the course. All mentors are excellent teachers who are well-trained in mentoring, coaching, lesson observations and feedback skills. You will also work closely with a member of the Senior Leadership team who will oversee your training and will provide an invaluable perspective on your role as a teacher and the wider issues of education leadership.","interviewProcess":"Shortlisted applicants should expect to first attend an interview at St Mary's University. \r\n\r\nIf successful, applicants will then be invited to an interview at school and to take part in some or all of the following activities: a presentation; a written task; small group teaching; curriculum discussion and an interview. You will be told in advance if you are required to prepare a presentation or to teach. \r\n\r\nIt is a rigorous and thorough process designed to ensure successful applicants are well placed to succeed.\r\n\r\nPlease note that we recruit on a rolling basis and usually offer only one position per subject area. We suggest that you apply early as popular subjects are filled quickly.","howSchoolPlacementsWork":"As well as your main training placement at Ealing Fields School, you will complete a six-week placement in a contrasting context within Ealing.\r\n\r\nThis will afford you the opportunity to experience working with different students, within different structures and with a wider range of colleagues.","personalQualities":"We seek to appoint applicants who exhibit a passion for and excellent knowledge of their subject and a commitment to the education of all young people. \r\n\r\nIt is anticipated that all successful applicants will participate fully in the life of the school and therefore it is essential that trainees are very well organised, hardworking and enthusiastic. \r\n\r\nWe look to appoint those with the potential to become outstanding teachers, with this in mind, it is crucial that applicants are resilient, reflective and responsive to advice.\r\n","otherRequirements":"You must have 3 years full-time (or equivalent) work experience (this does not have to be from an educational setting).\r\n\r\nSchool experience is also essential if you are interested in applying for School Direct at ETSA. We prefer that candidates have up to 10 days of recent experience in a UK school. If you have arranged some classroom experience but it is yet to take place, please make a note of this in your application.\r\n","status":1,"createdAt":"2021-07-06T10:50:03.537Z","updatedAt":"2021-10-05T11:08:46.297Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"ETSA Salaried School Direct trainees will be paid on the Unqualified Teacher Pay Scale (Band A, Inner London) area.\r\n\r\nAll ETSA schools offering Salaried places in Maths, Physics and Computing will pay trainees at least £25,000 as a result of additional funding being offered by the government. \r\n\r\nSalaries for other subjects will vary depending on the subject and salary.\r\n"}
