{"id":"0dd0e0e4-2e5f-45ef-ac26-9191d5809c98","name":"Primary","code":"BHN3","qualification":"pgce_with_qts","startDate":"2024-07-31T23:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"7766555c-33e3-4be8-b0dc-e8959d9d8333","name":"Main Site","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"94713f9e-e25f-44b0-9817-d34ffd1e39d4","code":"1X1","name":"Cuckoo Hall Academies Trust (CHAT)"},"accreditedBody":{"id":"ef09ce50-ccfc-4346-a0ce-43e840153dab","code":"W20","name":"The University of Warwick"},"profPost":"PG","english":"2","maths":"2","science":"2","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"The School Direct unsalaried PGCE with QTS placement is from September 2019 through to the end of the Summer Term July 2020","feesUK":9250,"feeDetails":"You may also be eligible for a loan while you study – note that you’ll have to apply for undergraduate student finance.","aboutCourse":"This course prepares you to teach Primary to pupils. You should consider this course if you want to contribute to young children's development.\r\n\r\nYou will develop a professional understanding of current issues in education along with the ability to effectively communicate and reflect upon your teaching. You will develop your pedagogy and subject knowledge. \r\nOur aim is to produce confident, imaginative and successful Teachers.\r\n\r\nYou'll be taught and supported by highly experienced teams who have a national reputation for the quality of their training.\r\n\r\nThe School Direct Training PGCE with QTS Teacher Trainees is run in collaboration with CHAT Academies (Cuckoo Hall Academies Trust) and the highly acclaimed University of Warwick (It’s Centre for Teacher Education is rated ‘outstanding’ by Ofsted for its ITT, Primary and Secondary training)\r\n\r\n\r\nCHAT Academies has primary and secondary PGCE teacher trainee placements to offer for 2020-21. \r\n\r\n","interviewProcess":"You will be asked to attend the school in which you plan to train for interview/assessment. The process takes a couple of hours and includes a 30 minute numeracy/literacy task; 20-25 minute \"micro-lesson\" and formal interview, which is a requirement of University of Warwick.   \r\n\r\nThe purpose of the micro-lesson is to see how you interact with students. The formal interview will be with a member of the Teaching School team, usually one of the Head Teachers and the Head of Department for whatever subject you are interested in teaching.\r\n\r\nWarwick University will then make a conditional or unconditional offer once all checks are completed. ","howSchoolPlacementsWork":"Trainees will be placed at CHAT Academies (4x Primary Academies: Woodpecker Hall Academy, Kingfisher Hall Academy, Enfield Heights Academy, Cuckoo Hall Academy and 1x Secondary Academy: Heron Hall Academy.","personalQualities":"","otherRequirements":"","status":2,"createdAt":"2021-07-06T10:53:51.520Z","canSponsorStudentVisa":"yes","cycle":"2024"}
