{"id":"9f743bbd-e77e-4e65-a814-db6ab4149b63","name":"History","code":"U142","qualification":"pgce_with_qts","startDate":"2024-07-31T23:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"5a3609a0-5bbb-4377-b919-5d89932ab622","code":"V1","name":"History"}],"locations":[{"id":"7766555c-33e3-4be8-b0dc-e8959d9d8333","name":"Main Site","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"94713f9e-e25f-44b0-9817-d34ffd1e39d4","code":"1X1","name":"Cuckoo Hall Academies Trust (CHAT)"},"accreditedBody":{"id":"ef09ce50-ccfc-4346-a0ce-43e840153dab","code":"W20","name":"The University of Warwick"},"profPost":"PG","english":"3","maths":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"The School Direct Training PGCE with QTS placement is from August 2021 through to the end of the Summer Term July 2022","feesUK":9250,"feeDetails":"You may also be eligible for a loan while you study – note that you’ll have to apply for undergraduate student finance.","financialSupport":"You may be eligible for financial support while you study, including bursaries, scholarships and loans please check the government website.","aboutCourse":"This course prepares you to teach History to pupils aged 11 to 16. You should consider this course if you want to contribute to young people's development by enabling them to acquire a knowledge base in History as well as the skills associated with practical aspects of the subject. \r\n\r\nYou will develop a professional understanding of current issues in education along with the ability to effectively communicate and reflect upon your teaching. You will develop your pedagogy and subject knowledge. \r\n\r\nOur aim is to produce confident, imaginative and successful Teachers.\r\n\r\nYou'll be taught and supported by highly experienced teams who have a national reputation for the quality of their training.\r\n\r\nThe School Direct Training PGCE with QTS Teacher Trainees is run in collaboration with CHAT Academies (Cuckoo Hall Academies Trust) and the highly acclaimed University of Warwick (It’s Centre for Teacher Education is rated ‘outstanding’ by Ofsted for its ITT, Primary and Secondary training)\r\n\r\nCHAT Academies has primary and secondary PGCE teacher trainee placements to offer for 2021-22. Some of these places will be taken up by CHAT with a proposal for some places to be offered to other rated good and outstanding schools. \r\n\r\n\r\n\r\n\r\n","interviewProcess":"You will be asked to attend the school in which you plan to train for interview/assessment. The process takes a couple of hours and includes a 30 minute numeracy/literacy task; 20-25 minute \"micro-lesson\" and formal interview, which is a requirement of University of Warwick.   \r\n\r\nThe purpose of the micro-lesson is to see how you interact with students. The formal interview will be with a member of the Teaching School team, usually one of the Head Teachers and the Head of Department for whatever subject you are interested in teaching.\r\n\r\nWarwick University will then make a conditional or unconditional offer once all checks are completed. \r\n","howSchoolPlacementsWork":"Trainees will be placed at CHAT Academies (4x Primary Academies: Woodpecker Hall Academy, Kingfisher Hall Academy, Enfield Heights Academy, Cuckoo Hall Academy and 1x Secondary Academy: Heron Hall Academy.\r\n\r\n","personalQualities":"Additional qualities that we look for include:\r\n• Passion for learning and an interest in/knowledge of education\r\n• Excellent communication skills (both written and verbal)\r\n• Ability to stay calm and deal with stressful situations\r\n• Drive to succeed and resilience in the face of difficulty\r\n• Being part of a team and working collaboratively\r\n• Reflective practitioner who responds to feedback\r\n• ICT competent and confident\r\n• Interests outside of education\r\n","otherRequirements":"Other requirements\r\n\r\n• Experience in a school environment or working with young people,\r\nwill strengthen your application although this is not essential at\r\napplication.\r\n• You must also be successful in completing a Disclosure & Barring Service (DBS) check.\r\n","status":2,"createdAt":"2021-07-06T10:53:51.780Z","canSponsorStudentVisa":"yes","cycle":"2024"}
