{"id":"36c3bfaf-c8f3-49b6-bafd-1468da4a0b70","name":"Primary (5-11)","code":"AW29","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"trainingProvider":{"id":"32933a3d-8739-4300-a46a-06453f97ff3f","code":"1PL","name":"Bristol Primary Training and Support Alliance (Whitehall Primary/Ashley Down Primary)"},"accreditedBody":{"id":"e1473ef6-b29f-4e0b-adff-558ab367008a","code":"2AV","name":"Cabot Learning Federation SCITT"},"english":"3","maths":"3","science":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":null,"aboutCourse":"Bristol Primary Teaching School, in partnership with the CLF SCITT, are offering a programme which combines school-centred training, experience and practice with subject specific and professional development.  This ensures trainees develop the knowledge, skills and understanding required to be outstanding teachers. Successful completion of the programme leads to the award of Qualified Teacher Status (QTS) and there is an opportunity to gain a PGCE for an additional fee. \r\nThe programme structure is layered and progressive making explicit links to the Teachers' Standards throughout. Trainees are fully integrated into school life from the start of the school year.  School experience and assignments complement training, enabling reflection on learning, and making links between theory and practice. \r\nDistinctive features of the programme are: \r\n•\tAugust Induction: Early induction is designed to accelerate trainee’s preparedness for training and being in school. We focus on how to be a successful trainee, programme expectations and the concept of reflexivity. It is also an opportunity to develop a strong trainee community and support network for the training year. \r\n•\tWeekly centre-based training:  Weekly subject knowledge and professional development training is led by school-based professionals and specialist leaders of education (SLEs) who are experienced and effective teachers and leaders. We use a facilitated and active learning approach where trainees experience learning techniques, engage in reflective thinking and learn collaboratively.\r\n•\tSchool Experience all year round:  Our trainees benefit from school-based training and practical classroom experience from the very start of the programme and throughout. Immersion into the life of the school and exposure to experienced and expert teachers ensures realistic and authentic experiences. \r\n•\tPersonalisation:  We strive to provide a personalised and differentiated programme. Weekly centre-based training alongside regular school visits enables the SCITT team to identify needs and adapt the programme as necessary, using experts from across the partnership. \r\n•\tEmployment support:  Trainees are provided with exceptional support in securing employment. The CLF SCITT supports trainees transition into their first teaching posts, and provides a continuing network of support and ongoing training.\r\n","interviewProcess":"The assessment day will take place at one of our partnership academies or at the CLF Institute. \r\nAssessment day tasks will include: \r\n•\tA pre-prepared teaching task with a group of pupils \r\n•\tA short pre-prepared presentation \r\n•\tA group discussion \r\n•\tA  written task based around personal reflection \r\n•\tAn individual interview \r\nDetails of the tasks will be sent to you prior to the interview date. \r\nThe assessment tasks are designed to help us select prospective trainees based on our 5 core values and attributes: \r\n•\tAptitude and readiness for teacher training \r\n•\tStrong passion for teaching and learning specific to age range or subject \r\n•\tStrong sense of moral purpose (linked to our HEART values) \r\n•\tEffective communicative and interpersonal skills \r\n•\tAbility to reflect, be responsive and pro-active \r\nThis rigorous selection process ensures that we recruit the very best trainee teachers for our children and young people. During the process you will also be able to establish whether we are the right training provider for you. \r\nSuccessful applicants may be given conditions or recommended actions to complete prior to the course starting in order to accelerate their readiness for the teacher training year.\r\n","howSchoolPlacementsWork":"The CLF SCITT programme has 4 blocks of teaching experience with over 130 days spent in school throughout the year. All placements take place in CLF and partnership schools in Bristol, South Gloucestershire and North Somerset. \r\nThroughout all teaching experience placements, trainees are allocated a mentor who will provide regular guidance, support and challenge. In addition there is a Lead Mentor in school who oversees the school-based training alongside the Programme Leaders.\r\nSchool Carousel: \r\nOver the first 5 weeks of the programme, trainees embark on a carousel of school experience, visiting a different school each week. Trainees are set key tasks and observations, linked to their weekly training, to carry out in school in order to explicitly make links between theory and practice improving their understanding of how children and young people develop and learn. This provides a smooth induction to the programme and is particularly beneficial to trainees who have limited experience in school. It also provides the SCITT team with an opportunity to get to know the trainees so that future placements can be better matched to trainee needs. \r\nHome Placement: \r\nAll trainees will have a ‘home’ placement where they will spend the majority of their training year. For Primary trainees, the first part of this placement will start in October and go through to December. Trainees will then return to this placement in the summer term from April to July. \r\nContrasting Placement: \r\nDuring the spring term, from January to April, trainees move to a new placement school. Placements will be arranged in a contrasting school environment and in the alternate key stage to the ‘home’ placement. \r\nPlacement expectations are designed to gradually develop trainees' teaching during the year.  This starts with the teaching of small groups, moving on to teaching parts of lessons, to whole lessons to entire sequences of learning and finally taking on full responsibility for the class and the progress of learners in the summer term. Trainees are expected to demonstrate increasing independence and autonomy in their planning and teaching throughout the year.  \r\n","personalQualities":"We are looking for trainee teachers who share our ambition for improving outcomes for children and young people through working collaboratively and empowering learning. \r\nYou will need to demonstrate the commitment and resilience needed to become a highly effective teacher and lifelong learner. \r\nAdditional qualities we look for throughout the application process are:\r\n•\tAptitude and readiness for teacher training \r\n•\tStrong passion for teaching and learning specific to age range or subject \r\n•\tStrong sense of moral purpose (linked to our HEART values) \r\n•\tEffective communicative and interpersonal skills \r\n•\tAbility to reflect, be responsive and pro-active \r\n","otherRequirements":"You must complete successful enhanced Declaration and Barring Service (DBS) and prohibition checks & will require appropriate ID and documents. You must provide full employment history & satisfactory references supporting your suitability to work with children/young people, as per Keeping Children Safe in Education requirements. The selection process will include an interview. You will be asked to complete an Occupational Health form/self-declaration about your fitness and wellness to teach. School experience is highly recommended to both support your application and improve your readiness for teacher training. You will also need the financial backing of your school to pay your salary.","status":2,"createdAt":"2021-07-06T10:53:57.592Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"You will be employed as an unqualified teacher, point 1.\r\n\r\nThose applying for this route should already be employed by a school, with the intention of stepping up their role to continue working as a teacher in their current setting.\r\n\r\nAs this is a salaried route, applicants will need the financial backing of the schools in which they are working. The salary paid by the school will be that of an unqualified teacher, point 1, and the school will also pay all training costs.\r\n\r\nThere is an additional fee for those wishing to obtain a PGCE qualification in addition to QTS."}
