{"id":"f6b1bc5a-6c42-458e-9b47-0f882f6bfb0f","name":"Primary","code":"2T8X","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"fe804e36-c8aa-4e82-bfa1-f5f5cf1ff6c5","name":"Bishop Road Primary School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"32933a3d-8739-4300-a46a-06453f97ff3f","code":"1PL","name":"Bristol Primary Training and Support Alliance (Whitehall Primary/Ashley Down Primary)"},"accreditedBody":{"id":"da8e5252-e14a-470a-8247-00b835a79010","code":"B80","name":"University of the West of England, Bristol"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feeDetails":"\r\nApplication for student finance is available.\r\n\r\nThe websites below are useful for further information\r\n\r\n(https://getintoteaching.education.gov.uk/bursaries-and-funding) \r\n \r\n(http://www1.uwe.ac.uk/students/feesandfunding.aspx)\r\n","aboutCourse":"The School Direct PGCE route offers a mix of a traditional university-based PGCE with school-based learning across the Alliance partner schools to give you the best of both worlds. This route enables you to draw on the expertise of your placement schools, the Alliance Training Manager, Specialist Leaders of Education (SLE) and the HEI (the University of the West of England) over a year of training.  Some sessions take place at Bishop Road Primary School in a small group setting, where you can benefit from bespoke input in a group of around 20. This is not a salaried route and so normal tuition fees apply.\r\n\r\nThis programme has an academic element, with a small number of assignments across the year, working at Masters' level. You will have a school-based mentor, university tutor and training with the Alliance Training Manager and outstanding class teachers from across the city.\r\n\r\nAssessment is ongoing while training at a school. This will include a weekly observation with feedback and also a weekly meeting with your mentor to discuss progress. \r\n\r\nDuring the year trainees will spend time in two schools (typically September to January & March to June). The first block placement will be in either Key Stage 1 or Key Stage 2, and the second block placement will be in the alternative Key Stage and a contrasting setting.\r\n\r\nOur PGCE programme offers a real range of experiences across the year to prepare you for your first teaching post. Join us and continue our impressive completion and employment rates on this route!\r\n\r\nApply via this link - https://www.gov.uk/apply-for-teacher-training ","interviewProcess":"If you are successful at the application stage and are subsequently invited to interview, the structure of the day consists of the following:\r\n\r\n- A welcome and introduction to the day\r\n- A 10 minute activity working with children (details of this will accompany an invitation to interview email)\r\n- A 5 minute micro-teach to other candidates  (details of this will accompany an invitation to interview email)\r\n- An interview which will last no longer than 30 minutes\r\n- A Maths & English task\r\n\r\nThe interview panel for the day usually consists of members of the Bristol Primary Training and Support Alliance and Partnership head teachers.\r\n\r\n","howSchoolPlacementsWork":"We have strong relationships with a wide range of primary schools across Bristol, serving many different types of communities. Placements for trainees are very carefully selected around your needs. We will always do our best to ensure that travel time is as little as possible whilst at the same time providing schools that support and challenge each trainee, to get the very best out of you.\r\nEach of the two placements will be in a class from Year 1 to Year 6. Both placements offer significant in-school training time, which, together with your centre-based training,  will prepare you extremely well for your future career in teaching.","personalQualities":"Desirable qualities include:\r\n\r\n- An understanding of teaching and learning within a school setting\r\n- Excellent time management\r\n- Organisational skills\r\n- Emotional resilience\r\n- A strong work ethic","otherRequirements":"An enhanced criminal record (DBS) check is required to assess your suitability to work with children.\r\nSome voluntary work or prior school experience is desirable.","status":1,"createdAt":"2021-07-06T10:53:57.559Z","updatedAt":"2021-09-14T13:30:17.057Z","canSponsorStudentVisa":"yes","cycle":"2024"}
