{"id":"7c7dd40a-a36a-497e-9be1-370c71e01153","name":"Primary with Mathematics","code":"AT41","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"286cf12f-b3e3-41c5-9f33-2ff7807d2df0","code":"03","name":"Primary with mathematics"}],"locations":[{"id":"8717f2f6-871e-4e8b-b461-2b4c37cde5a0","name":"Main Site","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"9d03acb4-95ce-41e1-8458-0b4bec147b6b","code":"M20","name":"The University of Manchester"},"profPost":"PG","degreeGrade":"0","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"In addition, we also require GCSE grade C in at least three other non-vocational subjects AND two A-levels, one of which must be mathematics grade B or above and an additional one grade C or above in a non-vocational subject.\n\n\n\nPlease note that applicants with a 2:2 honours degree may be considered but must be able to demonstrate evidence of higher academic attainment (eg through postgraduate study).\n\nCurrently, the University of Manchester does not offer equivalency tests, but would accept equivalency tests from these providers: \n\nhttps://www.equivalencytesting.com/\n\nhttps://www.bcu.ac.uk/education-and-social-work/initial-teacher-training/gcse-equivalency-test/gcse-equivalency-tests-non-bcu-applicants\n\nhttps://astarequivalency.co.uk/","courseLength":"10 Months. [Full-Time]","feesUK":9250,"feesInternational":20000,"aboutCourse":"PGCE Primary will train you to teach children aged 5 to 11 and develop as a mathematics specialist. \r\nThis ten-month course provides training in all primary-stage National Curriculum subjects, with a particular focus on mathematics, English and science. It leads to both a postgraduate qualification and qualified teacher status (QTS).\r\n\r\nThe course combines master's-level academic study of primary education with a range of practical experiences. A significant amount of your time will be spent in partnership schools developing practical teaching skills with the support of trained mentors and experienced teachers. This course is run in partnership with more than 200 local primary schools which allows us to personalise your school experience to your individual needs.\r\n\r\nYour practical training will be underpinned by education theories, ideas and concepts, and by enhancing your awareness of current educational issues and developments.\r\nWith mathematics as your specialism you will enhance and deepen your subject knowledge, undertake an enquiry project in school, and further your knowledge and understanding of how mathematics is taught and led in school.  You will undertake a specific mathematics placement leading to your enquiry project and will be taught and coached during the course by experienced colleagues and practitioners to support you in developing a clear understanding of how children learn mathematics. \r\n\r\n","interviewProcess":"Your application will be assessed by our admissions team and if successful, we will invite you to an online interview and share the relevant information.  \r\nThe interview process will involve a personal interview with an academic member of staff. You will be also asked to prepare a presentation in advance. \r\n","howSchoolPlacementsWork":"The course is run in partnership with more than 200 local primary schools and you will spend more than 50% of your time in primary schools on placements. When on placement, you will observe and teach classes under the guidance of an experienced primary teacher. You will also have a mentor to help you to plan lessons, deal with marking and assessment and improve your teaching skills.\r\n\r\nOur partnership schools are located across Greater Manchester, including Bolton, Trafford, Tameside, Manchester, Bury, Stockport, Rochdale, Salford and Oldham, and also north Cheshire and south Lancashire. The main professional placements are:\r\n\r\n- eight weeks in the autumn term in either Key Stage 1 or Key Stage 2\r\n- eleven weeks in the summer term in either Key Stage 1 or Key Stage 2\r\n- two-week mathematics enquiry placement in either key stage\r\n- one-week placement in the Early Years Foundation Stage (EYFS)\r\n- one week placement with a mathematics SEND focus\r\n- one-week placement in Key Stage 3.\r\n\r\n","personalQualities":"","otherRequirements":"For more information please follow this link: \r\nhttps://www.manchester.ac.uk/study/masters/courses/list/12642/pgce-primary-maths/","status":0,"createdAt":"2021-07-06T10:55:19.595Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
