{"id":"88ef3c1f-119d-4113-a6a4-8b96cda1d371","name":"Economics with Business Education","code":"2WNF","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"14_to_19","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"cd9159fc-869f-4188-8435-3374676d6e92","code":"L1","name":"Economics"}],"locations":[{"id":"8717f2f6-871e-4e8b-b461-2b4c37cde5a0","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"9d03acb4-95ce-41e1-8458-0b4bec147b6b","code":"M20","name":"The University of Manchester"},"profPost":"PG","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"A degree in a related subject, with a minimum of 50% content directly related to economics will be considered. \n\nWe also require a strong academic record at A-level (or equivalent).","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Currently, the University of Manchester does not offer equivalency tests, but would accept equivalency tests from these providers: \n\nhttps://www.equivalencytesting.com/\n\nhttps://www.bcu.ac.uk/education-and-social-work/initial-teacher-training/gcse-equivalency-test/gcse-equivalency-tests-non-bcu-applicants\n\nhttps://astarequivalency.co.uk/","courseLength":"10 Months. [Full-Time]","feesUK":9250,"feesInternational":20000,"aboutCourse":"PGCE Secondary (Economics and Business Education) will train you to become a teacher of economics and business education across the 14 -19 age range.\r\n\r\nIt will prepare you to teach the National Curriculum and related national strategies, GCSE and A-level.\r\n\r\nCompletion leads to both a postgraduate qualification and recommendation for qualified teacher status (QTS).\r\n\r\nUniversity-based sessions will enable you to reflect on teaching methods.\r\n\r\nYou will be given the opportunity to develop your own teaching style, to set personal targets, to demonstrate initiative and to evaluate your work in planning, teaching and assessing.\r\n\r\nWe will help you to transform your subject knowledge into teaching skills and educational theory into practice.\r\n\r\nUniversity tutors have particular subject expertise as successful teachers and also examiners for major boards at GCSE and A-level. You will be taught by a teaching team with a nationally recognised reputation for research, teaching and publications in business education.\r\n\r\nWe also use the expertise of experienced teachers from our partnership schools to complement the teaching of University-based sessions. This includes sessions led by subject mentors, who will help you develop your subject knowledge and provide advice about teaching methods. The University-based sessions will give you creative and innovative ideas to take into the classroom.\r\n\r\n","interviewProcess":"Your application will be assessed by our admissions team and if successful, we will invite you to an online interview and share the relevant information.  \r\nThe interview process will involve a personal interview with an academic member of staff. You will be also asked to conduct a short teaching task and complete a subject knowledge assessment.\r\n","howSchoolPlacementsWork":"The course is a partnership between the University and schools and colleges drawn from a wide area, including Bolton, Bury, Cheshire, Deeside, Lancashire, Manchester, Merseyside, Oldham, Rochdale, Salford, Staffordshire, Stockport, Tameside, Trafford, Warrington and Wigan. In your placement schools and colleges, you will observe and teach classes under the guidance of experienced subject mentors.\r\n\r\nAs a trainee teacher you'll spend two-thirds of your course in schools or colleges, and the remaining time in University-based study.\r\n\r\nWe maintain close contact with our partnership establishments at every stage of the programme. These include:\r\n\r\n11-18 and 11-16 comprehensive and independent schools\r\ncity academies\r\nfurther education colleges\r\nsixth-form colleges\r\nspecialist schools (e.g technology colleges, arts colleges).\r\n\r\nAs a trainee teacher you'll spend two-thirds of your course in schools or colleges, and the remaining time in University-based study. In your placement schools and colleges, you will observe and teach classes under the guidance of experienced subject mentors.\r\n\r\nBoth your mentors and tutors will help you to record your achievements and set targets. During each placement, a University tutor will observe you teach, and at the end of each school experience, you will receive a report from your mentor. The report will grade you in the following areas:   \r\n\r\nteaching\r\nplanning\r\ndifferentiation and assessment\r\nlearning environment\r\nwider professional responsibilities. \r\n\r\nThe grades are awarded by your mentor in conjunction with your University tutor. These reports, together with your record of achievement and development, facilitate your progression as a teacher.\r\n","personalQualities":"","otherRequirements":"For more information please follow this link: https://www.manchester.ac.uk/study/masters/courses/list/11528/pgce-secondary-economics-and-business-education/","status":1,"createdAt":"2021-07-06T10:55:19.488Z","updatedAt":"2021-09-29T12:36:18.100Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
