{"id":"e0e83f38-70ad-402f-ac11-dad038ca627f","name":"Primary","code":"X100","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"8717f2f6-871e-4e8b-b461-2b4c37cde5a0","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"9d03acb4-95ce-41e1-8458-0b4bec147b6b","code":"M20","name":"The University of Manchester"},"profPost":"PG","degreeGrade":"0","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"In addition to GCSEs in English Language, Mathematics and Science, we also require at least three other non-vocational subjects (minimum grade C)\nAND two A-levels in non-vocational subjects (minimum grade C)\n\nCurrently, the University of Manchester does not offer equivalency tests, but would accept equivalency tests from these providers: \n\nhttps://www.equivalencytesting.com/\n\nhttps://www.bcu.ac.uk/education-and-social-work/initial-teacher-training/gcse-equivalency-test/gcse-equivalency-tests-non-bcu-applicants\n\nhttps://astarequivalency.co.uk/","courseLength":"10 Months. [Full-Time]","feesUK":9250,"feesInternational":20000,"aboutCourse":"PGCE Primary will train you to teach children aged 5 to 11. It provides training in all primary stage National Curriculum subjects, with a particular focus on mathematics, English and science.\r\n\r\nCompletion leads to a postgraduate qualification and recommendation for qualified teacher status (QTS).\r\n\r\nUniversity-based sessions cover education theories, ideas and concepts, and will enhance your awareness of current educational issues. You will spend a significant amount of time studying the core subjects of English, mathematics and science.\r\n\r\nYou will also study: religious education; PE; history; geography; art; music; and design and technology.\r\n\r\n","interviewProcess":"Your application will be assessed by our admissions team and if successful, we will invite you to an online interview and share the relevant information.  \r\nThe interview process will involve a personal interview with an academic member of staff. You will be also asked to prepare a presentation in advance.\r\n","howSchoolPlacementsWork":"The course is run in partnership with more than 200 local primary schools and you will spend more than 50% of your time in primary schools on placements. When on placement, you will observe and teach classes under the guidance of an experienced primary teacher. You will also have a mentor to help you to plan lessons, deal with marking and assessment and improve your teaching skills.\r\n\r\nOur partnership schools are located across Greater Manchester, including Bolton, Trafford, Tameside, Manchester, Bury, Stockport, Rochdale, Salford and Oldham, and also north Cheshire and south Lancashire. The main professional placements are:\r\n\r\n- eight weeks in the autumn term in either Key Stage 1 or Key Stage 2\r\n- eleven weeks in the summer term in either Key Stage 1 or Key Stage 2\r\n- two-week enquiry placement in either key stage\r\n- two-week placement in the Early Years Foundation Stage (EYFS)\r\n- one-week placement in Key Stage 3.\r\n","personalQualities":"","otherRequirements":"For more information please follow this link: \r\nhttps://www.manchester.ac.uk/study/masters/courses/list/02846/pgce-primary/","status":1,"createdAt":"2021-07-06T10:55:20.160Z","updatedAt":"2021-09-29T12:48:26.307Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
