{"id":"03bc3f85-615b-486c-be2e-ad765a22240c","name":"Modern Languages","code":"33BT","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"ce8523ef-9236-4cd9-b260-d826c7a521b3","code":"ML","name":"Modern Languages"},{"id":"4608e5e3-2a1a-48a1-8236-56c7af5a139d","code":"24","name":"Modern languages (other)"}],"locations":[{"id":"cb741627-d652-49c2-b99e-776ffe34bb4b","name":"Main Site","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"0eb887d9-72a1-4bab-a998-0f87c3f0619b","code":"1V9","name":"Hackney Teaching Schools’ Alliance"},"accreditedBody":{"id":"9be9f611-2d36-431a-9109-7fcbbfc88fc8","code":"C99","name":"University of Cumbria"},"profPost":"PF","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Clapton Girls' Academy is working in partnership with the University of Cumbria to provide Initial Teacher Training through the School Direct programme.\r\nThe University of Cumbria is one of the largest providers of teacher training in Europe. Clapton Girls' Academy is the Lead School for the School Direct Unsalaried route.\r\n\r\nSchool Direct is a route into teacher training which allows schools or groups of schools to take a leading role in ITT provision in partnership with an accredited provider. It is underpinned by a belief that schools can improve the system by creating more school-led training that best meets the needs of schools and trainees. School Direct is a programme where schools recruit trainees directly and select them to work within their partnership schools. This new training route allows you to choose the school in which you train, with an expectation (but no absolute guarantee) of employment once you finish.\r\n\r\nIf you prefer to spend more time training in the classroom, putting theory into practice, and gaining confidence through increased contact with the school environment, then a School Direct programme is for you.\r\n\r\nThe Hackney Teaching Schools' Alliance and School Direct are seeking people committed to enhancing the lives and education of the young people of Hackney. Applicants are required to have experience of working in a school setting and will need to demonstrate that they would be able to support Hackney schools in raising standards and fostering children's well-being.\r\n\r\nWe are offering a post-graduate qualification through the University of Cumbria. Trainees will achieve their PGCE and 60 Masters' credits. All trainees will be based in Hackney secondary schools, working alongside a current teacher and supported by qualified mentors and personal tutors. This is for high-quality graduates with a degree level of 2.1 or above, who want to be part of a school team from day one. All applicants must have achieved a standard equivalent to a Grade C in GCSE English Language, Mathematics, and Science, and have a good undergraduate degree.\r\n","interviewProcess":"","howSchoolPlacementsWork":"All trainees will be based in Hackney secondary schools, working alongside a current teacher and supported by qualified mentors and personal tutors. ","personalQualities":"We are seeking people committed to enhancing the lives and education of the young people of Hackney. Applicants are required to have experience of working in a school setting and will need to demonstrate that they would be able to support Hackney schools in raising standards and fostering children's well-being.","otherRequirements":"","status":2,"createdAt":"2021-07-06T10:53:27.349Z","canSponsorStudentVisa":"yes","cycle":"2024"}
