{"id":"18f7e68f-d23b-45d6-a5b8-db876c4ae6d1","name":"Primary","code":"C3P0","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"TA","fundingType":"apprenticeship","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"cb741627-d652-49c2-b99e-776ffe34bb4b","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"0eb887d9-72a1-4bab-a998-0f87c3f0619b","code":"1V9","name":"Hackney Teaching Schools’ Alliance"},"accreditedBody":{"id":"30bda414-7b00-426c-956b-18a187efe967","code":"L68","name":"London Metropolitan University"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","science":"9","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"no","courseLength":"OneYear","feesUK":null,"aboutCourse":"The Hackney Teaching Schools’ Alliance (HTSA) Postgraduate Apprenticeship offers a school-led, employment-based Initial Teacher Training pathway which leads to Qualified Teacher Status (QTS) and a PGCE, in partnership with London Metropolitan University. \r\n\r\nPostgraduate Teaching Apprenticeships are a nationally-recognised, work-based route into teaching. They are an alternative to a traditional full-time university course, offering a postgraduate-level qualification, no tuition fees, and the opportunity to earn while you learn. \r\n\r\nYou will be employed by a school as an unqualified teacher while you learn on the job, with an inner London salary of £23,099*. There may also be the opportunity to be employed by the school as a teaching assistant in the summer term before your course, to support your induction. \r\n\r\nIf you’re currently working as an unqualified teacher or teaching assistant, it offers new opportunities for career progression, as well as higher earning capacity and recognition. You’ll receive a combination of classroom teaching and professional development training as you to work towards QTS. Our training partnership with London Metropolitan University will also prepare you for a PGCE qualification with training at university and independent tasks. \r\n\r\nSimilarly to School Direct (salaried) programmes, you’ll be employed directly by the school. Unlike School Direct (salaried) programmes: \r\n\r\n- The Postgraduate Teaching Apprenticeship combines paid work with on- and off-the-job training. The design of the programme is led by our schools’ partnership specifically for apprentices. \r\n- Apprentices will split their time between school and university study. You’ll receive practical, school-led training alongside experienced staff and spend at least 20% of your time off-timetable to learn about pedagogy, including one day every fortnight with London Metropolitan University. \r\n- In addition to working towards QTS, on successful completion of the course, apprentices will also complete an end point assessment (EPA) in the Autumn Term of their NQT year to consolidate learning from Initial Teacher Training.\r\n\r\n*This figure may change slightly dependent on the outcome of statutory consultations.","interviewProcess":"Shortlisted applicants are invited to interview by email. Interviews will be with the Hackney Teaching Schools' Alliance in the first instance, followed by a separate interview with London Metropolitan University if successful. Applicants will be required to successfully interview with both the HTSA and London Metropolitan University in order to gain a place on the course. \r\n\r\nCurrently all initial interviews are undertaken online, via video link (Google Meet or similar). Later in the process there may be a face-to-face assessment prior to an offer being made, dependent on public health advice. The university interview will include an online diagnostic assessment of your basic maths and English skills. Further details on the interview processes will be available after application.\r\n\r\nOnce you've undertaken both university and school interviews, we will normally confirm the decision through UCAS within one week. If you're offered a place, we will additionally email you to confirm how to meet any conditions of your offer.","howSchoolPlacementsWork":"Our partnership currently comprises 14 Hackney schools, including 9 primaries: \r\n\r\n- Millfields Community School \r\n- Kingsmead Primary School \r\n- Benthal Primary School \r\n- Gayhurst Primary School \r\n- St Scholastica's Primary School \r\n- Mandeville Primary School \r\n- Nightingale Primary School \r\n- Randal Cremer Primary School \r\n- Rushmore Primary School \r\n\r\nYou will be placed in a class at one of our primary schools, gradually taking over responsibility for their learning, building to 80% teaching time by the end of the year.  \r\n\r\nWho will teach me? \r\n\r\nExperienced teachers from the HTSA network, HTSA subject specialists, HTSA senior leaders, and lecturers from London Metropolitan University deliver the training. \r\n\r\nWill I earn a salary? \r\n\r\nYou will be employed by a school as an unqualified teacher while you learn on the job, with an inner London salary from £23,099. Your tuition fees will be met by the apprenticeship levy.  \r\n\r\nHow will I be assessed?  \r\n\r\nA number of different people are responsible for assessing your progress towards the teaching standards set by the Department for Education. Your practical teaching will be assessed by your mentor, link tutor and other experienced teachers. Tasks and assignments are marked by link tutors and moderated by lecturers from London Metropolitan University. Rigorous quality assurance procedures ensure that assessment is carried out effectively and fairly. \r\n\r\nWhat support will I get? \r\n\r\nYour link tutor will visit you at least once every half term to observe your teaching and give feedback. You will meet your link tutor half-termly for a review meeting to discuss progress and targets. You will also be allocated a school-based mentor; this may be your class teacher or it may be another experienced member of the school staff. Your mentor will observe you and give you feedback on your teaching at least once a week. They will also meet you weekly to discuss your training plan, targets and progress. \r\n\r\nAdditional support is available as necessary. If you have a special need or disability, we urge you to discuss this with us as early as possible so that we can make any necessary adjustments and provide the support that you need.","personalQualities":"We are looking for applicants who are dynamic, energetic, enthusiastic and caring and have a desire to share your passions for your specialism with young people and make a real difference to their life chances. Ideally, you: \r\n\r\nEnjoy working with children and are excited about supporting children to make progress  \r\n\r\nAre pro-active, flexible and reflective \r\n\r\nAre determined to reach the highest standard \r\n\r\nHave a strong sense of professionalism and thrive on challenge \r\n\r\nHave a passion for teaching, are ambitious for children and for making a difference \r\n\r\nUnderstand that children have different needs and learn in different ways ","otherRequirements":"Ideally (but not essentially) some recent experience of working with children in educational settings.\r\nThe ability to communicate clearly and accurately in Standard English (both written and orally)\r\nA commitment to teach and a motivation to learn\r\nWell-developed personal qualities and skills such as self-organisation, resilience and reflectiveness\r\nA commitment to equal opportunities","status":1,"createdAt":"2021-07-06T10:53:27.441Z","updatedAt":"2021-10-06T11:13:06.823Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024"}
