{"id":"b61a80be-2141-4829-9cac-a81b1ff6c472","name":"Primary (3-7)","code":"227W","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"other","programType":"HE","studyMode":"F","ageRange":"3_to_7","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"7107f811-e9db-4a0c-8037-efd3bd137564","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"036f1406-83fc-4014-9b34-502c0e9f5d25","code":"133","name":"London East Teacher Training Alliance"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"Candidates need to pass their equivalencies with either \nAStar   https://astarequivalency.co.uk/      or \nEquivalencyTesting       https://www.equivalencytesting.com/","courseLength":"OneYear","feesUK":9250,"feeDetails":"Funding\r\n\r\nWe have two routes into teaching - salaried apprenticeship or tuition fee-paying. Both lead to QTS and a PGCE with 60 level 7 masters credits.\r\nCourse fees for the fee-paying route are £9,250\r\n\r\nThe majority of trainees apply to the Student Loan Company for loans to cover course fees. More information is available on www.slc.co.uk\r\nSome trainees self-fund. Seek advice from the LETTA Business Manager  on  train@letta.org.uk regarding self-funding arrangements or queries about funding, generally.\r\n\r\nSalaried apprenticeship trainees receive a salary at Point One on the Unqualified Teacher Scale.  Salaried trainees pay a total of £1,600 towards their PGCE with 60 masters credits.  This is payable over the course of the year in staggered lump sums.\r\n\r\n\r\n","financialSupport":"There are no DfE bursaries.  However, a locally funded bursary scheme is available on application to a trainee's training school.   This is for fee-paying trainees only and is discretionary.  This decision is made by LETTA partner schools only and not by LETTA tutors. ","aboutCourse":"Our training programme has been highly commended in our Ofsted report.   \r\nSee our LETTA NQTs talking about the programme.\r\n(https://mail.google.com/mail/u/0/#search/jen?projector=1)\r\n\r\nOur partner schools are in Tower Hamlets or Newham. Please see our prospectus on (www.letta.org.uk) for current partner schools.  Training days take place at Stebon Primary, E14.\r\n\r\nTrainees are out of school once a week and sometimes on other occasions.  The training covers various topics eg.,\r\n\r\n* Mindset theory\r\n* Learning theories\r\n* Child development\r\n* Planning\r\n* Assessment\r\n* Behaviour for Learning/Behaviour Management\r\n* Philosophy for children (p4c)\r\n* Shared/guided reading/phonics\r\n* English/Maths/Science\r\n* Foundation subjects\r\n* Drama/Dance\r\n* RE\r\n* EAL/SEND\r\n* Safeguarding\r\n* Children's wellbeing\r\n* Trainees' wellbeing\r\n\r\nSessions are led by school practitioners, LETTA tutors, consultants, authors, nationally known figures,   eg.,  Prof. Barry Hymer, Pie Corbett,  Jenny Mosley, Dr. Bill Rogers, Sir John Jones, Shirley Clarke.\r\n\r\nTrainees are in school for four days a week.   Over the course of the year, the amount of planning and teaching gradually increases so that trainees become accomplished teachers ready for their first year as a Newly Qualified Teacher.  Trainees work alongside an expert class teacher/mentor who consistently demonstrates good and outstanding practice.  Trainees also learn by observing expert colleagues, mentors and school staff, and focusing upon children’s learning.  Trainees attend all school inset and meetings and are part of the school team.\r\n\r\nTrainees also have experiences of other schools including Phoenix  School (autism focus) and for the 5-11 group, a secondary school. (KS3 focus)    The programme also includes visits to other primary schools and settings.\r\n\r\nThere is an opportunity for a science field trip to Oxford.  LETTA has a strong emphasis on creativity. Drama, dance and cross-curricular learning is a feature of all our programmes. \r\n\r\nThe PGCE is led by tutors from Sheffield Hallam University who visit us to deliver the course.  There are two assignments. The first is about classroom talk  and the second a collaborative lesson study - an area of research chosen by trainees.\r\n\r\nLETTA monitors workload carefully.  We build in study days into the LETTA timetable, keep paperwork relevant to trainees' learning and provide personal and pastoral support when necessary. We use OneFile as our e-portfolio platform.\r\n\r\nLETTA prides itself in giving wellbeing a priority. We encourage social events, and discussion and communication so we can support each other and celebrate successes, no matter how small.  We will get to know you as individuals.","interviewProcess":"Please note:  The process below may change due to Covid. The interview maybe online. Applicants will be notified about precise procedures and activities.\r\n\r\nSuccessful shortlisted applicants will be invited to an interview consisting of:\r\n\r\n1.  A mini-teach with a small group of children - 10 mins\r\n2. A  written task - 20 mins\r\n3. An interview  - 30 mins (est)   \r\n\r\nApplicants can choose the  mini-teach year group from Reception to Year 5 and choose either English or Maths. We expect a lesson plan to be available for each interviewer. No projectors are available for this.  We need to see applicants interacting with children.   The criteria will be sent to applicants.\r\n\r\nPlease note: those on the maths specialism must do a maths mini-teach.\r\n\r\nLETTA send out the written task topic a few days before the interview. So applicants can prepare. It requires applicants to look and respond to a you tube clip.  Notes cannot be directly used on the day of the interview. \r\n\r\nPlease note: those applying for a specialism, will have an additional written task.  \r\n\r\nThe interview panel will have between 3 and 5 interviewers from the LETTA partnership. The panel is usually drawn from partner head teachers and LETTA tutors.\r\n\r\nLETTA will adjust the interview process for interviewees with particular needs, on request.\r\n  \r\nInterviews are held at either Bygrove Primary School, E14 or Stebon Primary School, E14. Both schools have good public transport links.\r\n\r\n","howSchoolPlacementsWork":"LETTA use their experience with school partners to match successful applicants with schools and mentors.  Trainees will be able to visit schools to ensure they are comfortable in that setting and ensure the journey to school is doable. We will consider personal circumstances eg., for parents, disabilities that require some careful thought about school suitability.\r\n\r\nIn addition to the main school placement, there are 3 shorter placements during the year:\r\n\r\n•\tOther Key Stage/Age Phase – 4 weeks in the autumn term \r\n•\tSecond School – 5 weeks in the spring term\r\n•\tCollaborative creativity placement – 1 week in the spring term\r\n\r\nThe collaborative creativity placement involves 4/5 trainees working in groups to deliver a creative curriculum within the same class.  It's an opportunity to try out new learning and really 'go to town' and enjoy the collaborative experience in a new class. Trainees tell us that this is a highlight of the year.\r\n\r\nIf a trainee is on a 3-7 course, placements will cover this age range. Likewise, on the 5-11 course, placements will cover the breadth of the years represented.  \r\n\r\nTrainees based at special needs schools, will have a mainstream placement in the autumn term and spend most of the spring term in another mainstream school \r\n\r\nTrainees who are on a specialism will have additional activities eg., visits, talking with senior leaders, attending additional courses. Most of these will be in school time. \r\n\r\nTrainees and mentors are visited regularly during the year by LETTA tutors.  They will observe trainees teaching alongside mentors and discuss progress with trainees and mentors.\r\n\r\nThere will also be visits from LETTA lead mentors to ensure mentors are supported in their role.\r\n\r\nPlease see the prospectus on (www.letta.org.uk) which lists current school partners.\r\n\r\nPlease note - Covid impact:  \r\nHow and when placements occur may change due to Covid.  Any unavoidable change to placements does not impact on a trainee's recommendation for QTS,\r\n\r\nLETTA tutors may not be able to visit schools as anticipated but plans are in place to monitor and discuss progress.","personalQualities":"\r\nLearning to be a teacher requires hard work, commitment and resilience. Without a genuine passion and high level of motivation, then these qualities are weakened.  You need these qualities to overcome any problem that you meet.   We look for people who can manage their time well, be organised and reflect honestly in their practice. We need people who can collaborate, share and have good social skills to enable them to liaise successfully with a range of  professional adults, colleagues and parents.  \r\nMost of all, you must enjoy being with children and appreciate the importance of your role in their lives.\r\n","otherRequirements":"The following is needed before training.  \r\n\r\n* Enhanced DBS\r\n* Fit for post check through a confidential questionnaire\r\n* An ENIC statement for overseas qualifications  with a translation\r\n* Proof of residential status in the UK\r\n* Photo ID\r\n* Evidence of current address \r\n* Passes in LETTA pre-entry tests - English & maths\r\n \r\n* It's desirable, not compulsory, to have  some experience of schools before applying.\r\n\r\nLETTA\r\n\r\n* can arrange  a School Experience day and volunteering if needed. See\r\n(https://getintoteaching.education.gov.uk/school-experience)\r\n* has a Ready to Teach initiative for TAs in LETTA schools. Contact (training@letta.org.uk) for more information.","status":1,"createdAt":"2021-07-06T10:53:54.208Z","updatedAt":"2021-07-30T21:30:58.811Z","cycle":"2024","applicationsOpenDateOther":"2021-10-18T00:00:00.000Z","fundingType":"fee","canSponsorStudentVisa":"no"}
