{"id":"c7b496d8-aea9-4bbf-90fe-006c6f8a9f31","name":"Primary","code":"2TTQ","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"28b4c615-ebfa-44d0-b47c-1913d3714d7a","name":"Blackpool Sea View Trust ( Mainstream Lead School -St Nicholas C of E Primary School)","isPublished":"Y","status":"R","vacancies":"F"},{"id":"2d3c91e5-167e-4cf8-ae61-af94b231ff0a","name":"Blackpool Sea View Trust ( SEND Lead School -Park Community Academy)","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"d1cec06e-f4c9-453a-987d-89780e2b17e0","code":"1XH","name":"Blackpool Sea View Trust School Direct ITT"},"accreditedBody":{"id":"9be9f611-2d36-431a-9109-7fcbbfc88fc8","code":"C99","name":"University of Cumbria"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"Equivalency tests will be verified by the University of Cumbria.","courseLength":"OneYear","feesUK":9250,"feesInternational":9250,"feeDetails":"Fees for this course are set at £9250.","aboutCourse":"The Programme\r\n\r\nBlackpool Sea View Trust offers 2 School Direct courses both leading to a Post Graduate Certificate in Education with QTS.\r\n\r\n●\tPrimary(2TTQ)\r\n●\tPrimary with SEND (38TK)\r\n\r\nOur School Direct programmes are so successful because they immerse you into life in a Primary or Special School. This is a full time course where you will become part of the staff team, observing, supporting and team teaching alongside highly skilled practitioners. You experience first-hand the wider professional responsibilities of a teacher as you become involved in after school clubs, CPD events and a range of whole school events. Students will spend 3 days per week in their host schools when not on placement.\r\n\r\nAlongside this you will receive 2 day per week of high quality training around pedagogy and practice delivered by experienced teachers and University tutors.\r\n\r\nOpportunities for trainees to work or study collaboratively will be a focus of our training programme. We also provide opportunities to attend relevant conferences and CPD events as well as team building activities across the year. \r\n\r\nStudents are allocated to three host schools over the year and complete an assessed placement in each. Students will have an assigned mentor in each school. Our mentors are mentor trained by the University of Cumbria and attend regular meetings with our course leads. Further support is also available through the University Partnership Lead and the Programme Partnership Lead.\r\n\r\nOur Primary PGCE with QTS programme is run in partnership with the University of Cumbria. During this course you will undertake two 30-credit masters level modules to gain a PGCE. These modules are practically focused and titled ‘Building Professional Understanding’ and ‘Enhancing Professional Practice’. They involve a total of 3 written assessments, one of which is a formative piece to support your academic development. The modules are taught by University of Cumbria lecturers who ensure that theory and practice are closely entwined to inform your teaching and provide a toolkit to take forward in your career. \r\n\r\nThis collaborative approach to teacher training ensures that students have access to both excellent school-based practice and well-regarded academic input which has been planned to create a coherent and valuable learning experience. All training provided is delivered at a location within Blackpool.\r\n\r\nThis programme is in its 6th year and we are extremely proud of our 100% pass rate.","interviewProcess":"\r\nBlackpool Sea View Trust works in conjunction with the University of Cumbria to select suitable candidates to take through to our interview process. This will include initial safeguarding checks and whether candidates meet minimum entry requirements. \r\n\r\nIf selected for interview you will be invited to attend for an interview at one of the School Direct Alliance schools. The interview will consist of an academic task, a 20 minute mini teach and a formal interview. \r\n","howSchoolPlacementsWork":"\r\nThere are 3 formal assessed placements as part of the programme. \r\n\r\n-6 weeks placement in the Autumn term( Beginning) \r\n-6 week placement in the Spring term(Developing)\r\n-9 week placement in the Summer term(Extending) \r\n\r\nYou will be required to teach in 2 different age phases and in 3 different school settings. \r\n\r\nStudents undertaking our Primary Programme will be hosted in 3 mainstream schools, however, a popular feature of our Primary programme is the opportunity to be hosted and undertake one assessed placement in a specialist school setting. \r\n\r\nHost and placement schools are allocated following a discussion around where a student lives, ability to travel and specific needs which might impact on the placement. All placements are sources by Blackpool Sea View Trust. Students are not expected to find their own placements.\r\n\r\nStudents are supported through their placements by a mentor. There are a number of observations carried out followed by reflective feedback and evaluation. All students work with their mentor to set targets against the teaching standards throughout their placement.","personalQualities":"\r\nWe are looking for candidates who have a passion for teaching, someone who enjoys a challenge and who puts children and their needs first. Experience of working with children or young people in either a paid or voluntary capacity is desirable however not essential. If accepted onto our course we will offer our prospective students the opportunity to gain additional experience in our Blackpool Sea View Trust schools before starting the course if this is something they would like to do.","otherRequirements":"","status":1,"createdAt":"2021-07-12T13:49:19.601Z","updatedAt":"2021-09-28T17:59:46.364Z","canSponsorStudentVisa":"yes","cycle":"2024"}
