{"id":"0762770a-46f3-487e-a457-f65800905c4a","name":"Primary","code":"2P2F","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"2d5d623c-5e8a-4a0e-a06e-b3efa0aab8aa","name":"WIMBORNE AREA","isPublished":"Y","status":"R","vacancies":"F"},{"id":"6e05efeb-080d-47c7-93c1-c0a87a39ab18","name":"STURMINSTER NEWTON AREA","isPublished":"Y","status":"R","vacancies":"F"},{"id":"3beb1677-4af7-4f4e-9099-3a2bcf1128fe","name":"BRIDPORT AREA","isPublished":"Y","status":"R","vacancies":"F"},{"id":"3b269b7e-622b-4d05-8e50-a7316738ef6e","name":"WEYMOUTH AREA","isPublished":"Y","status":"R","vacancies":"F"},{"id":"7ccbbef2-39e0-40f1-9225-d9067d5f57f0","name":"DORCHESTER AREA","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"19ade2eb-f141-4d67-8f63-b0908904aad6","code":"26E","name":"TADSS ITT Partnership"},"accreditedBody":{"id":"d41a1821-e35b-48eb-bf02-4842872b04a2","code":"E84","name":"University of Exeter"},"profPost":"PG","degreeGrade":"1","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"If you do not have the required pass at grade C/grade 4 in either GCSE English, Mathematics or Science, and are not able to gain this qualification before the start of the course, we will accept a Grade 4 pass in the English, Mathematics and Science equivalency tests offered by www.equivalencytesting.com (please do contact the PGCE Admissions team for further guidance before signing up for an equivalency test)","courseLength":"OneYear","feesUK":9250,"financialSupport":"For more information, please see our [Fees and finance]( https://www.exeter.ac.uk/teachertraining/apply/feesandfinance/) webpages. This includes information on the Success for All fund which may support those who experience unexpected financial challenges.","aboutCourse":"The TADSS programme has 3 strands:\r\n\r\n* In-school experience with an experienced class teacher and mentor, working towards meeting the [Teachers standards](https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/665522/Teachers_standard_information.pdf).  Trainees are in school for a minimum of three days each week. \r\n* Academic study with the University of Exeter - while trainees are based  in schools, they are registered with the University of Exeter.  The 2 Masters modules; Subject and Curriculum Studies and Education and Professional Studies, are delivered by distance learning, through two online 30-credit modules, plus other online tools.\r\n* 20 day taught programme - this is held in Dorset and provides an opportunity for the trainees to come together.  The programme is taught by leading classroom practitioners from across our partnership.  Subjects include - \r\n* \r\n* Safeguarding, code of conduct and safer working practices\r\n* Teaching & Learning\r\n* Classroom & behaviour management (including  working together)\r\n* Planning and assessment\r\n* Support for applications and interviews \r\n* Maths\r\n* Literacy\r\n* Science\r\n* Special Educational Needs / Disability (SEND) - policy and practice\r\n* SEND – the Inclusive classroom\r\n* SEND – Role of SENCo-ordinator\r\n* SEND – Communication needs \r\n* SEND - Multi - Sensory Teaching and learning\r\n* Social Emotional Mental Health needs & Attachment\r\n* Special school experience\r\n* Early years’ experience - 1 day in host school or feeder nursery\r\n* Assessment for learning\r\n* History and Geography\r\n* Religious Education\r\n* Design Technology\r\n* Modern Foreign Languages\r\n* Physical Education / Sport\r\n* Art, Music,  Drama and Dance\r\n* Computing\r\n* English as an Additional Language\r\n* PSHE (British values & Diversity)\r\n\r\nFor the taught programme, the trainees come together in one of our partner schools which may involve some travel for the trainees. Previous trainees have told us that the taught course is a particular highlight of the programme.\r\n\r\nTo gain Qualified Teacher Status, our trainees gather the evidence that shows they met the teacher standards in both Key Stage 1 and 2.  This is assessed by the University Visiting Tutor.\r\n\r\nTo be awarded a Post-Graduate certificate of Education, our trainees must reach the required level in their assignments.\r\n","interviewProcess":"Applicants are invited to attend one of our assessment days.  They are notified by email and letter, with details of the assessment process. Usually, the assessment sessions are held in one of our partner schools.  \r\n\r\nThere are 3 elements to the assessment day:\r\n\r\n* Plan and deliver a short activity with a group of children (usually 6 - 8 pupils of mixed ability)\r\n* A reflective written activity on an aspect of teaching and learning\r\n* An interview with a representative from TADSS and the head teacher of the hosting school\r\n\r\nShould the guidance require changes to this, we will change the assessment process to an online activity which encompasses as much of the above as possible.\r\n\r\nThe offer of a place is made to the applicant through UCAS by the University of Exeter.  Places are often conditional as some applicants may be completing degrees or relevant qualifications.  Also, all applicants must:\r\n\r\n* Complete a confidential medical questionnaire to ensure they are fit to teach\r\n* A satisfactory enhanced Disclosure and Barring Services disclosure.  ","howSchoolPlacementsWork":"Trainees on our programme complete 2 contrasting school placements in our partner first or primary schools.  The main placement is for the Autumn and most of the Summer terms, with a contrasting placement in the Spring term.  All our placements are with primary phase pupils.  \r\n\r\nAs we have a broad partnership of nearly 50 schools we try to place our trainees within 30 minutes of their home address.   We take the trainees experience into account when placing them to ensure they gain different experiences in their placements, including different key stages and contexts.  \r\n\r\nDuring the placement, the trainee works closely with their classroom teacher (their Lead Mentor) to develop their skills and experience. This is a very personalised experience.   Each week a focus is agreed with the class teacher.  Trainees meet with their Reflective Mentor once a month to review their evidence and experience. \r\n","personalQualities":"We are looking for enthusiastic applicants with an interest in primary education who have the drive to become critically reflective teachers and agents of change.","otherRequirements":"In addition to the academic requirements listed, selection is based on performance during the assessment, a satisfactory fitness to teach assessment and a satisfactory DBS enhanced disclosure.\r\n\r\nAlthough not essential, it would be an advantage to be able to reflect on any school-based experience or experience working with young people in another context at interview.\r\n\r\n\r\n","status":1,"createdAt":"2021-07-06T10:57:05.207Z","updatedAt":"2021-09-09T10:50:31.324Z","canSponsorStudentVisa":"yes","cycle":"2024"}
