{"id":"0d38d787-0a13-41d9-ad5a-4c53ca981a35","name":"Physics","code":"2H5Y","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"bf97cd0a-224c-43d3-a021-84143df13e8d","code":"F3","name":"Physics"}],"locations":[{"id":"a2cd3e49-4a2a-4cf0-94cc-69b536f1c0e0","name":"Teach Manchester","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"b506ae4a-ae1b-46cb-9964-0bc1fc269157","code":"1HJ","name":"Teach Manchester"},"accreditedBody":{"id":"9d03acb4-95ce-41e1-8458-0b4bec147b6b","code":"M20","name":"The University of Manchester"},"profPost":"BO","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"At least half of your degree content should be strongly related to physics in the relevant degree (eg, mechanical or electrical engineering). A grade B in physics at A-level (or equivalent), or grade C if you can demonstrate sustained academic progression since A-level, and at least one other Science or Maths A-level will also be required.","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feesInternational":20000,"financialSupport":"Subject Knowledge Enhancement (SKE)\r\n\r\nFunded courses may be available for those who hold a PGCE place offer conditional upon topping up subject knowledge. The main focus is       national priority subjects including Mathematics, Physics, Chemistry,    Biology, English, Computing with ICT, RE and Modern Foreign Languages (French and Spanish).\r\n","aboutCourse":"Our School Direct course consists of a variety of learning experiences, focused on practical training in teaching and learning related skills. This practical training is underpinned by the development of participant’s knowledge and understanding of education theories, ideas and concepts and by enhancing their awareness of current educational issues and developments. \r\n\r\nThis course will be delivered in partnership with The University of Manchester, who will award both Qualified Teacher Status and 60 Masters level credits as a PGCE on successful completion.\r\n\r\n","interviewProcess":"All programmes include a panel interview where we are looking to find our more about your skills, knowledge, experience and passion.  \r\n\r\nThe interview process takes place over a half-day at our lead School St Peter's High RC School.\r\n- an introductory talk\r\n- a personal interview designed to identify your suitability and commitment to teaching\r\n- a short presentation \r\n- a subject knowledge assessment\r\n- identity and qualification checks (please provide photographic ID, proof of address and copies of your academic qualifications)\r\n\r\nAll offers we make after interview will be conditional on; satisfactory medical clearance, clearance through the Disclosure and Barring service, validation of any declared qualification and the acquisition of any pending qualifications.  Individual offers may have additional conditions and you are advised to carefully read these.\r\n","howSchoolPlacementsWork":"You will become part of your main placement school team from September, this is earlier than University led programmes.  You will receive intensive support from our experienced team of teachers and mentors from the beginning of your placement.  You will build your skills through observation, reflection, and attendance at both alliance training sessions and university led sessions.  This will support you in building your skill set towards teaching whole class lessons, and then onto a significant timetable by the end of the year.","personalQualities":"Our strongest applicants have undertaken some observation in a school and reflected on their experiences and the role of the teacher.","otherRequirements":"Grade B in physics at A-level (or equivalent), or grade C if you can demonstrate sustained academic progression since A-level, and at least one other science or maths A-level.\r\n\r\nWe also recommend you check the Department of Education website at (www.education.gov.uk/get-into-teaching) for the latest updates.\r\n\r\n A Disclosure and Barring Service Check and satisfactory DfE Fitness to Teach health form are required.","status":1,"createdAt":"2021-07-06T10:48:07.472Z","updatedAt":"2021-09-21T10:48:51.460Z","canSponsorStudentVisa":"yes","cycle":"2024"}
