{"id":"2d4582f6-b800-4eb1-8448-c0b38df2e93b","name":"Religious Education","code":"4XXH","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"724b5d16-28dd-4431-bc17-ea4be4daedc4","code":"V6","name":"Religious education"}],"locations":[{"id":"7c757b4d-3b81-4f79-8de6-682a607f15b2","name":"Main Site","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"97b2248c-a0d3-43e8-ae12-cd916e83b3d5","code":"1P8","name":"Lampton Academy"},"accreditedBody":{"id":"4dbcd8ea-d273-432a-8aaf-02e6e6bae4de","code":"2AY","name":"Lampton LWA SCITT"},"profPost":"PG","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","aboutCourse":"The School Direct 11-16 course is aimed at developing the professional skills, knowledge and understanding necessary to become an outstanding reflective practitioner who can provide creative, challenging and purposeful teaching.  Embedded in a school from the beginning of the course you will receive training on one day a week, enabling you to make immediate links between taught sessions and school experience. Delivered by outstanding current practitioners, with the support of experienced and specially trained school mentors, the course is innovative in its approach to general professional studies, using the expertise of the Teaching School and its partners to inform the programme. The course is active and demanding, including simulations of classroom activities, group sessions and sharing developments in pedagogy. These sessions provide support and challenge to help you progress. Assignments for QTS are focused on your direct experience in the classroom. Trainees may take up a teaching post in the placement school following graduation but this is not guaranteed.  \r\n\r\nThe course is supported by the expertise of Roehampton University who provide teaching and academic support for a PGCE (M), library access and taught sessions by subject tutors. Written assignments give you the opportunity to explore the most recent developments into teaching and learning and to research an aspect of your practice in school.\r\n\r\nThe course encourages you to develop your knowledge and understanding of the major religious traditions, other religious traditions and contemporary secular philosophies. We have good relations with communities representing the Buddhist, Christian, Hindu, Jewish, Muslim and Sikh faiths. West London students in schools offer an invaluable resource.\r\nYou will also be expected to look critically at the difficult philosophical issues raised by religion and to develop your thinking about the place and significance of religion today. Thus there is a strong emphasis not only on what we can learn about religions, but what we can learn from religion, even if we do not share a particular religious world view. In schools, this will mean examining practical strategies for enabling religion to contribute to pupils’ spiritual, moral, social and cultural development.\r\nYou will have access to a post 16 experience, to the primary curriculum and have a second placement in a contrasting school as part of the course.\r\n\r\n","interviewProcess":"A rigorous selection and interview process is undertaken so that only candidates with excellent subject knowledge and aptitude for teaching enter the programme. Interviews take place at a number of schools in the London West Alliance and at Lampton LWA SCITT or a partnership Primary School. The interview process is designed to assess suitability to teach and will focus on the applicant’s \r\n•\tCommunication skills\r\n•\tPotential to teach and understanding of a teacher’s role\r\n•\tSubject knowledge\r\n•\tPersonal, organisational and transferrable skills\r\nThe assessment day consists of the following:\r\n•\tA short teaching activity with pupils focused on clear communication and potential to teach\r\n•\tA group activity focussed on communication and listening skills and the candidates’ vision and values about teaching\r\n•\tA panel interview\r\n•\tConfirmation of identity and qualifications\r\n•\tThe opportunity to identify development needs\r\n\r\nAfter the assessment day you will receive formal notification via UCAS. You may be made a conditional offer (For example, dependent on the skills tests, equivalency testing, subject knowledge enhancement courses). You may be made an unconditional offer (still subject to enhanced safeguarding clearance). When you have accepted a place on our course we will contact you with details on how to for a successful start.  If you are not successful then members of the SCITT interview panel will be available to give you feedback.\r\n","howSchoolPlacementsWork":"There are currently 14 schools in the LWA SCITT partnership, mainly located in or near the borough of Hounslow, although some are situated more widely across London.  The course is for 11-16 but we guarantee experience of KS5 as part of the programme.  Trainees have 2 placements; the first placement is their main school.  However, they will spend half a term from mid-February until Easter in a contrasting second placement school","personalQualities":"We actively welcome applications from a range of trainees with different backgrounds. We believe our pupils benefit from working with teachers with different experiences. From more mature students, valuing their experience of life and of the world of work, to applicants straight from their first degrees.  However all potential candidates should have:\r\n- good subject knowledge\r\n- excellent communication skills\r\n- commitment to lifelong learning\r\n- ability to reason\r\n- empathy\r\n- resilience\r\n- stamina\r\n- excellent organisational skills\r\n- high professional standards\r\n- above all a strong sense of moral purpose and belief in the transformative purpose of education.","otherRequirements":"1. Candidates will normally have of a minimum of three years relevant experience.\r\n2. Successful candidates are subject to Enhanced Disclosure and Barring Service and Prohibition checks. Those who have worked or lived abroad for 12 months or more cumulatively in the previous 10 years to application will need to provide an Overseas Police check.\r\n3. All candidates will be required to complete Skills Tests  in Numeracy and Literacy prior to starting the programme.    We require that all skills tests are successfully completed by June . You cannot begin a course without them.\r\n","status":2,"createdAt":"2021-07-06T10:56:33.103Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"Salaries will be paid by placement schools based on the unqualified teacher scale.  The PGCE qualification incurs no extra tuition fee and therefore there are no other fees for this course"}
