{"id":"4e8c0192-064f-4724-b6a4-bcd42126c894","name":"Computing","code":"38M8","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"e6be6a9c-8696-4b88-8fbd-1ba1bef1b6fc","code":"11","name":"Computing"}],"locations":[{"id":"7c757b4d-3b81-4f79-8de6-682a607f15b2","name":"Main Site","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"97b2248c-a0d3-43e8-ae12-cd916e83b3d5","code":"1P8","name":"Lampton Academy"},"accreditedBody":{"id":"4dbcd8ea-d273-432a-8aaf-02e6e6bae4de","code":"2AY","name":"Lampton LWA SCITT"},"profPost":"BO","degreeGrade":"1","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"GCSEs (or approved equivalents) at grade 4 (grade C) or above in both mathematics and English Language. We accept the equivalency tests in mathematics offered by Equivalency Testing and A Star Teachers.   We accept the equivalency tests in English offered by IELTS with a score of 7.0 (https://www.ielts.org/) or above or Trinity ISE III [Trinity College](https://www.trinitycollege.com/qualifications/english-language/ISE)","courseLength":"OneYear","aboutCourse":"The Researchers in Schools (RIS) Programme offers a tailored route into teaching exclusively for PhD graduates. It is specifically designed to utilise your academic expertise to the benefit of pupils, schools and universities. RIS is a three year programme, for details please refer to the RIS website: https://researchersinschools.org/\r\n\r\nIn the first year all RIS participants complete Initial Teacher Training to gain Qualified Teacher status. RIS participants at the LWA SCITT follow the School Direct programme as outlined below.\r\n\r\nThe School Direct 11-16 course is aimed at developing the professional skills, knowledge and understanding necessary to become an outstanding reflective practitioner who can provide creative, challenging and purposeful teaching.  Embedded in a school from the beginning of the course you will receive training on one day a week, enabling you to make immediate links between taught sessions and school experience. These are delivered by outstanding current practitioners, with the support of experienced and specially trained school mentors. The course is active and demanding, including simulations of classroom activities, group sessions and sharing developments in pedagogy. \r\n\r\nThe course is supported by the expertise of Roehampton University who provide teaching and academic support for a PGCE (M), library access and taught sessions by subject tutors. Written assignments give you the opportunity to explore the most recent developments into teaching and learning and to research an aspect of your practice in school. The University is at the forefront of computing education, with staff contributing to curriculum development, publications and policy at national and international level. \r\n\r\nTrainees learn about the challenges and opportunities of teaching computer science, IT and digital literacy across the 11-19 age range. The course looks at how approaches from the world of software development, such as agility and craftsmanship, have parallels in the classroom, and can be applied to teaching and learning in programming and digital media. The course equips you to develop your students’ computational thinking and ICT capability, within and beyond the subject curriculum. You will also gain an understanding of primary school and have a second, contrasting, school placement.\r\n\r\n\r\n","interviewProcess":"A rigorous selection and interview process is undertaken so that only candidates with excellent subject knowledge and aptitude for teaching enter the programme. Interviews take place at a number of schools in the London West Alliance and at the LWA SCITT. The interview process is designed to assess suitability to teach and will focus on the applicant’s \r\n•\tCommunication skills\r\n•\tPotential to teach and understanding of a teacher’s role\r\n•\tSubject knowledge\r\n•\tPersonal, organisational and transferrable skills\r\nThe assessment day consists of the following:\r\n•\tA short teaching activity with pupils focused on clear communication and potential to teach\r\n•\tA group activity focussed on communication and listening skills and the candidates’ vision and values about teaching\r\n•\tA panel interview\r\n•\tConfirmation of identity and qualifications\r\n•\tThe opportunity to identify development needs\r\n\r\nAfter the assessment day you will receive formal notification via UCAS. You may be made a conditional offer (For example, dependent on the skills tests, equivalency testing, subject knowledge enhancement courses). You may be made an unconditional offer (still subject to enhanced safeguarding clearance). When you have accepted a place on our course we will contact you with details on how to for a successful start.  If you are not successful then members of the SCITT interview panel will be available to give you feedback.\r\n","howSchoolPlacementsWork":"There are currently 14 schools in the LWA SCITT partnership, mainly located in or near the borough of Hounslow, although some are situated more widely across London.  The course is for 11-16 but we guarantee experience of KS5 as part of the programme.  Trainees have 2 placements; the first placement is their main school.  However, they will spend half a term from mid-February until Easter in a contrasting second placement school.  ","personalQualities":"We actively welcome applications from a range of trainees with different backgrounds. We believe our pupils benefit from working with teachers with different experiences.   All potential RIS candidates should have:\r\n- good subject knowledge\r\n- excellent communication skills\r\n- commitment to lifelong learning\r\n- ability to reason\r\n- empathy\r\n- resilience\r\n- stamina\r\n- excellent organisational skills\r\n- high professional standards\r\n- above all a strong sense of moral purpose and belief in the transformative purpose of education.\r\n- commitment to increasing the number of young people from underrepresented backgrounds who progress to highly-selective universities","otherRequirements":"1. Candidates will normally have of a minimum of three years relevant experience.\r\n2. Successful candidates are subject to Enhanced Disclosure and Barring Service and Prohibition checks. Those who have worked or lived abroad for 12 months or more cumulatively in the previous 10 years to application will need to provide an Overseas Police check.\r\n3. Literacy and numeracy competency to be assessed through the LWA SCITT.\r\n","status":2,"createdAt":"2021-07-06T10:56:32.700Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"Salaries will be paid by placement schools based on the unqualified teacher scale.  The PGCE qualification incurs no extra tuition fee and therefore there are no other fees for this course"}
