{"id":"e20e0aea-2570-46c8-82c3-d3ebb085b237","name":"Religious Education","code":"2TP4","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"724b5d16-28dd-4431-bc17-ea4be4daedc4","code":"V6","name":"Religious education"}],"locations":[{"id":"7c757b4d-3b81-4f79-8de6-682a607f15b2","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"97b2248c-a0d3-43e8-ae12-cd916e83b3d5","code":"1P8","name":"Lampton Academy"},"accreditedBody":{"id":"4dbcd8ea-d273-432a-8aaf-02e6e6bae4de","code":"2AY","name":"Lampton LWA SCITT"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"GCSEs (or approved equivalents) at grade 4 (grade C) or above in both mathematics and English Language. We accept the equivalency tests in mathematics offered by Equivalency Testing and A Star Teachers.   We accept the equivalency tests in English offered by IELTS with a score of 7.0 (https://www.ielts.org/) or above or Trinity ISE III [Trinity College](https://www.trinitycollege.com/qualifications/english-language/ISE)","courseLength":"OneYear","feesUK":9250,"aboutCourse":"The School Direct 11-16 course is aimed at developing the professional skills, knowledge and understanding necessary to become an outstanding reflective practitioner equipped with the subject specific skills, knowledge and understanding to teach religious studies across the 11-16 age range. \r\n\r\nThe course encourages you to develop your knowledge and understanding of the major religious traditions, other religious traditions and contemporary secular philosophies.  Our strong relationship with communities in West London, representing the Buddhist, Christian, Hindu, Jewish, Muslim and Sikh faiths provides an invaluable resource. You will also examine practical strategies for enabling religious studies to contribute to pupils’ spiritual, moral, social and cultural development.\r\n\r\nEmbedded in a school from the beginning of the course, you will receive central training at the SCITT one day a week, enabling you to make immediate links between taught sessions and school experience. These are delivered by outstanding current practitioners with the support of experienced and specially trained school mentors. The course is active and demanding, including simulations of classroom activities, group sessions and exploring the latest research in pedagogy.  \r\n\r\nThe course is supported by the expertise of Roehampton University who provide teaching and academic support for a PGCE (M), library access and taught sessions by subject tutors. Written assignments give you the opportunity to explore the most recent developments in the teaching of religious studies and to research an aspect of your practice in school.\r\n\r\nAt the start of the course you will complete a personal subject knowledge audit and begin an action plan to build on your subject knowledge. This is an important thread running through the programme.\r\n \r\nIn addition to the primary focus of the course on religious studies for the 11-16 curriculum, you will have access to a post 16 curriculum, an experience at primary school and a second placement in a contrasting school. By the end of the course you will have learnt how to develop and extend your pupils’ understanding, skills and knowledge in all its forms, how to organise, structure and assess work for a range of abilities and ages, how to meet the needs of individual learners and how to implement strategies promoting equal opportunities. \r\n\r\n\r\n\r\n\r\n","interviewProcess":"A rigorous selection and interview process is undertaken so that only candidates with excellent subject knowledge and aptitude for teaching enter the programme. Interviews take place at the LWA SCITT (Lampton School). The interview process is designed to assess suitability to teach and will focus on the applicant’s: \r\n\r\n•\tcommunication skills (literacy and oracy)\r\n•\tpotential to teach and understanding of a teacher’s role\r\n•\tsubject knowledge\r\n•\tpersonal, organisational and transferable skills\r\n\r\nThe assessment day consists of the following:\r\n\r\n•\ta short teaching activity with pupils focused on clear communication and potential to teach\r\n•\ta group activity focused on communication and listening skills and the candidates’ vision and values about teaching; a reading and writing task\r\n•\ta panel interview\r\n•\tconfirmation of identity and qualifications   \r\n•\tthe opportunity to identify development needs\r\n\r\nAfter the assessment day you will receive formal notification via the DfE portal. You may be made a conditional offer (for example, dependent on the skills tests, equivalency testing, subject knowledge enhancement courses). You may receive an unconditional offer (still subject to enhanced safeguarding clearance). When you have accepted a place on our course we will contact you with details on starting the programme.  \r\n","howSchoolPlacementsWork":"There are currently 14 schools in the LWA SCITT partnership,  mainly located in or near the borough of Hounslow, although some are situated more widely across London.  The course is for 11-16 but we guarantee experience of KS5 as part of the programme.  Trainees have 2 placements, the first placement is their main school.  However, they will spend half a term from January until mid-February in a contrasting second placement school.  ","personalQualities":"We actively welcome applications from a range of trainees with different backgrounds. We believe our pupils benefit from working with teachers with different experiences; from more mature students, valuing their experience of life and of the world of work: to applicants straight from their first degrees.  However all potential candidates should have:\r\n-  a strong sense of moral purpose and belief in the transformative purpose of education\r\n- high professional standards\r\n- a passion for their subject \r\n- excellent communication skills\r\n- ability to think critically\r\n- excellent organisational skills\r\n- empathy\r\n- resilience\r\n- stamina\r\n\r\n","otherRequirements":"1. Successful candidates are subject to Enhanced Disclosure and Barring Service and Prohibition checks. Those who have worked or lived abroad for 12 months or more cumulatively in the previous 10 years to application will need to provide an Overseas Police check.\r\n2. Literacy and numeracy competency to be assessed through the LWA SCITT.\r\n\r\n","status":1,"createdAt":"2021-07-06T10:56:32.390Z","updatedAt":"2021-10-04T08:47:56.073Z","canSponsorStudentVisa":"no","cycle":"2024"}
