{"id":"d40af374-cf10-4f4d-acf3-6ef7960b4fd6","name":"School Direct with Manor Primary","code":"3BJ7","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"c15f85bc-2659-40a5-8832-9f8d3fdfc3e9","name":"Manor Primary School","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"dece1cf6-1208-4f4d-b886-cec23b540a35","code":"1QO","name":"Manor Primary School"},"accreditedBody":{"id":"c357e0fa-802e-471b-818a-d0cd1434f9cd","code":"B32","name":"University of Birmingham"},"english":"1","maths":"1","science":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feesInternational":9250,"aboutCourse":"The Manor Partnership strongly believes in creating a \"best fit\" for every school direct trainee in the belief that they are one of the staff team and a potential employee.\r\n\r\nCarefully planned induction and expert mentoring and support are key to our trainees success. Training will be delivered at Manor Primary from expert facilitators, providing an outstanding \"hands on\" school based experiences. A bespoke training package for each trainee, including additional support in specialist subjects .\r\n\r\nOur School Direct trainees feel like members of staff, with support from their peers; the staff and University team; have weekly school practice in one of our schools and find themselves positioned at the forefront of education, well prepared and as much sought after and highly employable teachers.\r\n\r\nAll of our School Direct Trainees gain teaching posts before the end of their school direct year.\r\n\r\nOur school direct course requires you to spend 25 days at The University of Birmingham and the remainder of the school direct year in school with us at Manor Primary or one of other outstanding schools with our Trust.\r\n*You will receive facilitated sessions based on live observations around high quality teaching and learning as well as the full primary curriculum. \r\n*The observations of teaching and learning and the primary curriculum will be of outstanding teachers so you will learn from the very best.\r\n*There will be two assessed assignments across the school direct year.\r\n*You will have three teaching placements (teaching practices) that begin with observations, then build to team teaching then you delivering lessons yourself. You will have at least one placement in our school, the outstanding Manor Primary and the others in our local partners schools.\r\n*You will be given a University mentor and a school mentor to support your school direct journey.\r\n*Manor Primary is consistently one of the best performing schools in the country and has been for more than a decade.\r\n\r\n","interviewProcess":"The interview process will consist of a short presentation on the theme of \"what makes an outstanding teacher\" and then followed by a short interview with our school direct lead mentor and our Headteacher.\r\nAt interview we will give you a tour of our school so you can see the school in action.\r\nYou will be required to take The University of Birmingham's maths and English skills tests so that we have a good indication that you will pass the skills tests.\r\nYou will only need to attend one interview.","howSchoolPlacementsWork":"Our schools are partner schools that are within 5 miles of our school and have a good or outstanding Ofsted judgement. They are schools we have worked with over a number of years and we are confident they provide outstanding support for trainees.\r\n\r\nYour placements will be in key stage 1 and key stage 2 . Your first placement in the key stage of your choice and the final placement in the key stage of your choice.","personalQualities":"We are looking for candidates who want to make a real difference to children's life chances. candidates who are passionate about providing children with the very best education possible.","otherRequirements":"","status":2,"createdAt":"2021-07-06T10:50:57.575Z","canSponsorStudentVisa":"yes","cycle":"2024"}
