{"id":"5fa249f4-e45e-47ad-ae90-821748df23b2","name":"Geography","code":"26X6","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SC","studyMode":"B","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3f47e67b-7fa5-4947-a5a0-74d528cd2a87","code":"F8","name":"Geography"}],"locations":[{"id":"8d0d7391-3b73-423a-afa0-ae9039b9f21b","name":"Thomas Keble School","isPublished":"Y","status":"R","vacancies":"B"},{"id":"84109ea7-5095-440e-b842-7923ffe8e9da","name":"Sir William Romney's School","isPublished":"Y","status":"R","vacancies":"B"},{"id":"a3cfbe4d-0eeb-41c1-84a4-55f8e6005dcd","name":"Katharine Lady Berkeley's School","isPublished":"Y","status":"R","vacancies":"B"},{"id":"cbc6f86b-b081-48e5-9ac7-2ec08d45deda","name":"Wyedean School and Sixth Form Centre","isPublished":"Y","status":"R","vacancies":"B"},{"id":"916d965a-c21b-4e68-8a2c-ab7695f1468d","name":"Cheltenham Bournside School","isPublished":"Y","status":"R","vacancies":"B"},{"id":"3b6ee4c2-8212-4b1a-830e-3c917182c1e1","name":"Cleeve School","isPublished":"Y","status":"R","vacancies":"B"},{"id":"c29b36ab-e224-4741-b1d6-36d167a06fb7","name":"Farmor's School","isPublished":"Y","status":"R","vacancies":"B"},{"id":"9d797415-ba5b-49f6-ae5b-3e2af1c91034","name":"Cirencester Kingshill School","isPublished":"Y","status":"R","vacancies":"B"},{"id":"fcd8eaae-03b5-4524-8b74-c6780eb4bc2c","name":"Newent Community School","isPublished":"Y","status":"R","vacancies":"B"},{"id":"1d6225c8-d78d-43da-a7b1-057458270ae4","name":"Maidenhill School","isPublished":"Y","status":"R","vacancies":"B"},{"id":"c32748ae-e609-4638-b720-c269e4206cb8","name":"Pittville School","isPublished":"Y","status":"R","vacancies":"B"},{"id":"25a2be51-a937-4301-8884-7aa2ce503667","name":"Chosen Hill School","isPublished":"Y","status":"R","vacancies":"B"},{"id":"3f1b33bf-f542-4cb2-bd0e-998c5d5303e4","name":"Churchdown School Academy","isPublished":"Y","status":"R","vacancies":"B"},{"id":"c65afe6f-358f-4ae9-9457-55bbf70ef27a","name":"Stroud High School","isPublished":"Y","status":"R","vacancies":"B"},{"id":"2dc2224b-d75e-47d2-a93d-91d3535c968b","name":"The Crypt School","isPublished":"Y","status":"R","vacancies":"B"},{"id":"b881ecac-c342-459e-8fb0-1e0c754c128e","name":"Tewkesbury School","isPublished":"Y","status":"R","vacancies":"B"},{"id":"ad00f15f-ecea-41c6-8855-5aa481ce84e8","name":"Cirencester Deer Park School","isPublished":"Y","status":"R","vacancies":"B"},{"id":"4bcaea15-b9c5-4c2e-8ab0-78acded663a1","name":"Rednock School","isPublished":"Y","status":"R","vacancies":"B"},{"id":"0711514b-f302-446b-b6c7-47bbfea0b973","name":"Dene Magna School","isPublished":"Y","status":"R","vacancies":"B"},{"id":"359954a9-07f0-448f-ba12-9d01a5658827","name":"Severn Vale School","isPublished":"Y","status":"R","vacancies":"B"},{"id":"91348ef1-51ad-47cf-bda6-56bfb53c6abc","name":"Barnwood Park School","isPublished":"Y","status":"R","vacancies":"B"},{"id":"c703be5d-9b0e-433c-91e4-cf6dd3dc351e","name":"Chipping Campden School","isPublished":"Y","status":"R","vacancies":"B"},{"id":"f913b484-2991-4776-ac81-4a1bb383fa6a","name":"Sir Thomas Rich's School","isPublished":"Y","status":"R","vacancies":"B"},{"id":"b567e58d-e5bf-4dc7-a380-9ab644163759","name":"St Peter's High School","isPublished":"Y","status":"R","vacancies":"B"},{"id":"8f27029c-fe60-452c-966e-3248ebd63476","name":"Ribston Hall High School","isPublished":"Y","status":"R","vacancies":"B"},{"id":"e3d72293-76a7-4607-a086-d001d19c953f","name":"Archway School","isPublished":"Y","status":"R","vacancies":"B"}],"trainingProvider":{"id":"e6c26d28-03d4-443c-9b65-5db7e183966c","code":"G48","name":"Gloucestershire Initial Teacher Education Partnership (GITEP)"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We do accept some overseas qualifications, in line with the University of Bristol.  We do not normally accept UK candidates who do not have GCSE English and maths.  We do accept equivalency tests in some circumstances, especially for trainees educated abroad.  Please contact us if this may apply to you.","courseLength":"OneYear","feesUK":9250,"financialSupport":"GITEP does operate a hardship fund for trainees experiencing financial difficulties.  We are supported by Gloucestershire Association of Secondary Headteachers Ltd, a charity dedicated to supporting teacher training and professional development in Gloucestershire schools.  The trustees of GASH Ltd, who are all secondary headteachers, are aware that the decrease in bursaries means that some trainees will find training difficult financially and have increased the amount available to our hardship fund.","aboutCourse":"Full details of the programme can be found on our [website](https://www.gitep.org.uk).  \r\n\r\nOur programme has 3 phases:\r\n\r\n1.\tExplore\r\n\r\nExplore covers induction and parent placement 1. Three weeks of taught professional studies in September are followed by three weeks of school induction, exploring the application of education theory in the context of the parent school. After October half-term, assessed teaching time gradually increases, to 9-11 hours a week by Christmas. In addition, trainees continue to explore aspects of subject pedagogy with their subject leaders and mentors. The PGCE assignment focuses on special educational needs and disabilities. Trainees will explore the differing needs of pupils and how teachers adapt their practice to include them in learning.\r\n\r\n2.\tEmbed\r\n\r\nEmbed covers the twin placement, taking place between Christmas and Easter. This gives trainees the opportunity to embed their practice in a different school context, a contrasting one as far as possible. Trainees will be encouraged to try new approaches and to be more creative as they look to embed their learning from Explore.  Assessed teaching time increases to 11-13 hours a week.  The PGCE assignment focuses on short to medium term planning, giving trainees the opportunity to reflect on their subject learning and embed this in their planning.\r\n\r\n3.\tEnhance\r\n\r\nEnhance covers parent placement 2, from Easter to June. Trainees return to a familiar environment with the opportunity to really progress and enhance their practice. The placement aims to give a better understanding of the big picture, with longer term planning and use of a variety of assessment techniques. Assessed teaching time increases to 13-15 hours a week.  The PGCE assignment will focus on researching an area of interest within the subject curriculum, enhancing trainees understanding of subject pedagogy.\r\n\r\nSubject pathway\r\n\r\nA distinctive feature of our programme is that subject sessions take place every week throughout the programme, with the subject leader and other trainees in your subject. These sessions focus on exploring current issues in your subject, developing practical teaching strategies and subject expertise for teaching. \r\n\r\nAssessment\r\n\r\nThe programme leads to a PGCE awarded by the University of Bristol, with 60 Master’s level credits. No training takes place at the University - subject tutors from the University will visit the GITEP sessions in Gloucestershire.\r\n\r\n\r\n\r\n\r\n\r\n","interviewProcess":"Interviews take place either at the GITEP SCITT base at Maisemore, near Gloucester, or at one of our partner schools. The interview will normally be with the subject leader and the GITEP leadership team. Interviews typically last no more than two hours.\r\n\r\nThe interview will include a teaching episode presented to the interview panel and a formal interview. There will also be an opportunity to discuss the programme, any particular needs the candidate may have and potential placement schools.\r\n\r\nWe work with four School Direct lead schools across the county (Balcarras, Pate’s Grammar School, Marling and The Cotswold School) and many of our applicants apply to one or more of these as well as GITEP SCITT. Someone from GITEP will be on the interview panel for School Direct interviews and we will do our best to avoid calling you for a separate interview with GITEP - the process is the same.\r\n","howSchoolPlacementsWork":"The GITEP programme follows a “parent/twin/parent” structure, with three school placements. Trainees are placed in a “parent” school from October to December, a contrasting “twin” school from January to March and return to the “parent” school from April to June. Placements are 9-10 weeks in length.\r\n\r\nEach school has a training manager, responsible for overseeing all the trainees within the school, and trainees are allocated a mentor, a subject specialist who will see them most days and meet with them individually once a week to review their training and plan next steps.\r\n\r\nPlacement schools are mostly in Gloucestershire but we do work with a few schools in neighbouring counties - around 30 schools in total. When placing trainees, we take account of travel distance, particular needs and trainee requests. We are well aware that most of our applicants are looking for placements in local schools and we will not require trainees to drive long distances or move home between placements. The vast majority of our trainees travel less than 20 miles to placement schools. \r\n\r\nWhen applying to GITEP you will be asked to name a partner school as a preferred location.  We cannot guarantee that one of your placements will be at this school but we will do our best to place you close by. \r\n\r\nOur four School Direct lead schools (Balcarras School, Pate's Grammar School, The Cotswold School and Marling School) have their own applications and you can apply directly to them as well as to GITEP SCITT.\r\n\r\nOur programme covers the 11-18 age range. If trainees are placed in a 11-16 school for their first placement, we ensure that the second placement gives the opportunity for sixth form experience.\r\n\r\nOur partnership includes some of the highest performing schools in the country.  Over one third of our current placement schools are rated outstanding by Ofsted and last year 84% of our trainees had at least one placement in an outstanding school.\r\n\r\n\r\n","personalQualities":"There is no profile of \"the perfect teacher\".  However, our trainees do share enthusiasm for their subjects, a genuine interest in how children learn and a commitment to doing their best for every child.  \r\n\r\nIt is a training year and there will be times when things don't go according to plan.  We want trainees who are happy to take risks, seek feedback and reflect constantly on how they could improve their teaching.","otherRequirements":"All applicants will require an enhanced DBS (Disclosure and Barring Service) certificate before commencing training.\r\n\r\nTime in schools is not a requirement of the programme and should not hold up your application.  It can be useful and we may be able to help organise this.  We run a series of taster days and events in schools over the year, listed on our [website](https://www.gitep.org.uk).  ","status":1,"createdAt":"2021-07-06T10:50:44.715Z","updatedAt":"2021-09-28T13:32:30.284Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
