{"id":"e78bcfb4-29ac-4714-8541-dbdb07d21258","name":"Religious Education","code":"2HTR","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"724b5d16-28dd-4431-bc17-ea4be4daedc4","code":"V6","name":"Religious education"}],"locations":[{"id":"02d596b6-115e-442c-b104-165ca0f9f83e","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"cc291444-fd22-49ae-9190-c74d20e10083","code":"1H2","name":"Loreto School Direct Alliance"},"accreditedBody":{"id":"812b70c4-7fc4-46fc-975b-3e4d00f77dc4","code":"M40","name":"The Manchester Metropolitan University"},"profPost":"PG","degreeGrade":"9","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feesInternational":19000,"aboutCourse":"Our School Direct course consists of a variety of learning experiences, focused on practical training in teaching and learning related skills. This practical training is underpinned by the development of participant’s knowledge and understanding of education theories, ideas and concepts and by enhancing their awareness of current educational issues and developments. \r\n\r\nThis course will be delivered in partnership with Manchester Metropolitan University, who will award both Qualified Teacher Status and 60 Masters level credits as a PGCE on successful completion.\r\n\r\n","interviewProcess":"All programmes include a panel interview during which we assess your skills, knowledge, experience and passion.  \r\n\r\n\r\nThe interview process takes place at our lead School Loreto Grammar School.\r\n- a personal interview designed to identify your suitability and commitment to teaching\r\n- you will teach a short lesson to a small group of pupils \r\n- a subject knowledge assessment\r\n- identity and qualification checks (please provide photographic ID, proof of address and copies of your academic qualifications)\r\n\r\nAll offers we make after interview will be conditional on: satisfactory medical clearance, clearance through the Disclosure and Barring service, validation of any declared qualification and the acquisition of any pending qualifications.  Individual offers may have additional conditions and you are advised to carefully read these.\r\n\r\n","howSchoolPlacementsWork":"You will become part of your main placement school team from September. This is earlier than University led programmes.  You will receive intensive support from our experienced team of teachers and mentors from the beginning of your placement.  You will build your skills through observation, reflection, and attendance at both alliance training sessions and university led sessions.  This will support you in building your skill set towards teaching whole class lessons, and then onto a significant timetable by the end of the year.","personalQualities":"Our strongest applicants have undertaken some observation in a school and reflected on their experiences and the role of the teacher.","otherRequirements":"We recommend you check the Department of Education website at (www.education.gov.uk/get-into-teaching) for the latest updates.\r\n\r\n\r\n A Disclosure and Barring Service Check and satisfactory DfE Fitness to Teach health form are required.","status":1,"createdAt":"2021-07-06T10:56:50.353Z","updatedAt":"2021-10-12T08:20:15.306Z","canSponsorStudentVisa":"yes","cycle":"2024"}
