{"id":"75b53143-5c34-478c-baf1-1d403f68f3cb","name":"History","code":"24XG","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"5a3609a0-5bbb-4377-b919-5d89932ab622","code":"V1","name":"History"}],"trainingProvider":{"id":"7c7d6af2-4991-4a36-9fb0-be730c036a33","code":"1JL","name":"Rivington School Direct"},"accreditedBody":{"id":"812b70c4-7fc4-46fc-975b-3e4d00f77dc4","code":"M40","name":"The Manchester Metropolitan University"},"profPost":"BO","english":"3","maths":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feesInternational":15500,"aboutCourse":"\r\nOur one-year Postgraduate Certificate in Education (PGCE) prepares you to teach across the history secondary school curriculum. You’ll explore inclusive ways to teach history, and develop your ability to teach different historical concepts such as causation, interpretation, change and continuity. Some of the key topics you’ll consider include how to use sources, the importance of the medium of language when teaching history, differentiation in the history classroom, and gender and ethnicity in the teaching and learning of history. You will typically have a series of guest lectures, by speakers from The National Archives and Historic England to local teachers, to help you explore ways to teach history.  Usually, you’ll go on trips to history museums in the local area, as well as a history tour of Manchester. These activities give you the opportunity to focus on the preparations teachers do before a class trip, and the experience your students will gain outside of the classroom.\r\n\r\nWhen you’re at Manchester Met, you’ll mainly study with your PGCE History group. You’ll consider how to plan lessons, reflect on your planning, learn how research can develop your teaching practice, and look at ways to develop your teacher persona. You’ll also learn through peer-collaboration, sharing knowledge with your fellow history trainees.\r\n\r\nYou won’t simply explore ways to teach your class about World War One or migration and the British Empire. You’ll spend at least 120 days on placements in schools, gradually increasing your involvement to become the class teacher.\r\n\r\n","interviewProcess":"Upon receipt of a successful application we will call a candidate to interview. This is usually at Rivington and Blackrod High School. The interview process would consist of the following;\r\n\r\n* tour of the school\r\n* inspire task with a small group of students \r\n* a formal interview with a panel\r\n* on some occasions a subject knowledge test may be given  ","howSchoolPlacementsWork":"The Rivington School Direct is an alliance with a total of nine schools within Bolton. We work on an AB model where trainees will be placed in two contrasting schools. Placement A runs from September to January and Placement B from January to June. This provides the trainee with two different experiences and therefore expands the skills gained during the course. \r\nWhen on placement in school the trainee will have a trained Subject Mentor who will support them through weekly meetings and observations. They will also have a Professional Mentor who is responsible for their professional development on a whole school level. Trainees will be given a varied timetable of different Key Stages and abilities and will build up the number of lessons they teach gradually throughout each placement. ","personalQualities":"We are looking for individuals with a genuine passion for working with young people from a variety of backgrounds with varying abilities. Candidates will need to be determined, reflective and resilient and dedicated to the betterment of the young people in their care. ","otherRequirements":"Candidates will be subject to a DBS check before being able to start the course. ","status":2,"createdAt":"2021-07-06T10:47:19.545Z","canSponsorStudentVisa":"yes","cycle":"2024"}
