{"id":"80c3cb3c-7b60-4109-847d-dbebf252e1b6","name":"Social Sciences","code":"2F4K","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"bd9a2174-f682-4f18-9551-498c2f7a48f9","code":"14","name":"Social sciences"}],"trainingProvider":{"id":"7c7d6af2-4991-4a36-9fb0-be730c036a33","code":"1JL","name":"Rivington School Direct"},"accreditedBody":{"id":"812b70c4-7fc4-46fc-975b-3e4d00f77dc4","code":"M40","name":"The Manchester Metropolitan University"},"profPost":"BO","english":"3","maths":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feesInternational":15500,"aboutCourse":"Our one-year Postgraduate Certificate in Education (PGCE) prepares you to teach the social science secondary school curriculum. You will be given the opportunity to teach across the social sciences at different key stages. The opportunities range from Sociology and Psychology to Child development. \r\n\r\nWhen you’re at Manchester Met, you’ll mainly study with your School Direct social science group. You’ll consider how to plan lessons, reflect on your planning, learn how research can develop your teaching practice, and look at ways to develop your teacher persona. You will also reflect on topics that sit across the curriculum in schools, such as pastoral care, Personal, Social, Health and Economic Education (PSHE), and Citizenship. This helps you to develop subject knowledge that you can use in your future teaching career.  You won’t simply learn teaching methods with us on-campus though – you’ll teach classes in schools too. \r\n\r\nYou will spend at least 120 days on placements in schools, gradually  increasing your involvement to become  the class teacher.\r\n\r\n","interviewProcess":"Upon receipt of a successful application we will call a candidate to interview. This is usually at Rivington and Blackrod High School. The interview process would consist of the following;\r\n\r\n* tour of the school\r\n* inspire task with a small group of students \r\n* a formal interview with a panel\r\n* on some occasions a subject knowledge test may be given  ","howSchoolPlacementsWork":"The Rivington School Direct is an alliance with a total of nine schools within Bolton. We work on an AB model where trainees will be placed in two contrasting schools. Placement A runs from September to January and Placement B from January to June. This provides the trainee with two different experiences and therefore expands the skills gained during the course. \r\nWhen on placement in school the trainee will have a trained Subject Mentor who will support them through weekly meetings and observations. They will also have a Professional Mentor who is responsible for their professional development on a whole school level. Trainees will be given a varied timetable of different Key Stages and abilities and will build up the number of lessons they teach gradually throughout each placement. ","personalQualities":"We are looking for individuals with a genuine passion for working with young people from a variety of backgrounds with varying abilities. Candidates will need to be determined, reflective and resilient and dedicated to the betterment of the young people in their care. ","otherRequirements":"Candidates will be subject to a DBS check before being able to start the course. ","status":2,"createdAt":"2021-07-06T10:47:19.775Z","canSponsorStudentVisa":"yes","cycle":"2024"}
