{"id":"a8ba901f-cd4c-40f3-905c-04e3d03d2769","name":"Design and Technology","code":"2F4H","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"118fabd7-86d0-4a40-9e9a-e5c302abe59b","code":"DT","name":"Design and technology"}],"trainingProvider":{"id":"7c7d6af2-4991-4a36-9fb0-be730c036a33","code":"1JL","name":"Rivington School Direct"},"accreditedBody":{"id":"812b70c4-7fc4-46fc-975b-3e4d00f77dc4","code":"M40","name":"The Manchester Metropolitan University"},"profPost":"BO","english":"3","maths":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feesInternational":15500,"aboutCourse":"Our one-year Postgraduate Certificate in Education (PGCE) prepares you to teach across the design and technology secondary school curriculum.  You’ll specialise in the subject you studied for your undergraduate degree (such as textiles or product design) but you’ll also learn practical skills across the full curriculum. This means that you’ll be able to teach your specialism to A-level, plus another subject to Key Stage 3. Studying topics from textiles and electronics, to food and resistant materials, you’ll focus on creating the projects you might teach your class. Past projects include filleting a fish, creating a pencil case with LEDs, building a basic circuit, and using a 3D printer to print textiles. Through these practical workshops you’ll explore some of the issues students might have, such as using complex machinery or working with soldering irons. You’ll also look at ways to make sure you’re imparting educational knowledge through each project, such as electronic calculations or weaves of fabric.\r\n\r\nWhen you’re at Manchester Met, you’ll mainly study with your PGCE Design and Technology (D&T) group. You’ll consider how to plan lessons, reflect on your planning, learn how research can develop your teaching practice, and look at ways to develop your teacher persona.  You won’t simply learn computer-aided manufacturing or how to use a laser cutter though – you’ll spend at least 120 days on placements in schools.\r\n","interviewProcess":"Upon receipt of a successful application we will call a candidate to interview. This is usually at Rivington and Blackrod High School. The interview process would consist of the following;\r\n\r\n* tour of the school\r\n* inspire task with a small group of students \r\n* a formal interview with a panel\r\n* on some occasions a subject knowledge test may be given  ","howSchoolPlacementsWork":"The Rivington School Direct is an alliance with a total of nine schools within Bolton. We work on an AB model where trainees will be placed in two contrasting schools. Placement A runs from September to January and Placement B from January to June. This provides the trainee with two different experiences and therefore expands the skills gained during the course. \r\nWhen on placement in school the trainee will have a trained Subject Mentor who will support them through weekly meetings and observations. They will also have a Professional Mentor who is responsible for their professional development on a whole school level. Trainees will be given a varied timetable of different Key Stages and abilities and will build up the number of lessons they teach gradually throughout each placement. ","personalQualities":"We are looking for individuals with a genuine passion for working with young people from a variety of backgrounds with varying abilities. Candidates will need to be determined, reflective and resilient and dedicated to the betterment of the young people in their care. ","otherRequirements":"Candidates will be subject to a DBS check before being able to start the course. ","status":2,"createdAt":"2021-07-06T10:47:19.718Z","canSponsorStudentVisa":"yes","cycle":"2024"}
