{"id":"badc720f-1d46-4ba0-afd5-8648d986ce49","name":"Biology","code":"24W5","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"322cfc19-d51d-45db-91e3-bd7b4738470f","code":"C1","name":"Biology"}],"trainingProvider":{"id":"7c7d6af2-4991-4a36-9fb0-be730c036a33","code":"1JL","name":"Rivington School Direct"},"accreditedBody":{"id":"812b70c4-7fc4-46fc-975b-3e4d00f77dc4","code":"M40","name":"The Manchester Metropolitan University"},"profPost":"BO","english":"3","maths":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feesInternational":15500,"aboutCourse":"Our one-year Postgraduate Certificate in Education (PGCE) prepares you to teach the secondary school biology curriculum. You will learn how to teach all three sciences to GCSE and your specialism, Biology, Chemistry or Physics, up to AS/A level.  You will explore various teaching methods in our laboratories, which mirror school science classrooms. You’ll consider how to plan lessons and manage activities. You'll learn how to reflect on your developing practice and how research can improve this. some of the topics you’ll explore include behaviour management, mental health and emotional wellbeing, teacher persona, and non-verbal communication (such as body language).  You will conduct some of the experiments you might use on your placements such as exploring the properties of electromagnets, extracting DNA from a kiwi fruit, and investigating the reactions of alkaline metals. \r\n\r\nYou will also have guest sessions with alumni and experts from a variety of organisations. Past sessions include speakers from the National Space Centre, Royal Society of Chemistry, and Science and Plants for Schools (SAPS).  You won’t simply learn teaching methods with us on campus though, you’ll spend at least 120 days on placements in a variety of schools\r\n\r\n\r\n","interviewProcess":"Upon receipt of a successful application we will call a candidate to interview. This is usually at Rivington and Blackrod High School. The interview process would consist of the following;\r\n\r\n* tour of the school\r\n* inspire task with a small group of students \r\n* a formal interview with a panel\r\n* on some occasions a subject knowledge test may be given  ","howSchoolPlacementsWork":"The Rivington School Direct is an alliance with a total of nine schools within Bolton. We work on an AB model where trainees will be placed in two contrasting schools. Placement A runs from September to January and Placement B from January to June. This provides the trainee with two different experiences and therefore expands the skills gained during the course. \r\nWhen on placement in school the trainee will have a trained Subject Mentor who will support them through weekly meetings and observations. They will also have a Professional Mentor who is responsible for their professional development on a whole school level. Trainees will be given a varied timetable of different Key Stages and abilities and will build up the number of lessons they teach gradually throughout each placement. ","personalQualities":"We are looking for individuals with a genuine passion for working with young people from a variety of backgrounds with varying abilities. Candidates will need to be determined, reflective and resilient and dedicated to the betterment of the young people in their care. ","otherRequirements":"Candidates will be subject to a DBS check before being able to start the course. ","status":2,"createdAt":"2021-07-06T10:47:19.495Z","canSponsorStudentVisa":"yes","cycle":"2024"}
