{"id":"c195ca98-32f8-48c7-bdaf-cd7b6d80f6a7","name":"Business Studies","code":"2F4G","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"de6477b2-6027-48e6-b9f7-3206774705c2","code":"08","name":"Business studies"}],"trainingProvider":{"id":"7c7d6af2-4991-4a36-9fb0-be730c036a33","code":"1JL","name":"Rivington School Direct"},"accreditedBody":{"id":"812b70c4-7fc4-46fc-975b-3e4d00f77dc4","code":"M40","name":"The Manchester Metropolitan University"},"profPost":"BO","english":"3","maths":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feesInternational":15500,"aboutCourse":"\r\nOur one-year Postgraduate Certificate in Education (PGCE) prepares you to teach the business secondary school curriculum.  At the start of the course, you’ll usually complete a subject knowledge audit with other trainees in your group. We’ll find out the topics you know well and those you’d like to learn more about, to make sure your skills are up-to-date.  You’ll explore topics such as operations management, business ethics, economics, enterprise, and leadership theories. You’ll also look at teaching methods you might use in the classroom, such as using technology to develop pupils’ financial data analysis skills.  On this course, you’ll mainly study with your PGCE Business group. You’ll consider how to plan lessons, reflect on your planning, learn how research can develop your teaching practice, and look at ways to develop your teacher persona.  \r\n\r\nYou will also have guest lectures with examiners from a number of exam boards, to help you learn more about how they mark exams and what they’re looking for in pupils’ work.  You won’t simply learn ways to teach your class how to write a marketing plan or how to explain Handy's model of organisational culture though, you’ll teach in schools too.\r\n\r\n","interviewProcess":"Upon receipt of a successful application we will call a candidate to interview. This is usually at Rivington and Blackrod High School. The interview process would consist of the following;\r\n\r\n* tour of the school\r\n* inspire task with a small group of students \r\n* a formal interview with a panel\r\n* on some occasions a subject knowledge test may be given  ","howSchoolPlacementsWork":"The Rivington School Direct is an alliance with a total of nine schools within Bolton. We work on an AB model where trainees will be placed in two contrasting schools. Placement A runs from September to January and Placement B from January to June. This provides the trainee with two different experiences and therefore expands the skills gained during the course. \r\nWhen on placement in school the trainee will have a trained Subject Mentor who will support them through weekly meetings and observations. They will also have a Professional Mentor who is responsible for their professional development on a whole school level. Trainees will be given a varied timetable of different Key Stages and abilities and will build up the number of lessons they teach gradually throughout each placement. ","personalQualities":"We are looking for individuals with a genuine passion for working with young people from a variety of backgrounds with varying abilities. Candidates will need to be determined, reflective and resilient and dedicated to the betterment of the young people in their care. ","otherRequirements":"Candidates will be subject to a DBS check before being able to start the course. ","status":2,"createdAt":"2021-07-06T10:47:19.692Z","canSponsorStudentVisa":"yes","cycle":"2024"}
