{"id":"7f79a87d-3597-41ac-ae30-50867b375798","name":"English","code":"2ZLQ","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3aed1aa8-ae46-4b68-92bb-a6cc20655c59","code":"Q3","name":"English"}],"locations":[{"id":"06e483ff-030c-4a2d-a827-fcf7a4ae9588","name":"Main Site","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"f12b0a2b-0897-41af-87c2-54ae4e898662","code":"T11","name":"Teach East"},"profPost":"BO","english":"2","maths":"2","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","aboutCourse":"Our programme will equip you with the knowledge, skills and understanding to work in the classroom, inspiring and empowering young people to achieve their full potential and become life-long learners. \r\n\r\nA typical week will mean that you spend 4 days on placement within a local school, with one day a week in the purpose built learning centre, or within another local school, for training provided by Teach East. You will be motivated by your fully trained Teach East mentors, who will inspire and guide you to become an excellent practitioner ready to seek employment within a local school. \r\n\r\nPlacements will offer a range of: Ofsted grades; high attainment; challenging contexts; provision for children with learning difficulties; children whom do not have English as their first language; significant cultural and ethnic diversity. This will be across two contrasting schools. \r\n\r\nTrainees will have access to Masters Credits, through accessing the PGCert qualification from the University of Hull. This will support your academic and professional reflection and the theoretical underpinning of educational practice.  ","interviewProcess":"All applications will be shortlisted and successful candidates will be invited for interview. \r\n\r\nCandidates will be asked to complete a number of tasks, these may not all be on the same day.","howSchoolPlacementsWork":"Teach East has a partnership of over 30 secondary and primary school across the city of Peterborough. Trainees will have a main placement school for the majority of their training year. Throughout the year we endeavour to provide trainees with experience of a number of educational settings within the city of Peterborough.\r\n\r\nWithin the duration of the training programme, trainees will teach across  Key Stage 3, 4 and 5 so that you are fully prepared to teach across the secondary age range. This will be across two contrasting schools\r\n\r\nEvery trainee is assigned a mentor to guide them through the teacher training year, offering support, guidance and advice as appropriate. One hour per week is set aside to meeting this mentor, recording key events and setting meaningful targets for the work ahead, based on identified strengths and areas for development.\r\n","personalQualities":"We are looking for confident people with a passion for learning. \r\nAlong with your academic qualifications you will need to be highly motivated, a team player and have great organisational skills. Interpersonal skills are vital and we want to work with those who want to make a difference to children's lives. \r\n\r\nWe would expect all candidates to have researched teaching roles thoroughly, school experience is desired but not essential.\r\n\r\nYou need to be clear about what you can bring to the profession and why you think teaching is for you. ","otherRequirements":"If you are offered a place on the Teach East training programme a DBS check will be applied for. www.gov.uk/disclosure-barring-service-check/overview \r\n\r\nYou will be required to complete a health and safety questionnaire prior to starting the course. \r\n\r\nApplicants who have studied outside of the UK must check their qualification with NARIC (National Academic Recognition Information Centre) prior to making an application. \r\n\r\nQualifications need to be the equivalent level to UK GCSE's, A Levels and undergraduate degrees. www.naric.org.uk ","status":2,"createdAt":"2021-07-06T10:51:27.511Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"Course Fee for UK Students £8250\r\nCourse Fee for international students £8250 \r\n\r\nThe supporting school must pay the tuition fees to Teach East on your behalf. \r\n\r\nYour contract will exist with the school, rather than with Teach East, which may mean that they ask you to do more teaching under less supervision than a non-salaried trainee. \r\n\r\nAs a salaried trainee you are not entitled to Student Loan funding or to access the bursaries that are available from the Government. \r\n\r\nAn additional £1000 is payable for a PGCert (Postgraduate Certificate in Education) if you choose to take this alongside QTS (Qualified Teacher Status)"}
