{"id":"daf29927-2512-4564-840f-41f79958434b","name":"Business studies","code":"AK01","qualification":"qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"de6477b2-6027-48e6-b9f7-3206774705c2","code":"08","name":"Business studies"}],"locations":[{"id":"06e483ff-030c-4a2d-a827-fcf7a4ae9588","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"f12b0a2b-0897-41af-87c2-54ae4e898662","code":"T11","name":"Teach East"},"degreeGrade":"1","english":"3","maths":"3","science":"9","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":8250,"feesInternational":8250,"feeDetails":"An additional £1000 is payable for a PGCert (Postgraduate Certificate in Education) if you choose to take this alongside QTS (Qualified Teacher Status).","financialSupport":"Certain subjects come with available bursaries, more details of which can be found on our course page.\r\n\r\nWe also allow trainees access to a Hardship Fund in exceptional and unforeseen circumstances.\r\n","aboutCourse":"Our programme will equip you with the knowledge, skills and understanding to work in the classroom, inspiring and empowering young people to achieve their full potential and instill life-long learning.\r\n\r\nA standard week means that you spend 4 days in a selected partner school developing your classroom craft, and one day a week in our Core Training Rooms, receiving input from a range of expert facilitators and presenters and improving your understanding of the theory behind the Teacher Standards.\r\n\r\nOur Core Curriculum offer allows you access to the full entitlement within the Initial Teacher Training Core Content Framework, as well as offering you opportunities to experience and understand a range of contextually relevant educational settings.\r\n\r\nOn placement you are supported by a dedicated mentor who will inspire and guide you to become a highly effective practitioner, and this is augmented by Teach East support across Primary phases and Secondary subjects.\r\n\r\nWe have excellent pass rates and outcomes for trainees, and very high levels of recruitment into our partner schools and the local area.\r\n\r\nPlacements offer a range of Ofsted gradings, attainment, outcomes, challenge, pupil demographic and subject coverage. As a trainee you will teach in two contrasting schools across the year.\r\n\r\nTrainees are assessed formatively through the year using an On-Track Review system, through a mixture of observations, portfolios, short tasks and written assignments, all with the consideration of workload and wellbeing.\r\n\r\nTrainees will also have the opportunity to access the Post-Graduate Certificate in Education, worth 60 Masters credits. Although entirely optional, this gives trainees the chance to underpin their reflection and practice with further theoretical understanding.\r\n\r\nA previous trainee said: 'Teach East are amazing! The team are very supportive and provide the skills and knowledge to progress their trainees through the year and prepare them for their teaching careers.'\r\n","interviewProcess":"All applications are reviewed and then shortlisting takes place; successful candidates are invited to attend a two-stage interview process which will include the need to provide a recording of the delivery of selected relevant content linked to the chosen course. \r\n\r\nInterview questions will cover aspects of professional behaviour, subject / phase knowledge, reason for application and safeguarding.\r\n\r\nCandidates will be invited to complete tasks related to Literacy and Numeracy prior to course commencement.\r\n\r\nOffers made are conditional, with conditions outlined clearly to successful candidates. \r\n\r\nWe may request that a candidate completes a Subject Knowledge Enhancement course as part of their offer. Full guidance on how to complete all aspects will be provided to all applicants, and can also be found on our website.\r\n","howSchoolPlacementsWork":"Teach East has an ever-growing number of Secondary and Primary school partners across Peterborough. Trainees will have a Main Placement school for the majority of their training year, and the chance to experience a contrasting placement for a sustained period of time after Christmas to enrich their experience. \r\n\r\nThroughout the year we also endeavour to provide trainees with experience of a range of settings through our Core Curriculum days. \r\nWithin the programme trainees will have the chance to experience teaching across their chosen age-range and the relevant Key Stages so they are fully prepared.\r\n\r\nEvery trainee is assigned a dedicated mentor to guide them through the teacher training year and to help them connect the Core Training sessions to classroom practice, offering guidance, setting targets, observing lessons and giving feedback.\r\n\r\n","personalQualities":"We are looking for confident people with a passion for learning and the capacity for reflection and continued improvement. \r\n\r\nAlongside your academic qualifications you need to be highly motivated and well-organized. Interpersonal skills are vital as we want to work with those who are committed to ensuring strong academic outcomes for pupils. \r\n\r\nWe expect all candidates to have researched teaching roles thoroughly, and know where their chosen specialism sits within the curriculum. School experience is valuable but not essential.\r\n\r\nYou need to be able to articulate about what you can bring to the profession, and why teaching is for you.\r\n","otherRequirements":"\r\nIf you are offered a place on the Teach East training programme an enhanced DBS check will be applied for. \r\nwww.gov.uk/disclosure-barring-service-check/overview \r\n\r\nYou will be required to complete a Health & Safety questionnaire via Peterborough City Council prior to starting the course to prove your fitness to teach. \r\n\r\nApplicants who have studied outside of the UK must check their qualification with ENIC (The UK national agency for international qualifications and skills - formerly NARIC) prior to making an application and provide original certificates and paperwork.  https://www.enic.org.uk/  \r\n\r\nQualifications need to be the equivalent level to UK GCSE's, A Levels and undergraduate degrees.\r\n\r\n","status":1,"createdAt":"2021-07-06T10:51:28.024Z","updatedAt":"2021-09-29T14:06:03.578Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
