{"id":"be194155-74f1-4139-8d83-c70001033ecf","name":"Art and Design","code":"2XR7","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"14_to_19","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"d461a678-3335-4ca2-9616-1dc479d31a49","code":"W1","name":"Art and design"}],"locations":[{"id":"a344b569-2f51-4754-a7ec-8b161a2209d6","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"53854e01-6343-44cd-97b5-44ab930641e4","code":"1AN","name":"QE School, Wimborne"},"accreditedBody":{"id":"d41a1821-e35b-48eb-bf02-4842872b04a2","code":"E84","name":"University of Exeter"},"profPost":"PG","degreeGrade":"0","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":19500,"feeDetails":"For information on Government loans and training bursaries, please visit the [Student Finance England]( https://www.gov.uk/student-finance) and [Get into Teaching]( https://getintoteaching.education.gov.uk/) websites.\r\n\r\n\r\nFor more information, please see Exeter's [Fees and finance]( https://www.exeter.ac.uk/teachertraining/apply/feesandfinance/) webpages\r\n","financialSupport":"Unfortunately we do not offer any salaried positions or financial support.  Please do though visit Exeter University's School Direct Fees and Finance sections and their bursary guidance pages.  The government also publishes lists of which subjects it may be funding people to train in which changes yearly.\r\n\r\nFor information on Government loans and training bursaries, please visit the [Student Finance England]( https://www.gov.uk/student-finance) and [Get into Teaching]( https://getintoteaching.education.gov.uk/) websites.\r\n\r\n\r\nFor more information, please see Exeter's [Fees and finance]( https://www.exeter.ac.uk/teachertraining/apply/feesandfinance/) webpages\r\n","aboutCourse":"QE School runs all its School Direct training from its beautiful campus in Wimborne built in 2011 which has unrivalled facilities. \r\n\r\nYou will be working according to the Exeter University School Direct Distance Learning model.  Further essay and assessment information can be found by following the Exeter University School Direct web pages.\r\n\r\nIf you would like to visit the department at QE School and meet the team ahead of applying, please contact us and we can arrange this for you.\r\n\r\nSchool Direct programmes assess and develop both classroom teaching practice and your understanding of the pedagogy which underpins excellent lessons.  Exeter set the essays and online tasks that you have to complete. Whilst at school, you will be learning 'on-the-job' from day one what it means to be a teacher in your chosen subject area.\r\n\r\nYou visit the University just once during your training, the remainder of the time is spent in school whilst spending six additional seminar days with Exeter remotely. You are entitled to one day a week which is free to work in school on Exeter online assignments (called your 'in-school University day').  You have a subject tutor, a mentor and a University tutor, all looking after you and guiding your progress, either at distance or in person every day.\r\n\r\nThere are phases to the development to help you develop at your own pace.  You will not suddenly be 'thrown in', but at the same time you can accelerate the pace in consultation with your tutor if that is appropriate.\r\n\r\nYour week will be a mixed reduced timetable of teaching classes, delivering episodes (parts) of lessons, team teaching, observing others around the school, attending training led by experts at the school, coaching and guidance from a designated subject and reflective mentor, feedback sessions, marking and planning time.  You will be encouraged to come to all the same meetings and training that full time teachers attend, providing a full understanding of the profession and role.  There is also a placement in a nearby school for at least 6 weeks.\r\n\r\nAt QE School you will be led by a designated, motivated and experienced Training Manager (Ben Jose) who facilitates bespoke training in all areas of your development as a teacher, helping you to improve quickly and receive support when needed.\r\n\r\n ","interviewProcess":"You are very welcome to visit the school virtually prior to applying by visiting http://www.qe.dorset.sch.uk \r\n\r\nAt interview, you will get a full tour of the school, led by either a current trainee or one of our students.\r\n\r\nYou will be expected to teach a 30 minute lesson based on a lesson brief set by QE.  This is a chance for us to observe your potential to train, the rapport you develop with students and also ability to lead students in a teaching task.  We expect to see commitment and professionalism at this stage, not 'the finished article'.  The interview also involved a short literacy task.\r\n\r\nYou will get to meet the department team and current trainees across the school, helping you to decide if we are the right place for you to train and vice versa. In our eyes, it genuinely is a two-way interview process.\r\n\r\nThere will be a formal interview with the ITEC lead (Ben Jose) and the Head of Department in the subject area to which you have applied.  If Exeter have asked us to check subject knowledge at interview, there may be an additional written task in order that we may do this.\r\n\r\nYou will undergo a full DBS check and questions on your understanding of safeguarding  and Exeter University Distance Learning model as  part of the interview process.\r\n\r\n\r\n\r\n\r\n\r\n","howSchoolPlacementsWork":"Your placement will be at a local school.  Many of our partner schools are also our feeder schools, but not all.  These would be Middle Schools where you would teach years 6-8.  In our partner secondary schools, you would teach years 7-11 and in some cases 7-13.\r\n\r\nYou will visit the schools ahead of your placement and build up a working relationship with the staff there helping you to settle quickly when your placement starts.  \r\n\r\nMost placements take place in the second half of the Spring Term after February half term.","personalQualities":"We are looking for applicants to have a genuine passion for teaching and for wanting to work with young people and help them to achieve their potential.  \r\n\r\nTeaching is a hard career - but incredibly rewarding.  Before starting the course we want you to recognise the challenges you face not just in the training, but in the profession thereafter.  We want you to recognise the challenges, but not be put off by them.  We want to train you and you to stay in the profession long term to make a difference to young people's lives and future prospects.","otherRequirements":"In addition to the academic requirements found on Exeter's pages, selection is based on performance at interview, a satisfactory fitness to teach assessment and a satisfactory DBS enhanced disclosure.\r\n\r\nAlthough not essential it would be an advantage to be able to reflect on any school-based experience or experience working with young people in another context.\r\n\r\nThe ‘Qualifications’ section describes Exeter's standard offer. However, if you have a different academic background, equivalent to degree level, you are welcome to make an application through UCAS for consideration or contact our [PGCE Admissions team](https://www.exeter.ac.uk/teachertraining/contact/) for more information.\r\n","status":1,"createdAt":"2021-07-06T10:56:37.410Z","updatedAt":"2021-09-25T17:07:34.314Z","canSponsorStudentVisa":"yes","cycle":"2024"}
