{"id":"7718a7b4-ccd7-4505-9cd2-8313cc00792d","name":"Primary (3-7)","code":"AP55","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_7","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"d7dd0487-6bea-4a5d-aaa5-97ad7a63da61","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"91613652-0b18-4453-818d-68222f2fb4c2","code":"2A4","name":"WCPSD"},"accreditedBody":{"id":"e328aab3-a535-4921-8ded-5e37133c76dd","code":"L46","name":"Liverpool Hope University"},"profPost":"PG","degreeGrade":"0","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feeDetails":"Trainees are deemed to be students of higher education for the period of training and may receive student support (e.g. loans and bursaries) for the duration of their training. Once accepted onto the School Direct Training Programme, trainees should make an application for tuition fee loans through Student Finance England.  The current cost of the programme is £9250.","aboutCourse":"WCPSD is a school direct training programme that combines essential school based training alongside a specially designed training package. \r\n\r\nThe training programme provided aims to fully equip trainees with a wide range of skills necessary for the role. This includes training in all curriculum areas and additional training on safeguarding, SEND, EAL, Children Looked After, writing PSP’s, memory training and behaviour management. All training is evaluated by trainees and the training programme is reviewed annually using results from this feedback.\r\n\r\nThe course is a full-time, one-year training programme, structured around the school year. Trainees will be based in our schools and be regarded as a member of the team from the start.\r\n\r\nAt the start of the Autumn term, trainees will be assigned to a EYFS class within one of our schools. For the first few weeks they will spend their time working with small groups of children or team teaching, leading onto teaching whole lessons.\r\n\r\nAlongside time on placement, trainees will follow a structured programme of pedagogical and subject knowledge training with both WCPSD training and Liverpool Hope University. This allows trainees to apply and develop their new-found knowledge and skills immediately in the classroom environment. During the latter part of the autumn term trainees will undertake their first, assessed teaching practice.\r\n \r\nThe Spring and Summer terms follow a similar pattern, with weekly training input from WCPSD/ Liverpool Hope University followed by an assessed teaching practice.\r\n\r\nTrainees will move to a second school within the partnership for the Spring term within a KS1 setting and depending upon  training needs and preferences, will either return to the original school or move to a third school for the summer term.\r\n\r\nTrainees will experience both EYFS and KS1. Trainees academic study with Liverpool Hope University is spread over the year, commencing with an initial induction day in September.","interviewProcess":"We have a rigourous structure for the recruitement of trainees. All candidates are required to partake in a three stage interview day. Across the three stages, candidates are observed and interviewed by an experienced panel. The interview panel consists of the alliance lead, headteacher from the steering group and a headteacher from a partnership school. All tasks and interview questions are designed to allow candidates to show their potential with regards to subject knowledge, curriculum knowledge and their aptitude for teaching. \r\n\r\nPart 1 Table teach: Candidates are required to plan, adapt and resource a short lesson for EYFS children, on a given objective. They are observed during this process by the panel, who are looking at the quality of their table teach and how the candidate interacts with the children. \r\n\r\nPart 2 Formal Interview: The questions in the interview are designed to allow the candidate to demonstrate their knowledge surrounding Primary Education. The panel are looking to see how well the candidate has researched the industry and assess their potential.\r\n\r\nPart 3 Curriculum Knowledge: In order to assess a candidate's curriculum knowledge and to highlight future development points for the candidate, they are required to sit two level six SAT papers (SPAG and maths) and a written test to assess the quality of written English. \r\n","howSchoolPlacementsWork":"The programme gives trainees a minimum of 120 days in school and 53 training days, 12 of which will be at Liverpool Hope University. Trainees will have a total of three placements, across two contrasting schools.\r\n\r\nPlacements take place across EYFS and key stage 1 .\r\n\r\nAll students prior to starting the course complete an audit to support placement of students. Throughout the year the audit is amended based upon gained experience, skills, knowledge and understanding so that students are able to be placed in the most suitable school to further support their development against the teachers standards. Our diverse partnership highly supports the differing experiences. ","personalQualities":"WCPSD are seeking individuals who are passionate about working with young people, demonstrate and are able to apply the skills of organisation, flexibility, reflection, evaluation and action to all aspects of the course and their career. Enthusiastic individuals who are able to communicate effectively with pupils, colleagues and parents on a range of levels.\r\n\r\nIn addition, candidates should possess:\r\n*The skills to support the Catholic ethos of schools and the education of the children.\r\n\r\n*Effective communication skills.\r\n\r\n*A commitment to work hard on the course.\r\n\r\n*Determination to succeed.\r\n\r\n*A readiness to listen and share.\r\n\r\n*A flexible approach to learning/teaching.","otherRequirements":"Applicants must complete forms requesting an Enhanced Disclosure from the DBS. In addition, you will be required to disclose previous offences.\r\n\r\nAdmission to the course is subject to a satisfactory medical report, as candidates are required to meet the standards for ‘Fitness to Teach’.","status":1,"createdAt":"2021-07-06T10:53:24.892Z","updatedAt":"2021-09-21T10:38:04.654Z","canSponsorStudentVisa":"no","cycle":"2024"}
