{"id":"40dcbb6b-96ac-41c7-89ed-70fcb1bf167e","name":"Primary","code":"2HB8","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"4_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"a3ac3a98-1ce0-4b24-b575-484dd32e3464","name":"Primary applications - St Bernard's RC Primary School - A Voluntary Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"d379ef8d-3e40-47c1-b3c8-1948b24fa352","name":"Secondary applications - St John Plessington Catholic College","isPublished":"N","status":"S","vacancies":"F"}],"trainingProvider":{"id":"4d17b7ae-a925-46e5-8127-d3e17c4929ff","code":"22A","name":"Ignite Institute"},"accreditedBody":{"id":"e843cb68-d310-478c-8dba-cf9633fea086","code":"C55","name":"University of Chester"},"profPost":"PG","degreeGrade":"0","english":"1","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":9250,"feeDetails":"Fees are set by University of Chester - please check on the university website.\r\n\r\n","financialSupport":"Please check DFE and University of Chester websites for details on loans and bursaries.\r\n\r\nIgnite has no financial incentives for this course.","aboutCourse":"In 2022-23, the Ignite NW Partnership are continuing to offer an outstanding training programme that covers a wider geographical area. \r\n\r\nTraining to be a teacher with Ignite allows Associate Teachers to gain a realistic understanding of the challenges and rewards of teaching by becoming an integral part of the school staff. We have an established induction process in place, ensuring our trainees hit the ground running when the course starts in September and employment rates are high, particularly in Partnership schools.\r\n\r\nThe training year consists of 130 days based in 2 schools, alongside 60 training days. 15 of these days are led by The University of Chester and focus on completing assessments for PCGE. The remaining 45 days are led by highly skilled and experienced specialists who work regionally and nationally, providing our trainees with outstanding CPD they can use and develop in the classroom. Training days are interactive and practical and due to many being based in a school setting, we build in opportunities for our trainees to put into practice with children some of the theory and pedagogy they have gained.\r\n\r\nOur programme also includes accredited specialist SEND/autism training from a local partner TSA and trainees will also receive Educational Visit Leader accreditation during a 3 day residential. \r\n\r\nAlongside our high quality CPD, during school based experience, trainees will be supported, mentored and coached by excellent classroom practitioners. We promote a team teach approach as trainees begin their programme and there will opportunities for trainees to get fully immersed in the life of the school, observing and learning from as many different specialists as possible.\r\n\r\nOur Professional Mentors are experienced, supportive and aim to ensure that ATs set high standards for themselves and the pupils they teach. Weekly reviews take place where trainees are encouraged and coached to become increasingly reflective as they review themselves against the teacher standards.\r\n\r\nDuring the training year, there are 3 formal review points, where a QA lead from Ignite will work alongside a University Link Tutor to support schools and trainees in their reflective judgements.\r\n\r\nSupport is provided for trainees when making applications for NQT positions and due to the size and scale of the Alliance, job opportunities are high.\r\n\r\n","interviewProcess":"If you are successful at the application stage and have met the application criteria, you will be invited for interview.\r\n\r\nOur interview process consists of 3 components:\r\n- a formal interview \r\n- a live teaching session lasting 30 minutes with a group of children\r\n- a short written task and online maths task.\r\n\r\nFeedback will be provided and if you are successful, an offer will be made. This offer may be conditional on successful completion of any courses you are currently undertaking and we will always look to promote as much ongoing experience in school as possible.","howSchoolPlacementsWork":"During the training year, trainees will spend the autumn term in their main host school and the spring term in an alternative school. Trainees will then return to their main host school in the summer term, meaning that school based experience is split into three phases.\r\n\r\nAll trainees will gain experience in both KS1 and KS2. For the 2021-22 training programme, we are now able to offer EYFS specific school placements for candidates who are looking to secure positions in a Reception class.\r\n\r\nPlacements will be in an Ignite school. With over 25 schools in the Alliance, the opportunity to learn in different contexts is strong and will enable trainees to get experience a range of different settings.\r\n\r\nWe will always take into consideration travel distances for our trainees and ensure that journey times to schools are reasonable and agreeable.","personalQualities":"Teaching and shaping the lives of young people is one of the most rewarding career choices a person can make. We need candidates who have the passion and drive to mould children into learners able to cope with an ever-changing world. You should demonstrate high levels of enthusiasm when working with children.\r\n\r\nTeaching is a demanding career choice and we are looking for candidates who are fully committed and believe that learning is life-long. The training course is intense and a high level of motivation to learn is essential.","otherRequirements":"School Experience\r\nIt is essential that applicants have suitable experience of working in a Primary School setting, either on a voluntary or salaried basis. It is desirable that such experience includes a range of year groups covering KS1 and KS2. The more experience an applicant can gain before applying for a place on the course, the greater the chance they will have of being successful.\r\n\r\nIf the number of applications far exceeds the number of places available on the course, applicants with little or no school experience will not be selected for interview.\r\n\r\n\r\n\r\n","status":1,"createdAt":"2021-07-06T10:47:04.971Z","updatedAt":"2021-08-11T21:44:30.571Z","canSponsorStudentVisa":"yes","cycle":"2024"}
