{"id":"d6bd92c5-7178-42de-98be-e83ae0f31a26","name":"Mathematics","code":"Q413","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"72345aa7-096c-488f-8649-085b8178cadb","code":"G1","name":"Mathematics"}],"locations":[{"id":"d379ef8d-3e40-47c1-b3c8-1948b24fa352","name":"Secondary applications - St John Plessington Catholic College","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"4d17b7ae-a925-46e5-8127-d3e17c4929ff","code":"22A","name":"Ignite Institute"},"accreditedBody":{"id":"e843cb68-d310-478c-8dba-cf9633fea086","code":"C55","name":"University of Chester"},"profPost":"PG","degreeGrade":"0","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"We will accept applicants with a 2.2 degree with additional experience or extenuating circumstances. Please note that this may affect funding which is available.","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":9250,"aboutCourse":"The course starts in September with your first placement starting immediately. You will spend most of your time in school with a dedicated subject mentor and a professional mentor who will oversee your training. You will be part of the school community from day one. You will start observing lessons from a wide range of teachers and subjects and you will gradually start teaching at a pace that suits you. You will be guided every step of the way by our experienced mentors and teachers. Approximately 80% of your time will be spend in school with the remaining 20% spent attending University based lectures, subject support sessions and enrichment activities as well as spending a week studying the transition from Primary to Secondary school. You will also observe practice in a Special Education setting. We will provide you with a rich range of experiences, carefully planned out to guide you as you work towards QTS.","interviewProcess":"We will invite you to one of your placement schools to observe teaching, meet current Associate Teachers and tour the school. We will ask you to take part in a short teaching episode to enable to you to interact with students. You will have an interview with the Head of Department and the School Direct ITT Lead. You will have the opportunity to ask any questions you may have. ","howSchoolPlacementsWork":"You will have three placements in an ABA model, with two of them being in the same school setting. You will be teaching students aged 11 to 18 over the course of your three placements. Your placements will usually be in St John Plessington Catholic College and in St Mary's Catholic College. We will not be able to confirm until all places have been allocated which school you will start in so please be prepared to travel to either school.","personalQualities":"Teaching and shaping the lives of young people is one of the most rewarding career choices a person can make. We need candidates who have the passion and drive to mould children into learners able to cope with an ever-changing world. You should demonstrate high levels of enthusiasm when working with children.\r\n\r\nTeaching is a demanding career choice and we are looking for candidates who are fully committed and believe that learning is life-long. The training course is intense and high levels of motivation and resilience are essential.","otherRequirements":"It is essential that applicants have suitable experience of working in a  school setting, either on a voluntary or salaried basis. It is desirable that such experience includes a range of year groups covering KS3 and KS4. The more experience an applicant can gain before applying for a place on the course, the greater the chance they will have of being successful. If you wish to organise some school experience, please contact Ciara O'Connor - ciaraoconnor@inspirelearningtsh.co.uk\r\n\r\n\r\n\r\n\r\n\r\n","status":1,"createdAt":"2021-09-29T09:53:39.468Z","updatedAt":"2021-09-29T09:54:43.578Z","canSponsorStudentVisa":"yes","cycle":"2024"}
