{"id":"af7cf7b0-77cd-447f-9353-563476ac34cc","name":"Primary (3-7)","code":"2M87","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"3_to_7","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"05fab7ad-9fa9-409e-b18f-eb5ce7e8d88c","name":"St Bede's Catholic Primary School, Basingstoke","isPublished":"Y","status":"R","vacancies":"F"},{"id":"b0460c9b-28ea-4550-b2c4-cef42e250f61","name":"St Joseph's Catholic Academy School, Aldershot","isPublished":"N","status":"S","vacancies":"F"},{"id":"12314484-798f-4b69-9eda-5261737bc870","name":"St Peter's Catholic Primary School, Winchester","isPublished":"Y","status":"R","vacancies":"F"},{"id":"34a30e92-8157-4bc4-8dc6-2bbed65d4b71","name":"St Walburga's Catholic Primary School, Bournemouth","isPublished":"Y","status":"R","vacancies":"F"},{"id":"c1157fd4-32fc-4315-90f2-f2a1aa4af46a","name":"St Patrick's Catholic Primary School, Southampton","isPublished":"Y","status":"R","vacancies":"F"},{"id":"a221ccf2-a5bc-4854-b362-2cb43baee1ca","name":"St Peter's Catholic Primary School, Waterlooville","isPublished":"Y","status":"R","vacancies":"F"},{"id":"3c186e37-49a2-44b6-ba7c-a2d6e2d1d979","name":"St Joseph's Catholic Primary School, Christchurch","isPublished":"Y","status":"R","vacancies":"F"},{"id":"f936263f-1a0f-41fb-9ed0-2fa93ec4d688","name":"St Thomas More Catholic Primary School, Havant","isPublished":"Y","status":"R","vacancies":"F"},{"id":"123f3212-b8da-427a-8cca-ba5bbca07c75","name":"Corpus Christi Catholic Primary School, Bournemouth","isPublished":"Y","status":"R","vacancies":"F"},{"id":"3007d653-cffb-4cee-9c54-28d86c1a26e7","name":"St. Paul's Catholic Primary School, Reading","isPublished":"Y","status":"R","vacancies":"F"},{"id":"e82ca795-320b-411d-8dec-81c09f6cbb1e","name":"St John the Baptist Catholic Primary School, Andover","isPublished":"Y","status":"R","vacancies":"F"},{"id":"5401e417-9556-4b05-a2ef-8fef72ae55ea","name":"Holy Family Catholic Primary School PCP SCITT","isPublished":"Y","status":"R","vacancies":"F"},{"id":"c46b32e0-614b-4023-a5bc-44dd6fdde5c6","name":"St Mary's Catholic Primary School, Poole","isPublished":"Y","status":"R","vacancies":"F"},{"id":"194b7ce0-c30d-4505-8dfd-93135d917496","name":"St John's Cathedral Catholic Primary School, Portsmouth","isPublished":"Y","status":"R","vacancies":"F"},{"id":"eae5fbcd-5be3-45ed-baee-6e58b19af2e2","name":"Springhill Catholic Primary, Southampton","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"c6cc9d00-9dc5-4e23-959d-d2be40dd4aed","code":"P85","name":"Primary Catholic Partnership SCITT (PCP SCITT)"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We recommend equivalencytesting.com but may accept tests from other providers by prior arrangement. Equivalency test costs are met by the candidate.","courseLength":"OneYear","feesUK":9000,"feeDetails":"\r\n","financialSupport":"\r\n","aboutCourse":"The PCP SCITT Primary (3-7) course prepares graduates to be confident and effective professionals ready for a rewarding career teaching in faith-based or secular schools. Trainees who complete the course receive a PGCE from Bath Spa University and Qualified Teacher Status. \r\n\r\nThe programme is a blend of school-based and central training. The induction phase of the course (two weeks) is held at the PCP SCITT training centre and focusses on key skills and concepts such as how children learn, behaviour management, planning and assessment. For the rest of the course, trainees spend 4 days a week in their placement school, and one day a week at the SCITT training centre.  \r\n\r\nWeekly SCITT central training workshops and seminars are led by experienced education professionals and senior leaders. Subject sessions cover the core curriculum areas of English, Maths and Science and introduce the full range of non-core subjects including ICT, Art, Geography and Religious Education. Professional Studies sessions draw on up-to-date research to progressively build on trainees’ understanding of the theory and practice of teaching and learning. Particular importance is placed on trainees’ subject knowledge for teaching and the acquisition of high-quality teaching practices that support strong pupil progress. \r\n\r\nSchool-based training is supervised by a school mentor, usually the class teacher, who guides trainees as they put into practice the techniques and knowledge learned during central training session. Initially trainees work alongside their mentor with small groups of children. As trainees develop their skills in a classroom context, they are supported to take on greater independence and responsibility for whole class teaching including planning, teaching and assessing. \r\n\r\nMentors meet with trainees on a weekly basis to provide feedback, offer support, and set achievable development goals. Trainees are allocated a SCITT link tutor, who quality assures the school-based training and provides additional support and advice. PCP mentors and link tutors are chosen for their professional expertise and undertake yearly professional development to ensure PCP trainees receive high quality training. \r\n\r\nAssessment opportunities support trainees in meeting the Teachers’ Standards (2011) and the requirements for PGCE Master’s credits through Bath Spa University. Over the year, trainees compile a portfolio of evidence to demonstrate their achievement and undertake three written assignments to deepen their understanding of core professional practice. Assessed teaching observations and ongoing feedback supports trainees in knowing exactly how they are progressing and their next steps to reach even higher standards of professional practice.  \r\n","interviewProcess":"\r\n","howSchoolPlacementsWork":"Trainees undertake two teaching placements in carefully selected contrasting schools and key stages. Trainees specialising in the Primary (3 – 7) age range undertake one placement in a Key Stage One setting and one in an Early Years Foundation Stage EYFS) setting.\r\n\r\nPCP SCITT is pleased to partner with over 30 schools throughout Hampshire, Dorset, Wiltshire and IOW. Schools are selected on the basis of excellence in teaching and learning, evidence of quality mentoring and professional development, and the ability to provide rich and diverse learning opportunities for PCP trainees. Fostering productive, professional relationships between school, SCITT and trainee is at the centre of our successful teacher training programme. \r\n\r\nApplicants are invited to express a preference for a placement school at interview. Whenever possible this preference is taken into consideration, along with personal circumstances, geographical location and educational best fit based on the trainees’ prior experience. ","personalQualities":"The PGCE is an exciting, fast-paced year. Candidates are expected to be enthusiastic, well-organised, hard-working and keen to seek their own highest possible standards of achievement. Successful applicants will demonstrate: \r\n\r\n* Appropriate subject knowledge or the capacity to develop it during the course \r\n* A commitment to a career in primary education  \r\n* Strong interpersonal and communication skills, including the ability to foster good relationships with children \r\n* An understanding of the demands and expectations of the teaching profession \r\n\r\nCandidates do not need to be a Catholic or from a faith-based background.  ","otherRequirements":"The PCP is committed to safeguarding and promoting the welfare of children and young people. We expect all staff and trainees to share this commitment. All entrants undergo safeguarding and occupational health checks to ascertain that they are suitable to work with children. \r\n","status":1,"createdAt":"2021-07-06T10:47:29.624Z","updatedAt":"2021-09-28T09:14:55.852Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
