{"id":"b74e7c5f-98b4-4d18-abeb-569cd73e7320","name":"Primary","code":"T821","qualification":"qts","startDate":"2024-06-30T23:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"TA","fundingType":"apprenticeship","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"5401e417-9556-4b05-a2ef-8fef72ae55ea","name":"Holy Family Catholic Primary School PCP SCITT","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"c6cc9d00-9dc5-4e23-959d-d2be40dd4aed","code":"P85","name":"Primary Catholic Partnership SCITT (PCP SCITT)"},"degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We recommend equivalencytesting.com but may accept tests from other providers by prior arrangement. Equivalency test costs are met by the candidate.","courseLength":"minimum 13 months","aboutCourse":"Apprenticeships are a salaried training route appropriate for existing school employees, or experienced applicants with a school prepared to employ them for the duration of the course.​\r\n\r\n* A salaried training route lasting for a minimum of 13 months (usually around 4 school terms)\r\n* Apprentices are released for 20% of their working hours (the equivalent of one day a week) for off-the-job training\r\n* Salary costs are met by the employing school\r\n* Training costs are paid through the Apprenticeship Levy Fund\r\n* Central training is provided by PCP SCITT, which is on the Register of Apprenticeship Training Providers\r\n* The programme leads to Qualified Teacher Status (QTS) and the award of an Apprenticeship\r\n* Apprentices are assessed against the Teachers' Standards (2012). They are guided by PCP SCITT staff and their school mentor to prepare a portfolio of evidence to demonstrate that they have met the Teachers' Standards. They will also complete 2 written assignments and undertake an End Point Assessment in Term 4 of the apprenticeship.\r\n\r\nCandidates and their supporting school should contact PCP SCITT prior to submitting an application to discuss apprenticeship levy funding eligibility and requirements.","interviewProcess":"","howSchoolPlacementsWork":"Apprentice trainees undertake a main placement in their employing school in addition to a placement of at least six weeks in a contrasting setting. ","personalQualities":"The apprenticeship is an exciting, fast-paced year. Candidates are expected to be enthusiastic, well-organised, hard-working and keen to seek their own highest possible standards of achievement. Successful applicants will demonstrate:\r\n\r\n* Appropriate subject knowledge or the capacity to develop it during the course\r\n* A commitment to a career in primary education\r\n* Strong interpersonal and communication skills, including the ability to foster good relationships with children\r\n* An understanding of the demands and expectations of the teaching profession\r\n\r\nCandidates do not need to be a Catholic or from a faith-based background.","otherRequirements":"Applications are invited from existing school employees, or those who have arranged for a school to employ them for the duration of their apprenticeship.​\r\n\r\nThe PCP is committed to safeguarding and promoting the welfare of children and young people. We expect all staff and trainees to share this commitment. All entrants undergo safeguarding and occupational health checks to ascertain that they are suitable to work with children.","status":1,"createdAt":"2021-07-06T10:47:29.680Z","updatedAt":"2021-09-28T09:15:18.726Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024"}
