{"id":"3644825e-f494-4404-819b-19054871a623","name":"Design and Technology (Engineering)","code":"37G2","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"other","programType":"SD","fundingType":"fee","studyMode":"F","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"118fabd7-86d0-4a40-9e9a-e5c302abe59b","code":"DT","name":"Design and technology"}],"locations":[{"id":"dd46414e-1e34-42fc-9baf-2af4508cf295","name":"Doncaster Hub - Delta Academies Trust","isPublished":"N","status":"N","vacancies":"F"},{"id":"2704202f-7885-494f-9f87-63c66229bc9a","name":"Humber Hub - Delta Academies Trust","isPublished":"N","status":"N","vacancies":"F"},{"id":"4f95653c-f171-494d-a728-c5bc1f13f834","name":"Main Site","isPublished":"N","status":"N","vacancies":"F"},{"id":"4872c206-c59e-4f5d-a03c-1ab32447df79","name":"Leeds / Wakefield Hub - Delta TSA","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"dfb70146-b996-4195-8f8d-1f04a3c73466","code":"1DU","name":"Delta Academies Trust"},"accreditedBody":{"id":"899178cc-20a7-4df5-951a-ee83c1b3d4d1","code":"S21","name":"Sheffield Hallam University"},"profPost":"PG","english":"3","maths":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feesInternational":13500,"feeDetails":"Please note that course fees for 2020/21 are to be confirmed.","aboutCourse":"School Direct is a programme where schools or partnerships of schools apply for trainee teacher places. This means that schools can choose the teacher training provider they wish to work with and have more control over what training is provided and how it is delivered, including how much training will take place within the school partnership. Schools recruit the trainees they want, and trainees will go on to teach in their school, or another school in their partnership, once qualified.  It is part of a wider set of reforms designed to help schools take greater responsibility for leading and shaping ITT.\r\n\r\nFor 2020/21 two types of School Direct training places are available:\r\n•\tThe School Direct Training Programme, which is open to all graduates and funded by tuition fees paid by the trainee, who may be eligible to receive a bursary.\r\n•\tThe School Direct Training Programme (salaried), which is an employment-based route into teaching for high quality graduates with three or more years' career experience.\r\n\r\nDelta TSA School Direct Trainees will:\r\n•\tBe supported by outstanding teachers and specialist leaders of education (SLEs), have a school-based mentor and an academic tutor from the university who will be an expert specialist in the field.  All of these will be dedicated to your development towards becoming a high quality reflective practitioner.\r\n•\tGain a PGCE which includes qualified teacher status and can be used as the first third of a masters degree if you wish to continue with this accredited professional development in the early part of your career.\r\n•\tBenefit from high quality sessions with other trainees across Delta Teaching School Alliance to develop your knowledge and application of effective strategies that underpin learning and achievement in the classroom.\r\n•\tUtilise outstanding current teachers and school leaders to lead taught sessions, ensuring you learn from those who are current teachers and school leaders.\r\n•\tBenefit from high quality sessions with other PGCE students at the university where research-informed practice and theoretical underpinning of classroom practice will be shared and critiqued.\r\n\r\nDelta TSA offers the following Design & Technology courses:\r\n•\tFood\r\n•\tTextiles\r\n•\tProduct Design\r\nEngineering is only offered with at least one of the above classifications as a combined course.\r\nIf you would like to train to teach D&T as a combined course, please indicate this in the personal statement section of your application stating classifications of interest.","interviewProcess":"After applicants have submitted their application via the UCAS system, we will receive the applications and shortlist applications that meet our entry requirements.  We will then invite candidates to a one-day assessment centre, hosted at one of our academies in the Delta Academies Trust group.\r\n\r\nThe assessment centre will test various skills and qualities through different assessment methods. The assessment centre will involve candidates observing lessons, teaching the panel 'something' (either an academic or non-academic subject) and answering a set of interviews questions. In addition to the tasks mentioned, Primary Phase candidates will have to complete Sheffield Hallam University English and Maths tests and Secondary Phase candidates an English test. The tests are a compulsory requirement for all candidates wanting to train with Sheffield Hallam University and Delta Teaching School Alliance.\r\n\r\nOnce candidates have completed the one day assessment centre, Delta Academies Trust will confirm via the UCAS system whether candidates have been successful or not.  Once candidates have confirmed their training place, Delta Teaching School Alliance and Sheffield Hallam University will write to candidates with an offer letter, outlining conditions of the offer.\r\n","howSchoolPlacementsWork":"Once candidates have been offered a training place on the School Direct Programme with Delta Teaching School Alliance, we will aim to inform candidates of the area in which they will undertake their first training placement within two weeks of the candidate accepting a place. First placements are confirmed at the Delta TSA School Direct Induction which takes place towards the end of the Summer Term (late June / early July).\r\n\r\nAs Delta Academies Trust has academies based across Yorkshire and the Humber, we will always aim to try and place trainees in academies that are closest to where they live to cut down on commuting time.  For more information as to which academies are part of Delta Teaching School Alliance, please visit our website.\r\n\r\nTrainees will follow their Academy calendar and the timetable at the University, training in academies four days per week throughout the whole academic year.  Each Friday trainees attend the University to learn as part of a professional cohort of training teachers and spend the rest of the week learning to teach in their Academy. They will also complete a placement in a second academy during the Spring Term that provides an alternative experience, and have the opportunity nearer the end of the course to undertake experience in a range of educational settings such as Sixth form academies, Special Needs Academies etc.  A trained mentor/school based trainer will work with the trainee and support their professional development throughout the year.\r\n\r\nAlthough trainees will be based in an academy, an important element of this School Direct programme will be training days held each week at the University. Training days will be attended by all School Direct trainees on the programme and will provide opportunities for them to reflect on academy experience and to meet with other School Direct trainees in the region.  The course will lead to a Postgraduate Certificate in Education (PGCE) with the opportunity of gaining up to 60 credits at Masters level, as well as meeting the requirements of Teacher Standards (QTS).\r\n","personalQualities":"Delta TSA, is looking for candidates who demonstrate a clear passion for teaching and a desire to ensure young people achieve their full potential.  We require our trainee teachers to be enthusiastic and dedicated to the teaching profession and their academy, so that they become outstanding teachers, working always to the highest standards.\r\n\r\nWe want candidates who demonstrate key qualities such as:\r\n- Empathy\r\n- Passion for teaching\r\n- Dedication\r\n- Patience\r\n- Emotional Intelligence\r\n- Excellent communication skills\r\n- Integrity\r\n\r\nOur ultimate goal is for all our trainee teachers to become 'Inspiring Teachers' so that we create 'Inspired Children'.\r\n","otherRequirements":"Trainee responsibilities include:\r\n- Participating fully in the programme of monitoring, support and assessment that is agreed with the ITT Coordinator, Mentor, Delta TSA and SHU.\r\n- Familiarisation with the Teachers’ Standards and monitoring and auditing their own progress in relation to them.\r\n- Ensuring that their conduct throughout the School Direct Programme is always of a professional manner, in line with SHU, Delta TSA and the Academy expectations.\r\n- Planning, preparing thoroughly and keeping good records.  Be conscientious in researching the subject knowledge you need to teach your lessons.\r\n- Being flexible and open to new learning.\r\n","status":2,"createdAt":"2021-12-10T14:13:26.502Z","canSponsorStudentVisa":"no","cycle":"2024","applicationsOpenDateOther":"2021-10-13T00:00:00.000Z"}
