{"id":"483e465e-ae72-4c77-809b-c5e92216c71f","name":"Physics","code":"26PD","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"bf97cd0a-224c-43d3-a021-84143df13e8d","code":"F3","name":"Physics"}],"locations":[{"id":"2704202f-7885-494f-9f87-63c66229bc9a","name":"Humber Hub - Delta Academies Trust","isPublished":"Y","status":"R","vacancies":"F"},{"id":"4f95653c-f171-494d-a728-c5bc1f13f834","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"},{"id":"4872c206-c59e-4f5d-a03c-1ab32447df79","name":"Leeds / Wakefield Hub - Delta TSA","isPublished":"Y","status":"R","vacancies":"F"},{"id":"dd46414e-1e34-42fc-9baf-2af4508cf295","name":"Doncaster Hub - Delta Academies Trust","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"dfb70146-b996-4195-8f8d-1f04a3c73466","code":"1DU","name":"Delta Academies Trust"},"accreditedBody":{"id":"899178cc-20a7-4df5-951a-ee83c1b3d4d1","code":"S21","name":"Sheffield Hallam University"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":13500,"feeDetails":"Please note that course fees for 2020/21 are to be confirmed.","aboutCourse":"School Direct is a school-based teacher training programme. School Direct trainees spend the majority of the training year in placements within Delta Academies and also attend Sheffield Hallam University for frequent days during the training year. \r\n\r\nAs a Delta Academies School Direct trainee, you will:\r\n\r\n•\tBe supported by outstanding teachers, have a school-based mentor and an academic tutor from the university who will be an expert specialist in the field. All those involved in your training are dedicated to your development towards becoming a high-quality reflective practitioner.\r\n\r\n•\tGain a PGCE which includes qualified teacher status and can be used as the first third of a master’s degree (60 credits) if you wish to continue with this accredited professional development in the early part of your career.\r\n\r\n•\tBenefit from high-quality sessions with other trainees across Delta Academies Trust to develop your knowledge and application of effective strategies that underpin learning and achievement in the classroom.\r\n\r\n•\tUtilise outstanding, current teachers and school leaders to lead taught sessions, ensuring you learn from those who are current teachers and school leaders.\r\n\r\n•\tBenefit from high-quality sessions with other PGCE students at the university where research-informed practice and theoretical underpinning of classroom practice will be shared and critiqued.\r\n\r\n•\tBenefit from a dedicated School Direct team to offer support throughout the training year and beyond with many trainees remaining with Delta for their ECT year (Early Career Teacher). \r\n\r\nCourse fees for 2022 to 2023 are £9,250. You may be eligible for a student loan or bursary. Visit (https://getintoteaching.education.gov.uk/) for more information about funding your training. \r\n","interviewProcess":"After applicants have submitted their application via the UCAS system, we will receive the applications and shortlist applications that meet our entry requirements.  \r\n\r\nDue to current COVID restrictions, we have decided to continue with online interviews until it is safe to return to face to face interviews.  The interview process will include feedback on a video clip of a lesson.  A 'Teach the Panel' activity - details will be included in your invite to interview email.  Secondary candidates will complete a Sheffield Hallam University English task.  There will also be a selection of formal interview questions. \r\n\r\n","howSchoolPlacementsWork":"During your training year, you will undertake placements in two contrasting schools with the majority of Secondary trainees spending most of their time in one host school with a short complementary placement after Christmas.\r\n\r\nFirst placements are confirmed at or before the Delta School Direct Induction which, takes place towards the end of the Summer Term (late June / early July).\r\n\r\nAs Delta Academies Trust has academies based across Yorkshire and the Humber, we will always aim to try and place trainees in academies that are within a ‘reasonable travelling distance’ from where they live to cut down on commuting time.  It cannot be guaranteed that placements will be in the closest school due to additional factors. For more information as to which academies are part of Delta Academies Trust, please visit our website.\r\n\r\nTrainees will follow their Academy calendar and the timetable at the University, training in academies four days per week throughout the whole academic year.  Each Friday trainees attend the University to learn as part of a professional cohort of training teachers and spend the rest of the week honing their teaching skills in their Academy. Each trainee will have a dedicated mentor within each of the placement schools as a point of contact and a person to support their personalised development.\r\n\r\nThe course will lead to a Postgraduate Certificate in Education (PGCE) with the opportunity of gaining up to 60 credits at Masters level, as well as meeting the requirements of Teacher Standards (QTS).\r\n","personalQualities":"Delta Academies Trust, is looking for candidates who demonstrate a clear passion for teaching and a desire to ensure young people achieve their full potential.  We require our trainees to be enthusiastic and dedicated to the teaching profession and their academy, so that they become outstanding teachers, working always to the highest standards.\r\n\r\nWe want candidates who demonstrate key qualities such as:\r\n- Empathy\r\n- Passion for teaching\r\n- Dedication\r\n- Patience\r\n- Emotional Intelligence\r\n- Excellent communication skills\r\n- Integrity\r\n\r\nOur ultimate goal is for all our trainee teachers to become 'Inspiring Teachers' so that we create 'Inspired Children'.\r\n","otherRequirements":"Trainee responsibilities include:\r\n- Participating fully in the programme of monitoring, support and assessment that is agreed with the ITT Coordinator, Mentor, Delta and SHU.\r\n- Familiarisation with the Teachers’ Standards and monitoring and auditing their own progress in relation to them.\r\n- Ensuring that their conduct throughout the School Direct Programme is always of a professional manner, in line with SHU, Delta and the Academy expectations.\r\n- Planning, preparing thoroughly and keeping good records.  Be conscientious in researching the subject knowledge you need to teach your lessons.\r\n- Being flexible and open to new learning.\r\n","status":1,"createdAt":"2021-07-06T10:47:07.285Z","updatedAt":"2021-10-04T11:07:06.630Z","canSponsorStudentVisa":"no","cycle":"2024"}
