{"id":"f7cc10db-b81d-42f0-9d82-f76edb9eed25","name":"Primary","code":"27F5","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"c1392725-5ec8-4696-b474-a35ad4b66f4f","name":"St Hugh's School","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"6d249061-985e-4fe0-9463-c89cf2e4d9ba","code":"1RZ","name":"St Hugh’s School"},"accreditedBody":{"id":"b011427a-6dff-4a77-9df3-c85a54be605a","code":"Y75","name":"York St John University"},"profPost":"PG","degreeGrade":"9","english":"2","maths":"2","science":"2","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feesInternational":12750,"feeDetails":"Please contact York St John University for more information or visit the website: \r\n\r\nhttps://www.yorksj.ac.uk/study/postgraduate/courses/education/primary-education-pgce-school-direct/#section-fees\r\n","financialSupport":"Please contact York St John University for more information or visit the website: \r\n\r\nhttps://www.yorksj.ac.uk/study/postgraduate/courses/education/primary-education-pgce-school-direct/#section-fees","aboutCourse":"Training through St Hugh's and Leading Learning Forward Education Partnership in association with York St John Univerisity will provide you with a broad and relevant teaching experience as well as access to high quality SEND education and training.  We have a partnership with schools across North and North East Lincolnshire schools, in all phases (primary, secondary and special) and share skills, experience, talent and capacity to help improve the learning and achievement of young people across North Lincolnshire.\r\n\r\nPrimary Education (School Direct) PGCE is a one year full-time programme based in our partnership schools.  Our programmes last for one academic year (September 2022 - June 2023), during which time you will undertake high quality school placements within carefully selected partner schools.  \r\n\r\nYou will also enjoy a bespoke programme of training developed and delivered by our partnership and York St John University partners. \r\n\r\nOur Initial Teacher Training programmes have been designed to build your confidence and subject knowledge and give you the necessary skills to become an effective classroom practitioner.\r\n\r\nSt Hugh's School with Leading Learning Forward Education Partnership is looking to recruit  high quality Primary Education (School Direct) PGCE candidates across our lead schools for the 2022-23 academic year.\r\n\r\nWe have 6 Primary Education (School Direct) PGCE places available to start in September 2022 in association with our HEI training provider, York St John University.\r\n\r\nTwo modules are studied at Masters Level. The first includes professional issues including child development, planning, learning teaching and assessment, behaviour management and meeting individual needs. \r\n\r\nYou will be provided with the opportunity to consider how learners from diverse cultural backgrounds can be supported within education and care settings. This aspect of education is embedded through all modules where diversity is considered in order to meet the needs of all learners in all subjects and within the Early Years. \r\n\r\nYou will study, for example, current issues pertaining to inclusion, ethnicity, English as an Additional Language (EAL), SEND (Special Educational Needs and Disability) and the way in which settings cater for children of a range of abilities. Aspects such as behaviour and classroom management, vital to the practice of the outstanding class teacher, are covered across a variety of sessions in all modules.\r\n\r\nPlease visit the York St John University Primary PGCE (School Direct) web page for more information: \r\n\r\nhttps://www.yorksj.ac.uk/study/postgraduate/courses/education/primary-education-pgce-school-direct/\r\n","interviewProcess":"Interviews for Primary PGCE (School Direct) places with St Hugh's School and Leading Learning Forward Education Partnership are conducted by York St John University through their teacher training application process.\r\n\r\nThe assessment day provides us with the opportunity to meet with prospective students to find out why they have applied for the course, and to discuss in more detail the information provided on their application form. It also gives applicants an opportunity to talk about themselves, and to demonstrate their practical and academic skills relevant to the programme through a variety of tasks.\r\n\r\nActivities will involve a teaching activity where you will be asked to plan a whole class or group lesson. You will also be observed interacting with a group of children and consideration will be given to your ability to support learning.  \r\n\r\nYou will take part in group/individual interviews and be asked to reflect on your teaching activity. You will also be asked to respond to an academic article and demonstrate your potential to study at Masters Level.\r\n\r\nAssessments are made during the day regarding your commitment to and understanding of primary education, your potential to successfully meet the demands of the programme, personal and intellectual qualities and your ability to communicate effectively with adults and children in a school context.\r\n\r\nPlease see the UCAS website for more information about how to apply for School Direct initial teacher training starting in September 2022. \r\n","howSchoolPlacementsWork":"Successful applicants will be allocated to appropriate primary schools for their teacher training placements. These schools will be within North and North East Lincolnshire.\r\n\r\nWithin this area we have Infant Schools, Junior Schools and 5-11 Primary Schools. You will be given at least 2 different schools for your Teacher Training Placements.\r\n\r\nThe PGCE Primary programme is structured in phases (introductory, developmental and consolidation. Within each phase you will follow a similar pattern of learning to that of a ‘spiral curriculum’. This is to enable you to reflect upon your learning and make effective links with curriculum and pedagogy by relating theory to practice.\r\n\r\nAlongside academic assignments, you will be assessed in three school experience placements: these again follow the introductory, development and consolidation phases. The nature of these placements enables you to progress effectively by building upon your skills as student teachers.\r\n\r\nThe PGCE School Direct is a school-based programme. Student teachers are based in one school for the majority of the year with a shorter second school placement.\r\n","personalQualities":"Applicants for Primary Education (School Direct) PGCE with St Hugh's School, Leading Learning Forward Education Partnership and York St John University should be able to demonstrate commitment to and understanding of primary education, potential to successfully meet the demands of the programme, personal and intellectual qualities and the ability to communicate effectively with adults and children in a school context.\r\n","otherRequirements":"In addition, applicants must also:\r\n\r\nSatisfy the institution that they have the intellectual capability for the demands of teaching.\r\n\r\nTake part in an interview designed to assess their suitability to teach.\r\n\r\nObtain a satisfactory Disclosure and Barring Service (DBS) enhanced disclosure check and/or any other appropriate background check.\r\n\r\nObtain a satisfactory medical report. ","status":0,"createdAt":"2021-07-06T10:56:14.617Z","canSponsorStudentVisa":"yes","cycle":"2024"}
