{"id":"4a21a79e-7ab6-4fcf-b988-e5d717775ed9","name":"Dance","code":"W5X1","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"49dcc400-03df-4732-af93-1c56ae22897f","code":"12","name":"Dance"}],"locations":[{"id":"ad31a10e-7dba-4d8e-b27c-177fcaecae51","name":"University of Brighton Eastbourne campus","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"d2ba71f2-c125-4d86-bb22-736e67043120","code":"B72","name":"University of Brighton"},"profPost":"BO","degreeGrade":"9","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"We require an Honours degree in a relevant subject.  50% of your modules must be in dance.","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Please refer to our website for up to date information on accepted providers and qualifications.\n\n(https://www.brighton.ac.uk/studying-here/applying-to-brighton/undergraduate/entry-requirements/gcse-equivalence-tests/index.aspx)","courseLength":"OneYear","feesUK":9250,"feesInternational":14040,"aboutCourse":"You will graduate from our Dance PGCE equipped with the skills and knowledge to become a confident and competent secondary school teacher. Content is kept up to date with changes in local and national initiatives and legislation, so you will be confident that your working knowledge is based on current theory and practice.\r\n\r\nThere are four strands to this course: \r\n\r\n* subject study/subject education\r\n* education studies\r\n* school-based training \r\n* professional development. \r\n\r\nStudying at our Eastbourne campus you will benefit from a range of course features which include:\r\n\r\n* access to our two dance studios one of which seats an audience of 150\r\n* enrichment opportunities to teach the 16–18 age phase\r\n* opportunities to work with and choreograph for the universities undergraduate all male and all female dance groups\r\n* take part in our Inclusive Sports Day and teach dance to children with special education needs \r\n* be partnered with a mentor in school who is an expert in dance\r\n* a small cohort with round the clock support! \r\n\r\nSee full details of this course on the [University of Brighton website.](https://www.brighton.ac.uk/courses/study/secondary-dance-pgce.aspx?utm_source=DfE_teaching&utm_medium=organic&utm_content=secondary-dance-pgce&utm_campaign=pg_DfE_teaching_course_profile)  \r\n","interviewProcess":null,"howSchoolPlacementsWork":"As a trainee teacher on our initial teacher training courses you will have multiple opportunities to put your teaching theory into practice.\r\n\r\nYou will spend a minimum of 120 days on school-based training during your course. For secondary courses this is split into two phases approximately 16 weeks and 11 weeks long. \r\n\r\nYou will spend time in two contrasting schools to ensure you gain varied and valuable experiences. We have partnerships with over 600 schools and colleges in the South East offering opportunities in large, small, urban and rural settings. \r\n\r\nSchool-based training is organised on your behalf by our Partnership Office. At the start of your course you will complete a placement information form which will help us match you with suitable school settings. We will take into account your previous experience, the distance from your home and any individual needs such as caring responsibilities. We aim to minimise your travelling time to placement and wherever possible keep it under 40 minutes. \r\n\r\nOur staff will ensure that you are well prepared for each phase of school-based training, and that you have all the support and guidance you need to make the most of these opportunities. We run bespoke sessions to guide you through the expectations of school-based training and provide thorough guidance in handbooks.\r\n\r\nTrainees consistently evaluate their school-based training highly and Ofsted identify our approach to training in schools as a key strength of our courses, with an excellent balance between university tuition and school-based training.\r\n\r\nYou can find out more about school-based training on [our website.](https://www.brighton.ac.uk/current-students/my-studies/placements/training-to-teach.aspx) \r\n","personalQualities":"","otherRequirements":"All firm offer holders will be required to complete a satisfactory Suitability Declaration, DBS and Overseas Police check plus Occupational Health Questionnaire.","status":1,"createdAt":"2021-07-06T10:55:56.259Z","updatedAt":"2021-08-26T13:05:23.846Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
