{"id":"7355541b-691c-47d1-8dcd-d08f995c189c","name":"Computing","code":"H794","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"e6be6a9c-8696-4b88-8fbd-1ba1bef1b6fc","code":"11","name":"Computing"}],"locations":[{"id":"d9f9986e-4f71-4ef2-a999-972e4d1937de","name":"Main Site","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"b47337b6-3413-410e-bf1f-44c0ea1c3e9c","code":"1AR","name":"West Exe SD"},"accreditedBody":{"id":"ff5e78c6-2928-44d6-b4e6-8fa2fed5feb7","code":"S66","name":"South West Teacher Training"},"profPost":"PG","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","aboutCourse":"The South West Teacher Training School Centred Initial Teacher Training PGCE programme in Computer Science prepares students to teach in Secondary Schools. All trainees, whether coming straight from university or from an industrial/commercial background, will follow a core syllabus focusing on the knowledge and skills required to teach at Key Stage 3, 4 and beyond. SWTT trainees will study a wide range of Computer Science topics such as visual programming, programming languages, web programming, game design and more, which they can then put into practice at their two Secondary school placements. They will learn not only the practical skills but also the pedagogy of teaching such a complex and rapidly changing subject. Sessions are designed and led by practicing Computer Science teachers from across our partnership, who ensure our trainees are prepared with an up-to-date understanding of this subject in school settings. The course aims to provide trainees with access to Computer Science classrooms and time to observe how successful teachers are making this subject an increasingly popular choice for young people. The PGCE programme aims to produce reflective teachers who are able to evaluate and further develop their own subject and teaching skills. ","interviewProcess":"Under guidance from the Department for Education, SWTT continues to recruit throughout this period in response to the Covid 19 pandemic. Applicants will still be shortlisted in the usual manner. Once shortlisted, applicants will be invited to an online interview that will involve:\r\na short presentation – how would you teach an aspect of your subject to a group of children?\r\na subject knowledge assessment – how familiar are you with the content of the current school curriculum in your subject?\r\na PGCE readiness task assessing your ability to read and write at Masters Level\r\na panel interview with the SCITT Lead and the Course Tutor for your subject, as well as young people from West Exe School..\r\nopportunities to meet the core SWTT team and ask questions about the programme.\r\nInterviews take around 2 hours and candidates are given 5-7 days notice to allow them time to prepare.\r\nSuccessful candidates are then greeted with a Welcome Pack which helps them through the preparations required to start the course. We pride ourselves on communicating regularly with successful candidates so they feel like a part of the South West Teacher Training community.","howSchoolPlacementsWork":"South West Teacher Training has a wide partnership of fifteen placement schools in Exeter, Plymouth and in rural and coastal communities across Somerset, Devon and Cornwall. This enables us to place trainees within easy travelling distance of home - we feel this is important to ensure trainee well-being and resilience. It’s unusual for our trainees to spend more than thirty minutes travelling to placement. \r\nWhen placing our trainees, we consider their location but we also make an effort to ensure a good match in ethos between the trainee and their host school. It’s important too that trainees experience two contrasting placements to enable them to really discover the kind of school culture that suits them best.\r\nAs a school-centred route, we pride ourselves on ensuring our trainees spend as much time in school as possible. After a week’s Induction, trainees complete three days of experience in a Primary school and then begin the first of two placements in an 11-16 or 11-18 setting. This quick immersion into school life, integrated with training sessions at our training base, ensures trainees are able to swiftly start teaching under expert guidance, with time to reflect built into the programme.","personalQualities":"We will be looking for candidates who demonstrate:\r\na passion for sharing their subject with young people\r\nan ability to form positive working relationships with children and adults\r\nstrong subject knowledge that they can communicate with others\r\na range of experience of school settings or working with young people\r\na professional demeanour\r\nresilience and creativity\r\npositivity and a strong sense of moral purpose for improving the lives of young people.\r\n\r\nOur website www.swtt.net details a full job description and person specification.","otherRequirements":"Safeguarding is important at South West Teacher Training and all candidates must satisfy relevant pre-employment checks. A place to train with us will involve contact with vulnerable groups (children and young people) and is therefore exempt from the Rehabilitation of Offenders Act 1974 and subject to an Enhanced Disclosure Barring Service (DBS) check. This exemption means that applicants for this post are required to declare all criminal convictions, cautions, reprimands and bindovers both spent and unspent in their application regardless of the passage of time.","status":2,"createdAt":"2021-07-06T10:46:20.866Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"This is a salaried position. The remuneration will be agreed between the candidate and the employing school, using the unqualified teachers' pay scales. The fees for this course will be paid by the employing school."}
