{"id":"5aa56934-181b-4150-b06b-f5fc701bd6cb","name":"Art and Design","code":"2MFB","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"d461a678-3335-4ca2-9616-1dc479d31a49","code":"W1","name":"Art and design"}],"locations":[{"id":"7ce06657-1d9b-45a3-885d-9a19aeb6ad9a","name":"Greenbank High School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"5bce4ad6-5128-4fd9-91dd-4503770f2a24","name":"South Wirral High School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"166b8349-6600-4f27-97c5-705229db4320","name":"Deyes High School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"dc080a02-ed45-485d-9f35-da49e5ba0c95","name":"AMP SCITT @ LLT Academy of Teacher Education","isPublished":"Y","status":"R","vacancies":"F"},{"id":"274988e2-b764-472e-b88a-70655a1bd470","name":"Childwall Sports and Science Academy,","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"8796f284-20bb-4ad7-a6e6-cd40fc05fb2d","code":"25F","name":"Associated Merseyside Partnership SCITT"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Details of providers and fees will be discussed at interview","courseLength":"OneYear","feesUK":9250,"feeDetails":"There is also an administration charge of £60 for a DBS certificate.","aboutCourse":"The AMP SCITT model is a school based, 100% teacher led training route. Many trainees go on to work within the Associated Merseyside Partnership (AMP), although there is no absolute guarantee of employment.\r\n\r\nKey aspects of the training\r\n\r\n* Day one in school- you start on the first day of term as a member of staff, welcomed by your fellow teaching professionals. \r\n* Develop the skills, enthusiasm and confidence, you need to be a successful teacher of pupils of all abilities through two separate and contrasting placements\r\n* Build your knowledge of education and your subject specialism through working with practising teachers and the latest educational research.\r\n* Learn about the wider role of teachers in school and child development.\r\n* Develop as a reflective practitioner and be fully prepared for your first post and Early Career Framework.\r\n\r\nThis is an intense school led programme. Support is an important part of the training and you will receive personalised coaching that will enable you to set targets and achieve to your highest potential. You will receive support from;\r\n\r\n* School Subject Coach\r\n* School Professional Mentor\r\n* SCITT Management team\r\n* A subject Expert Practitioner\r\n\r\nOne of the major strengths is that the training is delivered throughout the course by practising teachers within our schools who are able to model best current practice. The course structure is\r\n*  38 working weeks in length. \r\n* Term 1: 4 days a week on school placement and 1 day a week participating in our Centre Based Training delivered at our Academy for Teacher Education, Vortex House.\r\n* Term 2 and 3:  5 days a week, in the classroom, teaching. \r\n\r\nThis means trainees will spend up to 150 days of the course actually training in school. \r\n\r\nDuring the course you will also complete a PGCE (60 Masters level credit), assessed by two written assignments. There are 12 taught days which are delivered at the Academy of Teacher Education or Online. As a trainee teacher with AMP SCITT you will have full access to the Liverpool Hope University, the online library and student services to support your academic writing.\r\nAssessment for the QTS award is through an e-portfolio of evidence of your teaching practice and lesson observations. There are 5 review points across the training year to support your continued development. \r\n","interviewProcess":"The initial stage of selection is reviewing your UCAS application. We ensure your qualifications meet our entry requirements and your personal statement indicates you have a passion for education and your specialised subject. If you are successful, you will be invited to interview hosted Online or at our Academy of Teacher Education. The interview day is usually within 1-2 weeks of receiving your application.\r\nThe interview process will include the following:\r\n\r\n* Tour of the Centre\r\n* Opportunity to ask questions/obtain further information\r\n* A panel interview probing knowledge of teaching and your subject\r\n* A prepared presentation\r\n* Assessment of Fundamental English and Mathematics\r\n* A request prior to your interview of a portfolio of your work to showcase your skills\r\n\r\nAt AMP SCITT we are looking for candidates who have a good understanding of their specialist subject, but it is just as important that teachers have personal attributes that will help them to relate to young people and enable them to communicate effectively.  Appropriate ICT and interpersonal skills with an awareness of teaching and educational issues is expected for a successful candidate. \r\nOur interview helps us to identify personalised support to prepare for the start of your course.","howSchoolPlacementsWork":"All trainee teachers are required to complete two contrasting school placements; with AMP SCITT the main placement is known as the Home School.  In Term 2 you will experience a contrasting placement in your Away school for 6-8 weeks, returning to the Home school for the second half of term 2 and the whole of term 3.\r\nWe have a personalised approach to placement selection. We utilise information from interview to select the most appropriate home school to allow you to develop quickly and then your away school placement is informed by your e-portfolio.  For details of our partner schools please review our website by [clicking here](https://www.amp-scitt.lydiatelearningtrust.co.uk/about/our-partners/). There will be some scope for trainees to have additional enrichment placements including Special Needs and pupil referral units depending upon your career aspirations and interests. Additionally, AMP SCITT will ensure all Secondary trainees experience post-16 teaching as our course is 11-16 with post 16 enhancement.","personalQualities":"Great teachers inspire, so that’s just one of the qualities AMP SCITT looks for in our trainee teachers. Teachers are role models so you also need to have the ability to empower students to think critically, be innovative, creative, adaptable, passionate, and flexible. Your interpersonal skills need to encourage and motivate students and you should able to solve problems, self-direct, self-reflect, and lead. ","otherRequirements":"You are also required to demonstrate competency in Fundamental English and Mathematics which will be assessed at interview.\r\nAlthough not essential applicants can benefit from relevant school experience or deeper understanding of the role of the teacher. We host school experience visits or virtual school experience to help applicants gain a deeper understanding. [Click this link](https://amp-scitt.lydiatelearningtrust.co.uk/get-school-experience/)  for further details.\r\n","status":1,"createdAt":"2021-07-06T10:52:02.839Z","updatedAt":"2021-09-17T11:01:01.037Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
