{"id":"088b1938-09b5-4884-92f6-125fe1c137eb","name":"Primary (5-11)","code":"2WTB","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"0d75ae33-5e7b-4cd5-9dca-37c03dd742bc","name":"Primary","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"0f3abdaf-7b36-422e-a700-046f8a641c60","code":"C79","name":"Cornwall School Centred Initial Teacher Training. (Cornwall SCITT)"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"Candidates will be expected to use a third party and pay any fees liable.","courseLength":"OneYear","feesUK":9250,"feesInternational":9250,"feeDetails":"Subject to confirmation by the Department for Education.","financialSupport":"Cornwall SCITT trainees are highly likely to be eligible for Student Finance support. As part of our access to learning fund, we may be able to support those in financial hardship with course-related costs incurred during training. We also offer a termly contribution to all trainees with a household income lower than £25,000 as assessed by Student Finance.\r\n\r\n\r\n","aboutCourse":"The course is a one year full-time course, which runs from September through to July, leading to Qualified Teacher Status (QTS). Trainees will also complete a Postgraduate Certificate of Education (PGCE). This is delivered in partnership with Bath Spa University, and is assessed by the submission of 3 assignments. The final award is equal to 60 credits at Level 7 (masters level).  The course covers the age range 5 to 11 years although trainees also spend a short time in an EYFS class.\r\n\r\nTrainees are assigned a trained school based trainer within each school that they are placed. This person is responsible for supporting and guiding the trainee’s professional development and ensuring that they have the opportunities that they need within the school.\r\n\r\nA trainee’s progress is assessed through regular formal and informal monitoring of teaching and written work.\r\n\r\nTraining in school progresses from observing and working alongside an experienced teacher to taking full responsibility, firstly for groups, and later for the whole class during the academic year. The course will produce qualified teachers who are competent and reflective across Key Stage 1 and Key Stage 2.","interviewProcess":"During interview day candidates must be able to demonstrate evidence of their potential to become an effective primary teacher and have an awareness of current issues in education.","howSchoolPlacementsWork":"We work with over 70 schools across the county. This usually enables us to place trainees within a 30 minute drive from home. \r\n\r\nTrainees on the 5-11 course complete their Autumn term placement in a Key Stage 1 class and their Spring term placement in a Key Stage 2 class in a different school. This fulfills the ITT requirements regarding two settings and two key stages. During the summer term, Route 2 trainees are placed in a different key stage 2 class. This may be in their Autumn or Spring term schools, or may be in a new setting, depending on placements available. All placements are usually within a 30 minute drive from home.\r\n\r\nDuring Spring trainees can apply to take part in an enhanced placement. These take place in special schools, area resource bases, pupil referral units and nursery schools. Enhanced placements aim to extend a trainee’s experience in a particular area of interest or need. Applications are carefully considered by the Course Leaders. ","personalQualities":"- Convey commitment and enthusiasm to teaching in the primary age range.\r\n- Be able to clearly articulate appropriate reasons for wanting to teach primary children.\r\n- High level of motivation and enthusiasm for teaching and learning.","otherRequirements":"As part of our commitment to safer recruitment, all successful candidates will undergo the full range of safeguarding checks, including their health & physical capacity to teach.\r\n\r\nFor those who have spent more than 3 months working or living abroad you may be required to gain a letter of good conduct or a workplace reference. \r\n\r\nWe are expected to make an assessment of fundamental English and mathematics knowledge before QTS is awarded. Any work to address shortfalls in English and mathematics must be undertaken by the trainee teacher in addition to other aspects of their training.\r\n","status":1,"createdAt":"2021-07-06T10:56:17.154Z","updatedAt":"2021-08-05T10:02:43.158Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
