{"id":"e1ab0e99-a5d4-4733-b398-9cb4bca84c37","name":"Modern Languages (French with German)","code":"28WR","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"ce8523ef-9236-4cd9-b260-d826c7a521b3","code":"ML","name":"Modern Languages"},{"id":"fbb00c08-2dbc-4f26-adb3-3b23afba18c1","code":"17","name":"German"},{"id":"9727f674-61ba-4efa-b1f2-21ec7e354442","code":"15","name":"French"}],"locations":[{"id":"d0a18c1f-f257-49af-a19d-e1bc97501ce0","name":"Secondary","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"0f3abdaf-7b36-422e-a700-046f8a641c60","code":"C79","name":"Cornwall School Centred Initial Teacher Training. (Cornwall SCITT)"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"If you do not hold a Grade 4/C or higher in GCSE Maths or English then you will need to enrol on a course to gain these qualifications, or consider taking an equivalency test https://www.equivalencytesting.com/","courseLength":"OneYear","feesUK":9250,"feesInternational":9250,"financialSupport":"Cornwall SCITT trainees are highly likely to be eligible for Student Finance support. As part of our access to learning fund, we may be able to support those in financial hardship with course-related costs incurred during training. We also offer a termly contribution to all trainees with a household income lower than £25,000 as assessed by Student Finance.\r\n\r\n\r\n","aboutCourse":"During the first term of the course you will engage with professional studies and subject studies alongside your school placements.  This encourages our student teachers to think holistically about the issues discussed during their professional studies sessions, their application within the context of their subject specialism and the opportunity to put ideas into practice. As your confidence in the classroom develops, you will extend your time spent on placement in preparation for your first year as a qualified teacher.\r\n\r\nEducation & Professional Studies Programme (sessions based at Truro College): provides a framework for student teachers to develop as professional educators by providing a broader perspective on educational issues that set the context for learning. EPS sessions include support for the Postgraduate Certificate in Education (PGCE) with dedicated academic tutors to guide your academic progress. The PGCE, delivered in partnership with Bath Spa University, is assessed by the submission of 3 assignments. The final award is equal to 60 credits at Level 7 (masters level).\r\n\r\nSubject Studies Sessions: Subject Studies develops subject knowledge in relation to curriculum needs and appropriate teaching and learning strategies, with a particular focus on how educational issues such as assessment, planning, and delivery can be most effectively achieved in the classroom.  Subject sessions develop your existing subject knowledge in your subject area, while identifying ways to express this knowledge in a manageable format for young learners. The focus is on practical solutions to ensure that you develop as a creative and reflective classroom practitioner. \r\n\r\nSchool placements: For all student teachers, the most exciting part of the training programme is their time spent on placement in our partnership schools. One of our greatest strengths is our bespoke training programme coordinated by our team of subject leaders, who will carefully select a suitable placement based on your individual needs. Every student teacher will receive support from a dedicated mentor while on placement, and will also receive additional training from the school’s professional tutor. Our mentors support trainees to develop at their own pace, from observing lessons to planning and implementing their own series of lessons by the end of the course. You will be placed at two schools within our partnership during the course, and will be assessed by a portfolio of evidence collected while on placement, leading to the award of Qualified Teacher Status (QTS).","interviewProcess":"All applications are reviewed by our management team prior to selection; those successful will be invited to interview. Applicants will be asked to prepare several tasks, including a pre-interview subject knowledge audit and a short written reflection on an educational topic. \r\n\r\nAll candidates will be asked to deliver a short teaching episode to an interview panel of up to three people, including a member of the management team and a subject leader, with the panel assuming the role of learners. Following the teaching episode, the interview panel will discuss the application in greater detail, including reflections on school experience gained prior to interview, subject knowledge and preparedness to enter the teaching profession.  Candidates are also asked to bring in an object that could be used in a classroom context, and will be asked to discuss this as part of the formal discussion. Candidates will be expected to communicate in French and German.\r\n\r\n","howSchoolPlacementsWork":"Cornwall SCITT works in partnership with more than 25 Secondary Schools in Cornwall, including a Special School Trust and an Alternative Provision Multi-Academy Trust. At interview, the  panel will discuss your placement needs and select suitable placements accordingly. We aim to place trainees 30-40 minutes from home, but occasionally this can take longer, especially for those living in more rural areas.  \r\n\r\nTrainees will usually experience two school placements. We aim to give trainees a broad range of experiences during the course, and aim for the second placement to contrast with the main placement. Placements will focus on the 11-16 age range, but post-16 experience can be gained either through sixth form participation or a short placement in a tertiary College. \r\n\r\nYou will be on school placement for 3 days per week in the Autumn term, attending placement alongside Professional Studies and Subject Studies training sessions until November, when you will be in school 5 days a week. \r\nThis pattern is repeated in the Spring term. From February half term until the end of the course you will be on placement 5 days per week.  This allows you to embed your practice, and develop in confidence as you progress towards your final assessment and, moving forwards, your first employed post. \r\n\r\nCornwall SCITT offer enhancement opportunities for those interested in visiting an SEN School or an Alternative Provision Academy, circumstances permitting. These enhancements are initially for a one day visit, with an opportunity for an extended placement in the Spring or Summer Term.\r\n","personalQualities":"The application form and interview process is designed to assess suitability to train to teach and will focus on the applicant’s:\r\n\r\n* Commitment to the teaching profession and improving the lives of young people;\r\n* Enthusiasm for the chosen subject and a capacity to inspire learners;\r\n* Awareness of current educational issues;\r\n* Intrinsic passion for learning;\r\n* Commitment to own professional development;\r\n* Excellent organisational, communication and interpersonal skills;\r\n* Ability to establish effective relationships with both pupils and adults;\r\n* Flexibility and a willingness to act upon advice;\r\n* Emotional and physical resilience and readiness for hard work\r\n","otherRequirements":"As part of our commitment to safer recruitment, all successful candidates will undergo the full range of safeguarding checks, including their health & physical capacity to teach.\r\n\r\nFor those who have spent more than 3 months working or living abroad you may be required to gain a letter of good conduct or a workplace reference. \r\n\r\nWe are expected to make an assessment of fundamental English and mathematics knowledge before QTS is awarded. Any work to address shortfalls in English and mathematics must be undertaken by the trainee teacher in addition to other aspects of their training.\r\n\r\n","status":1,"createdAt":"2021-07-06T10:56:17.062Z","updatedAt":"2021-08-05T10:04:35.087Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
