{"id":"4d5ec1a7-a567-4cf8-94c8-c0b9089ed5db","name":"Primary","code":"3FKL","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"ba0440c0-b9d4-47fc-8943-a2e0453fa9d4","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"9c34b3ce-eec7-4e5c-ab35-be2d85eb9355","code":"1XK","name":"Arch Alliance - All Souls’ CE Primary"},"accreditedBody":{"id":"812b70c4-7fc4-46fc-975b-3e4d00f77dc4","code":"M40","name":"The Manchester Metropolitan University"},"profPost":"BO","degreeGrade":"1","english":"1","maths":"1","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"The School Direct programme is led by schools working in partnership with Manchester Metropolitan University. The recruitment and selection of students is undertaken by schools. Potential students are interviewed by the lead  school and if successful, this may become their main placement school, where they will spend the larger part of their teaching experience, or they may be offered a place in another school in the alliance. \r\nSchools work in alliances, with a Lead School taking responsibility for the co-ordination of the School Direct programme across the alliance. \r\nThe Lead School organises teaching experience days for students on key aspects of teaching and learning such as planning, assessment and meeting individual needs. They also have responsibility for preparing students to teach the Foundation Subjects and RE.\r\nIn addition to work in school, students will attend 20 days at the lead school for additional input and will have some time between lectures for study and reflection. There is an expectation that students attend a SMSC day conference, ‘Living and Learning in Diverse 21st Century Britain’.  SMSC explores important themes and dimensions; these go across subjects and are central to the delivery of a broad and balanced curriculum and the wider professional responsibilities of teachers.\r\nStudents will complete four assessments over the year, each contribute 15 M level credits towards a PGCE, all are led and marked by University tutors. Student must pass all assignments and their Teaching Experience (TE) to achieve qualified teacher status (QTS). On completion of the programme, successful students will gain 60 credits at Masters level, which they may use towards a future continuing professional development qualification, they will be awarded a PGCE and be recommended for Qualified Teacher Status. PGCE certificates are graded as pass, merit or distinction according to the grades obtained from each of the assessed units.","interviewProcess":"When shortlisted for interview candidates will be invited to the Lead School - All Souls' CE in Heywood for an interview. Candidates will be provided with an interview guidance booklet at this point to support them in the interview process. The interview panel will consist of the Head of the Arch Alliance Teaching School and the Lead School leader of school based training.\r\nOur aim at interview is to be able to identify the highest quality candidates therefore performance in all four aspects of the interview will be taken into consideration.\r\n•\tWritten task\r\n•\tTeaching task \r\n•\tIndividual presentation\r\n•\tIndividual interview\r\n","howSchoolPlacementsWork":"We offer placements for both primary courses and Early Years. Students are in their main school initially for 13 weeks (Block A). They then undertake a shorter placement of approximately 10 weeks in an alternative second school (Block B). Students also engage in a 1-week inclusion placement, focusing on Special Educational Needs and Disabilities (SEND). Students then return to their main school for a further 7 weeks (Block A2). Placements are organised by the Lead School using their alliance of primary schools. All Souls' CE (an outstanding primary school) is the Lead school and endeavours to match trainees with schools that will best support their teaching experience. \r\nOur alliance of 11 schools are all based within Rochdale therefore reducing travel time to and from school. \r\n","personalQualities":"We are looking for candidates who will become enthusiastic outstanding teachers with an ability to inspire our children with a love and a lifelong interest in learning. The Arch Teaching Alliance seeks resilient trainees with a passion, dedication and commitment to primary school education.\r\nWhen you apply, you should already be able to demonstrate the following:\r\n\tA commitment to, and understanding of, primary education, \r\n\tSuitable personal and presentational qualities, including a good standard of spoken and written English.\r\nClassroom experience is desirable but not essential.\r\n","otherRequirements":"If you accept a formal offer from Manchester Metropolitan University and the Arch Alliance you will be required to meet the Department for Education’s standards for physical and mental fitness to teach and clearance to work with children. \r\n\r\nFurther information, including a Declaration of Health questionnaire and details of how to apply for a Disclosure and Barring Service (DBS) Enhanced Disclosure will be sent to you after you have firmly accepted an offer.","status":1,"createdAt":"2021-07-06T10:52:01.342Z","updatedAt":"2021-10-01T15:58:20.571Z","canSponsorStudentVisa":"yes","cycle":"2024"}
