{"id":"dac86ae6-bb47-4756-b4ab-09807f9636d7","name":"Primary","code":"A298","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"62b9d53b-37ec-4cac-88f8-7b4bd233e61a","name":"Pilton Bluecoat Academy","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"59c5c303-2d98-4c16-a712-f1178c7941d0","code":"3T2","name":"Pilton Bluecoat Academy"},"accreditedBody":{"id":"d41a1821-e35b-48eb-bf02-4842872b04a2","code":"E84","name":"University of Exeter"},"profPost":"PG","degreeGrade":"9","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"financialSupport":"The University of Exeter is offering a £520 bursary to all UK students studying for a PGCE with us in 2022/23, whose household income is £25,000 or less. There is no separate application procedure for this bursary. Instead, the University of Exeter makes an assessment using the household income information provided by the student's funding body (e.g. Student Finance England). Students must make sure that they and their sponsor(s) have given consent for details of their application to be shared with the University of Exeter. This consent to share is requested during the application for financial support, but can be given at any time throughout the year by contacting their student funding body. \r\n\r\nStudents who have not applied for financial support, or who have applied but chosen not to be means tested, are unable to be considered for this bursary until they do.","aboutCourse":"Trainees are based entirely in schools for the academic year. A programme of phase/subject specific training is designed and delivered by the lead school, and is linked to a Masters level programme provided by the university. This is comprised of two 30 credit modules delivered through the university's electronic learning platform, and supported by seminars and/or tutorials. These modules are designed to develop understanding of core issues in education, and to support ability to engage with relevant research and link theory to practice. One day a week (or equivalent) is assigned to this distance study.\r\n\r\nDuring the year, all trainees spend time in two schools, usually having one main 'home' school and a second 'contrasting' school. Lead schools decide the placement pattern, but the contrasting school experience will always last for a minimum of 6 weeks. One day a week (or equivalent) is assigned to distance study for the online Masters programme. Trainees follow the Exeter Model of initial teacher education.\r\n\r\nTrainees are registered with the university and are eligible for training bursaries and student loans.","interviewProcess":"","howSchoolPlacementsWork":"We partner with 10 primary schools in a variety of contexts, from 40-child village schools to 400-strong town schools. You will be placed in two schools with one main placement and a contrasting school experience with punctuates your training for a minimum 6 week period.\r\n\r\nYou will be assigned a Lead Mentor and a Reflective Mentor. These will be teachers within the school who will help guide your practice and support your assignments. They are skilled and experienced teachers who are able to navigate your formative days of teaching and help develop you into a confident practitioner. \r\n\r\nYour teaching practice will be a combination of observation, co-teaching, small group work and whole class teaching. Over time and as you develop your skillset, you will increase your teaching time to gain more experience, while being supported by your mentoring team. If you experience difficulty, a Lead Mentor who works as part of TEAM is available to share any concerns or to gain an external perspective. A tutor from the University of Exeter will support your school practice through visits, and there will be online support for the Master's level assignments. \r\n\r\nEach week has one 'M day' which is off site and for Master's study. There is an additional afternoon each week out of school for CPD, delivered at High Bickington Community College by current teachers and specialists.","status":1,"createdAt":"2021-10-14T15:52:10.201Z","updatedAt":"2021-10-14T15:55:28.273Z","canSponsorStudentVisa":"yes","cycle":"2024"}
