{"id":"debd1099-f4b2-4a8e-abeb-99e2ef35aab5","name":"Chemistry","code":"2LS8","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"912d4fb4-761b-42e9-8dc6-e968b791ea4e","code":"F1","name":"Chemistry"}],"locations":[{"id":"cfe58ddc-cb2d-47eb-b807-c337da9779ac","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"36560117-9443-4ead-8e74-37ac3537da45","code":"1WH","name":"Wildern Partnership"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Candidates should use a third party, please see our website for further details.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"The Wildern Partnership SCITT aims to develop resourceful and reflective early career teachers who are able to motivate learners to engage, achieve and develop. \r\n\r\nOur curriculum is underpinned by four principal strands:\r\n\r\nBehaviours and Relationships; Diversity and Inclusion; Subject Pedagogy and Assessment. \r\n\r\nTeaching timetables build up at an individual rate fully supported by a mentor.\r\n\r\nCurriculum related expectations drive formative and summative assessment through bespoke target setting.\r\n\r\nPhase 1 – Scaffold (Lead School)\r\n\r\n-       Outstanding practice modelled, theory and practice analysed.\r\n-\t Integrated learning experience for general professional studies and \r\nsubject knowledge for teaching.\r\n- \tCore group training where Secondary and Primary trainees received \r\nphased and combined training by Wildern Partnership Specialists.\r\n\r\nPhase 2 – Scaffold and Develop\r\n\r\n-\tTeaching Groups, micro teaching and working with individual children building to whole class planning, teaching and assessment. Individual support from outstanding school based subject leaders and highly trained school based mentors.\r\n-\tMost Fridays are based at the training centre and other partner institutions for general professional studies and/or subject specific study.\r\n \r\nPhase 3 – Develop (Contrasting Setting)\r\n\r\n-\tCurriculum related expectations consolidated and developed in a contrasting setting.\r\n-\tTeaching classes, groups and individual children, supported and assessed by highly trained school based mentors. Embedding subject knowledge for teaching and supporting pupil progress.\r\n-\tMost Fridays are based at the training centre and other partner institutions for general professional studies and/or subject specific study. \r\n\r\nPhase 4 - Develop and Refine \r\n\r\n-\tReturn to lead school.\r\n-\tBegin to embed practice from second school experience.   \r\n-\tMost Fridays are based at the training centre and other partner institutions for general professional studies and/or subject specific study. \r\n-      Time spent in alternative settings/school as part of an enrichment programme.\r\n-      Optional start of second subject or SEND enrichment programme.\r\n\r\nPhase 5/6 – Refine and Enrich\r\n\r\n-\tRefine teaching practice to develop autonomy in the classroom.\r\n- \tSCITT support for local Early Career Teachers, School CPD in mentoring / subject knowledge / MA level study / diverse bespoke needs.\r\n-\tPreparing for Employment in Education.\r\n-\tMost Fridays are based at the training centre and other partner institutions for general professional studies and/or subject specific study. \r\n-\tFurther completion of teaching time, should any long periods of absence arise throughout the year.\r\n","interviewProcess":"Secondary SCITT  and School Direct Tuition Fee applicants – \r\nIf shortlisted for an interview you will be invited to Wildern School or a partnership school where you will; plan and facilitate, a teaching activity, undertake a Subject Knowledge Audit, English and Maths skills audit, complete a written task,take part in an organisational group activity and have an individual formal interview.\r\n\r\n\r\nPLEASE NOTE: Due to the Covid-19 pandemic the interview process is subject to change. Should this be the case, the SCITT Administration Team will inform applicants. ","howSchoolPlacementsWork":"Placement schools are selected following rigorous quality assurance processes of the placement which determines that the placement and mentoring will be of high quality, location; personal circumstances (such as means of transport, childcare); pedagogical and subject knowledge needs of the trainee; trainee’s prior background; commitment of the school and staff to the programme and a high level of professional development. \r\n\r\nTrainees will teach the age ranges of 11-16 (Secondary programme) and also gain experience in early years and  further education, as well as special schools, hospital schools and pupil behaviour units. \r\n\r\nThe Wildern Partnership SCITT partners with approximately 30 primary and secondary schools in diverse contexts.  \r\n","personalQualities":"","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:56:35.383Z","updatedAt":"2021-09-29T14:26:45.824Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
