{"id":"3b9c27ce-6773-497a-9931-937340e414ac","name":"Computing","code":"34L6","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"e6be6a9c-8696-4b88-8fbd-1ba1bef1b6fc","code":"11","name":"Computing"}],"locations":[{"id":"8b40642e-2434-44bf-99ec-cf091c99749d","name":"Liverpool Life Science UTC","isPublished":"Y","status":"R","vacancies":"F"},{"id":"02db24fe-8d71-4beb-ade4-19ae460099ec","name":"Fylde Coast SCITT - Blackpool","isPublished":"Y","status":"R","vacancies":"F"},{"id":"3c3c03ed-576c-403f-9ca6-01fa4f54ed39","name":"The Studio School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"cd2de94a-8b2e-4866-9352-5be3e5c3ee62","name":"North Liverpool Academy","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"12a0360e-341f-4650-a10e-d038387810c1","code":"252","name":"Fylde Coast SCITT"},"degreeGrade":"9","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"The Fylde Coast SCITT offer equivalency tests in English, maths and science at a cost of £50. However, we are unable to offer a revision package.","courseLength":"OneYear","feesUK":7300,"feeDetails":"Online PGCE available alongside the QTS programme with our partner, Leeds Beckett University.  The fees for QTS with PGCE are £9250.","aboutCourse":"As a trainee teacher of computer science on our SCITT, you will experience contrasting placements in our partner schools. \r\n\r\nYou will spend most of your time on the job learning how to teach your subject specialism from experienced practitioners. Your timetable will grow organically as you progress through the curriculum, taking what you learn on our Fridays into what you do in the classroom Mon-Thurs. \r\n\r\nOur curriculum is based on four core pillars and everything is anchored in those. We welcome guest speakers and visiting experts, we focus on safeguarding and child protection, we focus on how your subject explains the world in which we live, we explore cross-curricular knowledge and skills development, we have additional training on trauma and other issues relevant to the region, and we have Centres of Excellence for your subject-specific enhancement running alongside throughout the year. We also work closely with the Research School to ensure our curriculum is broad, evidence-informed and current. \r\n\r\nWe complete 3 'challenges' based on our curriculum; one per term, and they focus on: planning for your curriculum, understanding our local context and meeting the needs of our children, and how you have and will make an impact on your local area. There are no lengthy essays but we promote lots of reading and reflection alongside. \r\n\r\nWe have a really unique partnership and our schools are very near to each other so you will rarely have to travel far but a drivers' licence would prove very useful.\r\n\r\nWe have our own life coach, and our mission is to train healthy teachers for future generations in your area. As a result of this, and our close collaborations, we also have excellent local employment rates and retention rates to the profession. ","interviewProcess":"Our assessment days are rigorous, but candidates always report that they are an enjoyable experience and certainly serve to provide further confirmation that this is the right career choice for them.\r\n\r\nWe ask candidates to prepare for formal interview questions about their personality and their professional qualities.  For your subject knowledge assessment, you will meet with a subject expert to explore your understanding of the national curriculum and how children learn in your subject. The findings from this inform your subject knowledge enhancement programme if you are successful. \r\n\r\nWe may ask you to meet with a pupil panel where possible so we can see how you interact with young people.\r\n\r\nWe also have literacy and numeracy tests on the day, as we are responsible for ensuring you have secure skills in these areas by the end of your training. \r\n\r\nIt may sound daunting, but it is extremely supportive and we will make all reasonable adjustments a candidate may need on the day. We are assessing your capacity to train to teach, not yet your capacity to teach.","howSchoolPlacementsWork":"We very carefully select your school placements based on what we learn about you during the assessment day and during the pre-course activities.  If you choose the Fylde Coast then this is a 13 mile square-shaped peninsula so travel times between schools is minimal.  If you choose our Liverpool setting, then you will find 3 very unique partner schools within a short distance from one another.\r\n\r\nOn our secondary programme, we partner with a broad range of settings.  You will teach 11-16 unless you have expressed an interest to teach beyond key stage 4 in which case we will offer you a third placement. We will tailor your programme accordingly. Our mentors are carefully trained and carefully selected to be your champions in school and to ensure absolute synergy between what you learn on Fridays and what you do in school. \r\n\r\nWe also have two enhancement weeks on the calendar where you will have opportunities to visit local primary schools to explore your curriculum at KS2. You will also visit the local Sixth Form College for the KS5 experience, and on the Fylde Coast, our local private school for workshops on teaching children for whom English is an additional language. You could also opt to visit our local pupil referral units and special educational needs settings. This is the beauty of our varied partnership, and a unique aspect of our SCITT provision.","personalQualities":"Successful candidates have strong communication and interpersonal skills. They have clarity in their expression and display a positive energy. \r\nThey often demonstrate a love of learning and this enthuses those around them. \r\nThey have a confident awareness of the role of a teacher and the impact they can have on the life chances of young people.\r\nThey are inclusive.\r\nWe welcome applications from anyone who meets the entry requirements and has a genuine commitment to improving the lives of young people in our region. ","otherRequirements":"You will receive a very detailed set of instructions prior to the assessment day.  However, we would strongly recommend that if you haven't got your original GCSE certificates at the point of application, you should contact the relevant Examination Board(s) to request duplicates.\r\n\r\nWe also highly recommend having access to a car/your own transport.","status":1,"createdAt":"2021-07-06T10:56:49.312Z","updatedAt":"2021-10-04T10:01:02.280Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
