{"id":"ee757de1-dae2-4677-9640-b2f2e76d79a2","name":"Primary","code":"38DZ","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"02db24fe-8d71-4beb-ade4-19ae460099ec","name":"Fylde Coast SCITT - Blackpool","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"12a0360e-341f-4650-a10e-d038387810c1","code":"252","name":"Fylde Coast SCITT"},"degreeGrade":"9","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"The Fylde Coast SCITT offer equivalency tests in English, maths and science at a cost of £50. However, we are unable to offer a revision package.","courseLength":"OneYear","feesUK":7300,"feeDetails":"Online PGCE available alongside the QTS programme with our partner, Leeds Beckett University.  The fees for QTS with PGCE are £9250.","aboutCourse":"As a primary trainee teacher on our SCITT, you will train to teach in key stage one and two (5-11 year olds). You will experience contrasting placements in our partner schools alongside experienced mentors who will focus on your phase-specific knowledge and skills throughout the year.\r\n\r\nYou will spend most of your time in school, learning how to teach from experienced practitioners. Your bespoke, personalised timetable will grow organically as you progress through the SCITT curriculum and ensure absolute synergy between what you learn on professional studies days, and what you then apply in the classroom.\r\n\r\nYour assigned mentor will support you and meet with you on a weekly basis to review and reflect on your training.   You will regularly come together with your fellow trainees to explore the 4 core pillars of our curriculum and everything we learn will be anchored in those. You will receive training sessions from a wider range of experienced practitioners, covering all areas of primary education. You will complete three assignments, one per term, and they focus on: curriculum sequencing and implementation, understanding our local context and meeting the needs of our children, and how you have and will make an impact on the Fylde Coast. There are no lengthy essays but we promote lots of reading and reflection alongside.\r\n\r\nWe have a vastly varied partnership and our schools are based on the Fylde Coast so you will rarely have to travel far. We have our own life coach, and our mission is to train healthy teachers for future generations in our area. ","interviewProcess":"Our assessment days are rigorous, but candidates always report that they are an enjoyable experience and certainly serve to provide further confirmation that this is the right career choice for them. \r\n\r\nWe ask candidates to bring a book of their choice to read to a group of pupils within the primary age range (key stage one or key stage two). On the day you may be asked to read this to a pupil panel or to the interviewers. You will also have literacy and numeracy tests on the day to assess your fundamental skills and to ascertain any areas for development. \r\n\r\nThe discussions will focus on the curriculum and your understanding of how children learn. It may sound daunting, but it is extremely supportive and we will make all reasonable adjustments a candidate may need on the day. We are assessing your capacity to train to teach, not yet your capacity to teach.","howSchoolPlacementsWork":"We very carefully select your school placements based on what we learn about you on the assessment day. The Fylde Coast is a 13 mile square-shaped peninsula so travel times between schools is minimal but access to a car is highly recommended for ease.\r\n\r\nWe partner with over 20 local schools and you will teach in both key stage one and key stage two and in two contrasting schools settings. We have enhancement visits on the calendar where you will have opportunities to enhance your curriculum experience by selecting visits to a wide variety of settings including: nursery schools, secondary schools, sixth forms, special school, schools with a high percentage of English as an Additional Language, church schools, forest schools and beach schools. \r\n\r\nYou could also opt to visit our local pupil referral units. This is the beauty of our varied partnership, and a unique aspect of our SCITT provision.","personalQualities":"Successful candidates have strong communication and interpersonal skills. They have clarity in their expression and display a positive energy. \r\nThey often demonstrate a love of learning and this enthuses those around them. \r\nThey have a confident awareness of the role of a teacher and the impact they can have on the life chances of young people.\r\nThey are inclusive.\r\nWe welcome applications from anyone who meets the entry requirements and has a genuine commitment to improving the lives of young people in our region. ","otherRequirements":"You will receive a very detailed set of instructions prior to the assessment day.  However, we would strongly recommend that if you haven't got your original GCSE certificates at the point of application, you should contact the relevant Examination Board(s) to request duplicates.\r\n\r\nWe also highly recommend having access to a car/your own transport.","status":1,"createdAt":"2021-07-06T10:56:49.359Z","updatedAt":"2021-10-04T10:28:24.902Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
