{"id":"cea905f0-b062-46c1-a784-0f565fe6f0ee","name":"Primary","code":"3957","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"89482b37-09c8-45e1-b83e-46f8d576b721","name":"Simonside Primary","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"802cf355-16a5-49dc-930b-6a18a520e373","code":"14G","name":"Beech HIll"},"accreditedBody":{"id":"b384b008-59e2-461e-a15f-3551d1165c1e","code":"N77","name":"University of Northumbria at Newcastle"},"profPost":"BO","english":"1","maths":"1","science":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":null,"aboutCourse":"\r\nThis is a salaried position at Simonside Primary which is part of the Outer West Learning Trust.\t\r\nDuring the course, students will spend 4 days per week in Simonside Primary and one other school being trained by experienced teachers. Every Friday is spent either at a school within the partnership or at Northumbria University. The Friday training will cover every aspect of teaching, including SENd; planning; working with support staff; grammar knowledge; ICT; forest school along with bespoke training depending on your individual needs. Alongside this training, students have the opportunity to spend time in schools for children with a high proportion of EAL, one for children with behaviour difficulties and a school for children with autism.       \r\n You will spend most of the time in Simonside with one 6 week period in another school in the partnership during an assessed placement. There are two assessed placements one lasting 5 weeks and the other 10 when students are formally observed twice a week in order to improve practice. As well as this, there will be 3 assignments set by the university - these will be set along with taught sessions at the campus and a personal tutor. \r\nSchools within the partnership are listed on the Beech Hill website (http://www.beechhill.newcastle.sch.uk/website/school_direct/126800) and are within the Newcastle area.\r\nSchools Direct at Beech Hill has an extremely high rate of students going straight into teaching jobs following the course, often within the partnership itself. \r\nPastoral care and outstanding mentoring are another feature of the Beech Hill partnership. Students' wellbeing is paramount and our cohorts always work well together due to pre course induction days and the opportunity to observe eachother during the year. \r\nAs part of the assessment, students will present an overview of their learning at the university. We ensure students are well prepared for this during a two day residential at Linden Hall where presentations are completed along with practice interviews and guidance on the application process.\r\n","interviewProcess":" Beech Hill coordinates the recruitment process on behalf of the partnership. \r\nFollowing a short listing process, successful applicants will be invited for interview.\r\nThis will involve an interview at Simonside. There may be a representative from our partner, Northumbria University at  the interview. \r\n\r\n\r\n","howSchoolPlacementsWork":"Our partnership of around 15 schools is led by Beech Hill Primary School; a National Support School with an excellent track record of school improvement. We are fortunate to be able to offer a wide variety of settings which include: small village schools, large two form entry schools and opportunities to have placements in a pupil referral unit and a specialist provision for children with autistic spectrum disorder. You will also spend time in a school with a high proportion of EAL to ensure you have a wide and varied range of experiences during your training. \r\nAll of the schools are conveniently located and geographically close to each other allowing students to visit other settings and easily access CPD within the cluster.\r\nAll schools in the partnership have been judged good or better by OFSTED and include staff with a proven track record in training and professional development. \r\nThe age ranges you will be teaching will range from 3 to 11 with 2 placements in different schools in different key stages. The majority of the time will be spent in your host school with 7 weeks in a second school for an assessed placement in the second half of the autumn term.\r\n","personalQualities":"While we appreciate that applicants will not be the finished article - that is the job of Beech Hill and Simonside  - we expect that prospective students will have a passion for working with children, some experience of working in schools and evidence of having resilience  as the course is fast paced and challenging.","otherRequirements":"Before the start of the course, all students will be subject to a DBS check and will be asked to complete a health questionnaire.\r\nAt least 4 years experience of working in a primary school in a deprived area\r\nTraining in working with children with BESD needs\r\nExperience of working with children with SEND\r\nForest school and outdoor learning training\r\n'First aid at work' training\r\nTeam teach training\r\nRegular safeguarding training\r\nYear 6 Sats support\r\n4 years KS2 experience\r\n\r\n\r\n","status":2,"createdAt":"2021-07-06T10:52:29.948Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"The successful candidate will be paid at point one of the non qualified teacher scale."}
