{"id":"14e8acf6-335e-48eb-8fbc-120bafe67475","name":"Biology","code":"C1X1","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"322cfc19-d51d-45db-91e3-bd7b4738470f","code":"C1","name":"Biology"}],"locations":[{"id":"b84b0abe-d54f-45a3-a82e-1b28f02e869d","name":"Faculty of Health and Education (Manchester)","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"812b70c4-7fc4-46fc-975b-3e4d00f77dc4","code":"M40","name":"The Manchester Metropolitan University"},"profPost":"PG","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"You might be eligible for Subject Knowledge Enhancement (SKE) course. Please check the criteria here: https://getintoteaching.education.gov.uk/improve-your-subject-knowledge. \n\nFor SKE subjects offered by Manchester Met please check our website: https://www.mmu.ac.uk/stepd/secondary/train-to-teach/.","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Manchester Met offers equivalency tests in English and maths - https://www.mmu.ac.uk/stepd/secondary/train-to-teach/.\n\nPlease note if you have the following qualifications instead of GCSE English and/or maths, you will be required to pass equivalency test instead: Functional Skills in English or Mathematics, Key Skills in English or Mathematics, Adult Numeracy or Adult Literacy","courseLength":"OneYear","feesUK":9250,"feesInternational":15550,"feeDetails":"These are the fees for 2021/22 academic year and may be subject to change for 2022/23 academic year.\r\n","financialSupport":"Please see (https://www2.mmu.ac.uk/study/postgraduate/fees/pgce-funding/) for information on financial support available.","aboutCourse":"Our one-year Postgraduate Certificate in Education (PGCE) prepares you to teach the secondary school science curriculum for the 11-16 age range (all three sciences) and biology to AS/A-level.\r\n\r\nScience is crucial to the development and future prospects of children. You can inspire the next generation of scientists and ensure all children value their science education. Developing scientific skills, curiosity and literacy enables children to understand the world around them so they can make informed decisions about their lives and have a say in society.  \r\n\r\nYou will explore theory informed, up-to-date and practical teaching practices in our school-styled laboratories.  You’ll learn how to plan, assess, reflect on and use research to continually improve your practice in a supportive environment. You will also develop your teacher persona, ability to manage behaviour for learning and support children’s wellbeing.   \r\n\r\nSome sessions are specific to biology but the majority occur in mixed specialism groups. Just like science departments in schools, we explore the connections across the sciences and share expertise.\r\n\r\nThere will also be guest sessions with alumni and experts from a variety of organisations. Past sessions include speakers from the National Space Centre, Royal Society of Chemistry, and Science and Plants for Schools (SAPS). The course is taught by highly experienced, research active, subject experts who have all been practising teachers. The team and students are supported by an excellent team of science technicians.\r\n\r\nFEATURES AND BENEFITS\r\n\r\nEmployability - You will have the knowledge, skills and experience to teach all three sciences to GCSE and your specialism, biology, chemistry or physics, potentially up to A-level.\r\n\r\nSchools experience - You will spend at least the minimum DfE required time in schools (approximately 120 days) on placements in schools, gaining experience in mainstream secondary schools. \r\n\r\nPostgraduate credits - When you graduate, you’ll achieve 60 masters’ level credits (this is one-third of a masters degree). You can put these towards a masters degree to help you develop your new career, such as our new MTeach course.\r\n\r\nPartnerships - We have partnerships with over 1,500 schools, colleges and educational organisations, meaning we are able to provide students with a range of school experiences.\r\n\r\nResearch-led teaching - Our research centre, ESRI ranks in the UK’s top 20 for research power in Education (Research Excellence Framework, 2014) and recent research sponsors include the Department of Education; Wellcome Trust; European Union; Esmée Fairbairn Foundation; Barclays; Microsoft; Siemens and LEGO.","interviewProcess":"You will be expected to attend an online interview as part of the application process. Full details of your interview will be provided by email once your initial application has been approved.\r\n\r\nYour interview will last approximately 30 minutes focusing on your awareness of current secondary art education and your school based experience, and you will have the opportunity to:\r\n\r\n•\tRelate subject content of your education to the role of a secondary school teacher\r\n•\tDiscuss your relevant experience\r\n•\tGive an account of your knowledge of the National Curriculum and what your chosen subject has to offer learners\r\n•\tCommunicate effectively your insights into teaching and learning\r\n•\tShare views about the qualities of a good teacher\r\n•\tDiscuss how you might teach a topic from your chosen subject area\r\n•\tDiscuss principles of inclusion in education\r\n\r\n","howSchoolPlacementsWork":"\r\nOn this one-year course, you’ll spend a minimum of 120 days on placements in schools.\r\n\r\nWe know that teaching a class can be daunting, so we’ll help to prepare you before you start your placements. You’ll have a gradual introduction to teaching, observing, getting to know your pupils, classes and teachers, before teaching the classes on your own.\r\n\r\nThe Science activities you teach will depend on the facilities at the school but you might teach GCSE level science and your subject specialism to A-Level.\r\n\r\nYou’ll go to at least two contrasting mainstream secondary schools (such as a school in a rural setting or an inner-city comprehensive) or a college along with some primary school experience.\r\n\r\nOn your placements, you might experience mixed and single-gender schools, City Academies, Comprehensive and Selective Schools, 11-16, 11-18, sixth form, and further education colleges.\r\n\r\nThis variety helps you to experience different situations and further develop your practical skills as a teacher.\r\n","personalQualities":"Personal Statement plays important role in admissions process - successful candidates will demonstrate a good understanding of teaching and learning within a secondary school setting. \r\n\r\nYou may wish to evidence your understanding by drawing on related examples or experiences, such as time spent in schools or other learning settings.\r\n\r\nCandidates will demonstrate knowledge of Biology in the science curriculum. As a science teacher, you will also have some capability in chemistry and physics.\r\n","otherRequirements":"A Disclosure and Barring Service Check (DBS) and health checks are required. Instructions on how to complete these checks will be provided once you hold a firm offer for this course. General information can be found here: https://www.mmu.ac.uk/disclosure/","status":1,"createdAt":"2021-07-06T10:54:42.099Z","updatedAt":"2021-10-05T10:55:03.147Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
