{"id":"1adcf2f3-11f8-4036-ae56-5c1d5378797d","name":"Drama","code":"W4X1","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"69052223-ca45-4781-a8d3-cb92447a6d78","code":"13","name":"Drama"}],"locations":[{"id":"b84b0abe-d54f-45a3-a82e-1b28f02e869d","name":"Faculty of Health and Education (Manchester)","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"812b70c4-7fc4-46fc-975b-3e4d00f77dc4","code":"M40","name":"The Manchester Metropolitan University"},"profPost":"PG","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"You might be eligible for Subject Knowledge Enhancement (SKE) course. Please check the criteria here: https://getintoteaching.education.gov.uk/improve-your-subject-knowledge. \n\nFor SKE subjects offered by Manchester Met please check our website: https://www.mmu.ac.uk/stepd/secondary/train-to-teach/.","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Manchester Met offers equivalency tests in English and maths - https://www.mmu.ac.uk/stepd/secondary/train-to-teach/.\n\nPlease note if you have the following qualifications instead of GCSE English and/or maths, you will be required to pass equivalency test instead: Functional Skills in English or Mathematics, Key Skills in English or Mathematics, Adult Numeracy or Adult Literacy","courseLength":"OneYear","feesUK":9250,"feesInternational":15550,"feeDetails":"These are the fees for 2021/22 academic year and may be subject to change for 2022/23 academic year.\r\n","financialSupport":"Please see (https://www2.mmu.ac.uk/study/postgraduate/fees/pgce-funding/) for information on financial support available.","aboutCourse":"Why might it be important for all pupils to experience a broad and diverse curriculum which includes drama? Is there a relationship between drama and the development of emotional intelligence?\r\n\r\nIf the questions above fill you with curiosity this is the course for you!\r\n\r\nOur one-year Postgraduate Certificate in Education (PGCE) prepares you to teach the secondary school drama curriculum for the 11-16 age range.\r\n\r\nYou’ll learn about the theories and practical methods that form the basis of drama education. You’ll look at developments in drama education over the past hundred years. You’ll research the work of key practitioners and explore key issues such as the role of drama in school, drama and culture, drama and democracy the making of theatre through devising and script work.  \r\n\r\nYou’ll visit a number of secondary schools in order to observe a variety of drama lessons. This will provide you with an opportunity to reflect upon the different approaches to teaching and learning in drama.\r\n\r\nWe teach most of our sessions through practical demonstration and you’ll study mainly with your PGCE Drama group, however, because drama relies on collaboration there will be opportunities to work with colleagues in other subject areas such as English, history, maths and science.\r\n\r\nYou’ll experiment with ways in which drama is used as a teaching tool across the whole school curriculum to support literacy and numeracy or to bring history to life. \r\n\r\nYou’ll also consider how to plan lessons, reflect on your planning, learn how research can develop your teaching practice, and look at ways to develop your teacher persona. \r\n\r\nFor more information please visit our website https://www.mmu.ac.uk/study/postgraduate/course/pgce-secondary-drama-with-qts/september-2022. ","interviewProcess":"You will be expected to attend an online interview as part of the application process. Full details of your interview will be provided by email once your initial application has been approved.\r\n\r\nYour interview will last approximately 30 minutes focusing on your awareness of current secondary education and your school based experience, and you will have the opportunity to:\r\n\r\n•\tRelate subject content of your education to the role of a secondary school teacher\r\n•\tDiscuss your relevant experience\r\n•\tGive an account of your knowledge of the National Curriculum and what your chosen subject has to offer learners\r\n•\tCommunicate effectively your insights into teaching and learning\r\n•\tShare views about the qualities of a good teacher\r\n•\tDiscuss how you might teach a topic from your chosen subject area\r\n•\tDiscuss principles of inclusion in education\r\n\r\n","howSchoolPlacementsWork":"\r\nOn this one-year course, you’ll spend a minimum of 120 days on placements in schools.\r\n\r\nWe know that teaching a class can be daunting, so we’ll help to prepare you before you start your placements. You’ll have a gradual introduction to teaching, observing, getting to know your pupils, classes and the teachers, before having the opportunity to teach classes on your own.\r\n\r\nYou’ll go to at least two contrasting mainstream secondary schools (such as a school in a rural setting or an inner-city comprehensive) or a college along with some primary school experience.\r\n\r\nOn your placements, you might experience mixed and single-gender schools, City Academies, Comprehensive and Selective Schools, 11-16, 11-18, sixth form, and further education colleges. This variety helps you to experience different situations and further develop your practical skills as a teacher.\r\n","personalQualities":"Personal Statement plays important role in admissions process - successful candidates will demonstrate a good understanding of teaching and learning within a secondary school setting. \r\n\r\nYou may wish to evidence your understanding by drawing on related examples or experiences, such as time spent in schools or other learning settings.\r\n\r\n","otherRequirements":"A Disclosure and Barring Service Check (DBS) and health checks are required. Instructions on how to complete these checks will be provided once you hold a firm offer for this course. General information can be found here: https://www.mmu.ac.uk/disclosure/","status":1,"createdAt":"2021-07-06T10:54:42.753Z","updatedAt":"2021-10-05T11:20:21.417Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
