{"id":"3c7b49d9-fb4c-4b6a-8f10-2824b40914e5","name":"Design and Technology","code":"38NK","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"118fabd7-86d0-4a40-9e9a-e5c302abe59b","code":"DT","name":"Design and technology"}],"locations":[{"id":"df605805-2581-4790-8799-8f68ae708aae","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"812b70c4-7fc4-46fc-975b-3e4d00f77dc4","code":"M40","name":"The Manchester Metropolitan University"},"profPost":"PG","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"You might be eligible for Subject Knowledge Enhancement (SKE) course. Please check the criteria here: https://getintoteaching.education.gov.uk/improve-your-subject-knowledge. \n\nFor SKE subjects offered by Manchester Met please check our website: https://www.mmu.ac.uk/stepd/secondary/train-to-teach/.","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Manchester Met offers equivalency tests in English and maths - https://www.mmu.ac.uk/stepd/secondary/train-to-teach/.\n\nPlease note if you have the following qualifications instead of GCSE English and/or maths, you will be required to pass equivalency test instead: Functional Skills in English or Mathematics, Key Skills in English or Mathematics, Adult Numeracy or Adult Literacy.","courseLength":"OneYear","feesUK":9250,"feesInternational":15550,"feeDetails":"These are the fees for 2021/22 academic year and may be subject to change for 2022/23 academic year.\r\n","financialSupport":"Please see (https://www2.mmu.ac.uk/study/postgraduate/fees/pgce-funding/) for information on financial support available.","aboutCourse":"How do students learn and develop their understanding of food science through practical work? Can electronics workshops improve maths and science skills? Why are 'hands on' design skills important?\r\n\r\nIf the questions above fill you with curiosity this is the course for you!\r\n\r\nOur one-year Postgraduate Certificate in Education (PGCE) prepares you to teach across the design and technology secondary school curriculum for the 11-16 age range.  \r\n\r\nThis includes food, textiles, electronics, and product design at Key Stage 3 and the GCSEs in 'Food Preparation and Nutrition’ and 'Design & Technology’, as well as associated GCSE vocational courses. \r\n\r\nDuring the course you will explore the range of materials used with design and technology. Much of the University-based work takes a practical hands-on approach that includes Health and Safety and how to manage practical lessons. These take place in our modern and well-equipped multi-materials workshop, a food preparation kitchen, and a textiles room. \r\n\r\nThe course includes recent developments in pedagogy and the learning sciences and to help you teach the theoretical aspects of the subject including food safety and hygiene, aspects of nutrition and food science, food commodities, processes and techniques for textiles, woods, plastics, card, electronics and physical computing, including the use of CAD/CAM to support designing and making. \r\n\r\nFEATURES AND BENEFITS\r\n\r\nEmployability - You’ll have the skills and experience to teach your design and technology specialism at GCSE and A-levels/level 3 diploma in food science and nutrition plus other materials to Key Stage 3.\r\n\r\nSchools experience - You should spend at least 120 days on placements in schools, gaining experience in mainstream secondary schools. \r\n\r\nPostgraduate credits - You’ll achieve 60 masters’ level credits (this is one-third of a masters degree). You can put these towards a masters degree to help you develop your new career, such as our new MTeach course.\r\n\r\nPartnerships - We have partnerships with over 1,500 schools, colleges and educational organisations, meaning we are able to provide students with a range of school experiences.\r\n\r\nResearch-led teaching - Our research centre, ESRI ranks in the UK’s top 20 for research power in Education (Research Excellence Framework, 2014) and recent research sponsors include the Department of Education; Wellcome Trust; European Union; Esmée Fairbairn Foundation; Barclays; Microsoft; Siemens and LEGO.","interviewProcess":"You will be expected to attend an online interview as part of the application process. Full details of your interview will be provided by email once your initial application has been approved.\r\n\r\nYour interview will last approximately 30 minutes focusing on your awareness of current secondary education and your school based experience, and you will have the opportunity to:\r\n\r\n•\tRelate subject content of your education to the role of a secondary school teacher\r\n•\tDiscuss your relevant experience\r\n•\tGive an account of your knowledge of the National Curriculum and what your chosen subject has to offer learners\r\n•\tCommunicate effectively your insights into teaching and learning\r\n•\tShare views about the qualities of a good teacher\r\n•\tDiscuss how you might teach a topic from your chosen subject area\r\n•\tDiscuss principles of inclusion in education\r\n","howSchoolPlacementsWork":"\r\nOn this one-year course, you’ll spend a minimum of 120 days on placements in schools.\r\n\r\nWe know that teaching a class can be daunting, so we’ll help to prepare you before you start your placements. You’ll have a gradual introduction to teaching, observing, getting to know your pupils, classes and the teachers, before having the opportunity to teach classes on your own.\r\n\r\nYou’ll go to at least two contrasting mainstream secondary schools (such as a school in a rural setting or an inner-city comprehensive) or a college along with some primary school experience.\r\n\r\nOn your placements, you might mixed and single-gender schools, City Academies, Comprehensive and Selective Schools, 11-16, 11-18, sixth form, and further education colleges.\r\n\r\nThis variety helps you to experience different situations and further develop your practical skills as a teacher.","personalQualities":"Personal Statement plays important role in admissions process - successful candidates will demonstrate a good understanding of teaching and learning within a secondary school setting. \r\n\r\nYou may wish to evidence your understanding by drawing on related examples or experiences, such as time spent in schools or other learning settings.\r\n\r\n","otherRequirements":"A Disclosure and Barring Service Check (DBS) and health checks are required. Instructions on how to complete these checks will be provided once you hold a firm offer for this course. General information can be found here: https://www.mmu.ac.uk/disclosure/","status":1,"createdAt":"2021-07-06T10:54:42.029Z","updatedAt":"2021-10-05T10:55:44.481Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
