{"id":"4e3c4c91-c81c-4824-900a-9d9d52fa9dc9","name":"Geography","code":"F8X1","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3f47e67b-7fa5-4947-a5a0-74d528cd2a87","code":"F8","name":"Geography"}],"locations":[{"id":"b84b0abe-d54f-45a3-a82e-1b28f02e869d","name":"Faculty of Health and Education (Manchester)","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"812b70c4-7fc4-46fc-975b-3e4d00f77dc4","code":"M40","name":"The Manchester Metropolitan University"},"profPost":"PG","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"You might be eligible for Subject Knowledge Enhancement (SKE) course. Please check the criteria here: https://getintoteaching.education.gov.uk/improve-your-subject-knowledge. \n\nFor SKE subjects offered by Manchester Met please check our website: https://www.mmu.ac.uk/stepd/secondary/train-to-teach/.","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Manchester Met offers equivalency tests in English and maths - https://www.mmu.ac.uk/stepd/secondary/train-to-teach/.\n\nPlease note if you have the following qualifications instead of GCSE English and/or maths, you will be required to pass equivalency test instead: Functional Skills in English or Mathematics, Key Skills in English or Mathematics, Adult Numeracy or Adult Literacy.","courseLength":"OneYear","feesUK":9250,"feesInternational":15550,"feeDetails":"These are the fees for 2021/22 academic year and may be subject to change for 2022/23 academic year.\r\n","financialSupport":"Please see (https://www2.mmu.ac.uk/study/postgraduate/fees/pgce-funding/) for information on financial support available","aboutCourse":"Does living by the sea affect the way pupils learn about coastal erosion? Will geographical knowledge help students to understand different cultures? Can physical geography encourage environmental responsibility?\r\n\r\nIf the questions above fill you with curiosity this is the course for you!\r\n\r\nOur one-year Postgraduate Certificate in Education (PGCE) prepares you to teach the secondary school geography curriculum for the 11-16 age range.\r\n\r\nThroughout the course you’ll explore different ways to teach geography, including enquiry learning, fieldwork, and using geographical information systems (GIS). You will question issues from how the school environment affects a student’s understanding of geography to who decides the geographical knowledge students learn.\r\n\r\nAt the start of your course, you’ll usually go on an overnight field trip to help you learn how to plan a trip. This opportunity will allow you to consider logistics, risk assessments, daytime and evening activities, and geographical skills.\r\n\r\nOn the course, you’ll experience a variety of sessions to help you learn how to teach geography and develop your subject knowledge. Past speakers include people from exam boards, the Royal Meteorological Society, a local branch of the Geographical Association and Ordnance Survey (speaking on Geographical Information Systems). \r\n\r\nFEATURES AND BENEFITS:\r\n\r\nEmployability - You will have the knowledge, skills and experience to teach geography at Key Stage 3, GCSE and potentially A/AS-level.\r\n\r\nGeography residential - You’ll usually go on a residential experience to consider the management of safe fieldwork (this is at the start of your course, to Castleton, Derbyshire).\r\n\r\nSchools experience - You will spend at least the minimum DfE required time in schools (approximately 120 days) on placements in schools, gaining experience in mainstream secondary schools. \r\n\r\nPostgraduate credits - When you graduate, you’ll achieve 60 masters’ level credits (this is one-third of a masters degree). You can put these towards a masters degree such as our new MTeach course.\r\n\r\nPartnerships - We have partnerships with over 1,500 schools, colleges and educational organisations, meaning we are able to provide students with a range of school experiences.\r\n\r\nResearch-led teaching - Our research centre, ESRI ranks in the UK’s top 20 for research power in Education (Research Excellence Framework 2014) and recent research sponsors include the Department of Education; Wellcome Trust; European Union; Esmée Fairbairn Foundation; Barclays; Microsoft; Siemens and LEGO.\r\n\r\nFor more information about this course please visit our website: https://www.mmu.ac.uk/study/postgraduate/course/pgce-secondary-geography-with-qts.\r\n","interviewProcess":"You will be expected to attend an online interview as part of the application process. Full details of your interview will be provided by email once your initial application has been approved.\r\n\r\nYour interview will last approximately 30 minutes focusing on your awareness of current secondary education and your school based experience, and you will have the opportunity to:\r\n\r\n•\tRelate subject content of your education to the role of a secondary school teacher\r\n•\tDiscuss your relevant experience\r\n•\tGive an account of your knowledge of the National Curriculum and what your chosen subject has to offer learners\r\n•\tCommunicate effectively your insights into teaching and learning\r\n•\tShare views about the qualities of a good teacher\r\n•\tDiscuss how you might teach a topic from your chosen subject area\r\n•\tDiscuss principles of inclusion in education\r\n","howSchoolPlacementsWork":"\r\nOn this one-year course, you’ll spend a minimum of 120 days on placements in schools.\r\n\r\nWe know that teaching a class can be daunting, so we’ll help to prepare you before you start your placements. You’ll have a gradual introduction to teaching, observing, getting to know your pupils, classes and the teachers, before having the opportunity to teach classes on your own.\r\n\r\nYou’ll go to at least two contrasting mainstream secondary schools (such as a school in a rural setting or an inner-city comprehensive) or a college along with some primary school experience.\r\n\r\nOn your placements, you might experience mixed and single-gender schools, City Academies, Comprehensive and Selective Schools, 11-16, 11-18, sixth form, and further education colleges.\r\n\r\nThis variety helps you to experience different situations and further develop your practical skills as a teacher.\r\n","personalQualities":"Personal Statement plays an important role in admissions process - successful candidates will demonstrate a good understanding of teaching and learning within a secondary school setting. \r\n\r\nYou may wish to evidence your understanding by drawing on related examples or experiences, such as time spent in schools or other learning settings.\r\n","otherRequirements":"A Disclosure and Barring Service Check (DBS) and health checks are required. Instructions on how to complete these checks will be provided once you hold a firm offer for this course. General information can be found here: https://www.mmu.ac.uk/disclosure/","status":1,"createdAt":"2021-07-06T10:54:42.312Z","updatedAt":"2021-10-05T12:09:48.635Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
