{"id":"cb9d6b99-6c59-42eb-ba33-7eecc2f8a940","name":"Primary","code":"X100","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"b84b0abe-d54f-45a3-a82e-1b28f02e869d","name":"Faculty of Health and Education (Manchester)","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"812b70c4-7fc4-46fc-975b-3e4d00f77dc4","code":"M40","name":"The Manchester Metropolitan University"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"Manchester Met offers equivalency tests in English, maths and science - https://www.mmu.ac.uk/stepd/secondary/train-to-teach/.\n\nPlease note if you have the following qualifications instead of GCSE English and/or maths, you will be required to pass equivalency test instead: Functional Skills in English or Mathematics, Key Skills in English or Mathematics, Adult Numeracy or Adult Literacy.","courseLength":"OneYear","feesUK":9250,"feesInternational":15550,"feeDetails":"These are the fees for 2021/22 academic year and may be subject to change for 2022/23 academic year.","financialSupport":"Please see (https://www2.mmu.ac.uk/study/postgraduate/fees/pgce-funding/) for information on financial support available.","aboutCourse":"How do children respond to different teaching methods? Does learning outside of the classroom help children to learn? Can educational research influence and inspire the way you teach six-year-olds?\r\n\r\nIf the questions above fill you with curiosity this is the course for you!\r\n\r\nOur one-year Postgraduate Certificate in Education (PGCE) prepares you to teach the primary curriculum.\r\n\r\nYou will gain experience in teaching across the various key stages so that you are confident in teaching any year group. You can choose to focus on the early years and key stage one, or key stage one and key stage two (although you will be qualified to teach all three age phases). \r\n\r\nYou will have taught sessions at University (around 10 weeks over the year) and will normally spend a minimum of 120 days on placements in schools.\r\n\r\nWhen you’re at Manchester Met, you’ll learn teaching methods and organisational skills, and how to apply your knowledge in the classroom. Some of the skills you’ll learn include how to plan lessons and how to manage children’s behaviour.\r\n\r\nYou’ll explore creative ways to teach across the core curriculum, from subjects such as history and science to English and art. You might, for example, explore how to use drama and role-play to bring history to life.\r\n\r\nWe also have science laboratories on campus, where you will have taught sessions with our science tutors so that you can develop the knowledge and confidence you’ll need to teach your class.\r\n\r\nYou will not only learn teaching methods with us on campus though, you’ll spend at least 120 days on placements in a variety of schools, gradually increasing your involvement to become an expert practitioner. You will, with support and mentoring, progress to teaching a 70-80% timetable in your final school experience.\r\n\r\nOn your placements, you will get involved with everything in school, from assemblies to playground duties to speaking with parents.\r\n\r\nFor more information about this course please visit our website: https://www.mmu.ac.uk/study/postgraduate/course/pgce-primary-education-with-qts. ","interviewProcess":"You will be expected to attend an online interview as part of the application process. Full details of your interview will be provided by email once your initial application has been approved.\r\n\r\nThe interview panel will consist of one or two interviewers, usually University Tutors and/or Primary Head Teacher or School Class Mentor. The interview process will resemble closely the way in which the programme is delivered; we give high priority to group work and discussion, to personal points of view, and applicants being able to demonstrate a critical and an analytical approach. Schools also value these skills in teaching staff. \r\n\r\nThe interview is composed of five parts:\r\n\r\n•\tAn informal but critical discussion of a given topic linked to primary teaching with other candidates. \r\n\r\n•\tA brief introduction to yourself.\r\n\r\n•\tIn a group: A 2-minute individual prepared presentation to a small group, followed by a group discussion of all the presentations.\r\n\r\n•\tIndividually: A 3-minute prepared presentation.\r\n \r\n•\tA short individual interview with a MMU Tutor and a Partnership School Head or Mentor. \r\n\r\n","howSchoolPlacementsWork":"\r\nOur partner schools cover a wide geographical area and diversity of social, economic and cultural backgrounds, ranging across inner-city, suburban and rural settings, enabling us to offer you a broad range of placement opportunities.\r\n\r\nWe organise placements starting with your term-time postcode and matching this with placement offers from schools. You should be prepared to travel up to 90 minutes (maximum) each way from where you live and to arrive in school 45 minutes before the school day commences. We take into consideration special circumstances such as disabilities, cultural requirements and medical conditions. In addition, we match carefully to ensure a breadth of experience across different key stages. \r\n\r\nYou’ll normally spend at least 120 days on contrasting placements in two schools related to the two age phases of your particular route through the course, with time spent in each key stage/phase. You will be attached to each school for a substantial period of time and expected to engage in the full life of the school.\r\n\r\nYou’ll be required to pass both teaching experiences.\r\n","personalQualities":"Personal Statement plays an important role in admissions process - successful candidates will demonstrate a good understanding of teaching and learning within the primary school setting. \r\n\r\nYou may wish to evidence your understanding by drawing on related examples or experiences, such as time spent in schools or other learning settings.","otherRequirements":"A Disclosure and Barring Service Check (DBS) and health checks are required. Instructions on how to complete these checks will be provided once you hold a firm offer for this course. General information can be found here: https://www.mmu.ac.uk/disclosure/.","status":1,"createdAt":"2021-07-06T10:54:42.829Z","updatedAt":"2021-10-05T17:33:50.565Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
