{"id":"8ddc9bec-64a7-4b95-a708-6dbe36aa6c44","name":"Physics","code":"AW27","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"bf97cd0a-224c-43d3-a021-84143df13e8d","code":"F3","name":"Physics"}],"locations":[{"id":"6416b731-6232-4261-ba16-6a2a41b2121f","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"e04d6a9e-2e40-4759-a992-d8c84a2e4539","code":"17U","name":"Aston Community Education Trust"},"accreditedBody":{"id":"899178cc-20a7-4df5-951a-ee83c1b3d4d1","code":"S21","name":"Sheffield Hallam University"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"You will spend the majority of your time in your main placement school which, depending on your location, will usually be  Aston Academy. You will be part of a team from day one and will receive high training from experienced teachers on a wide range of topics. One day a week you will be at Sheffield Hallam University giving an excellent blend of practical experience and also chance to reflect and make use of the research expertise of university-based tutors.  Additional training will take place at other academies within Aston Community Education Trust. \r\n\r\nTo complement your development as a teacher you will complete two assignments at Masters level, exploring key issues relating to your subject and your role.\r\n\r\nKey Features of the course\r\n\r\n* A dedicated team of tutors who provide excellent support for all students.   \r\n* A strong subject-specific cohort. You will have chance to develop working relationships with your peers whilst in the university, which provides you with a support network once out on placement.\r\n* The chance to reflect. Teaching is an intensive profession, and at the start of your career it is essential that you have the opportunity to develop skills as a reflective practitioner. During your placements, for example, you will spend every Friday in the University sharing your experiences and considering ways in which you can develop your teaching.\r\n\r\nFor information about the university based elements of the course please click [here](https://www.shu.ac.uk/courses/teaching-and-education/pgce-secondary-science-physics-with-qualified-teacher-status/full-time/2020)\r\n\r\n","interviewProcess":"Once we receive your UCAS application we will consider a number of factors in making our decision about whether to interview you:\r\n\r\n* Do you demonstrate a clear interest in becoming a teacher?\r\n* Do you have strong references that suggest you have the capacity to train to be a teacher?\r\n* Do you have highly developed subject knowledge, or an awareness that you need to develop this?\r\n* Have you written a strong personal statement, demonstrating your commitment to teaching, your passion for your subject and an understanding of the realities of the profession?\r\n\r\nYour selection day will take place either at the Aston Academy or one of our partner schools, and will consist of the following elements:\r\n\r\n* Welcome, a tour of the school and introduction to the course\r\n* A task designed to ensure that your subject knowledge is strong\r\n* An activity with a small group of pupils, and reflection on this experience\r\n* A formal interview, carried out by at least two school representatives\r\n","howSchoolPlacementsWork":"You will undertake three periods of school experience:\r\n\r\n* At least two days in a primary school early in the programme\r\n* Your main placement for the majority of your training \r\n* A 5 week contrasting placement at another school in our partnership \r\n* A post 16 experience\r\n\r\nWe work with [13 schools](http://www.astonacademy.org/index.php/our-partnerships-sheffield-hallam-university) in Sheffield,  Derbyshire, and Rotherham. This range of inner-city, suburban and rural contexts provides rich opportunities for diverse and balanced experiences in schools, and we work hard to secure you two contrasting placements. \r\n\r\nWhen  arranging placements, personal circumstances such as child-care and additional needs are taken into account as much as possible.\r\n\r\n","personalQualities":"We consider six key elements when selecting students for our PGCE programme:\r\n\r\n* Commitment to teaching\r\n* Insight into the realities of teaching\r\n* Resilience\r\n* An analytical approach to problem solving\r\n* Enthusiasm for your subject\r\n* Interpersonal and communication skills\r\n\r\nWe will consider your strengths in each area during the selection process, including when considering your application form.","otherRequirements":"As this course leads to a professional qualification, student teachers will be required to undertake a DBS Enhanced Disclosure and Work Health Assessment. All Student teachers will also be required to complete Safeguarding training.   Full information about how to undergo these checks will be provided once you accept your place on the course.\r\n","status":1,"createdAt":"2021-07-06T10:56:46.590Z","updatedAt":"2021-09-13T14:01:01.275Z","canSponsorStudentVisa":"no","cycle":"2024"}
