{"id":"501bdd82-4936-403f-bab8-867f7c0e1819","name":"Primary","code":"3CT4","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_7","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"8d6c54fb-cef3-4bde-ae64-3f6072c6cb7f","name":"Pen Green Centre for Children and Their Families","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"8083b4a3-293b-4efc-9594-73f347e74fcd","code":"21P","name":"Pen Green Centre for Children and Their Families"},"accreditedBody":{"id":"6e6c8aa3-8d77-4c7d-af3c-4c7912b1cc2a","code":"T89","name":"Two Mile Ash ITT Partnership"},"degreeGrade":"2","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We do not offer equivalency tests ourselves, but do accept from a number of providers. (Please note, if you are applying for an Apprenticeship route, equivalency tests are NOT accepted, you must study for functional skills tests instead. Apprenticeship routes are available through Two Mile Ash ITT Partnership.","courseLength":"OneYear","feesUK":8400,"aboutCourse":"A candidate who is offered a place on our programme will be expected to attend 5 pre-course induction days.\r\n\r\nTrainees are immersed in the school environment right from the outset.  Every trainee is carefully matched to a class in their ‘home school’ for their training year.\r\n\r\nThe core content is taught in five week-long study blocks giving an immersive learning experience.  The study weeks take place at Pen Green Research, Development and Training Base.  Guest speakers from our partner schools facilitate some of the teaching sessions, as well as visits to our partner schools to see practice in action.  \r\n\r\nCore Content:\r\n- Pedagogy & Theory\r\n- Curriculum Overview\r\n- Safeguarding\r\n- Observation and Assessment \r\n- Core & Foundation Subjects\r\n- SEND\r\n- Reflective Teaching Practice and Assessment\r\n- Equality\r\n- Professional Autonomy\r\n- Positive Behaviour Management\r\n\r\nQTS assessment is via course tasks, case study presentations and portfolios of evidence, gathered across the year. \r\n\r\nTrainees working towards the PGCE undertake a series of three  assignments, each worth 20 credits.  The PGCE is accredited by Birmingham City University who provide two days of teaching and a tutorial day for each assignment.","interviewProcess":"The interview process seeks to ascertain the strength of the applicant’s skill set and depth of understanding of the role and responsibilities of a teacher. \r\n\r\nApplicants will be required to: \r\n - Deliver a 2 - 5 minute presentation\r\n - Participate in a discussion on school-based scenarios\r\n - Carry out a teaching and learning activity\r\n - Undertake a short written task reflecting on the teaching activity\r\n - Undertake a Maths Task\r\n - Undertake a Writing Task\r\n - Participate in a formal interview\r\n\r\n\r\n \r\n","howSchoolPlacementsWork":"Trainees are immersed in the school environment right from the outset.  Every trainee is carefully matched to a class in their ‘home school’ for their training year. During the Spring Term, all trainees are to complete a 6-week placement at a different school to experience an alternative key stage either EYFS or Key Stage 1. On completion, the trainees return to their 'home school' for the remainder of the programme. \r\n\r\nThe school placements are arranged by Pen Green tutors and our partner schools across Northamptonshire and neighbouring counties.  The tutors are thoughtful of the travel distance whilst placing a trainee to a 'home school' and will endeavour to arrange placements near a trainee's home town.  However, there will be instances where trainees will have to travel further afield to their school placements.\r\n\r\n","personalQualities":" - A commitment to teaching as a career\r\n - Build relationships with children to promote their learning\r\n - An understanding of early years and primary education\r\n - Understand of the role of the early years and primary teacher\r\n - Work cooperatively and effectively with people from a diverse society\r\n - Work on own initiative and manage workload\r\n - Clear and accurate written and verbal communication\r\n - IT confidence and competency\r\n\r\n\r\n\r\n","otherRequirements":"- A Clear Criminal Record \r\n- An Enhanced DBS Certificate\r\n- The right to train and/or work in the UK\r\n- Good Health\r\n- Satisfactory References\r\n\r\nA full career history accounting for any gaps in employment will be required if you are invited to interview and references will be followed up for safeguarding purposes. ","status":1,"createdAt":"2021-07-06T10:53:24.718Z","updatedAt":"2021-10-01T09:29:10.694Z","canSponsorStudentVisa":"no","cycle":"2024"}
