{"id":"e1ab2b5f-c8ee-4a4f-9f1b-ac6317ec609c","name":"Primary (3-7)","code":"3244","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_7","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"e07fd2f4-1b82-43f0-a4c4-d6ae1d32a615","name":"Parc Eglos School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"dc3c5fb3-8556-4c96-af4e-3fd65056d8ae","name":"The Learning Institute","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"567773d8-3afa-448d-8db5-d3316b0efd18","code":"28N","name":"The Learning Institute South West [School Direct]"},"accreditedBody":{"id":"ef96e044-b65c-4cc8-b2b4-44aca678aeb0","code":"L19","name":"The Learning Institute South West"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Candidates successful at interview and who accept our offer will have access to our equivalency testing service at approximately £45 per test.\nWe also accept tests taken at AStar Equivalency.","courseLength":"OneYear","feesUK":9250,"feeDetails":"For further details please check our website \r\n[Student Loans and Other Finance](http://www.learninginstitute.co.uk/page/?title=Student+Loans+and+other+Finance&pid=12)","aboutCourse":"The course will start on Friday 2nd September 2022. You will spend most of your first 2 weeks of the induction period undertaking central training in our facilities in Roche. On completion the of induction period, all trainees start their first school placement. \r\nMost training weeks you will be in your school placement from Monday to Thursday with Fridays reserved for taught sessions. \r\nIn the Spring Term you will undertake a placement in a second school. After the Easter holidays trainees return to their first placement. \r\nYou will be assigned a School Based Mentor, who will lead your work-based training and oversee your placement experience. You will also work closely with a Visiting Tutor, who will provide additional guidance to both School Based Mentor and trainee.\r\nYour placement will be guided by our purpose-built, week-by-week instructions helping you to master classroom based skills. The Core Knowledge and Skills Programme provides a thoughtfully sequenced schedule of tasks that ensures that you have a secure understanding of effective practice and can apply its principles to your teaching. Successful engagement with our programme will result in recommendation for QTS.\r\nAn optional Post Graduate Certificate of Education (PGCE) academic award requires you to complete a series of complementary tasks. A PGCE is the most widely recognised UK post graduate teaching award and is transferable across international borders. Through the completion of two Level 7 modules you will learn to engage critically with policy, practice, theoretical perspectives and research findings. The PGCE is available to all QTS candidates. It is provided in partnership with Newman University.\r\n\r\n\r\n","interviewProcess":"Following your application shortlisting will take place to invite appropriate candidates to interview. This rigorous process will involve online discussion with an interview panel and subject specific presentation.\r\nDue to the pandemic interviews by TLISW staff will be held online using ZOOM.\r\nPrior to the interview you will be asked to provide a number of original documents, such as examination certificates, evidence of residency and proof of identity.\r\n\r\nThis post is exempt from the Rehabilitation of Offenders Act 1974 (Exceptions) Order 1975 and you are therefore required to disclose all criminal convictions, including any which may be ‘spent’. You should also include details of any cautions, reprimands or final warnings at the time of interview.\r\n\r\n\r\n\r\n","howSchoolPlacementsWork":"In The Learning Institute we believe a friendly and happy school environment constitutes a creative and supportive learning platform for trainees.  We have a wide range of partnership schools and we are always looking to widen our alliance. Our partnership schools range from Land's End into Devon. When choosing the right placement school for your training, TLISW will aim to place you at a school to minimise travel time while ensuring you receive the best quality school experiences.\r\nYou will need to complete at least 2 school placements and train across 2 Key Stages. \r\nFor our up to date list of our Partnership Schools, please check our website. (https://www.learninginstitute.co.uk/ittpartners)\r\n\r\n\r\n\r\n","personalQualities":"We are looking for positive, dynamic applicants who are committed and enthusiastic about working with children and sharing their passion for learning. \r\n\r\nYou should demonstrate:\r\na)\tPotential to become an outstanding, reflective practitioner.\r\nb)\tAbility to communicate clearly and accurately in both written and spoken English.\r\nc)\tResilience to cope with the demands of an exacting profession. \r\nd)\tCommitment and motivation for successful study, including the potential intellectual capacity for academic study at Masters' level.\r\n","otherRequirements":"Desirable:\r\n - Recent experience of working with children in schools or other settings. This may include: nurseries, outdoor education facilities or as a support worker.\r\n\r\n","status":1,"createdAt":"2021-07-06T10:53:01.557Z","updatedAt":"2021-09-23T12:51:16.449Z","canSponsorStudentVisa":"no","cycle":"2024"}
