{"id":"f43e0517-70ae-4cc5-a095-d63325b43766","name":"History","code":"3B6B","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"5a3609a0-5bbb-4377-b919-5d89932ab622","code":"V1","name":"History"}],"locations":[{"id":"aa924b05-555b-44d1-8a8f-f509ac7231a3","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"f7d8c641-454e-431a-ad3c-f1b596f86547","code":"2KG","name":"The Oldham Academy North"},"accreditedBody":{"id":"e328aab3-a535-4921-8ded-5e37133c76dd","code":"L46","name":"Liverpool Hope University"},"profPost":"PF","degreeGrade":"1","additionalDegreeSubjectRequirements":"false","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"The History department at The Oldham Academy North is an excellent base to begin your training and teaching career. There is a mix of recently qualified and extremely experienced staff within the department.  The department is well resourced with excellent facilities. The subject mentors for History are mastery practitioners. The faculty has an effective curriculum plan across Key Stage 3 and 4, with detailed medium plans and resources to guide and support lesson planning.\r\n\r\nThe course is split into 3 key phases. During phase 1 (September - December), you will be based with your host school and for all trainees,  this will be The Oldham Academy North. During the first few weeks, we will familiarise you with the key elements of school life. You will be guided by your English subject mentor, as you begin initial observations of skilled practitioners.  As the  term progresses, you will begin teaching episodes within lessons, which will see you develop  to a teaching timetable by October half term. You will always have a qualified teacher present so that you can benefit from high quality developmental feedback. During this term, you will also begin your subject specific study days at Liverpool Hope and your assignment tutorials with a subject specialist. In school, you will benefit from weekly Professional Studies sessions, delivered by the School Direct Lead.\r\n\r\nDuring phase 2 (January - April), you will move to your contrasting school placement. Again, you will begin with  observations, but this will quickly lead to a teaching timetable by week 3. During your second placement, you will continue to receive all the support and training opportunities that were available from the host school. The School Direct Lead will visit you at least once per week in the placement, to ensure that you continue to make good progress towards qualifying. \r\n\r\nDuring phase 3 (April - July), you will return to the host school, where you will be skilled enough to return to a teaching timetable by the end of the first week. By this point, you will be able to plan, teach, assess and manage behaviour to the standards required for qualifying. You will also complete your second assignment, and  a short primary school placement. \r\n\r\nYou will leave us confident in your skills and abilities, and ready to take up the challenge of your first teaching post and NQT induction year.\r\n","interviewProcess":"The interview will consist of a short presentation by the School Direct lead with  an opportunity for you to ask questions - this is a big decision, and it is important to us that you have all the information you need to make the right choice for you.  You will have a tour of the school and the opportunity to spend some time in a lesson. You will be asked to produce and deliver a short presentation - the topic of which will be given at the time you are invited to interview, so that you have plenty of time to prepare. There will also be interview questions from a panel which will usually be the Head of Subject and the School Direct Lead.\r\n\r\nYou can also access a virtual tour of the school on The Oldham Academy North website where you will also find interviews with senior leaders and staff. Should you wish to ask questions or have an informal discussion prior to application, you should follow the contact details for Liz Miles which can be found in the School Direct area of the school website.\r\n\r\n","howSchoolPlacementsWork":"You will have two school placements. You will be placed with the host school - The Oldham Academy North - during the autumn and summer terms. Your contrasting placement in the spring term will be at a local Oldham school.\r\n\r\n","personalQualities":"A passion for your subject \r\nA moral purpose - a belief in the power of education to transform lives.\r\nApplicants must be reflective, responsible and resilient.\r\n","otherRequirements":"Any offer of a place is made conditional on satisfactory Enhanced Disclosure from the Disclosure and Barring Service and a Fitness to Teach Declaration.","status":1,"createdAt":"2021-07-06T10:47:14.702Z","updatedAt":"2021-10-22T08:54:33.794Z","canSponsorStudentVisa":"no","cycle":"2024"}
