{"id":"0f7c442d-e21a-40db-bdd5-c1f88993327d","name":"Physics","code":"X829","qualification":"qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"bf97cd0a-224c-43d3-a021-84143df13e8d","code":"F3","name":"Physics"}],"locations":[{"id":"1caa83c8-0aed-4602-9c40-ea6640235194","name":"Wednesfield High Academy","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"08ee3cae-c85e-492c-b697-dd5e8ef678f2","code":"1O7","name":"Wood Green ITT Alliance"},"accreditedBody":{"id":"4da5abb2-b287-451e-8d75-c5b79e11c2bb","code":"W75","name":"University of Wolverhampton"},"english":"3","maths":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","aboutCourse":"This is a School Direct Salaried Initial Teacher Training course which is run by the Wood Green ITT Alliance in partnership with  the University of Wolverhampton. Our 2019-20 cohort of School Direct trainees gained QTS with good or outstanding grades and many had already secured employment for September 2020 by the Easter break.\r\nWith this particular course, you will be employed by your training school and paid a salary on the unqualified teacher scale for the duration of your training year. The University fees will be paid by your training school. \r\nThis is a demanding, full-time course aimed at confident and resilient applicants with extensive school experience. However, our Alliance is committed to providing you with all the support you need from both your school-based and university mentors. Your progress and well-being will be closely monitored, with supportive target setting and action planning at regular intervals so that you are kept on track to achieving an outstanding outcome. You will also take part in a whole school CPD programme and be encouraged to reflect upon your own professional learning needs. So, if you are enthusiastic and have a personal commitment to teaching, you will not find a better place to train.","interviewProcess":"Once applications have been received by the Director of the Wood Green ITT Alliance through UCAS, in partnership with the University of Wolverhampton subject tutors, candidates will be shortlisted. Successful candidates will be invited for interview at the University of Wolverhampton and for a School Assessment day at applicants' first choice of training school. Please note that passing professional skills tests are no longer required to get onto the course but an audit of applicants' literacy and numeracy skills will be completed  by the university tutor on the interview day.\r\nAfter the interview and the school assessment have taken place, if both the training school and the university agree that the candidate is suitable for a place on the School Direct Salaried teacher training course, an offer will be made to the candidate on UCAS. Please note that it make take a little time for the offer to come through the electronics systems. The applicant has then the opportunity to accept or decline the offer. ","howSchoolPlacementsWork":"From September, the School Direct Salaried trainee is placed directly in his/her employing school and will be required to have sole responsibility of 50% of a standard teacher's timetable during the autumn term. In the spring and summer terms, the teaching commitment will increase to 75% of a timetable. In addition, the School Direct Salaried trainee will have every Friday off timetable to attend University training or complete academic study.   \r\nYou will be supported and observed at regular intervals by a school-based subject mentor, a professional mentor and university tutor.  All will provide you with the quality feedback you need to achieve the best outcome. \r\nIn addition, the School Direct Salaried trainee will need to complete 30 days of contrasting school experience at another school. This placement can be flexible and completed in chunks or as a full 6 weeks period according to trainee and his/her school needs. ","personalQualities":"Applicants should be passionate about their subject and have a strong desire to share their knowledge with young people of all abilities in the secondary age range. They should be committed, resilient and enthusiastic.\r\nHaving a meaningful experience of working with young people is requirement for this course. \r\nApplicants should be able to demonstrate that they can communicate effectively with both adults and young people.\r\nThe ability to reflect on any recent educational experiences and articulate their own perceived professional learning needs will also be taken into consideration during the selection process.\r\n","otherRequirements":"Applicants must be aware that an enhanced disclosure certificate from the Disclosure and Barring Service will also be required before commencing the programme. The University of Wolverhampton will assist you with regards to applying for your DBS. ","status":2,"createdAt":"2021-07-06T10:48:06.144Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"Unqualified teachers’ pay scale salary \r\nUni fees paid by employing school "}
