{"id":"271749b9-824d-428a-9790-707d43dd0b38","name":"Modern Languages (Spanish)","code":"2GZJ","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"e34fd2a3-a32e-44e9-aea1-666badf3ac03","code":"22","name":"Spanish"},{"id":"ce8523ef-9236-4cd9-b260-d826c7a521b3","code":"ML","name":"Modern Languages"}],"locations":[{"id":"939b7ec3-60b9-41fa-a9fb-f01bfcc5e8dd","name":"Wodensborough Ormiston Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"1ffcd28b-252a-457a-8b4e-1e35a822b69f","name":"St Peter's Collegiate Church of England School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"e64ff5b0-f45f-47c3-bf2e-21730ea35957","name":"Pool Hayes Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"c8996921-0a01-4f40-bc3b-1caf168a75ed","name":"The King's CE School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"4c33e089-6790-4690-8f5b-57642e8a7187","name":"Ormiston South Wolverhampton and Bilston Academy","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"08ee3cae-c85e-492c-b697-dd5e8ef678f2","code":"1O7","name":"Wood Green ITT Alliance"},"accreditedBody":{"id":"4da5abb2-b287-451e-8d75-c5b79e11c2bb","code":"W75","name":"University of Wolverhampton"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":12750,"aboutCourse":"This is a School Direct PGCE Initial Teacher Training course which is run by the Wood Green ITT Alliance in partnership with  the University of Wolverhampton. Our 2020-21 cohort of School Direct trainees all gained QTS as well as completing the PGCE qualification.  Many secured employment for September 2021 by the Easter break.  Wood Green ITT Alliance’s School Direct trainees are tuition fee paying trainees (fees payable to the UoW) who will receive very similar training and the same qualifications as core University of Wolverhampton PGCE trainees. The benefit of our School Direct route is that it allows aspiring trainee teachers to apply directly for their preferred main training school; the schools available for this particular course are listed below. \r\nThis year long, full-time course will train you to teach secondary school pupils. (120 days in school; 50 days approx at university)\r\nThe course is split into three placement phases. In Phases 1 and 3, 18 weeks in total,  you will train at your chosen training school. In Phase 2, you will have the opportunity to train at a different school.  \r\nYou will be trained as a subject specialist in your chosen curriculum area; our programme will focus on the five ITT Core Content Framework competency areas of Behaviour Management, Pedagogy, Curriculum, Assessment and Professional behaviours and will guide you to develop the knowledge and skills needed to achieve the Teachers' professional standards therefore QTS.  This programme has been developed to include a mixture of university and school-based sessions, delivered by both academic tutors and practising teaching staff.\r\nThis is a demanding, full-time course during which you will be required to produced highly academic essays and research projects for the University of Birmingham alongside your teaching practice. However, our Alliance is committed to providing you with all the support you need from both your school-based and university mentors. Your progress and well-being will be at the heart of everything we do. Supportive target setting and action planning at regular intervals will keep you on track to achieving QTS and the PGCE with great success. You will also take part in an extensive whole school CPD programme and be encouraged to reflect upon your own professional learning needs. So, if you are enthusiastic and have a personal commitment to teaching, you will not find a better place to begin your career.","interviewProcess":"Once applications have been received by the Director of the Wood Green ITT Alliance and the University of Wolverhampton  through the DfE Apply platform, candidates will be shortlisted. Successful candidates will be invited for interview at the University of Wolverhampton and for a School Assessment day at applicants' first choice of training school. Please note that passing professional skills tests are no longer required to get onto the course but an audit of applicants' literacy and numeracy skills will be completed  by the university tutor on the interview day.\r\nAfter the interview and the school assessment have taken place, if both the training school and the university agree that the candidate is suitable for a place on the School Direct PGCE teacher training course, an official offer will be made to the candidate. Please note that it may take a little time for the offer to come through the electronics systems. The applicant has then the opportunity to accept or decline the offer. ","howSchoolPlacementsWork":"After three September weeks of university-based initial training, you will start your school-based training at your chosen main training school at the start of October.  \r\nTraining programme breakdown:\r\n- Phase 1: 10 weeks - chosen main training school (Oct-Dec)\r\n- Phase 2: 6 weeks - second school (Jan-March)\r\n- Phase 3: 8 weeks - chosen main training school (March- May/June)\r\n+ 1 week's placement in a Primary school (Jan) \r\nThroughout the three phases of your school-based training, you will have the opportunity to observe many lessons and many teachers, not just in your subject area. Your co-teaching or lead teaching timetable will increase from 30% to 60% of a qualified teacher's timetable in at least two range ages throughout the year according to your strengths. You will be supported and observed all year long by a school-based subject mentor, a professional mentor and university tutor.  All will provide you with the quality feedback you need to achieve the best outcome. \r\nWe will seek to allocate Phase 2 placements within our Alliance but a degree of flexibility is possible in this regard. Our aim is to give you experience in contrasting secondary schools in order to equip you to teach in any context in your future career. ","personalQualities":"Applicants should be passionate about their subject and have a strong desire to share their knowledge with young people of all abilities in the secondary age range. They should be committed, resilient and enthusiastic.\r\nHaving a meaningful experience of working with young people will favour an applicant but such experience is not a compulsory requirement. \r\nApplicants should be able to demonstrate that they can communicate effectively with both adults and young people.\r\nThe ability to reflect on any recent educational experiences and articulate their own perceived professional learning needs will also be taken into consideration during the selection process.\r\n","otherRequirements":"Applicants must be aware that an enhanced disclosure certificate from the Disclosure and Barring Service will also be required before commencing the programme. The University of Wolverhampton will assist you with regards to applying for your DBS. ","status":1,"createdAt":"2021-07-06T10:48:05.324Z","updatedAt":"2021-10-04T15:54:39.506Z","canSponsorStudentVisa":"yes","cycle":"2024"}
