{"id":"20b55bb0-b52d-4088-aed9-59b178a3e702","name":"Primary","code":"X3X1","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"94916765-f8bf-49a1-b54e-e9ea98518501","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"5abccd25-3cfa-47a4-9f66-d30a662ae5d1","code":"P80","name":"University of Portsmouth"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":16200,"feeDetails":"For further fee information please see [https://www.port.ac.uk/study/postgraduate/teacher-training/fees-and-funding]\r\n(https://www.port.ac.uk/study/postgraduate/teacher-training/fees-and-funding)\r\n\r\n*Fees are accurate at the time of publishing and are subject to change at any time without notice.*","aboutCourse":"This is a one year, full time programme for graduates who wish to train as primary school teachers. The programme is taught at master’s level and allows students to gain up to 60 credits towards a master’s qualification. As well as the Postgraduate Certificate in Education you will also be able to be recommended for Qualified Teacher Status (QTS). \r\n\r\nWorking with expert practitioners both at the University and in your placements, you will develop your teaching skills through practical activity and study of theories and contemporary issues in education underpinned by current research. You will develop your understanding of the wider role a teacher plays and the knowledge and ability to effectively teach primary aged children.\r\n\r\nYour training at the university is integrated with the training you will receive in your placements, allowing you to continually apply and develop your knowledge and skills over the whole programme.\r\n","interviewProcess":"All shortlisted applicants will be invited to attend an interview. This will be either in person or online as circumstances dictate.  Applicants will be given a selection of dates and times to choose from. \r\n\r\nFull details of the interview will be sent to you in advance. There will be a number of activities on the day that will give you the chance to show us the potential you have to become an amazing teacher. It is also a chance for us to answer any questions you may have about studying here, and confirm that the University of Portsmouth is the right choice for you. \r\n","howSchoolPlacementsWork":"You’ll be placed in schools for most of your course. This university is based in Portsmouth, and your school placements will be within commuting distance. \r\n\r\nYou can’t pick which schools you want to be in, but your university will try to take your journey time into consideration. \r\nUniversities can work with over 100 potential placement schools. Most will be within 10 miles of the university, but sometimes they can cover a wider area, especially outside of cities. \r\n\r\nSchool-based work is an important part of our PGCE programme and all our partner schools have specially trained mentors who assist students in learning to teach.  This mentoring programme is essential in the development of new teachers and will be a valuable asset in your training as you gain hands-on experience of practicing your new skills and knowledge in real classroom environments. You will spend a placement in both key stage 1 and key stage 2, and we will place you in schools which will best meet your needs to become a confident and capable teacher. \r\n\r\nAs well as two substantial placements in a mainstream primary school setting totalling at least 120 days, there is also the chance to spend some time on a placement that allows you to work with learners in an alternative setting. Once you start the course, we will work with you to identify a placement that matches your needs and interests, this could be anything from a special school or early years setting to with an educational team in a zoo or museum to further develop your talents as a teacher.\r\n","personalQualities":"We recognise that those wanting to teach will have a wide variety of reasons for wanting to teach primary children, and bring with them a range of experiences from different backgrounds. We look forward to hearing about your own story about why you want to teach and to see how we can help you on your journey to becoming an amazing teacher.","otherRequirements":"All shortlisted applicants are subject to interview. All offers are subject to Enhanced Disclosure and Barring Service (DBS) clearance and Occupational Health clearance. \r\n","status":1,"createdAt":"2021-07-06T10:56:50.070Z","updatedAt":"2021-09-29T13:11:32.411Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
