{"id":"2ae76ee5-b7cb-4b25-a273-e1a360e49e56","name":"Geography","code":"F8X1","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"B","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3f47e67b-7fa5-4947-a5a0-74d528cd2a87","code":"F8","name":"Geography"}],"locations":[{"id":"94916765-f8bf-49a1-b54e-e9ea98518501","name":"Main Site","isPublished":"Y","status":"R","vacancies":"B"}],"trainingProvider":{"id":"5abccd25-3cfa-47a4-9f66-d30a662ae5d1","code":"P80","name":"University of Portsmouth"},"profPost":"BO","degreeGrade":"9","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"A good honours degree or equivalent in a relevant subject, with approximately 50% geographical content. A minimum of 2:1 is desirable although applicants with other qualifications or valuable experience will also be considered.","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"1 year full-time, 2 years part-time","feesUK":9250,"feesInternational":16200,"feeDetails":"For further fee information please see [https://www.port.ac.uk/study/postgraduate/teacher-training/fees-and-funding](https://www.port.ac.uk/study/postgraduate/teacher-training/fees-and-funding)\r\n\r\n*Fees are accurate at the time of publishing and are subject to change at any time without notice.*","aboutCourse":"The University of Portsmouth’s PGCE Initial Teacher Training course in Secondary in Geography is a one-year, full-time course for graduates who wish to train as secondary school Geography teachers. It is run by the University’s School of Education and Sociology and offers the choice of following either the Professional Graduate Certificate in Education route (taking all modules at higher education level 6) or the Postgraduate Certificate in Education (with 60 credits towards a Master’s degree). The most appropriate route for you can be discussed with the course leader.\r\n\r\nGeography is a foundation subject of the secondary curriculum at Key Stage 3 and an entitlement at Key Stage 4. Geography is an engaging and constantly evolving subject in the school curriculum with opportunities for some exciting fieldwork. On the PGCE course you will learn not only about issues related to Geography teaching, but also about developing an understanding of educational issues pertaining to teaching and learning, classroom interaction, the school curriculum and the school and society. \r\n\r\nCourse aims: The course is designed to enable you to become a capable and confident teacher at secondary level. Abilities to teach the National Curriculum and encourage learning will be developed alongside the skills and understanding required of effective teachers through the Teachers’ Standards.\r\n\r\nMode of study This is a one-year full-time course (36 weeks) or 2 years part-time.\r\n\r\nCourse outline: Throughout the year you will be engaged in considering a range of subjects including:\r\nsubject knowledge enhancement for teaching \r\nlesson planning and classroom management\r\nresearch into the pedagogy and psychology of learning Geography \r\nspecial needs and inclusion\r\nassessment\r\n\r\nSchool partnerships: The University works closely in partnership with a large number of schools. Two thirds of your time is spent in schools, where you will receive the support of a trained school-based mentor who will work with you day to day.\r\n\r\nYou will spend an increasing amount of time in school as the course progresses, beginning in Term One with three days per week. In Term Two, four days a week will be spent in school and in Term Three, five days a week. The emphasis throughout will be on helping you to become progressively more confident and competent in order to attain an increasing level of responsibility in the classroom.","interviewProcess":"We hold our interviews in Portsmouth and during yours, you'll need to demonstrate your knowledge and experience of your subject and the school system. We’ll send you an audit form to help you think about how your subject knowledge fits with the syllabus you want to teach, and how you might fill any gaps.\r\n \r\nYou’ll also be tested on reading and writing, take part in a group discussion, and will be asked to prepare a ‘microteaching’ lesson: ten minutes of teaching on a subject, skill or interest of your choice that you’ll deliver to your fellow applicants on the day.\r\nWe’ll be looking at all aspects of the application process – application form, academic reference, and the elements of the interview day – in order to get the fullest picture of you. We’re hoping to see that you’ve got the personal and intellectual qualities to be a teacher, and that you can meet the Teachers’ Standards by the end of your training.","howSchoolPlacementsWork":"School-based work is an important part of our PGCE Programme and all of our partner schools have specially trained mentors who assist students in learning to teach. This mentoring programme is essential in the development of new teachers and will be a valuable asset in your training as you gain hands on experience of practising your new skill in actual classroom environments. ","personalQualities":"","otherRequirements":"All shortlisted applicants are subject to interview. All offers are subject to Enhanced Disclosure and Barring Service (DBS) clearance and Occupational Health clearance. ","status":1,"createdAt":"2021-07-06T10:56:49.697Z","updatedAt":"2021-09-29T13:09:34.247Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
