{"id":"5875f39e-9e7d-4fd6-86c4-75d2dbee1b0f","name":"Modern Languages (French and Italian)","code":"RX31","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"B","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"9727f674-61ba-4efa-b1f2-21ec7e354442","code":"15","name":"French"},{"id":"ce8523ef-9236-4cd9-b260-d826c7a521b3","code":"ML","name":"Modern Languages"},{"id":"5e94c647-7b7e-4d02-a3b4-7667296fbf0a","code":"18","name":"Italian"}],"locations":[{"id":"94916765-f8bf-49a1-b54e-e9ea98518501","name":"Main Site","isPublished":"Y","status":"R","vacancies":"B"}],"trainingProvider":{"id":"5abccd25-3cfa-47a4-9f66-d30a662ae5d1","code":"P80","name":"University of Portsmouth"},"profPost":"BO","degreeGrade":"9","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"A good honours degree or equivalent in a relevant subject, with a minimum of 50% content in an appropriate modern foreign language. Alternatively, native speakers require excellent communication skills in English. A second language to A level (or equivalent standard) in French, German or Spanish is recommended. Applicants offering only one foreign language are able to complete a short intensive Enhancement Course in French in order to achieve sufficient competence to teach a second language accurately and confidently at secondary level to at least Key Stage 3.","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"1 year full-time, 2 years part-time","feesUK":9250,"feesInternational":16200,"feeDetails":"For further fee information please see [https://www.port.ac.uk/study/postgraduate/teacher-training/fees-and-funding]\r\n(https://www.port.ac.uk/study/postgraduate/teacher-training/fees-and-funding)\r\n\r\n*Fees are accurate at the time of publishing and are subject to change at any time without notice.*","aboutCourse":"Course introduction\r\nThe University of Portsmouth’s PGCE Initial Teacher Training Secondary in Modern Foreign Languages (MFL) is a one-year, full-time course for graduates who wish to train as secondary school language teachers or a two year part time course. It is run by the University’s School of Education and Sociology and offers the opportunity of undertaking a Postgraduate Certificate in Education (with 60 credits towards a Master’s degree).\r\n\r\n\r\nModern Foreign Languages is a foundation subject of the secondary curriculum at Key Stage 3 and an entitlement at Key Stage 4. On the PGCE course you will learn, not only about issues related to MFL teaching, but also about developing an understanding of educational issues pertaining to teaching and learning, classroom interaction, the school curriculum and the school and society. As well as learning to become a competent classroom practitioner, you will learn to make important decisions and recognise the need for reflection and evaluation. \r\n\r\nCourse aims\r\nThe course is designed to enable you to become a capable and confident teacher at secondary level. Abilities to teach the National Curriculum and General Certificate of Secondary Education in languages and encourage learning will be developed alongside the skills and understanding required of effective teachers according to the Initial Teacher Training Core Content Framework and by the Teachers’ Standards. \r\n\r\nMode of study\r\nOne-year full-time course or two year part time course.\r\n\r\nCourse outline\r\nThe MFL course integrates theory with practice and two-thirds of your time will be spent in a school, where you will be working closely with expert colleagues such as mentors and other school staff.\r\n\r\n\r\nThroughout the year you will be engaged in considering a range of subjects including: \r\n\r\n* subject knowledge enhancement in the classroom\r\n* lesson planning\r\n* classroom management\r\n* research into the pedagogy and psychology of learning MFL\r\n* special needs and inclusion\r\n* assessment\r\n\r\nYou will spend an increasing amount of time teaching in school as the course progresses. The emphasis throughout will be on helping you gain progressively more confidence and competence in order to attain an increasing level of responsibility in the classroom.\r\n","interviewProcess":"We hold our interviews in Portsmouth. You will be asked to demonstrate your knowledge and experience of your subject and the school system. We will send you an audit form to help you think about how your subject knowledge fits with the curriculum you want to teach, and how you might fill any gaps.\r\n\r\nYou’ll also be tested on reading and writing, take part in a group discussion, and will be asked to prepare a ‘microteaching’ lesson: ten minutes of teaching on a subject, skill or interest of your choice that you’ll deliver to your fellow applicants on the day.\r\nWe’ll be looking at all aspects of the application process – application form, academic reference, and the elements of the interview day – in order to get the fullest picture of you. We’re hoping to see that you’ve got the personal and intellectual qualities to be a teacher, and that you can meet the Teachers’ Standards by the end of your training.","howSchoolPlacementsWork":"School-based work is an important part of our PGCE Programme and all of our partner schools have specially trained mentors who assist students in learning to teach. This mentoring programme is essential in the development of new teachers and will be a valuable asset in your training as you gain hands on experience of practising your new skills in actual classroom environments. ","personalQualities":"","otherRequirements":"All shortlisted applicants are subject to interview. All offers are subject to Enhanced Disclosure and Barring Service (DBS) clearance and Occupational Health clearance. ","status":1,"createdAt":"2021-07-06T10:56:49.909Z","updatedAt":"2021-09-29T12:43:29.368Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
