{"id":"95e25f2e-dcff-4a27-9961-4e376b57effa","name":"Science with Biology","code":"CX11","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"B","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"ed329bbc-6bb1-481f-98f7-8815f8c4fd68","code":"F0","name":"Science"},{"id":"322cfc19-d51d-45db-91e3-bd7b4738470f","code":"C1","name":"Biology"}],"locations":[{"id":"94916765-f8bf-49a1-b54e-e9ea98518501","name":"Main Site","isPublished":"Y","status":"R","vacancies":"B"}],"trainingProvider":{"id":"5abccd25-3cfa-47a4-9f66-d30a662ae5d1","code":"P80","name":"University of Portsmouth"},"profPost":"BO","degreeGrade":"9","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"A good honours degree or equivalent in a relevant subject, with approximately 50% science content. A minimum of 2:2 is desirable although applicants with other qualifications or valuable experience will also be considered.","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"1 year full-time, 2 years part-time","feesUK":9250,"feesInternational":16200,"feeDetails":"For further fee information please see [https://www.port.ac.uk/study/postgraduate/teacher-training/fees-and-funding]\r\n(https://www.port.ac.uk/study/postgraduate/teacher-training/fees-and-funding)\r\n\r\n*Fees are accurate at the time of publishing and are subject to change at any time without notice.*","aboutCourse":"Course introduction\r\nThis is a one-year course (full time) in secondary teaching for graduates only, providing professional preparation, including subject knowledge development appropriate to teaching the Sciences with Biology. The expectation is that you develop your subject knowledge in Biology throughout your PGCE year. This may be through focussed essays, teacher support within school, INSET activities, Mentor guidance, peer group subject knowledge development and private research. It is also expected that when you apply for teaching jobs you will be able to teach all three sciences to KS3 and up to C-grade GCSE in your non-specialist area and to higher GCSE in Biology.\r\n\r\n\r\nCourse aims\r\nThe course is designed to enable you to become a capable and confident teacher at secondary level. Abilities to teach the National Curriculum and encourage learning will be developed alongside the skills and understanding required of effective teachers by the Teachers’ Standards.\r\n\r\n\r\nMode of study\r\nOne-year full-time course (36 weeks) or 2 years part-time. \r\n\r\nCourse outline\r\nThe Science course integrates theory with practice and two-thirds of your time will be spent in a school, where you will work closely with mentors and other school staff.\r\n\r\nThroughout the year you will be engaged in considering a range of topics including:\r\n\r\n* subject knowledge enhancement\r\n* lesson planning\r\n* classroom management\r\n* research into the pedagogy and psychology of learning Science\r\n* special educational needs and inclusion\r\n* differentiation and assessment\r\n\r\nSchool partnerships\r\nThe University works closely in partnership with a number of schools. Two thirds of your time is spent in schools, where you will receive the support of school-based mentors required of the school’s teaching staff.\r\n\r\nYou will spend an increasing amount of time in school as the course progresses. The emphasis throughout will be on helping you to gain progressively more confidence and competence in order to attain an increasing level of responsibility in the classroom.\r\n\r\nYou will need to be substantially independent in accessing relevant curriculum documents and approaching staff for guidance. In particular, you will need to plan your use of time very carefully. Early work in the Autumn Term at the University will be designed to help you prepare for and develop competence in these aspects.\r\n","interviewProcess":"We hold our interviews in Portsmouth and during yours, you’ll need to demonstrate your knowledge and experience of your subject and the school system. We’ll send you an audit form to help you think about how your subject knowledge fits with the syllabus you want to teach, and how you might fill any gaps.\r\nYou’ll also be tested on reading and writing, take part in a group discussion, and will be asked to prepare a ‘microteaching’ lesson: ten minutes of teaching on a subject, skill or interest of your choice that you’ll deliver to your fellow applicants on the day. We’ll be looking at all aspects of the application process – application form, academic reference, and the elements of the interview day – in order to get the fullest picture of you. We’re hoping to see that you’ve got the personal and intellectual qualities to be a teacher, and that you can meet the Teachers’ Standards by the end of your training.","howSchoolPlacementsWork":"School-based work is an important part of our PGCE Programme and all of our partner schools have specially trained mentors who assist students in learning to teach. This mentoring programme is essential in the development of new teachers and will be a valuable asset in your training as you gain hands-on experience of practising your new skill in actual classroom environments.\r\n","personalQualities":"","otherRequirements":"All shortlisted applicants are subject to interview. All offers are subject to Enhanced Disclosure and Barring Service (DBS) clearance and Occupational Health clearance. ","status":1,"createdAt":"2021-07-06T10:56:49.595Z","updatedAt":"2021-10-04T12:56:59.887Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
