{"id":"099b59af-abc1-4d00-8bc5-007c8e4c47aa","name":"Physics","code":"S597","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"bf97cd0a-224c-43d3-a021-84143df13e8d","code":"F3","name":"Physics"}],"locations":[{"id":"01244521-ed2d-4f6d-ac1b-4553170bae3d","name":"Lynn Grove Academy","isPublished":"N","status":"N","vacancies":"F"},{"id":"c1456245-f784-473d-8845-424fb5250e79","name":"Caister Academy","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"7efcb0f8-9d1c-4f9b-8083-660469763c02","code":"5A1","name":"Creative Education Trust"},"accreditedBody":{"id":"b8bcaeed-f311-4867-a1e3-c0fde20809d6","code":"E14","name":"University of East Anglia"},"profPost":"PG","degreeGrade":"1","additionalDegreeSubjectRequirements":"false","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feesInternational":22400,"feeDetails":"For any additional course costs at the University of East Anglia please visit their website:\r\nhttps://www.uea.ac.uk/about/university-information/finance-and-procurement/finance-information-for-students/tuition-fees/additional-course-fees\r\n\r\n","financialSupport":"Find out more about the Financial Support available within the University of East Anglia website:\r\nhttps://www.uea.ac.uk/course/postgraduate/pgce-secondary-science-specialising-in-physics\r\n","aboutCourse":"This 38 week, full-time PGCE Secondary Science (specialising in Physics) programme will equip you with the skills, experience and knowledge you need to teach Physics to pupils aged between 11 and 16, with 6th form enhancement.\r\n\r\nIf you choose physics as your main specialism, you’ll learn how to approach teaching difficult topics in an engaging and exciting way. We’ll help you to find your own style as a physics teacher; we will encourage you to use your own strategies to make learning physics a fun and positive experience. You’ll be given plenty of support for teaching outside your main science specialism with additional subject knowledge sessions in all three sciences, delivered in our bespoke school labs on UEA campus.\r\n\r\nUpon successful completion of your PGCE, you will graduate with Qualified Teacher Status (QTS) and 90 Master’s credits.","interviewProcess":"Interviews are part of the formal selection process and will be held at UEA Campus. You will need to present yourself well, come prepared, and dress smartly. Your interview day will include:\r\n\r\nAn introductory talk\r\nAn individual interview\r\nA written task\r\nEngage in small group discussion\r\nYou may also be asked to complete other relevant tasks such as:\r\n\r\nGiving a presentation\r\nA group interview\r\nLiteracy, numeracy and subject knowledge questions","howSchoolPlacementsWork":"You will spend most of your year based in schools with your second placement being hosted at the school selected in your application.\r\n\r\nYour first placement school will be selected for you, although we will endeavour to arrange this at our other local  Creative Education Trust school.\r\n\r\nDuring the two extensive placements in  schools, you will gain a broad range of practical teaching experience. You will learn to put ideas and theory into practice.","personalQualities":"Trainees are selected on the basis of their application form, references and an interview. You are encouraged to prepare thoroughly.\r\n\r\nApplication forms should demonstrate strengths in subject and curriculum knowledge, your enthusiasm and commitment to a career in teaching, and the age range for which you have applied.","otherRequirements":"Prior to submitting your application, we recommend you gain some observational experience in a classroom environment if possible. This will help you gain an up-to-date understanding of how classrooms are managed and how teaching and learning takes place.\r\n\r\nApplicants must also obtain:\r\n\r\nAn Enhanced Criminal Records check from the Disclosure and Barring Service\r\nA satisfactory Health Check. All PGCE trainee teachers must meet the Secretary of State’s requirements for physical and mental fitness to teach. All trainee teachers must have the health and physical capacity to teach and not put children and young people at risk of harm.","status":0,"createdAt":"2021-12-17T11:07:36.275Z","canSponsorStudentVisa":"yes","cycle":"2024"}
