{"id":"4a423734-a007-4e30-8187-3e237d61b3fc","name":"Biology","code":"L301","qualification":"pgce_with_qts","startDate":"2024-07-31T23:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"322cfc19-d51d-45db-91e3-bd7b4738470f","code":"C1","name":"Biology"}],"locations":[{"id":"85c606aa-1dfc-477c-b7c5-3adc71722665","name":"Milton Keynes Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"bdb1f77d-f450-4272-8b52-3dceb6f328be","name":"Weavers Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"b95146ab-b7f1-43ee-bfe3-c4a339153eaa","name":"Ash Green School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"60834f86-f840-48bc-959b-0bc217d18fec","name":"Abbeyfield School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"76b623ee-c683-4c51-97ce-48a63745f981","name":"Wrenn School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"7efcb0f8-9d1c-4f9b-8083-660469763c02","code":"5A1","name":"Creative Education Trust"},"accreditedBody":{"id":"ef09ce50-ccfc-4346-a0ce-43e840153dab","code":"W20","name":"The University of Warwick"},"profPost":"PG","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"Should your degree not be in the subject for which you are applying to teach, you will require a minimum of a Grade C at A level in that subject in order to meet the requirement for recommendation to a Subject Knowledge Enhancement course.","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"You may be asked to complete the University of Warwick equivalency tests.","courseLength":"OneYear","feesUK":9250,"feesInternational":20055,"feeDetails":"Fees are for 2022/23 academic year and subject to change.\r\n\r\nBooks are recommended but there is no requirement to purchase specific texts and you have access to the University of Warwick library.","financialSupport":"You may also be eligible for a loan while you study – note that you’ll have to apply for undergraduate student finance.\r\n\r\nFind out about financial support if you’re from outside the UK.","aboutCourse":"This course is supported by University of Warwick and prepares you to teach Biology to pupils aged 11 to 18. You should consider this course if you want to contribute to young people’s development by enabling them to acquire a knowledge base in Biology as well as the skills associated with practical aspects of the subject.\r\n\r\nOn a personal level, you will develop a professional understanding of current issues in education along with the ability to effectively communicate and reflect upon your teaching.\r\n\r\nOur aim is to produce confident, imaginative and successful Science teachers.\r\n\r\nYou will be taught and supported by highly experienced teams who have a national reputation for the quality of their training.","interviewProcess":"Candidates will receive details of their interview directly from the school. Interviews typically consist of:\r\n\r\n* A short lesson on a topic relevant to the class group selected (details will be provided on invitation to interview).\r\n* A short test to assess the candidates competency to process data and ability to work to the level expected for PGCE.\r\n* An interview with the Head of Department & the Lead ITT Mentor","howSchoolPlacementsWork":"You will work within the Creative Education Trust at one of our secondary schools in Coventry, Northamptonshire or Milton Keynes. \r\n\r\nThe School Direct route offers trainees an extended Professional Practice placement in one main school, supplemented by an additional placement (half a term) in a contrasting school.\r\n\r\nThis ensures a varied and balanced experience of teaching in different settings, whilst allowing you to contribute significantly to the life of your main school.\r\n\r\nWe ensure you have access to the best and most inspiring, practising teachers and mentors. You will have opportunities to observe the best classroom practice and your individual needs will be met through mentoring.","personalQualities":"Through your motivation, enthusiasm and passion for a subject, you can make a difference to students. Teaching is full of challenges and extraordinary rewards and the best teachers nurture creativity, discovery and character development in students.","otherRequirements":"We are unfortunately unable to support student visas for this course.","status":1,"createdAt":"2021-07-06T10:46:27.537Z","updatedAt":"2021-09-14T15:39:14.143Z","canSponsorStudentVisa":"yes","cycle":"2024"}
