{"id":"51622835-b5bf-42dc-87d1-a8cc525a03d0","name":"Computing","code":"V508","qualification":"pgce_with_qts","startDate":"2024-07-31T23:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"e6be6a9c-8696-4b88-8fbd-1ba1bef1b6fc","code":"11","name":"Computing"}],"locations":[{"id":"60834f86-f840-48bc-959b-0bc217d18fec","name":"Abbeyfield School","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"7efcb0f8-9d1c-4f9b-8083-660469763c02","code":"5A1","name":"Creative Education Trust"},"accreditedBody":{"id":"ef09ce50-ccfc-4346-a0ce-43e840153dab","code":"W20","name":"The University of Warwick"},"profPost":"PG","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","aboutCourse":"This course is supported by University of Warwick and prepares you to teach Computing to pupils aged 11 to 18. You should consider this course if you want to contribute to young people’s development by enabling them to acquire a knowledge base in Computing as well as the skills associated with practical aspects of the subject.\r\n\r\nOn a personal level, you will develop a professional understanding of current issues in education along with the ability to effectively communicate and reflect upon your teaching.\r\n\r\nOur aim is to produce confident, imaginative and successful Computing teachers.\r\n\r\nYou will be taught and supported by highly experienced teams who have a national reputation for the quality of their training.","interviewProcess":"Due to the current crisis the interview day has been moved to an on-line platform for the time being. We will update according if this is likely to change.","howSchoolPlacementsWork":"You will work within the Creative Education Trust at one of our secondary schools in Coventry, Northamptonshire or Milton Keynes. \r\n\r\nThe School Direct route offers trainees an extended Professional Practice placement in one main school, supplemented by an additional placement (half a term) in a contrasting school.\r\n\r\nThis ensures a varied and balanced experience of teaching in different settings, whilst allowing you to contribute significantly to the life of your main school.\r\n\r\nWe ensure you have access to the best and most inspiring, practising teachers and mentors. You will have opportunities to observe the best classroom practice and your individual needs will be met through mentoring.","personalQualities":"Through your motivation, enthusiasm and passion for a subject, you can make a difference to students. Teaching is full of challenges and extraordinary rewards and the best teachers nurture creativity, discovery and character development in students.","otherRequirements":"","status":2,"createdAt":"2021-07-06T10:46:27.653Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"Salaried trainees receive a salary from the school (on the Unqualified Teacher Scale) which is around £18,000. This may change slightly as pay scales rise. The Host School pays the University fees.\r\n\r\nFor non-salaried courses, the trainee is expected to fund the tuition fees.Please refer to the University for specific information regarding their fees.\r\n\r\nhttps://warwick.ac.uk/fac/soc/cte/start-teaching/secondary/\r\n\r\nBursaries are available in some subjects. Further information regarding bursaries can be found here:\r\n\r\nhttps://www.gov.uk/guidance/funding-initial-teacher-training-itt-academic-year-2019-to-2020"}
