{"id":"95bc9f7b-8cf2-4956-ad0c-d4939089a6f3","name":"Geography","code":"E713","qualification":"pgce_with_qts","startDate":"2023-07-31T23:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3f47e67b-7fa5-4947-a5a0-74d528cd2a87","code":"F8","name":"Geography"}],"locations":[{"id":"76b623ee-c683-4c51-97ce-48a63745f981","name":"Wrenn School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"bdb1f77d-f450-4272-8b52-3dceb6f328be","name":"Weavers Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"60834f86-f840-48bc-959b-0bc217d18fec","name":"Abbeyfield School","isPublished":"N","status":"S","vacancies":"F"},{"id":"b95146ab-b7f1-43ee-bfe3-c4a339153eaa","name":"Ash Green School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"7efcb0f8-9d1c-4f9b-8083-660469763c02","code":"5A1","name":"Creative Education Trust"},"accreditedBody":{"id":"ef09ce50-ccfc-4346-a0ce-43e840153dab","code":"W20","name":"The University of Warwick"},"profPost":"PG","degreeGrade":"1","additionalDegreeSubjectRequirements":"false","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":22110,"aboutCourse":"This course is supported by University of Warwick and prepares you to teach Geography to pupils aged 11 to 18. You should consider this course if you want to contribute to young people’s development by enabling them to acquire a knowledge base in Geography as well as the skills associated with practical aspects of the subject.\r\n\r\nOn a personal level, you will develop a professional understanding of current issues in education along with the ability to effectively communicate and reflect upon your teaching.\r\n\r\nOur aim is to produce confident, imaginative and successful History teachers.\r\n\r\nYou will be taught and supported by highly experienced teams who have a national reputation for the quality of their training.","interviewProcess":"Candidates will receive details of their interview directly from the school. Interviews typically consist of:\r\n\r\n* A short lesson on a topic relevant to the class group selected (details will be provided on invitation to interview).\r\n* A short test to assess the candidates competency to process data and ability to work to the level expected for PGCE.\r\n* An interview with the Head of Department & the Lead ITT Mentor","howSchoolPlacementsWork":"You will work within the Creative Education Trust at one of our secondary schools in Coventry, Northamptonshire or Milton Keynes. \r\n\r\nThe School Direct route offers trainees an extended Professional Practice placement in one main school, supplemented by an additional placement (half a term) in a contrasting school.\r\n\r\nThis ensures a varied and balanced experience of teaching in different settings, whilst allowing you to contribute significantly to the life of your main school.\r\n\r\nWe ensure you have access to the best and most inspiring, practising teachers and mentors. You will have opportunities to observe the best classroom practice and your individual needs will be met through mentoring.","status":1,"createdAt":"2021-10-14T09:03:11.915Z","updatedAt":"2021-10-14T09:05:48.646Z","canSponsorStudentVisa":"yes","cycle":"2024"}
