{"id":"56c344c3-e983-49f2-9ea8-c3714a02d125","name":"Primary","code":"J785","qualification":"pgce_with_qts","startDate":"2024-01-01T00:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"P","ageRange":"3_to_7","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"9a478b5c-aeae-4807-9b1e-a555690a35fe","name":"Rivers Teaching Alliance","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"99ba83c7-895b-4228-84c9-51eb1f62fb81","code":"2B7","name":"Rivers Teaching Alliance"},"accreditedBody":{"id":"6019b3ce-f2f6-4b0e-b2a9-5813d74c4d54","code":"W80","name":"University of Worcester"},"profPost":"PG","degreeGrade":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"TwoYears","feesUK":9250,"feesInternational":14100,"aboutCourse":"Our school direct route is a practical, hands on route into teaching and we are praised for the support we give to our trainees. By the end of the course trainees are assessed to achieve QTS (qualified teacher status) and PGCE (post graduate certificate in education). By choosing the school direct route, you are immersed in school life from the start with the support of teachers and university staff.\r\n\r\nSubject specialists deliver high quality and bespoke training sessions to support trainees in the classroom and in meeting the teacher standards. Trainees undertake 2 contrasting school placements in different schools and two different key stages (minimum 120 days) along with the entitlement to experiences in Early Years, Year 6, a special school or behavioral unit and KS3.\r\n\r\nTraining takes place mainly at The Rivers Teaching Alliance and The University of Worcester (located within 5 minutes of each other) and occasionally at other locations suited to the professional study sessions.\r\nRivers Teaching Alliance was previously a finalist in the Worcestershire Teaching Awards for providing high quality post 18 provision.  \r\nQTS and PGCE are awarded through University of Worcester (our provider) \r\nTo qualify to apply, applicants need a degree 2.2 or above and GCSE grade 4 or equivalent in English, Maths and Science. \r\n\r\nQuotations from previous candidates:\r\n\"Training at Rivers has been brilliant and the staff have been incredibly supportive. I feel more prepared than ever to walk into a classroom with all the essential tools I need.\"\r\n\"We have had an incredible amount of opportunities to develop ourselves as outstanding and confident teachers. The schools where I have been placed have been so welcoming. I cannot thank the team enough for making my journey to becoming a teacher memorable, refreshing and wonderful.\"","interviewProcess":"Prior to the formal interview we would expect you to come to the Rivers Teaching Alliance (Based at St Clement's Teaching School, WR5 2NS) and meet us for an informal conversation.\r\n\r\nA formal interview day which will consist of:\r\n\r\n* A group activity and written task which will be used to set personalised targets for the course.\r\n* Leading a classroom/group activity with a group of pupils.\r\n* An interview with a panel made up of representatives from the school and the University of Worcester.\r\n\r\nDuring the interview, you will be given the opportunity to discuss your experiences to date, including opportunities you have had to work with school-aged children and any transferable skills you can offer.","howSchoolPlacementsWork":"We aim to place trainees no more than 30 minutes travelling distance from home and schools and mentors are carefully selected to match the trainee requirements. \r\nWe work with over 70 schools across Worcestershire and wider and trainees have the opportunity to visit a wide and diverse range of settings. \r\nTrainees spend 120 minimum days in school and there are around 30 professional study days during the year. You will teach and qualify for the 3 - 7 age range but will experience KS2  also. ","personalQualities":"* Enthusiasm and commitment \r\n* Passion for making a difference to the lives of children","otherRequirements":"Some school experience preferable but not essential.","status":1,"createdAt":"2021-10-01T13:07:50.623Z","updatedAt":"2021-10-01T13:09:00.617Z","canSponsorStudentVisa":"yes","cycle":"2024"}
