{"id":"0bc8ff81-fb29-4760-bb42-73fd80eab321","name":"Business studies","code":"C109","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"14_to_19","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"de6477b2-6027-48e6-b9f7-3206774705c2","code":"08","name":"Business studies"}],"locations":[{"id":"ea23becc-aa51-41ec-95ab-a1cc7e04963d","name":"Main Site","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"d6a740df-e5c7-438e-8a80-e61c9539a4ed","code":"1BW","name":"Sharing Excellence Partnership Dunraven School Streatham"},"accreditedBody":{"id":"252d7e03-741e-4453-b6a8-3d361e6c9d1b","code":"E69","name":"e-Qualitas"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Please contact e-Qualitas for further information","courseLength":"TwoYears","feesUK":8000,"feeDetails":"The fee is £6,000 + VAT, plus £2,000  paid to the school for your training. The school may opt to waive the £2,000 fee.\r\n\r\n The full amount can be borrowed via student finance, including VAT and the disbursement.\r\n\r\nTrainees can opt into a PGCE with Leeds Beckett University for £1,800. \r\n","financialSupport":"The school may opt to waive the £2,000 fee.","aboutCourse":"In partnership with e-Qualitas we offer highly personalised school based training that is carefully structured to enable trainees to take control of their own development, and become outstanding teachers. \r\n\r\nTrainees work closely with experienced teachers, first of all observing and team teaching, then teaching independently, as their skills and confidence grow. Study is based on the distance learning resources on the e-Qualitas virtual learning environment (VLE). Trainees attend up to ten training days run by e-Qualitas, mostly held in a venue in central London, the rest of the time they are based in school. Trainees have access to an extensive programme of in-school training led by expert practitioners. \r\n\r\nThe course content is organised into six modules, the first three of which may be worked on concurrently.\r\n\r\nTraining Module 1A: Lesson planning. How to plan lessons well, including choosing the most appropriate teaching and learning strategies.\r\nTraining Module 1B: Behaviour. How to manage pupils during lessons, and motivating them towards learning.\r\nTraining Module 1C: Assessment. How to assess pupils' learning in each subject, and use assessment information when planning and teaching lessons.\r\nTraining Module 2: Meeting needs of different groups of pupils. How to ensure that all groups of pupils do as well as possible e.g. those who speak English as an additional language, high attaining pupils, those with special educational needs.\r\nTraining Module 3: The wider context of teaching and learning in schools today. Barriers to learning i.e. why some pupils do not do as well as they should, and how teachers can make a difference to this.\r\nTraining Module 4: Effective Subject teaching. Bringing everything together, how to teach really effectively. This builds on all the earlier training in how to teach effectively, and involves an in-depth study of an aspect of subject teaching.\r\n\r\nAssessment\r\nYour progress towards meeting the Teachers' Standards is assessed formally at four points: when you start, after 10 working weeks, 20 working weeks and at the end of the training period. These assessments are carried out jointly by trainees, school staff and e-Q tutors. There are two formal assignments marked by e-Qualitas tutors: an essay exploring aspects of meeting the needs of different groups of pupils (linked to Training Module 2), and a subject-related essay (linked to Training Module 4).\r\n\r\n","interviewProcess":"Applicants are welcome to contact us via the address below to send a CV in advance of applying, or to ask questions about our schools, our training programmes or the application process. \r\n\r\nIf you have applied, meet the entry requirements and demonstrate the skills needed  for school based teacher training you will be invited to an interview including the following activities: a short classroom based activity, an interview with heads or School Direct leads from our partner schools, and tasks to assess Fundamental Proficiencies (formerly Professional Skills Tests) set by the training provider. \r\n\r\nMost of our interviews are held at Dunraven School. If you have applied for a placement in a different school you would be expected to visit it either before or after the interview.\r\n\r\nYou are required to produce photographic ID, original examination certificates and to complete a request for information regarding health and suitability for teaching. Offers are subject to completion of a health check and Enhanced Disclosure check by the Disclosure and Barring Service prior to enrolment.\r\n\r\nFind out more about our training programmes and how to apply, including recruitment information events  via the following link.\r\n\r\n[Dunraven Sharing Excellence Partnership]\r\n( https://www.sharingexcellence.org.uk/1134/school-direct)\r\n\r\nE-mail contact for queries: schooldirect@sharingexcellence.org.uk","howSchoolPlacementsWork":"After an initial visit by an e-Qualitas tutor, a training plan is written  identifying training needs and this becomes the basis of the training experience.\r\n\r\nDuring school placements, trainees benefit from working alongside experienced teachers. Trainees have opportunities to observe excellent teaching before experimenting with approaches to teaching and learning across the secondary age range, during which time they are supervised and supported by teachers and tutors. They begin with a light teaching timetable which is gradually increased as they become more skilled and confident.\r\n\r\nThe main focus of this training programme is classroom practice and the development of the knowledge, skills and understanding needed to ensure that pupils make excellent progress in their learning. Trainees are supported by both a school based mentor and a tutor working in close partnership to support them. They are experienced and skilled in classroom observation, giving feedback and setting targets for development.  Trainees have full support in developing their behaviour management skills throughout the year.  Placements will be in Key Stage Key Stage 4 and 5  with some opportunity to experience Key Stage 3 and the primary curriculum. Trainees have a seven week second placement in a contrasting school, usually another local partnership school, to enhance their experience by giving them the opportunity to plan, teach and assess in a different context.\r\n\r\nSchool Direct trainees are expected to become fully involved in the life of the school to enhance their knowledge and understanding of the profession.","personalQualities":"We are looking for applicants who are passionate about teaching their subject and have the potential to become outstanding teachers. Applicants need to show evidence of time management skills, commitment and personal resilience needed to undertake school based teacher training. Ability to work effectively with young people  and understand the urban state school environment is essential. Confident self-presentation, good communication skills and the ability to inspire and enthuse young people are also important.\r\n","otherRequirements":"Overseas qualifications must be checked for UK equivalence by NARIC. \r\n\r\nOffers are subject to a Disclosure and Barring Service (DBS) Enhanced Disclosure list check. \r\n\r\nApplicants must meet the Secretary of State's requirements for mental and physical health in order to be eligible.\r\n\r\nApplicants for salaried positions must provide a CV including full employment history.\r\n\r\nWe recommend that you attend one of our Recruitment Information Events to find out more about this training programme and how to apply.","status":1,"createdAt":"2021-07-06T10:55:53.060Z","updatedAt":"2021-09-30T10:20:36.277Z","canSponsorStudentVisa":"no","cycle":"2024"}
