{"id":"6389b3e5-cece-4a22-a261-84fcd894c08c","name":"Design and Technology","code":"345T","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"118fabd7-86d0-4a40-9e9a-e5c302abe59b","code":"DT","name":"Design and technology"}],"locations":[{"id":"ea23becc-aa51-41ec-95ab-a1cc7e04963d","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"d6a740df-e5c7-438e-8a80-e61c9539a4ed","code":"1BW","name":"Sharing Excellence Partnership Dunraven School Streatham"},"accreditedBody":{"id":"33037eab-f75d-4350-b1e2-967c41e9d4c6","code":"R48","name":"Roehampton University"},"profPost":"BO","degreeGrade":"1","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Please check with University of Roehampton for further details.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"The programme is designed to support trainees in developing a range of skills that are required to become a successful secondary school teacher. \r\n\r\nTrainees will: \r\n-Become effective classroom practitioners; planning and delivering engaging and stimulating lessons \r\n-Learn to recognise the similarities and differences in pupils, particularly in terms of their needs, their behaviour and attainment and how to plan for this in lessons \r\n-Develop a critical understanding of the curriculum and pedagogy \r\n-Begin to understand the complex range of whole school issues, the values and assumptions which underpin them and their application to school and classroom practice. \r\n\r\nQualification Outcome:\r\nSuccessfully completing all aspects of the course, both in school and university based learning, will lead to the award of Postgraduate Certificate in Education (PGCE), which also carries 60 Masters level credits that may be used towards a subsequent Masters degree. The PGCE (M) component is an academic qualification awarded by the university. It is recognised abroad. \r\n\r\nThe course also leads to the award of QTS (Qualified Teacher Status). QTS is a professional qualification awarded by the Department for Education. \r\n\r\nThe key aim of this programme is to enable trainees to become confident, knowledgeable and enthusiastic teachers. The programme provides opportunities for trainees to explore the theory and practice of teaching the subject through a range of lectures, workshops and tutorials, and to develop their expertise in the classroom through two contrasting school placements. \r\n\r\nThe Design and Technology programme is structured with a core of Design and Technology taught to all Trainees, including the nature of Design and Technology in Education, ICT and Graphics, with the opportunity to specialise in Product Design, Food and Nutrition, Textiles Technology or Electronic and Communications technology (ECT) and to develop a second strength in at least one other area. \r\n\r\nWe focus on extending and developing your knowledge, understanding and skills of designing and making, with an emphasis on active practical learning and problem solving. A range of specialist facilities and resources are used by the tutors from Roehampton.\r\n\r\n\r\n\r\nThere are three written assignments set and assessed by the university towards the Masters level PGCE element of the qualification. \r\n\r\n\r\n\r\n\r\n\r\n","interviewProcess":"Applicants are welcome to contact us via the address below to send a CV in advance of applying, or to ask questions about our schools, our training programmes or the application process. \r\n\r\nIf you have applied, meet the entry requirements and demonstrate the skills needed  for school based teacher training you will be invited to an interview including the following activities: a short classroom based activity, an interview with heads or School Direct leads from our partner schools, and a short written task set by the university. \r\n\r\nMost of our interviews are held at Dunraven School. If you have applied for a placement in a different school you would be expected to visit it either before or after the interview. We offer the opportunity to be considered for other remaining vacancies in our Partnership but it is your decision which school you would like to train in.\r\n\r\nYou are required to produce photographic ID, original examination certificates and to complete a request for information regarding health and suitability for teaching. Offers are subject to completion of a health check and Enhanced Disclosure check by the Disclosure and Barring Service prior to enrolment.\r\n\r\nFind out more about our training programmes and how to apply, including recruitment information events  via the following link.\r\n\r\n[Dunraven Sharing Excellence Partnership]( https://www.sharingexcellence.org.uk/1134/school-direct) \r\n\r\nE-mail contact for queries: schooldirect@dunraven.org.uk","howSchoolPlacementsWork":"During school placements, trainees benefit from working alongside experienced teachers. Trainees have opportunities to observe excellent teaching before experimenting with approaches to teaching and learning across the secondary age range, during which time they are supervised and supported by teachers and tutors. They begin with a light teaching timetable which is gradually increased as they become more skilled and confident.\r\n\r\nThe main focus of this training programme is classroom practice and the development of the knowledge, skills and understanding needed to ensure that pupils make excellent progress in their learning. Trainees are supported by both a school based mentor and a university tutor working in partnership to support them. They are experienced and skilled in classroom observation, giving feedback and setting targets for development.  Trainees have full support in developing their behaviour management skills throughout the year.  Placements will be in Key Stage 3 and Key Stage 4, ages 11-16, with some opportunity to experience Key Stage 5 and the primary curriculum. Trainees are based in school throughout the year, except when they have sessions at the university, usually on Wednesdays. Trainees have a six week second placement in a contrasting school, usually another local partnership school.\r\n\r\nProfessional development is supported by an extensive programme of in-school training to enrich their experience, delivered by expert practitioners in the Partnership, in addition to the Masters level PGCE programme delivered by the University of Roehampton.\r\n\r\nTowards the end of the year trainees are in school full time, ending when university training is complete in late June. School Direct trainees are expected to become fully involved in the life of the school to enhance their knowledge and understanding of the profession.","personalQualities":"We are looking for applicants who are passionate about teaching their subject and have the potential to become outstanding teachers. Applicants need to show evidence of time management skills, commitment and personal resilience needed to undertake school based teacher training. Ability to work effectively with young people  and understand the urban state school environment is essential. Confident self-presentation, good communication skills and the ability to inspire and enthuse young people are also important.","otherRequirements":"Applicants will be expected to provide and talk througha portfolio of their work.\r\n\r\nOverseas qualifications must be checked for UK equivalence by UKENIC. \r\n\r\nOffers are subject to a Disclosure and Barring Service (DBS) Enhanced Disclosure list check. \r\n\r\nApplicants must meet the Secretary of State's requirements for mental and physical health in order to be eligible.\r\n\r\nApplicants must provide a CV including full employment history.\r\n\r\nWe recommend that you attend one of our Recruitment Information Events to find out more about this training programme and how to apply.","status":1,"createdAt":"2021-07-06T10:55:52.376Z","updatedAt":"2021-09-22T14:24:30.830Z","canSponsorStudentVisa":"yes","cycle":"2024"}
