{"id":"737daf7a-3370-45f0-98fe-45f64ad01f8c","name":"Primary","code":"38BZ","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"edc8e4fd-5a40-4f86-aab1-0e4dadc88bb6","name":"Julian's Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"8c771fd7-f267-4b0f-9127-a048d5451f08","name":"Rosendale Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"ea23becc-aa51-41ec-95ab-a1cc7e04963d","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"},{"id":"9d105dc7-4f57-4aa5-ab2d-6a7d5f8ff624","name":"Sunnyhill Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"65b518bb-7158-4720-ba98-c3552c2b9d6f","name":"Goldfinch Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"f0b5f5d9-41ff-4919-846a-5c7156d0e620","name":"St Andrew's Catholic Primary School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"d6a740df-e5c7-438e-8a80-e61c9539a4ed","code":"1BW","name":"Sharing Excellence Partnership Dunraven School Streatham"},"accreditedBody":{"id":"33037eab-f75d-4350-b1e2-967c41e9d4c6","code":"R48","name":"Roehampton University"},"profPost":"BO","degreeGrade":"1","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"Please check with University of Roehampton for further details.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"We offer Primary General ages 3-11 and Primary General ages 3-11 with maths,  the same training programme but with more emphasis on maths teaching. Those with a strong A level or degree component in maths should consider this option, as it will enhance their employment prospects.\r\n\r\nThe focus of this training programme is classroom practice and the development of the knowledge, skills and understanding needed to ensure that pupils make excellent progress in their learning. Trainees are supported by both a school based mentor and a university tutor, who are  experienced and skilled in classroom observation, giving feedback and setting targets for development. \r\n\r\nTrainees have full support in developing their behaviour management skills throughout the year. They also have access to an extensive programme of in-school training and professional development delivered by expert practitioners in the Partnership to enrich their experience, as well as the Masters level PGCE programme delivered by the University of Roehampton.\r\n\r\nThere are three written assignments set and assessed by the university towards the Masters level PGCE element of the qualification. Trainees are based in school throughout the year, except when they have sessions at the university, mostly Fridays. Towards the end of the year trainees are in school full time, until the end of training in late June. School Direct trainees are expected to become fully involved in the life of the school to enhance their knowledge and understanding of the profession.\r\n\r\nBy the end of the year trainees' experience should have enabled them to reach the required standard for a Post Graduate Certificate in Education (PGCE) with a recommendation for Qualified Teacher Status (QTS), and an enhanced likelihood of employment either in the Partnership or elsewhere. The qualification also carries 60 Masters level credits that may be used towards a Masters degree. \r\n\r\n[Corpus Christi RC Primary School](https://www.corpuschristischool.co.uk/)\r\n[Crown Lane Primary School](https://www.crownlane.lambeth.sch.uk/)\r\n[Dunraven Primary School](https://www.dunraven.org.uk/)\r\n[Goldfinch Primary School](http://www.eardley.wandsworth.sch.uk/)\r\n[Julians Primary School](https://www.juliansprimary.org.uk/)\r\n[St Andrew's RC Primary School](http://st-andrewsrc.lambeth.sch.uk/)\r\n[Van Gogh Primary School](https://www.vangoghprimary.org.uk/)\r\n[Rosendale Primary School](https://www.rosendale.cc/)\r\n\r\n\r\n[University of Roehampton](https://www.roehampton.ac.uk/teacher-training/)\r\n\r\n\r\n","interviewProcess":"Applicants are welcome to contact us via the address below to send a CV in advance of applying via UCAS, or to ask questions about our schools, our training programmes or the application process. \r\n\r\nIf you have applied via UCAS, meet the entry requirements and demonstrate the skills needed  for school based teacher training you will be invited to an interview including the following activities: a short classroom based activity, an interview with heads or School Direct leads from our partner schools, and a short written task set by the university. \r\n\r\nMost of our interviews are held at Dunraven School. If you have applied for a placement in a different school you would be expected to visit it either before or after the interview, so that you can decide whether you would like to train in that environment and the school can meet you. We offer you the opportunity to be considered for other remaining vacancies in our Partnership.\r\n\r\nYou are required to produce photographic ID, original examination certificates and to complete a request for information regarding health and suitability for teaching. Offers are subject to completion of a health check and an Enhanced Disclosure check by the Disclosure and Barring Service  prior to enrolment.\r\n\r\nFind out more about our training programmes and how to apply, including recruitment information events  via the following link.\r\n\r\n[Dunraven Sharing Excellence Partnership (https://www.sharingexcellence.org.uk/1134/school-direct)\r\n\r\nE-mail contact for queries: schooldirect@dunraven.org.uk","howSchoolPlacementsWork":"Induction in the first half of the autumn term enables trainees to familiarise themselves with the school, and begin teaching with a timetable  which reflects their experience, gradually increasing as their classroom skills and confidence develop. \r\n\r\nTrainees are assessed in their progress towards meeting the required standard for QTS throughout the year, initially informally through weekly observations and then formally during their two formally assessed placements, by the mentor and the university tutor, who work in close partnership to support the trainee. \r\n\r\nThere is a six week second placement in the second half of the autumn term, to give experience of planning, teaching and assessing in a different school environment and a different Key Stage. The placement would usually be in another one of our local partner schools, keeping travelling time to a minimum. This placement is formally assessed by mentors and university tutors and targets are set, to support trainees in making progress towards QTS. The second longer formally assessed placement in the home school takes place from March to June.\r\n\r\nTrainees also have the opportunity to experience the full range from 3-11 and a visit to a secondary school to enhance their understanding of the learning journey. \r\n","personalQualities":"We are looking for applicants who are passionate about teaching and have the potential to become outstanding teachers. Applicants need to show evidence of time management skills, commitment and personal resilience needed to undertake school based teacher training. Ability to work effectively with young people  and understand the urban state school environment is essential. Confident self-presentation, good communication skills and the ability to inspire and enthuse young people are also important.","otherRequirements":"Overseas qualifications must be checked for UK equivalence by NARIC. \r\n\r\nOffers are subject to an Enhanced Disclosure and Barring Service (DBS) check. \r\n\r\nApplicants must meet the Secretary of State's requirements for mental and physical health in order to be eligible.\r\n\r\nWe recommend that you attend one of our Recruitment Information Events to find out more about this training programme and how to apply.","status":1,"createdAt":"2021-07-06T10:55:52.863Z","updatedAt":"2021-09-21T12:33:07.707Z","canSponsorStudentVisa":"yes","cycle":"2024"}
