{"id":"6870b50a-eb24-4cbe-a656-24114484b71b","name":"Primary","code":"3D5D","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"591e39cc-6d8f-44a5-9f31-496797fb07e2","name":"OWLS","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"e195e2d3-b272-4418-95c0-5c863afdc335","code":"2K3","name":"Owls"},"accreditedBody":{"id":"d8c030de-91f2-420d-9ff7-4286c7f913fa","code":"E42","name":"Edge Hill University"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"If you are applying and don’t have the GCSEs  required for entry, one of Edge Hill University's equivalency test programmes may be for you.\n\nThe equivalency tests offer you the opportunity to demonstrate that you satisfy our entry requirements for GCSE English Language and Mathematics at Grade C or Grade 4 or above.\n\nEdge Hill offer tutor-led revision courses or standalone tests for applicants who feel they do not need tuition.\n\nAll tutor-led revision courses are delivered online, prior to sitting an exam on campus. You can choose to sit the standalone tests either on campus or at Holy Cross College & University Centre on selected dates throughout the year.\n\nFor more details visit [Edge Hill's website](https://www.edgehill.ac.uk/study/equivalency/).","courseLength":"OneYear","feesUK":9250,"feeDetails":"Subject to eligibility, UK and EU students can apply for a Tuition Fee Loan from the Government to cover the full cost of tuition fees. UK and EU students may also be eligible to apply for additional funding to help with living costs.\r\n\r\nFor more details visit [Edge Hill's website](https://www.edgehill.ac.uk/study/fees-and-funding/).","aboutCourse":"This course offers a PGCE with QTS.The academic part of the course is provided by Edge Hill University.The timetable is usually the first few weeks in University and then 6 weeks when you will spend 3 days at University and 2 days in your first placement school. From October half term through to February you will be full time in your first placement school. There will then be three weeks  backs at University and then you will be in your second placement school from March through to end of June/ first week in July.Over the course of the year we offer 10 enhancement days. These days are usually based within our schools and provide trainees the opportunity to spend time in each school. These days include Behaviour Management, Mindfulness, Early Years, English as an additional language, SEND, First Aid, Project Based Learning, Safeguarding, Church Schools, Gifted and Talented, Music and preparing for your first teacher appointment\r\nThese enhancement days are led by schools within our partnership who have specialists within the school or we bring in  specialist trainers.\r\nAll of our schools are rated Outstanding or Good by OFSTED and have very experienced school mentors who have been involved in training and supporting trainees over many years.\r\nWe also have an Edge Hill mentor who works within our schools who guides you through the year and is usually also your personal tutor.\r\nOur schools range from a very small rural school of 40 children to a large 4 class  entry infant school and a 4 class  junior school. Within Owls there are a range of Community and Church Schools. All of these  will provide trainees with the guidance and experience to become the outstanding primary school teachers of the future with a passion for enthusing children to become lifelong learners.","interviewProcess":"Candidates will be invited to one of our schools for interview.\r\nYou will usually be interviewed by two of our headteachers and our Edge Hill University school based mentor.\r\nThe interview will consist of a short teaching task (usually no more than 25 minutes) with a small group of no more than 10 mixed ability children. The school where the interview suggests the area of the curriculum to be taught and the age group of the children. The area of the curriculum is usually a Maths or English task.\r\nAfter the task there will be an interview where you will be asked to reflect on the task you have just taught. There will then asked some general questions about education. There will also be an opportunity for the candidate  to ask questions.  More details regarding the interview will be sent out in a booklet prior to interview.\r\nAt present there is also a written task but this may be subject to change depending on the University requirements.\r\nThe interviews generally last no longer than a half day.\r\nYou will also be given the chance to have a visit around the school.\r\nAs you will be aware the Skills tests will not be in place this year,","howSchoolPlacementsWork":"Over the course of the year candidates will have 2 full time placements. During those placements you will start off observing, before being asked to teach small groups before teaching the whole class. You timetable will gradually build over the year so that at by the end of placement 2 candidates will be teaching 80% of the class timetable.\r\n\r\nOne placement will be in KS1 and the other will be in KS2.\r\n \r\nDuring the course of your placements candidates will be given opportunities to spend time in other classes in the school to observe a range of teaching and different age groups. \r\n\r\nCandidates will also be given opportunities to spend a day in a nursery school and a secondary school .\r\n\r\nWhen deciding on placement schools we will look at where you are living and what method of transport you will be using and we endeavour to place you in a school that would be easiest to get to.\r\n\r\nWe have 11 schools in our partnership based in Liverpool, Aughton (Ormskirk), Birkdale (Sefton) Southport, Litherland (Sefton),Newburgh, Rufford and Hesketh Bank (all  West Lancs)\r\n \r\nWe provide training for children from the age of 5 to 11 years.\r\n\r\nMost of our schools have a nursery, morning club and after school clubs .\r\n\r\nAll of our schools offer a full range of after school activities.","personalQualities":"When you apply, you are expected to have:\r\n\r\n* A commitment to, and understanding of, primary education, demonstrating the personal attributes, values and motivation required to train as a teacher\r\n\r\n* Suitable presentational qualities, including a good standard of written English.\r\n\r\n* We are looking for candidates who will become enthusiastic teachers with an ability to inspire our children with a love and lifelong interest in learning","otherRequirements":"If you accept a formal offer from Edge Hill University you will be required to meet the Department for Education’s standards for physical and mental fitness to teach and clearance to work with children. \r\n\r\nFurther information, including a Declaration of Health questionnaire and details of how to apply for a [Disclosure and Barring Service (DBS)](https://www.edgehill.ac.uk/dbs) Enhanced Disclosure will be sent to you after you have firmly accepted an offer. ","status":1,"createdAt":"2021-07-06T10:51:41.868Z","updatedAt":"2021-10-01T08:13:53.242Z","canSponsorStudentVisa":"yes","cycle":"2024"}
