{"id":"4584d5dd-ff1e-40ac-ab09-95fb1de0e6d3","name":"Primary (3-7)","code":"2253","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"3_to_7","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"7f3b650f-bd64-4b47-97f5-c2a357508e84","name":"Oxford Brookes University, Harcourt Hill Campus","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"66d7a620-e321-4149-9b28-fa5502ce365c","code":"O66","name":"Oxford Brookes University"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":14900,"feeDetails":"Additional costs include your travel to and from your placement.\r\n\r\nYou'll also need to pay for your DBS clearance to enrol on to the course, this will be about £50.","financialSupport":"All Oxford Brookes alumni, friends and family may be eligible for a 10% fees discount on [postgraduate study.](https://www.brookes.ac.uk/studying-at-brookes/finance/postgraduate-finance---uk-and-eu-students/postgraduate-discount/)\r\n\r\nGeneral sources of funding and fees for postgraduate students can be found [here.](https://www.brookes.ac.uk/studying-at-brookes/finance/)","aboutCourse":"Become an early years teacher who makes a real difference. When you train to teach at Oxford Brookes you’ll discover how you can become an exceptional teacher.  \r\n\r\nYou’ll build confidence teaching in any early years classroom. And you’ll be able to support children from all different backgrounds.  You’ll experience different schools across your teaching age range. You’ll have the freedom to experiment with approaches and techniques as you go.\r\n \r\nYou’ll train within a supportive community of educators. Including mentors who can help you master skills and explore specialisms. You’ll have time to build knowledge across primary subjects. And we’ll support you to find a teaching style that feels right for you.\r\n\r\nYou’ll enjoy:\r\n* A network of 650 partner schools\r\n* Professional Masters level modules\r\n* A library of resources and equipment\r\n\r\nYou're assessed by:\r\n* coursework\r\n* assignments\r\n* attaining the level for the award of Qualified Teacher Status (QTS).\r\n\r\nYou’ll gain academic knowledge and practical skills that will underpin your career as an early years teacher. You’ll graduate as a resilient professional, with a teaching style that’s right for you.\r\n","interviewProcess":"A successful application leads to a teaching interview invite from Oxford Brookes University. A successful interview will secure your place on your chosen PGCE Primary course. \r\n\r\nYour teaching interview will be remote (online). \r\n\r\nYou’ll receive an interview date invite. That contains interview advice/guidance and example questions. Please confirm your interview date as soon as possible.\r\n\r\nThen your academic interviewer will contact you with a 30min 1-1 Zoom interview invite between 10.00 - 17.00 on your interview day. Please also accept this invite.\r\n\r\nBefore your interview you need to select a picture book that you will discuss in your interview. You'll also need your photographic ID to hand to show the academic interviewer.\r\n\r\nAt 09:00 on your interview day you will receive a recorded introductory talk from the course leader. Please watch this video.\r\n\r\nEnjoy your interview and ask questions, it’s your chance to find out about us.\r\n","howSchoolPlacementsWork":"We have a network of 650 partner schools in Oxfordshire and the surrounding counties. Our placements team will contact you and arrange your school placements in the 3-7 age range. \r\n\r\nWe aim for you to gain experience in nursery settings and primary schools over 120 days of placements. This includes a one-week placement in an ‘inclusive’ setting. We’re working with our school partners through the Covid-19 crisis. This is to ensure you have a full and valuable placement experience.\r\n\r\nYou can draw on the expertise of experienced early years teacher educators. And seek guidance and support to master educational theory and practical teaching skills. You’ll have the time and space to build specialist knowledge across early years and primary subjects. And you’ll have access to an extensive library of teaching resources that you can use on your placements.\r\n\r\n","personalQualities":"When you apply for the course, we recommend that you have school experience. Applicants should have insights into the primary classroom with school experience. Though this is not compulsory for applicants. \r\n","otherRequirements":"* Fitness for practice check.\r\n* Disclosure and Barring Service (DBS) check.","status":1,"createdAt":"2021-07-06T10:48:47.953Z","updatedAt":"2021-09-24T10:43:25.196Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
