{"id":"912c442f-e156-4630-bd43-88c0e172ff24","name":"Post-Compulsory Education","code":"X341","qualification":"pgce","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","subjectLevel":"further_education","isSend":"no","subjects":[{"id":"9de4b2d2-5739-4c34-92d2-9b4384760298","code":"41","name":"Further education"}],"locations":[{"id":"7f3b650f-bd64-4b47-97f5-c2a357508e84","name":"Oxford Brookes University, Harcourt Hill Campus","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"66d7a620-e321-4149-9b28-fa5502ce365c","code":"O66","name":"Oxford Brookes University"},"profPost":"PG","degreeGrade":"9","additionalDegreeSubjectRequirements":"false","english":"9","maths":"9","science":"9","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":14900,"feeDetails":"You'll need a DBS Check and Fitness to Practice check to enrol, you'll have to pay for both checks (approx £105).\r\n\r\nAlso additional costs include your travel to and from your placement.","financialSupport":"For advice and questions you have on finance; please contact Student Finance on: \r\n+44 (0)1865 483088 \r\nfinancefees@brookes.ac.uk","aboutCourse":"Inspire others with a love for your subject or trade - and develop the methods and skills to teach in adult and further education.\r\n\r\nOn this course, you’ll build a deep understanding of adult education teaching pedagogy, and ways to support student learning. You’ll master teaching skills and techniques. You’ll apply your knowledge in the classroom. And you’ll graduate with the skills and confidence to help your students achieve their goals.\r\n\r\nYou’ll join a supportive community of trainee teachers - from all different backgrounds. You’ll learn from each other, and share experiences as you progress.\r\n\r\nYou’ll emerge a confident, versatile professional, ready to teach in further and adult education settings, like:\r\n\r\n* higher education\r\n* the health service\r\n* adult and community education\r\n* the prison service\r\n* the armed forces\r\n* private training\r\n* private training.\r\n","interviewProcess":"A successful application leads to a teaching interview invite from Oxford Brookes University. A successful interview will secure your place on your chosen PGCE Post Compulsory course. \r\n\r\nYour teaching interview will be remote (online). \r\n\r\nYou’ll receive an interview date invite. That contains interview advice/guidance and documentation for your interview. Please confirm your interview date as soon as possible.\r\n\r\nThen you'll receive a Zoom interview invite for  10.00 - 14.00 on your interview day. Please also accept this invite.\r\n\r\nEnjoy your interview and ask questions, it’s your chance to find out about us.\r\n","howSchoolPlacementsWork":"After your introductory module, you'll secure a place with a suitable provider. The provider will coordinate your teaching experience and arrange a mentor for you.\r\n\r\nYou'll start observing experienced teachers and then start to work alongside them. You'll progress towards teaching up to nine hours a week by the end of the first term.\r\n\r\nFull time students attend the university on:\r\n \r\n* Thursdays \r\n* Fridays\r\n\r\nAnd your teaching placement days are:\r\n \r\n* Mondays\r\n* Tuesdays\r\n* Wednesdays.\r\n\r\n","personalQualities":"","otherRequirements":"* Fitness for practice check.\r\n* Disclosure and Barring Service (DBS) check.\r\n","status":1,"createdAt":"2021-07-06T10:48:48.015Z","updatedAt":"2021-09-24T10:43:41.664Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
