{"id":"35dd1d75-ea4b-45a0-9b5a-d48861acc789","name":"English","code":"258Q","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3aed1aa8-ae46-4b68-92bb-a6cc20655c59","code":"Q3","name":"English"}],"locations":[{"id":"2c0080df-6c88-4be7-94c1-5f705a47a7fe","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"5ad487c0-1798-4965-809e-2bd909a569ed","code":"1EH","name":"Seven Kings Learning Partnership"},"accreditedBody":{"id":"2e1ce675-b5df-42ab-bb63-1e0435ef5722","code":"E28","name":"University of East London"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"UEL accept A star Equivalency","courseLength":"OneYear","feesUK":9250,"financialSupport":"Bursaries and scholarships are available for certain courses. Please see\r\nhttps://getintoteaching.education.gov.uk/funding-my-teacher-training/bursaries-and-scholarships-for-teacher-training\r\n","aboutCourse":"This is a one year course in which you will have lectures at university and then two teaching practices at two different schools off site.\r\nAssessments are a mixture of written assignments set by the university and lesson observations and teaching practice assessment forms whilst at school.\r\nWe work in partnership with UEL to provide an excellent start to your teaching career.\r\nSeven Kings School is recognised by Ofsted as an Outstanding school and the Teaching Alliance consists of several outstanding schools.\r\nSeven Kings has an awarded \"Cradle to Grave\" programme of support for all teachers of all stages in their careers.\r\n\r\n","interviewProcess":"The candidate will be interviewed by teaching staff from alliance schools. They will be asked to prepare a lesson plan and discuss it as well as working with students and be interviewed.\r\n UCL carries out second interviews on the Tuition Fee Secondary route only.","howSchoolPlacementsWork":"Candidates will be placed across the alliance within schools who have an excellent track record of support supporting students.\r\nThe alliance covers 4 - 19 provision with an opportunity to visit special schools.\r\nThe candidate will have two placements across the alliance spending approximately one term in each placement. They will start observing lessons and then taking small sections within the lessons before taking complete lessons and building up their timetables.\r\nSupport will be given through professional studies sessions and through mentoring.","personalQualities":"We are looking for people who are passionate about making a difference to young people's lives.","otherRequirements":"This is subject to the relevant criminal checks and verifying qualifications","status":1,"createdAt":"2021-07-12T13:49:24.413Z","updatedAt":"2021-09-27T13:46:38.069Z","canSponsorStudentVisa":"yes","cycle":"2024"}
