{"id":"aa019760-7c98-45a6-9c55-f0dd7467b5a4","name":"Primary","code":"2QQJ","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"2c0080df-6c88-4be7-94c1-5f705a47a7fe","name":"Main Site","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"5ad487c0-1798-4965-809e-2bd909a569ed","code":"1EH","name":"Seven Kings Learning Partnership"},"accreditedBody":{"id":"2e1ce675-b5df-42ab-bb63-1e0435ef5722","code":"E28","name":"University of East London"},"english":"3","maths":"3","science":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":null,"aboutCourse":"This is a one year course in which you will have lectures at university and then two teaching practices at two different schools off site. \r\nThe majority of your time will be with your principal employer.\r\nAssessments are a mixture of written assignments set by the university and lesson observations and teaching practice assessment forms whilst at school.\r\nWe work in partnership with UEL in providing an excellent programme in your route to becoming a teacher.\r\nSeven Kings School is recognised by Ofsted as an Outstanding school and the Teaching Alliance consists of several outstanding schools.\r\nSeven Kings has an awarded \"Cradle to Grave\" programme of support for all teachers of all stages in their careers.\r\n\r\n","interviewProcess":"The candidate will be interviewed by teaching staff from alliance schools. They will be asked to prepare a lesson plan and discuss it as well as working with students and be interviewed.\r\nUEL will carry out an interview as well to confirm your suitability for the course.","howSchoolPlacementsWork":"Candidates will be placed across the alliance within schools who have an excellent track record of support supporting students.\r\nThe alliance covers 4 - 19 provision with an opportunity to visit special schools.\r\nThe candidate will have placements across the alliance spending approximately 4 to 6 weeks in the second placement with the rest of the time in the first placement. They will start observing lessons and then taking small sections within the lessons before taking complete lessons and building up their timetables.\r\nSupport will be given through professional studies sessions and through mentoring.","personalQualities":"We are looking for people who are passionate about making a difference to young people's lives.","otherRequirements":"This is subject to the relevant criminal checks and verifying qualifications.\r\nYou will need to have have worked for at least three years.","status":2,"createdAt":"2021-07-12T13:49:24.549Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"This will be on unqualified teacher scale 1"}
