{"id":"231240bf-1614-4f23-871e-842c9e865a33","name":"Primary","code":"3F66","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"trainingProvider":{"id":"9d175761-732d-477a-b9dd-0d85e70db7ef","code":"1VN","name":"St James’ Partnership"},"accreditedBody":{"id":"d6961000-f4b7-41cb-9dbd-4da057d9057d","code":"K84","name":"Kingston University"},"english":"3","maths":"3","science":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":null,"aboutCourse":"Throughout our School Direct programme, you will be based in the lead school (St James' CEP School) or  one of our partner schools, gaining first-hand experience of life as a teacher. Supported by your mentor and training sessions, you will develop your own teaching practice so that you are fully prepared to start your teaching career. Our training sessions are all based in schools, delivered by current practitioners and educational consultants.  The sessions are being delivered virtually and will continue to be due to Covid restrictions.  We work with you the trainee, and mentors to ensure that you have ongoing support with the teaching and learning in your classroom. Engaging with research is a celebrated method of improving teaching practice and this is promoted through your own small research project which you undertake in the final term of your training.\r\nAssessment against the Teaching Standards is made throughout the year and final assessment is based on your observations and evidence you have collected of meeting the Teaching Standards.\r\n","interviewProcess":"Interviews will involve a small classroom activity – often based around reading a book aloud – followed by an interview and English and Maths activities. The interview will last no longer than half a day.\r\nDuring the current pandemic, the interviews are being held virtually.","howSchoolPlacementsWork":"Throughout our School Direct programme, you will be based in one of our partner schools, gaining first-hand experience of life as a teacher. We are currently in partnership with five schools.\r\nYou will also complete a placement of four-six weeks in another school, gaining experience of a different setting and key stage.\r\n","personalQualities":"Trainees should have an enthusiastic and reflective approach to learning.\r\n\r\nTrainees should be passionate about teaching, and primary pupils","otherRequirements":"Within our partnership we expect applicants to have (or be planning to have) at least 10 days’ classroom-based experience.\r\nAll offers are also subject to an ehanced, and  Fitness to Teach checks.\r\n","status":2,"createdAt":"2021-07-06T10:52:18.631Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"Successful applicants will be employed as unqualified teachers either at St James’ or in one of the schools within our partnership and will be paid at point one of the unqualified teachers pay scale (Inner London). You will be employed for the whole academic year (September – July).\r\n\r\nThere are no fees for this course."}
