{"id":"a61e4e3c-02c6-4bfa-b07a-37d2e1c0d8ad","name":"Primary (5-11)","code":"25YM","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"e99a598d-5f75-4db8-a2dc-6b48fe011d0a","name":"Sheffield South East Learning Partnership","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"6e98194c-5d71-4ea1-93c1-1f30eda695f0","code":"1N7","name":"Sheffield South East Learning Partnership (SSELP)"},"accreditedBody":{"id":"899178cc-20a7-4df5-951a-ee83c1b3d4d1","code":"S21","name":"Sheffield Hallam University"},"profPost":"BO","degreeGrade":"2","english":"2","maths":"2","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"Please refer to https://www.equivalencytesting.com/establishments/","courseLength":"OneYear","feesUK":9250,"financialSupport":"Financial support is available to you. You could receive tuition fee loans and maintenance loans to help fund your training. \r\n\r\nTo find out more visit GOV.UK and use the student finance calculator to estimate student loans and extra funding that may be available to you.\r\n\r\nAlso visit Sheffield Hallam University student finance for excellent support and information at www.shu.ac.uk.\r\n","aboutCourse":"This SSELP School Direct primary course (25YM) is for graduates who are passionate about training to teach primary school pupils in both Key Stage 1 and Key Stage 2.  At the end of the course you will be qualified to teach across the primary phase and be prepared to teach all subjects across the primary curriculum.\r\n\r\nYour course will consist of:\r\n\r\n120 plus days in School based training days, across 2 consecutive age-phases, which will take place in SSELP School Direct schools.\r\nTaught Training days led by skilled practitioners at SSELP SD.\r\nSeminars and lectures led by Sheffield Hallam University. (2 masters assignments)\r\n\r\nThis one year PGCE primary course is divided into 2 sections: \r\n \r\nThe first part, from September to December, consists of school based professional practice in your first placement school.  Your week will be comprised of: 3 days of school based training, 1 day at a SSELP SD taught training day and 1 day at Sheffield Hallam University.  However, for some weeks of your training you will be in school full time.\r\nThe second part from January to June, consists of school based professional practice in your second placement school. Here, you will attend a different SSELP SD school as well as attend the SSELP SD training days and university and have the opportunity to visit a Secondary School and a Special Needs provider.\r\n\r\nCourse support:\r\n\r\nDuring the course you will be allocated one of our highly trained and skilled mentors who will guide and support you through the school based training element of the course. You will also be provided with an experienced SHU academic adviser who will offer support with your academic studies including your 2 masters’ assignments. Further support will come from your SSELP SD course lead, SHU course lead and a university Link Tutor.\r\n\r\nCourse assessment:\r\n\r\nYou will complete 4 review point assessments during your school placements. These assessments are completed with your mentor and are quality assured by your SSELP SD course lead and your University Link Tutor. You will need to demonstrate that you have met all the Teaching Standards to successfully complete the course.\r\nYou will also need to complete 2 masters’ level assignments together with academic assignments. \r\n\r\nQualifications:\r\n\r\nYou will be awarded a Post Graduate Certificate of Education (PGCE) together with Qualified teaching Status (QTS) with master's credits (60 credits).\r\n","interviewProcess":"You will need to apply through Apply. Simply look for Sheffield South East Learning Partnership (SSELP) or search for code 1N7. Next, you will need to select the course you would like. If you would like to teach primary school pupils aged 5 – 11 years (KS1 and KS2) look for the course code 25YM\r\n\r\nOnce we have received your application it will be reviewed at a SSELP School Direct short listing meeting and if successful, you will be invited to attend an interview.\r\n\r\nThe interview process consists of a short 20 minute teaching activity and an interview. The interview panel will be made up of a minimum of 2 SSELP senior leaders.\r\nThe outcome of the interview process will be communicated to you within 24 hours by a phone call and by email. UCAS will then be updated. \r\n\r\nDue to the Coronavirus changes have been made to the interview process:\r\n•\tInterviews will take place on line\r\n•\tID and qualification documentation will be required before the online interview.\r\n•\tPlanning for a teaching session will be requested. No teaching session with pupils will take place.\r\n\r\n\r\n","howSchoolPlacementsWork":"All SSELP School Direct schools are geographically close together, located in the South East area of Sheffield. This means that distances you need to travel between schools and Sheffield Hallam University will always be relatively short. \r\n\r\nSSELP School Direct is comprised of 18 schools: 14 primary, 1 special school, 1 Early Years school and 2 secondary schools. You will be allocated your first school place in the summer term before you start your course and you will have the opportunity to meet other students on your SSELP School Direct course, your school based mentor and classroom teacher, and visit your Home school before the start of the summer holidays. This means that you will feel well prepared before starting in September. \r\n\r\nSchool placements are only finalised after talking to you about your requirements and training needs. We then select the best school to meet your needs and inform you and the schools before the summer holidays.\r\nThe school placement works on an AB pattern. You will spend the first part of your course, up to December, in your first school and the second part of your course, from January to June, in a different school and a different key stage.\r\n\r\n You will be required to experience both Key Stages so each school placement will be in a different key stage. In total you will spend over 120 days in school. The remainder of the course will be split between Taught Training days at SSELP School Direct and lectures and seminars at Sheffield Hallam University. After completion of your course you will spend one week in your employing school and this is referred to as the NQT week. \r\n","personalQualities":"We will be looking for people who can demonstrate a passion for training to teach in the primary sector. Students need to understand, to some extent, what teaching is all about. We are looking for energetic, inspirational, dedicated and hard-working individuals who want to enter teaching because they want to make the lives of the young people in our community, better. \r\n\r\n","otherRequirements":"You will be required to produce your academic qualifications, provide personal identification documents and complete a criminal record check (CRB) before you can gain full enrolment onto the course.","status":1,"createdAt":"2021-07-06T10:48:16.887Z","updatedAt":"2021-09-07T13:21:19.306Z","canSponsorStudentVisa":"no","cycle":"2024"}
