{"id":"e8d2aa06-eca2-4152-938e-ae6f1710d694","name":"Primary (Special Educational Needs)","code":"266P","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"yes","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"765c85e0-184b-46b6-a8d4-d4eda82efa54","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"c9370017-9010-4ff5-a231-c4ce72fefd10","code":"1PS","name":"Innovation Teacher Training"},"accreditedBody":{"id":"3f5b1139-3651-4ee5-845c-54cd9e999b08","code":"C58","name":"University of Chichester"},"profPost":"BO","degreeGrade":"0","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"The University of Chichester will be able to give details about the acceptable equivalency tests","courseLength":"OneYear","feesUK":9250,"feeDetails":"If applicable, finance may be organised through the Student Loans Company.","aboutCourse":"This is a full time course, starting in September and finishing in July.  You will be placed in a School for children with Special Educational Needs for the first term, the second term is in a Mainstream primary School and the third term back in the Special School.  \r\nThere are five weeks at the University of Chichester, (three weeks in the first term and two weeks in the second term).  In addition there is alliance training which is usually one day a week.\r\nTeaching load builds up over the course and in the final half term the work load is similar to a Newly Qualified Teacher. \r\nAssessment is on-going throughout the year.  In addition there are three essays to complete, one in each term","interviewProcess":"The interview will consist of a short activity in a class of mixed ability primary children.  Followed by a written task.  Finally there will be an interview.  On the panel there is likely to be the Headteacher, Deputy Headteacher and a representative from the University of Chichester.","howSchoolPlacementsWork":"School placements are organised by the Teaching School, we try to place students as close to their home location as possible.  \r\nTerm 1 is in a Special school, Term 2 is in a mainstream primary school.  Term 3 is back in the same special school as Term 1.","personalQualities":"Experience of working with children is an advantage.\r\nFlexibility, creativity and enthusiasm for the profession","otherRequirements":"Enhanced DBS checks will be undertaken.","status":1,"createdAt":"2021-07-06T10:52:21.431Z","updatedAt":"2021-10-05T10:34:11.234Z","canSponsorStudentVisa":"yes","cycle":"2024"}
