{"id":"a855ed7b-527c-4700-8569-309853a6f527","name":"Primary","code":"2P5D","qualification":"pgce_with_qts","startDate":"2024-07-31T23:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"b5733faf-73d2-47cb-a049-0790b87ffa26","name":"Woodlands Primary","isPublished":"Y","status":"R","vacancies":"F"},{"id":"e99beedb-0d18-48a6-a005-8cc60dd91d78","name":"Stoenydelph Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"cada1e10-a085-427c-a3ff-9217aefd8fd9","name":"Chadsmead Primary Academy","isPublished":"Y","status":"R"},{"id":"2d5f8d92-dc2a-4157-a7f5-aae5d49c0dce","name":"Higham Lane School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"d2660bc7-1eb5-4843-b0e7-75130311c113","name":"Birchwood Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"8333cc02-74ea-47ee-a82b-2da4843d95e7","name":"Dordon Community Primary School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"88818811-ee89-4673-a28f-10329da211a3","code":"17B","name":"CAT Institute of Education"},"accreditedBody":{"id":"ef09ce50-ccfc-4346-a0ce-43e840153dab","code":"W20","name":"The University of Warwick"},"profPost":"BO","degreeGrade":"0","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feeDetails":"Maintenance grants are available to support living costs during the training year for Home students in England. These are available to trainees whose total household income is less than £42,600. To check eligibility and to apply visit (https://getintoteaching.education.gov.uk/funding-and-salary/overview) \r\n\r\nHome and EU students may be eligible for a tuition fee loan to cover the costs of the course. \r\n\r\nHome students in England may be eligible for a student maintenance loan to help towards living costs and accommodation. \r\n\r\n","aboutCourse":"Our Vision:\r\n\r\nTo inspire children to become confident, secure, caring individuals who achieve personal success and develop a love of learning through ‘rich opportunities and memorable experiences’.\r\n\r\nOur Mission is to ensure that our pupils:\r\n\r\n-  Will be central to all we do.\r\n-  Will experience, developing a thirst for knowledge and becoming enthusiastic, independent learners.\r\n-  Will be highly literate, numerate and articulate.\r\n-  Will build self-discipline, and a sense of pride and respect for themselves and others.\r\n-  Will be highly adaptable to change, equipped for life in a sophisticated and technological society.\r\n\r\n\r\n\r\n","interviewProcess":"Potential to Teach\r\nYou should demonstrate high expectations for your pupils, be passionate about your subject and engage your pupils. \r\n\r\nPotential to Reflect\r\nYou should be able to reflect on all aspects of your planning and teaching so that you can constantly update and amend lessons accordingly to further improve your performance and delivery. \r\n\r\nInterview Process\r\nWhilst every effort will be made to accommodate your choice of campus, staffing capacity changes and for this reason your application may also be circulated to other schools within the partnership.  It may be that several schools will express interest in you.  This method ensures you have an increased opportunity of a successful outcome. \r\n\r\nYou will usually be invited to interview where you will be asked to teach a  20 minute learning activity to a class of pupils. \r\n\r\nFollowing the learning activity, you will have an interview with the Professional Mentor and Head of Department.  Some schools may ask you to take part in a Student Panel, or to undertake an activity involving students, you may be asked to produce a lesson plan.  \r\n\r\nIf all goes well, you will be told the decision and the UCAS website will be updated accordingly. \r\n\r\n","howSchoolPlacementsWork":"The major benefit of School Direct is being able to select the school in which you are going to do the majority of your training.  This choice is often influenced by location and distance travelling from home.\r\n\r\nUsually you will spend most of your time at your base school, with call back days at your university .\r\n\r\n\r\nYour complementary placement takes place after Christmas, and is usually set up within the partnership schools and in many cases will be a straight swap between schools.  All the schools within the partnership are within a 30 minute drive of The Polesworth School, which is the Lead School within the Partnership.\r\n\r\nAs well as your university mentor, you will have access to a professional mentor and subject mentor at your base school.  You will have support every step of the way and will not be expected to fly solo until you feel you're ready to do so.  The expectation is that by the time you finish your course you should be teaching around 70% of a teacher's full timetable.\r\n\r\nYou will also be required to undertake a number of written tasks set by the university that will contribute towards a Masters Degree should you wish to complete one. Also, you will be collecting evidence throughout the year to complete your personal learning portfolio which you will use to demonstrate your learning journey. ","personalQualities":"We are actively seeking good quality honours graduates with excellent communication skills; who have the ability to enthuse young people about their chosen subject; are able to demonstrate resilience and who are self-starters with the ability to use their initiative.  ","otherRequirements":"Whilst not a necessity, recent, relevant school experience, or experience of working with young people, is strongly encouraged.  We offer Taster Days and School Experience across most subjects.\r\n\r\nThe successful candidate will need to satisfy the necessary safeguarding and prohibition checks and satisfy the HEI provider that they are proficient in maths and English skills prior to QTS being awarded.\r\n\r\n","status":1,"createdAt":"2021-07-06T10:47:00.952Z","updatedAt":"2021-07-09T13:36:39.405Z","canSponsorStudentVisa":"yes","cycle":"2024"}
