{"id":"a61d857b-f992-4d92-bdeb-7f4fb92cb38a","name":"Primary","code":"C890","qualification":"qts","startDate":"2024-06-30T23:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"TA","fundingType":"apprenticeship","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"e4f2eb65-6ca4-4e02-901b-a83c45868242","name":"Ramsey Spinning Infant and Junior School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"d850c58c-e235-4af1-8f3a-ee34461186e4","name":"Castle School","isPublished":"N","status":"S"},{"id":"027da6b0-3af3-4461-a208-ee28d17a9787","name":"Newnham Croft Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"1f374ca3-9fdd-4f76-a5a8-c6df96dee2fb","name":"The Trumpington Federation","isPublished":"N","status":"S"}],"trainingProvider":{"id":"014a7660-3627-4806-a003-be517c3b2938","code":"1DT","name":"CMAT West Town Primary"},"accreditedBody":{"id":"828d1c59-36a8-4678-9a60-662565ae7172","code":"C03","name":"The Cambridge Partnership"},"degreeGrade":"9","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"Please note: those applicants meeting the required standard by taking an approved equivalence test (please contact TCP for a list of approved providers), will also need functional skills qualifications or equivalent qualifications at level 2 in mathematics and English to meet the apprenticeship gateway entry criteria.","courseLength":"OneYear","feesUK":null,"aboutCourse":"The Apprenticeship programme is Year 2 of the internship programme. This course is designed for schools who have a member of staff who they feel is suitable to gain QTS via the Apprenticeship route. You will need the support of your employing school to be eligible to apply for this course. \r\n\r\nThe course commences on 1 July, after which there will be 2 training days before the end of term, with readings to be completed prior to the professional training days which commence in August. \r\n\r\nOn the course you will be in school four days a week and follow a central training programme on Fridays, which augments your subject knowledge for teaching and your general professional development.\r\n\r\nDuring the course you will receive strong support from TCP in the form of a Subject Specialist Tutor (secondary) or a Phase Manager (Primary).  Well-being of trainees is crucial and we have developed a strong mechanism to support trainees in this respect.  A qualified counsellor is available at no cost to you.\r\n\r\nOver the course you will produce an e-portfolio of evidence, monitored by TCP and your school(s).  You will also have assignments to complete and your teaching will be observed regularly, with feedback to ensure strong classroom practice.","interviewProcess":".","howSchoolPlacementsWork":"Your school placement will be in your employing school for the duration of the course. You will also be required to undertake a contrasting school placement  for 15 consecutive Friday during the Spring and Summer terms.","personalQualities":"","otherRequirements":"To be eligible for application, candidates must have the support of the employing school and have completed an eligibility application via the Local Authority.","status":1,"createdAt":"2021-07-06T10:48:20.949Z","updatedAt":"2021-11-30T10:55:19.586Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024"}
