{"id":"07978d9f-f788-459b-a85a-9646969c6414","name":"Drama","code":"2ZHF","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"69052223-ca45-4781-a8d3-cb92447a6d78","code":"13","name":"Drama"}],"locations":[{"id":"0f7c9fb9-960f-48f9-adaf-df8f765d1ddd","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"45903ed3-aaa8-40df-aac0-0196cd7b5905","code":"2CZ","name":"ATT Partnership"},"accreditedBody":{"id":"af388cc3-644a-4fd3-bd71-55503b74fc21","code":"B22","name":"University of Bedfordshire"},"profPost":"BO","degreeGrade":"1","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Candidates without a GCSE grade C/4 or higher, will be required to sit an equivalency test, provided by a third party","courseLength":"OneYear","feesUK":9250,"aboutCourse":"This course involves spending 4 days a week in a placement school and one day a week at the University of Bedfordshire. Over the course of the training year you would gain experience in 2 placement schools.  Full information regarding the academic study element and essay requirements can be found on the Initial Teacher Training section of the university website.","interviewProcess":"Interviews take place initially at the university where candidates will find out further information about the course and be interviewed by members of the partnership. In addition candidates will visit the lead school, Mildenhall College Academy, to meet key staff.","howSchoolPlacementsWork":"Placements will be allocated based on capacity but will also take into consideration the geographical location of trainees. Trainees will get the opportunity to teach from 11-18 at secondary and early years to year 6 at primary level.\r\n\r\nIn total there are 6 schools in our partnership but we also work with a number of other schools in the area to support initial teacher training.\r\n\r\nCandidates will have 2 placements, one for the Autumn term and one in a different school for the Spring/Summer terms.","personalQualities":"Applicants should have gained some experience of working with children or in education. We are seeking highly motivated individuals with a passion for their subject and in making a difference to the lives of the young people and communities we serve. Being a team player as well as being able to work on your own initiative is important and a good sense of humour is key! ","otherRequirements":"An enhanced Disclosure and Barring Services (DBS) check and all other safeguarding checks required at the time of application.\r\n\r\nTo have IELTS with an average score of at least 6.0 if your first language is not English and you do not have GCSE grade C in English.\r\n","status":1,"createdAt":"2021-07-06T10:54:34.337Z","updatedAt":"2021-08-27T16:39:56.262Z","canSponsorStudentVisa":"yes","cycle":"2024"}
