{"id":"6c013788-256f-4e90-b81b-258d06260a94","name":"Primary","code":"2Q3G","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"15d09676-a360-4918-84e7-e72f1c87d522","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"f63e2e67-93bd-4343-8016-5ccaaa62f12c","code":"27K","name":"Aspire Education Alliance"},"accreditedBody":{"id":"049fe65f-08dc-4686-9ac8-606dce490128","code":"G56","name":"Goldsmiths, University of London"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","aboutCourse":"The School Direct PGCE (QTS) programme has three distinct modules. These are: \r\n\r\n* School Experience  \r\n* Studies and Professional Issues in Education \r\n* Curriculum Studies \r\n\r\nSchool Experience \r\nOutline how School Experience works in your context \r\nYou will spend approximately 6 weeks of the programme in University. In this time you will have mix of lectures and small group seminars to support you in developing a strong and confident knowledge of the subjects you will be teaching in the primary classroom. Underpinning the programme is the Professional Studies course which is designed to prepare you fully for the wider roles and responsibilities of the teacher. \r\n\r\nThe Primary PGCE (QTS) Programme is taught and assessed at Masters Level. In addition to a recommendation for QTS, if you pass all academic elements of the programme, you will also leave with level 7 credits equivalent to one third of a master’s degree. Full academic support is provided to ensure you are fully prepared for assessment regardless of your prior experiences. \r\n\r\nStudies and Professional Issues in Education (SPIRE)  \r\nThe SPIRE module focuses upon issues that most impact upon the young person’s experience of education in the 21st Century.  In sessions you will be asked to: consider a range of issues relating to diversity and inclusion; engage with research and policy and link all of this to your own experience in the classroom.  In your written assignment you will choose one area from this module to reflect upon more deeply. \r\n\r\nCurriculum Studies  \r\nFor students following a School Direct pathway this module will focus specifically upon Learning Theory and will ask students to reflect upon the impact that research in this area has on the policy and practice of their school.  \r\n","interviewProcess":"The interview panel will normally consist of two people, one person from the Lead School (where the interview is taking place) and one person from Goldsmiths.\r\nThere will be a number of steps to complete as part of the interview which includes a small group task and the face-to-face interview. You will have plenty of opportunities to ask questions specifically about the PGCE Programme and school placements.  ","howSchoolPlacementsWork":"The Primary PGCE Programme offers you the opportunity to specialise in one of three age phases. These are: \r\n\r\n* 3-7 ( with placement in Early Years Foundation Stage and Key Stages 1)\r\n* 5-11 (with placement in Key Stages 1 and 2) \r\n* 7-11 (with placements in Upper and Lower Key Stage 2). \r\n\r\nYou will be asked at interview to select the age phase you are most interested in working with. \r\n\r\nYou will be based in your 'host school' from the first day of term and spend the training year in the same class, except from approximately six weeks which is spent in your second placement school. The second placement will be in a different school in a contrasting  primary age phase- or in a mainstream setting if your host school is a Special school.\r\n","personalQualities":"We are looking for applicants that have an understanding of the nature of working in urban settings and a have a clear commitment and enthusiasm for working with children. \r\nYou must be able to show resilience and be willing to work with others. ","otherRequirements":"You do not need to have extensive school experience before applying but we do ask that you spend a minimum of 5 days in a primary school in the last 5 years to ensure that you are fully aware that the profession is right for you. \r\n\r\n","status":1,"createdAt":"2021-07-06T10:53:38.498Z","updatedAt":"2021-09-30T10:58:06.104Z","canSponsorSkilledWorkerVisa":"yes","cycle":"2024","salaryDetails":"As a salaried trainee your salary will be calculated using the the unqualified teachers' pay scales. Your host school will pay the university fee."}
