{"id":"adfb4415-fda2-4243-aaeb-81ae909deb75","name":"Design and Technology","code":"W9X1","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"118fabd7-86d0-4a40-9e9a-e5c302abe59b","code":"DT","name":"Design and technology"}],"locations":[{"id":"659d6384-2780-4a78-93c6-5d150a796437","name":"Bath Spa University","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"4a3dc1e3-2ee8-496d-85d1-b5d9f9eae94f","code":"B20","name":"Bath Spa University"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":13910,"feeDetails":"Please note the fees above are for the PGCE in 2021/22. The 2022/23 fees are subject to review by government and will be published in January 2022.\r\n\r\n","financialSupport":"Bath Spa University offer bursaries to PGCE students who are eligible for Home student funding. Please visit [Bath Spa University PGCE Bursary](https://www.bathspa.ac.uk/students/student-finance/scholarships-and-bursaries/bath-spa-university-pgce-bursary/) for further information.","aboutCourse":"Our four key principles of collaboration, critical thinking, creativity, and care form the foundation of our practice and partnership. They are interwoven through all aspects of our curriculum and across university and school training. They form the basis of our commitment to social justice.\r\n\r\nThe Bath Spa ITE Partnership Curriculum is an ambitious curriculum which has been developed with our Partnership Schools. It is a carefully sequenced and integrated curriculum which comprises 8 components:\r\n \r\n*Professional behaviours and responsibilities\r\n*Subject, pedagogical and curricular knowledge\r\n*How pupils learn\r\n*Planning for Learning\r\n*Adaptive teaching and inclusion\r\n*Assessment of pupils\r\n*Managing behaviour and the environment for learning\r\n*Pupil health and wellbeing\r\n\r\nThroughout the programme you will gain, apply and refine your knowledge of teaching, pedagogy and classroom skills. A blended approach to learning has been adopted which provides face to face teaching as well as time to access key materials online. Opportunities exist for you to meet and learn from current classroom practitioners ahead of school placements.\r\n\r\nAs part of your academic award you will undertake two assignments which will contribute 60 credits towards a Masters award. These assignments are informed by the relevant research literature and theories that will complement and enrich your professional practice whilst enabling you to develop your subject expertise.\r\n\r\nIgnite their creativity. Make ground-breaking ideas a reality. In a world where technological innovations appear every day, Design and Technology has never been more relevant.\r\n\r\nOn this hands-on programme you’ll develop your knowledge across all\r\naspects of Design and Technology, with a focus on a specialism of your\r\nchoice. Choosing from Textiles Technology, Resistant Materials (wood, metal and plastics), ECT (Electronics and Communications Technology) or Food Technology, you’ll be trained in a variety of practical sessions using state-of the-art facilities and the latest materials, components and ICT applications.\r\n\r\nWe’ll also ensure you become the most well-rounded teacher that you\r\ncan be. While working with subject specialists, you’ll take part in group\r\nsessions on the wider role of the teacher, including how to create a safe learning environment, how to manage behaviour effectively, and how to plan exciting and engaging lessons that will breathe life into your students’ love of the practical world. ","interviewProcess":"The interview is your opportunity to demonstrate your desire to become a teacher and to enrich the lives of young people. Interviews will be carried out online and early application is highly recommended.\r\n\r\nYour application will be reviewed by an Admissions Officer and a member of the Secondary PGCE team. If you are successful you will be offered an interview date. You will be asked to:\r\n\r\n*Complete a Subject Knowledge Audit \r\n*Read a text about a current educational issue that you will be asked to summarise and discuss with an academic tutor.\r\n*Prepare a subject presentation\r\n\r\nDuring the interview day, you will be welcomed to the interview by a PGCE Programme Leader who will provide a detailed introduction to the PGCE with QTS Programme and answer any questions you may have.\r\n\r\nIndividual interviews are conducted by academic tutors and  colleagues from school who have expertise in the subject you have chosen to study. The individual interview lasts around 20 minutes.\r\n","howSchoolPlacementsWork":"Bath Spa Teachers (BSTs): The Partnership believes that from the start of your journey to be a well-educated and highly skilled teacher you are a ‘professional teacher in training’. In recognition of this, you will hold the identity of a BST, rather than a trainee. You will embrace the professional qualities and attributes expected of a professional teacher, and colleagues who train you will respect this status.\r\n\r\nPlacements: During your PGCE you will experience a range of school settings that help you to develop your understanding of life in a secondary school and to support you on your journey to becoming a teacher. The university will arrange two teaching placements in secondary schools and a short placement in a primary school. During your course you may also gain experience from other school contexts arranged by your academic tutor.\r\n\r\nEach secondary placement starts with familiarisation weeks to give you time to get to know the school context and its routines as well as the colleagues you will be working with. You will also be provided with a timetable that will enable you to build up your teaching experience, develop your skills and also learn from other education professionals each week.\r\n\r\nThroughout your school placements you will continue to be supported by your academic tutor and you will meet regularly with them. During your placements you will be allocated a school training mentor; each school also has a Lead Trainer who will oversee your experience within the school setting. You will meet formally with your school training mentor each week to discuss your learning, you will also be provided with regular feedback on your progress.\r\n\r\nSchool training mentors and Lead Trainers are provided with training each year. This ensures that they are aware of all requirements of your PGCE with QTS training and also the systems that support it. The university and Partnership schools work together on the ITE Partnership Curriculum to ensure all aspects of your training are carefully integrated and sequenced.\r\n\r\n","personalQualities":"You’ll need to be well suited to the teaching profession both personally and academically. We look for people with a committed professional approach and an exceptional work ethic. You’ll need to be organised, flexible and unflappable, as well as being able to communicate, interact and relate well to everyone. When entering the teaching profession, having strong emotional resilience and a sense of humour will give you the edge.\r\n\r\n","otherRequirements":"During your training with us, we will implement, support and assure your competency in Fundamental English and mathematics, as required for the award of Qualified Teacher Status (QTS)\r\n\r\nFitness to train to teach check to ensure you are medically fit to take a teacher training course.\r\n\r\nDisclosure and Barring Service (DBS) checks – this is the Government scheme, to enable the identification of people who are barred from working with children and vulnerable adults. For more information visit: [gov.disclosure-barring](www.gov.uk/disclosure-barring-service-check)\r\n","status":1,"createdAt":"2021-07-06T10:50:09.223Z","updatedAt":"2021-10-01T16:00:46.081Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
