{"id":"d79a9c6e-e2b6-4ee9-9ced-57d09f404e4a","name":"Primary","code":"N316","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"6b916dc2-29ba-4b2e-9321-b0b10807d692","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"e5b8e187-ccc1-4253-9dd0-376d6abf7e66","code":"2EY","name":"Exceed SCITT"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We ask candidates to use a third party for the equivalency tests and we would recommend they use Equivalency Testing. (https://www.equivalencytesting.com/)","courseLength":"OneYear","feesUK":9250,"feesInternational":9250,"feeDetails":"Trainees need to consider how they transport themselves from their training school to the training venues across either Bradford/Keighley or Leeds. Some of our SCITT Trainee Teachers often car share, reducing travel costs. Having said this please remember that our partnership of schools are geographically situated close to each other. ","aboutCourse":"This course will train you in the 5-11 age range (Key Stage 1 and Key Stage 2). \r\nYou'll be awarded Qualified Teacher Status (QTS) by Exceed SCITT and a Post Graduate Certificate in Education (PGCE) by a University. \r\nApplicants should select whether they would like to train at our Leeds Hub (L) or our Bradford Hub (B) when applying through UCAS.\r\n\r\nAs an Exceed SCITT Teacher you will be part of its vision and values.  They are based upon 3 key words;\r\nInspire . Care . Excel .\r\n-Providing the opportunity to work in the most exciting, innovative and forward thinking schools across West Yorkshire\r\n-Inspirational training for aspirational teachers and a genuine commitment to professional learning and evidence based practice through its Teaching schools\r\n-Putting the pupil at the heart of teacher training and trainees at the core of our care\r\n\r\nOur unique programme maximises your time in school and classrooms.  Even the PGCE is drawn directly from your work in school and is not a separate taught course.  Our programme design is innovative, with 3 clear strands: The National Curriculum, so that you develop strong subject knowledge and teaching strategies to ensure pupil’s make good progress. Professional Practice, such as inclusion and effective behaviours for learning so that you are confident to meet the needs of all children in your class. Your personal well-being is also important to us so the programme includes mindfulness, positive psychology and developing resilience. \r\nTake a look at our Bradford and Leeds schools on the Exceed SCITT website:\r\n(https://www.exceedscitt.co.uk)\r\nFor more information on our other training providers in Leeds visit:\r\n(http://www.westerton.leeds.sch.uk/teacher-training) and (https://www.pathwayspartnership.co.uk/). Our twitter page is @ExceedSCITT and @WestertonSDITT.\r\n\r\nIf you're wanting to train to be a teacher to make a difference to children’s life chances, there is no better place to train than in our diverse partner schools. We can offer you opportunities and experiences that very few providers can. Our partnership of schools is an amazing place to train.\r\nThe Exceed partnership consists of schools working together to support each other, including training new teachers to potentially employ in our partner nursery, primary and special schools.\r\n","interviewProcess":"Make sure that your application is clear and grammatically accurate. We are looking for your potential as a trainee teacher, not for someone who is already an experienced teacher. \r\n\r\nIn your personal statement you might want to cover the following aspects, which we offer as a guide only.\r\nYour reason for wanting to teach, why primary? \r\nWhich phase of learning are you most interested in, e.g. EYFS, KS1 or KS2.\r\nYour vision for education and your commitment to young people in Bradford and Keighley or Leeds. \r\nWhat was your 'wow moment' when you knew teaching was the career for you? \r\nAny other relevant and transferable skills/experiences that can be related to teaching. \r\n\r\nYou will be invited to interview at one of our partnership schools where you will be made very welcome. You will be given a tour of the school and an opportunity to talk to some of our NQTs or current SCITT Teachers training with us. This way you really can find out about our programme! You will have an opportunity to lead a short teaching episode based upon a children's book and a 30 minute individual interview. This way we really get to know you and you get the opportunity to find out how our partnership supports you to be the best teacher that you can be.  \r\n","howSchoolPlacementsWork":"You are in school all the time.  In fact, even when you are working on the academic parts of the programme this is supported by a Tutor from the providing University who comes to one of our schools to work with you.  \r\nAll of our partnership schools are 100% committed to your training, so it really doesn't make a difference which schools will be your Home school (where you do the majority of your training) or your Host School (where you have an opportunity to broaden you experience).  Geographically our schools are located close to each other and our partnership is very diverse, from large to smaller intercity schools, that are culturally and socio economically diverse. This course enables you to specialize in the 5-11 age range so your training will take place in Key Stage 1 and Key Stage 2 settings.  You will be trained in 2 different schools, however, the structure of the programme will enable you to get to know the whole partnership. This is because your training days are delivered by expert tutors who are also senior leaders within their schools and most of the training on Wednesdays and Thursdays takes place in their school.  Having an opportunity to see practice and meet children in a wide range of schools helps you to reflect on what is going to have the most impact upon your progress towards QTS and employment.\r\n","personalQualities":"Remember that we really try to get to know you as an individual at the interview so that you feel at ease and can evidence the personal qualities that you bring to the programme. It is your personal qualities that will help to make a significant difference to the educational life chances of the pupils in our partnership of schools.","otherRequirements":"Before starting the programme all applicants must be deemed suitable to train to teach so safeguarding checks will be undertaken. They must also demonstrate they are fit to teach so will need to complete a pre-ITT health questionnaire.","status":1,"createdAt":"2021-07-06T10:51:54.229Z","updatedAt":"2021-09-28T09:25:20.728Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
