{"id":"da035fde-dc29-41ab-8af3-269f59a5e58b","name":"History","code":"33TQ","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"5a3609a0-5bbb-4377-b919-5d89932ab622","code":"V1","name":"History"}],"locations":[{"id":"60fbac55-a71b-4573-9cf9-0b561fdbfd10","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"bb7039c6-8e6c-4007-a44f-e3ae6b0163d0","code":"1A1","name":"Moor End Academy"},"accreditedBody":{"id":"b0223445-3531-47a6-81b0-839f90b8335b","code":"2EX","name":"Huddersfield Horizon SCITT"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Equivalency Test Assessment to be financed by the candidate.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Our trainees are based in a school four days a week and will attend the SCITT's Training Centre one day a week. Here they are given the theoretical understanding and the strategies in which to immerse themselves gradually but confidently in the school based experience. The Core training will include focusing upon: setting high expectations; behaviour management; lesson planning; assessment and data and meeting the needs of all learners.\r\n\r\nAs a Secondary trainee our trainees are given additional subject days in which they are taught the specific curriculum and pedagogy of their subject area. These sessions are tailored to cater for the specific demands of the subject but equally the areas which need to be developed as part of the trainee’s subject knowledge and application.\r\nTrainees will be in one main host school, September to July, with an additional placement in Spring 1 half term (January-February) and a week’s Special Education Needs placement. A great strength of the SCITT's provision is that it can adapt the programme to meet the needs and the areas of development for each trainee. The SCITT tracks the trainee’s progress  and then adapt the school experience and indeed the training based on the INDIVIDUAL trainee’s needs. \r\nTrainees are assessed against the Teachers’ Standards at the end of the programme. Over the course of the year, trainees will build a bank of evidence against the criteria in-order to support the judgement made by the mentor on a half termly basis. In addition, as part of the PGCE element of the programme (led by Sheffield Hallam Tutors but delivered at the Centre in Huddersfield) there are two assignments to be completed throughout the course of the year:\r\n1.\tReflecting on Pedagogical Approaches (5000 words)\r\n2.\tExploring Professional Development through Collaborative Enquiry (5000 words)\r\nTrainees will be supported fully through the online and centre based resource system, including the support network of mentor and tutor.\r\n","interviewProcess":"Once we receive your application we will assess it against the shortlisting criteria. If the application meets the criteria then we will invite you to an assessment. \r\n\r\nThe assessment usually takes half a day (depending upon the number of interviewees on the day) and will involve:\r\n\r\n1. A Teaching and Learning activity involving students. \r\n2. A formal interview (focusing upon your understanding of the curriculum, assessment, behaviour management; safeguarding etc...)\r\n3. A subject knowledge assessment given to you on the day\r\n4. An English and mathematics assessment on the day.\r\n\r\n\r\nThe purpose of the assessment activities above is to assess:\r\n\r\n*Your engagement with young people\r\n*Your passion for your subject/teaching and learning\r\n*Your current understanding of teaching and learning and the workings of a school\r\n*Your level of resilience\r\n*Your subject knowledge \r\n\r\nFrom the assessment we then make a decision on whether we are to offer you a conditional place and if so, what support we need to offer in advance of you starting the programme.\r\n","howSchoolPlacementsWork":"We have a number of different schools within our School Direct partnership and therefore we work closely with the schools when making a decision on the trainee's placement. This will involve liaising with the school to identify what they need but equally looking at the trainee's qualification, experience and skill set to see what they can offer. As a School Direct partnership the schools are looking at succession planning and being able to grow their own teachers for the future.\r\n \r\nOur Primary  programme covers the age range of 5-11 and our Secondary programme covers the age range of 11-16. \r\nAs a trainee you will be in a main host school from September until July and we feel this placement is incredibly important in building the incredibly important relationships with children and colleagues. With this year long placement (apart from half a term in a contrasting setting and for Primary a different phase) you will have the opportunity to be a member of staff within the school, to build the all important relationships and to see how a school cycle works.\r\n\r\nIn addition, you will have experience in pre and post phase settings and we pride ourselves on our additional SEND placement working very closely with Castle Hill Specialist School in Huddersfield to organise such placements. We feel it is incredibly important that as a practitioner you have the full knowledge and understanding of students with special educational needs and our SEND experience (including placements in Pupil Referral Units) allow you to have a real insight into the SEND provision and meeting the needs of all children. \r\n\r\nYour training will involve four days in a school and then a day's training at The Huddersfield Horizon SCITT's  fantastic new training centre:(https://huddersfieldhorizon.com)","personalQualities":"* Excellent subject knowledge\r\n* A passion for teaching and commitment to the profession as a future career\r\n*Resilience\r\n*Ability to engage young people\r\n*Strong communication skills in spoken and written English\r\n*Excellent organisational skills\r\n*Innovative and willing to try new ideas\r\n*A desire to lead\r\n","otherRequirements":"\r\n*An Enhanced DBS (Provider to check on acceptance of the conditional offer)\r\n*Prohibition Order Check (Provider to check on acceptance of the conditional offer)\r\n*Prohibition to teach in another country of the European Economic Area (EEA) Check (Provider to check on acceptance of the conditional offer)\r\n*Fitness to Teach Check (Provider to check on acceptance of the conditional offer)\r\n*Overseas Check (Provider to check on acceptance of the conditional offer)","status":1,"createdAt":"2021-07-06T10:46:38.922Z","updatedAt":"2021-09-08T14:41:35.315Z","canSponsorStudentVisa":"no","cycle":"2024"}
