{"id":"1cbf6eb5-d507-4594-9608-88d1ad47481d","name":"Physical Education Boys","code":"3CQL","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"74d64a54-5e34-4590-b6c7-528dd0cf26fe","code":"C6","name":"Physical education"}],"locations":[{"id":"170a9647-0322-440a-bfc6-2866f1411e59","name":"Brompton Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"d5cc29cb-dba7-412c-8b9b-13a423b284ce","name":"Thomas Aveling School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"6c0d99b0-15cf-47b9-9a9f-e23efacabb6c","name":"St Augustine's Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"2f3233fb-3cac-479d-8365-fc63462a0949","name":"Maplesden Noakes","isPublished":"Y","status":"R","vacancies":"F"},{"id":"84ca44ef-c221-4548-bef3-7f3a67c6ed44","name":"Oakwood Park Grammar School","isPublished":"Y","status":"R"},{"id":"06047b1a-b884-4ba0-a177-4ad253b08b21","name":"Holcome Grammar School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"e6ab3fe0-a1bc-4eb3-9821-daafac498491","name":"The Victory Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"20278e3a-8a46-4bc1-a640-efb4cc3feaa8","name":"Robert Napier School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"6f05bbdb-8665-44a9-bfc8-61ea96a9ef07","code":"1Q5","name":"Medway Valley Training Partnership"},"accreditedBody":{"id":"757d0dca-c7a9-43c8-8c3b-96c0a81539b6","code":"K30","name":"Kent and Medway Training"},"profPost":"BO","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"You must have a UK honours degree or a statement  of comparability from ENIC should you hold overseas qualifications.","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Externally sat equivalency tests must be recognised as the full equivalent of GCSE English Language, Mathematics. We also provide access to tests but, in the most case, these equivalencies will only be acceptable for courses run by our partner provider; Kent and Medway Training. They are not transferable to an alternative provider.","courseLength":"OneYear","feesUK":7100,"feesInternational":7100,"feeDetails":"The fee of £7100 is the cost for all trainees leading to Qualified Teacher Status (QTS) only. This fee is payable by all non-salaried trainees but payable by the home school for salaried trainees.\r\n\r\nFor those wishing to \"top up\" their qualification to the full Post Graduate Certificate in Education (PGCE) a further £1950* will be payable to the University of Leeds Beckett who are our PGCE accredited body.  This fee is payable by both salaried and non-salaried trainees.\r\n\r\n*This is correct at the time of publication but is subject to change.","aboutCourse":"The training year begins at the beginning of the academic year  through to middle of June the following year enabling you to take up employment from 1st July to schools that offer it.\r\n\r\nThis practical course comprises a mix of classroom-based learning in a school to academic training  on  either generic \"Professional Studies\" lectures at a local KMT hub-training centre or \"Subject Studies\" training with the other PE trainees at various locations across the partnership. \r\n\r\nThe school that you are accepted to train in becomes your home school. Except for a short 6 week placement at a contrasting B placement school in the Spring term, you will remain at your home school for the duration of the course.\r\n\r\nYour studies gradually build from observing teachers and lessons to working with your mentor starting with joint planning and teaching until by the end of the course, you are planning and teaching solo, 60% of a full timetable. At all times, there will be the classroom teacher available to support you nearby. \r\n\r\nYou will gain experience of parents evenings, clubs and many other after school events that make up the life of a teacher. \r\n\r\nThe course focuses on the teaching and learning of KS3 and KS4 students and you will be assessed on your teaching of classes from these key stages. However, because of Kent and Medway’s unique education system, where possible,  YOU WILL ALSO BE GIVEN THE OPPORTUNITY TO EXPERIENCE KS5 TEACHING. \r\n\r\nTo aid your development, you will have one formal lesson observation and one dedicated mentor meeting each week. This is where you sit with your school mentor, discuss your progress and make targets for the following week. Their work is enhanced further by subject specialist KMT Lead Mentors and Course Directors who further oversee and support all aspects of your studies.  \r\n\r\nThroughout the year, you will be building up a portfolio of evidence demonstrating your progress towards meeting the \"Teaching Standards.\" by the end of the course. Academic research is through the completion of Reflective, Practical essays and Evaluations   and these are spread across the academic year. \r\n\r\n\r\nIn addition, for those wishing to top up their qualification to PGCE, you will have other assignment to complete at various times through the year as published by the University of Leeds Beckett. This course is delivered through a distance-learning package and training will take place in your local hub- training centre. \r\n\r\n","interviewProcess":"To be considered for interview, we need a completed application form.\r\nOnce received, your application is sent to your chosen campus for their consideration.\r\n\r\nIf selected for interview, a date will be arranged where you will;  \r\n\r\n- undertake a formal face to face interview with the Subject Leader. the school's Professional Tutor and a representative from Kent and Medway Training at your chosen school.  During this, you will be required to give a presentation to the interview panel following instructions that will be provided within the interview invitation\r\n- undertake an audit of Maths and English skills \r\n\r\nPLEASE NOTE: We never ask applicants on a non-salaried course to teach a lesson or part lesson at interview, simply because you have not yet had any training.  We prefer to guide you on how to do this once your training course has commenced. \r\n\r\nYou will be given a conditional offer only if all members of the panel agree to the placement. However, should you impress at interview but not be offered a place, you will be given the opportunity for your application to be considered by other partner schools without the need to sit a second formal interview. \r\nUnder these circumstances. you will  have a phone or online discussion with the school's Professional Tutor and Subject Leader. If all goes well, a conditional offer is made.\r\n\r\n","howSchoolPlacementsWork":"All applicants have the opportunity at application, to apply for the school of their choice. If appointed, that school becomes the trainee's \"home\" school and is responsible for the majority of the training; subject to the course requirements and quality assurance of  the accrediting provider, Kent and Medway Training. (KMT) The training year is split into three placements:\r\n\r\nThe course follows a core curriculum model that is supported by specific subject training.\r\n\r\n- Placement A is at your home school and runs from the beginning of the academic year until the end of January. You are in school for four days a week learning how to teach your subject through a mixture of practical classroom experience and school-led training sessions. Thursdays are your KMT academic days where you will have either Professional Studies, led by experienced practitioners or Subject Studies training, led by subject specialists. We have a blended approach from face to face sessions to purely on-line.\r\n\r\n- Placement B is at a contrasting school. For example, if your home school is a non-selective school, you B-placement could be a Grammar school.\r\nWhere possible, your B-placement school will be discussed with you in advance and you will be placed in the local Medway or Maidstone area.\r\n \r\nThe placements runs from February to Easter where you continue to improve your teaching skills through teaching classes to school-led training sessions. Thursdays remain your KMT academic days.\r\n\r\n- Placement A2 is back at your home school  where you remain from Easter until the completion of your course in June. You will be in school for the full 5-day week. Thursday Professional and Subjects studies will have finished except for some further evening session preparing you for your Early Careers Teacher years. \r\n\r\nThroughout the course you will be assessed through both lesson observation, assessments and the completion of an online portfolio to ensure that, by the end of the course, you have met the teaching standards. Our assessments are then externally moderated and assuming all goes well, your Newly Qualified Teacher status is confirmed and celebrated at a local hub- centred Awards Evening.\r\n","personalQualities":"-  Strong and dedicated professionals \r\n-  Resilient \r\n-  Proactive and creative \r\n-  Open to feedback and guidance \r\n-  Passionate about developing pupil learning and well being \r\n-  Strong in their subject knowledge \r\n-  Positive in their communication skills \r\n-  Genuinely aiming to become an outstanding practitioner \r\n-  Enjoy working with children and young adults ","otherRequirements":"Before the course begins but not necessarily at application, you will need\r\n\r\n-  at least 10 experience days in a secondary school or academy\r\n-  at least   2 experience days in a primary school or academy\r\n-  DBS check\r\n-  Health check declaration\r\n\r\nIt is useful to attend a school experience day before application so that you can get a feel for the chosen school and what it can offer as a training placement.\r\n\r\nPLEASE NOTE: These requirements are currently suspended until the current COVID restrictions are lifted.","status":1,"createdAt":"2021-07-06T10:46:34.494Z","updatedAt":"2021-09-30T08:30:43.412Z","canSponsorStudentVisa":"no","cycle":"2024"}
