{"id":"49a6442d-cc7e-4356-a4ce-a20a988692a2","name":"Primary","code":"2W8Y","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"83bf89f4-2dde-4170-8f95-190ca5a84bc8","name":"Dane Court Primary School","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"6f05bbdb-8665-44a9-bfc8-61ea96a9ef07","code":"1Q5","name":"Medway Valley Training Partnership"},"accreditedBody":{"id":"757d0dca-c7a9-43c8-8c3b-96c0a81539b6","code":"K30","name":"Kent and Medway Training"},"degreeGrade":"1","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"Externally sat equivalency tests must be recognised as the full equivalent of GCSE English Language, Mathematics or one of the Sciences. We also provide access to tests but, in the most case, these equivalencies will only be acceptable for courses run by our partner provider; Kent and Medway Training. They are not transferable to an alternative provider.","courseLength":"OneYear","aboutCourse":"The training year is from school term through to  end of June the following year although you will contracted at the school for the remaining full academic year.\r\n\r\nThis practical course comprises a mix of classroom-based training with subject mentor support, to academic training where you will be working with experienced professionals on  either generic \"Professional Studies\" lectures at a local KMT Hub training centre or \"Subject Studies\" training with the other Primary trainees at various locations across the partnership. \r\n\r\nA-placement:-  As you are employed by the school, you will be given a 60% solo teaching timetable from day one. You may have your own form group and you will be undertaking all duties as a paid teacher of the school. Please be aware that mentors are likely to be teaching their own classes while you are teaching and that immediate support is often less likely to be accessible. \r\n\r\nB-placement:- the teaching load remains at 60%. The duration of the placement is no longer than four weeks. During this time, you can expect to follow a non-salaried course structure. You will quickly build to 60% solo teaching commitment through observation, team-teaching activities before going solo. At all times, there will be a classroom teacher available to support you. \r\n\r\nA2 placement:- you return to your home school for the full five days and continue with your timetable. There is one Thursday KMT twilight session that prepares you for your NQT year and the Awards Evening. \r\n\r\nYou will have at least, one formal lesson observation a fortnight and one meeting each week where you sit with your mentor, discuss your progress and make targets for the following week. You will be expected to attend all school events such as parents evenings, after school clubs, whole school and dedicated trainee training sessions and any other school activity as required.\r\n\r\nOver the year, you will be building up a portfolio of evidence demonstrating your progress towards meeting the Teaching Standards. There are also 7 Reflective, Practical Journals (RPJ) to complete of which 3 involve research and an essay; each totaling 1500 words.\r\n\r\nIn addition, for those wishing to top up their qualification to PGCE, you will have other assignment to complete at various times through the year as published by the University of Leeds Beckett. This course is delivered through a distance-learning package and training will take place in your local hub training centre\r\n","interviewProcess":"To be considered for interview, we need a completed  application. \r\n\r\nPLEASE NOTE: At application you will need to demonstrate significant school experience that prepares you thoroughly for teaching classes with minimal support and that meets the government eligibility criteria concerning three year full-time work experience.\r\n\r\nOnce received, your application is sent to your chosen School for their consideration.\r\n\r\nIf selected for interview, a date will be arranged where you will;\r\n\r\n- visit the school, \r\n\r\n- observe and participate in lessons,\r\n\r\n- undertake a formal interview with a mentor, the school's Professional Tutor and a representative from Kent and Medway Training.\r\n \r\n\r\nPLEASE NOTE: You may be asked to teach a lesson or part lesson at interview.\r\n\r\nThe formal interview is approximately 50 minutes long. \r\nYou will be required to prepare a 10-minute presentation, the title of which will be provided with the interview documentation that will be sent out.\r\n\r\nYou will be given a conditional offer only if all members of the panel agree to the placement. However, should you impress at interview but not be offered a place, you will be given the opportunity for your application to be considered by other partner schools without the need to sit a second formal interview. \r\n\r\n.\r\n","howSchoolPlacementsWork":"All applicants have the opportunity at application, to apply for the school of their choice. If appointed, that school becomes the trainee's \"home\" school and is responsible for the majority of the training; subject to the course requirements and quality assurance of  the accrediting provider, Kent and Medway Training. The training year is split into three placements:\r\n\r\n- Placement A is at your home school and runs from the beginning of the academic year until the end of January. You are in school for four and a half days a week. Thursday afternoon is your KMT academic time where you will have Professional Studies  led by experienced practitioners or subject specialists.\r\n\r\n- Placement B is a contrasting school. For example, if your home school focuses on KS2 teaching, then your contrasting placement will look at KS1.\r\nWhere possible, your B-placement school will be discussed with you in advance and you will be placed in the local area.\r\n \r\nThe placements runs from February for up to four weeks. Thursdays remain your KMT academic afternoon where you will have Professional Studies training, led by subject specialists. During this placement you can expect to observe teachers, gradually taking over the class teacher's lessons to a 60% timetable. The class teacher will be in attendance for additional support and guidance.\r\n\r\n- Placement A2 is back at your home school  where you remain from Easter beyond the completion of your course in June to the end of the academic year. You will be in school for the full 5 day week. Professional and Subjects studies are finished with just one further evening session preparing you for your NQT year. \r\n\r\nThroughout the course you will be assessed through lesson observation, assessments and the completion of an online portfolio to ensure that, by the end of the course, you have met the teaching standards. Our assessments are then externally moderated and assuming all goes well, your Newly Qualified Teacher status is confirmed and celebrated at a local hub- centred Awards Evening.\r\n","personalQualities":"-  Strong and dedicated professionals \r\n-  Resilient \r\n-  Proactive and creative \r\n-  Open to feedback and guidance \r\n-  Passionate about developing pupil learning and well being \r\n-  Strong in their subject knowledge \r\n-  Positive in their communication skills \r\n-  Genuinely aiming to become an outstanding practitioner \r\n-  Enjoy working with children and young adults ","otherRequirements":"At application,  you will need to be able to demonstrate significant school experience in a English primary school environment and show that you have meet the government eligibility requirements concerning 3-years full-time work experience.\r\n\r\n-  at least 10 experience days in a primary school or academy\r\n-  at least   2 experience days in a secondary school or academy (before course begins)\r\n\r\nPLEASE NOTE: These requirements are currently suspended until the current COVID restrictions are lifted.","status":1,"createdAt":"2021-07-06T10:46:34.053Z","updatedAt":"2021-11-15T11:09:32.054Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"The salary is normally at the \"unqualified teacher\" point 1 on the salary scale.\r\nThe home school that employs you will pay for your Qualified Teacher Status (QTS) course only. Should you wish to top up your qualification to the full Post Graduate Certificate of Education (PGCE) you will be responsible for those extra fees of £1850*\r\n\r\n*This is correct at the time of publication but is subject to change\r\n"}
