{"id":"1db6e3f9-62f2-4f69-a406-89a89f28051a","name":"Primary (5-11)","code":"2GK8","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"745880ae-7bfe-41ea-a400-fe19aa52e9d4","name":"Fairhaven Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"5fce79fd-0d0c-481b-af56-1397b150177e","name":"Quarry Bank Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"1de99bbc-dddf-4b39-9595-78a232cf051d","name":"Russells Hall Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"eb04727e-210a-4ab3-b999-6d694681f952","name":"Oldswinford C of E Primary School","isPublished":"N","status":"S","vacancies":"F"},{"id":"fcf7e429-9887-44e3-947e-1e14b44f63d7","name":"Greenfield Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"61b6673c-de94-44b4-84ae-d60ff6044a61","name":"Westfield Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"0e4a5dd6-2271-43df-b3fe-cbeb2f9548ca","name":"Northfield Road Primary","isPublished":"Y","status":"R","vacancies":"F"},{"id":"27b7eebe-2bba-41b4-9e46-c6a9530d2088","name":"Olive Hill Primary","isPublished":"Y","status":"R","vacancies":"F"},{"id":"b4703356-9f34-4bfd-94d8-ded13c4b2ea7","name":"Moat Farm Junior School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"2f535310-c526-45d6-9f87-08f500dfb574","name":"Northwood Park Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"0d750d0b-e778-47d6-b2ad-a1462c854668","name":"Hurst Green Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"1cf25218-cb0e-45e7-b9fb-99333b976dbf","name":"Ham Dingle Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"6dc38367-599f-4b2e-8d55-5014fbbc8ddb","name":"Withymoor Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"97aeb95e-7a00-471e-8e9f-5f457e8e7ddb","name":"Netherbrook Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"2dd8bbd7-04a0-46d8-b61e-98e83e2749b2","name":"The Royal School Wolverhampton","isPublished":"Y","status":"R","vacancies":"F"},{"id":"fd153110-dc3d-416f-bf29-8d965a1652bb","name":"Maidensbridge Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"ca5e7f97-f877-4dba-a947-0f941e551b3b","name":"Newtown Primary School","isPublished":"Y","status":"R"},{"id":"dc18bf6a-480f-4a3d-a961-d3f963c8479d","name":"Hagley Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"9dab10e9-dbe5-485e-8040-be5abda3bdc2","name":"St Mary's Catholic Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"6ebfd3aa-7601-48e5-bab5-404167a84a23","name":"Stour Vale Academy Trust","isPublished":"Y","status":"R","vacancies":"F"},{"id":"771068e3-5f6a-4347-bf31-b7314860d177","name":"Dingle Community Primary School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"39b04a57-06c3-45a1-b012-00a5b120e17e","code":"1FA","name":"Stour Vale Academy Trust"},"accreditedBody":{"id":"6019b3ce-f2f6-4b0e-b2a9-5813d74c4d54","code":"W80","name":"University of Worcester"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":14100,"feeDetails":"Fee amount pending confirmation from the University of Worcester.","aboutCourse":"Stour Vale Academy Trust offers Primary School Direct teacher training for those wishing to pursue a career in teaching. Our Initial Teacher Training (ITT) Partnership includes a number of excellent schools across the Black Country where trainees will spend the majority of their time. School Direct trainees enjoy more time in school than their PGCE Core counterparts, learning and honing their craft at the chalkface!\r\n\r\nWe work closely with the University of Worcester to provide a comprehensive and supportive training package that fully prepares trainees for a rewarding teaching career.  \r\n\r\nWe offer two specialist primary pathways. The 3 to 7 pathway provides experience of both EYFS and key stage 1, whereas the 5 to 11 primary pathway provides trainees with experience of both key stage 1 and key stage 2. Please note that all our primary trainees, irrespective of the pathway that they choose, end up qualified to teach the entire primary age range.\r\n\r\n Trainees spend around 90 days in their main school (across the Autumn and Summer Terms) and up to 40 days in their second placement school (Spring Term). The Autumn Term will consist of observing lessons and working collaboratively with other teachers, and trainees will be teaching independently by October half-term. Teaching allocations will then be increased gradually over the next two terms. \r\n\r\nAll trainees will be fully supported by their class mentor and lead mentor in school as well as by a university tutor. In addition to school and university support, representatives from Stour Vale will be with you at every stage of the course to provide professional guidance, expert pedagogical knowledge, along with heaps of advice and encouragement!\r\n\r\nAlongside their teaching commitments, trainees will also spend approximately 30 days with the University of Worcester where they will receive expert training by primary subject-specialists as well as other enhancement activities. There will be two assignments assessing trainees' subject and pedagogical knowledge which together form part of the PGCE offer including 60 Masters credits. \r\n\r\nAs well as professional development through the university, Stour Vale also delivers an in-school Professional Studies programme across the year drawing on expertise from across the ITT partnership. This includes training sessions in all aspects of school life delivered by guest speakers and serving teachers to enhance trainees' understanding of contemporary practice. \r\n\r\nFor any inquiries, as well as the latest information on vacancies and locations, please feel free to contact us at teach@svat.org.uk.\r\n","interviewProcess":"For applications through The University of Worcester, candidates will attend an interview which will include a presentation and formal interview questions with course leaders from the university, Stour Vale and the lead school. Candidates will also be asked to deliver a lesson or part-lesson. This could be face-to-face with pupils, or remotely to the interview panel made up of representatives from Stour Vale and the lead school. We will provide further details upon application. \r\n\r\nWhere possible, we encourage all applicants to visit their lead school prior to interview and support candidates in arranging this.\r\n","howSchoolPlacementsWork":"Trainees have three placements across the course of the year and these are spent in two different schools. Stour Vale work with a number of schools across the Black Country. We will discuss placement schools at the application stage. In all cases, the applicant's own circumstances will be considered so that travel times are not inconvenient. \r\n\r\nTrainees spend the Autumn and Summer Term placements at their lead school (around 90 days) and the Spring Term in their second placement school (around 40 days). These placements provide our trainees with experience of the different key stages for their chosen pathway: 3 to 7 (EYFS and KS1) or 5 to 11 (KS1 and KS2). \r\n\r\nAll trainees are allocated a class mentor who becomes the trainee's main point of contact during their placements. Professional mentors then oversee all trainees and mentors within their school. Teaching timetables are staged and trainees will be expected to be teaching independently by the end of the first term. Weekly meetings and observations will be designed to fully support the trainee's needs and help them to develop as classroom practitioners. \r\n","personalQualities":"We are looking for people who first and foremost believe in the power of education to transform the lives of young people, whatever their background and ability. You will be hard-working, with an enquiring mind and have the resilience to stay the course. Teaching is the most rewarding job in the world, but it is also, like all professions, a challenging one. You will be supported all the way, but we also want you to be independent, a critical thinker, reflective and self-aware. You will also need to be a confident communicator who will contribute to a great team spirit. ","otherRequirements":"* Full criminal/DBS checks will be carried out upon application. \r\n* Fitness to Teach: Admission to the course is subject to a satisfactory medical report, as you are required to meet the standards for Fitness to Teach. We endeavour to meet the needs of trainees with disabilities and you are welcome to discuss any needs or disabilities with us at any time during the application process.","status":1,"createdAt":"2021-07-06T10:53:29.977Z","updatedAt":"2021-10-04T17:04:54.341Z","canSponsorStudentVisa":"yes","cycle":"2024"}
