{"id":"f44e0c63-f5b1-4437-a3ec-9319de29e412","name":"Primary","code":"3XWY","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"6ebfd3aa-7601-48e5-bab5-404167a84a23","name":"Stour Vale Academy Trust","isPublished":"Y","status":"R","vacancies":"F"},{"id":"0e4a5dd6-2271-43df-b3fe-cbeb2f9548ca","name":"Northfield Road Primary","isPublished":"N","status":"S","vacancies":"F"},{"id":"61b6673c-de94-44b4-84ae-d60ff6044a61","name":"Westfield Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"ca5e7f97-f877-4dba-a947-0f941e551b3b","name":"Newtown Primary School","isPublished":"N","status":"S","vacancies":"F"},{"id":"fd153110-dc3d-416f-bf29-8d965a1652bb","name":"Maidensbridge Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"2f535310-c526-45d6-9f87-08f500dfb574","name":"Northwood Park Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"fcf7e429-9887-44e3-947e-1e14b44f63d7","name":"Greenfield Primary School","isPublished":"N","status":"S","vacancies":"F"},{"id":"eb04727e-210a-4ab3-b999-6d694681f952","name":"Oldswinford C of E Primary School","isPublished":"N","status":"S","vacancies":"F"},{"id":"1cf25218-cb0e-45e7-b9fb-99333b976dbf","name":"Ham Dingle Primary School","isPublished":"N","status":"S","vacancies":"F"},{"id":"5fce79fd-0d0c-481b-af56-1397b150177e","name":"Quarry Bank Primary School","isPublished":"N","status":"S","vacancies":"F"},{"id":"b4703356-9f34-4bfd-94d8-ded13c4b2ea7","name":"Moat Farm Junior School","isPublished":"N","status":"S","vacancies":"F"},{"id":"27b7eebe-2bba-41b4-9e46-c6a9530d2088","name":"Olive Hill Primary","isPublished":"N","status":"S","vacancies":"F"},{"id":"2dd8bbd7-04a0-46d8-b61e-98e83e2749b2","name":"The Royal School Wolverhampton","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"39b04a57-06c3-45a1-b012-00a5b120e17e","code":"1FA","name":"Stour Vale Academy Trust"},"accreditedBody":{"id":"4da5abb2-b287-451e-8d75-c5b79e11c2bb","code":"W75","name":"University of Wolverhampton"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feeDetails":"Fee amount pending confirmation from the University of Wolverhampton.","aboutCourse":"Stour Vale Academy Trust (https://www.svat.org.uk/train) offers Primary School Direct training in a range of exciting and innovative schools. Our Initial Teacher Training (ITT) Partnership includes a number of excellent schools across the Black Country where trainees will spend the majority of their time. School Direct trainees enjoy more time in school than their PGCE Core counterparts, learning and honing their craft at the chalkface!\r\n\r\nWe work in unison with The University of Wolverhampton as one of our HE providers to deliver a high-quality training programme for our trainee teachers. \r\n\r\nWolverhampton offer a comprehensive Professional Studies programme which includes training in all aspects of school life. Trainees attend theory sessions in university with the majority of their time being spent in school. Sessions are designed to support trainees' development in the core areas of the Core Content Framework (CCF) and provide a valuable insight into pedagogical approaches. The PGCE element of the course is assessed in university where trainees complete assignments throughout the year, all of which, alongside successful school placements, must be passed in order to gain Qualified Teacher Status (QTS).\r\n\r\nTrainees spend the Autumn and Summer Terms in their lead school and the Spring Term in another school to gain experience of a different context. The Autumn term will consist in observing lessons and working collaboratively with other teachers, and trainees begin to teach independently after October half-term. Teaching allocations will then be increased gradually over the next two terms. \r\n\r\nAll trainees are fully supported by both their mentor and professional mentor in school where they will apply what they have learned in Professional Studies into the classroom. The subject mentor will provide subject-specific support, including access to the latest teaching and learning strategies in order to become a confident teacher. In addition to school and university support, the Stour Vale Central Team will be with you at every stage of the course to provide professional guidance, expert pedagogical knowledge, along with heaps of advice, support, and encouragement!\r\n\r\nFor any inquiries and the latest information on vacancies and locations, please feel free to contact us at teach@svat.org.uk.\r\n","interviewProcess":"Following a successful application, candidates will be invited to attend an interview with the university. This will include a presentation and formal interview questions with course leaders from the university and Stour Vale as well as representatives from the lead school. Interviews may take place face to face or online.  We will provide further details upon application. ","howSchoolPlacementsWork":"Trainees have three placements across the course of the year and these are spent in two different schools. Stour Vale works with a number of schools across the Black Country. We will discuss placement schools at the application stage. In all cases, the applicant's own circumstances will be considered so that travel times are not inconvenient. \r\n\r\nYou will spend the Autumn and Summer Term placements at your lead school and the Spring Term in your second placement school. These placements will provide you with experience of both KS1 and KS2. (Please note that upon gaining QTS, you will be qualified to teach 3 to 11).\r\n\r\nAll trainees are allocated a class mentor for each of your placements. There will also be a professional mentor who oversees all trainees and mentors within school. Representatives from Stour Vale will also support you throughout the year.\r\n\r\nTeaching timetables are staged and trainees will be expected to be teaching independently by the end of the first term. Weekly meetings and observations will be designed to fully support the trainee's needs and help them to develop as classroom practitioners. ","personalQualities":"We are looking for people who first and foremost believe in the power of education to transform the lives of young people, whatever their background and ability. You will be hard-working, with an enquiring mind and have the resilience to stay the course. Teaching is the most rewarding job in the world, but it is also, like all professions, a challenging one. You will be supported all the way, but we also want you to be independent, a critical thinker, reflective and self-aware. You will also need to be a confident communicator who will contribute to a great team spirit. ","otherRequirements":"* Full criminal/DBS checks will be carried out upon application. \r\n* Fitness to Teach: Admission to the course is subject to a satisfactory medical report, as you are required to meet the standards for Fitness to Teach. We endeavour to meet the needs of trainees with disabilities and you are welcome to discuss any needs or disabilities with us at any time during the application process.","status":1,"createdAt":"2021-07-06T10:53:30.637Z","updatedAt":"2021-10-04T16:20:59.440Z","canSponsorStudentVisa":"yes","cycle":"2024"}
