{"id":"32b03131-bb87-418e-ae26-c1e9d0ebdf39","name":"Computing","code":"3DQM","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"e6be6a9c-8696-4b88-8fbd-1ba1bef1b6fc","code":"11","name":"Computing"}],"locations":[{"id":"ddbf6870-39fd-422d-9680-a176e08313e2","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"284fcb81-29db-46ae-85f7-b66ede119559","code":"19P","name":"The Compton School"},"accreditedBody":{"id":"7f11aaed-7c3e-42c5-af7a-023d33b45fa3","code":"U80","name":"UCL, University College London"},"profPost":"BO","degreeGrade":"1","additionalDegreeSubjectRequirements":"false","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Applicants who do not hold the relevant GCSEs will need \nto demonstrate an equivalent standard by completing \ntests with either of the following testing organisations and achieving at least a grade 5.\n\nhttp://www.equivalencytesting.com\n\nhttps://astarequivalency.co.uk","courseLength":"OneYear","feesUK":9250,"aboutCourse":"The course is based providing classroom based, practical training and underpinned by training sessions leading to Qualified Teacher Status (QTS), accredited by UCL, University College London. “UCL Institute of Education (IOE) is a global leader in teacher education.  Their programmes are recognised by Ofsted as “outstanding” in very criterion across Primary and Secondary Education.” All UCL School Direct students have full access to UCL student support services and facilities.\r\n\r\nAll trainees become part of teaching staff from day one and spend a greater amount of time in school completing their training. You will join the School Direct training programme at UCL IOE and have full access to their academic and social facilities. The programme involves attending a programme of lectures and workshops at the IOE for approximately fifteen days spread across the year. These sessions will engage with generic and subject specific areas and will help create your bespoke training programme as well as support your development as a teacher through tutorials, visits to schools and guidance with assignments. However, most of your training will take place in the school setting, focusing on your needs and the needs of each specific school.\r\n\r\nYou will be trained in a highly supportive and aspirational environment and will develop the rigour, professional knowledge, understanding and skills necessary for the delivery of purposeful and challenging teaching and learning.\r\n\r\nPlease see The Compton School website to view the schools and subjects on offer across our alliance this year. You can express a preference for a placement school in the alliance and we will very much try to meet your request.\r\n\r\nhttps://www.ucl.ac.uk/prospective-students/graduate/teacher-training-programmes/computing-ict-pgce\r\n","interviewProcess":"Applicants will be invited for interview on the basis of information provided on their application form. Candidates will be interviewed at the school selected on their application.\r\n\r\nThe interview will typically involve a half-day at the school. This will include a 20 minute lesson observation and a numeracy and literacy assessment. Candidates will be told in advance about the content of the lesson and the age range you will be teaching. \r\n\r\nCandidates will be observed teaching by a member of senior staff and a subject specialist. If successful in the first part of the interview candidates will then be invited to the final panel interview including the Headteacher.\r\n\r\nThe interview process is rigorous and thorough, designed to get the best match of applicant to the places available.\r\n\r\nIf you are successful at the school interview you will be invited to a second-stage interview at UCL Institute of Education. At your interview day you will take part in a combination of group and individual interviews with members of the programme team, and may also be asked to undertake written or presentation tasks, depending on your subject. You will have the opportunity to ask questions and take a self-guided campus tour. ","howSchoolPlacementsWork":"You will join the School Direct programme at UCL IOE and have full access to their academic and social facilities. The programme involves attending a programme of lectures and workshops at the IOE for approximately fifteen days spread across the year. These sessions will engage with generic and subject specific areas and will help create your bespoke training programme as well as support your development as a teacher through tutorials, visits to schools and guidance with assignments. However, most of your training will take place in the school setting, focusing on your needs and the needs of each specific school.\r\n\r\nYou will be trained in a highly supportive and aspirational environment and will develop the rigour, professional knowledge, understanding and skills necessary for the delivery of purposeful and challenging teaching and learning.\r\n\r\nTraining will be delivered by expert teachers within the alliance of schools. This will be enhanced by attendance at UCL IOE at certain times throughout the year. As well as completing your main placement in one of the schools in the alliance, you will also have the opportunity to teach in another partner school to enhance and broaden your experiences as a trainee.\r\n\r\nAll partner schools are graded either Good or Outstanding by Ofsted. Partner schools are based locally to The Compton School in North London and are easily accessible by public transport. All partner schools have experienced subject mentors and professional tutors who are committed to high expectations of the SCITT Partnership. Compton SCITT trainees enjoy being part of a vibrant professional community across all partnership schools.\r\n\r\nTrainees will be awarded Secondary QTS (11-16) however, all partner schools ensure trainees have the opportunity to teach A-Level classes in preparation for their ECT years.","personalQualities":"Applicants must provide evidence of an interest in working with young people, possess high quality communication skills. Speak fluently, clearly and grammatically. Be able to think analytically and possess personal qualities such as warmth, enthusiasm, self-motivation and resilience.","otherRequirements":"We recommend that you aim to gain some experience in a classroom prior to interview.","status":1,"createdAt":"2021-07-06T10:57:23.508Z","updatedAt":"2021-11-08T11:12:29.313Z","canSponsorStudentVisa":"yes","cycle":"2024"}
