{"id":"7677ad58-45c6-4f6c-b93c-c4b4cf22ace8","name":"Primary","code":"3DQ2","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"c72ae643-ecc1-4a43-a2cf-c44f3045bb36","name":"Mitchell Brook Primary School","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"284fcb81-29db-46ae-85f7-b66ede119559","code":"19P","name":"The Compton School"},"accreditedBody":{"id":"657a85c5-8835-405a-99f7-6c45e87f77bc","code":"1X7","name":"Compton SCITT"},"profPost":"BO","degreeGrade":"1","english":"1","maths":"1","science":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"The Compton SCITT will accept equivalency tests from accredited providers. Please contact The Compton SCITT for further guidance if you are required to take an equivalency test.","courseLength":"OneYear","feesUK":null,"aboutCourse":"Our course is entirely school centred providing classroom based, practical training, underpinned by a weekly educational studies programme leading to Qualified Teacher Status (QTS). In addition, trainees may opt in to gaining a Postgraduate Certificate in Education (PGCE) with University of Cumbria. The course is non-salaried and runs full time over 38 weeks (term time only). Trainees will receive an immersive training programme where they are working alongside outstanding teachers with current and relevant experience.\r\n\r\nTrainees receive structured classroom observations, weekly professional studies sessions and a phased introduction to small group teaching, team teaching and then whole class teaching.\r\n\r\nTrainees will be assessed across the academic year against The Compton SCITT's ITT Curriculum within a supportive and developmental model. Experienced subject mentors facilitate bespoke weekly targets to ensure all Teachers' Standards are met by the end of the course. \r\n\r\nThere are 5 reflection pieces set over the training year. These are research based learning tasks embedded in the realities of the modern classroom. Current academic research and reading underpin all professional studies sessions and assignments.\r\n\r\nThe Compton SCITT Partnership is committed to the wellbeing of trainee teachers. We are aware that an ITT year will be demanding and therefore have a variety of mechanisms in place including a designated pastoral lead. \"Somehow you’ve struck a happy medium between the checkbox requirements of government legislation and the true humanity that underpins teaching.\" (English trainee).\r\n","interviewProcess":"Applicants will be invited for interview on the basis of information provided on their application form. School Direct Salaried candidates will be interviewed at their chosen base school.\r\n\r\nThe interview will typically involve a half-day at the school. This will include a 20 minute lesson observation and a numeracy and literacy assessment. Candidates will be told in advance about the content of the lesson and the age range they will be teaching.\r\n\r\nCandidates will be observed teaching by a member of our senior staff and a subject specialist. If successful in the first part of the interview candidates will then be invited to the final panel interview including the Headteacher.\r\n\r\nThe interview process is rigorous and thorough, designed to get the best match of applicant to the places available.\r\n","howSchoolPlacementsWork":"The course is full time over 38 weeks (term time only). Trainees will receive an immersive training programme where they are working alongside outstanding teachers with current and relevant experience.\r\n\r\nTrainees will be based in one school for the entire academic year with a 6-week second placement at a contrasting partner school arranged by the SCITT Leadership Team. \r\n\r\nPartner schools are based locally to The Compton School in North London and are easily accessible by public transport. All partner schools have experienced subject mentors and professional tutors who are committed to high expectations of the SCITT Partnership. Compton SCITT trainees enjoy being part of a vibrant professional community across all partnership schools.\r\n\r\nTrainees will be awarded Primary QTS (5-11) and have the option to take on a PGCE with University of Cumbria.\r\n\r\nWeekly professional studies training sessions will be held at The Compton School on a Monday with trainees at their base school from Tuesday-Friday.\r\n","personalQualities":"Applicants must provide evidence of an interest in working with young people, possess high quality communication skills. Speak fluently, clearly and grammatically. Be able to think analytically and possess personal qualities such as warmth, enthusiasm, self-motivation and resilience.","otherRequirements":"School Direct Salaried trainees are no longer required to have worked for 3 years prior to their training year.\r\n\r\nAs School Direct Salaried trainees will be teaching independently from the start the of the course, successful candidates will require appropriate school/teaching experience. ","status":1,"createdAt":"2021-07-06T10:57:23.439Z","updatedAt":"2021-11-05T09:47:40.480Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"School Direct Salaried trainees will be paid a minimum of UQT1. Salaries will vary according employing school locations (inner/outer London).\r\n\r\nSchool Direct Salaried trainees will need to pay a tuition fee of £7,500 to The Compton SCITT Partnership."}
