{"id":"1605e34a-82ce-4d66-a022-ad7030fcdd8d","name":"Music","code":"39GP","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"24311bef-8673-41fb-933c-53f887fb6976","code":"W3","name":"Music"}],"locations":[{"id":"e8c10dd2-47b8-4d48-bb44-2d1f49e5dc97","name":"St Bonaventure's School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"9c4f2fd2-2049-4a64-b9f9-ca4a155d2377","code":"2BD","name":"Agnus Dei Catholic Schools"},"accreditedBody":{"id":"7f11aaed-7c3e-42c5-af7a-023d33b45fa3","code":"U80","name":"UCL, University College London"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":17110,"aboutCourse":"Our university partner for this programme is UCL Institute of Education (IOE), a global leader in teacher education.  Their programmes are recognised by Ofsted as “outstanding” in every criterion across Primary and Secondary Education.\r\n\r\nSchool Direct (Tuition Fee) is a route into teaching at both primary and secondary levels. Trainees join other student teachers on the established Music PGCE programme at the UCL Institute of Education (IOE), whilst undertaking their teaching experience at a host school with the Agnus Dei Teaching School Alliance.\r\n\r\nThe Music PGCE introduces students to the broad scope of Music as a curriculum subject across the 11-16 age range. The course is designed to support musicians in coming to an understanding of what it means to be an effective and successful music educator.  Our priority is to develop your expertise in a variety of teaching situations, by exploring a range of different teaching styles. We will offer a range of perspectives on the principles of syllabus design, evaluation and assessment.  We aim to deepen students' theoretical understanding of educational issues through engaging practical music workshops, lectures, seminars and tutorials.\r\n\r\nStudents undertake two Master’s-level (level 7) modules of 30 credits each, totaling 60 credits. These can be carried forward onto full Master’s programmes at the IOE.\r\n\r\nThe Secondary PGCE consists of three core modules: two Master’s-level (level 7) modules, which are assessed through written assignments and practical musicianship tasks, and the Professional Practice module, which is assessed by the observation of practical teaching in placement schools.\r\n\r\nCompletion of the Professional Practice module and the two level 7 (Master’s level) modules (60 credits) will result in the award of a Postgraduate Certificate of Education (PGCE). Completion of the Professional Practice module and one or two level 6 (undergraduate/Bachelor’s level) modules, will lead to the Professional Graduate Certificate of Education (PgCE).\r\n\r\nFor more information about the School Direct Music course please see: (http://www.ucl.ac.uk/ioe/courses/teacher-training/music-school-direct-pgce)","interviewProcess":"Students are advised to apply as early as possible due to competition for places. Those applying for scholarship funding (particularly overseas applicants) should take note of application deadlines.\r\n\r\nInitial Interviews are carried out by UCL in conjunction with St. Bonaventure's School.\r\n\r\nIf you are successful at the school interview you will be invited to a second-stage interview at UCL Institute of Education. At your interview day you will take part in a combination of group and individual interviews with members of the programme team, and you may also be asked to undertake written or presentation tasks, depending on your subject. You will have the opportunity to ask questions and take a self-guided campus tour. \r\n\r\n(http://www.ucl.ac.uk/ioe/courses/teacher-training/music-school-direct-pgce)\r\n","howSchoolPlacementsWork":"Students spend most of their time (120 days) in schools, working with Music mentors who support them through school placements. The Professional Practice module is assessed through these placements, associated tasks and a portfolio.\r\n\r\nWe are fortunate to have an excellent choice of schools within our alliance, with some outstanding mentors and strong Music departments. The Professional Practice module is assessed through these placements, associated tasks and a portfolio.\r\n\r\n(http://www.ucl.ac.uk/ioe/courses/teacher-training/music-school-direct-pgce)","personalQualities":"We are looking for applicants who have the potential to become outstanding teachers, and who are able to work independently on their studies while training in a school context. \r\nA successful applicant will be highly self-motivated, hardworking and deeply reflective. In addition, applicants should be willing and ready to take on advice and feedback, adapt their teaching to suit different learning styles and work successfully in a professional whole-school environment.\r\n","otherRequirements":"UCL Requirements:\r\n* Pass numeracy and literacy requirements: UCL arrangements tbc - pending publication of DfE requirements.\r\n\r\n*Confirmation you have the health and physical capacity to commence training. \r\n\r\n*A Disclosure and Barring Serve (DBS) certificate. \r\n\r\n*Applicants should visit the relevant UCL page to check the entry requirements in the key information panel. Applicants who are judged to not have sufficient knowledge in the relevant area may be required to undertake a Subject Knowledge Enhancement (SKE) course. \r\n\r\n* UCL recommends that the applicant aims to gain some experience in a classroom prior to interview. \r\n\r\n* For full details see: (https://www.ucl.ac.uk/prospective-students/graduate/teacher-training/entry-requirements)","status":1,"createdAt":"2021-07-06T10:57:11.967Z","updatedAt":"2021-09-10T10:02:27.813Z","canSponsorStudentVisa":"yes","cycle":"2024"}
