{"id":"5914e1cc-72c0-4e25-bdc4-cab105bf408e","name":"Physics","code":"39BS","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"bf97cd0a-224c-43d3-a021-84143df13e8d","code":"F3","name":"Physics"}],"locations":[{"id":"e8c10dd2-47b8-4d48-bb44-2d1f49e5dc97","name":"St Bonaventure's School","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"9c4f2fd2-2049-4a64-b9f9-ca4a155d2377","code":"2BD","name":"Agnus Dei Catholic Schools"},"accreditedBody":{"id":"33037eab-f75d-4350-b1e2-967c41e9d4c6","code":"R48","name":"Roehampton University"},"profPost":"BO","degreeGrade":"0","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":13520,"aboutCourse":"The PGCE Secondary science programmes (Science with Biology, Science with Chemistry and Science with Physics) are designed to enable you to teach, as a minimum, all the science specified in the National Curriculum for science at Key Stage 3, and your chosen science specialism from biology, chemistry or physics, at Key Stage 4 and, if appropriate, at post-16. Students join the course with a variety of science degrees and backgrounds. Few, if any, are confident from the start in all aspects of science demanded by the National Curriculum or even by their own subject specialism. Early in the course you will complete a personal audit and begin an action plan to build on your general science and subject specialism knowledge. This is an important thread running through the programme. A similar approach is followed with your understanding and skills in ICT, so that you will be able to make appropriate use of these when teaching. \r\n\r\nThe programme is the result of close collaboration between school-based mentors and the Roehampton team. It is arranged into three terms. In the first term you begin to learn how pupils develop science understanding and skills while at the same time building enough confidence to plan and teach a science lesson. The second term extends this by using teaching experience to improve lesson performance and revisit and extend issues within science education. The third term addresses science education outside the classroom and broader issues concerning the role of science within the school curriculum. Towards the end of this term, you will develop an action plan to provide a basis for progression and development within your first year of teaching. \r\n\r\nScience education at Roehampton is well staffed and resourced so that we are able to provide you with practical workshops as well as seminars and personal tutorials. Throughout the programme we aim to produce more than strong classroom practitioners; we aim also to produce reflective teachers who will go on to participate in, and influence, the future development of science education. \r\n\r\nThe Institute of Physics (IOP) offers a limited number of £30,000 tax-free scholarships to students looking to complete a ITE Physics degree. \r\n\r\nCandidates should have an approved degree in a science. Some familiarity with schools through work experience or observation should be gained prior to interview. Applicants will also be asked to prepare a short presentation on a school science topic for the interview. \r\n\r\n","interviewProcess":"Applicants will be interviewed in conjunction with St. Bonaventure's School. Observation before interview is not a requirement. Many applicants do find observation before interview can be very helpful, however. \r\nCandidates should note that school placements will be in local state secondary schools, so observational experience outside of this sector might not provide an adequate understanding of the rewards and challenges presented to teachers in this sector. Any observational experience – in either the state or independent sector – should provide an opportunity to gain insight into teaching, learning and reflection upon the professional responsibilities of teachers. Candidates are invited to contact subject tutors for advice by email if they have any uncertainties about the relevance of observation undertaken.\r\n\r\nFor more information please see: (https://www.roehampton.ac.uk/applying/pgce-secondary-entry-requirements/)","howSchoolPlacementsWork":"You will spend at least 120 days in school over the year long programme, and will also attend classes at Roehampton. Your main placement will be in a school within the Agnus Dei Teaching School Alliance and there will also be a shorter placement in another school within the alliance which will add breadth to the experience.\r\n\r\nYou will be visited in school by a university tutor, and you will have a mentor in school. The training at Roehampton will enable you to reflect upon your practice within the broad context of educational theory so that you will feel equipped to teach in any school.\r\n\r\nFor more information about the School Direct Science Course please see: (https://www.roehampton.ac.uk/postgraduate-courses/pgce-secondary/pgce-secondary-science-specialism/|)\r\n\r\nFor more general information about School Direct please see: (https://www.roehampton.ac.uk/postgraduate-courses/school-direct/)","personalQualities":"We are looking for applicants who have the potential to become outstanding teachers, and who are able to work independently on their studies while training in a school context. \r\nA successful applicant will be highly self-motivated, hardworking and deeply reflective. In addition, applicants should be willing and ready to take on advice and feedback, adapt their teaching to suit different learning styles and work successfully in a professional whole-school environment.","otherRequirements":"We recommend that you undertake some relevant work experience prior to interview. ","status":1,"createdAt":"2021-07-06T10:57:11.299Z","updatedAt":"2021-09-10T09:25:52.647Z","canSponsorStudentVisa":"yes","cycle":"2024"}
