{"id":"5d146b15-8ce9-42da-bb52-0c6fbeae3c45","name":"Computing","code":"39GY","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"e6be6a9c-8696-4b88-8fbd-1ba1bef1b6fc","code":"11","name":"Computing"}],"locations":[{"id":"e8c10dd2-47b8-4d48-bb44-2d1f49e5dc97","name":"St Bonaventure's School","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"9c4f2fd2-2049-4a64-b9f9-ca4a155d2377","code":"2BD","name":"Agnus Dei Catholic Schools"},"accreditedBody":{"id":"7f11aaed-7c3e-42c5-af7a-023d33b45fa3","code":"U80","name":"UCL, University College London"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Our university partner for this programme is UCL Institute of Education (IOE), a global leader in teacher education.  Their programmes are recognised by Ofsted as “outstanding” in every criterion across Primary and Secondary Education.\r\n\r\nSchool Direct (Tuition Fee) is a route into teaching at both primary and secondary levels. Trainees join other student teachers on the established Citizenship PGCE programme at the UCL Institute of Education (IOE), whilst undertaking their teaching experience at their host school within the Agnus Dei Teaching School Alliance.\r\n\r\nThe programme consists of university-based sessions, school-based sessions and teaching placements. The university-based sessions will include the study of the Computing curriculum, lesson planning, effective teaching, classroom management and approaches to assessment.\r\n\r\nThe university based element of the programme is closely linked to the school based elements of the programme and some of the professional studies elements will be delivered in school. There are a small number of lectures but most university-based work is undertaken in a subject specialist group of around 20-30 students.\r\n\r\nWe work with a variety of partnership schools and students will gain experience of a wide range of approaches to teaching, while working with very experienced mentors who are skilled at providing positive feedback and support.\r\n\r\nStudents undertake two Master’s-level (level 7) modules of 30 credits each, totaling 60 credits. These can be carried forward onto full Master’s programmes at the IOE.\r\n\r\nThe Secondary PGCE consists of three core modules: two Master’s-level modules, which are assessed through written assignments, and the Professional Practice module, which is assessed by the observation of practical teaching in placement schools.\r\n\r\nCompletion of the Professional Practice module and the two level 7 (Master’s level) modules (60 credits) will result in the award of a Postgraduate Certificate of Education (PGCE). Completion of the Professional Practice module and one or two level 6 (undergraduate/Bachelor’s level) modules, will lead to the Professional Graduate Certificate of Education (PgCE).\r\n\r\nFor more information about the School Direct Computer Science Course please see: (https://www.ucl.ac.uk/prospective-students/graduate/teacher-training-programmes/computer-science-school-direct-pgce)","interviewProcess":"Students are advised to apply as early as possible due to competition for places. Those applying for scholarship funding (particularly overseas applicants) should take note of application deadlines.\r\n\r\nInitial Interviews are carried out by UCL in conjunction with St. Bonaventure's School.\r\n\r\nIf you are successful at the school interview you will be invited to a second-stage interview at UCL Institute of Education. At your interview day you will take part in a combination of group and individual interviews with members of the programme team, and you may also be asked to undertake written or presentation tasks, depending on your subject. You will have the opportunity to ask questions and take a self-guided campus tour. \r\n\r\n\r\n","howSchoolPlacementsWork":"You will spend two-thirds of your time (120 days) in schools, working with Computing mentors who support you through your two school placements. We are fortunate to have an excellent choice of schools within our alliance, with some outstanding mentors and strong Computer Science departments. The Professional Practice module is assessed through these placements, associated tasks and a portfolio.","personalQualities":"We are looking for applicants who have the potential to become outstanding teachers, and who are able to work independently on their studies while training in a school context. \r\nA successful applicant will be highly self-motivated, hardworking and deeply reflective. In addition, applicants should be willing and ready to take on advice and feedback, adapt their teaching to suit different learning styles and work successfully in a professional whole-school environment.\r\n","otherRequirements":"UCL Requirements:\r\n* Pass numeracy and literacy requirements: UCL arrangements tbc - pending publication of DfE requirements.\r\n\r\n*Confirmation you have the health and physical capacity to commence training. \r\n\r\n*A Disclosure and Barring Serve (DBS) certificate. \r\n\r\n*Applicants should visit the relevant UCL page to check the entry requirements in the key information panel. Applicants who are judged to not have sufficient knowledge in the relevant area may be required to undertake a Subject Knowledge Enhancement (SKE) course. \r\n\r\n* UCL recommends that the applicant aims to gain some experience in a classroom prior to interview. \r\n\r\n* For full details see: (https://www.ucl.ac.uk/prospective-students/graduate/teacher-training/entry-requirements)","status":1,"createdAt":"2021-07-12T13:49:41.513Z","updatedAt":"2021-09-10T09:51:02.200Z","canSponsorStudentVisa":"yes","cycle":"2024"}
