{"id":"7bbfe58d-55d8-4b73-9b94-fb96ebffed52","name":"Chemistry","code":"39C4","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"912d4fb4-761b-42e9-8dc6-e968b791ea4e","code":"F1","name":"Chemistry"}],"locations":[{"id":"e8c10dd2-47b8-4d48-bb44-2d1f49e5dc97","name":"St Bonaventure's School","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"9c4f2fd2-2049-4a64-b9f9-ca4a155d2377","code":"2BD","name":"Agnus Dei Catholic Schools"},"accreditedBody":{"id":"2e1ce675-b5df-42ab-bb63-1e0435ef5722","code":"E28","name":"University of East London"},"profPost":"BO","degreeGrade":"0","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":11880,"financialSupport":"You can apply for a loan to cover the cost of your tuition fees, which will be paid directly to UEL. There are no up-front fees required. Repayment only starts after you finish your course and are earning over £25,000. If you haven’t finished repaying your loan after 30 years it will automatically be cancelled.\r\n\r\nHome and EU students studying for a Postgraduate Certificate of Education (PGCE) may be eligible for a tax-free bursary from the government, worth up to £30,000. These are paid in ten instalments from October to July, directly to your UK bank account, starting in October each academic year.\r\n\r\nAs a PGCE student, your eligibility for financial support and the amount you receive depends on the subject you plan to teach - as well as your degree classification or highest relevant academic qualification.\r\n\r\nFor more information on the funding available visit the Get Into Teaching website.","aboutCourse":"This course leads to the award of Qualified Teacher Status (QTS) for the 11-to-16 age range, which qualifies you to be a teacher in secondary schools in England and Wales. Where possible, we also give you the chance to gain experience in the 11-to-18 age range.\r\n\r\nScience, technology, engineering and mathematics (STEM) subjects are integral to the success of the UK economy and STEM education has long been identified as a major priority for schools. \r\n\r\nTeaching chemistry challenges you to find creative ways of ensuring all pupils have the same opportunities to understand the subject and its importance in everyday life.\r\n\r\nBy training to teach such an important subject, you could be eligible for the highest range of tax-free training bursaries – or a prestigious scholarship from the Royal Society of Chemistry if you have a top degree.\r\n\r\nThere are three elements to secondary training at the University of East London: subject studies, general professional studies and school-based training. It differs from courses offered by other universities in that it is very much subject-based. \r\n\r\nOur ethos is based on collaboration, not competition. We encourage you to work collaboratively just as you will when you qualify and start working in a school.\r\n\r\nFor more information about the School Direct Chemistry course please see: (https://www.uel.ac.uk/postgraduate/pgce-secondary-chemistry)","interviewProcess":"The entire interview process lasts about three hours. During the interview you will be asked to talk about a current educational issue.  Please ensure you have done some research into current educational issues in advance of the interview.  You could, for example, read recent editions of the Times Educational Supplement. \r\n\r\nOur aim is to find out as much as we can about your attributes, skills, knowledge and understanding in order to shape training opportunities for you, should you be offered a place on the programme. \r\n\r\nYour responses to these tasks and activities will be considered alongside all the other evidence to assess your suitability for the Secondary PGCE programme.\r\n\r\nDuring the individual interview you will be given the chance to talk with a tutor about the programme and any other issues that are relevant.","howSchoolPlacementsWork":"The teaching year begins in September and ends in July. You’ll attend five days a week and spend the equivalent of 24 weeks in schools. \r\nWe are very well equipped for initial teacher training with three specialist laboratories, including multimedia training equipment and materials. To develop your confidence in teaching outside the classroom, you will participate in outdoor education centre-based training. \r\n\r\nThe university-based training initially consists of weekly lectures on themes that are then developed in seminar groups. You will work both in subject-specific groups and in mixed-subject groups.\r\n\r\nWe organise our training so that it feels like a school. We teach students mainly in small groups of 30 rather than in large lecture halls of 150 or 300 because it is important that you have plenty of time in your subject groups.\r\n\r\nYour subject tutor will be like your form tutor at school. We believe that we should model good practice to you so that you can learn by example. \r\n\r\nYou will undertake two long placements in contrasting schools within the Agnus Dei Teaching School Alliance, totalling 24 weeks. We work in partnership with a variety of schools within East London and Essex with experienced mentors who provide a high-quality programme of support.  \r\n\r\nYou will be on placement from week three, so right from the beginning of your training you will have a strong link between theory and practice. \r\n\r\nWhile an experienced teacher will be in the classroom with you, it is you who will be planning the lessons and teaching the lessons. You will start by observing the teacher, then helping. By the end of the Secondary PGCE course, you will be teaching 60 per cent of a normal teacher’s timetable.\r\n\r\nOur tutors and subject mentors will advise and support you throughout each placement as you learn to teach.","personalQualities":"We are looking for applicants who have the potential to become outstanding teachers, and who are able to work independently on their studies while training in a school context. \r\nA successful applicant will be highly self-motivated, hardworking and deeply reflective. In addition, applicants should be willing and ready to take on advice and feedback, adapt their teaching to suit different learning styles and work successfully in a professional whole-school environment.","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:57:11.599Z","updatedAt":"2021-09-10T10:07:02.126Z","canSponsorStudentVisa":"yes","cycle":"2024"}
