{"id":"95060ac0-9d1e-4843-87ed-0956e4296275","name":"Geography","code":"39BR","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3f47e67b-7fa5-4947-a5a0-74d528cd2a87","code":"F8","name":"Geography"}],"locations":[{"id":"e8c10dd2-47b8-4d48-bb44-2d1f49e5dc97","name":"St Bonaventure's School","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"9c4f2fd2-2049-4a64-b9f9-ca4a155d2377","code":"2BD","name":"Agnus Dei Catholic Schools"},"accreditedBody":{"id":"33037eab-f75d-4350-b1e2-967c41e9d4c6","code":"R48","name":"Roehampton University"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":13520,"aboutCourse":"This course will prepare you to teach all aspects of Geography in secondary school. The course will be taught by a tutor who has considerable experience in the secondary school sector as well as in mentoring PGCE trainees. Valuable input into the course is made by teachers from schools where trainees are placed for classroom experience. By the end of the course you will have learnt how to develop and extend your pupils' geographical understanding, skills and knowledge in all its forms, how to organise, structure and assess work for a range of abilities and ages, how to meet the needs of individual learners and how to implement strategies promoting equal opportunities. You will learn about current developments in the teaching of Geography and its place in the National Curriculum at GCSE. \r\n\r\nYou will learn how Geography enables young people to make sense of a complex and dynamically changing world. It explains where places are, how places and landscapes are formed, how people and their environment interact, and how a diverse range of economies, societies and environments are interconnected. You will also draw on your own studies and work experience to encourage questioning, investigation and critical thinking about issues affecting the world and people's lives, now and in the future. \r\n\r\nEntry requirements\r\n\r\nApplicants should have a single subject degree in Geography or a joint degree in which Geography forms the major part. It is expected that places will be offered to candidates with a 2.1 or above. Interviews will include a discussion of the value of fieldwork in Geography at secondary school.\r\n\r\nFor more information about the School Direct Geography course at Roehampton please see: (https://www.roehampton.ac.uk/postgraduate-courses/pgce-secondary/pgce-secondary-geography-specialism/)\r\n","interviewProcess":"Applicants will be interviewed in conjunction with St. Bonaventure's School. Observation before interview is not a requirement. Many applicants do find observation before interview can be very helpful, however. \r\nCandidates should note that school placements will be in local state secondary schools, so observational experience outside of this sector might not provide an adequate understanding of the rewards and challenges presented to teachers in this sector. Any observational experience – in either the state or independent sector – should provide an opportunity to gain insight into teaching, learning and reflection upon the professional responsibilities of teachers. Candidates are invited to contact subject tutors for advice by email if they have any uncertainties about the relevance of observation undertaken.\r\n\r\nFor more information please see: (https://www.roehampton.ac.uk/applying/pgce-secondary-entry-requirements/)","howSchoolPlacementsWork":"You will spend at least 120 days in school over the year long programme, and will also attend classes at Roehampton. Your main placement will be in a school within the Agnus Dei Teaching School Alliance and there will also be a shorter placement in another school within the alliance which will add breadth to the experience.\r\n\r\nYou will be visited in school by a university tutor, and you will have a mentor in school. The training at Roehampton will enable you to reflect upon your practice within the broad context of educational theory so that you will feel equipped to teach in any school.\r\n\r\nFor more information please see: (https://www.roehampton.ac.uk/postgraduate-courses/school-direct/)","personalQualities":"We are looking for applicants who have the potential to become outstanding teachers, and who are able to work independently on their studies while training in a school context. \r\nA successful applicant will be highly self-motivated, hardworking and deeply reflective. In addition, applicants should be willing and ready to take on advice and feedback, adapt their teaching to suit different learning styles and work successfully in a professional whole-school environment.","otherRequirements":"We recommend that you undertake some relevant work experience prior to interview. ","status":1,"createdAt":"2021-07-06T10:57:11.267Z","updatedAt":"2021-09-10T09:21:11.808Z","canSponsorStudentVisa":"yes","cycle":"2024"}
