{"id":"c141aaf6-70af-448f-9416-fc8696f034b5","name":"Mathematics","code":"39BW","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"72345aa7-096c-488f-8649-085b8178cadb","code":"G1","name":"Mathematics"}],"locations":[{"id":"e8c10dd2-47b8-4d48-bb44-2d1f49e5dc97","name":"St Bonaventure's School","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"9c4f2fd2-2049-4a64-b9f9-ca4a155d2377","code":"2BD","name":"Agnus Dei Catholic Schools"},"accreditedBody":{"id":"33037eab-f75d-4350-b1e2-967c41e9d4c6","code":"R48","name":"Roehampton University"},"profPost":"BO","degreeGrade":"0","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":13520,"aboutCourse":"On the programme you will learn how pupils develop mathematical understanding, knowledge and skills. University tutors and mentors in school will help you to develop a teaching style that enables your pupils to learn mathematics effectively and confidently. You will develop your own skills in the use of ICT and become familiar with the software that can be used to enhance mathematical teaching. A wide range of mathematical resources will be available in the Mathematics Centre to inform your studies. \r\n\r\nEntry requirements\r\nApplicants should have a single subject degree in mathematics or a joint degree in which mathematics formed a substantial part. Students with a degree in other disciplines with a strong mathematical content, such as engineering and management science, are also welcome to apply. At interview, candidates will be asked to describe their experience of visiting a secondary school, to undertake a written English task and to answer AS-level pure mathematics questions. \r\n\r\nFor more information about the School Direct Mathematics coursed please see: (https://www.roehampton.ac.uk/postgraduate-courses/pgce-secondary/pgce-secondary-mathematics-specialism/)","interviewProcess":"Applicants will be interviewed in conjunction with St. Bonaventure's School. Observation before interview is not a requirement. Many applicants do find observation before interview can be very helpful, however. \r\nCandidates should note that school placements will be in local state secondary schools, so observational experience outside of this sector might not provide an adequate understanding of the rewards and challenges presented to teachers in this sector. Any observational experience – in either the state or independent sector – should provide an opportunity to gain insight into teaching, learning and reflection upon the professional responsibilities of teachers. Candidates are invited to contact subject tutors for advice by email if they have any uncertainties about the relevance of observation undertaken.\r\n\r\nFor more information please see: (https://www.roehampton.ac.uk/applying/pgce-secondary-entry-requirements/)","howSchoolPlacementsWork":"You will spend at least 120 days in school over the year long programme, and will also attend classes at Roehampton. Your main placement will be in a school within the Agnus Dei Teaching School Alliance and there will also be a shorter placement in another school within the alliance which will add breadth to the experience.\r\n\r\nYou will be visited in school by a university tutor, and you will have a mentor in school. The training at Roehampton will enable you to reflect upon your practice within the broad context of educational theory so that you will feel equipped to teach in any school.\r\n\r\nFor more information please see: (https://www.roehampton.ac.uk/postgraduate-courses/school-direct/)","personalQualities":"We are looking for applicants who have the potential to become outstanding teachers, and who are able to work independently on their studies while training in a school context. \r\nA successful applicant will be highly self-motivated, hardworking and deeply reflective. In addition, applicants should be willing and ready to take on advice and feedback, adapt their teaching to suit different learning styles and work successfully in a professional whole-school environment.","otherRequirements":"We recommend that you undertake some relevant work experience prior to interview. ","status":1,"createdAt":"2021-07-06T10:57:11.392Z","updatedAt":"2021-09-10T09:23:26.490Z","canSponsorStudentVisa":"yes","cycle":"2024"}
