{"id":"f09b49bf-ad8b-4aef-80aa-c177b7c0ed51","name":"Religious Education","code":"33P6","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"724b5d16-28dd-4431-bc17-ea4be4daedc4","code":"V6","name":"Religious education"}],"locations":[{"id":"f7199df5-6d4c-4bbd-8ce4-0d9e74d18a2c","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"9c4f2fd2-2049-4a64-b9f9-ca4a155d2377","code":"2BD","name":"Agnus Dei Catholic Schools"},"accreditedBody":{"id":"ef172d85-20e4-4aa2-96d0-9e3ae81f526d","code":"S64","name":"St Mary’s University, Twickenham"},"profPost":"BO","degreeGrade":"0","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Our Secondary RE PGCE course is dedicated to producing excellent RE teachers and offers you the opportunity to become part of a long tradition of trainee teachers.\r\n\r\nIt's preferable to have sufficient accredited knowledge of two or more of the major world faiths in order to be able to teach the subject to AS/A2 level. Our PGCE training qualifies you to teach RE in all secondary schools and applications are welcome from candidates with appropriate subject knowledge. \r\n\r\nIf you wish to study for the Catholic Certificate of Religious Studies you will be able to complete several of the modules during your PGCE year. This certificate is often a requirement for teaching in a Catholic school.\r\n\r\nFor more information about the School Direct Religious Education course please see: (https://www.stmarys.ac.uk/postgraduate-courses-london/pgce-secondary-re)\r\n\r\n","interviewProcess":"On the day you will take part in a brief tour of the campus and an informative lecture about the course and our expectations.\r\n\r\nYou will also be asked to undertake some short written tasks to show your capability in written English, spelling and grammar. You won't need to prepare for this in advance.\r\n\r\nIn addition, you'll be assigned a small group with other candidates and asked to prepare a short presentation about a current educational topic. Each group will in turn present their ideas and engage in discussion.\r\n\r\nThere will also be a personal interview overseen by one or more members of the PGCE team. \r\n\r\nYour performance will be assessed by several people - including senior staff from our partner schools - any decisions about acceptance are only made when all assessments are collated and discussed by the course team panel. At St Mary's, we would like all applicants to have made a fully informed decision about considering joining the teaching profession. As part of that decision making process, spending some time in school(s) observing what teachers do and beginning to give some consideration to how they manage learning can be really insightful and informative.\r\n\r\nYour training is most likely to take place in mixed, state comprehensive school environments. If you are choosing to complete some school observation as part of making an informed decision about teaching then we would encourage you to do so in a similar school setting.","howSchoolPlacementsWork":"During your studies you'll be allocated two school placements within the Agnus Dei Teaching School Alliance, which will add breadth to your teaching experience. You will be working in successful departments with experienced mentors. \r\n\r\nOur partnership schools offer a rich and diverse training programme for our trainees. We work with partner schools throughout the East London and Essex area. During your placements, you will be guided from working with small groups of pupils alongside a subject teacher towards taking responsibility for whole classes.\r\n\r\nAssessments are used to ensure trainees understand and can apply the knowledge.  This is done through a range of methods:\r\n\r\nSelf-assessment\r\nPresentations\r\nMicro-teaching\r\nEssays\r\nPractical sessions\r\nLesson observations\r\n\r\nAssessment is on-going and against the Teachers’ Standards. High standards of attendance, punctuality and participation are requirements of all course elements.\r\n\r\nFor more information please see: (https://www.stmarys.ac.uk/teacher-training/pgce/overview.aspx)","personalQualities":"We are looking for applicants who have the potential to become outstanding teachers, and who are able to work independently on their studies while training in a school context. \r\nA successful applicant will be highly self-motivated, hardworking and deeply reflective. In addition, applicants should be willing and ready to take on advice and feedback, adapt their teaching to suit different learning styles and work successfully in a professional whole-school environment.","otherRequirements":"At St Mary's, we would like all applicants to have made a fully informed decision about considering joining the teaching profession. As part of that decision making process, spending some time in school(s) observing what teachers do and beginning to give some consideration to how they manage learning can be really insightful and informative.\r\n\r\nYour training is most likely to take place in mixed, state comprehensive school environments. If you are choosing to complete some school observation as part of making an informed decision about teaching then we would encourage you to do so in a similar school setting.","status":1,"createdAt":"2021-07-06T10:57:10.976Z","updatedAt":"2021-09-10T09:40:32.494Z","canSponsorStudentVisa":"yes","cycle":"2024"}
