{"id":"ba2f0f1a-640b-4ef6-bb68-d88f63022677","name":"Primary (SEND)","code":"H977","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"yes","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"36d6671f-d1d4-4fcc-afa7-3feead2bc295","name":"Chiltern Training Group","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"97da1fe4-b7f6-4fc5-9b8d-dc3d412457a0","code":"21M","name":"The Acorn Training Group"},"accreditedBody":{"id":"d4a93000-8658-4679-8125-92f6e35835f9","code":"C59","name":"Chiltern Training Group"},"profPost":"PG","english":"3","maths":"3","science":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":null,"aboutCourse":"You will be based in your employing school across the academic year. On Fridays you will be released to attend weekly academic and professional lectures which take place at our lead school Challney High School for Boys in Luton.\r\n\r\nClassroom Practice will form part of your central training where we will take you through aspects of classroom focused learning that will impact on your practical delivery in school.\r\nProfessional Practice sessions are centrally delivered where professional aspects to teaching are taught. Sessions are led by excellent and proven staff from partner schools and a variety of other education experts and will provide an induction into the major dimensions of the education debate and foster a whole school/whole curriculum perspective on the role of the teacher.\r\nSubject Practice strand focuses on learning how to teach subject content to pupils and to improve their subject knowledge, understanding, skills and confidence. Sessions are led by expert practitioners. The format includes workshops, seminars, learning through case studies and practical work. These sessions are run weekly after school.\r\nThe PGCE content for trainees who have opted to take the PGCE academic award will be run on the assignment focus areas. These will be useful to all trainees as the learning can be applied to teaching practice in general. Some sessions will be specifically about writing at level 7 and PGCE specific details. Three assignments are set across the year in November, March and May.\r\n","interviewProcess":"Our interview process is designed to ensure that you have all the qualities that will be needed for us to train you to teach.\r\n\r\nThe first stage consists of a literacy and numeracy assessment, teaching task with self reflection and a discussion task.\r\n\r\nIf you are successful at the first stage then there will be a panel interview. At this stage secondary applicants may also sit a subject specific test to assess any need for subject knowledge enhancement.\r\n\r\nWe may also arrange for you to be interviewed in a school where you could be asked to teach a 20 minute lesson and have a brief panel interview. \r\n","howSchoolPlacementsWork":"During the year you will gain experience is another contrasting school and this will be arranged in conjunction with your base school.  Further short placements are arranged to observe transition at early years and secondary stages  as well as days in special schools.\r\n","personalQualities":"•\tA passion for working with children\r\n•\tConfidence\r\n•\tPatience\r\n•\tCompassion\r\n•\tUnderstanding\r\n•\tEnthusiasm\r\n•\tA sense of humour\r\n•\tDedication to excellence\r\n•\tStrong command of English both orally and written\r\n•\tThe ability to communicate in a range of different ways\r\n","otherRequirements":"•\tEnhanced DBS Clearance with Update Service\r\n\r\nYou should have whole class teaching experience to apply for the salaried route as you will be expected to teach 10 hours including assessment and lesson planning from the start of the course.","status":2,"createdAt":"2021-07-12T13:48:06.423Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"You’ll be paid and taxed as an unqualified teacher. The salary awarded will differ between schools; you should check the salary with the school before you apply."}
