{"id":"e2428b64-a9f3-4d6b-91c3-bbe90f24549f","name":"Primary","code":"39SP","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"610e6bb4-fa96-42a9-9c13-e4a0c4eb0b1e","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"cc8f0934-26f1-4204-8e16-276b0678f4ff","code":"2JF","name":"Aireborough Partnership"},"accreditedBody":{"id":"154509e2-743e-4f0b-9d99-396393aa57ff","code":"L27","name":"Leeds Beckett University"},"profPost":"PG","degreeGrade":"1","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"This course is designed to give you breadth of teaching experience through having placements in both KS1 and KS2 and working in different schools within our cluster.\r\nThe course is split into 3 phases. You will experience teaching in KS1 and KS2 in the first two phases and in phase 3 it will be either KS1 or KS2 depending on your preference. \r\nYou will start at one of our cluster schools in phase 1, move to another cluster school in phase 2 and then will return to the same school that you started at in phase 1 for your final, phase 3 placement.\r\nYou will have time to observe good practice in the classroom you have been assigned through observing the class teacher, as well as being able to observe other members of staff within school if there are any areas of improvement identified or anything that is particular interest to you. This will ensure you have the knowledge and understanding to make your teaching the best it can possibly be.\r\nAll class teachers that you will be working with will have received mentor training within the cluster in collaboration with Leeds Beckett University to ensure they know how to deliver feedback that is appropriate to aid your ongoing development.\r\nYou will be supported by a mentor in school who will observe you on a weekly basis and offer timely feedback to help you develop your skills in teaching. They will assess your teaching against the teacher standards which will allow you to have specific targets to work on in order to improve.\r\nFor quality assurance purposes, the mentors will work closely within the cluster of schools and will arranged paired observations of our trainees. An assigned tutor from Leeds Beckett will also visit trainees to offer support, guidance and also ensure quality assurance.\r\nWe also offer our trainees enhancement days to observe in EYFS, SEN provision and KS3 so you can see how teaching and learning develops before and after primary school.","interviewProcess":"All our trainees who are shortlisted for interview will be invited to one of our cluster schools. If you are asked for interview, we will provide more details about the tasks that you will be asked to complete.\r\nAll our interviews will have the same elements:\r\n\r\n* A classroom based exercise where you will be observed interacting with a group of pupils.\r\n* A short written task which is designed to assess your written communication skills.\r\n* A short maths test.\r\n* A face to face interview with a panel of school leaders.\r\n\r\nYou will also have to opportunity to look around school and ask any questions.\r\n\r\nIf you are successful at interview stage, you will be made an offer of a training place subject to satisfactory enhanced DBS clearance and health check. For more information, see the guidance online at: https://www.gov.uk/disclosure-barring-service-check\r\n","howSchoolPlacementsWork":"We carefully consider school placements for all of our trainees. \r\n\r\nYour timetable will consist of having days in university to learn the information required to become a successful teacher (most of which at the start of the course so you have theory ready to put into practice during your teaching placements) but the majority of the time will be spent in school gaining first hand teaching experience, supported by teachers in school to help you improve and develop.\r\n\r\nThrough each phase, the amount of time you will be actually teaching will gradually build up as you become more confident and experienced within the classroom. \r\n\r\nThe cluster of schools will provide a training session at each school that will deliver up to date training from skilled practitioners. This will enable you to meet with the other trainees in the cluster as well as visit all the schools involved. Each school has their own areas of strength so through the training, you will become more knowledgeable about teaching and learning in different settings.","personalQualities":"We don't have a fixed picture of what kind of a person we are looking for. Teaching is a creative, dynamic profession which has space for innovative thinking.\r\nOur cluster is clear that we want trainees to have an excellent rapport with children, a passion for teaching and the ambition to become an outstanding teacher. \r\nWe are looking for a relentlessly positive outlook, showing initiative and being a good team player. Teamwork and positive relationships with all stakeholders is a key to success.\r\nYou should be ready to work hard in this challenging but wonderfully rewarding profession. ","otherRequirements":"It is desirable that candidates have experience of working with children of different ages within the 5-11 age-range. Preferably this would be across KS1 and KS2 in a UK Primary School / setting and would equate to about 10-15 days in total. This is however, not essential. In addition, we value experience of working with children in contexts other than school and will take these into consideration.\r\n\r\n","status":1,"createdAt":"2021-07-06T10:55:23.705Z","updatedAt":"2021-10-06T09:36:24.499Z","canSponsorStudentVisa":"yes","cycle":"2024"}
