{"id":"297c5c41-792b-4467-b33b-65613ed8c866","name":"Primary","code":"3BP4","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"1624138d-dde0-4512-b8d4-9b1ae2f7a451","name":"Partnership Primary Schools in Wolverhampton","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"336869e0-6b71-46c4-80eb-8b3401070e82","code":"27U","name":"ConnectEd Partnership"},"accreditedBody":{"id":"4da5abb2-b287-451e-8d75-c5b79e11c2bb","code":"W75","name":"University of Wolverhampton"},"profPost":"PF","degreeGrade":"9","english":"1","maths":"1","science":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"This is an opportunity to take BCU GCSE equivalency tests for students holding an offer from the University of Wolverhampton.","courseLength":"OneYear","feesUK":9200,"aboutCourse":"Trainee teachers undertaking the School Direct route will be expected to complete two successful placements in different schools at different key stages. They will be required to complete a Record of Professional Development (RoPD) to evidence meeting standards.\r\n\r\nPlacement One preparation days will be during the 1st week in October; this will be an opportunity for the trainee teacher to get to know the children, school policies including Safeguarding and to complete school-based tasks. \r\n\r\nTrainee teachers will have the opportunity to further consolidate their experience in a range of settings by undertaking a two-week placement in an alternative setting. \r\n\r\nDuring Placement Two, the trainee teachers should build up to teaching 70% of a full timetable. This 70% may consist of teaching the whole class, groups and 1:1 within the class in the first week, however trainee teachers will need to move towards taking the full role of the class teacher as soon as the Mentor feels they are ready. \r\n\r\nTrainee teachers will have the opportunity to further consolidate their experience in a range of settings by undertaking a two-week placement in an alternative setting. \r\n\r\n\r\nTrainee teachers will undertake immersion days across a variety of settings that may include; an outstanding school, a special school, a school with a high number of families in receipt of pupil premium and a school with a high population of children for whom English is an additional language. \r\n\r\nThere are 3 modules of study in addition to the 2 school based placements:\r\n - Primary Professional Studies \r\nThis module introduces trainee teachers to a range of educational issues that are generic to primary teaching, for example, documentation and practices relating to the Every Child Matters agenda, the current primary curriculum and the legal responsibilities of teachers.\r\n\r\n- Core Curriculum and Enhancement \r\nThis module covers areas such as the aims, principles and design of the English, maths,science, design & technology & ICT curriculum. \r\n\r\n- The Wider Curriculum \r\nThis module aims to introduce students to wider areas of learning: art, music, drama, geography, history, modern foreign languages, PE, computing, RE and PSHE. \r\n\r\n","interviewProcess":"The interview/ assessment process will be jointly led by the University of Wolverhampton and colleagues from the ConnectEd School Direct Partnership. ","howSchoolPlacementsWork":"You will have 2 school placements in contrasting key stages.\r\nYou will be placed in schools who are highly experienced in school direct training.","personalQualities":"The interviewers will be looking for you to demonstrate a range of qualities which will include:\r\n\r\n*A commitment, and understanding of primary education and the role of the teacher\r\n*A positive attitude towards children and to working with children\r\n*Ability to self-evaluate, to problem solve and to show resilience\r\n*Ability to build relationships quickly, to value others and to get the best out of them\r\n*Good general knowledge and clear, accurate spoken and written English","otherRequirements":"How we select our Trainees\r\nThe selection process includes a collaborative approach between University of Wolverhampton and ConnectEd \r\nPartnership TSA.  Candidates will be assessed on:\r\nPersonal and Professional Qualities \r\nAbility to work at Masters Level \r\nEvidence that prospective trainee has been observed in a primary teaching situation and demonstrated to the satisfaction of an experienced teacher/headteacher that they have potential to be successful\r\nA broad range of subject knowledge, especially in English, mathematics and science \r\nThe ability to engage in professional discussion and debate on current issues\r\nAbility to communicate clearly and effectively in both written and oral forms \r\n","status":1,"createdAt":"2021-07-06T10:55:57.538Z","updatedAt":"2021-09-23T13:18:43.507Z","canSponsorStudentVisa":"yes","cycle":"2024"}
