{"id":"5d71e58c-1022-421c-8c47-abbaa7886f80","name":"Primary","code":"2QSR","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"1624138d-dde0-4512-b8d4-9b1ae2f7a451","name":"Partnership Primary Schools in Wolverhampton","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"336869e0-6b71-46c4-80eb-8b3401070e82","code":"27U","name":"ConnectEd Partnership"},"accreditedBody":{"id":"62d5803b-89ca-4e21-bb6f-5c74944c56ad","code":"B25","name":"Birmingham City University"},"profPost":"PF","english":"3","maths":"3","science":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","aboutCourse":"Course Structure:\r\nUp to 80 days faculty-based training (face to face or directed study)\r\nUp to 120 days school-based training and experience (practising and school staff led)\r\nTime in school will be sub-divided into: School based training – non-assessed\r\nSchool based training – assessed practise\r\n\r\nThere are Four Assessed Modules:\r\n\r\n*Core Curriculum worth 20 Credits at Level 7\r\nAssessment:- 1 x 3000 word equivalent\r\n*Foundation Curriculum worth 20 Credits at Level 7\r\nAssessment: 1 x 3000 words equivalent\r\n*Professional Studies and Leadership worth 20 Credits at Level 7\r\nAssessment: 1 x 3000 words equivalent\r\n*School Based Training 1 &2\r\nAssessment: Pass/Fail - Successful Practice & Standards Met\r\n\r\nDepending on your specific qualifications and background, the Professional Studies and Leadership module gives you an opportunity to specialise in a particular area. For example:\r\n*English\r\n*Geography\r\n*Mathematics\r\n*History\r\n*Science\r\n*Art\r\n*Foreign Languages\r\n*Music\r\n*Computing\r\n*Religious Education\r\n*Early Years (Birth – 7)\r\n*Physical Education\r\n*Design & Technology\r\n\r\n\r\n\r\n","interviewProcess":"\r\nThe Assessment session will include the following:\r\n1.\tA General Knowledge (Curriculum Knowledge) Test\r\n*This will assess the breadth of knowledge that the government and the university acknowledge is vital for primary teachers who teach across the curriculum.\r\n*All questions relate either directly or indirectly to Primary Education and the National Curriculum for Key Stages 1 &2.\r\n*The test covers a wide range of areas of the curriculum including mathematics, English, science, geography, history, music, art, PE and RE.\r\n*A group discussion\r\nThis will assess understanding of some issues surrounding primary education and the challenges and rewards of working with children.  This will also assess communication and interpersonal skills.  \r\n*A written task\r\nThis will assess your understanding of an issue within primary education. This will also assess written English.\r\n*One to one interview\r\nThis will enable candidates to draw on personal experiences to demonstrate understanding of primary education, the role of the teacher and their attitudes towards children.\r\n*Observation of teaching\r\n","howSchoolPlacementsWork":"School Experience 1 is in the autumn term, you will complete preliminary visits and a block placement.  This placement will develop your understanding of the range of teaching, learning and professional skills as outlined in the Teachers’ Standards (DFE, 2012) in the context of one to one and small/focus group teaching building up to taking more responsibility for whole class teaching. You will be summatively assessed against the Teachers’ Standards.  \r\nSchool Experience 2\r\nFor some School Direct trainees, placement 2 will be in a different school but you will return to your first school for placement 2.   Your School Direct partnership will organise your placements but we will have an overview of where your training is taking place.\r\nPart 2a is in the spring term, you will complete preliminary visits and a block placement.  You will work with children and small groups identified by school data to support ‘closing the gap’ targets and will teach all core subjects and a selection of foundation subjects.  You may also undertake some whole class teaching. You will be formatively assessed against the Teachers’ Standards.\r\nPart 2b is in the summer term and will be in the same school as Part 2a.  You will complete preliminary visits and a block placement.  You will start with a minimum teaching commitment of 60%, building up to 80% of the timetable by the mid-point.  This placement will be summatively assessed against the Teachers’ Standards.\r\n\r\nWhere are the schools?\r\nOur region covers all of Wolverhampton. \r\nYou will be aware of the schools which work within your School Direct partnership and your placements will be arranged accordingly.\r\n","personalQualities":"The interviewers will be looking for you to demonstrate a range of qualities which will include:\r\n\r\n*A commitment, and understanding of primary education and the role of the teacher\r\n*A positive attitude towards children and to working with children\r\n*Ability to self-evaluate, to problem solve and to show resilience\r\n*Ability to build relationships quickly, to value others and to get the best out of them\r\n*Good general knowledge and clear, accurate spoken and written English","otherRequirements":"How we select our Trainees\r\nThe selection process includes a collaborative approach between BCU and ConnectEd \r\nPartnership TSA.  Candidates will be assessed on:\r\nPersonal and Professional Qualities \r\nAbility to work at Masters Level \r\nEvidence that prospective trainee has been observed in a primary teaching situation and demonstrated to the satisfaction of an experienced teacher/headteacher that they have potential to be successful\r\nA broad range of subject knowledge, especially in English, mathematics and science \r\nThe ability to engage in professional discussion and debate on current issues\r\nAbility to communicate clearly and effectively in both written and oral forms \r\n","status":2,"createdAt":"2021-07-06T10:55:57.504Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":" Trainees on this route do not have to pay tuition fees. This is paid by the lead school to the ITT Provider.\r\n\r\nThe trainee will be paid by the employing school at least on Point 1 of the Unqualified Teachers Pay scale. "}
