{"id":"5ec27a90-45a8-4799-957e-4492bd3a83d6","name":"Art and Design","code":"2NT4","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"d461a678-3335-4ca2-9616-1dc479d31a49","code":"W1","name":"Art and design"}],"locations":[{"id":"526a977b-9e35-4c12-8c6e-1c91376ec6e9","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"33037eab-f75d-4350-b1e2-967c41e9d4c6","code":"R48","name":"Roehampton University"},"profPost":"PG","degreeGrade":"1","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We recommend A Star equivalency (https://astarequivalency.co.uk/) or Equivalency Testing (www.equivalencytesting.com) as third parties who can provide equivalency testing. Please consult their websites for costs and arrangements.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"The key aim of this programme is to enable students to become confident, knowledgeable and enthusiastic teachers of art and design. The programme provides opportunities for students to explore the theory and practice of art and design education through a range of lectures, workshops and tutorials, and to develop their expertise in the classroom through two school placements. \r\n\r\nThe course will provide students with an awareness of the theoretical foundations of the subject, of strategies for teaching and learning in art and design and of current issues surrounding art and design education. Workshops will enable students to explore a range of practical processes including drawing, painting, printmaking, sculpture, textiles, photography and digital art. Regular tutorials enable students to receive individual support from tutors. Lecturers on the programme are experienced teachers of art and design and active researchers in the field of art and design education, while visiting artists offer workshops in specific processes.\r\n\r\nYour school experience and your university-based learning together form a coherent curriculum, covering key areas of professional learning.  We use an online system called Abyasa to record your progress throughout the course.  At the end of the Programme, a final profile will show how you have met the Professional Standards for the award of QTS. Abyasa record-keeping  is a collaborative exercise involving you, your Roehampton subject tutor and your school mentor. The final profile will draw on a wide range of evidence, including university- and school-based activities, your school experience file and, of course, the teaching carried out in the classroom. \r\n\r\n\r\nThe PGCE Secondary course is also assessed by means of three assignments. These are closely linked to your work in schools and are designed to encourage reflection on practical and theoretical perspectives underpinning effective and reflective teaching and learning. \r\n\r\nFor more information please visit our website here. \r\n(https://www.roehampton.ac.uk/postgraduate-courses/pgce-secondary/pgce-art-and-design-specialism/)\r\n","interviewProcess":"We are continuing to interview applicants online this year. There will then be a recording for you to watch introducing the course and the subject tutor team. There will be a group interview, based on what you have learned from your observations in school and understanding of teaching in general. Each applicant will also have an individual interview with the subject tutor lasting about 30 minutes. You will have an opportunity to ask questions about the course during this interview. You may be asked to discuss a portfolio where relevant, to give a presentation, or to show the relevance of your subject knowledge, following specific guidance. \r\n\r\nThere will also be a written task, where you will be asked to write a short piece on the role of your subject within the national curriculum. This is to check your Spelling, Punctuation and Grammar, and to see what your response would be to writing at Master’s level. These interview elements are carefully planned to give you the best possible opportunity to show your potential for teaching and working with young people in school. A teacher from one of our partner schools may take part in the interview. \r\n","howSchoolPlacementsWork":"During school placements, students benefit from working alongside experienced teachers of art and design. Students have opportunities to observe excellent teaching before experimenting with approaches to teaching and learning across the secondary age range, during which time they are supervised and supported by mentors and tutors. ","personalQualities":"We look for candidates who have good interpersonal skills and a strong desire to teach. Teachers need to be flexible and prepared to take on a wide range of responsibilities. It is not a requirement to have spent time in school before the course starts but many candidates find this very useful in preparing them for the realities of classroom life. ","otherRequirements":"- UK enhanced DBS check is required prior to enrolment and a suitability declaration will be requested when accepting a place. If you have lived outside of the UK for a period of a year over the age of 18 then you will also be required to provide an overseas criminal records check clearance prior to starting the course.\r\n\r\n- A declaration of health questionnaire is required to assess if you are fit to teach. ","status":1,"createdAt":"2021-07-06T10:50:16.711Z","updatedAt":"2021-09-28T12:17:23.178Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
