{"id":"8929e563-f7ca-4159-a3ea-b8a10a28ef06","name":"Chemistry","code":"F1X1","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"912d4fb4-761b-42e9-8dc6-e968b791ea4e","code":"F1","name":"Chemistry"}],"locations":[{"id":"526a977b-9e35-4c12-8c6e-1c91376ec6e9","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"33037eab-f75d-4350-b1e2-967c41e9d4c6","code":"R48","name":"Roehampton University"},"profPost":"PG","degreeGrade":"1","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We recommend A Star equivalency (https://astarequivalency.co.uk/) or Equivalency Testing (www.equivalencytesting.com) as third parties who can provide equivalency testing. Please consult their websites for costs and arrangements.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"The PGCE Secondary science programmes (Science with Biology, Science with Chemistry and Science with Physics) are designed to enable you to teach, as a minimum, all the science specified in the National Curriculum for science at Key Stage 3, and your chosen science specialism from biology, chemistry or physics, at Key Stage 4 and, if appropriate, at post-16. Students join the course with a variety of science degrees and backgrounds. Few, if any, are confident from the start in all aspects of science demanded by the National Curriculum or even by their own subject specialism. Early in the course you will complete a personal audit and begin an action plan to build on your general science and subject specialism knowledge. This is an important thread running through the programme. A similar approach is followed with your understanding and skills in ICT, so that you will be able to make appropriate use of these when teaching. \r\n\r\n\r\nThe programme is the result of close collaboration between school-based mentors and the Roehampton team. It is arranged into three terms. In the first term you begin to learn how pupils develop science understanding and skills while at the same time building enough confidence to plan and teach a science lesson. The second term extends this by using teaching experience to improve lesson performance and revisit and extend issues within science education. The third term addresses science education outside the classroom and broader issues concerning the role of science within the school curriculum. Towards the end of this term, you will develop an action plan to provide a basis for progression and development within your first year of teaching. \r\n\r\n\r\nScience education at Roehampton is well staffed and resourced so that we are able to provide you with practical workshops as well as seminars and personal tutorials. Throughout the programme we aim to produce more than strong classroom practitioners; we aim also to produce reflective teachers who will go on to participate in, and influence, the future development of science education. \r\n\r\nFor more information please visit our website here.\r\n(https://www.roehampton.ac.uk/postgraduate-courses/pgce-secondary/pgce-secondary-science-specialism/)\r\n","interviewProcess":"We are continuing to interview applicants online this year. There will then be a recording for you to watch introducing the course and the subject tutor team. There will be a group interview, based on what you have learned from your observations in school and understanding of teaching in general. Each applicant will also have an  individual interview with the subject tutor lasting about 30 minutes. You will have an opportunity to ask questions about the course during this interview. You may be asked to discuss a portfolio where relevant, to give a presentation, or to show the relevance of your subject knowledge, following specific guidance. \r\n\r\n\r\nThere will also be a written task, where you will be asked to write a short piece on the role of your subject within the national curriculum. This is to check your Spelling, Punctuation and Grammar, and to see what your response would be to writing at Master’s level. These interview elements are carefully planned to give you the best possible opportunity to show your potential for teaching and working with young people in school. A teacher from one of our partner schools may take part in the interview. \r\n","howSchoolPlacementsWork":"During school placements, students benefit from working alongside experienced Science teachers. Students have opportunities to observe excellent teaching before experimenting with approaches to teaching and learning across the secondary age range, during which time they are supervised and supported by teachers and tutors. We have an extensive mentor training programme to ensure that you have access to fully-trained mentors. \r\n\r\nEach student spends a minimum of 120 days on placement. In a normal week you will be in school on a Monday, Tuesday, Thursday and a Friday with Wednesdays being spent at University. \r\n\r\nWe will arrange your placements and we take into account where you live and your available methods of transport. We also make placement decisions based on trying to ensure you have contrasting placements to give you a breadth of expereince across the course.\r\n","personalQualities":"We look for candidates who have good interpersonal skills and a strong desire to teach. Teachers need to be flexible and prepared to take on a wide range of responsibilities. It is not a requirement to have spent time in school before the course starts but many candidates find this very useful in preparing them for the realities of classroom life.","otherRequirements":"- UK enhanced DBS check is required prior to enrolment and a suitability declaration will be requested when accepting a place. If you have lived outside of the UK for a period of a year over the age of 18 then you will also be required to provide an overseas criminal records check clearance prior to starting the course.\r\n\r\n- A declaration of health questionnaire is required to assess if you are fit to teach. ","status":1,"createdAt":"2021-07-06T10:50:16.860Z","updatedAt":"2021-09-28T12:19:17.297Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
