{"id":"c06a4216-aab3-41ce-9210-6be4f7a23fed","name":"Primary","code":"2F4W","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"526a977b-9e35-4c12-8c6e-1c91376ec6e9","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"33037eab-f75d-4350-b1e2-967c41e9d4c6","code":"R48","name":"Roehampton University"},"profPost":"PG","degreeGrade":"1","english":"2","maths":"2","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We recommend A Star equivalency (https://astarequivalency.co.uk/) or Equivalency Testing (www.equivalencytesting.com) as third parties who can provide equivalency testing. Please consult their websites for costs and arrangements.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"We will help you to become a confident, highly employable primary teacher. During the course, you will receive excellent training, the majority delivered in small groups by our supportive staff. You will receive input in a broad and balanced curriculum delivered by expert tutors drawing on a range of outstanding resources. \r\n\r\nYou will gain 120 days of practical placement experience in one of our diverse range of partner schools during the course, providing you with substantial classroom experience appropriately staged throughout the year. During the placements, you will benefit from working with highly trained mentors to develop your professional practice. The course is designed to help you transition successfully to become an Early Career Teacher. Our partners include over 300 primary schools in London and the South East. \r\n\r\n\r\nGraduates of this programme are qualified to teach children across the full primary age range, but with a specialism in the Key Stage 1/2 age range.","interviewProcess":"A typical interview experience will look like this, although the order of activities may differ slightly depending on the number of people attending. \r\n\r\n\r\n \r\n(*) Written English and Maths assessment\r\n(*) Course Talk \r\n(*) One-to-one Interviews  \r\n(*) Group discussion \r\n\r\nThere will be optional campus tours timetabled throughout the year\r\n\r\nFurther information about the interview day will be made available if you are invited to attend. \r\n\r\nWhilst it is not a requirement that you have spent time observing in a school, many candidates find this very useful in helping them to understand how classrooms work. ","howSchoolPlacementsWork":"The University of Roehampton Schools Partnership encompasses a range of different types of school across London and the surrounding counties. These include:  local authority schools, academies, free schools and faith schools. The schools we work with also reflect the culturally and ethnically diverse community surrounding the University. Student Teachers benefit enormously from such varied school experiences and it is a key strength of our Partnership. We ensure that Student Teachers are offered two contrasting assessed placements (called Block School Experience 1 and 2), which meet the requirements of the age range for which their course is accredited. \r\n\r\nStudents spend a minimum of 120 days in school during the programme. Placements are driven first and foremost by the student teachers’ identified learning needs in a rich curriculum to prepare them as primary school teachers. In our 2021 exit survey, 95% of students who had finished the course rated their placement experiences highly. \r\n","personalQualities":"We look for candidates who have good interpersonal skills and a strong desire to teach. Teachers need to be flexible and prepared to take on a wide range of responsibilities. It is not a requirement to have spent time in school before the course starts but many candidates find this very useful in preparing them for the realities of classroom life.","otherRequirements":"UK enhanced DBS check is required prior to enrolment and a suitability declaration will be requested when accepting a place. If you have lived outside of the UK for a period of a year over the age of 18 then you will also be required to provide an overseas criminal records check clearance prior to starting the course.\r\n\r\nA declaration of health questionnaire is required to assess if you are fit to teach. ","status":1,"createdAt":"2021-07-06T10:50:16.682Z","updatedAt":"2021-09-28T12:23:59.153Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
