{"id":"4393c7e3-cbdf-4834-9c3a-47899aa6ad91","name":"Geography","code":"2B96","qualification":"pgce_with_qts","startDate":"2024-07-31T23:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3f47e67b-7fa5-4947-a5a0-74d528cd2a87","code":"F8","name":"Geography"}],"locations":[{"id":"b8ec997d-3684-4225-b903-98220f59402a","name":"City Campus","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"899178cc-20a7-4df5-951a-ee83c1b3d4d1","code":"S21","name":"Sheffield Hallam University"},"profPost":"PG","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"An honours degree (normally 2.2 or above) or equivalent which includes substantial elements of geography.","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Normally GCSE grade C or Grade 4 in English Language and mathematics, or equivalent. Where applicants have achieved a GCSE grade 4 or above in English literature only, we will look for further evidence of a breadth of achievement in English. We will consider applicants who are in the process of obtaining the relevant GCSEs.\n\nIf English is not your first language you must have an IELTS score of 7.0 with a minimum of 6.5 in all skills or equivalent. For equivalents see our English language entry requirements web page.","courseLength":"OneYear","feesUK":9250,"feesInternational":14895,"feeDetails":"Our tuition fees for UK students starting full-time undergraduate study in 2022/2023 are regulated by the UK government and are yet to be confirmed. For an indication, our tuition fees for UK students starting this course in 2021/22 are £9,250 for the course. For part-time study the fee will be calculated pro-rata each year based on the number of credits studied.\r\n\r\n† If you are studying an undergraduate course, postgraduate pre-registration course or postgraduate research course over more than one academic year then your tuition fees may increase in subsequent years in line with Government regulations or UK Research and Innovation (UKRI) published fees. More information can be found in our terms and conditions under student fees regulations.\r\n\r\nOur tuition fee for International/EU students starting full-time study in 2022/23 is £14,895 for the course.","financialSupport":"If you are starting a PGCE in secondary education you may be entitled to financial support: \r\n\r\nFind out more: https://www.shu.ac.uk/study-here/options/teach/bursaries\r\n","aboutCourse":"- Enhance your knowledge of geography-specific pedagogy and skills through university sessions and school-based placements.\r\n- Learn about the generic professional aspects of teaching such as behaviour management, use of data and assessment to inform planning and teaching, supporting students with special educational needs and EAL learners.\r\n- Use a range of methods to develop your skills during school-based training including teaching whole classes, working with smaller groups or individual students.\r\n\r\nBecome a qualified teacher through a range of school-based training and university-based sessions. Throughout the course you are encouraged to critically reflect on your progress through personal, academic and professional review tutorials.\r\n\r\nYou are introduced to geography-specific skills through university sessions and school-based work. You are expected to consolidate your development, both in university and in schools, by researching appropriate material and accessing wider resources.\r\n\r\nYou learn through\r\n\r\n- seminars\r\n- workshops\r\n- lectures\r\n- group work\r\n- directed tasks\r\n- school-based experiences\r\n- independent study\r\n- discussions\r\n- practical work\r\n- written assessments\r\n\r\n[Find out more on our website] (https://www.shu.ac.uk/courses/teaching-and-education/pgce-secondary-geography-with-qualified-teacher-status/full-time)","interviewProcess":"If you are shortlisted, we will invite you to a selection event, and you should bring a passport or photo driving license with you. You can bring other forms of photo ID for the selection event, but if you do, you will still need to present valid identity documents required by the Disclosure and Barring Service (DBS) at your pre-course day.\r\n\r\nThe selection event is a process which assesses if you're suitable for a place on the course. It's a chance to show us your knowledge about the subject and your enthusiasm for the career. Being invited to a selection event doesn't mean you're guaranteed a place on the course - the point of the day is to help us come to a mutual decision. We need to decide whether to make you an offer and you need to decide whether you like the course and the university.\r\n\r\nWe aim to make the interview process as rigorous and informative as possible. It's very much a two-way process, where you can evaluate what we offer while we find out more about you. In order to help us explore your thinking and subject knowledge, and for you to decide if this is the right course for you, we have a number of activities we usually use as part of the interview process.\r\n\r\n[Find out more on our website] (https://www.shu.ac.uk/visit-us/selection-events/selection-event-for-pgce-secondary-geography-1yr)\r\n\r\n","howSchoolPlacementsWork":"Currently the requirement is for trainees to gain at least 120 days of school-based experience in two contrasting school settings. On school-based training you use a range of methods and approaches in order to develop your skills including observation, collaborative planning and actual practice in the classroom through team and solo-teaching. We moderate progress against the Teachers' Standards with school visits.","personalQualities":"Candidates who are successful will demonstrate a sound understanding of teaching and how children learn, where possible within a school setting. We encourage all candidates to evidence their understanding by drawing on related examples or experiences, such as time spent in schools or other learning settings. Demonstrating an ability to make links between experience and knowledge, and their proposed career would be desirable.\r\n\r\nYou are encouraged to gain experience of schools through direct observation of teaching and learning and/or by working with young people in geography studies-related or other educational activities.\r\n","otherRequirements":"You will be required to complete a declaration of criminal convictions and health check forms. For more information, visit the [course page under entry requirements](https://www.shu.ac.uk/courses/teaching-and-education/pgce-secondary-geography-with-qualified-teacher-status/full-time)\r\n\r\nIf English is not your first language you must have an IELTS score of 7.0 with a minimum of 6.5 in all skills or equivalent.\r\n","status":1,"createdAt":"2021-07-06T10:53:03.891Z","updatedAt":"2021-10-05T07:27:13.427Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
