{"id":"458a70ea-ea2c-495b-9f46-0f96255a60d0","name":"Design and Technology","code":"W9X1","qualification":"pgce_with_qts","startDate":"2022-07-31T23:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"118fabd7-86d0-4a40-9e9a-e5c302abe59b","code":"DT","name":"Design and technology"}],"locations":[{"id":"8ef0215e-03a2-4d27-ae34-f010ee021527","name":"Clifton Campus","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"526a977b-9e35-4c12-8c6e-1c91376ec6e9","name":"Main Site","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"61f9a306-7cc4-4709-ba20-beb23a7549e6","name":"Torquay Academy","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"304c911c-20d4-4b51-84c7-0a1322934ab3","name":"Main Site","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"5c10fb00-249f-4da9-b36e-1ac44ccbf3de","name":"Main Site","isPublished":"false","status":"suspended","vacancies":"full_time"},{"id":"d20bcf2c-7ac6-4a44-aa62-ab5e5bbf45be","name":"Main Site (Avon Campus)  -  Central Training.","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"659d6384-2780-4a78-93c6-5d150a796437","name":"Bath Spa University","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"b8ec997d-3684-4225-b903-98220f59402a","name":"City Campus","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"bc9cd9a2-ef4a-4d7d-ae23-09f99c3a9d56","name":"Main Site","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"c5ca60ba-518c-473e-b4d8-e804946b30da","name":"University of Wolverhampton","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"76880438-2931-40e2-83d4-d32cb549f95d","name":"Main Site","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"151c1d0a-db10-452c-9204-a170a8dfc1cc","name":"Twynham School - Subject Training","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"56c51a5c-2e4e-417c-9f96-264b313c70d5","name":"Main Site","isPublished":"true","status":"running","vacancies":"full_time"}],"trainingProvider":{"id":"899178cc-20a7-4df5-951a-ee83c1b3d4d1","code":"S21","name":"Sheffield Hallam University"},"profPost":"PG","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"An honours degree (normally 2.2 or above) or equivalent which includes substantial elements of design and technology study.","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Normally GCSE grade C or Grade 4 in English Language and mathematics, or equivalent. Where applicants have achieved a GCSE grade 4 or above in English literature only, we will look for further evidence of a breadth of achievement in English. We will consider applicants who are in the process of obtaining the relevant GCSEs.\n\nIf English is not your first language you must have an IELTS score of 7.0 with a minimum of 6.5 in all skills or equivalent.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"The programme is structured with a core of Design and Technology taught to all students, including the nature of design and technology in education, ICT and graphics. You will be given the opportunity to specialise in one of the four main areas materials technology, electronic and communications technology (ECT), food technology or textiles technology and to develop a second strength in at least one of these areas. We focus on extending and developing your knowledge, understanding and skills of design and making, with an emphasis on active practical learning and problem solving. A range of specialist facilities and resources is used by tutors from Roehampton, and local schools are carefully selected to ensure you have the support and advice of experienced design and technology teachers. \r\n\r\n\r\nApplicants should have a degree that includes a substantial element of design and technology (such as product design, 3D design, engineering, food product development, and nutrition, textiles or fashion design). \r\n\r\nFor more information please see our website here\r\n(https://www.roehampton.ac.uk/postgraduate-courses/pgce-secondary/pgce-secondary-design-and-technology-specialism/)\r\n\r\n","interviewProcess":"We are continuing to interview applicants online this year. There will then be a recording for you to watch introducing the course and the subject tutor team. There will be a group interview, based on what you have learned from your observations in school and understanding of teaching in general. Each applicant will also have an  individual interview with the subject tutor lasting about 30 minutes. You will have an opportunity to ask questions about the course during this interview. You may be asked to discuss a portfolio where relevant, to give a presentation, or to show the relevance of your subject knowledge, following specific guidance. \r\n\r\n\r\nThere will also be a written task, where you will be asked to write a short piece on the role of your subject within the national curriculum. This is to check your Spelling, Punctuation and Grammar, and to see what your response would be to writing at Master’s level. These interview elements are carefully planned to give you the best possible opportunity to show your potential for teaching and working with young people in school. A teacher from one of our partner schools may take part in the interview. \r\n","howSchoolPlacementsWork":"During school placements, students benefit from working alongside experienced Design and Technology teachers. Students have opportunities to observe excellent teaching before experimenting with approaches to teaching and learning across the secondary age range, during which time they are supervised and supported by teachers and tutors. We have an extensive mentor training programme to ensure that you have access to fully-trained mentors. \r\n\r\nEach student spends a minimum of 120 days on placement. In a normal week you will be in school on a Monday, Tuesday, Thursday and a Friday with Wednesdays being spent at University. \r\n\r\nWe will arrange your placements and we take into account where you live and your available methods of transport. We also make placement decisions based on trying to ensure you have contrasting placements to give you a breadth of expereince across the course.\r\n","personalQualities":"","otherRequirements":"UK enhanced DBS check is required prior to enrolment and a suitability declaration will be requested when accepting a place. If you have lived outside of the UK for a period of a year over the age of 18 then you will also be required to provide an overseas criminal records check clearance prior to starting the course.\r\n\r\nA declaration of health questionnaire is required to assess if you are fit to teach. ","status":1,"createdAt":"2021-07-06T10:50:17.133Z","updatedAt":"2021-09-28T12:20:09.624Z"}