{"id":"7039f2fa-93bf-4231-9d28-88cf3740858c","name":"Modern Languages (French, German, Spanish)","code":"R9X1","qualification":"pgce_with_qts","startDate":"2024-07-31T23:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"e34fd2a3-a32e-44e9-aea1-666badf3ac03","code":"22","name":"Spanish"},{"id":"ce8523ef-9236-4cd9-b260-d826c7a521b3","code":"ML","name":"Modern Languages"},{"id":"9727f674-61ba-4efa-b1f2-21ec7e354442","code":"15","name":"French"},{"id":"fbb00c08-2dbc-4f26-adb3-3b23afba18c1","code":"17","name":"German"}],"locations":[{"id":"b8ec997d-3684-4225-b903-98220f59402a","name":"City Campus","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"899178cc-20a7-4df5-951a-ee83c1b3d4d1","code":"S21","name":"Sheffield Hallam University"},"profPost":"BO","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"An honours degree (normally 2.2 or above) or equivalent, that includes substantial study in at least one modern foreign language. Or you need to be a native speaker of French, Spanish or German with any degree plus evidence of recent language study.","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Normally GCSE grade C or Grade 4 in English Language and mathematics, or equivalent. Where applicants have achieved a GCSE grade 4 or above in English literature only, we will look for further evidence of a breadth of achievement in English. We will consider applicants who are in the process of obtaining the relevant GCSEs.\n\nIf English is not your first language you must have an IELTS score of 7.0 with a minimum of 6.5 in all skills or equivalent. For equivalents see our English language entry requirements web page.","courseLength":"OneYear","feesUK":9250,"feesInternational":14895,"feeDetails":"Our tuition fees for UK students starting full-time undergraduate study in 2022/2023 are regulated by the UK government and are yet to be confirmed. For an indication, our tuition fees for UK students starting this course in 2021/22 are £9,250 for the course. For part-time study the fee will be calculated pro-rata each year based on the number of credits studied.\r\n\r\n† If you are studying an undergraduate course, postgraduate pre-registration course or postgraduate research course over more than one academic year then your tuition fees may increase in subsequent years in line with Government regulations or UK Research and Innovation (UKRI) published fees. More information can be found in our terms and conditions under student fees regulations.\r\n\r\nOur tuition fee for International/EU students starting full-time study in 2022/23 is £14,895 for the course.\r\n","financialSupport":"If you are starting a PGCE in secondary education you may be entitled to financial support: \r\n\r\nFind out more: https://www.shu.ac.uk/study-here/options/teach/bursaries\r\n","aboutCourse":"- Train and become a qualified, competent teacher of key stage 3 to post-16 French, Spanish or German.\r\n- Gain hands-on experience of the school environment with 120 days placement work.\r\n- Attain a masters-level PGCE, or a PCE, along with your Qualified Teacher Status.\r\n- Work in a supportive, collaborative environment, with wide-ranging teaching methods.\r\n\r\nBecome a capable, employable German, French and Spanish teacher, languages which may make you eligible for an NCTL-funded Subject Knowledge Enhancement course. You explore your languages in depth, leaving with advanced qualifications. You undertake 120 days' placement work, with close academic support and mentoring throughout.\r\n\r\nThe vocational nature of this course is designed to provide capable, employable German, French and Spanish teachers - having at least two of these languages is a distinct advantage. You'll explore your languages in further detail, leaving with advanced qualifications, and learn how to enthuse and motivate others in these subjects. You'll undertake 120 days' placement work, with close academic support and mentoring throughout, and benefit from wide-ranging teaching methods on-campus.\r\n\r\nYou learn through\r\n\r\n- 120 days of school-based training\r\n- seminars\r\n- workshops\r\n- lectures\r\n- observation\r\n- collaborative planning\r\n- one-to-one sessions\r\n- group work\r\n- practical work\r\n- independent study\r\n- written assessments\r\n\r\n[Find out more on our website] (https://www.shu.ac.uk/courses/teaching-and-education/pgce-secondary-modern-foreign-languages-with-qualified-teacher-status/full-time)","interviewProcess":"If you are shortlisted, we will invite you to a selection event, and you should bring a passport or photo driving license with you. You can bring other forms of photo ID for the selection event, but if you do, you will still need to present valid identity documents required by the Disclosure and Barring Service (DBS) at your pre-course day.\r\n\r\nThe selection event is a process which assesses if you're suitable for a place on the course. It's a chance to show us your knowledge about the subject and your enthusiasm for the career. Being invited to a selection event doesn't mean you're guaranteed a place on the course - the point of the day is to help us come to a mutual decision. We need to decide whether to make you an offer and you need to decide whether you like the course and the university.\r\n\r\nWe aim to make the interview process as rigorous and informative as possible. It's very much a two-way process, where you can evaluate what we offer while we find out more about you. In order to help us explore your thinking and subject knowledge, and for you to decide if this is the right course for you, we have a number of activities we usually use as part of the interview process.\r\n\r\n[Find out more on our website] (https://www.shu.ac.uk/visit-us/selection-events/selection-event-for-pgce-secondary-modern-foreign-languages-1yr)","howSchoolPlacementsWork":"This course ensures that you'll have the real-life experience you need to enter teaching. You'll spend 120 days in two separate schools of 11-16 and 11-18 age groups, with school-based mentors and campus-based tutors monitoring your progress and providing support. Upon graduating, many of our students go into full-time employment at their placement school.","personalQualities":"Candidates who are successful will demonstrate a sound understanding of teaching and how children learn, where possible within a school setting. We encourage all candidates to evidence their understanding by drawing on related examples or experiences, such as time spent in schools or other learning settings. Demonstrating an ability to make links between experience and knowledge, and their proposed career would be desirable.\r\n\r\nYou are encouraged to gain experience of schools through direct observation of teaching and learning and/or by working with young people in modern foreign languages-related or other educational activities.\r\n","otherRequirements":"You will be required to complete a declaration of criminal convictions and health check forms. For more information, visit the [course page under entry requirements](https://docs.google.com/document/d/1Lfr1-E6qpMciirf9wyaewTZxVzDqUnOR/edit)\r\n\r\nIf English is not your first language you must have an IELTS score of 7.0 with a minimum of 6.5 in all skills or equivalent. \r\n","status":1,"createdAt":"2021-07-06T10:53:04.363Z","updatedAt":"2021-10-05T07:29:26.149Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
