{"id":"7196b2aa-7b21-40f8-be7d-c019552f5728","name":"Primary (Physical Education)","code":"2MZY","qualification":"pgce_with_qts","startDate":"2024-09-20T23:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"5ae4c96e-1da2-4831-91a3-64439b606fed","code":"06","name":"Primary with physical education"}],"locations":[{"id":"b8ec997d-3684-4225-b903-98220f59402a","name":"City Campus","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"899178cc-20a7-4df5-951a-ee83c1b3d4d1","code":"S21","name":"Sheffield Hallam University"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"GCSE grade C or Grade 4 in English Language and mathematics and science, or equivalent. Where applicants have achieved a GCSE grade 4 or above in English literature only, we will look for further evidence of a breadth of achievement in English.","courseLength":"OneYear","feesUK":9250,"feesInternational":14460,"feeDetails":"Our tuition fees for UK students starting full-time undergraduate study in 2022/2023 are regulated by the UK government and are yet to be confirmed. For an indication, our tuition fees for UK students starting this course in 2021/22 are £9,250 for the course. For part-time study the fee will be calculated pro-rata each year based on the number of credits studied.\r\n\r\n† If you are studying an undergraduate course, postgraduate pre-registration course or postgraduate research course over more than one academic year then your tuition fees may increase in subsequent years in line with Government regulations or UK Research and Innovation (UKRI) published fees. More information can be found in our terms and conditions under student fees regulations.\r\n\r\nOur tuition fee for International/EU students starting full-time study in 2022/23 is £14,895 for the course.","financialSupport":"If you are starting a PGCE in Primary education you may be entitled to financial support: \r\n\r\nFind out more: https://www.shu.ac.uk/study-here/options/teach/bursaries\r\n","aboutCourse":"- Develop your teaching skills and confidence during placements with local and regional primary schools\r\n- Gain an up-to-date knowledge of core Key Stage 1 and 2 subjects including English, science and mathematics\r\n- Take part in a summer school PE and sport programme designed to develop your specialist skills to lead physical education in a primary school setting.\r\n\r\nThis course prepares you for a career as a skilled primary teacher, specialising in physical education. As well as dedicated PE tuition, you gain an up-to-date knowledge of core Key Stage 1 and 2 subjects including English, science and mathematics.\r\n\r\nYour learning is based on an equal balance of physical education and the core aspects of the primary curriculum. You receive extensive training in English, maths, science and primary practice, alongside specialist PE teaching tuition and experience.\r\n\r\nYou learn through\r\n\r\n- professional placements\r\n- lectures and seminars\r\n- workshops\r\n\r\n[Find out more on our website] (https://www.shu.ac.uk/courses/teaching-and-education/pgce-primary-education-511-physical-education-specialist-with-qualified-teacher-status/full-time)","interviewProcess":"If you are shortlisted, we will invite you to a selection event, and you should bring a passport or photo driving license with you. You can bring other forms of photo ID for the selection event, but if you do, you will still need to present valid identity documents required by the Disclosure and Barring Service (DBS) at your pre-course day.\r\n\r\nThe selection event is a process which assesses if you're suitable for a place on the course. It's a chance to show us your knowledge about the subject and your enthusiasm for the career. Being invited to a selection event doesn't mean you're guaranteed a place on the course - the point of the day is to help us come to a mutual decision. We need to decide whether to make you an offer and you need to decide whether you like the course and the university.\r\n\r\nWe aim to make the interview process as rigorous and informative as possible. It's very much a two-way process, where you can evaluate what we offer while we find out more about you. In order to help us explore your thinking and subject knowledge, and for you to decide if this is the right course for you, we have a number of activities we usually use as part of the interview process.\r\n\r\n[Find out more on our website] (https://www.shu.ac.uk/visit-us/selection-events/selection-event-for-pgce-primary-5-11-pe-specialist-with-qts)","howSchoolPlacementsWork":"During the course you develop your teaching skills and confidence during professional placements in at least two schools across the two key stages. You can also opt to take part in a one week international PE teaching placement.\r\n\r\nYou also take part in a compulsory summer school, designed to enhance your teaching skills.","personalQualities":"Candidates who are successful will demonstrate a sound understanding of teaching and how children learn, where possible within a school setting. We encourage all candidates to evidence their understanding by drawing on related examples or experiences, such as time spent in schools or other learning settings. Demonstrating an ability to make links between experience and knowledge, and their proposed career would be desirable.\r\n","otherRequirements":"You will be required to complete a declaration of criminal convictions and health check forms. For more information, visit the [course page under entry requirements](https://www.shu.ac.uk/courses/teaching-and-education/pgce-primary-education-511-physical-education-specialist-with-qualified-teacher-status/full-time)\r\n\r\nIf English is not your first language you must have an IELTS score of 7.0 with a minimum of 6.5 in all skills or equivalent. \r\n","status":1,"createdAt":"2021-07-06T10:53:03.990Z","updatedAt":"2021-10-05T07:36:51.790Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
