{"id":"e77e90f8-7e22-40dc-a3dc-1d018e4f866e","name":"Design and Technology (Engineering)","code":"HXC9","qualification":"pgce_with_qts","startDate":"2024-09-20T23:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"118fabd7-86d0-4a40-9e9a-e5c302abe59b","code":"DT","name":"Design and technology"}],"trainingProvider":{"id":"899178cc-20a7-4df5-951a-ee83c1b3d4d1","code":"S21","name":"Sheffield Hallam University"},"profPost":"BO","english":"3","maths":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feesInternational":14460,"feeDetails":"Our tuition fee for EU students starting full-time study in 2021/22 is £14,460 for the course.\r\n\r\n","financialSupport":"If you are starting a PGCE in secondary education you may be entitled to financial support: \r\n\r\nFind out more: https://www.shu.ac.uk/study-here/options/teach/bursaries\r\n","aboutCourse":"- Train for a rewarding career in secondary engineering teaching.\r\n- Undertake 120 days of school-based training in two different school settings.\r\n- Participate in practical work in our well-equipped facilities to help you learn creative and innovative teaching methods.\r\n- Attain a masters-level PGCE, or a PCE alongside Qualified Teacher status (QTS).\r\n\r\nGrow academically and professionally on a course that has, as its primary aim, the development and supply of competent teachers who are capable of securing employment in an education setting. You graduate as an experienced and employable engineering teacher, ready to inspire young people.\r\n\r\nThis course provides an advanced academic qualification alongside the real-world experience in school settings. Along with honing your engineering skills, you'll learn crucial teaching techniques including behaviour management and student support. There are 120 days of school-based training that allow you to become used to the realities of teaching before graduation. You are assessed through supportive, collaborative means, helping you to grow and improve.\r\n\r\nYou learn through\r\n\r\n- 120 days of school based training across at least two settings\r\n- classes in our well-equipped facilities\r\n- seminars and lectures\r\n- workshops\r\n- school-based experiences\r\n- independent study\r\n- group work\r\n- practical work\r\n- written assessments and feedback\r\n\r\n[Find out more on our website] (https://www.shu.ac.uk/courses/teaching-and-education/pgce-secondary-engineering-with-qualified-teacher-status/full-time)","interviewProcess":"If you are shortlisted, we will invite you to a selection event, and you should bring a passport or photo driving license with you. You can bring other forms of photo ID for the selection event, but if you do, you will still need to present valid identity documents required by the Disclosure and Barring Service (DBS) at your pre-course day.\r\n\r\nThe selection event is a process which assesses if you're suitable for a place on the course. It's a chance to show us your knowledge about the subject and your enthusiasm for the career. Being invited to a selection event doesn't mean you're guaranteed a place on the course - the point of the day is to help us come to a mutual decision. We need to decide whether to make you an offer and you need to decide whether you like the course and the university.\r\n\r\nWe aim to make the interview process as rigorous and informative as possible. It's very much a two-way process, where you can evaluate what we offer while we find out more about you. In order to help us explore your thinking and subject knowledge, and for you to decide if this is the right course for you, we have a number of activities we usually use as part of the interview process.\r\n\r\n[Find out more on our website] (https://www.shu.ac.uk/visit-us/selection-events/selection-event-pgce-secondary-engineering-qts)","howSchoolPlacementsWork":"This course ensures that you'll have the real-life experience you need to enter teaching. You'll spend 120 days across two or more sites, with school-based mentors and campus-based tutors monitoring your progress and providing support. Upon graduating, many of our students go into full-time employment at their placement school.\r\n\r\nYou will take responsibility for your own development against the statutory requirements for QTS and will record your progress in a Professional Development Portfolio (PDP). This collaborative process involves you, university-based tutors and school-based mentors. As you complete the course you will review your progress, plan for your entry to the teaching profession and for your ongoing development as a Newly Qualified Teacher (NQT).","personalQualities":"Candidates who are successful will demonstrate a sound understanding of teaching and how children learn, where possible within a school setting. We encourage all candidates to evidence their understanding by drawing on related examples or experiences, such as time spent in schools or other learning settings. Demonstrating an ability to make links between experience and knowledge, and their proposed career would be desirable.\r\n\r\nYou are encouraged to gain experience of schools through direct observation of teaching and learning and/or by working with young people in engineering -related or other educational activities. ","otherRequirements":"You will be required to complete a declaration of criminal convictions and health check forms\r\n\r\nIf English is not your first language you need an IELTS average score of 7.0 with at least 6.5 in all skills, or a TOEFL score of 235\r\n(Internet based).\r\n","status":2,"createdAt":"2021-07-06T10:53:04.226Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
