{"id":"ecf6a900-de37-4152-bbb0-1dea9e164c2d","name":"Post-16 and Further Education","code":"XQ33","qualification":"pgce","startDate":"2024-09-20T23:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"B","subjectLevel":"further_education","isSend":"no","subjects":[{"id":"9de4b2d2-5739-4c34-92d2-9b4384760298","code":"41","name":"Further education"}],"locations":[{"id":"b8ec997d-3684-4225-b903-98220f59402a","name":"City Campus","isPublished":"Y","status":"R","vacancies":"B"}],"trainingProvider":{"id":"899178cc-20a7-4df5-951a-ee83c1b3d4d1","code":"S21","name":"Sheffield Hallam University"},"profPost":"PG","degreeGrade":"1","english":"9","maths":"9","science":"9","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Normally GCSE grade C or Grade 4 in English Language and mathematics, or equivalent. Where applicants have achieved a GCSE grade 4 or above in English literature only, we will look for further evidence of a breadth of achievement in English. We will consider applicants who are in the process of obtaining the relevant GCSEs.\n\nIf English is not your first language you must have an IELTS score of 7.0 with a minimum of 6.5 in all skills or equivalent. For equivalents see our English language entry requirements web page.","courseLength":"OneYear","feesUK":9250,"feesInternational":14460,"feeDetails":"Our tuition fee for UK students starting full-time study in 2021/22 is £9,250 for the course. Our tuition fee for International/EU students starting full-time study in 2021/22 is £14,460 for the course.","financialSupport":"Please visit: https://www.feadvice.org.uk/i-want-work-fe-skills-sector","aboutCourse":"- Develop and apply your knowledge and understanding of educational ideas and theories.\r\n- Engage with the latest developments in the Post-16 and Further Education context.\r\n- Complete this course to apply for Qualified Teacher Learning and Skills (QTLS) status for Post-16 and Further Education.\r\n- Gain the qualification you need to teach in the area of Post-16 and Further Education, previously known as Post-Compulsory Education and Training (PCET). \r\n\r\nThis course is for anyone who is new to teaching and needs us to find them a placement, or who is already working as a teacher or trainer and wants to become qualified.\r\n\r\nWe also offer this course with special educational needs to become an effective teacher in Special Educational Needs (SEN) at post-16 level.\r\n\r\nKey areas you will learn about include planning and preparing to teach, assessment for learning, teaching strategies and approaches, behaviour for learning, using technology to enhance learning and progression against the Professional Standards. After successfully completing the course, you gain either a Professional Graduate Certificate in Education and Training, or a level 5 Professional Certificate in Education and Training. The level 7 qualification includes 60 credits at level 7 that can be used towards a masters course.\r\n\r\nYou learn through\r\n\r\n- assessment of practical teaching\r\n- presentations\r\n- planning and evaluation exercises\r\n- preparation of teaching materials\r\n- written assignments\r\n\r\n[Find out more on our website](https://www.shu.ac.uk/courses/teaching-and-education/pgce-post-16-and-further-education/full-time)","interviewProcess":"If you are shortlisted, we will invite you to a selection event, and you should bring a passport or photo driving license with you. You can bring other forms of photo ID for the selection event, but if you do, you will still need to present valid identity documents required by the Disclosure and Barring Service (DBS) at your pre-course day.\r\n\r\nThe selection event is a process which assesses if you're suitable for a place on the course. It's a chance to show us your knowledge about the subject and your enthusiasm for the career. Being invited to a selection event doesn't mean you're guaranteed a place on the course - the point of the day is to help us come to a mutual decision. We need to decide whether to make you an offer and you need to decide whether you like the course and the university.\r\n\r\nWe aim to make the interview process as rigorous and informative as possible. It's very much a two-way process, where you can evaluate what we offer while we find out more about you. In order to help us explore your thinking and subject knowledge, and for you to decide if this is the right course for you, we have a number of activities we usually use as part of the interview process.\r\n\r\n[Find out more on our website] (https://www.shu.ac.uk/Study-here/options/Teach/Selection-events)","howSchoolPlacementsWork":"You'll spend part of each week in placement with an additional block placement at the end of the course. As placement-based learning is embedded throughout, you'll be well prepared for the work force you will be joining. You are fully briefed on the expectations of the role of a professional teacher and will experience some of the demands of employment first hand whilst on placement. You'll be required to reflect on your development against current professional standards and to action a plan to promote further progression ready for employment.\r\n\r\nTypical placements take place at \r\n- further education colleges\r\n- school sixth forms\r\n- higher education institutions\r\n- adult and community learning providers\r\n- private training companies \r\n- public services\r\n- 14-19 educational providers.","personalQualities":"Candidates who are successful will demonstrate a sound understanding of teaching and how students learn, where possible within a post-16 setting. We encourage all candidates to evidence their understanding by drawing on related examples or experiences, such as time spent in schools or other learning settings. Demonstrating an ability to make links between experience and knowledge, and their proposed career would be desirable.\r\n\r\n","otherRequirements":"In-service students must have evidence that they are already working as a teacher or tutor, will teach a minimum of 60 hours in each year of the course, and that their employer will provide a specialist mentor to support them\r\n\r\nYou will be required to complete a declaration of criminal convictions and health check forms. For more information, visit the [course page under entry requirements](https://www.shu.ac.uk/courses/teaching-and-education/pgce-post-16-and-further-education/full-time)\r\n\r\nIf English is not your first language you must have an IELTS score of 7.0 with a minimum of 6.5 in all skills or equivalent. \r\n","status":1,"createdAt":"2021-07-06T10:53:04.553Z","updatedAt":"2021-10-05T11:21:57.164Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
