{"id":"c0b5a1d5-d3ec-4501-bc5a-a60dbf215245","name":"Physical education","code":"Y010","qualification":"qts","startDate":"2024-05-31T23:00:00.000Z","applicationsOpenDate":"other","programType":"TA","fundingType":"apprenticeship","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"74d64a54-5e34-4590-b6c7-528dd0cf26fe","code":"C6","name":"Physical education"}],"locations":[{"id":"532b4eb7-8bcb-4d34-977a-df328754112c","name":"Main Site","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"bc44648d-e0e6-4afe-9ce2-0dbfdb96c45d","code":"1EE","name":"Heronsgate Primary School"},"accreditedBody":{"id":"b3681bbc-2e2a-49c3-aa4e-e453a8d0e4a5","code":"G70","name":"University of Greenwich"},"english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"This course will start in June 2021 and learners will gain QTS and complete their Apprenticeship by July 2022.","feesUK":null,"aboutCourse":"This is a graduate teaching apprenticeship. Apprentices will be employed by a school as an unqualified teacher and apply through UCAS to train. Successful apprentices will gain Qualified Teacher Status (QTS) and their apprenticeship.\r\n\r\nApprentices will be working in schools teaching classes for 80% of their time. Pedagogical training will be delivered by the University of Greenwich. \r\n\r\nThis course is predominately aimed at Teaching Assistants (TAs) and Higher Level Teaching Assistants (HLTAs) who are working in schools and want to become qualified teachers. Applicants need to have the full support of their Headteacher. Applicants cannot be considered if they are not already employed in a school.\r\n\r\nApprentices have a timetable of classes and will be responsible for teaching classes. \r\n\r\nApprentices will receive a mixture of bespoke taught sessions and taught Professional Studies sessions shared with PGCE and School Direct trainees. This means apprentices will be taught by a range of school partners and academics, each with specialist interests and relevant experiences. It will also enable apprentices to have networking opportunities with trainee colleagues studying in a range of schools.\r\n","interviewProcess":"Applicants will be interviewed and employed as an unqualified teacher by their current school. \r\n\r\nApplicants then apply through UCAS and will be contacted by the Royal Greenwich Apprenticeship Team to discuss their application. ","howSchoolPlacementsWork":"Apprentices work mainly in the school where they are employed. \r\n\r\nApprentices are required to complete a second placement in another school. The second placement will be for a minimum of 6 weeks and our partnership will support in arranging this.\r\n\r\nApprentices will have a school-based mentor who will have access to training and regular network meetings. ","personalQualities":"Applicants must have the capacity to develop into outstanding teachers. This requires a combination of personal and academic skills. Our schools are families of like-minded people, passionate about the lives of the young people they work with.\r\n\r\nYou should demonstrate awareness of what good teaching entails and show a desire to teach.\r\n\r\nOur schools are looking for teachers who have great subject knowledge and high expectations for their students. Applicants must be hard-working, resilient and have a sense of humour. \r\nYou will need to be willing to learn from your colleagues and our students alike, demonstrating your creativity and enthusiasm.\r\n","otherRequirements":"During induction at the University of Greenwich, apprentices will undertake diagnostic mathematics and English tasks in order to identify the extent to which they satisfy the standards regarding subject knowledge in these subjects that all teachers are expected to hold. The outcomes of these tests will be shared with employers, in order that interventions can be put in place by employing schools, if necessary.\r\n\r\nAll candidates will need to have an advanced DBS check, and their employing schools will need to demonstrate that statutory safeguarding checks have been carried out.\r\n","status":2,"createdAt":"2021-07-06T10:55:30.227Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","applicationsOpenDateOther":"2022-04-06T00:00:00.000Z"}
