{"id":"53fd0e33-cf25-4ee3-ba61-c3fc10c70c05","name":"Primary (January Intake)","code":"3FPC","qualification":"pgce_with_qts","startDate":"2024-01-01T00:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"f6d12cc4-e091-4a8a-8d4a-016a83332c86","name":"Sir Tom Cowie Campus","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"926804ac-be7a-4f0a-97f9-a26a5f5f032a","code":"S84","name":"University of Sunderland"},"degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We will only accept equivalencies from www.equivalencytesting.com","courseLength":"OneYear","feesUK":9250,"feesInternational":13000,"aboutCourse":"YOU CAN OPT TO START IN JANUARY 2021 - PLEASE ENSURE YOU CLARIFY YOUR YEAR OF ENTRY ON YOUR APPLICATION.\r\n\r\nThis course combines theoretical and practical learning. You will develop your knowledge of the role of the teacher and the needs of learners, and you will have dedicated modules that focus on Mathematics, English, Science, and other subjects that form a foundation for children’s education within a Primary School.\r\n\r\nYou will have the opportunity to enjoy assessed placements in two school settings, in either 3-7 or 7-11 age range experiencing a variety of environments and contexts.\r\n\r\n In addition, we will provide you with Theory Linked Practice (TLP) days in schools enabling you to experience different types of learning needs including; Early Years Foundation Stage, Special Educational Needs and Disability, Children of English with an Additional Language, Key Stages 3 and 4, and settings which have particular problems with diversity and inclusion in the school setting.\r\n\r\nFor more info please visit; https://www.sunderland.ac.uk/study/education/pgce-primary-education/","interviewProcess":"If your application has been successfully shortlisted for a January 2022 start you will be invited to attend an online interview, this will take place on Microsoft Teams.  Applicants will be able to choose from a selection of dates and times and will only need to attend interview once.\r\n\r\nEssential details of the day will be sent to you via email prior to the interview so you will be very well prepared for the day.\r\n\r\nOnline interviews will be led by the academics on the course, and will consist of individual and group tasks.","howSchoolPlacementsWork":"Prior to starting the programme, trainees are encouraged to spend time on a five-day Pre-Programme Placement, assisting and observing in a primary school of their own choice. This ensures that trainees starting the programme have recent and relevant experience in school settings and they understand the diet of education that primary school pupils experience before transitioning to middle or secondary schools.  This experience also provides an understanding of current education practice that is built upon during lectures at the University and in the Teaching Practice which follows.\r\n\r\nStudents following a University based PGCE programme spend three days per week in their placement school undertaking observation and preparation for their later assessed period of teaching. The remaining time in these weeks is spent at University consolidating their experience and learning subject related content alongside wider education theory and practice.  \r\n\r\nTrainees undertake a number of assessed full weeks of teaching, all of which we aim to ensure take place in a single setting.  At the end of this placement, targets and feedback from the setting are used by tutors and placement team to help find a complimentary setting for your second teaching practice.\r\n ","personalQualities":"We do not look for a one size fits all model of a trainee teacher – quite the opposite. We are looking for people who demonstrate a passion for developing the learning experiences of young people. An awareness of young people is an advantage and may come from a wide variety of sources.  We do, however, look for trainee teachers who are willing to have a go; eager to engage, and up for a challenge. We create confident, competent teachers and a willingness to take on board feedback and use it to develop is something we look for.","otherRequirements":"In addition to academic qualifications, you must also:\r\n\r\n•Have an enhanced Disclosure and Barring Service (DBS) check (supplied by the University once applicant passes interview)\r\n\r\n•Complete a medical pro forma (based on DFEE Circular 8/92)\r\n(supplied by the University once applicant passes interview)\r\n\r\n•The Government have stated that they will be removing the Professional Skills Test condition for all Teacher Trainees  from April 2020. \"A new process for assessing numeracy and literacy will be introduced for ITT starting in 2020\" This means applicants do not need to pass a numeracy or literacy test as a condition to their offer.","status":1,"createdAt":"2021-07-06T10:48:30.729Z","updatedAt":"2021-07-16T08:35:14.091Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
