{"id":"81095267-ea4b-4e15-9a99-d0d984fbb243","name":"Primary","code":"38QR","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"P","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"3e75285d-0127-4837-8952-1c863aa371d8","name":"Main Site","isPublished":"N","status":"S","vacancies":"P"},{"id":"7e995f62-35e9-44cb-b878-bcd43fd24731","name":"Off-campus","isPublished":"Y","status":"R","vacancies":"P"}],"trainingProvider":{"id":"926804ac-be7a-4f0a-97f9-a26a5f5f032a","code":"S84","name":"University of Sunderland"},"degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We will only accept equivalencies from www.equivalencytesting.com","courseLength":"TwoYears","feesUK":4625,"feeDetails":"The cost of this course is £4,625 per year of study.\r\n\r\nPlease contact the University of Sunderland directly to confirm the fee for this course: 0191 515 3000","aboutCourse":"This 2 year part time blended Primary PGCE with QTS course is ideal for those holding a first degree who prefer a blended approach to their learning and the opportunity to complete a PGCE over 2 years, and not the standard 1 year.\r\n\r\nThe programme is taught online via Independent Distance Learning (IDL) with some focused on-campus learning sessions and classroom based practice in school. The programme covers the development of teaching and learning across all National Curriculum subjects and Professional Learning – including safeguarding, behaviour management and overcoming barriers to learning. All trainees complete Practice of Teaching modules where they develop their theoretical understanding in practical situations in Early Years and/or Primary Classrooms to prepare them for achieving QTS.\r\n\r\nTrainees are given the opportunity to specialise in the 3-7 year olds route or the 7-11 year olds route, leading to gaining a PGCE in Primary Education with QTS.\r\n\r\nYou will be taught through online and distance learning methods including lecture casts, chat rooms and blogs, face to face lectures and workshops, and online forums with personal tutors. You will also engage in work-based training through bespoke teaching placements. Assessment is through a range of methods including electronic assignment submissions, case studies, observations, presentations, and production and evaluation of learning resources.\r\n\r\nYou will be expected to study approximately 16 hours a week. You will spend two weekends on campus, one in Year 1 and one in Year 2. In order to be eligible for the award of PGCE with QTS, you must also spend a minimum of 120 days in school.\r\n\r\nAlthough you can complete your placement in the school you currently work in, as part of your training you will also need to spend part of the assessed placement in an alternate setting.\r\n\r\nPrior to starting the course, you are required to carry out a five-day pre-programme placement, assisting and observing in a primary school of your own choice, with a focus on your elected route. This ensures that all students starting the course have recent and relevant experience in school settings, which will subsequently be built upon during lectures at the University and in the Teaching Practice that follows. During the pre-programme placement, you will complete a pre-placement handbook, which is used as a record of the tasks carried out and a starting point for discussion with your personal tutor\r\n\r\nFor more information visit: https://www.sunderland.ac.uk/study/education/pgce-primary-education-idl/","interviewProcess":"If your application has been successfully shortlisted for a September 2022 start you will be invited to attend an online interview, this will take place on Microsoft Teams.  Applicants will be able to choose from a selection of dates and times and will only need to attend interview once.\r\n\r\nEssential details of the day will be sent to you via email prior to the interview so you will be very well prepared for the day.\r\n\r\nOnline interviews will be led by the academics on the course, and will consist of individual and group tasks.","howSchoolPlacementsWork":"Prior to starting the course, you are required to carry out a five-day pre-programme placement, assisting and observing in a primary school of your own choice, with a focus on your elected route. \r\n\r\nYou will be expected to study approximately 16 hours a week. You will spend two weekends on campus, one in Year 1 and one in Year 2. In order to be eligible for the award of PGCE with QTS, you must also spend a minimum of 120 days in school. \r\n\r\nAlthough you can complete your placement in the school you currently work in, as part of your training you will also need to spend part of the assessed placement in an alternate setting.\r\n","personalQualities":"We do not look for a one size fits all model of a trainee teacher – quite the opposite. We are looking for people who demonstrate a passion for developing the learning experiences of young people. An awareness of young people is an advantage and may come from a wide variety of sources.  We do, however, look for trainee teachers who are willing to have a go; eager to engage, and up for a challenge. We create confident, competent teachers and a willingness to take on board feedback and use it to develop is something we look for.","otherRequirements":"In addition to academic qualifications, you must also:\r\n\r\n•Have an enhanced Disclosure and Barring Service (DBS) check (supplied by the University once applicant passes interview)\r\n\r\n•Complete a medical pro forma (based on DFEE Circular 8/92)\r\n(supplied by the University once applicant passes interview)\r\n\r\n•The Government have stated that they will be removing the Professional Skills Test condition for all Teacher Trainees  from April 2020. \"A new process for assessing numeracy and literacy will be introduced for ITT starting in 2020\" This means applicants do not need to pass a numeracy or literacy test as a condition to their offer.","status":1,"createdAt":"2021-07-06T10:48:30.590Z","updatedAt":"2021-07-16T08:45:41.685Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
