{"id":"bafab49f-1f1a-4f41-a4ca-11424f1e8223","name":"Mathematics","code":"G1X1","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"72345aa7-096c-488f-8649-085b8178cadb","code":"G1","name":"Mathematics"}],"locations":[{"id":"f6d12cc4-e091-4a8a-8d4a-016a83332c86","name":"Sir Tom Cowie Campus","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"926804ac-be7a-4f0a-97f9-a26a5f5f032a","code":"S84","name":"University of Sunderland"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We will only accept equivalencies from www.equivalencytesting.com","courseLength":"OneYear","feesUK":9250,"feesInternational":13000,"aboutCourse":"Mathematics is one of the core subjects of the UK curriculum, and good Maths teachers are always in high demand.\r\n\r\nWe will take your knowledge of Mathematics and show you how to use resources to plan innovative lessons that will fuel your pupils’\r\ninterest in Mathematics. We will show you how to use external visits to enable them to see how mathematics is used to solve problems\r\nin everyday life and what pupils could do with Mathematics in the future as a career.\r\n\r\nAs a teacher you will empower young minds, motivate your pupils while developing your communication, interpersonal skills and self-confidence enabling you to become an outstanding teacher.\r\n\r\nAll trainees will have set SEND days within their placements, allowing students to think about specializing in this area of Education after their PGCE.\r\n\r\nFor more information please visit; https://www.sunderland.ac.uk/study/education/pgce-mathematics/","interviewProcess":"If your application has been successfully shortlisted for a September 2022 start you will be invited to attend an online interview, this will take place on Microsoft Teams.  Applicants will be able to choose from a selection of dates and times and will only need to attend interview once.\r\n\r\nEssential details of the day will be sent to you via email prior to the interview so you will be very well prepared for the day.\r\n\r\nOnline interviews will be led by the academics on the course, and will consist of individual and group tasks.","howSchoolPlacementsWork":"Initial Teacher Training courses at the University of Sunderland are run in partnership with a wide range of nurseries, schools, academies, colleges and other educational settings including specialist alternative provision settings and dedicated SEND settings.  This ensures that all trainees have a wide and varied experience in different types of settings as an integral part of their training.  \r\n\r\nCurrently we have partnerships with over 200 settings covering many local authorities and all phases of education. As a trainee teacher following a Secondary PGCE programme you will spend a minimum of 120 days on placement working and studying in a number of partner settings. Placements are sourced by our Placement Team who work very closely with academic colleagues to find you bespoke placements.  You will work  with trained mentors who are experienced members of the school, academy or college staff. They will help support you in your training, further your interests, helping you become the best secondary teacher you can be.\r\n\r\nPrior to starting the programme, trainees are encouraged to spend time on a five-day Pre-Programme Placement, assisting and observing in a primary school of their own choice. This ensures that trainees starting the programme have recent and relevant experience in school settings and they understand the diet of education that primary school pupils experience before transitioning to middle or secondary schools.  This experience also provides an understanding of current education practice that is built upon during lectures at the University and in the Teaching Practice which follows.\r\n\r\nStudents following a University based PGCE programme spend three days per week in their placement school undertaking observation and preparation for their later assessed period of teaching. The remaining time in these weeks is spent at University consolidating their experience and learning subject related content alongside wider education theory and practice.  Trainees undertake a number of assessed full weeks of teaching, all of which we aim to ensure take place in a single setting.  At the end of this placement, targets and feedback from the setting are used by tutors and placement team to help find a complimentary setting for your second teachingpractice.\r\n","personalQualities":"We do not look for a one size fits all model of a trainee teacher – quite the opposite. We are looking for people who demonstrate a passion for developing the learning experiences of young people. An awareness of young people is an advantage and may come from a wide variety of sources.  We do, however, look for trainee teachers who are willing to have a go; eager to engage, and up for a challenge. We create confident, competent teachers and a willingness to take on board feedback and use it to develop is something we look for.","otherRequirements":"In addition to academic qualifications, you must also:\r\n\r\n•Have an enhanced Disclosure and Barring Service (DBS) check (supplied by the University once applicant passes interview)\r\n\r\n•Complete a medical pro forma (based on DFEE Circular 8/92)\r\n(supplied by the University once applicant passes interview)\r\n\r\n•The Government have stated that they will be removing the Professional Skills Test condition for all Teacher Trainees  from April 2020. \"A new process for assessing numeracy and literacy will be introduced for ITT starting in 2020\" This means applicants do not need to pass a numeracy or literacy test as a condition to their offer.","status":1,"createdAt":"2021-07-06T10:48:30.953Z","updatedAt":"2021-07-16T08:33:41.266Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
