{"id":"d835bb0e-4313-4f38-b2d3-cf70712d1e8b","name":"Post-Compulsory Education and Training","code":"X341","qualification":"pgce","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","subjectLevel":"further_education","isSend":"no","subjects":[{"id":"9de4b2d2-5739-4c34-92d2-9b4384760298","code":"41","name":"Further education"}],"locations":[{"id":"624dc1d5-ad55-4a83-8061-9334376c4528","name":"Durham Sixth Form Centre","isPublished":"Y","status":"R","vacancies":"F"},{"id":"f6d12cc4-e091-4a8a-8d4a-016a83332c86","name":"Sir Tom Cowie Campus","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"926804ac-be7a-4f0a-97f9-a26a5f5f032a","code":"S84","name":"University of Sunderland"},"profPost":"PF","degreeGrade":"1","english":"9","maths":"9","science":"9","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We accept equivalent GCSE qualifications, and www.equivalencytesting.com","courseLength":"OneYear","feesUK":9250,"feesInternational":13000,"aboutCourse":"This course has two intakes throughout the year:\r\n\r\n * January 2022 start available at Northumberland College.\r\n\r\n * September 2022 start available at University of Sunderland and Durham Sixth Form.\r\n\r\nWhen applying to study on this course please ensure you state which start date and location you are applying for.\r\n\r\nThe Post Graduate Certificate in PCET is a professional teacher education programme that will qualify you to teach in the postcompulsory education and training sector.\r\n\r\nThis course is designed to equip you with the necessary tools to teach adults and young people and give you the opportunity to share\r\nyour knowledge in a way that helps others to fulfil their potential. The course benefits from its direct link to the University of Sunderland’s\r\nCentre for Excellence in Teacher Training (SUNCETT). \r\n\r\nThe course is directly informed by both the national and international educational research and development work of the team.\r\n\r\nThis pre-service course is for people who have not necessarily had any previous experience as a teacher, but who want to make a positive difference in the Further, Adult and Vocational Education sector. \r\n\r\nFor more information please visit; https://www.sunderland.ac.uk/study/education/postgraduate-pcet/","interviewProcess":"If your application has been successfully shortlisted for a September 2022 start you will be invited to attend an online interview, this will take place on Microsoft Teams.  Applicants will be able to choose from a selection of dates and times and will only need to attend interview once.\r\n\r\nEssential details of the day will be sent to you via email prior to the interview so you will be very well prepared for the day.\r\n\r\nOnline interviews will be led by the academics on the course, and will consist of individual and group tasks.\r\n\r\nIf you live outside of the UK we will be able to perform Skype interviews when required.\r\n","howSchoolPlacementsWork":"Placements are an essential part of this degree. We will help to arrange a minimum of 100-hours teaching practice placement in the Learning and Skills sector, over the course of your one year of study. \r\n\r\nYour Teaching Practice Placement will provide you with valuable opportunities to work alongside experienced teachers and to learn how to design, deliver, assess and evaluate teaching and learning in the sector. You will be supported and guided by a Subject Specialist Mentor who will be allocated to you through the University of Sunderland’s Placement Office. \r\n\r\nPlease note that you will be expected to pay for your own travel to and from placement. When you’re ready to start searching for a teaching job, you will already have a wide network of professional contacts who can help you find the right opportunities.","personalQualities":"We do not look for a one size fits all model of a trainee teacher – quite the opposite. We are looking for people who demonstrate a passion for developing the learning experiences of adult learners.  We do look for trainee teachers who are willing to have a go; eager to engage, and up for a challenge. We create confident, competent teachers and a willingness to take on board feedback and use it to develop is something we look for.\r\n","otherRequirements":"You must also have:\r\n\r\n•An enhanced Disclosure and Barring Service (DBS) check\r\n•A completed medical pro forma (based on DFEE Circular 8/92)\r\n\r\n","status":1,"createdAt":"2021-07-06T10:48:31.269Z","updatedAt":"2021-07-16T08:34:27.816Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
