{"id":"3ffd3344-ccd3-40f0-a107-b2be3a7f003c","name":"Primary","code":"38FF","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"4acaea08-c6ea-4ec4-a2f1-9f1c5b03ac97","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"ab2852f6-dd4d-4c11-a0a6-ba8587722ed9","code":"1QP","name":"Skipton Girls’ High School"},"accreditedBody":{"id":"8795230d-a2ff-43ec-8a16-384a390e27f3","code":"255","name":"Northern Lights SCITT"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","aboutCourse":"A requirement of our 'Salaried Route', is that applicants have the support of a school who will both support their training and be willing to pay a salary on the Unsalaried Teachers' Pay Spine. The exact salary would be in negotiation with the sponsoring school.\r\n\r\nThis programme is full time and runs from September until the end of June. \r\nThe programme is divided into three stages all of which are delivered in the school setting:\r\nStage 1, from September to just before Christmas, includes an initial focus on both professional learning and subject knowledge/pedagogy and a placement in your employing school.  \r\nStage 2, from Christmas to March, includes further professional learning and subject studies and then a full time teaching placement in your second school. \r\nStage 3, from March to June, your placement in your first school (employing school) resumes. \r\nFurther professional learning days (about 5 in total) occur in the middle and end of this placement.  This professional learning will include preparation and transition to employment. \r\nOther enrichment opportunities are scheduled in March, focussing on key national priorities for example phonics teaching in primary school.  \r\nDuring the year and in teaching placements, trainees will be supported by school mentors and lead mentor.  These are all experienced and current classroom practitioners. \r\n","interviewProcess":"Senior staff from partnership schools will be involved in the selection process. \r\nInterviews will be based in a school within the Alliance and will consist of a number of different elements. These will include working with a teacher and students in a classroom, a group discussion, a written task and a formal interview. \r\nThrough this process we assess applicants' knowledge of the teaching profession and their communication skills. \r\nDuring COVID we will make any necessary changes to this process to ensure candidates’ safety.\r\n","howSchoolPlacementsWork":"The programme includes two main teaching placements in partner schools which offer contrasting experiences of working with children of all abilities. These two main placements will each cover half of the chosen age range. \r\nIn addition to the main placements, School Direct trainees will have access to a breadth and diversity of educational settings participating in several training days based in various schools across the Alliance.\r\n","personalQualities":"We are seeking to recruit future trainees with the ability and ambition to become highly skilled specialists in Primary or Foundation Stage education. \r\nThey will have a passion for teaching and for working with the diverse groups of children in schools across the Alliance. \r\nKnowledge/Experience\r\nWe expect trainees to have an understanding of the key issues relating to teaching and learning in Primary education and to be able to reflect on their period of observation within their personal statement. \r\n","otherRequirements":"You must have secured a sponsoring school.","status":1,"createdAt":"2021-07-06T10:57:09.786Z","updatedAt":"2021-11-02T09:29:34.040Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"A requirement of our 'Salaried Route', is that applicants have the support of a school who will both support their training and be willing to pay a salary on the Unsalaried Teachers' Pay Spine. The exact salary would be in negotiation with the sponsoring school.\r\n\r\nThis route is aimed at those already working in schools (for example a Teaching Assistant) and applicants who have the full support of their school.\r\n\r\nThe course fees are covered by the DFE, so there is no cost to the applicant."}
