{"id":"ac4bce44-48c1-4bcf-a88d-e45a51c15dcc","name":"English","code":"26L9","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3aed1aa8-ae46-4b68-92bb-a6cc20655c59","code":"Q3","name":"English"}],"locations":[{"id":"ba193a17-b6db-40de-a36b-ebd264aa9b30","name":"Main Site","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"81269e40-2116-4686-a687-2e30bf961839","code":"1HC","name":"Woolwich Poly"},"accreditedBody":{"id":"2cb11a46-97d4-4ced-a702-0dc37f7d6ebb","code":"B91","name":"Bromley Schools Collegiate"},"degreeGrade":"9","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Bromley Schools' Collegiate will offer candidates equivalency tests at no cost to them. These must be taken and passed before the start of the training course. If a candidate is awaiting results, they may be asked to take an equivalency test with Bromley Schools' Collegiate. Third party Equivalency tests will not be accepted.","courseLength":"OneYear","aboutCourse":"Every child deserves to be taught by excellent teachers. Bromley Schools' Collegiate are committed to train and develop of the next generation of career teachers.   \r\n\r\n*  Secondary Trainees spend Monday to Friday in their placement school with training taking place each Wednesday afternoon,  at the Bromley Schools' Collegiate training suite. This is based at Hayes. Secondary School, West Common Road, Hayes, Bromley, Kent, BR2 7DB. \r\n\r\n*  The programme has been developed to deepen trainee's use of research informed practice. \r\n\r\n*  Trainees will receive high quality training from experienced facilitators, many who are drawn from our partnership schools, providing real-life context to the training. \r\n\r\n* Trainees will gain a strong understanding of how to meet the needs of all pupils through our curriculum based on caring for the whole child. \r\n\r\n* Right from the start of the course, trainees will be taught to develop critically reflective practice. \r\n\r\n* Subject Specific expertise will be developed and strengthened through the robust training programme. \r\n* Trainees are assessed throughout their placements by experienced leaders with a focus on making them career ready \r\nThe training course runs from September to July. To meet the ITT criteria trainees must have experience of whole class teaching in two school settings. Placement 2 is arranged for Spring term 1 (up to 6 weeks) January to February.  \r\n\r\n* Qualification achieved is QTS (Qualified Teacher Status) before becoming an ECT (Early Career Teacher)\r\n","interviewProcess":"Successful applications will be invited for interview. We try to give as much notice as possible, however this may be within a week of receiving your application. \r\nThe interview will be to assess your suitability for teaching and  Curriculum knowledge for your chosen subject. \r\nAs part of the selection process, we require you to prepare a short 4 minute presentation to be delivered to the interview panel. Which should be delivered orally without powerpoint or any other electronic aid. After which you will be have a formal interview with senior management / headteacher. \r\n\r\nYou will also be asked to complete a timed written task which will be assessed as part of the selection process. Please do not worry about the content it is to see your use of grammar etc.","howSchoolPlacementsWork":"Much consideration is given to placements. Each trainee must undertake 2 school placements to gain contrasting experience of teaching. \r\nTrainees on the School Direct Salaried programme  will be in the school they are employed by. Their contrasting placement school will take place in January and February - Spring term 1.\r\nTrainees will be mentored and coached by experienced practitioners. You will be supported by expert practitioners throughout the training course . Placements will be at the schools in the Woolwich PolyMat where possible. If this is not possible, arrangements are made where capacity is available to meet the needs of the trainee. ","personalQualities":"We welcome applications from candidates who are passionate about their subject and who want to be that teacher who can make a difference to student's learning.\r\n","otherRequirements":"We will undertake DBS (criminal record checks) and health checks before the start of the course. Candidates will be asked to provide complete CVs which reflects their full work history.\r\nCandidates are not expected to have experience in schools before the start of the course.","status":1,"createdAt":"2021-07-06T10:49:31.612Z","updatedAt":"2021-10-02T15:23:00.836Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"Trainees employed by the school will be paid as an unqualified teacher for the duration of the course. This will be advised at interview."}
