{"id":"6f0bb182-875f-4aae-981a-1846c89eecc0","name":"Primary","code":"3736","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"7ab5f440-ab55-4dc5-a8ec-d7dd5fe24b68","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"2b692b6f-491c-4e74-9799-16a616ced9d8","code":"1Q7","name":"Willows School Direct Partnership"},"accreditedBody":{"id":"0a682589-92ed-447b-b564-6958b3b02b41","code":"S72","name":"Staffordshire University"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":9250,"financialSupport":"Bursaries, scholarships and financial support for 2020/21 will be announced soon.","aboutCourse":"School Direct is a school-led option offering practical, hands-on training designed by schools based on the skills that schools are looking for in a newly qualified teacher (NQT). We recruit trainees with a view to employing them within the partnership at the end of the programme. This is a popular choice for those who hope to secure a role in the network of schools where they train. \r\n\r\nFollowing the 2014/15 programme, 100% of our School Direct participants had secured jobs by June, 65% of them within our partnership. \r\n\r\nThis course offers a brilliant option if you want to train and learn ‘on the job’, and you shouldn’t worry about being thrown in at the deep end. You’ll be part of a team from the very start, receiving intensive support from experienced teachers and mentors. That means you won’t be teaching classes unsupported until the school thinks you’re ready.\r\n\r\nThe course is a careful blend of school based learning and university led development.\r\n\r\nThe principles of academic rigour on School Direct are the same as on university-led courses, too. You’re also equally eligible for a training bursary (or, where appropriate, scholarship) and can apply for the same financial support, such as student loans. \r\n\r\nThe university element of the course is designed to engage Associate Teachers in critical reflection on the nature of education. We also aim to develop your knowledge of the primary curriculum. Group and individual tutorials in the university will give you an opportunity to discuss your ideas and the challenges you may face.\r\n\r\nThe university aspects of the course take place on the Lichfield campus and will draw upon the experience of practicing teachers as well as highly experienced tutors. The school experience is based in our strong, carefully selected schools across Lichfield, Rugeley and Burntwood.\r\n\r\nThe blend of practical experience and academic study will be evidenced by the compilation of portfolios and the production of short written academic papers.\r\n\r\nOur programme is delivered in partnership with Staffordshire University. Your programme will be a carefully thought out blend of classroom experience, university led training and school led training.","interviewProcess":"Following an initial screening to ensure your application meets our entry requirements, applications will be considered by the course leader. Successful applicants at this stage will be offered an interview.\r\n\r\nThe main purposes of the interview are to:\r\n\r\nAllow you to understand as fully as possible the nature of the course, the teaching profession and your commitments to it\r\nBegin to explore your subject strengths and areas for development\r\nAssess your ability to communicate effectively in spoken and written English\r\nAnswer any questions you may have\r\nWhilst school experience is not a requirement for being invited to interview, successful candidates will be able to demonstrate during their interview that they have a good understanding of student learning and progress. Applicants may wish to draw upon experiences from their own education or paid or voluntary work in schools or with school-age children to show evidence of their understanding.\r\n\r\nOur Primary PGCE is a two stage interview process, successful applicants in the initial interview will be invited to a second stage interview to be held in a local school.","howSchoolPlacementsWork":"Over the course, you will take part in two placements in contrasting schools; one in key stage 1 and the other in key stage 2. \r\n\r\nAfter a two week Induction Programme, you will be in school on serial and block placements to gain a supported understanding of the role of the teacher. Within school, you will receive expert support from a class mentor who will hold weekly meetings with you to help you to prepare, teach and review lessons and develop your subject knowledge and pedagogy.\r\n \r\nEach school has a professional mentor who will help you to understand the organisation of the school, pastoral care systems and the legal and social framework of schools including supporting services.\r\n\r\nAssociate Teachers have a phased introduction to teaching that will reflect your personal needs. Initially you will observe the regular teacher, help with group work and then move towards sharing classes with the teacher before eventually taking classes yourself. As well as teaching, you will be required to contribute generally to the life of the school. ","personalQualities":"We are looking for enthusiastic, professionally restless individuals for whom teaching will always be a voyage of discovery. You should have:\r\n\r\nThe desire and ability to impact on student learning and to see issues from students' points of view\r\nHigh level communication skills, empathy and persistent optimism\r\nPotential for critical reflection, independent learning and taking initiative for personal and professional development\r\nThe ability to work effectively in a team and to lead\r\nCreativity, innovation and understanding of when to take risks\r\nResilience to accept and learn from professional criticism\r\nSelf-confidence balanced with humility","otherRequirements":"Whilst school experience is not required for entry, successful applicants will demonstrate a good understanding of student learning and progress.\r\n\r\nSuccessful applicants will also be required to:\r\n\r\nComplete a Medical Questionnaire, which will be assessed by an Occupational Therapist\r\nProvide an Enhanced Disclosure Certificate from the Disclosure and Barring Service (application can be obtained through the University)","status":1,"createdAt":"2021-07-06T10:48:32.718Z","updatedAt":"2021-10-31T10:42:48.597Z","canSponsorStudentVisa":"yes","cycle":"2023"}
