{"id":"ac90e510-464d-447e-a1b7-e754ce898859","name":"Dance","code":"2NK9","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"49dcc400-03df-4732-af93-1c56ae22897f","code":"12","name":"Dance"}],"locations":[{"id":"f957816f-81ab-49db-b0a6-39bba7174e59","name":"Main Site","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"a7f99f95-5c50-476f-882d-d79e366cddb3","code":"16G","name":"Northampton School for Boys"},"accreditedBody":{"id":"15d69054-c862-4f7a-b0ba-bb86087ce2f7","code":"N42","name":"Northampton Teacher Training Partnership"},"profPost":"PG","degreeGrade":"1","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We do not offer Equivalency Tests.","courseLength":"OneYear","feesUK":9000,"aboutCourse":"Dance students train towards a professional teaching qualification, achieving Qualified Teacher Status. The course requires the completion of professional assignments, alongside 2 school based placements.  The course is designed for trainee teachers to demonstrate they have met the standards for Qualified Teacher Status. \r\nThe Dance course at NTTP offers opportunity to work with a fantastic team of practitioners. You will be challenged to be creative, engaging and to get a wide range of young people motivated to dance. Throughout your training, you will be supported to develop classroom management skills, lesson planning and subject knowledge. The course prepares you to teach across KS3, GCSE and A Level groups and there will be opportunity to work with extra-curricular groups. You need to be self-motivated, organised and willing to learn, in return you will be rewarded with the joy of working with young people and seeing their progress in Dance.  \r\nYou will receive a practice-led, hands-on experience. Trainees are supported by a Subject Based Tutor and Professional Tutor of the school, and from the NTTP SCITT, the Lead Subject Mentor and the Programme Facilitators.  Subject Studies and General Professional Study sessions enhance your knowledge of teaching and learning and help to develop your pedagogy. Constant self-reflection allows trainees to assess their strengths and development potential.\r\nYou will spend the majority of your course in the classroom; working with dedicated professionals. Your programme is designed to suit you, with your strengths nurtured and your areas for development targeted, improved upon and monitored. \r\nDuring your placements you will teach pupils in the 11 to 16 age range, however, in many of our partnership schools there will be the opportunity to experience Post 16 Education too. You will also experience PSHE and Citizenship delivery when acting as a form tutor. Further opportunities will consist of extra-curricular and enrichment opportunities in Dance.\r\nSubject Studies are twilight sessions and take place in the first half of the year so that you have the tools to succeed in your school placements. They are designed to illustrate ways to help you apply your knowledge and understanding in designing and teaching lessons.  Sessions are held across a selection of our schools.\r\nA selection of subject studies sessions are as follows: \r\n•\tPerformance in the Arts classroom\r\n•\tCreativity in the Arts classroom\r\n•\tAssessment in the Arts classroom\r\n•\tDifferentiation in the Arts Classroom\r\n•\tDance subject Knowledge sessions\r\n","interviewProcess":"As with any interview, the key to success is preparation. Make sure you do your research into the course, as well as the issues surrounding education and teaching in general. Policies and practices change quickly, so your knowledge needs to be up to date.\r\n\r\nThe Interview process will entail: \r\n•\tAdministrative Questions \t\t\t\t-\t10 minutes\r\n•\tPresentation - “Why I want to become a teacher”\t-\t5 minutes\r\n•\tPresenting a ‘Starter’ of your choice\t\t\t-\t5 minutes\r\n•\tInterview \t\t\t\t\t\t-\t40 minutes\r\n•\tLiteracy written task\t\t\t\t- \t20 minutes\r\n•\tSubject Knowledge Task\t\t\t\t- \t30 minutes\r\n•\tPortfolio of work/video for Art and Performing Art subjects\r\n\r\nYour interviewers will be looking for you to demonstrate a number of qualities. You should therefore try to tailor your answers and contributions to reflect these qualities. They are:\r\n\r\n-\tA commitment to and understanding of secondary education and the role of the teacher\r\n-\tGood personal, intellectual and communication skills\r\n-\tA positive attitude towards children and working with children\r\n-\tAn enthusiasm for and understanding of your subject (s) and teaching in general.  \r\n","howSchoolPlacementsWork":"We have long-established partnerships and rewarding connections with a wide variety of secondary schools across the county.  Ideally, you will be required to spend a minimum of 12 weeks in two of our placement schools whilst on the course.  You will work closely with our trained school based tutors receiving weekly one-to-one meetings to monitor your progress throughout your first and second placement.\r\n\r\nTo qualify for QTS we will provide trainees with enough time in schools to demonstrate that they have achieved all the Teachers’ Standards.\r\nYou will train with pupils in the 11 to 16 age range, however in many of our partnership schools there will be the opportunity to experience Post 16 Education too.\r\n\r\nYou will be allocated to your placement school as a result of an initial induction and skills audit conducted early in the course.  Your placement school will be identified to meet your needs and therefore may not be your nearest school.\r\n","personalQualities":"You must be flexible, resilient and motivated. Be able to demonstrate a clear enthusiasm for your subject and for teaching as a profession. You must have consistently high standards of professional and personal conduct and show tolerance and respect for the rights of others. You should act with honesty and integrity and be aware that teachers make the education of their students their first concern. ","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:53:09.472Z","updatedAt":"2021-09-29T14:42:55.156Z","canSponsorStudentVisa":"no","cycle":"2024"}
