{"id":"eeb9c7f4-2a82-4049-9577-033142ad3b56","name":"Chemistry","code":"2NKQ","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"912d4fb4-761b-42e9-8dc6-e968b791ea4e","code":"F1","name":"Chemistry"}],"locations":[{"id":"f957816f-81ab-49db-b0a6-39bba7174e59","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"a7f99f95-5c50-476f-882d-d79e366cddb3","code":"16G","name":"Northampton School for Boys"},"accreditedBody":{"id":"15d69054-c862-4f7a-b0ba-bb86087ce2f7","code":"N42","name":"Northampton Teacher Training Partnership"},"profPost":"PG","degreeGrade":"1","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We do not offer Equivalency Tests.","courseLength":"OneYear","feesUK":9000,"aboutCourse":"On the NTTP Chemistry course, students will train towards a professional teaching qualification, achieving Qualified Teacher Status (QTS). The course requires a study of academic literature and completion of professional assignments, alongside two school based placements. The course is designed to show that trainee teachers demonstrate that they have met the standards for Qualified Teacher Status. \r\nThe course is perfect for those who find Science exciting and challenging who are then able to share this enthusiasm with young people. Trainees will experience lessons across a range of ages and attainment, reflecting the diverse needs of students in our schools. Trainees will work alongside an experienced team of Scientists, who have proven ability to ensure achievement for all students. You will explore a wide ranging content; develop knowledge and skills which will enable you to become an effective and inspiring classroom practitioner in Science. You will also have the opportunity to develop a range of lessons and teaching styles that cover the practical delivery and theory of Science at Key Stages 3, 4 and 5, where appropriate. \r\nTrainees need to learn how to deliver in a style that suits their own personality but watch and learn from other teachers. Learning in a classroom requires professionalism, organisation, planning, preparation and excellent subject knowledge, across the department. \r\n\r\nWhen you study Chemistry on the NTTP programme you receive a practice-led, hands on experience. Trainees are supported by a Subject Based Tutor (SBT) within school, the Professional Tutor of the school, the Lead Subject Mentor from the NTTP SCITT, the Programme Facilitators along with the Administration staff team. Subject Studies and General Professional Study sessions enhance your knowledge of teaching and learning and help to develop your pedagogy. Constant self-reflection allows trainees to assess their strengths and development potential, which should allow progression and confidence.\r\n\r\nDuring your placements you will teach pupils in the 11 to 16 age range, however, in many of our partnership schools there will be the opportunity to experience Post 16 Education too. You will also experience PSHE and Citizenship delivery when acting as a form tutor.\r\n \r\n","interviewProcess":"As with any interview, the key to success is preparation. Make sure you do your research into the course, as well as the issues surrounding education and teaching in general. Policies and practices change quickly, so your knowledge needs to be up to date.\r\nThe Interview process will entail: \r\n•\tAdministrative Questions \t\t\t\t-\t10 minutes\r\n•\tPresentation - “Why I want to become a teacher”\t-\t5 minutes\r\n•\tPresenting a ‘Starter’ of your choice\t\t\t-\t5 minutes\r\n•\tInterview \t\t\t\t\t\t-\t40 minutes\r\n•\tLiteracy written task\t\t\t\t- \t20 minutes\r\n•\tSubject Knowledge Task\t\t\t\t- \t30 minutes\r\n•\tPortfolio of work/video for Art and Performing Art subjects\r\n\r\nYour interviewers will be looking for you to demonstrate a number of qualities. You should therefore try to tailor your answers and contributions to reflect these qualities. They are:\r\n-\tA commitment to and understanding of secondary education and the role of the teacher\r\n-\tGood personal, intellectual and communication skills\r\n-\tA positive attitude towards children and working with children\r\n-\tAn enthusiasm for and understanding of your subject (s) and teaching in general.  \r\n","howSchoolPlacementsWork":"We have long-established partnerships and rewarding connections with a wide variety of secondary schools across the county.  Ideally, you will be required to spend a minimum of 12 weeks in two of our placement schools whilst on the course.  You will work closely with our trained school based tutors receiving weekly one-to-one meetings to monitor your progress throughout your first and second placement.\r\nTo qualify for QTS we will provide trainees with enough time in schools to demonstrate that they have achieved all the Teachers’ Standards.\r\nYou will train with pupils in the 11 to 16 age range, however in many of our partnership schools there will be the opportunity to experience Post 16 Education too.\r\nYou will be allocated to your placement school as a result of an initial induction and skills audit conducted early in the course.  Your placement school will be identified to meet your needs and therefore may not be your nearest school.\r\n","personalQualities":"You must be flexible, resilient and motivated. Be able to demonstrate a clear enthusiasm for your subject and for teaching as a profession. You must have consistently high standards of professional and personal conduct and show tolerance and respect for the rights of others. You should act with honesty and integrity and be aware that teachers make the education of their students their first concern. ","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:53:09.573Z","updatedAt":"2021-09-29T14:42:15.234Z","canSponsorStudentVisa":"no","cycle":"2024"}
