{"id":"719d0197-22aa-4f83-8be4-45c3b8c0ec61","name":"Biology","code":"AW09","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"322cfc19-d51d-45db-91e3-bd7b4738470f","code":"C1","name":"Biology"}],"locations":[{"id":"6ceb468e-626a-4b2a-b6ec-ebfcbb5a0a76","name":"Devonport High School for Boys","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"a3914a46-f8b6-4615-8b9d-aff2176ea909","code":"2LB","name":"Devonport High School for Boys"},"accreditedBody":{"id":"a4e84530-e1f1-47c6-b57e-ec693d629637","code":"P63","name":"Plymouth Marjon University"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feesInternational":11000,"aboutCourse":"The course trains you in one year to become a Newly Qualified Teacher in a secondary school in the following subject specialism Biology. You will be based in two different secondary schools across the year, immersed in school life and taking an active role in the school team. You will work mainly out of a lead school of Devonport High School for Boys, with an additional placement for six to twelve weeks to give you breadth of experience.\r\n\r\nSome training will be school-based, led by teachers and working with other trainees from other schools, and you will also attend university and be part of a broad cohort of university students\r\nFormal assessment for the School Direct programme takes place throughout the year in partnership with Plymouth Marjon University our HEI link partner.\r\n","interviewProcess":"If you are invited for interview you will receive full details of what will be expected of you in a letter of invitation. We work closely with Plymouth Marjon University in the selection process. You will be expected to be familiar with key issues and developments in secondary schools - especially those in your subject area. It will help you to read the educational press and to talk to teachers and those currently undertaking teacher training. Our interview procedure is a rigorous and thorough process, designed to get the best match of applicant to the School Direct places available. It will also include an assessment / audit of your literacy and numeracy skills.\r\nThe best preparation for interview is a visit to a school or schools. Talk to teachers and students; try to evaluate what is being learned and how the teachers encourage the learning to take place. You will be expected to discuss these observations in your formal interview; where we will be looking for your ability to analyse your experience and show a deeper understanding of the learning process.\r\nDuring interview the following points will be assessed:\r\n\r\n- Appropriate qualities, attitudes, ethics and values\r\n- Subject knowledge and understanding\r\n- Intellectual and academic capabilities\r\n- Suitability for the course\r\n\r\n\r\n","howSchoolPlacementsWork":"If you are successful in being offered a School Direct placement with us you will be based in Devonport High School for Boys. In addition, you will be required to develop further in a second school identified by us as best suited to meet your training needs from the range of partner schools wishing to train in your subject. Unlike a university based PGCE the academic year runs from September to July following our school term dates.\r\nEach School Direct trainee will undertake two placements, a longer placement starting at DHSB and a second shorter placement usually taking place in one of our other partner schools to provide a contrasting experience.\r\n","personalQualities":"We are looking for committed and dedicated people who can demonstrate effective inter-personal and communication skills and who can work as part of a team. All applicants need the ability to use their initiative and be resilient when working under pressure.  We are looking for trainee teachers who are passionate about making a difference and who think deeply about their practice, actively seeking advice and guidance in order to be the very best they can be.","otherRequirements":"All applicants will be subject to suitability checks. This includes a full enhanced disclosure and barring check for child and adult workforce, as well as clearance by your HEI Link Occupational Health department.","status":1,"createdAt":"2021-07-06T10:48:19.432Z","updatedAt":"2021-07-14T22:34:27.429Z","canSponsorStudentVisa":"yes","cycle":"2024"}
