{"id":"2744f83d-e30d-4e48-ac85-156e360c51fb","name":"Physical Education (11-18)","code":"AP11","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"74d64a54-5e34-4590-b6c7-528dd0cf26fe","code":"C6","name":"Physical education"}],"locations":[{"id":"3cfe2f26-12c1-4734-9a7e-1254852ec01d","name":"Saint Martin's Catholic Voluntary Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"272b0e8e-84ce-4003-900b-8ccac703f274","name":"The George Eliot School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"007aa688-2142-4ce2-a3db-e763fbe80bad","name":"Higham Lane School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"d1b36e0c-ba96-4e39-98d7-2a052600673d","code":"2KZ","name":"Higham Lane School Partnership"},"accreditedBody":{"id":"62d5803b-89ca-4e21-bb6f-5c74944c56ad","code":"B25","name":"Birmingham City University"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"These will be administered by the University after interview. Third party tests are not accepted.","courseLength":"OneYear","feesUK":9250,"feeDetails":"Home and EU students can apply to the Student Loans Company online at (www.gov.uk/studentfinance) for a tuition fee loan to cover the full cost of the fees. ","aboutCourse":"If this is a subject you’re knowledgeable and passionate about, our Secondary Physical Education PGCE will allow you to become a highly skilled graduate teacher with an in-depth knowledge and understanding of teaching and learning, enabling you to demonstrate the highest levels of professional practice.\r\nYou will be trained to become a confident and reflective practitioner, and will be able to teach contemporary methods and practices. You’ll learn techniques to inspire students with Physical Education, making it enjoyable for all and ensuring they’re equipped with skills and understanding they’ll need for a positive approach to physical activity in the future.\r\nCentral to the curriculum is the study of PE pedagogy and professional practice, which you will access through a synthesis of practical workshops, lectures, seminar groups and individual study.\r\nCurriculum workshops are a key element of your course. Dedicated PE lecturers and teachers deliver these in our specialist education classrooms and lecture theatres. The workshops enable you to experience and develop your understanding of subject pedagogy through topics such as: Physical literacy, growth mindset through PE, dance in the curriculum, gymnastics, invasion games, net and wall games, target games and athletics, health and safety, as well as Key Stage 3 National Curriculum topics, GCSE and A Level PE topics.\r\n\r\nIf you are passionate about teaching, ambitious, reflective and with excellent communication skills and a desire to positively influence and transform young people’s lives, we look forward to receiving your application.\r\nIn return we will offer you: • a PGCE programme with QTS and Master’s level credits with our Higher Education Institution (HEI) partner, Birmingham City University • a training programme including sessions at university, Higham Lane School as well as your placement schools • an on-the-job training approach working alongside experienced teachers to plan, deliver and evaluate lessons from the start of the academic year • teaching experience at 2 complementary schools • opportunities to work alongside other trainees to share ideas and experiences • both subject and professional mentors to support and guide you through your training year.\r\n\r\nSuccessful applicants may be placed at any of our schools depending on phase and subject specialism.\r\n\r\nFor more information on our partner schools, please see (https://www.highamlaneschool.co.uk/partnership).\r\n\r\n","interviewProcess":"You will be invited to interview either, at your base school or the lead school. You will have a tour of the school and an opportunity to meet staff and students in your chosen department. You will be asked to prepare a 20 minute learning activity to deliver to a group of Year 7 or Year 8 students. There will also be a baseline assessment of subject knowledge, literacy and numeracy skills. Following this, you will have an interview with our School Direct Co-ordinator and a representative from your base school, either the professional or subject mentor. All of this gives us an opportunity to find out a bit more about you and it is also an opportunity for you to meet us and establish whether this is the right course for you! You will be contacted later the same day with our decision. Successful applicants will also be offered the opportunity of some school experience with our partnership prior to starting the course. This will enable you to talk to teachers and students, observe teaching and pastoral work and become familiar with policies and procedures. All of this will give you valuable insight and a great experience prior to starting your course. It will also mean you are a familiar face in school to both staff and students and you can really hit the ground running in September!\r\n","howSchoolPlacementsWork":"Successful applicants may be placed at any of our schools depending on subject specialism. We are a close partnership, both in terms of location and our approach to the training provision. Our partnership has an expert and experienced team of mentors to support trainees and provide an excellent in-school experience in a range of contexts. All of our schools are within a 30 minute drive of each other with 4 of them based in Nuneaton.\r\n\r\nYou will gain direct teaching experience and work with experienced practitioners in the classroom. You will be assigned a trained mentor and/or a tutor while on placement, who will support and guide your work, as well as provide training and feedback.\r\n\r\nYou will spend two-thirds of your time – at least 120 days – working in schools on block placements gaining valuable real-life experience in 2 contrasting schools.  All schools offer 11-16 experience and, where possible, we will ensure you have some post-16 experience. \r\n\r\nYour training programme will include sessions at university, Higham Lane School as well as your placement schools. We offer you an on-the-job training approach, working alongside experienced teachers to plan, deliver and evaluate lessons from the start of the academic year. You will have opportunities to work alongside other trainees to share ideas and experiences; both subject and professional mentors will support and guide you through your training year.\r\n\r\nWhat have previous trainees said about us? \r\n‘The Department have offered me invaluable support throughout my placement, encouraging me to take risks and work to become an excellent classroom practitioner.’ \r\n‘I have found my one-to-one weekly meetings with my subject mentor invaluable, as they have enabled me to gain advice and support from a teacher who has years of teaching experience behind her.’ \r\n‘The school’s high expectations in terms of behaviour and learning have pushed me to have higher expectations of myself and my pupils which has impacted positively on my teaching practice. The Department has supported me well through a tough part of the PGCE and this has given me confidence going into my NQT year.’\r\n\r\nSee our website (https://www.highamlaneschool.co.uk/partnership).\r\n","personalQualities":"We would be delighted to receive applications from candidates who are passionate about their subject, a good role model and have an empathy for and an ability to motivate and inspire young people. We are looking for trainees who are energetic, enthusiastic and highly-motivated with a sense of humour and a sense of fun! You should demonstrate high expectations and have an ability to reflect to further improve your practice. We wish you every success with your application! Please do not hesitate to contact us at partnership@highamlaneschool.co.uk if we can be of any further assistance to you. ","otherRequirements":"Getting some classroom experience can help you to decide whether teaching is right for you. School experience will offer you the opportunity to talk to teachers and students, and observe teaching and pastoral work. Please contact partnership@highamlaneschool.co.uk to arrange school experience at one of our partner schools. This will give you valuable insight and a great focus point for your application and interview.\r\nApplicants must meet the Department for Education’s Initial Teacher Training criteria, which means being medically fit and successfully completing an enhanced disclosure via the Disclosure and Barring Service (DBS) and satisfying any other safeguarding checks required.","status":1,"createdAt":"2021-07-06T10:54:00.169Z","updatedAt":"2021-09-29T11:09:41.956Z","canSponsorStudentVisa":"yes","cycle":"2024"}
