{"id":"33a007f6-96b2-4d5e-a94c-77393e33cf06","name":"Physics (11-18)","code":"AP21","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"bf97cd0a-224c-43d3-a021-84143df13e8d","code":"F3","name":"Physics"}],"locations":[{"id":"9e352cc6-b838-45ec-ac19-43294c81c6e3","name":"The Nuneaton Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"272b0e8e-84ce-4003-900b-8ccac703f274","name":"The George Eliot School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"3cfe2f26-12c1-4734-9a7e-1254852ec01d","name":"Saint Martin's Catholic Voluntary Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"b70e39ea-92ad-43be-91fc-640655247fd7","name":"Heath Lane Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"d49e74ee-e896-4952-87b0-62305d54bd2d","name":"The Queen Elizabeth Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"9f80aa0f-3a00-456e-82e4-98d14bc335f1","name":"Hartshill School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"007aa688-2142-4ce2-a3db-e763fbe80bad","name":"Higham Lane School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"d1b36e0c-ba96-4e39-98d7-2a052600673d","code":"2KZ","name":"Higham Lane School Partnership"},"accreditedBody":{"id":"3e6c62a3-5d34-4a91-9c23-01c7409fd909","code":"L34","name":"University of Leicester"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"For those students who do not hold the required English and Mathematics GCSE or equivalent (overseas qualifications) we recommend an equivalency test to be undertaken via https://www.equivalencytesting.com/","courseLength":"OneYear","feesUK":9250,"feeDetails":"Home and EU students can apply to the Student Loans Company online at (www.gov.uk/studentfinance) for a tuition fee loan to cover the full cost of the fees. ","aboutCourse":"The Science PGCE aims to: \r\n*Develop your understanding of the role of science teachers both within their departments and in their wider professional responsibilities\r\n*Introduce you to current theories and practice in science teaching\r\n*Help develop your academic and critical thinking skills to support effective science teaching and learning for all your students\r\n*Help you set high expectations for yourself and your students\r\n*Help you to understand what contribution science education can make to the wider education of young people.\r\n\r\nThe science course supports the core PGCE through: \r\n*Specialist sessions to develop your curriculum subject knowledge\r\n*Exploring effective teaching and learning in science classrooms\r\n*Consideration of the role of practical work and your responsibility for safe classroom practice\r\n*Developing reflective practice to support your planning, delivery and evaluation of lessons\r\n*Developing an understanding of recent curriculum change.\r\n\r\nA field course supports team-building for collaborative work and a practical understanding of learning outside the classroom. \r\n\r\nIn addition to your specialist subject and core science sessions, you will be allocated to a mixed team from all science disciplines to develop pedagogy related to science teaching. \r\n\r\nMixed teams and science sessions will focus on: \r\nThe science curriculum\r\nLesson planning\r\nBehaviour for learning and classroom management\r\nAssessment\r\nLiteracy and numeracy in science\r\nDifferentiation and inclusion\r\nEarth science\r\nICT in science, including data logging\r\nTeaching controversial issues in science\r\nThe nature of science\r\nScience outside the classroom \r\nSafety issues and risk assessment\r\nClassroom practice related to learning theories\r\nDemonstrations and practicals.\r\n \r\nIf you are passionate about teaching, ambitious, reflective and with excellent communication skills and a desire to positively influence and transform young people’s lives, we look forward to receiving your application.\r\n\r\nIn return we will offer you: • a PGCE programme with QTS and Master’s level credits with our Higher Education Institution (HEI) partner, The University of Leicester • a training programme including sessions at university, Higham Lane School as well as your placement schools • an on-the-job training approach working alongside experienced teachers to plan, deliver and evaluate lessons from the start of the academic year • teaching experience at 2 complementary schools • opportunities to work alongside other trainees to share ideas and experiences • both subject and professional mentors to support and guide you through your training year.\r\n\r\nSuccessful applicants may be placed at any of our schools depending on subject specialism.\r\n\r\nFor information on our partner schools, please see (https://www.highamlaneschool.co.uk/partnership).","interviewProcess":"You will be invited to interview at both a partner school and the University of Leicester.\r\n\r\nYou will have a tour of the school and an opportunity to meet staff and students in your chosen department. You will be asked to prepare a 20 minute learning activity to deliver to a group of Year 7 or Year 8 students. Following this, you will have an interview with our School Direct Co-ordinator and either the professional or subject mentor.\r\n\r\nAt university you will meet the course team who will give you an overview of the course and answer and questions you may have. You will also undertake a baseline assessment in subject knowledge, literacy and numeracy as well as give a brief presentation as part of a group. \r\n\r\nAll of this gives us an opportunity to find out a bit more about you and it is also an opportunity for you to meet us and establish whether this is the right course for you!  \r\n\r\nSuccessful applicants will also be offered the opportunity of some school experience with our partnership prior to starting the course. This will enable you to talk to teachers and students, observe teaching and pastoral work and become familiar with policies and procedures. All of this will give you valuable insight and a great experience prior to starting your course. It will also mean you are a familiar face in school to both staff and students and you can really hit the ground running in September!","howSchoolPlacementsWork":"Higham Lane School Partnership comprises 11 partner schools across both primary and secondary phases. Successful applicants may be placed at any of our schools depending on phase and subject specialism. We are a close partnership, both in terms of location and our approach to the training provision. Our partnership has an expert and experienced team of mentors to support trainees and provide an excellent in-school experience in a range of contexts. All of our schools are within a 30 minute drive of each other with 4 of them based in Nuneaton.\r\nYou will have 2 contrasting school placements. All schools offer 11-16 experience and, where possible, we will ensure you have some post-16 experience. You will also spend 1 day a week at university. \r\nYour training programme will include sessions at university, Higham Lane School as well as your placement schools. We offer you an on-the-job training approach, working alongside experienced teachers to plan, deliver and evaluate lessons from the start of the academic year. You will have opportunities to work alongside other trainees to share ideas and experiences; both subject and professional mentors will support and guide you through your training year.\r\nWhat have previous trainees said about us? ‘The Department have offered me invaluable support throughout my placement, encouraging me to take risks and work to become an excellent classroom practitioner.’ ‘I have found my one-to-one weekly meetings with my subject mentor invaluable, as they have enabled me to gain advice and support from a teacher who has years of teaching experience behind her.’ ‘The school’s high expectations in terms of behaviour and learning have pushed me to have higher expectations of myself and my pupils which has impacted positively on my teaching practice. The Department has supported me well through a tough part of the PGCE and this has given me confidence going into my NQT year.’\r\n\r\nSee our website (https://www.highamlaneschool.co.uk/partnership).\r\n","personalQualities":"We would be delighted to receive applications from candidates who are passionate about their subject, a good role model and have an empathy for and an ability to motivate and inspire young people. We are looking for trainees who are energetic, enthusiastic and highly-motivated with a sense of humour and a sense of fun! You should demonstrate high expectations and have an ability to reflect to further improve your practice. We wish you every success with your application! Please do not hesitate to contact us at partnership@highamlaneschool.co.uk if we can be of any further assistance to you. ","otherRequirements":"Getting some classroom experience can help you to decide whether teaching is right for you. School experience will offer you the opportunity to talk to teachers and students, and observe teaching and pastoral work. Please contact partnership@highamlaneschool.co.uk to arrange school experience at one of our partner schools. All of this will give you valuable insight and a great focus point for your application and interviews. You will need to undergo Disclosure and Barring Service (DBS) clearance and complete a satisfactory medical report. Further information and instructions will be provided by the University should you be offered a place.","status":1,"createdAt":"2021-07-06T10:54:00.798Z","updatedAt":"2021-09-29T11:24:06.007Z","canSponsorStudentVisa":"yes","cycle":"2024"}
