{"id":"540ac3ec-6106-4373-8370-7ba6c630803b","name":"Mathematics","code":"39RT","qualification":"pgce_with_qts","startDate":"2024-07-31T23:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"72345aa7-096c-488f-8649-085b8178cadb","code":"G1","name":"Mathematics"}],"locations":[{"id":"d49e74ee-e896-4952-87b0-62305d54bd2d","name":"The Queen Elizabeth Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"007aa688-2142-4ce2-a3db-e763fbe80bad","name":"Higham Lane School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"b70e39ea-92ad-43be-91fc-640655247fd7","name":"Heath Lane Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"9e352cc6-b838-45ec-ac19-43294c81c6e3","name":"The Nuneaton Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"3cfe2f26-12c1-4734-9a7e-1254852ec01d","name":"Saint Martin's Catholic Voluntary Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"272b0e8e-84ce-4003-900b-8ccac703f274","name":"The George Eliot School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"9f80aa0f-3a00-456e-82e4-98d14bc335f1","name":"Hartshill School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"d1b36e0c-ba96-4e39-98d7-2a052600673d","code":"2KZ","name":"Higham Lane School Partnership"},"accreditedBody":{"id":"ef09ce50-ccfc-4346-a0ce-43e840153dab","code":"W20","name":"The University of Warwick"},"profPost":"BO","degreeGrade":"1","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Third party tests accepted from Equivalency Testing and A Star Equivalency. Please contact admissions at the University of Warwick for prices.","courseLength":"OneYear","feesUK":9250,"feeDetails":"Home and EU students can apply to the Student Loans Company online at (www.gov.uk/studentfinance) for a tuition fee loan to cover the full cost of the fees. ","aboutCourse":"Our Mathematics programme aims to develop you to become a highly-reflective practitioner, passionate about working with children. The course offers a mixture of academic and practical learning. \r\n\r\nYou will take 3 core modules in order to develop your expertise:\r\n* Subject Studies where you will learn how to teach your subject, including planning, teaching, assessment and classroom management.\r\n* Professional Studies where you will learn about working in classrooms and schools and the broader context of teaching. \r\n* Professional Practice which takes place in two contrasting schools where there will be opportunities for observation, practice and research. \r\n\r\nOur accredited provider is The University of Warwick, a top ranked university in the Midlands, with Ofsted Outstanding rating for ITE in the Secondary phase.\r\n\r\nYou will spend the majority of this course learning on-the-job in schools.\r\nBoth at university and in school you will be taught and supported by highly experienced tutors, practitioners and mentors.\r\n\r\nYou will be assessed in 3 modules: \r\n* Subject Studies which consists of a series of assessments focussing on both educational theory and issues associated with your specialist subject (1 x 1500 word formative essay, 1 x 4000 word essay and an academic poster). \r\n* Reflective Practice which is a reflective case study on an area of educational practice in your placement school supported by a literature review (1 x 5000 word essay). \r\n* Professional Practice to demonstrate that you meet the Teachers’ Standards.\r\n\r\nIf you are passionate about teaching, ambitious, reflective and with excellent communication skills and a desire to positively influence and transform young people’s lives, we look forward to receiving your application.\r\n\r\nIn return we will offer you:\r\n•\ta PGCE programme with QTS and Master’s level credits with our Higher Education Institution (HEI) partner, The University of Warwick\r\n•\ta training programme including sessions at university, Higham Lane School as well as your placement schools\r\n•\tan on-the-job training approach working alongside experienced teachers to plan, deliver and evaluate lessons from the start of the academic year\r\n•\tteaching experience at 2 complementary schools\r\n•\topportunities to work alongside other trainees to share ideas and experiences\r\n•\tboth subject and professional mentors to support and guide you through your training year.\r\n\r\nSuccessful applicants may be placed at any of our schools depending on phase and subject specialism.\r\n\r\nFor more information on our partner schools, please see (https://www.highamlaneschool.co.uk/partnership).","interviewProcess":"You will be invited to interview either, at your base school or the lead school. You will have a tour of the school and an opportunity to meet staff and students in your chosen department. You will be asked to prepare a 20 minute learning activity to deliver to a group of Year 7 or Year 8 students.\r\nThere will also be a baseline assessment of your subject knowledge, literacy and numeracy skills. Following this, you will have an interview with our School Direct Co-ordinator and a representative from your base school, either the professional or subject mentor.\r\nAll of this gives us an opportunity to find out a bit more about you and it is also an opportunity for you to meet us and establish whether this is the right course for you!\r\nYou will be contacted later the same day with our decision.\r\nSuccessful applicants will also be offered the opportunity of some school experience with our partnership prior to starting the course. This will enable you to talk to teachers and students, observe teaching and pastoral work and become familiar with policies and procedures.  All of this will give you valuable insight and a great experience prior to starting your course. It will also mean you are a familiar face in school to both staff and students and you can really hit the ground running in September!","howSchoolPlacementsWork":"Higham Lane School Partnership comprises 11 partner schools across both primary and secondary phases. Successful applicants may be placed at any of our schools depending on phase and subject specialism. We are a close partnership, both in terms of location and our approach to the training provision. Our partnership has an expert and experienced team of mentors to support trainees and provide an excellent in-school experience in a range of contexts. All of our schools are within a 30 minute drive of each other with 4 of them based in Nuneaton.\r\n\r\nYou will have 2 school placements as well as 1 week in a Primary school. You will spend the majority of the year in your base school, with a 6 week complementary placement at a contrasting school in the spring term. All schools offer 11-16 experience and, where possible, we will ensure you have some post-16 experience. \r\nYou will also spend 1 day a week at university. \r\n\r\nYour training programme will include sessions at university, Higham Lane School as well as your placement schools. We offer you an on-the-job training approach, working alongside experienced teachers to plan, deliver and evaluate lessons from the start of the academic year. You will have opportunities to work alongside other trainees to share ideas and experiences; both subject and professional mentors will support and guide you through your training year.\r\n\r\nWhat have previous trainees said about us?\r\n‘The Department have offered me invaluable support throughout my placement, encouraging me to take risks and work to become an excellent classroom practitioner.’\r\n‘I have found my one-to-one weekly meetings with my subject mentor invaluable, as they have enabled me to gain advice and support from a teacher who has years of teaching experience behind her.’\r\n‘The school’s high expectations in terms of behaviour and learning have pushed me to have higher expectations of myself and my pupils which has impacted positively on my teaching practice. The Department has supported me well through a tough part of the PGCE and this has given me confidence going into my NQT year.’\r\n\r\nSee our website (https://www.highamlaneschool.co.uk/partnership).\r\n","personalQualities":"We would be delighted to receive applications from candidates who are passionate about their subject, a good role model and have an empathy for and an ability to motivate and inspire young people. We are looking for trainees who are energetic, enthusiastic and highly-motivated with a sense of humour and a sense of fun! You should demonstrate high expectations and have an ability to reflect to further improve your practice.\r\nWe wish you every success with your application! \r\nPlease do not hesitate to contact us at partnership@highamlaneschool.co.uk if we can be of any further assistance to you. \r\n","otherRequirements":"Getting some classroom experience can help you to decide whether teaching is right for you. School experience will offer you the opportunity to talk to teachers and students, and observe teaching and pastoral work. Please contact partnership@highamlaneschool.co.uk to arrange school experience at one of our partner schools. All of this will give you valuable insight and a great focus point for your application and interviews.\r\nYou will need to undergo Disclosure and Barring Service (DBS) clearance and meet the requirements for Fitness to Teach. \r\n\r\n","status":1,"createdAt":"2021-07-06T10:53:59.499Z","updatedAt":"2021-09-29T10:48:27.636Z","canSponsorStudentVisa":"yes","cycle":"2024"}
