{"id":"1f5f19be-6134-4616-b680-a52c2af21ae0","name":"English","code":"384T","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3aed1aa8-ae46-4b68-92bb-a6cc20655c59","code":"Q3","name":"English"}],"locations":[{"id":"b4c0076a-216a-4e5c-98f1-a101c461e251","name":"Blatchington Mill School","isPublished":"N","status":"S","vacancies":"F"},{"id":"1752a2c2-72e2-4fb7-83ba-ba5ad4034840","name":"Ratton School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"4180804e-3d10-448f-adf9-aef16c05404a","name":"Peacehaven Community School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"735c2e96-f547-4c16-ada9-4888a7934ff1","name":"Priory School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"211dc5c5-1401-4ec1-bf9c-4295961889d0","name":"Dorothy Stringer School","isPublished":"N","status":"S","vacancies":"F"},{"id":"c46d6b34-a991-4411-8559-498c18a17ea1","name":"Hove Park School","isPublished":"N","status":"S","vacancies":"F"}],"trainingProvider":{"id":"d42008b9-26c1-45a8-95c6-fefca8f13512","code":"1KN","name":"BHSSA"},"accreditedBody":{"id":"4d4cceab-1516-4a6c-a9ab-5de0e32e1fe1","code":"S90","name":"University of Sussex"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Grade 4 (C) or above in English and Maths, or equivalent qualification\n\nWe require candidates to source and undertake GCSE Equivalency tests at their own expense. We can accept equivalency test passes from 'A Star' and 'Equivalency testing.com'","courseLength":"OneYear","feesUK":9250,"feesInternational":14460,"aboutCourse":"At the heart of the English PGCE course at Sussex is a belief in the importance of reading. Enabling pupils to become independent, critical readers who love reading and talking about texts with teachers and peers will allow them to succeed in all other areas of the English - and indeed the school - curriculum. Therefore, you will gain understanding of how to develop the reading abilities of your pupils, drawing connections between your own knowledge and love of literature and the comprehension strategies and exposure to challenging texts that will enable your pupils to become similarly enthusiastic, engaged readers. Exploratory talk about texts is also central to developing pupils' talk and writing, combined with rich, textual models. You will deepen your own grammatical understanding and that of your pupils, enabling them to become creative, effective writers.\r\n\r\nOur English team draw equally from the University and our school partnership. Teaching faculty include tutors with experience as Heads of English in school, Lead Examiners for GCSE examination boards and teacher-educator researchers, who specialise in developing pupils' reading and higher-cognitive talk and in Special Educational Needs and Disabilities (SEND). Our dynamic partnership includes excellent school practitioners leading sessions on topics including A level English Language, Drama and E-learning.\r\n\r\nYour subject and pedagogic knowledge will also be enriched by visits to, for example, the British Library, the Globe Theatre and the Mass Observation Archive, modelling 'out-of-classroom' experiences, central to your pupils' learning.  Our focus on reading is pivotal to raising the achievement of disadvantaged students, and our partnership is currently involved in  a range of research interventions on reading, including evaluating the most effective strategies for improving educational outcomes, such as 'Drop Everything and Read!' With us, you will develop your understanding of innovative, evidence-based practice, fusing theory and practice in academic assignments.\r\n\r\nYou will learn to be an English teacher through a combination of taught sessions at the university and school-led professional development and classroom practice. You will start your course with a 2-3 week induction at the University in September, which is followed by a programme of lectures, seminars and workshops every Friday. These involve presentations, group work, role play, classroom modelling and peer teaching, for which you will explore ideas and approaches and reflect on your own experiences.","interviewProcess":"Applicants who meet the entry requirements will be invited to a selection event either face to face or online via Zoom. Following a successful interview schools will then invite the candidate for a school interview.\r\n\r\nAs part of the interview process candidates can expect to;\r\n\r\nBefore the selection day \r\n* Listen to a video talk giving further information about the course\r\n* Complete some paperwork including our 'Suitability for Teaching Declaration'. \r\nBoth the above will be sent to you by email in your invitation to interview\r\n\r\nOn the selection day \r\n* Have an individual online interview, via Zoom or face to face with a tutor and an experienced  teacher from a partnership school\r\n* Deliver a short pre-prepared classroom type teaching task or presentation to the panel. You will receive details of the task in your invitation to interview.\r\n* Show the interview panel a form of photo ID on camera or in person for checking\r\n* Have an opportunity to ask the panel questions you may have about the course and your individual circumstances.\r\n\r\nAfter the selection day\r\n* If we offer you a place on the course and you decide to accept we will need you to provide your original Undergraduate Degree, and GCSE Maths and English certificates \r\n\r\nShowing  an awareness of the curriculum and school life is part of the selection process so candidates may wish to prepare themselves by spending some time in an appropriate school setting for the subject/phase they intend to teach beforehand.","howSchoolPlacementsWork":"Our Full-time Course\r\nYou will undertake two periods of Professional Practice in two contrasting schools over the academic year September to June, training to teach in Key Stage 4 (14-16) and Key Stage 5 (16-18).\r\n\r\nPlacement 1: End of September to February halfterm. Trainees benefit from a serial placement where the working week is divided between four days in school and a day of reflection and training at the University on Fridays. This ensures a weekly focus on theory and pedagogy as well as practice.\r\n\r\nPlacement 2: February Halfterm to Easter in a contrasting school or college with a return to your original placement school until May half term to complete the course. There are fewer University days to give you experience of working a 5 day school week. ","personalQualities":"As a partnership we are looking for; \r\n* A passion for English and interest and involvement beyond your degree\r\n* A strong knowledge and understanding of the study of English, and a sound awareness of how the subject is taught within UK secondary schools\r\n* Effective communication skills and good organisational skills\r\n* Awareness of current educational developments and issues\r\n* Experience with young people and commitment to developing individuals\r\n* The ability to evaluate practice and address your weaknesses\r\n* Initiative, flexibility and responsiveness to change\r\n* A sense of responsibility and ability to work in a team.\r\n","otherRequirements":"Working with children: You must not be excluded from working with children, as a result of a criminal record or other reason. The Disclosure and Barring Service provides access to records held nationwide through its disclosure service. All trainees must obtain successful DBS clearance before starting an Initial Teacher Education programme.\r\n\r\n* Health requirements: All trainees must be screened for mental and physical fitness to teach by the University's Occupational Health Department before admission to the programme.\r\n","status":1,"createdAt":"2021-07-06T10:49:41.231Z","updatedAt":"2021-09-29T10:46:05.183Z","canSponsorStudentVisa":"yes","cycle":"2024"}
