{"id":"68b4655a-1657-4803-9f77-6f76f77590b8","name":"Music","code":"384D","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"24311bef-8673-41fb-933c-53f887fb6976","code":"W3","name":"Music"}],"locations":[{"id":"17ec2985-d6c1-410b-8929-340f1a66cb6e","name":"Patcham High School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"211dc5c5-1401-4ec1-bf9c-4295961889d0","name":"Dorothy Stringer School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"d42008b9-26c1-45a8-95c6-fefca8f13512","code":"1KN","name":"BHSSA"},"accreditedBody":{"id":"4d4cceab-1516-4a6c-a9ab-5de0e32e1fe1","code":"S90","name":"University of Sussex"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Grade 4 (C) or above in English and Maths, or equivalent qualification\n\nWe require candidates to source and undertake GCSE Equivalency tests at their own expense. We can accept equivalency test passes from 'A Star' and 'Equivalency testing.com'","courseLength":"OneYear","feesUK":9250,"feesInternational":14460,"aboutCourse":"It's an exciting time for Music education with many new initiatives and a Music curriculum which recognises the importance of the subject in the lives of young people, and emphasises creativity and innovation. Throughout the Music ITE course, you will be encouraged to consider your pivotal role as a musician in bringing together music from both in and outside of the school environment, helping young people to make sense of their learning and nurturing their development.\r\n\r\nHaving an identity as a 'musician in the classroom', and the ability to facilitate creative music-making, are fundamental attributes of a successful Music teacher. You will build on your existing skills as a musician and develop your subject knowledge in previously unfamiliar areas - whether your background is traditional western classical, popular music, world music or music technology. You should be open to new styles and genres, and be prepared to broaden your musical horizons.\r\n\r\nMusic ITE is highly interactive and learning is gained through seminars, discussion, tutorials and practical workshops - such as singing, improvisation, composing and world music. Imaginatively run seminar groups and workshops - often led by visiting specialists - develop your confidence and expertise in areas such as approaches to GCSE and A level, creative teaching and learning strategies, and directing extra-curricular musical activities.\r\n\r\nYou are supported in the use of music technology, but not expected to have good skills in this area before you begin the course. We encourage 'hands on' sessions to develop skills and consider how technology can be effectively integrated in the classroom. The emphasis of the course is on applying knowledge gained in seminars to the classroom. A number of curriculum days are spent as a cohort in schools, allowing the opportunity to observe excellent practitioners in operation, and to participate in good practice.\r\n\r\nIn addition, some curriculum days are spent embedded in local school music departments, enabling observation of excellent practice and opportunities to try out different approaches and technologies. The Music team include practicing teachers and is active nationally and internationally in music education research and policy.","interviewProcess":"Applicants who meet the entry requirements will be invited to a selection event either face to face or online via Zoom. Following a successful interview schools will then invite the candidate for a school interview.\r\n\r\nAs part of the interview process candidates can expect to;\r\n\r\nBefore the selection day \r\n* Listen to a video talk giving further information about the course\r\n* Complete some paperwork including our 'Suitability for Teaching Declaration'. \r\nBoth the above will be sent to you by email in your invitation to interview\r\n\r\nOn the selection day \r\n* Have an individual online interview, via Zoom or face to face with a tutor and an experienced  teacher from a partnership school\r\n* Deliver a short pre-prepared classroom type teaching task or presentation to the panel. You will receive details of the task in your invitation to interview.\r\n* Show the interview panel a form of photo ID on camera or in person for checking\r\n* Have an opportunity to ask the panel questions you may have about the course and your individual circumstances.\r\n\r\nAfter the selection day\r\n* If we offer you a place on the course and you decide to accept we will need you to provide your original Undergraduate Degree, and GCSE Maths and English certificates \r\n\r\nShowing  an awareness of the curriculum and school life is part of the selection process so candidates may wish to prepare themselves by spending some time in an appropriate school setting for the subject/phase they intend to teach beforehand.","howSchoolPlacementsWork":"Our Full-time Course\r\nYou will undertake two periods of Professional Practice in two contrasting schools over the academic year September to June, training to teach in Key Stage 4 (14-16) and Key Stage 5 (16-18).\r\n\r\nPlacement 1: End of September to February halfterm. Trainees benefit from a serial placement where the working week is divided between four days in school and a day of reflection and training at the University on Fridays. This ensures a weekly focus on theory and pedagogy as well as practice.\r\n\r\nPlacement 2: February Halfterm to Easter in a contrasting school or college with a return to your original placement school until May half term to complete the course. There are fewer University days to give you experience of working a 5 day school week. \r\n","personalQualities":"As a partnership we are looking for; \r\n* A passion for Music and interest and involvement beyond your degree\r\n* A strong knowledge and understanding of the study of Music, and a sound awareness of how the subject is taught within UK secondary schools\r\n* Effective communication skills and good organisational skills\r\n* Awareness of current educational developments and issues\r\n* Experience with young people and commitment to developing individuals\r\n* The ability to evaluate practice and address your weaknesses\r\n* Initiative, flexibility and responsiveness to change\r\n* A sense of responsibility and ability to work in a team.\r\n","otherRequirements":"Working with children: You must not be excluded from working with children, as a result of a criminal record or other reason. The Disclosure and Barring Service provides access to records held nationwide through its disclosure service. All trainees must obtain successful DBS clearance before starting an Initial Teacher Education programme.\r\n\r\n* Health requirements: All trainees must be screened for mental and physical fitness to teach by the University's Occupational Health Department before admission to the programme.\r\n","status":1,"createdAt":"2021-07-06T10:49:41.044Z","updatedAt":"2021-09-29T11:30:23.893Z","canSponsorStudentVisa":"yes","cycle":"2024"}
