{"id":"80a150c7-85a8-4af1-8676-889a1b44a6a8","name":"Physical Education","code":"3DTC","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"74d64a54-5e34-4590-b6c7-528dd0cf26fe","code":"C6","name":"Physical education"}],"locations":[{"id":"17ec2985-d6c1-410b-8929-340f1a66cb6e","name":"Patcham High School","isPublished":"N","status":"S","vacancies":"F"},{"id":"c46d6b34-a991-4411-8559-498c18a17ea1","name":"Hove Park School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"4180804e-3d10-448f-adf9-aef16c05404a","name":"Peacehaven Community School","isPublished":"N","status":"S","vacancies":"F"},{"id":"287765f5-c37e-44d4-b22f-6e9150f5d5e0","name":"Varndean School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"735c2e96-f547-4c16-ada9-4888a7934ff1","name":"Priory School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"1752a2c2-72e2-4fb7-83ba-ba5ad4034840","name":"Ratton School","isPublished":"N","status":"S","vacancies":"F"}],"trainingProvider":{"id":"d42008b9-26c1-45a8-95c6-fefca8f13512","code":"1KN","name":"BHSSA"},"accreditedBody":{"id":"d2ba71f2-c125-4d86-bb22-736e67043120","code":"B72","name":"University of Brighton"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Further information can be found at https://www.equivalencytesting.com/","courseLength":"OneYear","feesUK":9250,"feesInternational":14460,"aboutCourse":"All teaching takes place at the School of Sport and Service Management, based in Eastbourne, where there are extensive sports facilities such as six badminton court-sized sports halls, two gymnasiums, plus a fitness suite, Astro turf pitch and swimming pool.\r\n\r\nWhen studying with us at the university, you’ll experience and learn how to teach practical physical education through The A-list of physical activities. These include physical activities considered to be less conventional compared to more established types of activities. The A-list includes the following non-conventional physical activities: \r\n\r\nAlternative – Physical activities that depart from or challenge traditional norms and are considered to be non-traditional in a UK context such as tchoukball, kin-ball and korfball.\r\n\r\nAdapted – Physical activities suited to pupils with additional learning needs but that can also be practiced by all pupils within secondary schools such as boccia, goalball and new age kurling.\r\n\r\nArtistic – Physical activities related to cultural and artistic forms of dance.\r\n\r\nAesthetic – Physical activities that are creative and involve a combination of movements requiring precision, fluency and control such as urban gymnastics, cheerleading and trampolining.\r\n\r\nAquatic – Physical activities that take place in or on the water such as swimming, synchronised swimming, water aerobic dancing, water polo, life-saving and personal survival.\r\n\r\nAthletic – Physical activities that require physical skill, agility and stamina such as street surfing.\r\n\r\nAdventurous – Physical activities that require precise problem-solving and decision making skills such as orienteering and climbing.\r\n\r\nAerobic – Physical activities that are sustained and require low to high intensity such as jogging, rowing and cycling.\r\n\r\nAnaerobic – Physical activities that are non-endurance activities involving speed strength and power such as sprinting, jumping, and throwing.\r\n\r\nThe university works in partnership with schools and colleges to provide a high quality programme of support, ensuring a sound relationship between theory and practice. You will benefit from undertaking two placements in two schools or colleges, spending two-thirds of your year teaching, under supervision. You'll also have the opportunity to visit additional schools or colleges as part of the Peer Observation programme.\r\n","interviewProcess":"Applicants who meet the entry requirements will be invited to a selection event either face to face or online via Zoom. Following a successful interview schools will then invite the candidate for a school interview.\r\n\r\nAs part of the interview process candidates can expect to;\r\n\r\nBefore the selection day \r\n* Listen to a video talk giving further information about the course\r\n* Complete some paperwork including our 'Suitability for Teaching Declaration'. \r\nBoth the above will be sent to you by email in your invitation to interview\r\n\r\nOn the selection day \r\n* Have an individual online interview, via Zoom or face to face with a tutor and an experienced  teacher from a partnership school\r\n* Deliver a short pre-prepared classroom type teaching task or presentation to the panel. You will receive details of the task in your invitation to interview.\r\n* Show the interview panel a form of photo ID on camera or in person for checking\r\n* Have an opportunity to ask the panel questions you may have about the course and your individual circumstances.\r\n\r\nAfter the selection day\r\n* If we offer you a place on the course and you decide to accept we will need you to provide your original Undergraduate Degree, and GCSE Maths and English certificates \r\n\r\nShowing  an awareness of the curriculum and school life is part of the selection process so candidates may wish to prepare themselves by spending some time in an appropriate school setting for the subject/phase they intend to teach beforehand.","howSchoolPlacementsWork":"You will spend a minimum of 120 days on school-based activities, with your training shared between the university and the partner school. \r\n\r\nYour school-based training will include observing teachers, working with individual pupils and groups of pupils, team teaching and independent teaching. Your training will also entail completing specific subject tasks and developing your knowledge of school policy and effective practices.\r\n\r\nYou will maintain a professional training portfolio and be supported to review your work critically and analytically as well as to set appropriately challenging targets. We will also develop an action plan with you to identify strengths, development needs and actions, so that your practice is continually developing.\r\n\r\nKey aims of the school-based training-\r\n-Advance the development of your professional attributes, skills, knowledge and understanding.\r\n-Provide practical and specific experiences that enable you to critically analyse your professional practice and take responsibility for your own professional development.\r\n-Enable you to work collaboratively with colleagues in order to develop an understanding of the ways in which the attainment, development and wellbeing of all learners can be achieved with a unified support and teaching system.\r\n-Provide opportunities that enable you to adopt a creative and constructively critical approach towards your practice, supported by appropriate reading and research.","personalQualities":"","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:49:42.050Z","updatedAt":"2021-09-29T14:01:48.575Z","canSponsorStudentVisa":"yes","cycle":"2024"}
