{"id":"97a527e5-2138-47d7-af15-f77113e19ae3","name":"Physics","code":"38KF","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"bf97cd0a-224c-43d3-a021-84143df13e8d","code":"F3","name":"Physics"}],"locations":[{"id":"4180804e-3d10-448f-adf9-aef16c05404a","name":"Peacehaven Community School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"1752a2c2-72e2-4fb7-83ba-ba5ad4034840","name":"Ratton School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"17ec2985-d6c1-410b-8929-340f1a66cb6e","name":"Patcham High School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"d42008b9-26c1-45a8-95c6-fefca8f13512","code":"1KN","name":"BHSSA"},"accreditedBody":{"id":"d2ba71f2-c125-4d86-bb22-736e67043120","code":"B72","name":"University of Brighton"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Further information can be found at https://www.equivalencytesting.com/","courseLength":"OneYear","feesUK":9250,"feesInternational":14460,"aboutCourse":"Two-thirds of your year will be spent teaching, under supervision, in schools. Our tutors and mentors will advise and support you throughout each placement. You will receive comprehensive feedback during this time, enabling you to see where you are doing well and where you might need to improve.\r\n\r\nThe university works in partnership with schools and colleges to provide a high quality programme of support, ensuring a sound relationship between theory and practice. There are two placements in two schools or colleges with the opportunity to visit further schools or colleges as part of the 'Peer Observation' programme.\r\n\r\nThe School of Education is excellently equipped with multimedia training materials, giving you the opportunity to develop your confidence and competence in the use of ICT. Our multimedia suites are regularly updated to keep up with technological advancements in classroom teaching provision.","interviewProcess":"You will be required to attend two interviews, one at the University and one at the school that you wish to apply for.  \r\n\r\nUniversity interviews will be a mixture of virtual and in person. Candidates will receive confirmation of the interview process at the time of arrangement. \r\n\r\nBelow is an example of  the University and School interview process:\r\n\r\nUniversity Interview \r\nArrival and document check \r\n11.00 – 12.30 Welcome and overview of the programme with opportunity to ask questions.  Writing task. \r\n12.30- 13.25 Lunch Break \r\n13.30 – 16.00 Presentations & individual interviews\r\n\r\nSchool Interview\r\n8.45 Arrival and document check \r\n9.00 - 9.20 Teaching Task to a group of students\r\n9.30-9.50 Interview","howSchoolPlacementsWork":"You will spend a minimum of 120 days on school-based activities, with your training shared between the university and the partner school. \r\n\r\nYour school-based training will include observing teachers, working with individual pupils and groups of pupils, team teaching and independent teaching. Your training will also entail completing specific subject tasks and developing your knowledge of school policy and effective practices.\r\n\r\nYou will maintain a professional training portfolio and be supported to review your work critically and analytically as well as to set appropriately challenging targets. We will also develop an action plan with you to identify strengths, development needs and actions, so that your practice is continually developing.\r\n\r\nKey aims of the school-based training:\r\n-advance the development of your professional attributes, skills, knowledge and understanding\r\n-provide practical and specific experiences that enable you to critically analyse your professional practice and take responsibility for your own professional development\r\n-enable you to work collaboratively with colleagues in order to develop an understanding of the ways in which the attainment, development and well-being of all learners can be achieved with a unified support and teaching system\r\n-provide opportunities that enable you to adopt a creative and constructively critical approach towards your practice, supported by appropriate reading and research.","personalQualities":"","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:49:41.958Z","updatedAt":"2021-09-29T14:02:20.131Z","canSponsorStudentVisa":"yes","cycle":"2024"}
