{"id":"c657fb0e-c525-467c-9aee-2e9835738f8a","name":"English","code":"385M","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3aed1aa8-ae46-4b68-92bb-a6cc20655c59","code":"Q3","name":"English"}],"locations":[{"id":"17ec2985-d6c1-410b-8929-340f1a66cb6e","name":"Patcham High School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"1752a2c2-72e2-4fb7-83ba-ba5ad4034840","name":"Ratton School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"d42008b9-26c1-45a8-95c6-fefca8f13512","code":"1KN","name":"BHSSA"},"accreditedBody":{"id":"d2ba71f2-c125-4d86-bb22-736e67043120","code":"B72","name":"University of Brighton"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Further information can be found at https://www.equivalencytesting.com/","courseLength":"OneYear","feesUK":9250,"feesInternational":14460,"aboutCourse":"A detailed exploration of literacy as a social practice ensures that graduates move beyond the minimum requirements of the Initial Teacher Training National Curriculum. The course, in content and methodology, highlights the importance of literature and drama in language, literacy and learning. Graduates are able, as they enter the profession, to contribute to innovative approaches in teaching English.\r\n\r\nThere are four strands to this course: subject study/subject education, education studies, school placements and professional development.\r\nCourse content is kept up to date with changes in local and national initiatives and legislation, so you will be confident that your working knowledge is based on current theory and practice.\r\n\r\nThe subject study/subject education strand builds upon your existing expertise in English and provides you with the opportunity to develop skills, knowledge and understanding of English in the secondary school context. You will consider the learning and teaching strategies that are relevant to the specialist subject. \r\n\r\nThe subject education module is specifically related to teaching the specialist subject in school while the subject study module enables you to take your subject specialist studies to an increased depth. You can earn 20 masters-level credits through the assessment for the subject study module.\r\n\r\nThe education studies strand will give you a thorough understanding of the learning process itself, including an appreciation of individual differences. The study of the principles and practices of learning and teaching is through both school and university settings, allowing you to develop practical competencies, supported by analytical skills. By the end of the course you will:\r\n\r\n-refine your understanding of pedagogy, including an appreciation of current and emerging educational theories and debate\r\n\r\n-understand how to use and adapt a range of teaching, learning, management and assessment strategies in order to meet the varying needs of learners\r\n\r\n-understand how the progress and well-being of learners is affected by a range of influences and know how to take account of the principles of equality, inclusion and diversity.\r\n\r\n\r\nStudents use an e-portfolio to record their achievements and this is reviewed throughout the course. An action plan is used to support professional development during placements and makes up a significant part of the improvement planning process.\r\n\r\nAt the end of the course, the e-portfolio provides evidence that you have met the Teachers’ Standards for the award of Qualified Teacher Status.","interviewProcess":"\r\nYou will be required to attend two interviews, one at the University and one at the school that you wish to apply for.  \r\n\r\nUniversity interviews will be a mixture of virtual and in person. Candidates will receive confirmation of the interview process at the time of arrangement. \r\n\r\nBelow is an example of  the University and School interview process:\r\n\r\nUniversity Interview \r\nArrival and document check \r\n11.00 – 12.30 Welcome and overview of the programme with opportunity to ask questions.  Writing task. \r\n12.30- 13.25 Lunch Break \r\n13.30 – 16.00 Presentations & individual interviews\r\n\r\nSchool Interview\r\n8.45 Arrival and document check \r\n9.00 - 9.20 Teaching Task to a group of students\r\n9.30-9.50 Interview","howSchoolPlacementsWork":"You will spend a minimum of 120 days on school-based activities, with your training shared between the university and the partner school. \r\n\r\nYour school-based training will include observing teachers, working with individual pupils and groups of pupils, team teaching and independent teaching. Your training will also entail completing specific subject tasks and developing your knowledge of school policy and effective practices.\r\nYou will maintain a professional training portfolio and be supported to review your work critically and analytically as well as to set appropriately challenging targets. We will also develop an action plan with you to identify strengths, development needs and actions, so that your practice is continually developing.\r\n\r\nKey aims of the school-based training:\r\n-advance the development of your professional attributes, skills, knowledge and understanding\r\n-provide practical and specific experiences that enable you to critically analyse your professional practice and take responsibility for your own professional development\r\n-enable you to work collaboratively with colleagues in order to develop an understanding of the ways in which the attainment, development and well-being of all learners can be achieved with a unified support and teaching system\r\nprovide opportunities that enable you to adopt a creative and -constructively critical approach towards your practice, supported by appropriate reading and research.\r\n\r\nDuring your school-based training, university tutors, school mentors and teachers will support you and take shared responsibility for your professional development.\r\n\r\nYour progress will be observed and assessed throughout your school-based training by university and school staff, followed by feedback sessions to discuss your development. Your e-portfolio will also be evaluated as part of the overall assessment.\r\n\r\nThrough doing School Direct it allows you to have the choice of school you would like to be based in for your main placement, route you will be able to apply for the school you would like to teach in. \r\n\r\n","personalQualities":"","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:49:41.722Z","updatedAt":"2021-09-29T13:57:58.550Z","canSponsorStudentVisa":"yes","cycle":"2024"}
