{"id":"d340d5a9-0c66-45cb-ad91-b660c14eef07","name":"Drama","code":"384Y","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"69052223-ca45-4781-a8d3-cb92447a6d78","code":"13","name":"Drama"}],"locations":[{"id":"211dc5c5-1401-4ec1-bf9c-4295961889d0","name":"Dorothy Stringer School","isPublished":"N","status":"S","vacancies":"F"},{"id":"17ec2985-d6c1-410b-8929-340f1a66cb6e","name":"Patcham High School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"4180804e-3d10-448f-adf9-aef16c05404a","name":"Peacehaven Community School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"d3bad09a-df6b-475e-9553-a5550e1519a3","name":"Shoreham Academy","isPublished":"N","status":"S","vacancies":"F"}],"trainingProvider":{"id":"d42008b9-26c1-45a8-95c6-fefca8f13512","code":"1KN","name":"BHSSA"},"accreditedBody":{"id":"4d4cceab-1516-4a6c-a9ab-5de0e32e1fe1","code":"S90","name":"University of Sussex"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Grade 4 (C) or above in English and Maths, or equivalent qualification\n\nWe require candidates to source and undertake GCSE Equivalency tests at their own expense. We can accept equivalency test passes from 'A Star' and 'Equivalency testing.com'","courseLength":"OneYear","feesUK":9250,"feesInternational":14460,"aboutCourse":"Successful trainees will be recommended for Qualified Teacher Status (QTS).\r\n\r\nDrama offers school pupils the opportunity to enrich their lives and communities, explore complex issues and emotions, and build their self-confidence and practical skills. Whether at Key Stage 3, GCSE or A level, Drama nourishes pupils, gives them a wide range of experience from working in groups, and makes them use their imagination to acquire technical and design expertise. Cross-curricular opportunities also enable the transferral of skills. Teacher trainees studying on the Secondary Drama course are engaged in teaching one of the most rewarding subjects in the school curriculum. You will develop your understanding of the place of this subject within Secondary education, and learn a range of strategies for teaching this exciting subject. Beyond the classroom, you will engage in the broader role and position of Drama in school life, supporting - and sometimes leading - performances and productions.\r\n\r\nOur partnership believes that Drama should be an inclusive experience for everyone. Distinctive features of our course include the different inputs offered by local school practitioners, as well as teaching labs where cohorts can stretch and challenge each other in practice-based workshops.\r\n\r\nTeaching, learning and assessment\r\nYou will learn to be a Drama teacher through a combination of taught sessions at the University and school-led professional development and classroom practice. You will start your course with a 2-3 week induction at the University in September, which is followed by a programme of lectures, seminars and workshops every Friday. These involve presentations, group work, role play, classroom modelling and peer teaching for which you will explore ideas and approaches and reflect on your own experiences.\r\n\r\nOver the course of the acdemic year, you will undertake two periods of professional practice in two different schools (these may vary slightly in length, but will equate to a minimum of 120 working days in total). You will be supported in your professional placements by a Drama specialist who will act as a mentor, offering you tutorial support and developing a programme of practice-based professional studies for you. Your progress will be assessed through observations, feedback and discussion. To this end, you will create and maintain a portfolio of evidence demonstrating how you have met the various Teacher's Standards.\r\n\r\nYou will engage with the theoretical foundations of classroom practice and demonstrate the depth of your professional knowledge by completing three academic assignments during the course","interviewProcess":"Applicants who meet the entry requirements will be invited to a selection event either face to face or online via Zoom. Following a successful interview schools will then invite the candidate for a school interview.\r\n\r\nAs part of the interview process candidates can expect to;\r\n\r\nBefore the selection day \r\n* Listen to a video talk giving further information about the course\r\n* Complete some paperwork including our 'Suitability for Teaching Declaration'. \r\nBoth the above will be sent to you by email in your invitation to interview\r\n\r\nOn the selection day \r\n* Have an individual online interview, via Zoom or face to face with a tutor and an experienced  teacher from a partnership school\r\n* Deliver a short pre-prepared classroom type teaching task or presentation to the panel. You will receive details of the task in your invitation to interview.\r\n* Show the interview panel a form of photo ID on camera or in person for checking\r\n* Have an opportunity to ask the panel questions you may have about the course and your individual circumstances.\r\n\r\nAfter the selection day\r\n* If we offer you a place on the course and you decide to accept we will need you to provide your original Undergraduate Degree, and GCSE Maths and English certificates \r\n\r\nShowing  an awareness of the curriculum and school life is part of the selection process so candidates may wish to prepare themselves by spending some time in an appropriate school setting for the subject/phase they intend to teach beforehand.","howSchoolPlacementsWork":"Our Full-time Course\r\nYou will undertake two periods of Professional Practice in two contrasting schools over the academic year September to June, training to teach in Key Stage 4 (14-16) and Key Stage 5 (16-18).\r\n\r\nPlacement 1: End of September to February halfterm. Trainees benefit from a serial placement where the working week is divided between four days in school and a day of reflection and training at the University on Fridays. This ensures a weekly focus on theory and pedagogy as well as practice.\r\n\r\nPlacement 2: February Halfterm to Easter in a contrasting school or college with a return to your original placement school until May half term to complete the course. There are fewer University days to give you experience of working a 5 day school week. ","personalQualities":"As a partnership we are looking for; \r\n* A passion for Drama and interest and involvement beyond your degree\r\n* A strong knowledge and understanding of the study of Drama, and a sound awareness of how the subject is taught within UK secondary schools\r\n* Effective communication skills and good organisational skills\r\n* Awareness of current educational developments and issues\r\n* Experience with young people and commitment to developing individuals\r\n* The ability to evaluate practice and address your weaknesses\r\n* Initiative, flexibility and responsiveness to change\r\n* A sense of responsibility and ability to work in a team.\r\n","otherRequirements":"Working with children: You must not be excluded from working with children, as a result of a criminal record or other reason. The Disclosure and Barring Service provides access to records held nationwide through its disclosure service. All trainees must obtain successful DBS clearance before starting an Initial Teacher Education programme.\r\n\r\n* Health requirements: All trainees must be screened for mental and physical fitness to teach by the University's Occupational Health Department before admission to the programme.\r\n","status":1,"createdAt":"2021-07-06T10:49:41.285Z","updatedAt":"2021-09-29T10:12:30.558Z","canSponsorStudentVisa":"yes","cycle":"2024"}
