{"id":"d5f08a4a-1c57-4b8b-8043-5adebdfaa3ef","name":"Design and Technology","code":"384Z","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"118fabd7-86d0-4a40-9e9a-e5c302abe59b","code":"DT","name":"Design and technology"}],"locations":[{"id":"211dc5c5-1401-4ec1-bf9c-4295961889d0","name":"Dorothy Stringer School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"735c2e96-f547-4c16-ada9-4888a7934ff1","name":"Priory School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"b3a17ef5-484a-4ede-8572-74b81d5c541e","name":"Cardinal Newman Catholic School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"4180804e-3d10-448f-adf9-aef16c05404a","name":"Peacehaven Community School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"c46d6b34-a991-4411-8559-498c18a17ea1","name":"Hove Park School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"287765f5-c37e-44d4-b22f-6e9150f5d5e0","name":"Varndean School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"d42008b9-26c1-45a8-95c6-fefca8f13512","code":"1KN","name":"BHSSA"},"accreditedBody":{"id":"4d4cceab-1516-4a6c-a9ab-5de0e32e1fe1","code":"S90","name":"University of Sussex"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Grade 4 (C) or above in English and Maths, or equivalent qualification\n\nWe require candidates to source and undertake GCSE Equivalency tests at their own expense. We can accept equivalency test passes from 'A Star' and 'Equivalency testing.com'","courseLength":"OneYear","feesUK":9250,"feesInternational":14460,"aboutCourse":"Developing the skills needed to intervene creatively with the world around us gives learners the opportunity to apply an iterative approach to designing, making and problem-solving using a range of materials and equipment. As such, it plays a key role in any balanced and creative curriculum. Design Technology teacher education at Sussex focuses on supporting you and developing your skills - as an effective teacher and a reflective learner, as well as how to become a dynamic and creative teacher across the Key Stages. Tutors will support you to explore the subject through the full range of subject specialist areas, including resistant materials, textiles and graphics, control systems, food preparation and nutrition. You will specialise in two of these areas appropriate to your previous experience, subject knowledge and skills and interest..\r\n\r\nOur curriculum studies programme covers both classroom pedagogy and how to effectively and safely guide you in making and modelling products in all materials areas alongside the use of CAD/CAM. Trainee teachers come to us from a variety of design or food and nutrition backgrounds and are encouraged - both at university and on placement - to deliver the curriculum through new materials areas alongside your own specialism. \r\n\r\n\r\nYou will learn to be a Design Technology teacher through a combination of taught sessions at the University and school-led professional development and classroom practice. You will start your course with a 2-3 week induction at the University in September, which is followed by a programme of lectures, seminars and workshops every Friday. These involve presentations, group work, role play, classroom modelling and peer teaching for which you will explore ideas and approaches and reflect on your own experiences.\r\n\r\nYou will undertake two periods of professional practice in two different schools (these may vary slightly in length, but will equate to a minimum of 120 working days in total). You will be supported in your professional placements by a Design Technology specialist who will act as a mentor, offering you tutorial support and developing a programme of practice-based professional studies for you. Your progress will be assessed through observations, feedback and discussion. To this end, you will create and maintain a portfolio of evidence demonstrating how you have met the various Teacher's Standards.\r\n\r\nYou will engage with the theoretical foundations of classroom practice and demonstrate the depth of your professional knowledge by completing two compulsory assignments during the course.\r\n\r\n ","interviewProcess":"Applicants who meet the entry requirements will be invited to a selection event either face to face or online via Zoom. Following a successful interview schools will then invite the candidate for a school interview.\r\n\r\nAs part of the interview process candidates can expect to;\r\n\r\nBefore the selection day \r\n* Listen to a video talk giving further information about the course\r\n* Complete some paperwork including our 'Suitability for Teaching Declaration'. \r\nBoth the above will be sent to you by email in your invitation to interview\r\n\r\nOn the selection day \r\n* Have an individual online interview, via Zoom or face to face with a tutor and an experienced  teacher from a partnership school\r\n* Deliver a short pre-prepared classroom type teaching task or presentation to the panel. You will receive details of the task in your invitation to interview.\r\n* Show the interview panel a form of photo ID on camera or in person for checking\r\n* Have an opportunity to ask the panel questions you may have about the course and your individual circumstances.\r\n\r\nAfter the selection day\r\n* If we offer you a place on the course and you decide to accept we will need you to provide your original Undergraduate Degree, and GCSE Maths and English certificates \r\n\r\nShowing  an awareness of the curriculum and school life is part of the selection process so candidates may wish to prepare themselves by spending some time in an appropriate school setting for the subject/phase they intend to teach beforehand.","howSchoolPlacementsWork":"All routes and phases will complete two professional practices – this is a requirement for the award of QTS. Trainee teachers need a variety of experience in schools to enable them to meet all the Teachers’ Standards. They need to teach children and young people in their specified age range, from different backgrounds, as well as gaining experience of different approaches to teaching and to school organisation and management. \r\n \r\nProfessional Practice 1 is the period of time from the end of September to Christmas During Professional Practice 1, Trainees spend Monday to Thursday in school and Friday at University. \r\n \r\nProfessional Practice 2 is the period of time from January until May half term which includes the second school placement During Professional Practice 2, Trainees attend University on a fewer number of Fridays held at strategic points in the placement. ","personalQualities":"As a partnership we are looking for; \r\n* A passion for DT and interest and involvement beyond your degree\r\n* A strong knowledge and understanding of the study of DT, and a sound awareness of how the subject is taught within UK secondary schools\r\n* Effective communication skills and good organisational skills\r\n* Awareness of current educational developments and issues\r\n* Experience with young people and commitment to developing individuals\r\n* The ability to evaluate practice and address your weaknesses\r\n* Initiative, flexibility and responsiveness to change\r\n* A sense of responsibility and ability to work in a team.\r\n","otherRequirements":"Working with children: You must not be excluded from working with children, as a result of a criminal record or other reason. The Disclosure and Barring Service provides access to records held nationwide through its disclosure service. All trainees must obtain successful DBS clearance before starting an Initial Teacher Education programme.\r\n\r\n* Health requirements: All trainees must be screened for mental and physical fitness to teach by the University's Occupational Health Department before admission to the programme.\r\n","status":1,"createdAt":"2021-07-06T10:49:41.328Z","updatedAt":"2021-09-29T09:30:08.084Z","canSponsorStudentVisa":"yes","cycle":"2024"}
