{"id":"f546f38d-7520-4af1-b6ca-d3c15bba87c7","name":"Design and technology","code":"W115","qualification":"pgce_with_qts","startDate":"2024-05-31T23:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"TA","fundingType":"apprenticeship","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"118fabd7-86d0-4a40-9e9a-e5c302abe59b","code":"DT","name":"Design and technology"}],"locations":[{"id":"1b94207d-ce54-49c4-82d9-ed2724a40c78","name":"Steyning Grammar School","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"d42008b9-26c1-45a8-95c6-fefca8f13512","code":"1KN","name":"BHSSA"},"accreditedBody":{"id":"d2ba71f2-c125-4d86-bb22-736e67043120","code":"B72","name":"University of Brighton"},"profPost":"PG","degreeGrade":"0","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Further information can be found at https://www.equivalencytesting.com/","courseLength":"OneYear","aboutCourse":"You will graduate equipped with the skills and knowledge to become a confident and competent secondary school teacher. Content is kept up to date with changes in local and national initiatives and legislation, so you will be confident that your working knowledge is based on current theory and practice.\r\nThere are four strands to this course:\r\n•\tsubject study/subject education\r\n•\teducation studies\r\n•\tschool-based training\r\n•\tprofessional development\r\n\r\nStudying with us you will benefit from a range of course features which include:\r\n•\taccess to over 30,000 specialist teaching resources in our curriculum centre\r\n•\tenrichment opportunities to teach the 16–18 age phase\r\n•\tlearn from staff who have years of experience as secondary school teachers before joining the university\r\n","interviewProcess":"You will be required to attend two interviews, one at the University and one at the school that you wish to apply for.  \r\n\r\nUniversity interviews will be a mixture of virtual and in person. Candidates will receive confirmation of the interview process at the time of arrangement. \r\n\r\nBelow is an example of  the University and School interview process:\r\n\r\nUniversity Interview \r\nArrival and document check \r\n11.00 – 12.30 Welcome and overview of the programme with opportunity to ask questions.  Writing task. \r\n12.30- 13.25 Lunch Break \r\n13.30 – 16.00 Presentations & individual interviews\r\n\r\nSchool Interview\r\n8.45 Arrival and document check \r\n9.00 - 9.20 Teaching Task to a group of students\r\n9.30-9.50 Interview","howSchoolPlacementsWork":"You will spend a minimum of 120 days on school-based activities, with your training shared between the university and the partner school. \r\n\r\nYour school-based training will include observing teachers, working with individual pupils and groups of pupils, team teaching and independent teaching. Your training will also entail completing specific subject tasks and developing your knowledge of school policy and effective practices.\r\nYou will maintain a professional training portfolio and be supported to review your work critically and analytically as well as to set appropriately challenging targets. We will also develop an action plan with you to identify strengths, development needs and actions, so that your practice is continually developing.\r\n\r\nKey aims of the school-based training:\r\nadvance the development of your professional attributes, skills, knowledge and understanding\r\n\r\nprovide practical and specific experiences that enable you to critically analyse your professional practice and take responsibility for your own professional development\r\n\r\nenable you to work collaboratively with colleagues in order to develop an understanding of the ways in which the attainment, development and well-being of all learners can be achieved with a unified support and teaching system\r\n\r\nprovide opportunities that enable you to adopt a creative and constructively critical approach towards your practice, supported by appropriate reading and research.\r\n\r\nDuring your school-based training, university tutors, school mentors and teachers will support you and take shared responsibility for your professional development.\r\n\r\nYour progress will be observed and assessed throughout your placement by university and school staff, followed by feedback sessions to discuss your development. Your e-portfolio will also be evaluated as part of the overall assessment.\r\n\r\nThrough doing School Direct it allows you to have the choice of school you would like to be based in for your main placement, route you will be able to apply for the school you would like to teach in. ","status":1,"createdAt":"2021-10-12T13:02:13.572Z","updatedAt":"2021-10-13T07:15:58.645Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024"}
