{"id":"9b9f3e96-f8e9-41f8-8561-b0365ef4bd4e","name":"Primary","code":"2SZY","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"B","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"329e224e-d8bf-4a35-b1da-e45a6932d33b","name":"Main Site","isPublished":"N","status":"N","vacancies":"B"}],"trainingProvider":{"id":"5ae9d864-43b2-4d84-8240-2b8b94ddccf7","code":"1CA","name":"Sussex Teacher Training Partnership SCITT RSW"},"accreditedBody":{"id":"b998b5d3-81fe-4510-b505-557f21141349","code":"E37","name":"Sussex Teacher Training Partnership"},"english":"3","maths":"3","science":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":null,"aboutCourse":"A limited number of School Direct Salaried training places are available. These places are only available to candidates who have a long term relationship with a school that has identified their potential and are willing to sponsor them. Without the support of a named school this route is not possible. \r\n\r\nThe Sussex Teacher Training Partnership is led by experienced, practicing teachers, and is tailored towards local training needs.\r\n\r\nTrainees will be based in one school from the consortium – the partnership school. All trainees attend central training on a weekly basis which is held within different partnership schools. \r\n\r\nThe training programme generally lasts for one academic year full-time, running from September to July. The programme provides practical, hands-on teacher training, taught by experienced, practising teachers.\r\n","interviewProcess":"The interview would comprise of:\r\n\r\n* A five-minute presentation on a given topic\r\n* Formal questioning from the interview panel \r\n* An opportunity for the candidate to ask questions\r\n","howSchoolPlacementsWork":"You can train at any suitable partnership school or academy across Sussex, Brighton & Hove and Kent. There are a limited number of places available for school placements in the surrounding areas.\r\n\r\nWe will be based in one school for the majority of the training year. A second placement is offered in two adjacent key stages in two contrasting settings. \r\n\r\nLead partnership training schools currently include:\r\n\r\n* Robsack Wood Primary Academy \r\n* Iford and Kingston Church of England Primary School\r\n* Manor Primary School\r\n* Newick Teaching School \r\n* St Mark’s Teaching School\r\n* The Haven Voluntary Aided C E Methodist Primary School\r\n* Blackthorns Community Primary Academy\r\n\r\n","personalQualities":"It is helpful to gain some classroom-based experience in a primary school before starting your training. For example, this could be as a Teaching Assistant or volunteering in class for a few hours each week. By gaining this experience you will be better prepared to start the programme. Importantly it will inform you whether teaching is the right career choice for you.","otherRequirements":"","status":2,"createdAt":"2021-07-12T13:49:00.889Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024"}
