{"id":"cf50fa21-8ccb-45fa-8363-7c2597834fa4","name":"History","code":"2VBN","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"HE","studyMode":"B","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"5a3609a0-5bbb-4377-b919-5d89932ab622","code":"V1","name":"History"}],"locations":[{"id":"6a2d4d8b-b57b-449a-b763-8a7b0688af40","name":"Main Site","isPublished":"Y","status":"R","vacancies":"B"}],"trainingProvider":{"id":"af388cc3-644a-4fd3-bd71-55503b74fc21","code":"B22","name":"University of Bedfordshire"},"profPost":"PG","degreeGrade":"1","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Please email pgce.admissions@beds.ac.uk for details of equivalencies we accept.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"All courses offer a PGCE with 60 Master's Level Credits with placements across two different schools over the year. Each week of this popular course sees Monday-Thursday being school centred with Fridays in University using the prestigious facilities of the Bedford campus. The innovatively designed course helps prepare you for a successful future as a specialist curriculum teacher in secondary schools in which you will be prepared to attain Chartered Teacher Status in the future.\r\n\r\nIn studying Secondary History, you will be on a course designed to enable you to join a challenging and rewarding profession – becoming an effective and inspiring teacher who draws on broad subject specific knowledge and secure understanding of teaching and learning theories - with the knowledge and skills to lead learning and initiate change in educational settings\r\n\r\n* You will explore your understanding of teaching and learning secondary History, as you apply your subject knowledge and expertise to planning teaching and managing the classroom; honing your skills of critical self-evaluation and improvement\r\n* You will develop your creativity and team-working skills, preparing you to influence and lead in educational settings and enhancing your own sense of independence\r\n* You will gain confidence in analysing the evidence of your own practical experience during placements in schools, informing your future actions as you evaluate the impact of applying theory to your teaching practice\r\n* Finally, you will benefit from a qualification that gives you recommendation for Qualified Teacher Status (QTS), enabling you to gain employment in a school, with opportunities for continuous development through further study at MA/MSc, MPhil, PhD and EdD levels\r\n","interviewProcess":"We are using webinars and video interviews to replace face to face methods during COVID19 - please apply as normal.\r\nThe interview process is a friendly process designed for you to find out about us and for us to learn about why you wish to teach your subject so much. It  will consist of an introductory talk, followed by a an activity about your passion for teaching your subject area and finally a personal interview with a secondary subject tutor from your course.  University lecturers and representatives from partnership schools will conduct the interviews. You should be aware that subject knowledge across Key Stage 3 and Key Stage 4 will be explored at interview to help set you subject knowledge development targets ahead of the start of the course and you should prepare for such questions.","howSchoolPlacementsWork":"Our extensive placements team take care to select appropriate schools for your course. During your course you will spend a minimum of 120 days across two different schools during our 34 week course so that you can develop your teaching skills for Key Stages 2 and 3 and ages 11-16. \r\nYou are based at your placement school Monday - Thursday and act as any teacher would, albeit with a much lighter teaching timetable. The teacher’s day at school varies from school to school, but will include before and after school meetings, extra curricular events, open and parents' evening and other non-timetabled activities. \r\n\r\nOn Fridays, you attend the Bedford Campus of The University of Bedfordshire for taught sessions. \r\n\r\nWe give all our Trainee Teachers a quality placement. To do this we work with schools that are able to support you fully. The University offers teacher education through a partnership with a rich variety of different schools which provide Trainee Teacher placements across a geographically wide region.  \r\n\r\nWe aim to place you in a school inside our partnership area and take into account your journey to your school. For those trainees living outside of our partnership area, we will endeavour to secure a school placement as near to your address as possible but still inside our partnership area. Further details about placements can be obtained upon attendance at interview.\r\n","personalQualities":"If you think you have the aptitude to work with children in the secondary sector, but are concerned your degree does not suitably give you the foundation of knowledge needed, then please do consider applying to us. There may be content in your degree or KS5 qualifications that we can consider or we could recommend you, if your course is eligible, undertake a subject knowledge enhancement course which currently attracts a weekly bursary from the DfE. Contact our admissions team on pgce.admissions@beds.ac.uk if you have any questions. ","otherRequirements":"All suitable applicants will be interviewed and any offer of a place will be subject to receiving DBS (Disclosure and Barring Service) and medical clearance. ","status":1,"createdAt":"2021-07-06T10:50:09.751Z","updatedAt":"2021-07-07T13:35:00.646Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
