{"id":"7ae4662f-c49f-44fe-98b8-fe3e58bedd71","name":"Mathematics","code":"279J","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"72345aa7-096c-488f-8649-085b8178cadb","code":"G1","name":"Mathematics"}],"locations":[{"id":"d8d09fb2-6e67-4a5d-b5dc-ca8a1ac94e98","name":"UCNL","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"49325b10-be5d-42e6-b727-2e28a3230137","code":"N66","name":"North Lincolnshire SCITT Partnership"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feeDetails":"The course fees are fully inclusive of the award of PGCE with QTS.","financialSupport":"Not applicable.","aboutCourse":"The course offered by North Lincolnshire SCITT Partnership follows the key principle of extensive training in the school environment, exposing trainees immediately to cutting edge practical delivery, in good and outstanding schools, with central training providing the necessary rigour of a theoretical framework. \r\n\r\nCommencing on Day One of the academic year, 4 days are spent each week throughout the year in school with the remaining day following the core training programme.  Additionally, an Enrichment Programme provides opportunities for trainees to visit other leading schools in the area to observe best practice.\r\n\r\nThe centrally delivered training programme focuses on the key principles and fundamentals of teaching and learning pedagogy, curriculum and subject knowledge development, theories of learning which underpin practical application, research and reflective practice.\r\n\r\nSessions take place in Scunthorpe, where trainees meet to train, network and access additional high-quality support.  Facilitators include a rich blend of highly experienced teachers, SLEs, LA Advisory staff, external consultants / experts, bringing a rich blend of expertise and experience from across a spectrum of disciplines.  As a programme delivery model, this was noted by Ofsted as a strength. \r\n\r\nIn-school training is provided through the use of school based trainers and teacher colleagues in hosting schools.  Throughout the year, a series of assessed gap tasks are set that link the theoretical sessions to practical application in the classroom.  \r\n\r\nAcademic support for the PGCE is provided by our HEi partner, BGU, and is led by tutors both on University Campus and at the central training venue.   Trainees receive support to complete two 5000 word assignments leading to the award, which gives 60 credits at Masters level.\r\n\r\nA detailed handbook, with clearly identified in-school training requirements, link to the various central training foci ensuring that trainees are able to put into practice what they have learnt in theory. This approach provides the necessary assurances needed to evidence that all trainees access the programme equality and to the same high-quality, though with personalised targets and in-built flexibility to meet their individual needs and starting points.\r\n\r\nThe on-going continuous assessment process uses both formal and informal methodology including observation, review and self-reflection.  A key feature of the process is the depth of paired assessment by both placement schools and partnership tutors which moderate and quality assure judgements made about trainees.\r\n","interviewProcess":"Shortlisting is undertaken by the core SCITT team and school leaders from partnership schools, using a clear set of agreed criteria based on applicants’ qualifications, level of subject knowledge, reasons for wanting to teach, and any relevant work or voluntary experiences they may have had. Whilst school based experience would strengthen an applicant’s case for wanting to teach, it is not an essential requirement. \r\n\r\nOnce shortlisted, candidates are invited to an Assessment Day in a school, involving different activities designed to assess their potential and suitability to teach.   The panel of 3 – 4 head teachers and SCITT Team members make the final decision about offers to train.  Information gathered is used to personalise successful candidates’ training plans. \r\n\r\nAssessment entails a number of tasks including: a reading/ writing task, presentation of a lesson plan, presentation of an artefact, a teaching activity in the specialist subject and a formal interview.  \r\n\r\nThis breadth of assessment activity across the day enables candidates to demonstrate their understanding of basic teaching and learning pedagogy and level of curriculum/subject knowledge and their appreciation of the wider life of the teacher, roles and responsibilities.  Whilst being a rigorous process, the design of the various tasks enables the candidate to demonstrate their potential and suitability, not only to teach, but also to show that they are ready for the particular demands relating to the school-centred training approach.  ","howSchoolPlacementsWork":"Partner schools, where placements take place, provide a good variety of training possibilities ranging from large schools and academies located in urban environments to small community and Church schools in rural villages, and include schools with culturally rich and diverse communities, enabling applicants to experience teaching in contrasting contexts.  There are usually 25 schools within the partnership in any given training year.\r\n\r\nConsultation takes place with schools to determine their capacity to train and confirm the age ranges they can offer.  Applicants’ personal pen portraits are sent out in a booklet for participating schools to state any preferences they might have.  A panel of Head Teachers meet to match the applicants to schools based on school preferences and taking into account any personal circumstance that the applicants may have been asked to have been taken into consideration.  All requests are considered and every effort is made to match these varying needs up, whilst ensuring that placements are in contrasting schools and meet the requirement of consecutive age groups.  \r\n\r\nThe vast majority of placements are within the local authority resulting in the maximum distance to be travelled by trainee teachers being 25 miles, though the average distance is 8 miles.\r\n\r\nTraining takes place in two contrasting schools with an initial placement in the first term, (September – December, 47 days), and the main placement over two terms, (January – June, 73 days), spent in the second location.  In both placements, trainees spend the equivalent of 4 days in their host schools where they learn ‘on the job’, tapping into the expertise around them.\r\n\r\nThe benefit of two long placements is the opportunity for trainees to establish themselves as team members so they can fully immerse themselves in the wider life of the school.  \r\n\r\nAppropriately experienced teachers at each of the training schools are identified as school based trainers (SBT) to support the trainees throughout their placements.  The programme identifies specific time frames when paired support and assessments take place, ensuring a smooth transition from one school to the next.  ","personalQualities":"Applications from people who have:\r\n\r\n-\tDrive, passion and a strong desire to influence the lives of children and young people and want to help make the most of their potential;\r\n-\tGood to strong subject knowledge;\r\n-\tResilience and a committed approach and excellent work ethic to undertake the rigour of training in schools;\r\n-\tAbility to reflect and take responsibility for their own learning;\r\n-\tWillingness to learn and be open to coaching and mentoring;\r\n-\tAbility to work collaboratively as part of the team;\r\n-\tStrong sense of professionalism and a realistic view of the teaching profession;\r\n","otherRequirements":"Applicants would need to complete a suitability to teach self-declaration, complete a DBS check at (enhanced level) and submit a health screening questionnaire. \r\n\r\nWhilst not an essential requirement, it is desirable that applicants have had some recent, focused and relevant school based experience as this will help to strengthen their evidence of wanting to become a teacher and help to prepare them for the rigours of this particular route into teaching.","status":1,"createdAt":"2021-07-06T10:55:24.185Z","updatedAt":"2021-07-09T10:54:53.560Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
