{"id":"51a099d1-c6f3-41fa-8f68-87374e707863","name":"Primary","code":"32PX","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"9ead927b-8770-489f-a68d-1a46f68fc23e","name":"Main Site","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"51404eba-d28e-4e15-8035-db8bf367b1bd","code":"12U","name":"Mounts Bay"},"accreditedBody":{"id":"0f3abdaf-7b36-422e-a700-046f8a641c60","code":"C79","name":"Cornwall School Centred Initial Teacher Training. (Cornwall SCITT)"},"profPost":"BO","degreeGrade":"1","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"We run our course in partnership with Cornwall SCITT. You can access information about the course structure from their website. \r\n\r\nOur trainees follow the same course structure as they do. It gives an overview of the training year, how trainees are assessed, the PGCE expectations and much more. The course base is in Heartlands, Pool and non-school based days are held there. \r\n\r\nCornwall SCITT\r\n(https://www.cornwallscitt.org/)\r\n\r\n","interviewProcess":"We have an interview process which we agree with our ITT Provider. We always have a formal interview with a Panel. We try where possible to include a short teaching episode in one of our partner schools for Primary candidates. We include a tour at this time so you can see how school life is in practice. We hold interviews in a local partner school.","howSchoolPlacementsWork":" The website link for scitt also details the placement info.\r\n\r\nThere are very good transport links to and from the town and many people also car-share. Trainees quite often rent rooms or airbnb during the placements. We are 11-16. \r\n\r\nPrimary - we work with local schools to provide placements and also Cornwall SCITT so that you are in a school which ties in with your placement preferences e.g. you may want to focus on EYFS or KS2. Generally placements cover at least 2 Key Stages. You have 3 placements in 2 schools, perhaps 3. You will likely experience a small school with mixed year groups and also larger schools to give you a good spread of experiences. \r\n\r\nWe work with Cornwall SCITT to choose a suitable placement schools. \r\n\r\n\r\n\r\n","status":1,"createdAt":"2021-07-06T10:52:16.773Z","updatedAt":"2021-09-20T10:02:01.870Z","canSponsorStudentVisa":"no","cycle":"2024"}
