{"id":"dea132fb-ba2a-4ac1-8537-117e8bf7a68c","name":"Mathematics","code":"24S7","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"72345aa7-096c-488f-8649-085b8178cadb","code":"G1","name":"Mathematics"}],"locations":[{"id":"9ead927b-8770-489f-a68d-1a46f68fc23e","name":"Main Site","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"51404eba-d28e-4e15-8035-db8bf367b1bd","code":"12U","name":"Mounts Bay"},"accreditedBody":{"id":"0f3abdaf-7b36-422e-a700-046f8a641c60","code":"C79","name":"Cornwall School Centred Initial Teacher Training. (Cornwall SCITT)"},"profPost":"BO","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"The relevance of degree subjects to the course your wish to study will be taken into consideration at application stage.","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"We run our course in partnership with Cornwall SCITT. You can access information about the course structure from their website. Our trainees follow the same course structure as they do. It gives an overview of the training year, how trainees are assessed, the PGCE expectations and much more. For each Secondary subject there are subject based training days with a specialist teacher. This is usually based in a school. \r\n\r\nCornwall SCITT\r\n(https://www.cornwallscitt.org/)\r\n\r\n ","interviewProcess":"We have an interview process which we agree with our ITT Provider. We always have a formal interview with a Panel. We try where possible to include a short teaching episode in one of our partner schools. We include a tour at this time so you can see how school life is in practice. ","howSchoolPlacementsWork":"Secondary - we use Mounts Bay Academy as the main placement school - based in Penzance. The website link for scitt also details the placement info.\r\n\r\nThere are very good transport links to and from the town and many people also car-share. Trainees quite often rent rooms or airbnb during the placements. We are 11-16. \r\n\r\nWe provide our Secondary trainees with a Macbook and an iPad as this is an essential part of our teaching and learning. We work with Cornwall SCITT to choose a suitable second placement school. \r\n\r\n\r\n","status":1,"createdAt":"2021-07-06T10:52:16.507Z","updatedAt":"2021-09-20T09:57:53.903Z","canSponsorStudentVisa":"no","cycle":"2024"}
