{"id":"00039830-798f-4133-a3c7-8776ec351793","name":"Primary","code":"Y345","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"50aa858f-a748-4e0f-a2a0-4a6261f48035","name":"St Matthew's CE Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"0303e602-3143-4f32-9fe6-6a578cf5a04d","name":"Bosley St Mary's CE Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"bc09a8a6-86a2-47d8-ac68-f101f85276c7","name":"Moreton Christ Church CE Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"64c1f5e6-fba1-438a-9c88-32e7e1c62ac2","name":"Brereton CE Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"66921b99-7a44-4b91-b71f-5c9f143aa083","name":"St George's CE Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"69922cc5-2aae-4b1a-8431-e1b3a610f505","name":"Church House","isPublished":"Y","status":"R","vacancies":"F"},{"id":"c7596b29-75ad-4471-bb2b-3c5f921daab1","name":"Wybunbury Delves CE Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"b2b0ac90-5a6b-4495-b9ea-71400229daf9","name":"Utkinton St Paul's CE Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"713409ec-9a6f-4530-830a-47f91c907c0e","name":"Astbury St Mary's CE Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"a29cda81-1684-4467-b5db-2d101d8b7012","name":"Little Bollington CE Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"18e26b75-f406-411b-ba49-0c01c0fc7214","name":"Bredbury St Mark's CE Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"c246716a-da97-4799-bb21-c4142ac0c3f3","name":"St Paul's CE Primary School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"ba982f15-581b-43c8-a188-08b0480bd19d","code":"3C5","name":"Chester Diocesan Academies Trust"},"accreditedBody":{"id":"85451f1d-964e-4f76-903b-884d31a63bec","code":"1X8","name":"Mersey Boroughs ITT Partnership"},"profPost":"PG","degreeGrade":"9","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We are happy to accept equivalency tests where candidates do not hold the requisite GCSE qualifications, but expect that these equivalency tests will be completed with a recognised provider (e.g. Maths Made Easy). If you are unsure of the validity of an equivalency test, please get in touch.","courseLength":"OneYear","feesUK":9000,"aboutCourse":"We believe that the School Direct programme run by Chester Diocesan Academies Trust (CDAT) provides a high-quality and distinctive route to becoming a primary school teacher. Over a school year, trainees spend the vast majority of their time in school, learning from highly-effective and enthusiastic current practitioners. This is supplemented with a comprehensive training programme, again delivered by successful serving practitioners and enhanced with input (at Masters level) from our university partner. At the end of the programme, trainees leave with both QTS and a PGCE.\r\n\r\nCDAT is a successful, growing multi-academy trust stretching across the Diocese of Chester - with schools in Cheshire East and West, Tameside, Stockport and the Wirral. Our schools provide varied training opportunities – from larger schools with 350+ pupils to smaller ones with fewer than 50, and from diverse, urban areas to village and rural locations. It is this great variety that gives CDAT’s School Direct programme a special flavour. While all of the schools in the trust itself are Church of England primary schools – another distinctive feature of our programme – CDAT works more broadly with other faith and community schools and specialist providers.\r\n\r\nWe promise to provide:\r\n\r\n* Placements in schools that offer strong mentoring and support.\r\n* High quality training delivered by expert current classroom practitioners.\r\n* Quality Masters-level input from our university partner.\r\n* Top quality support from experienced tutors and the programme team.\r\n\r\nMersey Boroughs ITT Partnership are CDAT’s partner provider and the awarding body for QTS at the end of the programme. Mersey Boroughs is a well-established and respected School Centred provider of Initial Teacher Training (SCITT) rated as ‘good’ by Ofsted. \r\n\r\nThe partnership between CDAT and Mersey Boroughs brings all of Mersey Boroughs’ knowledge and experience into the Diocese of Chester. Their most recent Ofsted inspection graded Mersey Boroughs’ provision as good, and highlighted that ‘Trainees and NQTs have highly appropriate professional attributes, are committed to teaching, very positive about their training and support and respond extremely well to advice and guidance’ and also noted that ‘High quality centre-based training equips trainees and NQTs extremely well with the subject and curriculum knowledge and practical skills required to be successful teachers.’\r\n","interviewProcess":"We are looking for people with the ambition, enthusiasm and resilience to be successful on our ITT programme and to become outstanding teachers for the future.\r\n\r\nInterviews are co-ordinated by CDAT and held at different schools across the trust.\r\n\r\nWe aim to offer a relaxed, fully inclusive interview process and as such there is no requirement to plan for or teach during our one- day interviews. Applicants who are shortlisted from their initial application will be invited to spend a day in one of our schools. During this day they will undertake a three part selection process: \r\n\r\n* Candidates will spend the morning in a class acting in the role of a teaching assistant, following which the class teacher will provide feedback on the candidate’s interaction with children and adults, knowledge, use of standard English and aptitude. \r\n* Candidates will then complete a written reflection on their morning, which will be used to assess their ability to reflect and learn from experience as well as their use of standard written English.\r\n* Finally, candidates will then have a formal interview, as part of which they will give a short presentation linked to a teaching resource of their choice.\r\n\r\nSelection panels are made up of staff and/or tutors from CDAT schools and the Mersey Boroughs team.\r\n\r\nWe are happy to accommodate any adjustments that may be required to assist candidates on the day but ask that they are relayed to us in advance.\r\n","howSchoolPlacementsWork":"Trainees on the CDAT School Direct programme will typically spend their time training and working in schools that are part of the multi-academy trust – which stretches from the Wirral across to the foothills of the Pennines and down to the edge of the Potteries - or which work in close partnership with the trust.\r\n\r\nWith their professional training needs in mind, our trainees complete significant placements in two contrasting primary schools, carefully selected by the leadership team from within the established partnership . Trainees are assigned a ‘home school’ where they are based during the autumn term. The first half term blends time in school with a taught programme delivered by excellent current practitioners, building up to a first teaching ‘block’ leading up to Christmas.\r\n\r\nTrainees then move on to their second school in the spring term, again combining time in school with taught sessions but also benefiting from a series of ‘broadening experience’ activities. Trainees complete a second substantial teaching ‘block’ in their second school.\r\n\r\nThe summer term is spent back in the ‘home school’ where trainees are able to put all of the skills and knowledge that they’ve developed together in delivering their final ‘block’ of teaching.\r\n\r\nOur training programme is delivered in a range of venues across the trust, with the vast majority of sessions being delivered in school settings. We feel our programme is interesting and varied, providing trainees with excellent preparation for a career in teaching, so they can become outstanding teachers in their own right. It is also rigorous, because teaching is a highly demanding, but highly rewarding job – and we believe that our children deserve to have the best prepared teachers possible. \r\n","personalQualities":"Brilliant primary school teachers have a wide and varied set of skills and attributes. Don't panic if you don't think you have all of these qualities (yet), but we are definitely looking for people who:\r\n\r\n* Are good communicators \r\n* Work well in a team\r\n* Have good knowledge of a range of subjects\r\n* Are organised \r\n* Are reflective\r\n* Are flexible – because no two days in school are the same\r\n* Are resilient – because teaching can be tough\r\n* Have high expectations\r\n* Want the best for all of the children they work with\r\n","otherRequirements":"Relevant work experience (e.g. in a school ) is not a set requirement of the programme but applicants may find such experience valuable.\r\n\r\nBefore starting on the programme, applicants will need to have obtained a Health check Statement* and Enhanced Disclosure from the Disclosure and Barring Service*. Offers will be conditional subject to these being in place prior to the programme start date. (*The provider will administer and cover the costs of these requirements.)\r\n","status":1,"createdAt":"2021-07-09T15:26:12.215Z","updatedAt":"2021-08-10T09:38:53.921Z","canSponsorStudentVisa":"no","cycle":"2024"}
