{"id":"522bf34e-a444-4724-a337-c141cd3da63c","name":"Mathematics","code":"38PM","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"72345aa7-096c-488f-8649-085b8178cadb","code":"G1","name":"Mathematics"}],"locations":[{"id":"f2c0ef7b-2460-4f5e-9c48-a421274741b1","name":"Sacred Heart","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"0b306029-1059-4a4a-950a-4e45c3a2a531","code":"21L","name":"Blue Sky"},"accreditedBody":{"id":"4aa8177a-27b8-4566-b77a-c45515e46739","code":"N36","name":"Newman University"},"profPost":"BO","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Our School Direct courses are all year-long programmes and successful trainees will end their year with Qualified Teacher Status and a PGCE. All trainees will attend lectures at Newman University, on average once per week. A university mentor will be named to support you and observe lessons. The remainder of the week will be spent in a ‘home’ school in Coventry or the surrounding area. You will be a full-time member of staff within the school, only missing days to attend university. In school you will have an allocated mentor who will offer support as you develop your skills in teaching and learning. You will spend the majority of your year in your home school but you will have a short placement at a different school for your supplementary school experience halfway through the year. Following this, you will return to your home school until the end of the academic year. \r\n\r\nFor 2021 the secondary courses we are running will be English, Maths, Chemistry, Physics and Biology. These courses are all ‘training’ places, meaning trainees will not receive a salary during the year. You will, however, be eligible to apply for any bursary applicable to your subject. For primary trainees, we are offering both salaried and training places for 2021. Salaried trainees are paid as unqualified teachers for the training year. Please check the primary course code carefully before you apply.\r\nNewman University essay expectations vary depending on the course but all trainees will be well supported to ensure the academic aspects of the training year can be achieved as smoothly as possible. Whilst in school, trainees will be immersed in the daily life of a teacher, supported by experienced colleagues. You will benefit from the professional development opportunities provided by your school in addition to what is provided by your university time. Assessments are in the form of essays and shorter tasks interspersed throughout the year. \r\n","interviewProcess":"Interviews will be conducted by representatives from the schools seeking to appoint a trainee, along with representatives from Newman University and Blue Sky Teaching School Alliance. Your interview will consist of a short lesson observation, a formal interview and short written tests in Maths and English. You will only attend on one occasion and you will receive an outcome shortly after the interview day. ","howSchoolPlacementsWork":"Our school placements are all in Coventry or the surrounding area. The role of Blue Sky Teaching School Alliance is to match trainees to schools so that, as far as we possibly can, travel distance doesn’t prevent trainees applying to train with us. Trainees will have two placements in total during the year, with the majority of the year in the home school and a short supplementary placement during the Spring term. \r\nAll primary course candidates will end the course qualified to teach between the ages of 5 and 11. School placements will either be in Key Stage 1 or Key Stage 2. We do not offer an Early Years qualification. Secondary candidates will teach between the ages of 11 and 16. \r\nAll candidates will be allocated a school at the interview process which will be where you spend the majority of the year. A supplementary 5 – 6 week placement in another school will be organised for you during the Spring term. You will be in school every day, with the only exception being the days you are timetabled to attend lectures at Newman University. All courses are full-time commitments and you would be a member of the teaching team whenever you are in school.  \r\n","personalQualities":"","otherRequirements":"Candidates will be subject to a criminal record check as a condition of any offer.","status":2,"createdAt":"2021-07-06T10:53:25.104Z","canSponsorStudentVisa":"no","cycle":"2024"}
