{"id":"576d7346-7e9b-41a8-92ec-631f469a3a64","name":"Primary","code":"2SRH","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"f2c0ef7b-2460-4f5e-9c48-a421274741b1","name":"Sacred Heart","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"0b306029-1059-4a4a-950a-4e45c3a2a531","code":"21L","name":"Blue Sky"},"accreditedBody":{"id":"4aa8177a-27b8-4566-b77a-c45515e46739","code":"N36","name":"Newman University"},"profPost":"BO","degreeGrade":"9","english":"1","maths":"1","science":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"Candidates will need to arrange for their own equivalency tests. Equivalency tests may be limited to one or two subjects only. Please check before making an application.","courseLength":"OneYear","aboutCourse":"2SRH is a salaried primary School Direct course. Salaried trainees are paid as unqualified teachers for the training year. We will only consider candidates for a salaried place interview if they have a minimum of three year's experience of paid employment in education, or in another industry but can demonstrate transferrable skills to education.\r\n\r\nOur School Direct courses are all year-long programmes and successful trainees will end their year with Qualified Teacher Status and a PGCE. \r\n\r\nAll trainees will attend lectures at Newman University, Birmingham. A university mentor will be named to support you and observe lessons. The remainder of the week will be spent in a ‘home’ school in Coventry or the surrounding area. You will be a full-time member of staff within the school, only missing days to attend university. In school you will have an allocated mentor who will offer support as you develop your skills in teaching and learning. \r\n\r\nYou will spend the majority of your year in your home school but you will have a short placement at a different school for your supplementary school experience halfway through the year. Following this, you will return to your home school until the end of the academic year. \r\n\r\nWhilst in school, trainees will be immersed in the daily life of a teacher, supported by experienced colleagues. You will benefit from the professional development opportunities provided by your school in addition to what is provided by your university time. Assessments are in the form of essays and shorter tasks interspersed throughout the year. ","interviewProcess":"Interviews will be conducted by representatives from the schools seeking to appoint a trainee, along with representatives from Newman University and Blue Sky . Your interview will consist of a short lesson observation and a formal interview. You will only attend on one occasion and you will receive an outcome shortly after the interview day. ","howSchoolPlacementsWork":"Our school placements are all in Coventry or the surrounding area. The role of Blue Sky  is to match trainees to schools so that, as far as we possibly can, travel distance doesn’t prevent trainees applying to train with us. Trainees will have two placements in total during the year, with the majority of the year in the home school and a short supplementary placement during the Autumn or Spring term. \r\n\r\nAll primary course candidates will end the course qualified to teach between the ages of 5 and 11. School placements will either be in Key Stage 1 or Key Stage 2. We do not offer an Early Years qualification. \r\n\r\nAll candidates will be allocated a school at the interview process which will be where you spend the majority of the year. A supplementary 5 – 6 week placement in another school will be organised for you during the Autumn or Spring term. You will be in school every day, with the only exception being the days you are timetabled to attend lectures at Newman University. All courses are full-time commitments and you would be a member of the teaching team whenever you are in school.  ","personalQualities":"We use our application and interview process to search for the potential in people. Experience is necessary for salaried positions. A passion and drive to guide children to achieve their full potential is essential, as are excellent communication skills. The Schools Direct process is full and fast paced therefore a hardworking, determined attitude is also highly sought after.","otherRequirements":"Candidates will be subject to the criminal record and other checks required to work with children. \r\nSchool Direct (salaried) is an employment-based route for high quality graduates, typically with at least three years' experience of transferable work history. You'll earn a salary while you train towards your Qualified Teacher Status (QTS) recommendation, and won't need to pay any tuition fees.","status":1,"createdAt":"2021-07-06T10:53:25.036Z","updatedAt":"2022-01-18T10:27:22.977Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"Unqualified teacher salary scale. Fees for this course are approximately £5,100 (tbc for 2022)."}
