{"id":"ed100660-3a49-4258-84d1-c09aa640e535","name":"Primary","code":"2YW5","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"43109f93-91dd-4df5-9fc8-868cec4e4f1e","name":"Belsay Primary School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"2016568e-1ca5-4260-81f7-b86d41c79d41","code":"16S","name":"The Wider Ponteland Partnership"},"accreditedBody":{"id":"b384b008-59e2-461e-a15f-3551d1165c1e","code":"N77","name":"University of Northumbria at Newcastle"},"profPost":"PG","degreeGrade":"0","english":"1","maths":"1","science":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"If your qualifications are from overseas, they must be checked for UK equivalence by NARIC.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Why train in the Wider Ponteland Partnership?\r\n\r\nDuring the course, you will spend 4 days per week in a school being trained by experienced teachers. The remaining day is spent either at a school within the partnership or Northumbria University. These training days will cover every aspect of teaching, including, for example, behaviour management, Special Educational Needs and Disabilities (SEND); planning and collaboration skills;  along with bespoke training depending upon your individual needs. \r\n\r\nYou will spend most of the time in your host school with one shorter period in another partnership school during an assessed placement. There are three assessed placements across the year.\r\n\r\nAlong with school-based training, there will be assignments set by Northumbria University. These will be supported with taught sessions at the campus and a personal tutor. Finally, there will be a portfolio of evidence to present to demonstrate your achievements against the teaching standards. \r\n\r\nSchools within the partnership are listed on the [Ponteland Primary School website](http://www.pontelandprimary.co.uk) and are within the South Northumberland area.\r\n\r\nSchool Direct at Ponteland Primary is successful at supporting trainees into employment, with a majority of students going straight into teaching positions following the course, sometimes within the partnership itself.\r\n\r\nPastoral care and outstanding mentoring are strong features of the partnership. Students' wellbeing is paramount and our cohorts always work well together due to pre-course induction days and the opportunity to work collaboratively during the year.","interviewProcess":"Ponteland Primary coordinates the recruitment process on behalf of the partnership.\r\n\r\nFollowing a short-listing process using your application form, successful applicants will be invited for an interview.\r\n\r\nThe interview session will involve a session spent at one of the schools. Each candidate will be expected to deliver a reading activity to a small group of pupils from within the primary phase. \r\n\r\nThere will also be the opportunity to talk to some staff, meet the headteacher and lead mentor and participate in a group discussion with any other candidates during the morning. \r\n\r\nThere may be a representative from our partner, Northumbria University at each of the interview days which will take place in clusters of 3 or 4 schools within the partnership.\r\n\r\nBefore the 'formal' interview, there will be a brief activity using books as a stimulus, which will then be discussed in the interview. The interviews will take place on the same day and will include questions on experiences and suitability for the course.","howSchoolPlacementsWork":"You will spend most of the time in your host school with one 6 week period in another partnership school during a shorter assessed placement. \r\n\r\nThe 6-week placement will take place during the second half of the autumn term, finishing before the Christmas break.\r\n\r\nFrom January you will remain in your host school, completing a long placement, split into two with a short break in between them. ","personalQualities":"This is a difficult and demanding year!\r\n\r\nWe are looking for applicants who have the potential to become outstanding teachers, display resilience and are able to work independently on their studies while training in a school context. \r\n\r\nThese personal attributes include:\r\n* Subject knowledge\r\n* Motivation to become the best teacher possible.\r\n* Ability to analyse and learn from experience, and to act on feedback.\r\n* Creativity and imagination.\r\n* Capacity for hard work.\r\n* Perseverance.\r\n* Good organisational skills.\r\n* Empathy and a liking for young people.\r\n* Ambition to make a difference by becoming an inspirational teacher.","otherRequirements":"All offers of places are subject to a Disclosure and Barring Service (DBS) enhanced disclosure with a list check. If you are offered a place, you will be asked to provide a signed declaration relating to any police record.\r\n\r\nAll trainee teachers must also meet the Secretary of State’s requirements for physical and mental health. (In practice, few health problems preclude applicants from teaching, and so we welcome applications from people with disabilities.)","status":1,"createdAt":"2021-07-06T10:55:02.578Z","updatedAt":"2021-08-27T09:43:46.879Z","canSponsorStudentVisa":"yes","cycle":"2024"}
