{"id":"3007e427-4f2d-405c-bd0e-3eff242159bf","name":"English","code":"QXXX","qualification":"pgce_with_qts","startDate":"2022-09-01T09:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3aed1aa8-ae46-4b68-92bb-a6cc20655c59","code":"Q3","name":"English"},{"id":"bf97cd0a-224c-43d3-a021-84143df13e8d","code":"F3","name":"Physics"}],"locations":[{"id":"5cd73f11-8281-4085-8e16-0b18871ea1a5","name":"Main site","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"15f6d676-eb1b-43c9-aade-bf948d72603d","name":"Tarleton Academy","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"0d266e41-4c8c-4872-8589-9dc240ae3758","name":"Main site","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"e035bc9a-5fd6-4a15-9649-b3341b05359b","name":"Doncaster ITT Partnership","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"a0e16953-2b65-46d7-ad3e-739067677752","name":"The Royal Latin School","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"8ca27381-628b-4b12-86d8-8929855fb246","name":"Harlow","isPublished":"true","status":"running","vacancies":"none"},{"id":"c9ee5046-3f49-4804-991b-e99bbe8b2247","name":"Main Site","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"235467b2-657d-43ac-b4d1-bb52d8896608","name":"Main Site","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"c6eceebd-4ffb-4a80-af98-98d4f37db91f","name":"Main site","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"47d5d27a-6c49-4990-8071-bdb64f842c90","name":"Main Site","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"2b9c95f9-1a0c-405e-b651-1e7a25ee1814","name":"Inspire 2 Learn","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"6d1fd773-21a5-4017-8517-6290bc5c4680","name":"Crispin School","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"c56a7a63-a570-4ae8-9c73-4c6d2fbc7c06","name":"Main Site","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"f9959a6b-2a1f-47b1-943d-f18334d0aff8","name":"Basildon","isPublished":"true","status":"running","vacancies":"none"},{"id":"4dd8b102-6b22-40b8-af27-c41de872855e","name":"Chelmsford","isPublished":"true","status":"running","vacancies":"none"}],"trainingProvider":{"id":"6f88bf38-6cc5-4473-9619-496b9842af7b","code":"R16","name":"Redcar and Cleveland Teacher Training Partnership"},"profPost":"BO","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"Applications with a 3rd Class degrees may be accepted and will be considered on a case-by-case basis","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We are now in a position where we can offer GCSE equivalency tests however this may incur a cost which must be covered by the applicant- please contact us for more information","courseLength":"OneYear","feesUK":9250,"feesInternational":9250,"aboutCourse":"Teachers training teachers to change children’s lives…\r\n\r\nSchool-based training provides the greatest opportunity to spend time in the classroom, learning from current practising teachers and seeing exactly how they teach. You will find out how these experts are able to change children’s lives through their role and develop the skills required to start doing so yourself. \r\n\r\nOur course provides holistic training, covering the areas you need to feel completely prepared to enter your NQT classroom. You will cover keys stages 2 to 5 and have an in-depth knowledge of how the practices develop through these age ranges. You will complete 5 placements and spend 186 days training to become an effective and impactful teacher. During this time, you will earn both your QTS (Qualified Teaching Status) and PGCE (Post Graduate Certificate in Education) and develop your knowledge of how academic theory underpins your classroom practice. The course is tailored to your needs and you begin teaching when you are ready. This bespoke approach allows you the time required to embed the theory learned into your practice and explore how an effective teacher utilises cognitive science, pedagogical teaching strategies and experience to refine their teaching.\r\n\r\nAs a school-based provider, you are working with practising teachers modelling the latest effective teaching practices. You are supported, every step of the way. In school, you will be working with your Subject Mentor and ITT Coordinator, who ensure you have the exposure required to gain a broad understanding of your craft. Within the SCITT, you are supported by the Management Team and Lead Mentors, who will happily invite you to watch them teaching and can share their experiences. A key feature of our course is the Lead Subject Tutor (LST) role. These are experts within your subject, who work with you to build upon the introductory theory and deliver an advanced session, really focusing your training on what excellence means, within your subject. In addition to these features, you will also become a full member of the University of Leicester and have access to the full support of this establishment.\r\nOur Core Learning Programme is delivered by current practising teachers who are experts in their field. The sessions will be delivered in the school that exemplifies this practice, meaning that you experience a range of environments, ultimately shaping you into a powerful, impactful and effective teacher.\r\n\r\nTeachers training teachers to change children’s lives… \r\n","howSchoolPlacementsWork":"You complete 5 placements across the year, providing a broad overview of teaching in Primary, Secondary, Sixth Form and Special Educational Needs schools. Each one is tailored to meet your needs and you begin teaching when you are ready. Initially, you observe a range of teachers and identify how they deliver effective lessons to a diverse range of students. Following this, you will begin completing some group work and deliver some starters and plenaries. When you are ready, you begin team-teaching or delivering your lessons. The build-up is gradual with you teaching 7 lessons by Christmas. By the end of the course, you are delivering 12 lessons. As the course is school-based, you spend much longer in the classroom and develop at a pace that suits you. Our Lead Mentors are also on hand to provide additional support, to help you develop into the teacher you aspire to be.\r\n\r\nThe theory is drip-fed, throughout the year, with you spending 4 days in schools and 1-day learning academic theory. This allows you time to apply and embed your learning before moving on. Your subject mentor will guide and support you, as you try new ideas and see what teaching strategies work for both you and your classes. The breadth of placements provides you the opportunities, skills and experience required to become an effective practitioner who changes children’s lives.\r\n","status":1,"createdAt":"2021-07-06T10:54:07.675Z","updatedAt":"2021-09-13T08:10:00.905Z"}