{"id":"b31edd2d-42d2-4894-ac49-4c60825e83ef","name":"Geography","code":"2SF6","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3f47e67b-7fa5-4947-a5a0-74d528cd2a87","code":"F8","name":"Geography"}],"locations":[{"id":"2b9c95f9-1a0c-405e-b651-1e7a25ee1814","name":"Inspire 2 Learn","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"6f88bf38-6cc5-4473-9619-496b9842af7b","code":"R16","name":"Redcar and Cleveland Teacher Training Partnership"},"profPost":"BO","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"Applications with a 3rd Class degrees may be accepted and will be considered on a case-by-case basis","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We are now in a position where we can offer GCSE equivalency tests however this will incur a cost which must be covered by the applicant- please contact us for more information.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Redcar and Cleveland Teacher Training Partnership (RCTTP) is fully accredited initial teacher training provider. We were graded  as Outstanding in all judgement areas following our Ofsted Inspection of 2015/16.\r\n\r\nThe SCITT programme is a full-time, one year course leading to the award of Qualified Teacher Status (QTS). We also work with the University of Hull to offer the opportunity to study for a Postgraduate Certificate in Education (PGCE) . This consists of a distance learning programme of assignments, training sessions and tutorials all of which take place at our training centre - students do not need to travel to Hull.\r\n\r\nWeekly central training takes the form of ‘taught’ sessions that are delivered by experienced, expert practitioners. The sessions are grounded in theory and also provide practical strategies and techniques that can then be applied to classroom practice. Central training also provides an opportunity for trainees to share and reflect on their school experience.\r\n\r\nSchool training is individualised to meet each trainee’s needs and will include a variety of activities including focused lesson observations of colleagues, weekly tutorials with Mentors, attendance at school-based training activities, team planning and teaching, focused meetings with school specialists, colleague and pupil shadowing and undertaking research into a school based issue.\r\n\r\nAll trainees must demonstrate that they have fully met each of the Teachers’ Standards by the end of the course. Assessment against the Teachers’ Standards is continual and is carried out through graded lesson observations, termly reviews of practice, formal assignments and Partnership Tutor visits. \r\n","interviewProcess":"Course Leaders and colleagues from Partnership Schools will look at application forms and decide who will be invited for task/interview day. It is therefore important that application forms contain all the relevant information and that particular attention is paid to the personal statement. \r\n\r\nApplicants who are successful at this stage will receive a letter inviting them to a task/interview day. The morning is composed of a group task, a presentation task and a written task. The tasks are designed to find out more about applicants and their suitability to teach. Based on performance in these tasks, successful applicants will be invited to remain for a personal interview in the afternoon. This will include a brief teaching task which will be detailed in the letter inviting applicants to interview. Members of staff from partnership schools such as headteachers or subject specialists are also involved in the interviews.\r\n\r\nOriginal documentary evidence of degree and GCSE qualifications must be provided at interview.\r\n","howSchoolPlacementsWork":"RCTTP is extremely well established and has been successfully training teachers for over 15 years. Throughout this time we have worked in close partnership with many primary and secondary schools in order to provide a high quality programme of training. We currently work with over 30 partnership schools throughout Redcar and Cleveland, Middlesbrough, East Cleveland and North Yorkshire.\r\n\r\nTrainees have a ‘host school’. The majority of the trainee’s time is spent in the host school which enables them to build strong relationships with \r\ncolleagues and pupils, maintain continuity of teaching and fully  become part of a school; trainees develop a sense of  belonging and are immersed in school life. \r\n \r\nThe second school placement takes place in a block of  6-8 weeks in the Spring term. For Primary trainees this placement will be in a different Key Stage to the one they are placed in at their host school. Following the second school placement trainees then return to their host school for the remainder of their training year.\r\n\r\nDuring the first half-term  trainees are not expected to teach. Time will be spent observing experienced colleagues and learning about\r\nthe craft of the classroom. In the second half of the Autumn term trainees will teach a 30% timetable. The teaching commitment increases to 50% in the Spring term and 70% in the Summer term of the training year.\r\n\r\nAll primary trainees have a school based Mentor who may also be the Class Teacher. \r\n \r\nSecondary trainees have a Professional Mentor who oversees training and a Subject Mentor who will focus on the development of subject knowledge. \r\n \r\nIn addition to school-based Mentors, all trainees have a Partnership Tutor, an experienced, expert practitioner external to the school who will visit the host school on a regular basis. \r\n \r\nThe Course Leaders provide pastoral and academic support for all trainees.\r\n\r\n","personalQualities":"Whilst rewarding, training to teach is also challenging and  potential trainees need to have an enthusiastic, realistic and committed approach to teaching as a profession. \r\n\r\nSuccessful applicants will have:\r\n*Excellent organisational skills and be able to manage a heavy workload.\r\n*The ability to work under pressure, on their own initiative as well as collaboratively and effectively with colleagues. \r\n*An ability to build positive working relationships.\r\n*Clear and accurate verbal and written communication skills \r\n\r\nWe are looking for people who are Proactive, positive, willing to learn, who aim for the highest standards and will work hard to achieve them.\r\n\r\n \r\n","otherRequirements":"Whilst school experience is not an essential criteria for entry to initial teacher training, relevant experience is extremely valuable. It is therefore very important to gain as much experience as possible of working with children preferably in an educational setting and of the age you wish to teach\r\n\r\nPolice Check: \r\nYou will be required to complete an enhanced Disclosure and Barring Service (DBS) check to verify that you are suitable to work with children.\r\n","status":1,"createdAt":"2021-07-06T10:55:35.046Z","updatedAt":"2021-09-17T11:42:32.080Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
