{"id":"3a5678a8-3739-414e-ad32-cd6fc16b5647","name":"Physical Education","code":"C6X1","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"74d64a54-5e34-4590-b6c7-528dd0cf26fe","code":"C6","name":"Physical education"}],"locations":[{"id":"ce3b1c79-834f-427d-aba1-d28192601327","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"da8e5252-e14a-470a-8247-00b835a79010","code":"B80","name":"University of the West of England, Bristol"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","science":"9","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feeDetails":"Please visit our [website](https://www1.uwe.ac.uk/students/feesandfunding/tuitionfees.aspx) for further information.","aboutCourse":"The Secondary Postgraduate Certificate in Education is a one academic year (36 week) course that trains graduates to be secondary school teachers of Physical Education (PE).\r\n\r\nThis PGCE course will train you to practice as a subject specialist teacher for secondary school age children (11-16). You'll be assessed against the standards for Qualified Teacher Status (QTS) across this age range. It's likely that you'll also gain experience working with 16-18 year olds, although you won't be formally assessed for this work.\r\n\r\nIf you want to use your passion for sport to shape the lives of children, PGCE PE could be for you. You'll be able to follow your interests in health, wellbeing and working with young people by training as a PE teacher.\r\n\r\nGet first-hand experience of working in the classroom with our partnership schools. While on placement, you'll develop the skills needed to deal with the demands of secondary school teaching in today's world.\r\n\r\nThe course is active and practical, allowing you to develop professional competencies through work undertaken in schools and in the University. You'll work with young people, develop expertise in your specialist subject area, share and discuss educational issues and study relevant educational research. The course is just the beginning of what we hope will be a process of continual professional development throughout a challenging and rewarding career.\r\n\r\nChildren need PE teachers who can inspire and motivate them through a range of innovative and creative lessons. After graduating, you'll design your own lessons, empowering your class to get involved with sport by bringing physical activity to life.\r\n\r\nFind out why you should [train to teach with us](https://www1.uwe.ac.uk/cahe/edu/courses/secondaryite.aspx).","interviewProcess":"Currently interviews will be held on line and further information will be sent when invited to attend.\r\n\r\nIf you have a grade C or above in an EBACC subject, you may be eligible for the PE with EBACC course.","howSchoolPlacementsWork":"Placements are offered by schools and settings within our ITE partnership and are geographically diverse, with schools in Bristol, South Gloucestershire, Bath and North East Somerset, Somerset, Wiltshire, Devon, Cornwall and Wales, offering placements. We work hard to match placements to trainee teacher needs and experience, and we endeavour to keep travel times to a maximum of 90 minutes each way, each day.\r\n\r\nTrainee teachers are supported in schools by a Senior Mentor, who is a designated lead teacher for ITE placements in the school, and is responsible for overseeing the training that takes place. Trainee teachers are also closely supported by their Class Mentor (Primary) or Subject Mentor (Secondary), who is their day-to-day contact and supporter in school during placement.","personalQualities":"Our PGCE courses include a high level of placement based learning and working with children. We would encourage all applicants to get as much relevant experience of working or volunteering with children to help prepare them for this crucial element of their course.","otherRequirements":"All offers will be subject to satisfactory DBS (Disclosure and Barring Service) and health checks.","status":1,"createdAt":"2021-07-06T10:56:47.792Z","updatedAt":"2021-10-01T15:27:19.844Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
