{"id":"476f56d8-e12d-4777-9d7d-f9385906490c","name":"Modern Languages","code":"R9X1","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"4608e5e3-2a1a-48a1-8236-56c7af5a139d","code":"24","name":"Modern languages (other)"},{"id":"e34fd2a3-a32e-44e9-aea1-666badf3ac03","code":"22","name":"Spanish"},{"id":"fbb00c08-2dbc-4f26-adb3-3b23afba18c1","code":"17","name":"German"},{"id":"9727f674-61ba-4efa-b1f2-21ec7e354442","code":"15","name":"French"},{"id":"ce8523ef-9236-4cd9-b260-d826c7a521b3","code":"ML","name":"Modern Languages"}],"locations":[{"id":"ce3b1c79-834f-427d-aba1-d28192601327","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"da8e5252-e14a-470a-8247-00b835a79010","code":"B80","name":"University of the West of England, Bristol"},"profPost":"PG","degreeGrade":"9","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"An undergraduate degree, or a recognised equivalent qualification, in French, German or Spanish. For combined degrees, one of these languages must make up at least 50%. This is typically 2:2 or higher but we will look at all applications against the demands of the course. Native speakers of French, German or Spanish may hold an undergraduate degree, or recognised equivalent qualification, in any subject.","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feeDetails":"Please visit our [website](https://www1.uwe.ac.uk/students/feesandfunding/tuitionfees.aspx) for further information.","aboutCourse":"The Secondary Postgraduate Certificate in Education is a one academic year (36 week) course that trains graduates to be secondary school teachers of Modern Languages.\r\n\r\nMany trainee teachers take a SKE course in order to help develop their subject knowledge in preparation for their PGCE course . It may be a condition of your offer to complete one.  These courses are designed to be flexible; they can be tailored to meet your specific study requirements, and can be planned around your commitments.\r\n\r\nSKE courses are funded by the National College for Teaching and Leadership, and you may be eligible for a tax-free £175 weekly bursary whilst studying your SKE.\r\n\r\nThe PGCE programme has been designed to train teachers to practise as a subject specialist teacher for the secondary age range (11-16). Trainees are assessed against the standards for Qualified Teacher Status (QTS) across the age range. Trainees will also often gain experience of the 16-18 age range, although they will not be formally assessed in this phase.\r\n\r\nThe course is active and practical allowing trainees to develop professional competence through work undertaken in schools and in the University. Trainees work with young people, develop their expertise in their specialist subject area, share and discuss educational issues and study relevant educational research. The course is just the beginning of what we hope will be a process of continual professional development throughout a challenging and rewarding career.\r\n\r\nFind out why you should [train to teach with us](https://www1.uwe.ac.uk/cahe/edu/courses/secondaryite.aspx).\r\n","interviewProcess":"","howSchoolPlacementsWork":"Placements are offered by schools and settings within our ITE partnership and are geographically diverse, with schools in Bristol, South Gloucestershire, Bath and North East Somerset, Somerset, Wiltshire, Devon, Cornwall and Wales, offering placements. We work hard to match placements to trainee teacher needs and experience, and we endeavour to keep travel times to a maximum of 90 minutes each way, each day.\r\n\r\nTrainee teachers are supported in schools by a Senior Mentor, who is a designated lead teacher for ITE placements in the school, and is responsible for overseeing the training that takes place. Trainee teachers are also closely supported by their Class Mentor (Primary) or Subject Mentor (Secondary), who is their day-to-day contact and supporter in school during placement.","personalQualities":"Our PGCE programmes include a high level of placement based learning and working with children. We encourage applicants to get as much relevant experience of working or volunteering with children to help prepare them for this crucial element.\r\n\r\n","otherRequirements":"If you have only one language, there is the possibility of doing a three month Extension Course in either French or German between May and August before starting the PGCE course.\r\n\r\nAll offers will be subject to satisfactory DBS (Disclosure and Barring Service) and health checks.","status":1,"createdAt":"2021-07-06T10:56:48.091Z","updatedAt":"2021-10-01T15:26:28.988Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
