{"id":"81e4a856-2145-4be4-8261-274d454cec56","name":"Primary (5-11)","code":"X171","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"ce3b1c79-834f-427d-aba1-d28192601327","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"da8e5252-e14a-470a-8247-00b835a79010","code":"B80","name":"University of the West of England, Bristol"},"profPost":"PG","degreeGrade":"9","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feeDetails":"Please visit our [website](https://www1.uwe.ac.uk/students/feesandfunding/tuitionfees.aspx) for further information.","aboutCourse":"The University of the West of England is committed to training outstanding and transformational teachers for the future, able to provide first class educational experiences that make a significant difference to the life chances of all children - and to do so through partnership schools in the region.\r\n\r\nTeaching is a challenging, exciting and very rewarding career with a high level of job satisfaction. It is a great privilege, as well as a great responsibility, to be one of the first teachers to influence a child.\r\n\r\nThis one-year postgraduate course prepares you to take your place in primary schools as generalist teachers, within a specific key stage Primary (age range 5-11 years) subject specialism.\r\n\r\nThis is an extremely popular course and competition for places is high, so it is essential that you apply early. (Please note the [UTT](https://www.ucas.com/teaching-in-the-uk) dates for applications). You should ensure that you meet the entry requirements and have sufficient observation experience in relevant setting/s.\r\n","interviewProcess":"","howSchoolPlacementsWork":"Placements are offered by schools and settings within our ITE partnership and are geographically diverse, with schools in Bristol, South Gloucestershire, Bath and North East Somerset, Somerset, Wiltshire and Wales offering placements. We work hard to match placements to trainee teacher needs and experience, and we endeavour to keep travel times to a maximum of 90 minutes each way, each day.\r\n\r\nTrainee teachers are supported in schools by a Senior Mentor, who is a designated lead teacher for ITE placements in the school, and is responsible for overseeing the training that takes place. Trainee teachers are also closely supported by their Class Mentor (Primary) or Subject Mentor (Secondary), who is their day-to-day contact and supporter in school during placement.","personalQualities":"Our PGCE programmes include a high level of placement based learning and working with children. We would encourage all applicants to get as much relevant experience of working or volunteering with children to help prepare them for this crucial element of their programme.","otherRequirements":"All offers will be subject to satisfactory DBS (Disclosure and Barring Service) and health checks.","status":1,"createdAt":"2021-07-06T10:56:48.212Z","updatedAt":"2021-10-01T15:33:04.526Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
