{"id":"9fa37107-4a99-4a31-94c0-6c602cb0eef0","name":"English","code":"Q3X1","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3aed1aa8-ae46-4b68-92bb-a6cc20655c59","code":"Q3","name":"English"}],"locations":[{"id":"ce3b1c79-834f-427d-aba1-d28192601327","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"da8e5252-e14a-470a-8247-00b835a79010","code":"B80","name":"University of the West of England, Bristol"},"profPost":"PG","degreeGrade":"9","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feeDetails":"Please visit our [website](https://www1.uwe.ac.uk/students/feesandfunding/tuitionfees.aspx) for further information.","aboutCourse":"The Secondary Postgraduate Certificate in Education is a one academic year (36 week) course that trains graduates to be secondary school teachers of English.\r\n\r\nThe PGCE programme has been designed to train teachers to practise as a subject specialist teacher for the secondary age range (11-16). Trainees are assessed against the standards for Qualified Teacher Status (QTS) across the age range. Trainees will also often gain experience of the 16-18 age range, although they will not be formally assessed in this phase.\r\n\r\nThe course is creative, active and practical, allowing trainees to develop professional competence through work undertaken in schools and in the University. Trainees work with young people, develop expertise in their specialist subject area, share and discuss educational issues and study relevant educational research.\r\n\r\nWhat does it mean to be an English teacher in twenty-first century classrooms? This course develops new teachers' understanding of English in secondary settings through active workshops, creative projects and joint explorations of texts, language, drama and media. Students are encouraged to develop their own subject knowledge for teaching supported by experienced university tutors who have many years' successful classroom experience themselves. We focus on principled practice, deep and rigorous subject knowledge, and even purposeful playfulness.\r\n\r\nYou will be supported to create an inclusive, energetic, exciting classroom environment which will appeal to a range of preferred learning styles and draw on a range of resources.\r\n","interviewProcess":"","howSchoolPlacementsWork":"Placements are offered by schools and settings within our ITE partnership and are geographically diverse, with schools in Bristol, South Gloucestershire, Bath and North East Somerset, Somerset, Wiltshire, Devon, Cornwall and Wales, offering placements. We work hard to match placements to trainee teacher needs and experience, and we endeavour to keep travel times to a maximum of 90 minutes each way, each day.\r\n\r\nTrainee teachers are supported in schools by a Senior Mentor, who is a designated lead teacher for ITE placements in the school, and is responsible for overseeing the training that takes place. Trainee teachers are also closely supported by their Class Mentor (Primary) or Subject Mentor (Secondary), who is their day-to-day contact and supporter in school during placement.\r\n","personalQualities":"Our PGCE programmes include a high level of placement based learning and working with children. We would encourage all applicants to get as much relevant experience of working or volunteering with children to help prepare them for this crucial element of their programme.","otherRequirements":"All offers will be subject to satisfactory DBS (Disclosure and Barring Service) and health checks.","status":1,"createdAt":"2021-07-06T10:56:48.043Z","updatedAt":"2021-10-01T15:14:36.743Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
