{"id":"a63c5856-53be-4930-8a60-16a74e70302c","name":"Art and Design","code":"W1X1","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"d461a678-3335-4ca2-9616-1dc479d31a49","code":"W1","name":"Art and design"}],"locations":[{"id":"ce3b1c79-834f-427d-aba1-d28192601327","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"da8e5252-e14a-470a-8247-00b835a79010","code":"B80","name":"University of the West of England, Bristol"},"profPost":"PG","degreeGrade":"9","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feeDetails":"Please visit our [website](https://www1.uwe.ac.uk/students/feesandfunding/tuitionfees.aspx) for further information.","aboutCourse":"The Secondary Postgraduate Certificate in Education (PGCE) is a one academic year (36- week) course that trains graduates to become secondary school Art and Design teachers.\r\n\r\nThe PGCE course has been designed to train you to practise as a subject specialist teacher for the secondary age range (11-16), and during the course you'll be assessed according to the standards for Qualified Teacher Status (QTS). Our students will often gain experience of the 16-18 age range too, although they won't be formally assessed in this phase.\r\n\r\nThere are many benefits to teaching and learning in art and design. These undoubtedly include facilitating students' personal progress and enjoyment of the subject while encouraging them to express themselves in class. We might add the potential to both celebrate local and global visual culture, and provide talented graduates to the UK creative industries. Arguably, good art and design education goes even further, stretching students to ask themselves powerful questions that spark their inquisition and providing opportunity to respond critically to the world.\r\n\r\nOn this course, you'll learn how to confidently deliver a range of technical artistic media, from chemical photography to conceptual sculpture. You'll actively encounter strategies that enable young learners to look, think, and speak about art and design in ways that are relevant to them, and we'll explore the concept of the creative process in depth. You'll be encouraged to read, to debate and think deeply about the means and purpose of delivering inclusive art education that encourages learners to think independently and empowers them to actively shape their own lives.\r\n\r\nYou'll explore all aspects of secondary art education practice though varied input from specialist tutors, academics, school-based mentors, gallery educationists, and technicians. Our strong links to local arts organisations, innovative visiting practitioners, and our own fantastic facilities mean we're well equipped to prepare you for your career as a practising contemporary art and design educator.\r\n\r\nFind out why you should [train to teach with us](https://www1.uwe.ac.uk/cahe/edu/courses/secondaryite.aspx).\r\n","interviewProcess":"","howSchoolPlacementsWork":"Placements are offered by schools and settings within our ITE partnership and are geographically diverse, with schools in Bristol, South Gloucestershire, Bath and North East Somerset, Somerset, Wiltshire, Devon, Cornwall and Wales, offering placements. We work hard to match placements to trainee teacher needs and experience, and we endeavour to keep travel times to a maximum of 90 minutes each way, each day.\r\n\r\nTrainee teachers are supported in schools by a Senior Mentor, who is a designated lead teacher for ITE placements in the school, and is responsible for overseeing the training that takes place. Trainee teachers are also closely supported by their Class Mentor (Primary) or Subject Mentor (Secondary), who is their day-to-day contact and supporter in school during placement.","personalQualities":"Our PGCE programmes include a high level of placement based learning and working with children. We would encourage all applicants to get as much relevant experience of working or volunteering with children to help prepare them for this crucial element of their programme.","otherRequirements":"All offers will be subject to satisfactory DBS (Disclosure and Barring Service) and health checks.","status":1,"createdAt":"2021-07-06T10:56:48.151Z","updatedAt":"2021-10-01T15:00:10.908Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
