{"id":"a9b36659-a7ab-4ebe-b0e4-bd02d05156e0","name":"Mathematics","code":"G1X1","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"72345aa7-096c-488f-8649-085b8178cadb","code":"G1","name":"Mathematics"}],"locations":[{"id":"ce3b1c79-834f-427d-aba1-d28192601327","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"da8e5252-e14a-470a-8247-00b835a79010","code":"B80","name":"University of the West of England, Bristol"},"profPost":"PG","degreeGrade":"9","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feeDetails":"Please visit our [website](https://www1.uwe.ac.uk/students/feesandfunding/tuitionfees.aspx) for further information.","aboutCourse":"The Secondary Postgraduate Certificate in Education is a one academic year (36 week) course that trains graduates to be secondary school teachers of Mathematics.\r\n\r\nMany trainee teachers take a SKE course in order to help develop their subject knowledge in preparation for their PGCE course . It may be a condition of your offer to complete one.  These courses are designed to be flexible; they can be tailored to meet your specific study requirements, and can be planned around your commitments.\r\n\r\nSKE courses are funded by the National College for Teaching and Leadership, and you may be eligible for a tax-free £175 weekly bursary whilst studying your SKE.\r\n\r\nThe PGCE programme has been designed to train teachers to practise as a subject specialist teacher for the secondary age range (11-16). Trainees are assessed against the standards for Qualified Teacher Status (QTS) across the age range. Trainees will also often gain experience of the 16-18 age range, although they will not be formally assessed in this phase.\r\n\r\nIf you have an infectious enthusiasm for mathematics and enjoy working with young people then we are looking for people just like you. The ability to interpret numbers, calculate, handle statistical information and problem solve are essential skills in everyday adult life - you could help young people acquire these skills. We need mathematics teachers who can motivate, inspire, challenge and communicate their passion for mathematics. This course will support you in becoming a confident, competent, reflective mathematics teacher.\r\n\r\nThe course is active and practical allowing trainees to develop professional competence through work undertaken in schools and in the University. Trainees work with young people, develop their expertise in their specialist subject area, share and discuss educational issues and study relevant educational research. The course is just the beginning of what we hope will be a process of continual professional development throughout a challenging and rewarding career.\r\n\r\nFind out why you should [train to teach with us](https://www1.uwe.ac.uk/cahe/edu/courses/secondaryite.aspx).\r\n","interviewProcess":"","howSchoolPlacementsWork":"Placements are offered by schools and settings within our ITE partnership and are geographically diverse, with schools in Bristol, South Gloucestershire, Bath and North East Somerset, Somerset, Wiltshire, Devon, Cornwall and Wales, offering placements. We work hard to match placements to trainee teacher needs and experience, and we endeavour to keep travel times to a maximum of 90 minutes each way, each day.\r\n\r\nTrainee teachers are supported in schools by a Senior Mentor, who is a designated lead teacher for ITE placements in the school, and is responsible for overseeing the training that takes place. Trainee teachers are also closely supported by their Class Mentor (Primary) or Subject Mentor (Secondary), who is their day-to-day contact and supporter in school during placement.","personalQualities":"Our PGCE programmes include a high level of placement based learning and working with children. We would encourage all applicants to get as much relevant experience of working or volunteering with children to help prepare them for this crucial element of their programme.","otherRequirements":"All offers will be subject to satisfactory DBS (Disclosure and Barring Service) and health checks.","status":1,"createdAt":"2021-07-06T10:56:48.011Z","updatedAt":"2021-10-01T15:24:16.710Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
