{"id":"d0f6ecfd-def1-4e9f-a8be-6f1a289e36bf","name":"Business Studies","code":"34FW","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"14_to_19","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"de6477b2-6027-48e6-b9f7-3206774705c2","code":"08","name":"Business studies"}],"locations":[{"id":"ce3b1c79-834f-427d-aba1-d28192601327","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"da8e5252-e14a-470a-8247-00b835a79010","code":"B80","name":"University of the West of England, Bristol"},"profPost":"PG","degreeGrade":"9","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feeDetails":"Please visit our [website](https://www1.uwe.ac.uk/students/feesandfunding/tuitionfees.aspx) for further information.","aboutCourse":"The Secondary Postgraduate Certificate in Education is a one academic year (36 week) course that trains graduates to be secondary school teachers of Business Studies.\r\n\r\nThe PGCE programme has been designed to train teachers to practise as a subject specialist teacher for the secondary age range (14-19). You are assessed against the standards for Qualified Teacher Status (QTS) across this age range. You will also gain practical experience of the 16-19 age range during your placement.\r\n\r\nThe aim of this PGCE in Business Studies is to provide you with engaging and relevant professional training to enable your degree in Business related subjects to transform you into a capable and effective classroom practitioner. You will develop understanding of how students learn about Business and to be able to critically reflect upon their teaching to improve. The course prepares you to develop the necessary skills to teach Business Studies in schools and colleges at GCSE and A level. In addition, the course will cover vocational qualifications such as BTEC.\r\n\r\nYou will understand how Business Studies is taught in schools, how students learn and how they begin to make sense of the changing nature of the business world. There will also be the opportunity to consider how other areas including entrepreneurship, citizenship and ICT draw upon our Business Studies curriculum, affording opportunities to work alongside a range of colleagues in other subject areas.\r\n\r\nYou will work with young people, develop their expertise in their specialist subject area, share and discuss educational issues and study relevant educational research. The course is just the beginning of what we hope will be a process of continual professional development throughout a challenging and rewarding career.\r\n\r\nFind out why you should [train to teach with us](https://www1.uwe.ac.uk/cahe/edu/courses/secondaryite.aspx).\r\n","interviewProcess":"","howSchoolPlacementsWork":"Placements are offered by schools and settings within our ITE partnership and are geographically diverse, with schools in Bristol, South Gloucestershire, Bath and North East Somerset, Somerset, Wiltshire, Devon, Cornwall and Wales, offering placements. We work hard to match placements to trainee teacher needs and experience, and we endeavour to keep travel times to a maximum of 90 minutes each way, each day.\r\n\r\nTrainee teachers are supported in schools by a Senior Mentor, who is a designated lead teacher for ITE placements in the school, and is responsible for overseeing the training that takes place. Trainee teachers are also closely supported by their Class Mentor (Primary) or Subject Mentor (Secondary), who is their day-to-day contact and supporter in school during placement.\r\n","personalQualities":"Our PGCE programmes include a high level of placement based learning and working with children. We would encourage all applicants to get as much relevant experience of working or volunteering with children to help prepare them for this crucial element of their programme.","otherRequirements":"All offers will be subject to satisfactory DBS (Disclosure and Barring Service) and health checks.","status":1,"createdAt":"2021-07-06T10:56:47.759Z","updatedAt":"2021-10-01T15:09:57.026Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
