{"id":"e64093c6-44ad-460c-879c-a9d482d63699","name":"Art and design (Distance Learning)","code":"W1X2","qualification":"pgce_with_qts","startDate":"2024-03-31T23:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"B","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"d461a678-3335-4ca2-9616-1dc479d31a49","code":"W1","name":"Art and design"}],"locations":[{"id":"ce3b1c79-834f-427d-aba1-d28192601327","name":"Main Site","isPublished":"Y","status":"R","vacancies":"B"}],"trainingProvider":{"id":"da8e5252-e14a-470a-8247-00b835a79010","code":"B80","name":"University of the West of England, Bristol"},"profPost":"PG","degreeGrade":"9","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"TwoYears","feesUK":6750,"feeDetails":"Please visit our [website](https://www1.uwe.ac.uk/students/feesandfunding/tuitionfees.aspx) for further information.\r\n","aboutCourse":"Our PGCE Online Distance Learning courses enable graduates to train and qualify as teachers while studying remotely. Study your chosen course over one year full-time or two years part-time, giving you the flexibility to fit your studies around your other commitments.\r\n\r\nUWE Bristol is committed to training the best teachers for the future, able to provide first-class educational experiences and make a significant difference to children's lives. We'll train you to do so in partnership with your schools or educational settings.\r\n\r\nTeaching is a challenging, exciting and rewarding career, with a high level of job satisfaction. It's a great privilege, as well as a great responsibility, to be able to influence and shape the progress of children and young people.  All children deserve to learn well, with enthusiastic specialist teachers.\r\n\r\nTo undertake the course, you must be in a role, or secure a role, in a school. This will enable you to undertake the required teaching practice specified by the Department for Education (DfE), which must be agreed by UWE Bristol before starting the course.\r\n\r\nYour teaching practice will need to include some time spent in an alternative placement school, ensuring you'll gain a variety of teaching experience.  The schools involved will need to support your engagement with and progression through the course.\r\n\r\nThe Secondary Postgraduate Certificate in Education (PGCE) is a course that trains graduates to be secondary school teachers of art and design.\r\n\r\nThe online PGCE course has been designed to train you to practise as a subject specialist teacher for the secondary age range (11-16). During the course you'll be assessed according to the standards for Qualified Teacher Status (QTS). Our students will often gain experience of the 16-18 age range too, although they won't be formally assessed in this phase.\r\n\r\nOn this course, you'll study and practice strategies that enable you to support learners to look, think, and speak about art and design in ways that are relevant to them. We'll explore the concept of the creative process in depth. You'll debate and reflect on the purpose of delivering inclusive art education that encourages learners to think independently and empowers them to actively shape their own lives.","interviewProcess":"","howSchoolPlacementsWork":"You'll complete two school-based placements that you'll need to organise before starting the course. You may be already employed by a school as a Teaching Assistant or Support Member of staff.\r\n\r\nTrainee teachers are supported in schools by their Class Mentor (Primary) or Subject Mentor (Secondary), who is their day-to-day contact and supporter in school during placement.","personalQualities":"","otherRequirements":"All offers will be subject to satisfactory DBS (Disclosure and Barring Service) and health checks.","status":1,"createdAt":"2021-09-22T15:18:18.960Z","updatedAt":"2021-10-04T15:36:51.792Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
