{"id":"060d0def-a611-4ab4-b1ea-ee694076f795","name":"Physics","code":"2CCR","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"bf97cd0a-224c-43d3-a021-84143df13e8d","code":"F3","name":"Physics"}],"locations":[{"id":"192808f2-8aee-42e6-b897-bd0405e8c0f7","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"19a3446e-382d-4c14-83bb-a76563cef3c1","code":"L24","name":"Leeds Trinity University"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"If you do not already have the appropriate GCSEs, or if you are unable to provide proof of your grades, we can accept GCSE equivalency tests taken with www.equivalencytesting.com, www.astarequivalency.co.uk or Birmingham City University (BCU) www.bcu.ac.uk. \n\nYou only need to do the test if you are offered a place with us that you firmly accept. We can only accept tests from these providers and you will need to contact them directly for details on how to book and their costs.","courseLength":"OneYear","feesUK":9250,"feeDetails":"For the most up-to-date tuition fees, visit [Leeds Trinity](https://www.leedstrinity.ac.uk/study/fees-and-finance/teacher-training-uk-and-eu/)","financialSupport":"For the most up-to-date information on what financial support you may be eligible for, including bursaries and scholarships, visit [Leeds Trinity](https://www.leedstrinity.ac.uk/study/fees-and-finance/teacher-training-uk-and-eu/)\r\n\r\nFor information on what finance support may be eligible for international applicants, visit [Leeds Trinity](https://www.leedstrinity.ac.uk/study/fees-and-finance/international-fees-and-funding/)\r\n","aboutCourse":"Our PGCE Secondary Physics course prepares you to teach in the 11 - 16 age phase. It may be possible to gain experience of teaching post 16 during your PGCE and the qualification does not preclude you from teaching post 16 once employed. There are two stages to the course.\r\n\r\nStage A – Introduction to teaching\r\n\r\nUniversity-based training\r\nOur innovative and supportive model of training gives you school experience from the very early weeks of the course, and support and tuition from University and subject experts until you are a highly-confident new teacher. After a short induction programme, you will start a school placement three days a week, extending to four days a week. Every Friday you’ll return to University for subject knowledge and applied pedagogy sessions and support from your tutor and fellow trainees on the course. \r\n\r\nProfessional Education Studies\r\nYou'll be introduced to the important topics and issues which will inform your learning, practice and professional values. These sessions give theoretical insights and practical strategies to tackle issues that you will face in your placements and early years of your professional teaching life.\r\n\r\nSubject knowledge and applied pedagogy\r\nYou'll study the school curriculum and understand how other expert teachers have taught it successfully. You'll learn how to plan sequences of learning that address the needs of your pupils so you can develop your practice and have a positive impact on their learning.\r\n\r\nSchool-based training\r\nYou'll put into practice what you’ve learnt in a collaborative working environment, working closely with your subject mentor based in your school. You'll benefit from the support and expertise of your subject tutor, and your subject peer group at University one day a week.\r\n\r\nStage B – Developing your knowledge and preparing for your new career\r\n\r\nUniversity-based training\r\nYou'll build on the knowledge you’ve already developed to prepare for your next school-based training block.\r\n\r\nPreparation week\r\nYou’ll again spend time in a school for one week to observe and familiarise yourself with the routine and teaching practice.\r\n\r\nSchool-based training\r\nYou'll deepen your knowledge of how students learn, extending your practice in helping that learning, in a new context. This long placement gives you the chance to develop your practice in a school, and with pupils that you will get to know really well. \r\n\r\nYou'll teach more lessons, ensuring you’re teaching classes from both Key Stage 3 and 4, becoming more of an independent practitioner.","interviewProcess":"If you’re invited to an interview through our University-led route, you’ll also receive an email from us that explains everything you need to know about your interview. This includes the date, time and method of interview, as well as what to prepare beforehand and what will happen on the day, so it’s really important to read this email very carefully.\r\n","howSchoolPlacementsWork":"If school placements are impacted as a result of COVID-19, we will inform you before the course starts.\r\n\r\nOur School Partnerships Office will source your placements, taking into account your training needs and personal circumstances. \r\n\r\nAfter you’ve completed your first five weeks of University-based training, you’ll start your first eight-week placement. This will give you the chance to put into practice what you’ve learnt in a collaborative working environment, working closely with your school-based mentor.\r\n\r\nFrom January to June, you’ll complete a second placement in a different school. This will help you deepen your knowledge of how students learn, and extend your practice in helping that learning, in a new context. This longer placement provides you with the chance to develop your practice in one school and with pupils you will get to know really well together enabling you to make a positive impact on pupil progress.\r\n\r\nDuring your second placement, your school and the university support you as teaching responsibilities gradually increase to 80% of a typical early career teacher’s timetable, helping you to become a more independent practitioner in preparation for employment.\r\n\r\nThroughout your placements, you’ll have the support of a school-based mentor. These mentors are trained by Leeds Trinity to support you as you complete your training and assess your progress towards meeting the Teachers’ standards by the end of the PGCE programme. You’ll also have a university tutor, based at Leeds Trinity and a link tutor who will visit you at school. They will provide quality assurance for your training and offer any support and advice you may need.","personalQualities":"We’re committed to training outstanding teachers that will make a huge difference to the lives of those they teach. As such, we also for candidates that have:\r\n\r\n* The personal and intellectual qualities required for teaching in schools.\r\n \r\n* The commitment, attitudes and values appropriate to those of a secondary teacher.\r\n\r\n* The ability to read effectively and communicate clearly and accurately in spoken and written standard English.\r\n\r\n* Strong applicants also have experience in secondary schools.","otherRequirements":"Successful applicants also tend to have:\r\n\r\n* Advanced level qualifications (or equivalent) in Physics.\r\n\r\n* Experience of observing the teaching in a secondary school in this country.\r\n\r\nAn offer of a place is subject to:\r\n\r\n* A satisfactory Disclosure and Barring Service (DBS) Enhanced Disclosure Certificate.\r\n\r\n* A satisfactory medical.\r\n\r\nIf you are offered a place you will be sent the information regarding these checks.\r\n\r\nIf you require a visa to study in the UK, you must apply by end of May 2021. We will offer advice if you apply in May, but cannot guarantee we can process your application.","status":1,"createdAt":"2021-07-06T10:52:55.371Z","updatedAt":"2021-09-28T08:59:35.898Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
