{"id":"a59f07cb-2e17-4be1-9215-60ab91a6aa4c","name":"Primary (5-11)","code":"X104","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"192808f2-8aee-42e6-b897-bd0405e8c0f7","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"19a3446e-382d-4c14-83bb-a76563cef3c1","code":"L24","name":"Leeds Trinity University"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"If you do not already have the appropriate GCSEs, or if you are unable to provide proof of your grades, we can accept GCSE equivalency tests taken with www.equivalencytesting.com, www.astarequivalency.co.uk or Birmingham City University (BCU) www.bcu.ac.uk. \n\nYou only need to do the test if you are offered a place with us that you firmly accept. We can only accept tests from these providers and you will need to contact them directly for details on how to book and their costs.","courseLength":"OneYear","feesUK":9250,"feeDetails":"For the most up-to-date tuition fees, visit [Leeds Trinity](https://www.leedstrinity.ac.uk/study/fees-and-finance/teacher-training-uk-and-eu/)","financialSupport":"For the most up-to-date information on what financial support you may be eligible for, including bursaries and scholarships, visit [Leeds Trinity](https://www.leedstrinity.ac.uk/study/fees-and-finance/teacher-training-uk-and-eu/)\r\n\r\nFor information on what finance support may be eligible for international applicants, visit [Leeds Trinity](https://www.leedstrinity.ac.uk/study/fees-and-finance/international-fees-and-funding/)\r\n","aboutCourse":"There are three stages to your PGCE Primary.\r\n\r\nStage one – Introduction and Preparation \r\n\r\nUniversity-based training\r\nYou'll take part in seminars and workshops that prepare you for your school-based training which focuses on:\r\n\r\nPrimary Professional Studies\r\nYou’ll learn strategies to tackle issues that you'll face in your training placements. This will help develop your understanding of teaching and learning, the primary curriculum and educational policy. Key areas include behaviour management, pedagogy, curriculum, assessment and professional behaviours.\r\n\r\nSubject knowledge and applied pedagogy\r\nYou'll develop your Early Years and Key Stage 1 curriculum knowledge, understanding in English, Mathematics and Science. You’ll explore the broader curriculum and observe and reflect on best practice across the whole curriculum.\r\n\r\nCPD\r\nYou’ll spend time on CPD activities that will enhance your teaching applications and make you more employable.\r\n\r\nSchool-based training\r\nWorking alongside an experienced class teacher and mentor you'll have the opportunity to put into practice what you’ve learnt so far, focusing on teaching English, Mathematics and one other curriculum area.\r\n\r\nStage two – Developing and Securing \r\n\r\nUniversity-based training\r\nYou'll reflect on your experiences in the first stage and set developmental targets ahead of your second block of school-based training. You'll continue to receive training in Primary Professional Studies, top-up training, and further information regarding planning and delivering sequences of learning. \r\n\r\nSchool-based training\r\nTeaching skills will be developed further, usually in a different school, teaching a contrasting age phase to your first placement. You'll continue to focus on English and Mathematics, alongside PE and broader areas of the curriculum.\r\n\r\nStage three – Refining and Embedding\r\n\r\nUniversity-based training\r\nHaving developed and applied your subject and curriculum knowledge, you’ll spend some time completing CPD activities. These activities will include responses to current priorities in primary education, support for your first employment and optional enhancements to develop your professional profile.\r\n\r\nSchool-based training\r\nYou’ll usually stay in the same school as your stage 2 placement until the end of the programme, teaching another age phase, teaching all subjects and areas of provision. You'll take on the role of the class teacher and take on wider responsibilities across the school, continuing to have coaching and mentoring from school staff.\r\n\r\nTransition placement\r\nAt the end of stage three, you'll source a two-week Transition placement. This placement will help you prepare for graduate employment as a teacher, giving you the chance to explore any aspects of primary teaching that have particularly interested you.","interviewProcess":"If you’re invited to an interview through our University-led route, you’ll also receive an email from us that explains everything you need to know about your interview. This includes the date, time and method of interview, as well as what to prepare beforehand and what will happen on the day, so it’s really important to read this email very carefully.\r\n\r\n","howSchoolPlacementsWork":"If school placements are impacted as a result of COVID-19, we will inform you before the course starts.\r\n\r\nOur School Partnerships Office will source your placements, taking into account your training needs and personal circumstances. \r\n\r\nAfter you’ve completed your first five weeks of University-based training, you’ll start your first eight-week placement. This will give you the chance to put into practice what you’ve learnt in a collaborative working environment, working closely with your school-based mentor.\r\n\r\nFrom January to June, you’ll complete a second placement in a different school. This will help you deepen your knowledge of how students learn, and extend your practice in helping that learning, in a new context. This longer placement provides you with the chance to develop your practice in one school and with pupils you will get to know really well together enabling you to make a positive impact on pupil progress.\r\n\r\nDuring your second placement, your school and the university support you as teaching responsibilities gradually increase to 80% of a typical early career teacher’s timetable, helping you to become a more independent practitioner in preparation for employment.\r\n\r\nThroughout your placements, you’ll have the support of a school-based mentor. These mentors are trained by Leeds Trinity to support you as you complete your training and assess your progress towards meeting the Teachers’ standards by the end of the PGCE programme. You’ll also have a university tutor, based at Leeds Trinity and a link tutor who will visit you at school. They will provide quality assurance for your training and offer any support and advice you may need.","personalQualities":"We’re committed to training outstanding teachers that will make a huge difference to the lives of those they teach. As such, we also for candidates that have:\r\n\r\n* The personal and intellectual qualities required for teaching in schools.\r\n \r\n* The commitment, attitudes and values appropriate to those of a primary teacher.\r\n\r\n* The ability to read effectively and communicate clearly and accurately in spoken and written standard English.\r\n\r\n* Strong applicants also have experience in primary schools.","otherRequirements":"Successful applicants also tend to have:\r\n\r\n* Experience of observing the teaching in a primary school in this country.\r\n\r\n* An offer of a place is subject to:\r\n\r\n* A satisfactory Disclosure and Barring Service (DBS) Enhanced Disclosure Certificate.\r\n\r\n* A satisfactory medical.\r\n\r\nIf you are offered a place you will be sent the information regarding both of these checks.\r\n","status":1,"createdAt":"2021-07-06T10:52:55.879Z","updatedAt":"2021-09-28T08:59:51.694Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
