{"id":"5f4c5cbc-fa57-4e58-b07c-5c425ab46c1b","name":"Science","code":"F944","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"ed329bbc-6bb1-481f-98f7-8815f8c4fd68","code":"F0","name":"Science"}],"locations":[{"id":"c89df3cb-2909-4613-b252-2ee9597be1fb","name":"St Michaels CE High School","isPublished":"Y","status":"S"}],"trainingProvider":{"id":"e06166f7-f57d-4f6c-bf5d-a12c0beb7526","code":"142","name":"Crocketts Community Primary School"},"accreditedBody":{"id":"4aa8177a-27b8-4566-b77a-c45515e46739","code":"N36","name":"Newman University"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Equivalency test requirements will be assessed on an individual basis.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"All subjects at St Michael’s are taught within in a 3 year KS3 curriculum and 2 year KS4 curriculum.\r\n\r\nThe Science curriculum focuses on introducing pupils to problem-solving and critical thinking, as these are two of the most important skills pupils learn. Science is one of the most important subjects’ pupils study because it gives them the critical thinking skills they need in every subject. Pupils will develop skills in planning and conducting investigations, gathering information, teamwork and evaluating their findings. Pupils will develop skills that will help them to analyse, explain and evaluate data. They will perform investigations and experiments that will make them more proficient in handling apparatus and equipment. They will also develop curiosity and intrigue into the world around them.\r\n","interviewProcess":"","howSchoolPlacementsWork":"The main school placement will take place at St Michael’s CE High School. For information about St Michael’s, please visit:\r\n \r\nhttp://st-michaels.sandwell.sch.uk/\r\n\r\nYou will be invited to participate in a formal induction day, which takes place in July, in order to prepare you for your first day in September.\r\n\r\nSeptember until December (Autumn term): Trainees are in their host school placement and are required to teach 50% of an NQTs teaching allocation.\r\n\r\nJanuary to April (Spring term): Trainees will take part in a 6-week second school placement scheduled during spring term. Trainees are required to teach 60% of an NQTs teaching allocation. \r\n\r\nApril to July (Summer term): Trainees are in their host school and are required to teach 70% of an NQTs teaching allocation. During this time a 1-week primary transition placement will be arranged.\r\n","personalQualities":"","otherRequirements":"","status":3,"createdAt":"2021-07-06T10:51:17.891Z","updatedAt":"2021-10-06T11:19:44.858Z","canSponsorStudentVisa":"no","cycle":"2024"}
