{"id":"83259baa-7e51-4869-bae8-f838f55067df","name":"Geography","code":"2QVT","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3f47e67b-7fa5-4947-a5a0-74d528cd2a87","code":"F8","name":"Geography"}],"locations":[{"id":"39dfb4f4-f5ab-4c0f-8b72-29d478d39779","name":"Perryfields High School and Sixth Form","isPublished":"Y","status":"S"},{"id":"c89df3cb-2909-4613-b252-2ee9597be1fb","name":"St Michaels CE High School","isPublished":"Y","status":"S"},{"id":"e28f6320-06a6-473f-9121-02e45f478f05","name":"Bristnall Hall Academy","isPublished":"Y","status":"S"}],"trainingProvider":{"id":"e06166f7-f57d-4f6c-bf5d-a12c0beb7526","code":"142","name":"Crocketts Community Primary School"},"accreditedBody":{"id":"4aa8177a-27b8-4566-b77a-c45515e46739","code":"N36","name":"Newman University"},"profPost":"BO","degreeGrade":"1","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Equivalency test requirements will be assessed on an individual basis.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"All subjects at St Michael’s are taught within in a 3 year KS3 curriculum and 2 year KS4 curriculum.\r\n\r\nGeography is a subject that teaches pupils about the world we all live in. It teaches pupils about events in both the natural and human worlds and how these two worlds are interlinked. It has an important role to play in developing an understanding of key global issues and helping pupils understand that there are a variety of perspectives from which these issues can be viewed. Geography, therefore, has important links to citizenship – we are all global citizens, with responsibilities to the planet and to each other. The information covered within the KS3 specification allows pupils access to a broad and balanced curriculum, in order to support pupils undertaking option choices and specialising in GCSE Geography.\r\n","interviewProcess":"Applications are made through UCAS. Newman and the Lead school consider applications and invite suitable applicants for interview","howSchoolPlacementsWork":"The main school placement will take place at St Michael’s CE High School. For information about St Michael’s, please visit:\r\n \r\nhttp://st-michaels.sandwell.sch.uk/\r\n\r\nYou will be invited to participate in a formal induction day, which takes place in July, in order to prepare you for your first day in September.\r\n\r\nSeptember until December (Autumn term): Trainees are in their host school placement and are required to teach 50% of an NQTs teaching allocation.\r\n\r\nJanuary to April (Spring term): Trainees will take part in a 6-week second school placement scheduled during spring term. Trainees are required to teach 60% of an NQTs teaching allocation. \r\n\r\nApril to July (Summer term): Trainees are in their host school and are required to teach 70% of an NQTs teaching allocation. During this time a 1-week primary transition placement will be arranged.\r\n\r\n","personalQualities":"","otherRequirements":"","status":3,"createdAt":"2021-07-06T10:51:17.779Z","updatedAt":"2021-10-06T11:16:57.022Z","canSponsorStudentVisa":"no","cycle":"2024"}
