{"id":"83720f5e-5194-44f2-824e-5745fd8370e6","name":"Art and Design","code":"2ZDR","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"d461a678-3335-4ca2-9616-1dc479d31a49","code":"W1","name":"Art and design"}],"locations":[{"id":"c89df3cb-2909-4613-b252-2ee9597be1fb","name":"St Michaels CE High School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"e06166f7-f57d-4f6c-bf5d-a12c0beb7526","code":"142","name":"Crocketts Community Primary School"},"accreditedBody":{"id":"4aa8177a-27b8-4566-b77a-c45515e46739","code":"N36","name":"Newman University"},"profPost":"BO","degreeGrade":"1","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Equivalency test requirements will be assessed on an individual basis.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"\r\nArt and Design: All subjects at St Michael’s are taught within in a 3 year KS3 curriculum and 2 year KS4 curriculum.\r\n\r\nThe curriculum focuses on introducing pupils in Year 7 to the fundamental skills of Art and Design and builds upon this through Years 8 and 9 with the exploration of artists and design movements. Pupils are encouraged to develop their two-dimensional and three-dimensional skills by responding to ideas and themes. In the projects covered, all pupils will:\r\n\r\n•\tDevelop their drawing and observing skills.\r\n•\tInvestigate their ability to research and analyse artists and their techniques critically.\r\n•\tExplore the qualities and constraints of a variety of media through experimentation.\r\n•\tCraft outcomes that reflect the skills, knowledge and understanding developed throughout the projects.\r\n\r\nThe information covered within the KS3 specification allows pupils access to a broad and balanced curriculum, in order to support pupils undertaking option choices and specialising in GCSE Art and Design.\r\n\r\nHow will I be assessed?\tAssessment takes place at various stages throughout the training year. This includes in school based assignments, tasks and formal academic assessments.\r\n\r\nYou will have to complete two formal assignments and these will be submitted to Newman University: \r\n\r\n•\tJanuary submission – an assignment based upon behaviour.\r\n•\tApril submission – an assignment based upon a problematic area within your subject.\r\n\r\nFor more information about the course structure, please visit:\r\n\r\nhttps://www.newman.ac.uk/knowledge-base/school-direct-secondary-documentation/\r\n\r\n\r\nThe formal assessment of your progress consists of termly:\r\n•\tLesson Observation (once a week)\r\n•\tMid-term checkpoint report\r\n•\tSecond School Placement End Point Review (where applicable)\r\n•\tEnd Point Review\r\n\r\n\r\n","interviewProcess":"Applications are made through UCAS. Newman and the Lead school consider applications and invite suitable applicants for interview","howSchoolPlacementsWork":"The main school placement will take place at St Michael’s CE High School. For information about St Michael’s, please visit:\r\n \r\nhttp://st-michaels.sandwell.sch.uk/\r\n\r\nYou will be invited to participate in a formal induction day, which takes place in July, in order to prepare you for your first day in September.\r\n\r\nSeptember until December (Autumn term): Trainees are in their host school placement and are required to teach 50% of an NQTs teaching allocation.\r\n\r\nJanuary to April (Spring term): Trainees will take part in a 6-week second school placement scheduled during spring term. Trainees are required to teach 60% of an NQTs teaching allocation. \r\n\r\nApril to July (Summer term): Trainees are in their host school and are required to teach 70% of an NQTs teaching allocation. During this time a 1-week primary transition placement will be arranged.","personalQualities":"","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:51:17.864Z","updatedAt":"2021-10-06T10:53:31.783Z","canSponsorStudentVisa":"no","cycle":"2024"}
