{"id":"dd2b8529-5482-4df0-996e-3c73b578f549","name":"English","code":"2QTZ","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3aed1aa8-ae46-4b68-92bb-a6cc20655c59","code":"Q3","name":"English"}],"locations":[{"id":"c89df3cb-2909-4613-b252-2ee9597be1fb","name":"St Michaels CE High School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"e06166f7-f57d-4f6c-bf5d-a12c0beb7526","code":"142","name":"Crocketts Community Primary School"},"accreditedBody":{"id":"4aa8177a-27b8-4566-b77a-c45515e46739","code":"N36","name":"Newman University"},"profPost":"BO","degreeGrade":"1","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Equivalency test requirements will be assessed on an individual basis.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"English (language and literature): All subjects at St Michael’s are taught within in a 3 year KS3 curriculum and 2 year KS4 curriculum.\r\n\r\nThe English curriculum focuses on introducing pupils to the skills of reading, writing, speaking and listening, as these are of vital importance in many areas, both in school-life and life beyond the classroom. These skills are essential in many careers and in addition to this, they underpin successful study at all levels. The department is driven by the belief that English is essential to the pupils’ progress across the whole curriculum. Consequently, there is assiduous attention paid to the technical areas of writing together with a desire to foster a love and enjoyment of literature.\r\n\r\nAs a School Direct trainee you will receive formal and informal support including:\r\n\r\n.formal new staff induction day\r\n.School laptop to use whilst on placement\r\n.Core and SD study days at Newman University\r\n.Formal observations, once every 2 weeks with detailed feedback in order to improve your pedagogy and practice.\r\n.Formal Mentor meetings\r\n.Formal Professional Tutor meetings\r\n.Bespoke programme for new staff induction\r\n.Formal CPLD\r\n.Informal subject teacher support\r\n.Formal Safeguarding and PREVENT training\r\n.Any other formal or informal training relevant to your individual needs.\r\n","interviewProcess":"Applications are made through UCAS. Newman and the Lead school consider applications and invite suitable applicants for interview.\r\nAt St Michael's ,one training place is available for each subject offered .\r\n\r\nSuccessful applicants will be formally notified and invited into school to attend an interview. The interview will consist of a 25-minute lesson observation and a formal interview. All details about the interview procedure will be confirmed in writing.","howSchoolPlacementsWork":"The main school placement will take place at St Michael’s CE High School. For information about St Michael’s, please visit:\r\n \r\nhttp://st-michaels.sandwell.sch.uk/\r\n\r\nYou will be invited to participate in a formal induction day, which takes place in July, in order to prepare you for your first day in September.\r\n\r\nSeptember until December (Autumn term): Trainees are in their host school placement and are required to teach 50% of an NQTs teaching allocation.\r\n\r\nJanuary to April (Spring term): Trainees will take part in a 6-week second school placement scheduled during spring term. Trainees are required to teach 60% of an NQTs teaching allocation. \r\n\r\nApril to July (Summer term): Trainees are in their host school and are required to teach 70% of an NQTs teaching allocation. During this time a 1-week primary transition placement will be arranged.\r\nThe second school placement will be arranged at a local school within our secondary partnership. \r\nSecond school placements last for a period of six weeks and post-16 experience will be organised in the second placement.\r\nTrainees are required to teach 60% of an NQTs teaching allocation. The number of teaching periods will vary between schools, due to the number and length of sessions taught on a daily basis.\r\n\r\n","personalQualities":"","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:51:17.701Z","updatedAt":"2021-10-06T11:05:53.894Z","canSponsorStudentVisa":"no","cycle":"2024"}
