{"id":"55a79f0d-8118-4c11-98ed-1b5aba095ff5","name":"Primary","code":"38JX","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"9d0102fa-86be-4280-8ff9-717694331c0e","name":"Scissett CE Academy","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"382bc2e1-cbd3-4bd3-b100-b58898e7e021","code":"13J","name":"Yorkshire Anglican Learning and Education Partnership"},"accreditedBody":{"id":"74d0e1b3-80ac-4a0e-b93d-f19cb6587144","code":"1WK","name":"Kirklees and Calderdale SCITT"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feeDetails":"We offer two options through the Kirklees and Calderdale SCITT accreditation: \r\n£7500 for Qualified Teacher Status alone (QTS)\r\n£9250 for QTS with PGCE. This PGCE element equates to 60 Masters credits which is offered through the University of Huddersfield.\r\n","financialSupport":"If required, we will support you through the Student Finance process for fees and maintenance grants, as well as signpost to other possible funding streams. We recognise that primary trainees do not have access to a bursary, however we will look to place trainees in a school with suitable travelling distance.\r\n\r\nYou may also be eligible for a loan while you study – note that you’ll have to apply for undergraduate student finance (https://getintoteaching.education.gov.uk/funding-my-teacher-training)\r\n\r\nFind out about financial support if you’re from outside the UK (https://getintoteaching.education.gov.uk/explore-my-options/overseas-graduates)\r\n\r\n\r\n\r\n","aboutCourse":"Yorkshire Anglican Learning and Education Partnership is an inclusive and diverse training and education centre within Learning Accord Multi Academy Trust. We are a well-established training provider with an excellent reputation in providing high quality teacher training and support. With over 50 partner schools we can offer a wealth of experience and choice with your school placements. Our School Direct Programme is accredited through Kirklees and Calderdale SCITT and is delivered over the course of an academic year. \r\nThe Kirklees and Calderdale SCITT moderation report (2019) said…\r\n4.3 The SCITT is able to draw from a bank of considerable expertise and resources, developed and acquired over time...\r\n4.5 … the SCITT manager is forward-looking and committed to adopting best practice to ensure that all trainees receive a ‘good deal’ and are equipped with all of the essential tools they need to teach effectively and impact positively on pupil progress.\r\nA strength of our programme is that you will be in school from the first day of term and will be seen as a staff member. You will be in school four days a week to the end of the school year, with two contrasting placements. One day a week you’ll be at our central venue alongside other trainees, sharing and learning from each other’s experiences and receiving a bespoke package of curriculum training. Our model enables you to experience a full year in school and fully appreciate the demands/rewards that brings.\r\nWorking alongside your mentor, you’ll identify your ongoing level of knowledge, skills and experience and draw up and work continuously on a training plan. This will involve observing experienced teachers and training activities leading to delivering whole class teaching.\r\nCore training is extremely diverse from theoretical input to observing excellent practice. We support our trainees, enabling them to be fully prepared for the exciting and challenging world of teaching.\r\nOn successful completion of the programme you will be awarded qualified teacher status (QTS) in line with the Teacher Standards.\r\nAssessment is;\r\n•\tHalf-termly Tutor visit reports\r\n•\t3 termly reports\r\n•\t2nd placement report\r\n•\t3 Reflection Points (training activities which focus on a group of standards feeding into 2 Assignments)\r\n\r\nWe work hard to create a reduced workload approach to assessment, basing many of our judgments on professional dialogue. Assessment is based upon day-to-day practice and should complement your teaching and reduce the amount of additional work required.\r\n","interviewProcess":"If you are selected for interview, you will be asked to prepare a task to bring to your interview and should expect to undertake a written task on the day.\r\n\r\nYou will be invited to an interview by a small panel comprising a Partnership tutor and a senior colleague from one of our partner schools.\r\n\r\nYou will be expected to answer a range of questions which are designed to explore your personal qualities and meeting the course criteria.\r\n\r\nYou will need to bring to interview original certificates of all qualifications and proof of identity.\r\n\r\nYou will be asked to complete a short exercise to demonstrate your ability to read effectively and communicate clearly and accurately in Standard English.\r\n\r\nIf you are successful at the partnership interview you will be offered a place.\r\n\r\nIf you accept, you will be recommended to a partner school as a prospective trainee.\r\n\r\nWhen a school is confirmed as the host school you should expect to be interviewed by the school, following its recruitment and selection processes.\r\n\r\nBefore commencing the programme you will sign a contract between you, the host school and the Partnership.\r\n\r\nYou will have had a satisfactory criminal background check and all other requisite checks will be carried out.\r\n\r\nFormal offers of SCITT places will be made by Kirklees & Calderdale SCITT and not by individual schools.\r\n","howSchoolPlacementsWork":"On our School Direct Programme, you will train across two school phases (KS1 and KS2) in at least two different schools, offering a range of different experiences. This will help to ensure you are fully prepared for the teaching profession. Due to our rigorous interview process which will tease out your strengths and unique qualities, we are able to carefully match you to school placements which will maximise and build on your existing skill base.\r\nTeaching time will be carefully built up over the first placement, where you will initially start by supporting groups of pupils until your confidence has grown and you are able to lead teaching sessions with individuals, groups and a whole class. Throughout this period; you will receive training and regular support with lesson planning and preparation, curriculum development and pedagogy. Your weekly sessions at the SCITT will allow you to reflect on your placement, progress and development. Your school-based mentor will further support your development at every step. \r\nA contrasting short placement is completed in the Spring term at an alternate school which enables our trainees to experience a breadth and depth of learning opportunities.\r\nWithin our School Direct programme, most trainees return to their first placement school for their final placement and this gives trainees an opportunity to build up their teaching to approximately 80% of the timetable ensuring that they teach all curriculum subject areas and complete the placement fully competent to move into the NQT year.\r\nThroughout all placements you will receive support from your school-based mentor, external support from your tutor and will have regular interface with your SCITT team.\r\n","personalQualities":"We are looking for trainees that:\r\n•\tDemonstrate enthusiasm and passionate about a teaching career\r\n•\tDemonstrate commitment and professionalism, with a love of learning\r\n•\tShow good communication with excellent interpersonal skills\r\n•\tEstablish effective working relationships and work as part of a team\r\n•\tUse own initiative and further own development\r\n•\tShow resilience and persistence when working under pressure\r\n•\tHave a thorough understanding of equality and diversity\r\n•\tDemonstrate reflective practice and a forward-facing outlook\r\nAlthough not essential recent school-based experience in school is desirable; however recent relevant experience of work with children, may be considered. \r\n","otherRequirements":"•\tSuccessful Interview\r\n•\tProof of address and ID\r\n•\tQualifications check\r\n•\tA health declaration check\r\n•\tAn enhanced DBS check\r\nHaving your own faith is not a requirement of this programme. Applications are welcomed from people of all faiths and no faith.\r\n","status":1,"createdAt":"2021-07-06T10:50:13.555Z","updatedAt":"2021-09-30T11:26:18.591Z","canSponsorStudentVisa":"no","cycle":"2024"}
