{"id":"ef2e4a43-538e-43f2-8180-2ef0287a8527","name":"Primary","code":"2YQN","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"b6345a7a-689b-4327-b99f-4b49383de91d","name":"The Beach","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"738ec0cb-f449-4ce9-b414-3f78a61c24b8","code":"2DT","name":"The Beach"},"accreditedBody":{"id":"be897ea1-5b41-4b40-8eaf-877a15ad688b","code":"S31","name":"Somerset SCITT Consortium"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"The School Direct training programme is for graduates who want to train as part of the school team; you will undertake the Autumn and summer term placement in one school and during the Spring term be placed in a contrasting school and year group within the Beach Teaching School Alliance  consortium. \r\n\r\nAll School Direct trainees will be required to complete a PGCE alongside their training; this is awarded by the University of Worcester. The majority of the Taught sessions are held at Dillington House.\r\n\r\nThe taught sessions are broken down into the following modules:\r\n\r\n*Pedagogy and Professional Practice\r\n*Subject Studies (English, Maths, Science, Foundation and cross- \r\n  curricular approaches)\r\n*Subject Specialist Research (Assessment)\r\n*School Experience\r\n\r\nThere will be a range of teaching, learning and assessment methods including lectures, workshops, peer group activities, seminars, directed reading, independent research, directed study, presentations, tutorials, fieldwork and use of both formative and summative assessment which draw upon evidence, reflection, analysis and evaluations. \r\n\r\nIn relation to teaching and learning strategies each modules will enable trainees to aspire to be autonomous learners; provide a programme which embraces key/transferable skills; disseminate good practice in learning and teaching; support  trainees of varying experiences, needs and backgrounds and monitor the quality of their experience.\r\nTrainees will be expected to develop critical and evaluative understanding of the processes and practice of effective learning through demonstration of knowledge, skills and understanding related to high quality and effective practice. trainees will develop a clear framework for their own professional values and demonstrate a critical and reflective attitude towards their practice, showing an articulation of the interdependent relationship of practice and theory.  ","interviewProcess":"Short listed applicants are invited to attend our virtual selection day.\r\n\r\nThis involves a children's book activity, interview, presentation, group activity and written reflective piece.  This is a thorough and rigorous procedure that enables us to ensure we select the very best trainees for our pupils.  \r\n\r\nThe process is also an opportunity for you to find out more about Bournville Primary School and Somerset SCITT, to ensure that we are the best provider to support you in becoming an expert teacher. ","howSchoolPlacementsWork":"The School Direct training programme is for graduates who want to train as part of the school team;\r\nyou will undertake the Autumn and summer term placement in one school and during the Spring term be placed in a contrasting school and year group within the partner consortium. \r\nThe course runs in line with the school terms in Somerset. \r\n\r\nYou will attend a minimum of 45 training days.","personalQualities":"We believe that good teachers make a crucial difference to children’s outcomes and well being and so we are looking for people who can inspire and motivate young learners.\r\n\r\nWe are looking for people who have a passion and commitment to become the best teacher they can be. \r\n\r\nWe are dedicated to making a difference and our impact-focused provision seeks to inspire trainees to inspire the pupils they teach. ","otherRequirements":"You will be asked to complete an application for Declaration and Barring Service (DBS) check and will require appropriate ID and documents for this.\r\n\r\nYou will be asked to complete an Occupational Health form/self-declaration about your fitness and wellness to teach.\r\n\r\nYou have a strong commitment to Early Years/Primary education and have spent time working (either paid or on a voluntary capacity) in a primary school setting.","status":1,"createdAt":"2021-07-06T10:46:52.630Z","updatedAt":"2021-10-04T10:54:26.420Z","canSponsorStudentVisa":"no","cycle":"2024"}
