{"id":"2891d7cf-8716-4c4c-9eab-625586275f0a","name":"Physics","code":"F3XX","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"bf97cd0a-224c-43d3-a021-84143df13e8d","code":"F3","name":"Physics"}],"locations":[{"id":"2d4f8dcf-0f5a-43da-ab18-5328db115510","name":"Hendon Campus","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"9188f17a-79c4-43a9-b459-4952815b739a","code":"M80","name":"Middlesex University"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":12500,"financialSupport":"At Middlesex, we understand that many of our students may experience financial difficulties. We offer our students a wide variety of additional financial support options to help them fund or part-fund their education.\r\nFor further information, see; \r\n[www.mdx.ac.uk](https://unihub.mdx.ac.uk/support/fees-payments-funding/financial-support)\r\n","aboutCourse":"For further information, see\r\n[mdx.ac.uk](https://www.mdx.ac.uk/courses/postgraduate-with-physics)\r\nThe Secondary Science PGCE at Middlesex has excellent attainment outcomes for students, producing graduates who by the end of their training, have had the opportunities and experiences to equip them fully for a career in teaching and in all cases the clear potential to become good or outstanding teachers of secondary science. The emphasis of the course from the beginning is to develop a notion of professionalism as related to science teaching. Trainees reflect on their own personal values and learn the importance of teamwork and developing positive working relationships with their colleagues and with pupils. This work is then linked to developing their understanding of the nature of science and a rationale for its place in the curriculum. The course is then carefully structured to enable trainees to develop their knowledge and skills both across the science curriculum and in their specialist science subject. Throughout the training there is continuous and systematic review of professional development and subject knowledge development is a key feature of the course, linked to individual development plans. The experience and subject expertise of university-based tutors ensures that the training draws upon the most relevant and best-informed practice available and is enhanced effectively by the contribution of science specialists from our partner schools and from professional bodies in science such as the Institute of Physics, the Royal Society of Chemistry, The Zoological Society of London and the Association of Science Education. \r\n\r\n\r\n","interviewProcess":"Entry onto this course requires an interview. We use the interview to find out more about you, to better understand your aspirations and  interests in teaching, and to explore why you want to study with us. At the interview stage, your suitability for teaching will be judged, including your subject knowledge for teaching and potential to demonstrate proficiency with fundamental English and mathematics. If any shortfall is identified, you may be required to complete some additional work before starting the programme. During the programme, your subject knowledge and fundamental English and mathematics will be developed and assessed to ensure you reach the required level.The interview process is likely to include a presentation, group discussion, reading and writing tasks to probe subject knowledge, and an individual face-to-face interview. Tutors will use the process to make judgements about your potential to be trained as a teacher in your chosen subject area and your suitability to work with children.","howSchoolPlacementsWork":"The course has been designed to include 120 days of school-based training. This includes placements in a minimum of two secondary schools, selected carefully so that you experience different approaches to school management and organisation as well as varied teaching and learning styles. You will teach classes across the 11-16 age range and have the opportunity for post 16 enhancement.  Each placement provides a sustained teaching experience with a gradual increase in responsibility for planning, teaching and assessment. Within the placements, you will be supported by school-based mentors as well as your University Tutor. You may also have the opportunity to have a placement at an alternative learning environment such as a pupil referral unit, Special Needs School or museum. The Middlesex ITT Partnership extends across Greater London and also includes some schools in neighbouring local authorities, such as Hertfordshire.","personalQualities":"To strengthen applications it is recommended that you have obtained, or have set up to obtain, recent and relevant experience within state secondary school settings in England.","otherRequirements":"\r\nYou must  be judged suitable to work with children after being subject to a Disclosure and Barring Service enhanced disclosure check and other required background checks. Please see;\r\n[www.mdx.ac.uk](https://www.mdx.ac.uk/courses/next-steps-your-dbs-check)\r\n","status":1,"createdAt":"2021-07-06T10:46:49.852Z","updatedAt":"2021-10-05T17:20:36.382Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
