{"id":"33b877b2-c2d1-4b70-8dd8-f3d698baff71","name":"Primary","code":"X100","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"2d4f8dcf-0f5a-43da-ab18-5328db115510","name":"Hendon Campus","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"9188f17a-79c4-43a9-b459-4952815b739a","code":"M80","name":"Middlesex University"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":12500,"financialSupport":"At Middlesex, we understand that many of our students may experience financial difficulties. We offer our students a wide variety of additional financial support options to help them fund or part-fund their education.\r\nFor further information, see; \r\n[www.mdx.ac.uk](https://unihub.mdx.ac.uk/support/fees-payments-funding/financial-support)\r\n","aboutCourse":"For more information, see \r\n[mdx.ac.uk](https://www.mdx.ac.uk/courses/postgraduate/primary-education-with-qts)\r\n\r\nTeaching in a primary school is one of the most rewarding careers you can have. \r\nThe PGCE Primary Education programme at Middlesex seeks to provide each trainee with the skills needed to become an outstanding teacher. Typically Middlesex primary trainees become confident and creative teachers, characterised by their reflective and inclusive practice.\r\nYour studies prepare you for a career in teaching children aged 5 to 11. Working with a team of expert tutors and experienced teachers the course ensures you are well supported to achieve the highest standards.\r\n\r\nThrough tutorials, lectures, practical workshops and educational field trips, this one-year full-time course enables you to meet the Teachers’ Standards.\r\n\r\nWe have an extensive partnership with schools across London, and during the programme you will undertake practical teaching placements in at least two primary schools where you will have the chance to acquire practical skills in teaching and learning. Experienced teachers and mentors from our partner schools, alongside personal tutors at the university, support you throughout your placement to ensure you develop and progress your teaching skills. We also offer enrichment placements in Special Schools for those students who wish to extend their skills and expertise for working with children who have special educational needs.\r\n\r\n\r\nFor more information, see \r\n\r\n[mdx.ac.uk](https://www.mdx.ac.uk/courses/postgraduate/primary-education-with-qts)\r\n\r\n\r\n\r\n\r\n\r\n","interviewProcess":"Entry onto this course requires an interview. We use the interview to find out more about you, to better understand your aspirations and  interests in teaching, and to explore why you want to study with us. At the interview stage, your suitability for teaching will be judged, including your subject knowledge for teaching and potential to demonstrate proficiency with fundamental English and mathematics. If any shortfall is identified, you may be required to complete some additional work before starting the programme. During the programme, your subject knowledge and fundamental English and mathematics will be developed and assessed to ensure you reach the required level. During the programme, your competency in these areas will be developed to ensure you reach the required level.The interview process is likely to include a presentation, group discussion and an individual face-to-face meeting. Tutors will use the process to make judgements about your potential to be trained as a primary teacher and your suitability to work with children.","howSchoolPlacementsWork":"The course has been designed to include 120 days of school-based training. This includes placements in a minimum of two primary schools, selected carefully so that you experience different approaches to school management and organisation as well as varied teaching and learning styles. You will teach classes across the 5-11 age range. Each placement provides a sustained teaching experience with a gradual increase in responsibility for planning, teaching and assessment. Within the placements, you will be supported by school-based mentors as well as your University Tutor. You may also have the opportunity to have a third placement at a Special Needs School. The Middlesex ITT Partnership extends across Greater London and also includes some schools in neighbouring local authorities, such as Hertfordshire.","personalQualities":"To strengthen applications it is recommended that you have obtained, or have set up to obtain, recent and relevant experience within state primary school settings in England.","otherRequirements":"\r\nYou must  be judged suitable to work with children after being subject to a Disclosure and Barring Service enhanced disclosure check and other required background checks. Please see;\r\n[www.mdx.ac.uk](https://www.mdx.ac.uk/courses/next-steps-your-dbs-check)\r\n","status":1,"createdAt":"2021-07-06T10:46:49.987Z","updatedAt":"2021-10-05T17:21:34.973Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
