{"id":"41f76b8b-fe4c-4950-854c-75ec0fb69d18","name":"Primary","code":"Z817","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"TA","fundingType":"apprenticeship","studyMode":"F","ageRange":"3_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"f1099756-13e3-4278-a5ce-27086569b938","name":"Cannon Lane Primary School","isPublished":"N","status":"N","vacancies":"F"},{"id":"0c5281e3-0549-4d91-8022-daac37db5cc7","name":"Our Lady of Lourdes Catholic Primary School","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"9188f17a-79c4-43a9-b459-4952815b739a","code":"M80","name":"Middlesex University"},"degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","aboutCourse":"For more information, see; \r\n[mdx.ac.uk](https://www.mdx.ac.uk/courses/degree-apprenticeships/postgraduate-teacher-apprenticeship-qts)\r\n\r\nWe are offering a very limited number of Teacher Apprenticeships at the locations (schools) detailed under locations. The places will fill quickly so please be aware that the availability of vacant positions might change during the application processing period. In your application, please identify the school location of interest to you.\r\n\r\nWe also offer Teacher Apprenticeships through our School Direct alliance partners who have their own course listings.\r\n\r\nThis programme provides opportunity for study at Masters level through a PGCert which has been designed to complement employment-based initial teacher training routes.\r\n\r\nTeaching in a primary school is one of the most rewarding careers you can have. The Primary Postgraduate Teacher Apprenticeship programme seeks to provide each apprentice with the skills needed to become an effective teacher. Typically Middlesex primary trainees become confident and creative teachers, characterised by their reflective and inclusive practice.\r\n\r\nYour training will be largely school-based at your employing school and will prepare you to teach across children across the 3-7 or 5-11 age range. Working with a team of experienced teachers and specialists in primary education, the course ensures you are well supported to achieve the highest standards.\r\n\r\nThis is an employment-based programme and your learning and development will be planned through both on-the job and off-the-job training.  You will have a dedicated mentor in the school setting who will facilitate your school-based training and support you with your teaching work. The off-the-job training will be provided through a combination of learning at university, school-based training and independent study. Through tutorials, lectures, practical workshops,  educational field trips and school-based training, this full-time course enables you to meet the Teachers’ Standards and be recommended for QTS.\r\n.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n","interviewProcess":"Entry onto this course requires an interview with the employing school. The interview process is designed to find out more about you, to better understand your aspirations and  interests in teaching. Your potential and and suitability for teaching will be judged, including your subject knowledge for teaching and potential to demonstrate proficiency with fundamental English and mathematics. If any shortfall is identified, you may be required to complete some additional work before starting the programme. During the programme, your subject knowledge and fundamental English and mathematics will be developed and assessed to ensure you can reach the required level. The interview process might include observations of how you interact with children and colleagues and is likely to include a presentation, group discussion and an individual face-to-face meeting.\r\n","howSchoolPlacementsWork":"The apprenticeship is mainly school-based and offered by a number of our partnership schools. We work very closely with our partnership schools to assure quality and consistency across the Middlesex Partnership. You will also spend one half term working in a  different school setting so that you experience different approaches to school management and organisation as well as varied teaching and learning styles. You will teach classes across either the 5-11 age range or 3-7 age range. You will have opportunities for sustained teaching experience with a gradual increase in responsibility for planning, teaching and assessment. This will be bespoke to your training needs and prior experience. In the school setting, you will be supported by a school-based mentor as well as your University Tutor. ","personalQualities":"To strengthen applications it is recommended that you have obtained, or have set up to obtain, recent and relevant experience within state primary school settings in England.","otherRequirements":"You must  be judged suitable to work with children after being subject to a Disclosure and Barring Service enhanced disclosure check and other required background checks. These checks will be arranged by the employing school.\r\n","status":2,"createdAt":"2021-07-06T10:46:50.024Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024"}
