{"id":"8259aea6-6f9e-4081-a75d-3e8a009b0452","name":"Geography (with Humanities)","code":"38ZF","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"5a3609a0-5bbb-4377-b919-5d89932ab622","code":"V1","name":"History"},{"id":"3f47e67b-7fa5-4947-a5a0-74d528cd2a87","code":"F8","name":"Geography"}],"locations":[{"id":"2d4f8dcf-0f5a-43da-ab18-5328db115510","name":"Hendon Campus","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"9188f17a-79c4-43a9-b459-4952815b739a","code":"M80","name":"Middlesex University"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":12500,"financialSupport":"At Middlesex, we understand that many of our students may experience financial difficulties. We offer our students a wide variety of additional financial support options to help them fund or part-fund their education.\r\nFor further information, see; \r\n[www.mdx.ac.uk](https://unihub.mdx.ac.uk/support/fees-payments-funding/financial-support)\r\n","aboutCourse":"For more information, see\r\n[mdx.ac.uk](https://www.mdx.ac.uk/courses/postgraduate/secondary-geography-humanities)\r\nThe humanities comprise a range of subjects (including history, geography, RE and citizenship) which together enrich our understanding of human behaviour and our interactions with the world around us. Together they help students to understand the world in which they live, how it has come to be and what it could end up being. Individually each subject provides unique approaches, skills, and concepts to shape this understanding.\r\nThe Geography with Humanities course at Middlesex University is designed to ensure trainee teachers have a grounding and appreciation of the particular aspects and disciplines of their chosen subject specialism, while understanding the unique aspects of other subject areas across the humanities spectrum.\r\nAlthough individual humanities subjects are clearly separate and distinct it is important to understand that they share much in common and there is much to be gained from learning about effective teaching and learning across the humanities, and especially between history and geography. Therefore the course has been designed to support you in becoming a skilled geographer, enabling you to develop your confidence in your chosen subject specialism, while giving you the skills to teach across other humanities areas. In the long run this will make you both a better and more employable teacher.\r\n\r\n\r\n\r\n\r\n","interviewProcess":"Entry onto this course requires an interview. We use the interview to find out more about you, to better understand your aspirations and  interests in teaching, and to explore why you want to study with us. At the interview stage, your suitability for teaching will be judged, including your subject knowledge for teaching and potential to demonstrate proficiency with fundamental English and mathematics. If any shortfall is identified, you may be required to complete some additional work before starting the programme. During the programme, your subject knowledge and fundamental English and mathematics will be developed and assessed to ensure you reach the required level.The interview process is likely to include a presentation, group discussion, reading and writing tasks to probe subject knowledge, and an individual face-to-face interview. Tutors will use the process to make judgements about your potential to be trained as a teacher in your chosen subject area and your suitability to work with children.","howSchoolPlacementsWork":"The training course has been designed to include 120 days of school-based training. This includes placements in two secondary schools, selected carefully so that you experience different approaches to school management and organisation as well as varied teaching and learning styles. You will teach classes across the 11-16 age range and have the opportunity for post 16 enhancement. Each placement provides a sustained teaching experience with a gradual increase in responsibility for planning, teaching and assessment. Within the placements, you will be supported by school-based mentors as well as your University Tutor. You will also have the opportunity to have a placement at an alternative learning environment such as a pupil referral unit, Special Needs School or museum. The Middlesex ITT Partnership extends across Greater London and also includes some schools in neighbouring local authorities, such as Hertfordshire.","personalQualities":"To strengthen applications it is recommended that you have obtained, or have set up to obtain, recent and relevant experience within state secondary school settings in England.","otherRequirements":"\r\nYou must  be judged suitable to work with children after being subject to a Disclosure and Barring Service enhanced disclosure check and other required background checks. Please see;\r\n[www.mdx.ac.uk](https://www.mdx.ac.uk/courses/next-steps-your-dbs-check)\r\n","status":1,"createdAt":"2021-07-06T10:46:49.722Z","updatedAt":"2021-10-05T17:17:15.329Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
