{"id":"b13143b5-4df5-418d-9081-565389cd206e","name":"Mathematics","code":"G1X1","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"72345aa7-096c-488f-8649-085b8178cadb","code":"G1","name":"Mathematics"}],"locations":[{"id":"2d4f8dcf-0f5a-43da-ab18-5328db115510","name":"Hendon Campus","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"9188f17a-79c4-43a9-b459-4952815b739a","code":"M80","name":"Middlesex University"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":12500,"financialSupport":"At Middlesex, we understand that many of our students may experience financial difficulties. We offer our students a wide variety of additional financial support options to help them fund or part-fund their education.\r\nFor further information, see; \r\n[www.mdx.ac.uk](https://unihub.mdx.ac.uk/support/fees-payments-funding/financial-support)\r\n","aboutCourse":"For further information, see\r\n[mdx.ac.uk](https://www.mdx.ac.uk/courses/postgraduate/mathematics)\r\n\r\nIf a child writes 3 + 4 = 12, then this could mean, that the child doesn’t understand maths symbols or is prone to not reading carefully or this child could have more mathematics knowledge then you would expect for that age as that answer could also be mathematically correct.  This course helps you to discern the abilities of the learner. \r\nCombining theory and practice, you will comprehensively investigate the structure of the mathematics curriculum, considering numbers and algebra, shape, space and measures, and handling data. You will be encouraged to provide evidence of your own development in teaching and learning.\r\nUnder the guidance of our team of experts, students become involved in designing, producing, teaching and evaluating a range of materials currently used to support Mathematics in the secondary school.\r\nWe have excellent relationships with schools in London, and bordering authorities such as Hertfordshire. During your studies, you will have the opportunity to undertake teaching placements in at least two secondary schools, allowing you the chance to acquire skills in the application of new technologies in teaching and learning. Schools are carefully selected to suit each individual and expose them to a wide variety of imaginative and thought provoking learning strategies. Key experts from our partner schools will always be on hand to offer invaluable mentoring and support.\r\n\r\n\r\n\r\n\r\n","interviewProcess":"Entry onto this course requires an interview. We use the interview to find out more about you, to better understand your aspirations and  interests in teaching, and to explore why you want to study with us. At the interview stage, your suitability for teaching will be judged, including your subject knowledge for teaching and potential to demonstrate proficiency with fundamental English and mathematics. If any shortfall is identified, you may be required to complete some additional work before starting the programme. During the programme, your subject knowledge and fundamental English and mathematics will be developed and assessed to ensure you reach the required level.The interview process is likely to include a presentation, group discussion, reading and writing tasks to probe subject knowledge, and an individual face-to-face interview. Tutors will use the process to make judgements about your potential to be trained as a teacher in your chosen subject area and your suitability to work with children.","howSchoolPlacementsWork":"The course is designed to include 120 days of school-based training. This includes placements in a minimum of two secondary schools, selected carefully so that you experience different approaches to school management and organisation as well as varied teaching and learning styles. You will teach classes across the 11-16 age range and have the opportunity for post 16 enhancement.  Each placement provides a sustained teaching experience with a gradual increase in responsibility for planning, teaching and assessment. Within the placements, you will be supported by school-based mentors as well as your University Tutor. You may also have the opportunity to have a placement at an alternative learning environment such as a pupil referral unit, Special Needs School or museum. The Middlesex ITT Partnership extends across Greater London and also includes some schools in neighbouring local authorities, such as Hertfordshire.","personalQualities":"To strengthen applications it is recommended that you have obtained, or have set up to obtain, recent and relevant experience within state secondary school settings in England.","otherRequirements":"\r\nYou must  be judged suitable to work with children after being subject to a Disclosure and Barring Service enhanced disclosure check and other required background checks. Please see;\r\n[www.mdx.ac.uk](https://www.mdx.ac.uk/courses/next-steps-your-dbs-check)\r\n","status":1,"createdAt":"2021-07-06T10:46:49.883Z","updatedAt":"2021-10-05T17:19:42.317Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
