{"id":"165d4340-8459-4783-bd3c-294e91ff7ce5","name":"Primary","code":"26H6","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"22f4d060-3629-4c3e-b847-7134e42e47e9","name":"Main Site","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"f7a98beb-5743-422f-972b-cf4fc4be420a","code":"1PN","name":"Holmes Chapel Comprehensive School"},"accreditedBody":{"id":"812b70c4-7fc4-46fc-975b-3e4d00f77dc4","code":"M40","name":"The Manchester Metropolitan University"},"profPost":"PG","english":"3","maths":"3","science":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feeDetails":"Tuition fees are £9,250 and you can apply for a loan to cover these fees and/ or means tested maintenance grant via the student loan company.\r\n\r\nThere are a range of bursaries and scholarships available and their value by phase, subject and degree classification can be found by visiting the Department of Education website: \r\n\r\n[Bursaries and scholarships](https://getintoteaching.education.gov.uk/funding-and-salary/overview)\r\n","aboutCourse":"By joining the School Direct PGCE programme at Holmes Chapel Comprehensive School in partnership with MMU Faculty of Education you will be able to benefit from: an up to date programme that incorporates the QTS Standards. \r\n\r\nThis course will equip you with the skills to teach the KS1 and KS2 curriculum (children aged from 5-11 years). You will also focus on: \r\nCore subjects and Foundation Subjects which will include; English, Maths and Science. \r\n\r\nAll trainee teachers are required to teach in two consecutive key stages. \r\n\r\nBefore being awarded qualified teacher status, trainee teachers must demonstrate personal competence in a range of information and communications technologies, including word processing, spreadsheets, data bases and email. It will be of benefit to you if you have acquired these skills before starting the course. \r\n\r\n","interviewProcess":"The assessment day will involve a range of activities including a classroom based activity, teaching a lesson followed by an interview with a representative of colleagues from our alliance schools. You will complete a number of written based tasks. Our University partner will have an equal say in the selection. \r\nIt is a rigorous and thorough selection process, designed to recruit the very best candidates and ultimately trainee teachers for our students. \r\n\r\n\r\nAll interviewers will consider the following: \r\n\r\n-Your communication skills \r\n- Commitment and resilience to teacher training \r\n- Knowledge and understanding of the qualities of a teacher \r\n- Your ability to reflect and evaluate your own practice and the practice of others \r\n- Personal qualities and knowledge and understanding of the qualities of a teacher \r\n- Your subject knowledge \r\n- Your ability to interact with both adults and young people \r\n\r\n","howSchoolPlacementsWork":"You will complete two primary school placements and will be allocated to one of the schools in the Chimney House Teaching School Alliance or its associates in the autumn and summer term. In the spring term you will be allocated to a different school within the Alliance. \r\n\r\n\r\nAll of the schools in our Alliance have comprehensive intakes and you will get experience of working with young people of all abilities. You will also complete a secondary school experience to give you the experience of working with learners in all phases and contexts. \r\n\r\n\r\nOur primary School Direct places will take place in two of the following schools: \r\n- Alsager Highfields Community Primary School \r\n- Brereton Primary School \r\n- Excalibur Primary School \r\n- Holmes Chapel County Primary School \r\n- Middlewich Primary \r\n- Pikemere County Primary School \r\n- St Gabriels Catholic Primary School \r\n- The Dingle \r\n\r\n\r\n\r\nThe first placement will start early September and involves teaching practice in school each week, with a number of Professional Study/ Training Days over the year. The conferences are planned and delivered by outstanding classroom practitioners from colleagues within our Teaching School Alliance \r\n\r\n\r\nYou will have full access to the facilities of The Manchester Metropolitan University, which has national recognition for its high quality Initial Teacher Training provision. The majority of your time will be school based but there are a number of days where you will be based at the University, far reduced compared to a traditional PGCE. \r\n\r\n","personalQualities":"We are looking for ambitious, energetic, dedicated, well-qualified, independent and enthusiastic trainee teachers who are passionate about their subject and have the desire, drive and commitment to inspire all abilities in the secondary age range. Successful applicants will have an understanding of the resilience and emotional intelligence needed to become an outstanding teacher and future leader and to be reflective learners. We are looking for applicants who have excellent subject knowledge and the ability to deliver it in an engaging and creative way to inspire learning. It is key to be an effective communicator and a responsible, accountable professional.","otherRequirements":"* A satisfactory DBS check, including a check of the children`s barred list.\r\n* An academic reference which is very positive in terms of academic achievement and highly recommends the applicant for a career into teaching. The reference should confirm the person's suitability to work with children, as well as their personal qualities and attributes.\r\n* Health check - all candidates should be medically fit\r\n* School experience is not a requirement for entry to the course, however successful candidates will demonstrate an understanding of teaching and learning within an appropriate educational context.\r\n","status":2,"createdAt":"2021-07-06T10:50:35.849Z","canSponsorStudentVisa":"yes","cycle":"2024"}
