{"id":"d8337e2f-cffb-43ef-8cdd-20ffcc7e15b8","name":"Primary","code":"34Z9","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"c5c894e8-4244-45d2-9db9-f02e637cdaa1","name":"The Bay CE School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"c801c7dd-8bf1-46f6-b176-25230bbf229a","code":"1XF","name":"The Bay Church of England Primary"},"accreditedBody":{"id":"3f5b1139-3651-4ee5-845c-54cd9e999b08","code":"C58","name":"University of Chichester"},"profPost":"BO","degreeGrade":"9","english":"1","maths":"1","science":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"equivalencytesting.com","courseLength":"OneYear","feesUK":9250,"feesInternational":9250,"feeDetails":"The course fees for 2020/2021 are as follows:\r\n\r\nUK students\t\t\t\t£9,250\r\nEU students\t\t\t\t£9,250\r\n","financialSupport":"You may be eligible for a loan while you study (https://getintoteaching.education.gov.uk/funding-my-teacher-training/tuition-fee-and-maintenance-loans)\r\n\r\nFind out about financial support if you’re from outside the UK\r\n(https://getintoteaching.education.gov.uk/explore-my-options/overseas-graduates)\r\n \r\n","aboutCourse":"We are delighted to be part of the School Direct Teacher Training Programme and look forward to working with trainees who are enthusiastic about a career within the classroom. We firmly believe that it is an excellent way to learn and qualify to become a teacher. The School Direct Programme is a unique, employment-based route into teacher training, available to high-quality graduates with some experience within a school environment.\r\nEvery student is allocated a mentor who is a highly-experienced teacher and will offer personalised support throughout the year. Weekly meetings will focus on targets (short and long-term) as well as reviewing your progress. You will attend staff meetings and school training sessions and feel a valued member of the team. As your confidence grows, you will deliver parts of lessons on your own, taking on more responsibility until you are teaching full lessons. \r\nYou will be assigned a host school for the autumn and summer term and in the spring you will spend a minimum of 6 weeks in another school to gain experience within a different key stage. \r\nThe training programme will build your confidence and subject knowledge and give you the necessary skills to become an effective classroom practitioner. \r\nWe are extremely proud that we have a strong track record and 100% of our School Direct trainees have passed this course and subsequently found employment within schools on the island. \r\n","interviewProcess":"Your application is important to us and we will carefully consider you for interview. We host our interviews in school involving key staff throughout the process. We particularly look for applicants who show a particular passion and aptitude for teaching bringing relevant additional experience. \r\nYou will be asked to complete a written task and work with a small group of children for a short while so that you can be observed. We look at how you interact with the pupils and your potential to teach and engage with them.\r\nIf your interview is successful, you will be invited to an induction day to meet other successful candidates\r\n","howSchoolPlacementsWork":"Main placement: This is the school in which the trainee will spend most of their time throughout the year. By remaining with the same class for the majority of the year, trainees develop a secure understanding of pupils’ progress over time, how this is tracked and used to inform future teaching. \r\n\r\nSecond placement: This usually takes place in the first half of the spring term and gives trainees an opportunity to experience a contrasting setting within a different key stage.\r\n","personalQualities":"Our aim is to recruit individuals who can:\r\n\r\n•\tBe ambitious, showing resilience and perseverance\r\n•\tBe inspirational and passionate about children and their learning\r\n•\tDemonstrate good subject knowledge, particularly in Maths and \r\n        English\r\n•\tSupport the school values, attitudes and ethos of all partner schools\r\n•\tHave a real enthusiasm for engaging with young people and form \r\n        positive relationships \r\n•\tWork well under pressure and manage time effectively \r\n","otherRequirements":"\r\n","status":1,"createdAt":"2021-07-06T10:53:33.961Z","updatedAt":"2021-10-05T09:32:37.358Z","canSponsorStudentVisa":"yes","cycle":"2024"}
