{"id":"d6ade4e7-776e-4277-9e3b-c8a37af6468e","name":"Modern Languages German","code":"AJ06","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"other","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"ce8523ef-9236-4cd9-b260-d826c7a521b3","code":"ML","name":"Modern Languages"},{"id":"fbb00c08-2dbc-4f26-adb3-3b23afba18c1","code":"17","name":"German"}],"locations":[{"id":"1074b511-4882-4644-8a7f-06a183836569","name":"Brampton Manor Academy","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"f0bb05af-bedd-48ed-a89d-80f805ff576e","code":"MB8","name":"Brampton Manor Academy"},"accreditedBody":{"id":"720894da-360a-4f7a-9835-7ce7beb3c6de","code":"L59","name":"Teaching London: LDBS SCITT"},"profPost":"PG","english":"3","maths":"3","science":"9","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feeDetails":"Trainees are responsible for paying the £9,250 tuition fee for the course. Trainees are generally eligible for maintenance and tuition fee loans, but this should be clarified with Student Finance. In addition, depending on your degree class and the subject you are training to teach, you may be eligible for a bursary. You will also be eligible for other benefits such as student travel/oyster card, student discounts and exemption from paying council tax.","aboutCourse":"You will attend centre-based training in Kilburn one day per week, with additional visits to alternative schools. Taught sessions are wide-ranging and thorough, ensuring that you have the confidence and competence to plan and teach creatively to meet the needs of all pupils. Tutors are experts in their field, offering informative and practical sessions which you can immediately apply to your own classroom practice. Sessions include:\r\n\r\n* Subject knowledge and related pedagogy\r\n* Child development\r\n* Theories of learning\r\n* Assessment and Planning\r\n* Special educational needs and disability (SEND)\r\n* English as an additional language (EAL)\r\n* Safeguarding\r\n* Behaviour for Learning\r\n* Academic Studies for the PGCE\r\n* Developing a working knowledge the National Curriculum (NC) as well as an appreciation of the age phases before and after the ones in which they are training \r\n* Voice coaching and classroom presence\r\n\r\nYou also have one focus week:\r\n\r\n* ‘SEND Week’: developing increasing awareness of aspects of SEND and how to provide an inclusive learning environment\r\n\r\n\r\nYou spend 4 days per week in your base school. A second, 6 week, placement is undertaken in a contrasting setting and age phase. There is also the opportunity to apply for an enhancement placement in a SEND setting. \r\n\r\nYou will be observed teaching each week and targets set by your school based Mentor. You will also be visited by a Teaching London Link Tutor, and keep teaching files and evidence of your progress. You take on increasing responsibility for planning and teaching, up to 80% by the Summer Term. To be awarded Qualified Teacher Status (QTS), your progress towards meeting the Teachers’ Standards is assessed at 6 review points across the year.\r\n\r\nTo be awarded Post Graduate Certificate in Education (PGCE), you need to pass two written assignments at Master’s Level. Classroom-based research for the first assignment is carried out during the Autumn Term and submitted at the beginning of Spring. Classroom-based research for the second assignment is carried out during the Spring 2 term and submitted at the beginning of Summer. There is also a presentation for this assignment in Spring.\r\n","interviewProcess":"Successful candidates will be invited to interview by the Lead School. Interviews are conducted by the Headteachers of the Lead and Partnership School and a representative of Teaching London.\r\n\r\nThe interview:\r\n\r\n* You will be required to plan and teach a short lesson for a given topic and selected age group. You will be observed to assess your potential for working with children.\r\n* You will also be required to undertake a formal Interview with the panel\r\n* You will complete maths and English tasks. \r\n\r\nAll elements of the interview process are used to establish candidates’ suitability and potential for ITT. Outcomes for successful candidates are used to inform initial targets in preparation for their training year.\r\n","howSchoolPlacementsWork":"Candidates apply to the Lead school but you could be placed in any of the schools within that partnership, in negotiation between you and the School. Second placements are selected by the Lead school and Teaching London to ensure that you have experience of a contrasting age phase and setting. We aim to ensure that trainees do not have to travel for longer than an hour to their placement schools.\r\n\r\nYou will undertake placements across KS3 and KS4 (11-16).\r\n\r\nTrainees will have two placements in mainstream schools, with the possible option of an enhancement placement in an SEND setting. Trainees spend the Autumn term, Spring 2 and the Summer term in their base school. Trainees spend Spring 1 in their second placement school (6 weeks).","personalQualities":"We are looking to recruit high calibre candidates who have the values, qualities and attributes needed to become Outstanding teachers, with the drive and motivation to succeed.\r\n\r\nWe are looking for candidates who:\r\n\r\n- Are passionate about making a difference to the lives and development of their pupils\r\n- Have a positive outlook\r\n- Are patient and adaptable\r\n- Have good interpersonal skills\r\n- Are friendly and approachable\r\n- Are passionate about teaching\r\n- Are creative and imaginative\r\n- Have good organisational skills and excellent time management\r\n- Are reflective and strive to improve their own practice\r\n","otherRequirements":"Successful applicants will be made a conditional offer, based on them meeting at least the following standard conditions:\r\n\r\n* a satisfactory Enhanced Disclosure Barring Service (DBS) check\r\n* a satisfactory Criminal Record Check abroad for relevant countries where the applicant has spent more than 4 weeks travelling or working abroad\r\n* a satisfactory “Fitness to teach check”\r\n\r\nIf you are not a British national, you must ensure via UK Visas and Immigration that you are eligible to work and study in the UK and, if necessary, have received any required visas or permits before training begins.\r\n","status":2,"createdAt":"2021-07-06T10:54:14.126Z","canSponsorStudentVisa":"no","cycle":"2024","applicationsOpenDateOther":"2021-10-25T00:00:00.000Z"}
