{"id":"46b12480-144a-43a3-b906-aef334c62d89","name":"Primary","code":"22XK","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"150c608f-666b-4fb8-9340-01f2c2fed986","name":"University of East Anglia","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"a0b888f7-429d-4021-8fd9-6ad1c301136c","code":"1A5","name":"Sheringham Community Primary School Partnership"},"accreditedBody":{"id":"b8bcaeed-f311-4867-a1e3-c0fde20809d6","code":"E14","name":"University of East Anglia"},"profPost":"PG","english":"1","maths":"1","science":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"38 weeks","feesUK":9250,"feesInternational":19800,"financialSupport":"Find out more about the Financial Support available within our [Essential Information section of each Primary PGCE course](https://www.uea.ac.uk/education/pgce/primary )","aboutCourse":"Our 38-week, full-time PGCE Primary programme will prepare you to become a general class teacher. You’ll be working with children to motivate, inspire and challenge them in their learning.\r\n\r\nThe programme comprises of 120 placement days in schools and taught sessions at UEA.  Our course will help you to gain a thorough understanding of how schools work and fully prepare you for first teaching post after successful completion of the training programme.\r\n\r\nFor your school placements, you will be placed in schools in our School Direct Partnership, where you will work with primary age pupils. You will have two main school placements in contrasting schools, in different age ranges, based on your chosen training pathway.  \r\n\r\nUpon successful completion of your PGCE, you will graduate with Qualified Teacher Status (QTS) and 90 Master’s credits.\r\n\r\nBeing a school direct trainee with us will mean that you know where your main school placement and who your mentor is before the summer holiday.  There is no paired placement with Sheringham's school direct route and you spend a higher percentage of your time in one school allowing deeper relationships with the school and children to develop.  Although we are based in North Norfolk we have partnership schools across the county where you may complete your training depending on your home location.\r\n\r\n[Find out more about our School Direct courses](https://www.uea.ac.uk/education/pgce/school-direct) and the [Primary PGCE programme at UEA](https://www.uea.ac.uk/education/pgce/primary)\r\n","interviewProcess":"Interviews are part of the formal selection process. You will need to present yourself well, come prepared, and dress smartly. Your interview day will include:\r\n\r\n* An introductory talk and tour of the school\r\n* An individual interview\r\n* A written task\r\n* Working with small groups of pupils\r\n\r\nYou may also be asked to complete other relevant tasks such as:\r\n\r\n* Giving a presentation\r\n* A group interview\r\n* Literacy, numeracy and subject knowledge questions \r\n\r\n","howSchoolPlacementsWork":"UEA’s PGCE Primary school direct programme places great emphasis on practical skills and the realities of classroom teaching.\r\n\r\nYou will be based in schools two-thirds of the 38-week programme (120 days). \r\n\r\nYou’ll gain experience from two main school placements and teach primarily in two age bands within your chosen age range specialism. The placements are in contrasting schools to give you a breadth of school-based experience. \r\n\r\nDuring the two extensive placements in our partnership schools, you’ll gain a broad range of practical teaching experience. You will learn to put ideas and theory into practice as you work in university and your placement schools.\r\n","personalQualities":"Trainees are selected on the basis of their application form, references and an interview. You are encouraged to prepare thoroughly.\r\n\r\nApplication forms should demonstrate strengths in subject and curriculum knowledge, your enthusiasm and commitment to a career in teaching, and the age range for which you have applied.\r\n\r\nWe need to see that you are passionate about a career in teaching and show the resilience to persevere.","otherRequirements":"Prior to submitting your application, we recommend you gain some observational experience in a classroom environment if possible. This will help you gain an up-to-date understanding of how classrooms are managed and how teaching and learning takes place.\r\n\r\nApplicants must also obtain:\r\n* An Enhanced Criminal Records check from the [Disclosure and Barring Service](https://www.gov.uk/government/organisations/disclosure-and-barring-service) \r\n* A satisfactory Health Check. All PGCE trainee teachers must meet the Secretary of State's requirements for physical and mental fitness to teach.\r\nAll trainee teachers must have the health and physical capacity to teach and not put children and young people at risk of harm.\r\n","status":2,"createdAt":"2021-07-06T10:51:03.321Z","canSponsorStudentVisa":"yes","cycle":"2024"}
