{"id":"ac0fc132-48c5-44fa-b164-261fabf116ba","name":"Modern Languages (German)","code":"2MY2","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"fbb00c08-2dbc-4f26-adb3-3b23afba18c1","code":"17","name":"German"},{"id":"ce8523ef-9236-4cd9-b260-d826c7a521b3","code":"ML","name":"Modern Languages"}],"locations":[{"id":"029b3a04-147b-4aa2-a6c5-20ff14f89046","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"215cd582-2a3f-4a89-9e1d-5b4f981c07e4","code":"17T","name":"TeachSlough"},"accreditedBody":{"id":"6439adcc-af64-4d3d-a1da-de045755db06","code":"R12","name":"The University of Reading"},"degreeGrade":"0","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":7710,"feeDetails":"Tuition fees for QTS are £7710. \r\nTuition fees for PGCE are £9250. \r\n\r\nPGCE is optional and not a prerequisite for training; both QTS and PGCE lead to a teacher training qualification. PGCE trainees attend extra sessions at the University of Reading during school holidays for the accreditation. For more information on the PGCE course, please visit: http://www.reading.ac.uk/education/pgce-qts/ioe-pgce-qts.aspx","aboutCourse":"Course Structure\r\nYou will be trained in a highly supportive and aspirational environment and will develop the rigour, professional knowledge, understanding and skills necessary for the delivery of creative, purposeful and challenging teaching and learning. \r\n\r\nMost of the training will be delivered by expert teachers in the partnership schools. This will be enhanced through attendance to Reading University at least once a week. As a post-graduate student, you will have full access to the University of Reading, a dynamic facilitator of both innovative and traditional approaches to teacher training. At the start of the course, you will have two weeks in your placement school and then a week of intensive preparation at the university and will undertake regular training sessions at the university throughout the course. \r\n\r\nGuidance and Support\r\nA strong support network is in place: you will be assigned a mentor from your department, a university tutor, and your training will also be monitored by a member of the Senior Leadership Team. As a trainee in your allocated placement school, you will be included in all staff meetings and development days. You will be in school from the first day of term so will feel part of the team from day one. \r\n\r\nOur mentors are exemplary teachers as well as supportive, nurturing and well trained mentors who undertake a rigorous training programme to enhance these mentoring skills. This includes coaching, and effective classroom observation and feedback. Your in-school training will be enhanced through regular mentor meetings and observations: trainees are taught to put together an exceptional portfolio of evidence, which is checked in the final assessment in the summer term. Progress is documented through termly mentor reports, on which trainees reflect, set targets and grow with the support of their mentors and university tutors. \r\n\r\nPartnership Schools\r\nThe lead school is Upton Court Grammar School and the accrediting provider is the University of Reading. TeachSlough recruits on behalf of all Slough schools - for a full list of our partnership schools, please visit our website.\r\n","interviewProcess":"How We Select Our Trainees:\r\nUpton Court Grammar School is the lead school in the Partnership and will be co-ordinating the recruitment process. This will involve a full day spent at the school and will include a variety of pre-assessment tasks as well as a formal interview with members of the TeachSlough team. \r\nIt is a rigorous and thorough process designed to get the best match of applicant to the places available. \r\n\r\nEntry Requirements:\r\nYou will need at least a grade C in your GCSE English and Maths or equivalent.\r\nMinimum degree required: 2:2 or equivalent. Degrees should be in a related subject. \r\nOverseas applicants will need a NARIC certificate of comparability to prove their qualifications match the GCSE and degree requirements.\r\nAll trainees will need to complete a Numeracy and Literacy skills’ test before they are able to enrol onto the course. \r\n\r\n","howSchoolPlacementsWork":"If successful at interview, a condition of offer will be to secure a main placement school to support your training. Applicants who are already linked to one of our partnership schools should indicate their supporting school in their teacher training applications. As this is the final stage of recruitment, successful applicants who are not linked to a partnership school should be proactive in finding a main placement school. \r\n\r\nYou will train in your main placement school in the autumn and summer terms. In spring term 1, you will train in your second placement school, which TeachSlough will organise for you in one of our contrasting, complimentary partnership schools.* The six-week second placement allows you to gain a wealth of experience and an understanding of a variety of practices to add to your credentials. \r\n\r\n*For a full list of our partnership schools, please visit our website. ","personalQualities":"We are looking for ambitious trainee teachers who are passionate and enthusiastic about education and have a desire to share that with young people of all abilities. This will be demonstrated through meaningful experiences of working with young people in the secondary phase, which should be discussed in your application and, for shortlisted candidates, at interview. This does not need to be paid work but might be helping with a sport's team, drama group or youth club. We would like you to have undertaken some observation in a classroom (or you may have worked in a school) prior to interview.  ","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:56:28.269Z","updatedAt":"2021-07-16T13:25:01.441Z","canSponsorStudentVisa":"yes","cycle":"2024"}
