{"id":"d959b10f-f187-4aab-8859-cd6294c97de6","name":"Primary","code":"2PTC","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"b3cd343b-a1a7-4fcf-ab78-32a353217ec8","name":"Kings' Forest Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"feb38584-5080-463f-a4d8-a76726f8879a","name":"Stanbridge Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"fc851dba-66eb-4d73-a31b-209d32315f7c","name":"Blackhorse Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"b31c17b8-8c9b-4a9f-b60c-1bd034216016","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"ffa3f0dc-4880-4ae7-9942-84502da47f56","code":"27R","name":"Five Counties Teaching School Hub (South Glos and BANES)"},"accreditedBody":{"id":"e1473ef6-b29f-4e0b-adff-558ab367008a","code":"2AV","name":"Cabot Learning Federation SCITT"},"profPost":"BO","degreeGrade":"1","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9000,"aboutCourse":"The Five Counties TSH (formerly the South Glos Teaching School Alliance) programme offers a one year, full-time course, based on the academic year starting in September. \r\n\r\nOur vision is to develop and prepare the teachers of tomorrow with the skills and knowledge they need to deliver creative and challenging teaching and learning in the Primary setting. The programme has been designed to ensure that you are expertly trained as a Primary teacher to take up your post as an outstanding NQT and is enhanced by attending training at the CLF SCITT. \r\n\r\nRight from day one, trainees are treated as a member of staff and take part in all aspects of school life including attending all staff meetings and other CPD opportunities. Trainees attend one days joint training a week and then put their learning into practice straight away back in school so it really is learning on the job. Trainees work with their school-based mentor, who is responsible for supporting and guiding their professional development, ensuring that they have the opportunities that they need both within the school and drawing on expertise from other schools. \r\n\r\nThe staff in our schools are our most valuable resource and have a proven track record for delivering high quality training and professional development. They have high expectations and are eager to share their skills, knowledge and practice with the next generation of teachers - they are in the best position to prepare trainee teachers for excellence in their own practice. They endeavour to support trainees in many different ways through coaching and mentoring, observations and feedback to ensure that they have the best possible preparation and training.\r\n\r\nTraining in school progresses from observing and working alongside an experienced teacher to taking full responsibility, firstly for groups, and later for the whole class as the academic year progresses. Progress is assessed through regular formal and informal monitoring of teaching competencies leading to profile reviews and assignments which link education/subject theory with the teaching and learning in the classroom. \r\n\r\nThe University aspect of the course brings together theory and practice and is carefully timetabled to ensure the work load dis not too high.\r\nTrainees have access to their extensive library, resources and tutor for support. \r\n\r\nWhen you qualify, you will achieve a PGCE with QTS.\r\n","interviewProcess":"Our aim is to invite applicants to interview who have the talent, commitment and enthusiasm to become outstanding Primary teachers. \r\n\r\nEarly application is recommended.  Following your application, shortlisting will take place to invite appropriate candidates to interview. Interviews will take place from November to June.\r\n\r\nInterviews last half a day and are held in one of the group of schools, where candidates will be asked to complete various tasks. This will include working with a small group of children. During the interview, we will have an informed discussion with candidates on teaching and learning, subject knowledge, the curriculum and previous school and/or setting experience. The interview will also explore your commitment and potential to become a teacher, including your professionalism and ability to manage the challenges and pressures of the course.\r\n\r\nSuccessful candidates will be offered a place on the course subject to fulfilling entry criteria and further checks.\r\n","howSchoolPlacementsWork":"Each candidate will have three placements, placements 1 and 3 will be in the same school and placement 2 will be in a contrasting school. Each trainee will complete at least one placement in key stage 1 (5 to 7) and at least one in key stage 2 (7 to 11). We work with our trainees to look at their strengths and interests in order to choose the right placement school for them. All of our placement schools are within a 2 mile radius. Trainees will also spend some time in the key stage before (EYFS) and after (Key Stage 3) to broaden their experience and understanding of children's educational journey.\r\n\r\n","personalQualities":"We are looking for positive, dynamic applicants who are committed and enthusiastic about working with Primary age children, wanting to share a genuine passion for learning. Applicants also need to demonstrate confidence, an aptitude for listening and learning, the ability to reason critically, ability to manage an often heavy workload, ability to meet deadlines and who show enjoyment working with others as part of a team. \r\n\r\n\r\n","otherRequirements":"The following entry requirements must be met:\r\n\r\n* Have been subject to a DBS enhanced disclosure and subject to the Independent Safeguarding Authority (ISA) regulations.\r\n* Have had recent experience of working with children in school or other settings, e.g. volunteering or paid employment in any sector for example schools, nurseries, crèche facilities, play groups, forest schools and adventure play grounds.\r\n* Fitness to work screening passed","status":1,"createdAt":"2021-07-06T10:48:43.898Z","updatedAt":"2021-10-08T11:31:40.083Z","canSponsorStudentVisa":"no","cycle":"2024"}
