{"id":"eafd50ca-3ae7-480a-b749-f6035dc34b2c","name":"Primary","code":"2YLP","qualification":"qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"b31c17b8-8c9b-4a9f-b60c-1bd034216016","name":"Main Site","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"ffa3f0dc-4880-4ae7-9942-84502da47f56","code":"27R","name":"Five Counties Teaching School Hub (South Glos and BANES)"},"accreditedBody":{"id":"e1473ef6-b29f-4e0b-adff-558ab367008a","code":"2AV","name":"Cabot Learning Federation SCITT"},"english":"3","maths":"3","science":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","aboutCourse":"The South Glos TSA programme offers a one year, full-time employment based course, based on the academic year starting in September. \r\n\r\nOur vision is to develop and prepare the teachers of tomorrow with the skills and knowledge they need to deliver creative and challenging teaching and learning in the Primary setting. The programme has been designed to ensure that trainees are expertly trained as a Primary teacher to take up a post as an outstanding NQT and is enhanced by attending training at the CLF SCITT. \r\n\r\nOur salaried trainees are employed members of staff and take part in all aspects of school life including attending all staff meetings and other CPD opportunities right from day one. Trainees attend one days joint training a week and then put their learning into practice straight away back in school so it really is learning on the job. Trainees work with their school-based mentor, who is responsible for supporting and guiding their professional development, ensuring that they have the opportunities that they need both within the school and drawing on expertise from other South Glos TSA schools. \r\n\r\nThe staff in our schools are our most valuable resource and have a proven track record for delivering high quality training and professional development. They have high expectations and are eager to share their skills, knowledge and practice with the next generation of teachers - they are in the best position to prepare trainee teachers for excellence in their own practice. They endeavour to support trainees in many different ways through coaching and mentoring, observations and feedback to ensure that they have the best possible preparation and training.\r\n\r\nTraining in school progresses from observing and working alongside an experienced teacher to taking full responsibility, firstly for groups, and later for the whole class as the academic year progresses. Progress is assessed through regular formal and informal monitoring of teaching competencies leading to profile reviews and assignments which link education/subject theory with the teaching and learning in the classroom.\r\n\r\nWhen trainees qualify, they will achieve QTS. There is also the option for trainees to complete a PGCE although this does incur a fee to be paid by the trainee.\r\n","interviewProcess":"Our aim is to invite applicants to interview who have the talent, commitment and enthusiasm to become outstanding Primary teachers. \r\n\r\nEarly application is recommended as the course is very popular. Following application, shortlisting will take place to invite appropriate candidates to interview. The first interviews will take place in December or January. \r\n\r\nInterviews last a full day and are held in one of the South Glos TSA Schools, where candidates will be asked to complete various tasks. This will include working with a small group of children. During the interview, we will have an informed discussion with candidates on teaching and learning, subject knowledge, the curriculum and previous school and/or setting experience. The interview will also explore candidates commitment and potential to become a teacher, including their professionalism and ability to manage the challenges and pressures of the course.\r\n\r\nSuccessful candidates will be offered a place on the course subject to entry criteria and other checks being met.\r\n","howSchoolPlacementsWork":"Each candidate will have three placements, placements 1 and 3 will be in their 'home' school where they are employed and placement 2 will be in a contrasting school. Each trainee will complete at least one placement in key stage 1 (5 to 7) and at least one in key stage 2 (7 to 11). We work with our trainees to look at their strengths and interests in order to choose the right placement school for them. All of our placement schools are within a 2 mile radius. Trainees will also spend some time in the key stage before (EYFS) and after (Key Stage 3) to broaden their experience and understanding of childrens' educational journey.\r\n\r\n","personalQualities":"We are looking for positive, dynamic applicants who are committed and enthusiastic about working with Primary age children, wanting to share a genuine passion for learning. Applicants also need to demonstrate confidence, an aptitude for listening and learning, the ability to reason critically, ability to manage an often heavy workload, ability to meet deadlines and who show enjoyment working with others as part of a team. \r\n\r\n\r\n","otherRequirements":"The following entry requirements must be met:\r\n\r\n* Have been subject to a Criminal Records Bureau enhanced disclosure and subject to the Independent Safeguarding Authority (ISA) regulations.\r\n* Have had recent relevant and extensive experience of working with children in school or other settings, e.g. volunteering or paid employment in any sector for example schools, nurseries, crèche facilities, play groups, forest schools and adventure play grounds. This route is ideally suited to candidates who have experience of working in schools as Teaching Assistants and are looking to take the next step in their career.\r\n* Fitness to work screening passed","status":2,"createdAt":"2021-07-06T10:48:43.990Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"Trainees are paid on point one of the unqualified teachers' pay scale. If a trainee wishes to also study for a PGCE, there will be a fee to be paid by the trainee."}
