{"id":"552690aa-5cc7-4cea-9946-c908c88074fe","name":"Chemistry","code":"22WR","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"912d4fb4-761b-42e9-8dc6-e968b791ea4e","code":"F1","name":"Chemistry"}],"locations":[{"id":"af3dcf55-af8f-423d-9d23-54e6d126b3e8","name":"NSTA School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"36549ffd-b1d5-48b5-9d42-5449642ab0ef","code":"16Z","name":"North Somerset Teaching Alliance"},"accreditedBody":{"id":"992b9d4a-bdcf-44e8-9296-fb1fe3bb3315","code":"B78","name":"University of Bristol"},"profPost":"BO","degreeGrade":"1","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Equivalency tests may be considered through a third party provider. Please contact us for further information.","courseLength":"OneYear","feesUK":9250,"feeDetails":"Your tuition fees are paid to our link HEI. ","financialSupport":"For information about financial support please refer to the information shared by our link HEIs. ","aboutCourse":"You will do a combination of subject and pedagogical learning in School and with your HEI link. \r\n\r\nFormal assessment for the School Direct programme takes place throughout the year in partnership with your HEI link partner. \r\n\r\nAssessment takes the form of assessed practical teaching against the Teachers' Standards and course work assignments set by your HEI link partner. \r\n\r\nSuccessful completion of the programme requires passes in practical teaching and in all assignments; the marking criteria for both scales are against a comprehensive range of criteria explicitly linked to the standards for Qualified Teacher Status. (QTS).","interviewProcess":"Backwell and Churchill schools lead the North Somerset Teaching Alliance recruitment in ITT.  Its partner schools; Broadoak, Chilton Trinity, Clevedon, Gordano, Kings of Wessex and The Blue School will be hosting subject based interviews on behalf of the Alliance.\r\n\r\nIf you are invited for interview you will receive full details of what will be expected of you in a letter of invitation. You will experience a programme which will include: you taking a small group of students through an activity that interests you (20 mins), time spent with subject staff, students and a formal interview process.\r\n\r\nWe work closely with our HEI link partner in the selection process. You will be expected to be familiar with key issues and developments in secondary schools - especially those in your subject area. It will help you to read the educational press and to talk to teachers and those currently undertaking teacher training. Our interview procedure is a rigorous and thorough process, designed to get the best match of applicant to the School Direct places available. \r\n\r\nThe best preparation for interview is a visit to a school or schools where possible. Talk to teachers and students, try to evaluate what is being learned and how the teachers encourage the learning to take place. You will be expected to discuss these observations in your formal interview; where we will be looking for your ability to analyse your experience and show a deeper understanding of the learning process. ","howSchoolPlacementsWork":"If you are successful in being offered a School Direct placement with the NSTA you will choose which school you would like to be your 'home school' from the range of partner schools wishing to train in your subject. \r\n\r\nFor more information relating to subjects on offer in schools please check the detail of this on our website [NSTA Website](https://www.nsta.org.uk/)\r\n\r\nAll of our schools are easily commutable from Bristol; two schools are slightly further south and situated on the southern edge of the Mendip Hills.  Six of our eight partner schools are 11-18 provision. All of our schools provide a highly supportive and aspirational environment in which to train. One that offers the rigour, professional knowledge, understanding and skills necessary for the delivery of creative, purposeful and challenging teaching and learning. \r\n\r\nEach School Direct trainee will undertake two placements, a longer placement starting in their 'home school' and a second shorter placement usually taking place in one of our other partner schools. \r\n\r\nFor more information about the general nature of placements please check our website [NSTA Website](https://www.nsta.org.uk/)\r\n\r\n","personalQualities":"We are looking for ambitious trainee teachers who are passionate and enthusiastic about their subject and have a desire to share that with young people of all abilities in the secondary age range. You are looking to enter an exciting and demanding career and you will need to be resilient, honest and brave. \r\nYour commitment should be demonstrated by meaningful, recent experience of working with young people of this age. For example, you may have been involved with some experience in schools through visits you have organised. ","otherRequirements":"We expect applicants to come from a wide range of backgrounds and, therefore with a wide range of skills. This is a strength of the programme as it allows us to use your differences to learn with and from one another. \r\n\r\nAll applicants will be subject to suitability checks. This includes a full enhanced disclosure and barring check for child and adult workforce, as well as clearance by your HEI Link Occupational Health department. \r\n\r\n","status":1,"createdAt":"2021-07-06T10:46:34.863Z","updatedAt":"2021-07-19T13:28:26.647Z","canSponsorStudentVisa":"yes","cycle":"2024"}
