{"id":"792ec126-565c-430b-a4f5-3e820fb1977e","name":"Psychology","code":"J606","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"1878e739-30bb-4de9-841e-42dacfb1fa0c","code":"C8","name":"Psychology"}],"locations":[{"id":"0fdc9b4e-5082-4f35-bc35-b149b2b0d55f","name":"Holmer Green Senior School","isPublished":"Y","status":"R"},{"id":"6243d35b-fe36-45a2-a814-ddaf56ec700a","name":"Beaconsfield High School","isPublished":"Y","status":"R"},{"id":"bb42a854-52ef-4ecb-8fd6-8e9465fad685","name":"Main Site","isPublished":"N","status":"S","vacancies":"F"}],"trainingProvider":{"id":"a56784f7-c2a4-4576-b40f-c90e1f59c7cf","code":"2FX","name":"Challoners High Bucks Hub"},"accreditedBody":{"id":"feecdec5-259c-45e3-b1cf-4e391936ee90","code":"H36","name":"University of Hertfordshire"},"profPost":"PG","degreeGrade":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"The School Direct, unsalaried, PGCE course, is a full time, one-year, Initial Teacher Education qualification, introducing you to the requirements for teaching students in the 11–16 age range. Where appropriate, opportunities to experience post-16 provision will be available. \r\n\r\nThe course is based on the ITT Core Content Framework and enables you to evidence progress, in a number of professional areas, leading to the awarding of Qualified Teacher Status (QTS). If applying through the Bucks Hub, you will have the opportunity to apply directly to the Lead School and to indicate the name and location of the school in which you would prefer to undertake your main placement training. You will be assigned a specialised Teacher Mentor, who will support you closely in your school placement experience. In addition, you will work with the Bucks Hub and your Teacher Mentor to agree the location of a six-week second school experience, within a contrasting school, in the Spring term, where you will develop your skills to become an excellent classroom practitioner.\r\n\r\nWhile undertaking your school placement, you will simultaneously work towards securing 60 Master’s level credits, by attending centre-based training with the University of Hertfordshire, one day per week. This is an integral part of the programme. We strongly believe that innovative and effective teaching and learning is made possible through a teacher’s full engagement with research informed practice and underpinning theories of learning. This is fostered in two modules and developed through school-based training. You will be expertly supported in your journey to becoming a critically reflective teacher, capable of inspiring pupils to learn, achieve and flourish.\r\n\r\nTraining to teach with the Bucks Hub is exciting, rewarding and demanding. The Bucks Hub is an unapologetically exclusive training provider, offering outstanding practitioners, bespoke opportunities to flourish, within a diverse network of schools.  By the end of the course, you will be well prepared for any challenges in seeking employment as an Early Career Teacher (ECT).\r\n","interviewProcess":"The ability to train to teach is assessed first on application and then at interview. The interview day is a two-way process in which we encourage all applicants to ask questions to ensure that our PGCE course is suitable for them. Due to the risk mitigation measures in place, in schools, due to COVID-19, please be advised that part or all of the interview may be held remotely, during this recruitment cycle. Specific information regarding the interview process will be communicated if and when a candidate is shortlisted. \r\n\r\nWe are looking to select trainee teachers who:\r\n\r\n* have the passion, commitment and enthusiasm to teach their specialist subject in secondary schools\r\n* have a strong knowledge, understanding and interest in the specialist subject that they wish to train to teach in\r\n* are committed to working with children and adolescents and to improving their educational outcomes\r\n* have an understanding of the role of the teacher and the demands of the teaching profession\r\n* have excellent communication and interpersonal skills\r\n* have the ability to reflect upon what they are doing and can respond well to feedback\r\n* are resilient and able to work under pressure\r\n\r\n","howSchoolPlacementsWork":"Schools in the University of Hertfordshire schools' partnership have a proven track record of strong engagement with Initial Teacher Education.  Schools are evaluated and monitored in relation to the quality and effectiveness of school-based training provision.  Schools commit to enact the terms of the University of Hertfordshire Partnership for Initial Teacher Education. \r\n\r\nDuring the course you will undertake School Based Training in at least two contrasting secondary schools.  The duration and location of these will be confirmed in the autumn term and are arranged by the Lead Schools, in consultation with Professional Mentors and their respective trainees.  These are designed to provide each individual with a contrasting experience, in a different context, that they can access by private or public transport.\r\n\r\nThis School Direct unsalaried placement is full-time, with four days a week spent in the secondary school and one day a week spent at the University of Hertfordshire. \r\n","personalQualities":"In your application and during the interview process, you will need to demonstrate an ability to train to teach through the following:\r\n\r\n* Genuine care for children’s learning, progress and achievement\r\n* A commitment and passion for your subject specialism\r\n* Your motivation and interest in training to teach\r\n* Excellent interpersonal and communication skills\r\n* A commitment to working with children and adolescents and improving their educational outcomes\r\n* The ability to be organised, adaptable and resilient\r\n* A willingness to work and learn from others and to be responsive to feedback\r\n\r\n","otherRequirements":"You will be required to complete a Disclosure and Barring Service (DBS) check and a Declaration of Disqualification by Association form. You will also need to respond to targeted and relevant health questions. Guidance will be provided after you have been offered a place.\r\nWe recommend that you undertake observation time in a state secondary school, if possible, prior to interview.  Please note whilst this experience can provide a useful basis for discussion at interview, this experience is not essential. ","status":1,"createdAt":"2021-09-22T10:39:44.754Z","updatedAt":"2021-09-29T12:48:29.346Z","canSponsorStudentVisa":"no","cycle":"2024"}
