{"id":"1cace80c-aeca-40e2-ba16-d14ee81d9972","name":"English","code":"3DTX","qualification":"pgce_with_qts","startDate":"2023-07-31T23:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3aed1aa8-ae46-4b68-92bb-a6cc20655c59","code":"Q3","name":"English"}],"locations":[{"id":"7838799f-3626-48fe-bff4-7bb7dc85c573","name":"Q3 Academy Langley","isPublished":"Y","status":"R","vacancies":"F"},{"id":"0ebf1818-aa55-44e3-9eac-01d1ffe1bf0c","name":"Pedmore High School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"5c1a646a-dcd6-4bea-911b-c2ab525bcac5","name":"Moseley School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"f3796367-a3b9-4010-a367-06926dea17ea","name":"Leasowes High School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"6efddb1d-bb08-486c-b899-90a6582519da","name":"Woodrush High School- Lead School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"9225c231-1b35-47c3-bcdf-26c43f7b63b3","name":"Ellowes Hall Sports College","isPublished":"Y","status":"R","vacancies":"F"},{"id":"92a84599-f2e7-4b61-a7ea-e05eba036be4","name":"Nunnery Wood High School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"093631dd-158a-4ed3-86ea-30a6bcb13ba4","name":"Trinity High School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"f6f54f95-7d0c-4cb5-ab28-c2c95568990f","code":"21T","name":"Woodrush Training Consortium"},"accreditedBody":{"id":"ef09ce50-ccfc-4346-a0ce-43e840153dab","code":"W20","name":"The University of Warwick"},"profPost":"BO","degreeGrade":"1","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Woodrush Training Consortium firmly believes that English is for life. It's the backbone of every other subject a student studies. As such, English lessons take learners through themes and topics that are relevant to life and to the wider world. English feeds young peoples' creativity and imagination. As a trainee English teacher, you will be supported to craft learning experiences where students can be immersed in challenge and creativity, whilst also providing those quiet moments to allow their thoughts to hit the page. The impact of an English teacher on a student's education is wide reaching. It is a very exciting time to be joining the profession as an English teacher trainee with the Woodrush Training Consortium. \r\n\r\n[Woodrush TC](https://www.woodrush.org/page/?title=About+School+Direct&pid=187)","interviewProcess":"Application forms are considered by both the university and the individual schools involved with Woodrush Training Consortium. \r\nAll successful applicants will have an interview and although this normally takes place at Woodrush Training Consortium, due to COVID interviews are being conducted online. The University and Woodrush jointly design and manage the interview process with the school leading the process. Your interview will consist of a written task, a presentation and a formal interview.\r\n\r\nApplicants that demonstrate professionalism, commitment, a realistic understanding of the pressures of the course and the profession, an awareness of the school in which they are intending to train, creativity, organisational skills and a clear recognition of the need to synthesise practical and academic learning through refection are most likely to succeed. \r\n\r\n[Woodrush TC](https://www.woodrush.org/page/?title=About+School+Direct&pid=187)","howSchoolPlacementsWork":"Your placement school will primarily be selected on where there are vacancies for your subject. We aim to place you at a school with the minimal travelling distance. You will have two placements at contrasting schools. For primary you will teach ages 3 to 11 and for secondary ages 11 to 18. Woodrush TC partner with over twenty schools in and across the Midlands and these can all be found at www.woodrushtsa.co.uk.\r\n\r\nWe have listed the locations that our partner schools will be running placements for the next year. You should indicate your preference of location on your application, this does not guarantee you will be placed at your preferred location. Throughout the year a schools staffing may change and therefore a school not listed may become available in your subject. \r\n\r\n[Woodrush TC](https://www.woodrush.org/page/?title=About+School+Direct&pid=187)","personalQualities":"Successful School Direct students will be those that have a clear understanding of schools in England and of what good teaching involves \r\n\r\nRecognise that the job of the teacher is first and foremost that of teaching and that the understanding of the pedagogy of teaching and learning is fundamentally essential \r\n\r\nHave a solid knowledge of their subject(s) and are always committed to further developing this knowledge base \r\n\r\nAre committed to the education of all children, whatever their need and background \r\n\r\nAre able to reflect on their own experiences and apply learning to future actions \r\n\r\n[Woodrush TC](https://www.woodrush.org/page/?title=About+School+Direct&pid=187)","otherRequirements":"If you studied outside the UK, you should visit the National Academic Recognition Centre (NARIC) website to find out whether your qualifications are of an equivalent level to UK GCSEs, A levels and an undergraduate degree. \r\n\r\n[Woodrush TC](https://www.woodrush.org/page/?title=About+School+Direct&pid=187)","status":1,"createdAt":"2021-07-06T10:48:24.156Z","updatedAt":"2021-09-24T10:01:55.495Z","canSponsorStudentVisa":"yes","cycle":"2024"}
