{"id":"6d04e1a3-b38e-4b64-8f19-653f4001d941","name":"Primary","code":"2JZF","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"ba7e1df1-7380-4fdf-9dfe-bbec3005b01d","name":"Holywell Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"0d04e0fd-71b3-4404-b4d1-598dbe3ea6e9","name":"Lickey Hills Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"4712a4c3-2602-4a5f-971c-bdd396830981","name":"Beaconside Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"9dd24af9-b328-4af4-9c15-173e2f361bf0","name":"FairField First School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"c1674850-1119-447b-8cf2-6c5fe16f7e52","name":"Hollywood Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"b27f3d63-dc25-4f17-897b-dff5d83dd0b9","name":"Coppice Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"038cd108-64e9-4a3d-add6-b16fd1848c94","name":"St Andrews CE First School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"d56549e7-a96a-45d7-8620-21d1416038fc","name":"Meadow Green Primary School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"f6f54f95-7d0c-4cb5-ab28-c2c95568990f","code":"21T","name":"Woodrush Training Consortium"},"accreditedBody":{"id":"c357e0fa-802e-471b-818a-d0cd1434f9cd","code":"B32","name":"University of Birmingham"},"profPost":"PG","degreeGrade":"1","english":"2","maths":"2","science":"2","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"The primary course is designed in conjunction with local schools in our consortium partnership. The course combines the theories of learning and teaching, alongside developing practical insights and skills in the effective teaching and assessment of young children. It will look into the study of teaching in all National Curriculum subjects, with emphasis on English, Maths, Science and ICT. School Direct provides hands on school-based learning that will develop analytic and reflective practitioners. \r\nThe course includes two placements at contrasting schools over two key stages. Training is coordinated by the School Direct 'Lead School' with a combination of observations, seminars, workshops, tutorials and practical sessions. \r\n\r\n[Woodrush TC](https://www.woodrush.org/page/?title=About+School+Direct&pid=187)","interviewProcess":"Application forms are considered by both the university and the individual schools involved with Woodrush Training Consortium. \r\n\r\nAll successful applicants will have been interviewed and this will normally take place at Woodrush Training Consortium. The University and Woodrush jointly design and manage the interview process with the school leading the process. Applicants that demonstrate professionalism, commitment, a realistic understanding of the pressures of the course and the profession, an awareness of the school in which they are intending to train, creativity, organisational skills and a clear recognition of the need to synthesise practical and academic learning through refection are most likely to succeed. \r\n\r\n[Woodrush TC](https://www.woodrush.org/page/?title=About+School+Direct&pid=187)","howSchoolPlacementsWork":"We aim to place you at a school with the minimal travelling distance. You will have two placements at contrasting schools. For primary you will teach ages 3 to 11 and for secondary ages 11 to 18. Woodrush TC partner with over twenty schools in and across the Midlands and these can all be found at [Woodrush TC](https://www.woodrush.org/page/?title=About+School+Direct&pid=187)\r\n\r\nWe have listed the locations that our partner schools will be running placements for the next year. You should indicate your preference of location on your application, this does not guarantee you will be placed at your preferred location. Throughout the year a schools staffing may change and therefore a school not listed may become available in your subject. \r\n\r\n[Woodrush TC](https://www.woodrush.org/page/?title=About+School+Direct&pid=187)","personalQualities":"Successful School Direct students will be those that have a clear understanding of schools in England and of what good teaching involves \r\n\r\nRecognise that the job of the teacher is first and foremost that of teaching and that the understanding of the pedagogy of teaching and learning is fundamentally essential \r\n\r\nHave a solid knowledge of their subject(s) and are always committed to further developing this knowledge base \r\n\r\nAre committed to the education of all children, whatever their need and background \r\n\r\nAre able to reflect on their own experiences and apply learning to future actions \r\n\r\n[Woodrush TC](https://www.woodrush.org/page/?title=About+School+Direct&pid=187)\r\n","otherRequirements":"If you studied outside the UK, you should visit the National Academic Recognition Centre (NARIC) website to find out whether your qualifications are of an equivalent level to UK GCSEs, A levels and an undergraduate degree. \r\n\r\n[Woodrush TC](https://www.woodrush.org/page/?title=About+School+Direct&pid=187)","status":1,"createdAt":"2021-07-06T10:48:22.180Z","updatedAt":"2021-09-24T10:30:31.146Z","canSponsorStudentVisa":"yes","cycle":"2024"}
