{"id":"7c676a29-b8cc-4c67-a353-02c2835c7b9d","name":"Geography","code":"2ZPM","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3f47e67b-7fa5-4947-a5a0-74d528cd2a87","code":"F8","name":"Geography"}],"locations":[{"id":"6efddb1d-bb08-486c-b899-90a6582519da","name":"Woodrush High School- Lead School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"9225c231-1b35-47c3-bcdf-26c43f7b63b3","name":"Ellowes Hall Sports College","isPublished":"Y","status":"R","vacancies":"F"},{"id":"7f672346-671f-4685-a444-86fb5f8c2169","name":"Christopher Whitehead Language College","isPublished":"Y","status":"R","vacancies":"F"},{"id":"0faba47e-73b8-4d6e-8084-018a772cc555","name":"Kings Norton Boys School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"edcf11bf-a8d2-41eb-9e46-7cfbe1341c81","name":"Q3 Academy Great Barr","isPublished":"Y","status":"R","vacancies":"F"},{"id":"093631dd-158a-4ed3-86ea-30a6bcb13ba4","name":"Trinity High School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"be91ebc8-af96-4a57-917a-a2142e7c9f17","name":"The Crestwood School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"0ebf1818-aa55-44e3-9eac-01d1ffe1bf0c","name":"Pedmore High School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"f6f54f95-7d0c-4cb5-ab28-c2c95568990f","code":"21T","name":"Woodrush Training Consortium"},"accreditedBody":{"id":"6019b3ce-f2f6-4b0e-b2a9-5813d74c4d54","code":"W80","name":"University of Worcester"},"profPost":"BO","degreeGrade":"1","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Geography is an increasingly popular subject with over 220 000 students sitting a GCSE Geography exam in 2013. As a teacher of Geography you have the opportunity to inspire a sense of wonder within the students on a local, national and global scale and instil a lasting curiosity of people and places around the world that will remain within them for a lifetime. Teaching Geography in the Woodrush Training Consortium will enable you to deliver both skills and knowledge including physical and human processes, diverse places, landscapes and the environment. \r\n\r\nThere are 4 assignments across the year which are assessed in a variety of ways.  Assignments at Level 6: writing and acting on a series of Action Plans and a written assignment reflecting on first experiences in school.  Assignments at Level 7: Creating, implementing and evaluating a resource used in the classroom, and, researching an aspect of teaching and learning and presenting the findings.\r\n\r\n[Woodrush TC](https://www.woodrush.org/page/?title=About+School+Direct&pid=187)","interviewProcess":"Application forms are considered by both the university and the individual schools involved with Woodrush Training Consortium. \r\nAll successful applicants will have an interview and although this normally takes place at Woodrush Training Consortium, due to COVID interviews are being conducted online. The University and Woodrush jointly design and manage the interview process with the school leading the process. Your interview will consist of a written task, a presentation and a formal interview.\r\n\r\nApplicants that demonstrate professionalism, commitment, a realistic understanding of the pressures of the course and the profession, an awareness of the school in which they are intending to train, creativity, organisational skills and a clear recognition of the need to synthesise practical and academic learning through refection are most likely to succeed.\r\n\r\n[Woodrush TC](https://www.woodrush.org/page/?title=About+School+Direct&pid=187)","howSchoolPlacementsWork":"Your placement school will primarily be selected on where there are vacancies for your subject. We aim to place you at a school with the minimal travelling distance. You will have two placements at contrasting schools. For primary you will teach ages 3 to 11 and for secondary ages 11 to 18. Woodrush TC partner with over twenty schools in and across the Midlands and these can all be found at www.woodrushtc.co.uk.\r\n\r\nWe have listed the locations that our partner schools will be running placements for the next year. You should indicate your preference of location on your application, this does not guarantee you will be placed at your preferred location. Throughout the year a schools staffing may change and therefore a school not listed may become available in your subject. \r\n\r\n[Woodrush TC](https://www.woodrush.org/page/?title=About+School+Direct&pid=187)","personalQualities":"Successful School Direct students will be those that have a clear understanding of schools in England and of what good teaching involves \r\n\r\nRecognise that the job of the teacher is first and foremost that of teaching and that the understanding of the pedagogy of teaching and learning is fundamentally essential \r\n\r\nHave a solid knowledge of their subject(s) and are always committed to further developing this knowledge base \r\n\r\nAre committed to the education of all children, whatever their need and background \r\n\r\nAre able to reflect on their own experiences and apply learning to future actions \r\n\r\n[Woodrush TC](https://www.woodrush.org/page/?title=About+School+Direct&pid=187)\r\n","otherRequirements":"If you studied outside the UK, you should visit the National Academic Recognition Centre (NARIC) website to find out whether your qualifications are of an equivalent level to UK GCSEs, A levels and an undergraduate degree. \r\n\r\n[Woodrush TC](https://www.woodrush.org/page/?title=About+School+Direct&pid=187)","status":1,"createdAt":"2021-07-06T10:48:22.487Z","updatedAt":"2021-09-24T10:39:24.333Z","canSponsorStudentVisa":"yes","cycle":"2024"}
