{"id":"36793a70-2712-417f-8a5d-3c4bc83d97bd","name":"Primary","code":"W129","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"583abb4f-6d03-47ca-895d-087132bf745b","name":"Marine Academy Primary","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"ff5e78c6-2928-44d6-b4e6-8fa2fed5feb7","code":"S66","name":"South West Teacher Training"},"acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Marine Academy Primary are proud to offer the Primary 5-11  programme. Delivered by outstanding current practitioners and Specialist Leaders in Education alongside the support of experienced and specially trained school mentors, the programme delivers an integrated programme of theoretical knowledge and practical skills enabling you to design and deliver engaging lessons based on solid subject knowledge. The course is practical, hands on and intellectually demanding; sessions typically include simulations of classroom activities, specialist subject knowledge boosters, and sharing developments in pedagogy. These sessions provide support and challenge to help you progress. Marine Academy has an excellent record of teacher training and all of our students successfully embark on their teaching career straight away.","interviewProcess":"Under guidance from the Department for Education, SWTT and Marine Academy continue to recruit throughout this period in response to the Covid 19 pandemic. Applicants will still be shortlisted in the usual manner. Once shortlisted, applicants will be invited to an online interview that will involve:\r\n•\ta short presentation – What makes good teaching?\r\n•\ta written task\r\n•\ta panel interview \r\n•\tvideo Analysis of Lesson\r\nInterviews take around 2 hours and candidates are given 5-7 days notice to allow them time to prepare.\r\nSuccessful candidates are then greeted with a Welcome Pack which helps them through the preparations required to start the course. We pride ourselves on communicating regularly with successful candidates so they feel like a part of the South West Teacher Training and Marine Academy Primary community.\r\n","howSchoolPlacementsWork":"As a school-centred route, we pride ourselves on ensuring our trainees spend as much time in school as possible. After your Induction, you will complete three days of experience in a Secondary school and then begin the first of two placements in your Primary school setting. This quick immersion into school life, integrated with training sessions at Marine Academy Primary, ensures that you are able to swiftly start teaching under expert guidance, with time to reflect built into the programme.\r\nYou will spend the majority of your training year in a host school training in your preferred Key Stage; this could be here at Marine Academy Primary or in one of our excellent partner schools from The Inspire Multi Academy Trust (South West). You will also spend a six-week contrasting placement in another school where you will teach in the opposite Key Stage, further developing you understanding and knowledge of the Early Years or Primary phase.\r\nYou will come together as a cohort every Friday where you will take part in the school based training sessions. These sessions offer you the opportunity to reflect on your experience, support each other and build a network of support throughout your training year. \r\n","personalQualities":"We will be looking for candidates who demonstrate:\r\n* a passion for sharing their subject with young people\r\n* an ability to form positive working relationships with children and adults\r\n* strong subject knowledge that they can communicate with others\r\n* a range of experience of school settings or working with young people is desirable but not essential\r\n* a professional demeanour\r\n* resilience and creativity\r\n* positivity and a strong sense of moral purpose for improving the lives of young people.\r\n","otherRequirements":"Safeguarding is important at South West Teacher Training and Marine Academy.  All candidates must satisfy relevant pre-employment checks.\r\nA place to train with us will involve contact with vulnerable groups (children\r\nand young people) and is therefore exempt from the\r\nRehabilitation of Offenders Act 1974 and subject to an\r\nEnhanced Disclosure Barring Service (DBS) check. This\r\nexemption means that applicants for this post are required to\r\ndeclare all criminal convictions, cautions, reprimands and bindovers\r\nboth spent and unspent in their application regardless of\r\nthe passage of time.","status":1,"createdAt":"2022-01-27T12:34:17.369Z","updatedAt":"2022-01-27T12:35:32.864Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
