{"id":"5b03fe02-6e88-4387-ae79-2eb7e76e5387","name":"Mathematics","code":"2Q8M","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"72345aa7-096c-488f-8649-085b8178cadb","code":"G1","name":"Mathematics"}],"locations":[{"id":"61f9a306-7cc4-4709-ba20-beb23a7549e6","name":"Torquay Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"48832b06-a8da-44bc-bfac-928cae9f25b0","name":"Lipson Co-operative Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"bc9cd9a2-ef4a-4d7d-ae23-09f99c3a9d56","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"ff5e78c6-2928-44d6-b4e6-8fa2fed5feb7","code":"S66","name":"South West Teacher Training"},"profPost":"PG","degreeGrade":"1","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feesInternational":9250,"aboutCourse":"South West Teacher Training's Mathematics course is designed by practising professionals, meaning trainees receive up to date information on recent changes to GCSE Mathematics subject content and assessment objectives emphasise the key areas of mathematical skills, knowledge and understanding. Fluency; problem solving; reasoning and comprehension and communication skills are all covered on our course. \r\nLearners of mathematics will use these skills to develop models of real life situations and to understand how their assumptions determine the efficacy of their models. Learners need to be able to relate the mathematics they do to their own lives as well as to a wider society.\r\nThe aim of the SWTT course is to prepare you to be able to provide sufficient challenge to meet the needs of the most able whilst at the same time making mathematics accessible to those who need the most help. Over the course of two contrasting school placements, our trainees learn to:\r\n•\tUse a range of teaching resources and approaches that provide challenge to inspire and motivate mathematics learners of all abilities.\r\n•\tDevelop confidence and a positive attitude to mathematics in all learners.\r\n•\tMonitor and assess the progress of learners and provide timely intervention and support where necessary.\r\n•\tDevelop into a strong, critically reflective, classroom practitioner, who will go on to participate in, and influence the future development of Mathematics Education.\r\nOur Maths trainees are highly sought after and many of our schools request trainees when they are looking to appoint new Maths teachers in the near future.\r\n","interviewProcess":"Under guidance from the Department for Education, SWTT continues to recruit throughout this period in response to the Covid 19 pandemic. Applicants will still be shortlisted in the usual manner. Once shortlisted, applicants will be invited to an online interview that will involve:\r\n\r\n*a short presentation – how would you teach an aspect of your subject to a group of children?\r\n*a subject knowledge assessment – how familiar are you with the content of the current school curriculum in your subject?\r\n*a PGCE readiness task assessing your ability to read and write at Masters Level\r\n*a panel interview with the SCITT Lead and the Course Tutor for your subject, as well as young people from West Exe School..\r\n*opportunities to meet the core SWTT team and ask questions about the programme.\r\n\r\nInterviews take around 2 hours and candidates are given 5-7 days notice to allow them time to prepare.\r\n\r\nSuccessful candidates are then greeted with a Welcome Pack which helps them through the preparations required to start the course. We pride ourselves on communicating regularly with successful candidates so they feel like a part of the South West Teacher Training community.","howSchoolPlacementsWork":"South West Teacher Training has a wide partnership of fifteen placement schools in Exeter, Plymouth and in rural and coastal communities across Somerset, Devon and Cornwall. This enables us to place trainees within easy travelling distance of home - we feel this is important to ensure trainee well-being and resilience. It's unusual for our trainees to spend more than thirty minutes travelling to placement. \r\n\r\nWhen placing our trainees, we consider their location but we also make an effort to ensure a good match in ethos between the trainee and their host school. It's important too that trainees experience two contrasting placements to enable them to really discover the kind of school culture that suits them best.\r\n\r\nAs a school-centred route, we pride ourselves on ensuring our trainees spend as much time in school as possible. After a week's Induction, trainees complete three days of experience in a Primary school and then begin the first of two placements in an 11-16 or 11-18 setting. This quick immersion into school life, integrated with training sessions at our training base, ensures trainees are able to swiftly start teaching under expert guidance, with time to reflect built into the programme.","personalQualities":"We will be looking for candidates who demonstrate:\r\n* a passion for sharing their subject with young people\r\n* an ability to form positive working relationships with children and adults\r\n* strong subject knowledge that they can communicate with others\r\n* a range of experience of school settings or working with young people\r\n* a professional demeanour\r\n* resilience and creativity\r\n* positivity and a strong sense of moral purpose for improving the lives of young people.\r\n","otherRequirements":"Safeguarding is important at South West Teacher Training  and all candidates must satisfy relevant pre-employment checks.\r\nA place to train with us will involve contact with vulnerable groups (children\r\nand young people) and is therefore exempt from the\r\nRehabilitation of Offenders Act 1974 and subject to an\r\nEnhanced Disclosure Barring Service (DBS) check. This\r\nexemption means that applicants for this post are required to\r\ndeclare all criminal convictions, cautions, reprimands and bindovers\r\nboth spent and unspent in their application regardless of\r\nthe passage of time.","status":1,"createdAt":"2021-07-06T10:49:36.788Z","updatedAt":"2021-09-28T13:13:17.310Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
