{"id":"6f7c8345-0a4b-4e13-a9b3-49318d2cb755","name":"Art and Design","code":"3BCZ","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"d461a678-3335-4ca2-9616-1dc479d31a49","code":"W1","name":"Art and design"}],"locations":[{"id":"bc9cd9a2-ef4a-4d7d-ae23-09f99c3a9d56","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"},{"id":"48832b06-a8da-44bc-bfac-928cae9f25b0","name":"Lipson Co-operative Academy","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"ff5e78c6-2928-44d6-b4e6-8fa2fed5feb7","code":"S66","name":"South West Teacher Training"},"profPost":"PG","degreeGrade":"9","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feesInternational":9250,"aboutCourse":"Art at South West Teacher Training is firmly based in the practices of our Partner Schools who have a tradition of valuing the place of the Arts within the curriculum. Trainees will be placed in schools where Art is taught as a valued subject and forms an integral part of children’s academic and extra-curricular life, adding range and breadth to the curriculum. The South West Teacher Training Art route offers:\r\n•\tClose working with subject mentors who are leading practitioners of Art in their own contexts \r\n•\tInsight into the role of Art as a part of the curriculum in a variety of Primary and Secondary settings\r\n•\tCoverage of elements of Art as a subject including the variety of qualifications awarded in Secondary Schools; GCSE, A Level and vocational approaches\r\n•\tA course integrating academic study with practical methods in the classroom enabling practitioners to develop their own approach to Art education.\r\nThe emphasis is upon working in schools so that trainees can develop a creative, reflective approach. \r\n","interviewProcess":"Under guidance from the Department for Education, SWTT continues to recruit throughout this period in response to the Covid 19 pandemic. Applicants will still be shortlisted in the usual manner. Once shortlisted, applicants will be invited to an online interview that will involve:\r\n\r\n*a short presentation – how would you teach an aspect of your subject to a group of children?\r\n*a subject knowledge assessment – how familiar are you with the content of the current school curriculum in your subject?\r\n*a PGCE readiness task assessing your ability to read and write at Masters Level\r\n*a panel interview with the SCITT Lead and the Course Tutor for your subject, as well as young people from West Exe School.\r\n*opportunities to meet the core SWTT team and ask questions about the programme.\r\n\r\nInterviews take around 2 hours and candidates are given 5-7 days notice to allow them time to prepare.\r\n\r\nSuccessful candidates are then greeted with a Welcome Pack which helps them through the preparations required to start the course. We pride ourselves on communicating regularly with successful candidates so they feel like a part of the South West Teacher Training community.","howSchoolPlacementsWork":"South West Teacher Training has a wide partnership of placement schools in Exeter, Plymouth and in rural and coastal communities across Somerset, Devon and Cornwall. This enables us to place trainees within easy travelling distance of home - we feel this is important to ensure trainee well-being and resilience. It's unusual for our trainees to spend more than thirty minutes travelling to placement. \r\n\r\nWhen placing our trainees, we consider their location but we also make an effort to ensure a good match in ethos between the trainee and their host school. It's important too that trainees experience two contrasting placements to enable them to really discover the kind of school culture that suits them best.\r\n\r\nAs a school-centred route, we pride ourselves on ensuring our trainees spend as much time in school as possible, and focus their energies on teaching, not paperwork. After a week's Induction, trainees complete three days of experience in a Primary school and then begin the first of two placements in an 11-16 or 11-18 setting. This quick immersion into school life, integrated with training sessions at our training base, ensures trainees are able to swiftly start teaching under expert guidance, with time to reflect built into the programme.","personalQualities":"We will be looking for candidates who demonstrate:\r\n* a passion for sharing their subject with young people\r\n* an ability to form positive working relationships with children and adults\r\n* strong subject knowledge that they can communicate with others\r\n* a range of experience of school settings or working with young people\r\n* a professional demeanour\r\n* resilience and creativity\r\n*ideally a practising artist with experience of working in the arts\r\n* positivity and a strong sense of moral purpose for improving the lives of young people.\r\n","otherRequirements":"Safeguarding is important at South West Teacher Training  and all candidates must satisfy relevant pre-employment checks.\r\nA place to train with us will involve contact with vulnerable groups (children\r\nand young people) and is therefore exempt from the\r\nRehabilitation of Offenders Act 1974 and subject to an\r\nEnhanced Disclosure Barring Service (DBS) check. This\r\nexemption means that applicants for this post are required to\r\ndeclare all criminal convictions, cautions, reprimands and bindovers\r\nboth spent and unspent in their application regardless of\r\nthe passage of time.","status":1,"createdAt":"2021-07-06T10:49:36.967Z","updatedAt":"2021-09-14T09:09:46.799Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
