{"id":"58d00505-610d-4e4a-be4f-9633471dcc75","name":"English","code":"2N76","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3aed1aa8-ae46-4b68-92bb-a6cc20655c59","code":"Q3","name":"English"}],"locations":[{"id":"bc9343c7-e722-4eea-8921-e04a6bb036bc","name":"Bourne Grammar School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"6b383298-c138-4095-949a-3004a0fb1e09","name":"Somercotes Academy","isPublished":"N","status":"S","vacancies":"F"},{"id":"13e4fb91-eebc-4835-9bd9-cec0b6ba874b","name":"Sir Robert Pattinson Academy","isPublished":"N","status":"S","vacancies":"F"},{"id":"9858d175-37f4-4235-8d6c-322da82f292b","name":"Sir John Spendluffe Foundation Technology College","isPublished":"Y","status":"R","vacancies":"F"},{"id":"864a2b26-3cf0-4413-a43c-94fdfa6cb4ae","name":"Bourne Academy ( incl Spalding and Giles Academy)","isPublished":"Y","status":"R","vacancies":"F"},{"id":"2df947b0-372d-4aeb-94b0-453158d4f31f","name":"Carre's Grammar School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"55c5bd3e-f355-42f2-be34-a8d8c1e54022","name":"Banovallum School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"6a6f7b7d-3957-48ed-ae13-b6fd01c585d3","name":"Sir William Robertson Academy","isPublished":"Y","status":"R"},{"id":"d004fdf1-845d-474f-a8ab-2b372dd167ee","name":"St George's Academy, Sleaford","isPublished":"N","status":"S","vacancies":"F"},{"id":"f23f5dd5-0b69-4cbb-890b-2ba14c4d08fc","name":"Main Site","isPublished":"N","status":"S","vacancies":"F"},{"id":"eb53c3e1-6896-44e9-892e-0ed518835ece","name":"Louth Academy","isPublished":"Y","status":"R"},{"id":"12ee2996-f853-4987-823f-667a05fccbbf","name":"Tollbar Academy","isPublished":"Y","status":"R"},{"id":"23bc8e38-6bc8-4da3-a291-14c8b9b31328","name":"University Academy Holbeach","isPublished":"Y","status":"R","vacancies":"F"},{"id":"5834f4e6-a267-40fb-9809-a1d4857da843","name":"Cleethorpes Academy","isPublished":"Y","status":"R"},{"id":"5c8f2250-88e7-4ec3-94af-078ba972eabf","name":"Kesteven and Sleaford High School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"71c000f2-350c-4aae-83f8-eece7cd332b4","name":"Lincoln Castle Academy","isPublished":"N","status":"S","vacancies":"F"}],"trainingProvider":{"id":"eb9baee1-ab34-4e8d-8e1f-3b8dbd48b5a8","code":"24D","name":"St George’s Academy"},"accreditedBody":{"id":"c85cf314-f1cd-41e3-bb90-f76825d601a2","code":"G15","name":"St. George’s Academy Partnership"},"profPost":"BO","degreeGrade":"9","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feeDetails":"Tuition Fees Loans and Maintenance Loans are also available for eligible applicants.\r\n","financialSupport":"•\tSubject Enhancement Courses are available in some subjects which attract a bursary payment.\r\n•\tWe support trainees with additional courses or associated travel costs eg exam board courses, these are considered on an individual basis at the discretion of the partnership.\r\n\r\n* The University of Lincoln is able to provide financial support for some students towards transport costs.","aboutCourse":"The course lasts from September- July, the full academic year.\r\nSt George's Academy Partnership is the accredited provider, the course leads to two qualifications.\r\nFor QTS:\r\n•\tYou will spend 4 days each week in your 'home' school, working alongside your mentor, subject specialists and colleagues.\r\n•\tThere are six days additional days allocated to subject specialist input with twilight sessions in some subjects also.\r\n•\tAfter a period of observation and as you feel confident, your teaching will gradually increase each term.\r\n•\tBy Term 6 your teaching commitment will match that of an ECT ( Early Career Teacher)  so that you are fully prepared for the workload of a qualified teacher.\r\n•\tThere are two assessment points during the year for the PGCE element. The QTS element is assessed formatively throughout the year.\r\nFor PGCE:\r\n•\tYou will spend one day each week at The University of Lincoln.\r\nThe day is split into two half days.\r\n•\tResearching Education, The Foundations of Education and preparation for the Action Research & PGCE qualification\r\n•\tThe classroom based input covers all elements of teaching and learning linked to The Teacher Standards.\r\n\r\nYou will have full access to all the facilities of The University of Lincoln.\r\n\r\n\r\n","interviewProcess":"St George's Academy Partnership has a rigorous selection and recruitment process. If shortlisted, you will be invited to interview.\r\nThe interview process involves:\r\n•\ta meeting with the SCITT Team followed by a written task\r\n•\ta presentation\r\n•\tan informal meeting with a subject specialist\r\n•\tan interview with members of the SCITT Board\r\nDuring the day you will meet your potential mentor, departmental colleagues and ITT Lead so that you have a clear idea who you will be working with throughout your training year.\r\nYou will be contacted later that day to confirm if you have been successful.\r\nIf successful, you will also have the opportunity at a later stage to meet with colleagues at the University of Lincoln to discuss the PGCE course and ask any questions you may have about this element.\r\n\r\n","howSchoolPlacementsWork":"St George's Academy Partnership consists of seventeen partner schools across Lincolnshire. We have large comprehensive schools in urban settings, schools in rural locations and selective single sex and mixed grammar schools within the partnership.\r\n•\tYou choose your 'home' school and apply directly to that school on Apply. This gives you the opportunity to select a school which is a 'good fit' for you.\r\n•\tYou will spend 5 out of 6 terms in your 'home' school.\r\n•\tTerm 3 Jan-Feb is spent in your 2nd placement school.\r\n•\tWe work with you when selecting your second placement school to ensure that you experience a contrasting setting.\r\n•\tWe take into account your personal circumstances re: transport, childcare etc when arranging your second placement.\r\n•\tAs we are an 11-16 provider, you will be assessed in KS3 and KS4 only.\r\n•\tAll of our trainees gain some experience working with KS5 students.\r\nTrainees also spend one week in a primary school in October to ensure that they are familiar with the KS2 curriculum.\r\n","personalQualities":"We are looking for applicants who have a passion for their subject and a commitment to improving the lives and outcomes of young people. You will need to demonstrate consistently high standards of personal and professional conduct and be a proactive, resilient and flexible member of a team.\r\nIdeally, we would like you to have some classroom experience so that you know it is the right career for you. We can help you gain experience in any of our partner schools.","otherRequirements":"You will need to disclose any criminal convictions, cautions or bind-overs and agree to an enhanced criminal record check through the Disclosure and Barring Service (DBS). This is the government scheme that replaces the Criminal Records Bureau. If you would like to discuss your circumstances with us before you apply, we are happy to advise.\r\nWendy Procter: 01529 301193\r\n","status":1,"createdAt":"2021-07-12T13:49:10.780Z","updatedAt":"2021-09-14T13:20:20.069Z","canSponsorStudentVisa":"no","cycle":"2024"}
