{"id":"0c36f887-4d0e-43ff-b4fd-aa2d73775e3b","name":"Physics","code":"2B9L","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"bf97cd0a-224c-43d3-a021-84143df13e8d","code":"F3","name":"Physics"}],"locations":[{"id":"514db6cd-c601-4551-81a8-068a9f4f226a","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"bd7507b5-fbd7-425d-bea0-0be02a292a19","code":"1FP","name":"Waldegrave Training Alliance"},"accreditedBody":{"id":"33037eab-f75d-4350-b1e2-967c41e9d4c6","code":"R48","name":"Roehampton University"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"The content of the course is wide and varied and ensures that all trainee teachers have access to the best quality training and support from both the school and the universities we partner with. \r\n\r\n* Working alongside, observing and being mentored by highly effective and successful teachers\r\n* Excellent subject specialist lecturers with a world class reputation at Roehampton University\r\n* Regular tutorial time with subject specialists\r\n* How children learn and the theory of teaching and learning\r\n* Subject specific content for the curriculum at KS3, KS4 and KS5 in your subject area\r\n* Behaviour management for teachers and learners\r\n* Supporting the SEND learner in your subject\r\n* The role of the tutor and pastoral support for students\r\n* Safeguarding students and teachers in a school context\r\n* Professional practice for teachers\r\n* You will spend the majority of your time in your placement school with one day a week at University\r\n* Assessment will take the form of classroom observations and written assignments \r\n* You will attend training opportunities across schools in the Alliance\r\n","interviewProcess":"Waldegrave School is the lead  school in the Alliance and will be coordinating the recruitment process for all WTA schools.  Interviews will include a panel of professionals from across the Alliance and will usually have one representative from the likely main placement school.\r\n\r\nInterviews will involve at least a half day spent at one of the schools and will include:\r\n\r\n* A written task\r\n* A tour, usually led by students\r\n* A presentation on a given theme\r\n* A panel interview\r\n\r\nCandidates approved by the school will also undergo an approval process at the university which may consist of another interview. Staff from the universities may be part of the school selection panel, as will staff from Alliance schools. The selection process will be thorough and rigorous, in order to help us place trainees at suitable placement schools.\r\n","howSchoolPlacementsWork":"Placement schools are selected for candidates following a careful process of working with local headteachers to establish where our best subject specialist mentors are placed across the borough and what school recruitment needs are likely to be in the future. Most first placements (A) will be decided by late June and the second shorter placement (B) in early September once school staffing has been agreed.\r\n\r\nYou will have two placements (the A-B-A model).  Placement A runs from September to February half term and placement B from February until Easter.  Trainees will then return to their placement A school until June.   The settings are contrasting to ensure breadth of experience. \r\n\r\nThe Alliance has teaching opportunities in the full secondary range from 11-18.  If you have a placement in a school which is currently 11-16 you will be given the opportunity for KS5 experience at another school.  There are 10 schools in the Alliance and Schools Direct trainees will have one main placement and one second placement across the year.\r\n \r\nYou will spend 4 days a week in school and one day at University on a Wednesday. This day will give you essential time out from the school classroom to build your knowledge and experience and reflect on your placements. \r\n \r\nRichmond Borough is a small locality and all schools within the partnership have excellent local transport links. All teachers will be placed in the borough. \r\n \r\nAll trainees will be assigned to a tutor group and mentor throughout their placements. \r\n \r\n","personalQualities":"","otherRequirements":"You will ideally have some experience of working with young people, perhaps through volunteering, youth clubs or sports teams.\r\n\r\nWe recommend that you gain some experience in a classroom prior to interview.\r\n\r\nAll places on the PGCE are subject to satisfactory health and criminal convictions assessments. Applicants will be required to complete an enhanced Criminal Records Bureau Disclosure and Barring Service (DBS) check. ","status":1,"createdAt":"2021-07-06T10:48:03.939Z","updatedAt":"2021-10-13T11:07:19.264Z","canSponsorStudentVisa":"yes","cycle":"2024"}
