{"id":"c2b75b29-3a90-41f9-95e2-455d97abd129","name":"Art and Design","code":"38NP","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"d461a678-3335-4ca2-9616-1dc479d31a49","code":"W1","name":"Art and design"}],"locations":[{"id":"cc7f3618-a64f-496c-9093-c3c9b8ec4284","name":"Yorkshire & the Humber","isPublished":"Y","status":"R","vacancies":"F"},{"id":"52b8d328-755b-4c4d-aceb-14fd41dca15f","name":"Educate Group Initial Teacher Training Main Site 1","isPublished":"Y","status":"R","vacancies":"F"},{"id":"daf05cbe-b4cc-4d83-95d1-c03fa93f5a0d","name":"West Midlands","isPublished":"Y","status":"R","vacancies":"F"},{"id":"60085cd3-6815-4955-a8b8-fcb52b5cc733","name":"Educate Group Initial Teacher Training Main Site 2","isPublished":"Y","status":"R","vacancies":"F"},{"id":"f01dbd8d-07fb-4e1f-90fa-e8d3cfc387e0","name":"North East","isPublished":"Y","status":"R","vacancies":"F"},{"id":"0e1ecc8f-e139-4ccd-98b5-9b3c71ba21cd","name":"South East","isPublished":"Y","status":"R","vacancies":"F"},{"id":"e6b808ae-2e29-4f2b-a206-9efccb6966db","name":"East Midlands","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"4808c596-11e0-4586-8cb4-116a1d9838b3","code":"E65","name":"Educate Group Initial Teacher Training"},"profPost":"BO","degreeGrade":"9","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"Degrees should be closely related to the subject you wish to train in. Higher academic qualifications in your chosen subject will support your application where this is not the case.","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Educate offer equivalency tests in English, maths and science should they be required.  Please check prior to booking with an alternative provider that we will accept their equivalency test.","courseLength":"OneYear","feesUK":9250,"feeDetails":"The QTS programme with PGCE costs £9,250, for which a student tuition fee loan can be accessed.\r\n","aboutCourse":"Secondary SCITT trainees spend a full-time year teaching and training in schools, but also attend provider-led lecture/workshop sessions to enhance understanding of the Secondary curriculum,  the trainee's main subject, general classroom practice and teaching pedagogy.\r\nCentralised training days cover content such as Behaviour Management, an Environment for Learning, Planning and Adaptive Teaching, Diversity, Inclusion and SEND, Assessment, Improving Classroom Practice, ICT and e-safety and Lifelong Literacy (SPAG).  This is supplemented by opportunities to observe other teachers in a range of school settings and to undertake a variety of school-based training enhancements.\r\nAll trainees submit three assignments throughout the year as an integral part of the teaching and assessment programme:\r\n1. A School Based Independent Study (a Child Study)\r\n2. Teaching and Learning through a Scheme of Work\r\n3. Effective Assessment Strategies\r\n\r\nTrainees are supported to improve their knowledge, understanding and application of the Educate Initial Teacher Education (ITE) Curriculum, leading to the development of classroom practice skills and their professional teaching role.  Final assessment is made on a trainee's ability to meet the Teachers' Standards. ","interviewProcess":"After application, suitable candidates are invited to interview.\r\nThe interview consists, as a minimum, of\r\n•\tthe assessment of personal qualities and attributes\r\n•\tassessment of the ability to communicate effectively\r\n•\tan assessment of the literacy and numeracy skills required to teach\r\n•\tan evaluation of current educational knowledge and understanding\r\n•\ta presentation\r\n•\tquestions and discussion.\r\nPlease note that an offered place is subject to the endorsement of a base training school. The Head teacher will apply appropriate procedures to ascertain a candidate's potential to be a trainee teacher, usually based on observations of personal characteristics and interaction with staff and pupils whilst in the school and classroom.\r\n","howSchoolPlacementsWork":"For our SCITT programme, candidates find their own school in which to train. This gives schools and candidates a unique element of choice and independence. It allows candidates to approach schools according to their own preference of location and type.\r\nTrainees spend the majority of the year in their base training school, but have a six-week placement in a contrasting school. The programme is also supplemented by short placement visits to a special school, a Primary setting, a post-16 setting and a school with EAL provision.\r\nThe Educate SCITT partnership is currently spread across training hubs centred in Grantham, Leeds, Middlesbrough and Wrexham. Trainees need to be able to travel to one of these centres for their provider-led training days.\r\n","personalQualities":"We are looking for confident and capable applicants who demonstrate true commitment to a teaching career and a robust, determined, positive attitude. We are looking for trainees who can fit very well into their school team, who can respond positively to feedback and who can make a valuable contribution to school life. We are not looking for a 'finished product' but for trainees who demonstrate real potential to succeed. Candidates should be able to communicate effectively with a whole range of people and be engaging, warm and sociable. They should be organised, prepared and professional.","otherRequirements":"Enhanced Criminal Record Check.","status":1,"createdAt":"2021-07-06T10:48:01.148Z","updatedAt":"2021-09-07T12:06:48.687Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
