{"id":"14c6d9fa-43a4-42c1-9854-8dc9214bb130","name":"Mathematics (SEND)","code":"F837","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"other","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"yes","subjects":[{"id":"72345aa7-096c-488f-8649-085b8178cadb","code":"G1","name":"Mathematics"}],"locations":[{"id":"92974af9-8eec-44ee-a672-52b0cd8cbcaf","name":"The Beech Academy","isPublished":"N","status":"N","vacancies":"F"},{"id":"a1471a93-dd4c-4f63-a6a0-580ba8c595a3","name":"The Brunts Academy","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"cd6b0737-60ec-4903-8006-6a2d87f0a8b7","code":"1BO","name":"The Evolve Trust"},"accreditedBody":{"id":"aa023df3-b71e-4249-b9c4-41fca8bd135e","code":"D39","name":"University of Derby"},"profPost":"PG","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feeDetails":"The following is included in our fees;\r\n- Range of in class visiting/expert speakers to enhance module content e.g. Homophobic bullying input, Behaviour Management, Honour Based Violence, PSHE\r\n- Access to Derby Open Centre\r\n- Interview preparation/supporting job applications - Local Head teachers and the unions\r\n- Professionalism input – Unions (free)\r\n- Teaching School Alliance hub training sessions               \r\n- Access to Derby Library Services \r\n- Specialist link tutor\r\n- Trained mentor on placements\r\n- Enhanced Placement Opportunity - 1 week alternative placement covering a range of providers and settings\r\n- Two main placements in two different schools in their Teaching School Alliance partnership\r\n- DBS","aboutCourse":"The School Direct course is a flexible approach to teacher training. The majority of your time will be spent in school, training in the classroom and being supported by experienced teachers and mentors. You will also spend time studying at the University.  Successful completion of the course leads to Qualified Teacher Status (QTS)* and a postgraduate qualification.\r\n \r\nYou will be a registered student with University of Derby and your qualification will be an UoD award. This means that UoD has responsibility for the quality of your training and you will benefit from the combined expertise of the University and lead placement school. \r\n\r\nWith intensive support in the classroom and the guidance of University experts, you will be fully prepared for the practical demands of secondary teaching in your chosen subject specialism. \r\n\r\nAs part of the course, you will undertake three fully assessed teaching placements, supported throughout by our trained school mentors and subject link tutors.  You will also spend time at the University to help put your school experience in the context of educational policy, principles and evidence-based practice.\r\n\r\nYou will also focus on a diverse range of topics including SEND policy and legislation, effective inclusive practice, and meeting the challenges of teaching in the SEND sector.\r\n","interviewProcess":"Following the submission of a successful application form candidates will be invited for an interview.  This will involve;\r\n- a tour of the academy\r\n- a student panel activity\r\n- teaching a 30 minute lesson\r\n- an opportunity to observe a lesson\r\n- literacy and numeracy competency tests\r\n- a formal interview\r\n","howSchoolPlacementsWork":"In the first school term successful candidates will spend;\r\n1 day a week at University\r\n3 days a week at Beech Academy \r\n1 day a week at Brunts Academy\r\n\r\nDuring the second school term, for Spring 1, this pattern will change to;\r\n1 day a week at University\r\n4 days a week at Brunts\r\n\r\nThe remainder of the year will follow the same pattern as in the first school term.\r\n\r\nCandidates will also spend a minimum of 2 days at a primary school in the first term.  During the primary placement candidates will:\r\n* begin to appreciate the similarities and distinctiveness of learning and teaching in KS2 and the primary phase more generally;\r\n*gain awareness of pupils’ capabilities and prior knowledge in the key stage immediately prior to that for which they are training; \r\n*contribute to their growing knowledge and understanding of standards, progression and transition in their subject/related disciplines. \r\n\r\n","personalQualities":"You need to be able to demonstrate that you;\r\n- are passionate about your subject and desire to be a teacher\r\n- have the ability to communicate effectively\r\n- are enthusiastic\r\n- are confident\r\n- are dedicated \r\n- are organised\r\n- are creative\r\n- are self-aware and reflective\r\n\r\n","otherRequirements":"A Disclosure and Barring Service (DBS) check is required at the point of accepting a place at the University. The Disclosure and Barring Service was established when the Criminal Records Bureau (CRB) and Independent Safeguarding Authority (ISA) merged in 2012 and will now provide the criminal records checking service for this course.","status":2,"createdAt":"2021-07-06T10:49:33.448Z","canSponsorStudentVisa":"yes","cycle":"2024","applicationsOpenDateOther":"2021-11-17T00:00:00.000Z"}
