{"id":"2b630db4-8b05-45a3-907d-07c4e076de73","name":"Art & Design","code":"FD11","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"d461a678-3335-4ca2-9616-1dc479d31a49","code":"W1","name":"Art and design"}],"locations":[{"id":"a1471a93-dd4c-4f63-a6a0-580ba8c595a3","name":"The Brunts Academy","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"cd6b0737-60ec-4903-8006-6a2d87f0a8b7","code":"1BO","name":"The Evolve Trust"},"accreditedBody":{"id":"d2b7d074-fac9-42c5-a0d3-d5471b35f7d9","code":"N91","name":"Nottingham Trent University"},"profPost":"PG","degreeGrade":"1","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"financialSupport":"As a School Direct trainee, you will be entitled to the same financial support as trainees on other postgraduate teacher training courses.\r\n\r\nIf you are a UK or EU trainee, you should be eligible for a student loan, maintenance loan or maintenance grant to cover the cost of your study, and will only start paying the loans back when you start earning over £21,000 per annum.\r\n\r\nYou may be eligible to receive a training bursary, dependent on the subject you train for and a degree classification.\r\n","aboutCourse":"The School Direct course is a flexible approach to teacher training. The majority of your time will be spent in school, training in the classroom and being supported by experienced teachers and mentors. You will also spend time studying at the University.  Successful completion of the course leads to Qualified Teacher Status (QTS)* and a postgraduate qualification.\r\n\r\n  *The title of this award is subject to change due to an ongoing government consultation. For the latest information, please visit www.gov.uk/dfe\r\n\r\nYou will be a registered student with NTU and your qualification will be an NTU award. This means that NTU has responsibility for the quality of your training and you will benefit from the combined expertise of the University and lead placement school. \r\n\r\nThis secondary PGCE teaching degree is based around five modules which are core to all trainees.  The curriculum has been organised so that you will gain substantial support for the study of all modules at the start of the course through front-loaded University-based sessions, before your placements begin. The Learning and Teaching in the Subject module will largely be completed in this period, meaning that you will have clarity about academic expectations and your tutors will have an insight into required support. The other modules will be completed at different stages during the year to ensure both reasonable workload and to allow for the progressive impact of the Learning and Teaching in the Subject and Learning and Teaching in the Wider Context modules (underpinned by the Skills of Enquiry module which is assessed across these two modules) on the Secondary Education Independent Study and Secondary Professional Practice modules which run right until the end of the courses.\r\n","interviewProcess":"Following the submission of a successful application form candidates will be invited for an initial interview at NTU prior to being interviewed at the Lead School, Brunts Academy.\r\n\r\n","howSchoolPlacementsWork":"Successful candidates will spend the majority of their time at Brunts Academy where they will be assigned a subject specific mentor and undertake the teaching, in their chosen subject area, of students from age 11-18 as appropriate.  Some days will be spent at University - see course content.\r\n\r\nCandidates will spend a minimum of 2 days at a primary school in the first term.  During the primary placement candidates will:\r\n* begin to appreciate the similarities and distinctiveness of learning and teaching in KS2 and the primary phase more generally;\r\n*gain awareness of pupils’ capabilities and prior knowledge in the key stage immediately prior to that for which they are training; \r\n*contribute to their growing knowledge and understanding of standards, progression and transition in their subject/related disciplines. \r\n\r\nCandidates will also undertake a second placement at the beginning of the spring term at another school/academy.  This placement is arranged by the Director of ITT.  This provides candidates with an opportunity to broaden their experience by teaching in a school in a different setting/location/context.\r\n","personalQualities":"Every day you'll get the chance to inspire young people and use your skills to give something back – making sure every pupil gets the same access to a quality education and the opportunity to succeed. \r\n\r\nYou will need:\r\n*good communication skills\r\n*good organisational skills\r\n*the ability to develop relationships with others\r\n*to be passionate about your subject \r\n*to be dedicated to teaching\r\n","otherRequirements":"Candidates will be subject to an interview with both the training school and NTU as part of the selection process.  \r\n\r\nCandidates will undertake:\r\n*Disclosure and Barring Service check; \r\n*Prohibition Order check. \r\n\r\nTwo references are required, one academic and one vocational.  Evidence of mainstream UK school experience (paid or voluntary) in their application is desirable, although not essential.\r\n","status":1,"createdAt":"2021-07-06T10:49:33.483Z","updatedAt":"2021-09-19T14:18:41.697Z","canSponsorStudentVisa":"yes","cycle":"2024"}
