{"id":"4281330b-1918-4874-b195-4068d69e6897","name":"Physics","code":"E449","qualification":"qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"bf97cd0a-224c-43d3-a021-84143df13e8d","code":"F3","name":"Physics"}],"locations":[{"id":"88ac1d51-4b8a-45c5-a61a-2ee5a75ca468","name":"Main site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"3662bd08-5f53-40bf-8768-4aeb4e5243e4","code":"28T","name":"London School of Jewish Studies (LSJS)"},"degreeGrade":"9","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We are able to recommend an approved provider for the equivalency tests.","courseLength":"OneYear","feesUK":6200,"financialSupport":"You can benefit from an untaxed Bursary of £7,000 if you have a 2:2 or above","aboutCourse":"The course combines an intensive programme of initial teacher training with real experience and responsibility. The aim is to develop your competence, confidence and skills in the classroom and with students in secondary school. The course will give you teaching experience across at least two key stages of the 11-18 age range.\r\n\r\nYou will be expected to maintain an extensive professional portfolio showing achievement in relation to the Teachers’ Standards for Qualified Teacher Status (QTS).\r\n\r\nOn the non-salaried route you will slowly be introduced to classroom responsibilities and teach up to 60% of a teacher's timetable.\r\nAfter the year, if you successfully complete your assignments, observations and portfolio, you will gain Qualified Teacher Status.\r\n\r\nThe course includes:\r\n\r\nBespoke 1:1 mentoring\r\nFortnightly lectures\r\nSubject specific and general pedagogy sessions\r\nFortnightly shiur (talk) for trainees who specialise in Jewish Studies\r\nGeneral pedagogy sessions include topics such as: behaviour management, assessment techniques, differentiation in the classroom\r\n\r\nWe also run a bi-annual specialist trip to Israel for 5 days\r\n\r\nExcellent relevant training is provided by expert practitioners and subject specialists, tailored to the individual needs of trainees.\r\n","interviewProcess":"We will invite candidates for interview once a UCAS application has been received.\r\n\r\nTested in English and numeracy competency.\r\n\r\nTeach a lesson in their chosen school or lead school with LSJS and school panel present\r\n\r\nHave an interview with a panel comprised of a Head Teacher, the programme coordinator and any other relevant member of staff according to the school interview policy and safer recruitment policy. \r\n\r\nThe interview day is a chance for prospective trainees to find out further information about the course and the school and to have any questions answered. \r\n","howSchoolPlacementsWork":"You will work in your chosen school full time (or part time as agreed with your host school) and be responsible for both planning and assessment of your classes.\r\n\r\nPlacements will include:\r\n•\tbespoke 1-1 mentoring\r\n•\tweekly observations\r\n•\ta swap to teach in a different partnership school\r\n•\ta placement in a contrasting setting\r\n•\ta primary school visit\r\n•\ta special needs school visit\r\n•\tresidential trip to outstanding schools\r\n\r\n","personalQualities":"•\ta desire to work within the secondary school sector.\r\n•\tthe ability to work hard as part of a team and to inspire young people.\r\n•\tan ability to organise and manage themselves personally and professionally.\r\n•\tan understanding of equal opportunities and safeguarding.\r\n•\tstrong communication skills, both written and spoken.\r\n•\ta commitment and passion for their chosen subject.\r\n•\ta proven track record of excellent attendance and punctuality\r\n•\ta high level of professionalism and discretion and the ability to act as a role model for young people.\r\n\r\nKnowledge of a second language is highly recommended \r\n","otherRequirements":"Trainees will be required to obtain a DBS enhanced certificate.\r\n\r\nIf you have spent time abroad within the last 5 years trainees will be required to provide overseas criminal police checks.\r\n\r\nSafeguarding checks including teacher barred lists will be undertaken by the Lead school.","status":1,"createdAt":"2021-07-06T10:55:16.065Z","updatedAt":"2021-09-20T09:42:37.449Z","canSponsorStudentVisa":"no","cycle":"2024"}
