{"id":"5e402f2f-8e87-480c-990f-e2935f9aa1a2","name":"Physical Education","code":"38N3","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"74d64a54-5e34-4590-b6c7-528dd0cf26fe","code":"C6","name":"Physical education"}],"locations":[{"id":"327b119f-6614-4622-9523-6e109321e10e","name":"The Burgate School and Sixth Form","isPublished":"N","status":"S","vacancies":"F"},{"id":"7d9797de-7319-4321-abf8-2457d22cdd1d","name":"Ferndown Upper School","isPublished":"Y","status":"R"},{"id":"5993f4d4-8ebe-4890-93e4-dc4944f4e8ba","name":"Parkfield School","isPublished":"Y","status":"R"},{"id":"fca7c9f4-f044-4960-b7ff-ac00b8a718ff","name":"Ringwood School - Lead School (Main Campus)","isPublished":"N","status":"S"}],"trainingProvider":{"id":"eb5eb912-c69f-40c3-a3ac-4086d4bebf18","code":"1G3","name":"Ringwood School Teaching Alliance"},"accreditedBody":{"id":"3700fb02-7007-40c8-9127-b070e146d6cb","code":"W76","name":"University of Winchester"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"The University of Winchester no longer imposes a limit on how many GCSE equivalency tests a candidate can have in place of GCSEs.\n\nThe University of Winchester's two approved equivalency testing companies are:\n•\tEquivalencytesting.com\n•\tAstarequivalency.co.uk","courseLength":"OneYear","feesUK":9250,"feeDetails":"Tuition fees for September 2022 entry are £9,250 for UK, Republic of Ireland, Channel Islands and Isle of Man students. However the tuition fee for EU students (excl. UK & ROI) is yet to be confirmed for 2022 entry.\r\n\r\nPlease contact; studentsandmoney@winchester.ac.uk for confirmation of the EU fee\r\n\r\nFor further information about funding please go to: (https://beta-getintoteaching.education.gov.uk/)\r\n\r\nThe fee for International Students has yet to be confirmed","aboutCourse":"Both training and salaried routes will benefit from:\r\n\r\n* QTS (Qualified Teacher Status) and PGCE (Post Graduate Certificate in Education) with the opportunity to gain 60 credits towards a Masters degree\r\n*  a school based experience in your main host school\r\n* a second placement school experience in a diverse setting\r\n* curriculum mentoring from a subject specialist in your host school and a University tutor\r\n* University subject days and quality assurance\r\n* University and in-school training days\r\n* familiarisation sessions\r\n\r\nThe course prepares you to teach across KS3 and KS4 (age ranges 11-16) and is structured around six modules - a combination of taught modules based at the University and placement modules based in schools or educational settings.\r\n\r\nYou will undertake studies in all elements of secondary education; extend your knowledge of teaching and learning, the breadth and scope of the curriculum and the professional skills associated with high-quality teaching. You will then apply these areas of understanding and skill to classroom practice throughout the year.\r\n\r\nIn broad terms, the assessed school placement requires trainees to:\r\n\r\n* know the structure and requirements of the National Curriculum as they relate to teaching at KS3 and KS4 (11-16)\r\n* be able to plan, teach, assess and evaluate lessons, meeting the level of practice expected of teachers according to the Teachers' Standards (DfE 2012)\r\n* identify professional strengths and areas for development\r\n\r\nUpon successful completion of the course you will be awarded a PGCE with recommendations for the award of QTS.\r\n","interviewProcess":"As Lead in our Alliance, Ringwood School will co-ordinate the recruitment process.  This will include planning and delivering a short teaching episode, presenting to a panel on an area of teaching and learning, followed by a formal interview exploring your subject knowledge with key leaders and a representative from The University of Winchester.\r\n\r\nApplicants for Initial Teacher Education (ITE) courses are longer required to complete Skills Tests for Numeracy and English.  It is the responsibility of the ITE provider to ensure that all trainee teachers have acquired and demonstrate an appropriate proficiency in English and Mathematics before they can be awarded Qualified Teacher Status at the end of their course.\r\n\r\nTherefore, the interview process will include fundamental skills tests in English and Mathematics in the form of a reflective written task to assess your written English and a Maths audit. \r\n\r\nCandidates will attend one interview and the venue will normally be Ringwood School (except for Primary where interviews will be held in a relevant primary setting).\r\n\r\nWhere possible, a pre-visit will support the selection process and is encouraged by all partnership schools. Where a placement is at another school, staff from that school will attend interview. We would recommend that following your notification of interview you make contact with the host (main) school so that a visit can be arranged prior to your interview date. \r\n\r\nIt is a rigorous and thorough process, designed to get the best match of applicant to the places available across our partnership of schools.\r\n","howSchoolPlacementsWork":"Ringwood School Alliance comprises of various secondary and primary schools across Dorset, Hampshire and Wiltshire with Ringwood School as lead. Ringwood School is centrally located on the boarder of Hampshire and Dorset within a 25 mile radius of all alliance schools.\r\n\r\nApplicants are free to decide the subject, school and route they wish to apply for via DfE Apply under the Provider Code 1G3. Where multiple schools in our Alliance have same subject places candidates need only apply to one, but can request to be considered by other schools in the Alliance depending on preference and distance.  Upon consideration of applications, interested schools attend interview at one venue (usually Ringwood School). Following a successful interview IF more than one school wish to offer a place, candidates have the final decision on their chosen school subject to having made an experience visit to all interested schools.\r\n\r\nTrainees commence their one year 'main' placement in September at the beginning of the Autumn Term and are in the classroom from the start.  A second placement of 6 weeks in a different school environment takes place from January to February half term (normally in another school within our Alliance). \r\n\r\nTrainees are based in their main school 4 days per week, teaching a percentage of the timetable and being observed in lessons (on average around once a week).  Fridays are set aside for Professional theme training either at the University of Winchester or an Alliance school. Each trainee is allocated a subject mentor and time is allocated for weekly meetings.  There is also regular support from a Professional Mentor and admin support from the School Direct Coordinator. A tutor, in the appropriate subject field, is also assigned by the University of Winchester.  \r\n\r\nThe trainee is required to complete 3 termly Review Statements and an Interim Review where required.","personalQualities":"We are looking for ambitious trainees who are enthusiastic about teaching and have a desire to share that with young people of all abilities.  We will look for evidence of a commitment to the teaching profession, an understanding of professional requirements, and an awareness of current educational issues in an application. Prior experience in a school is not required, however prospective students may find experience in a school useful for obtaining insights into the secondary education classroom. Experience in a school or similar setting may also provide reassurance to prospective students that teaching is the right choice for their career.","otherRequirements":"If you accept an offer of a place you will be required to complete a Disclosure and Barring Service (DBS) criminal records check and Prohibition Order check. If you have spent time overseas in the last 5 years you may also be required to obtain criminal records checks from each of the countries you visited. You will also be required to complete an occupational health check to confirm that you are fit to teach. The University of Winchester will send you more information about when and how you need to complete each of these checks if you accept our offer.\r\n","status":1,"createdAt":"2021-07-06T10:54:56.583Z","updatedAt":"2021-10-04T19:14:36.311Z","canSponsorStudentVisa":"yes","cycle":"2024"}
