{"id":"51cd5a1f-8bea-44af-9423-50b5f9e93696","name":"Art and design","code":"N447","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"d461a678-3335-4ca2-9616-1dc479d31a49","code":"W1","name":"Art and design"}],"locations":[{"id":"7acd4156-4edf-4752-8f79-55eb7351639c","name":"The Sele School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"8cc8541b-d2cf-46bf-b6be-1cf604eae901","code":"1N6","name":"Richard Hale School/The Sele School Partnership"},"accreditedBody":{"id":"feecdec5-259c-45e3-b1cf-4e391936ee90","code":"H36","name":"University of Hertfordshire"},"profPost":"PG","degreeGrade":"1","additionalDegreeSubjectRequirements":"false","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feesInternational":14505,"feeDetails":"Fees provided are the current figures. Please check on application for up to date figure.","financialSupport":"See DfE bursaries for this subject.","aboutCourse":"The PGCE Secondary course is a full time, one year Initial Teacher Education qualification introducing you to the requirements for teaching to the 11 – 16 age range. Where appropriate, opportunities to experience post 16 provision will be available. It has been designed to enable you to demonstrate evidence of having met the Teachers’ Standards that lead to Qualified Teacher Status. You will complete the course with PGCE and QTS. We strongly believe that innovative and effective teaching and learning is made possible through a teacher’s full engagement with research informed practice and underpinning theories of learning. This is fostered in two modules and developed through School Based Training. You will be well supported in becoming a critically reflective teacher capable of inspiring pupils to learn, achieve and flourish.\r\n\r\nYou will be supported and taught by specialist tutors with excellent experience, knowledge and research informed expertise. Partnership schools provide opportunities for you to learn about pedagogical approaches relevant to your subject specialism and the professional responsibilities of all teachers.\r\n\r\nYou will have two School Based Training placements, where, with the support of a teacher mentor and a university subject tutor, you will develop your skills to become an excellent classroom teacher. Training to teach is exciting, rewarding and demanding. By the end of the course you will be well prepared for employment as an Early Career Teacher (ECT). \r\n","interviewProcess":"The ability to train to teach is assessed first on application and then at interview. The interview day is a two-way process in which we encourage all applicants to ask questions to ensure that our PGCE course is suitable for them. \r\n\r\nWe are looking to select student teachers who:\r\n* have the passion, commitment and enthusiasm to teach their specialist subject in secondary schools\r\n* have a strong knowledge, understanding and interest of the specialist subject that they wish to train to teach in\r\n* are committed to working with children and adolescents and improving their educational outcomes\r\n* have an understanding of the role of the teacher and the demands of the teaching profession\r\n* have excellent communication and interpersonal skills\r\n* have the ability to reflect upon what they are doing and can respond well to feedback\r\n* are resilient and able to work under pressure\r\n\r\nIf invited to interview, you will be greeted by the ITT Lead Teacher and  be given a brief introductory talk on the PGCE programme, followed by the completion of a short written task and check of your qualifications (originals will need to be provided). You will then deliver a short activity in your subject specialism to a group of students. This will be followed by a one-to-one interview with the ITT Lead and at least one other member of staff or SLT.\r\n","howSchoolPlacementsWork":"Schools in the University of Hertfordshire schools' partnership have a proven track record of strong engagement with Initial Teacher Education.  Schools are evaluated and monitored in relation to the quality and effectiveness of school based training provision.  School’s commit to enact the terms of the University of Hertfordshire Partnership for Initial Teacher Education. \r\n\r\nDuring the course you will undertake School Based Training in two contrasting secondary schools:\r\n* The first school placement will be the home school (either Richard Hale School or Sele School) and will run from September to December.\r\n* The second school placement will take place during the first half term of the Spring term, lasting 6 weeks. This will be at a contrasting setting in another school which also works with the University of Hertfordshire. This setting will be decided during the first placement.\r\n*The final placement runs from February to the end of June. Trainees return to the home school for this placement.\r\nYour School Based Training will total a minimum of 120 days. In addition to the two main placements you will: \r\n* visit a primary school to consider Year 6 transition\r\n* visit a special school to explore effective differentiation and inclusion for pupils with complex learning needs\r\n* visit a school demonstrating excellent provision for pupils with English as an additional language\r\n","personalQualities":"In your application and during the interview process, you will need to demonstrate an ability to train to teach through the following:\r\n* Genuine care for children’s learning, progress and achievement\r\n* A commitment and passion for your subject specialism\r\n* Your motivation and interest in training to teach\r\n* Excellent interpersonal and communication skills\r\n* A commitment to working with children and adolescents and improving their educational outcomes\r\n* The ability to be organised, adaptable and resilient\r\n* A willingness to work and learn from others and to be responsive to feedback\r\n","otherRequirements":"\r\nYou will be required to complete a Disclosure and Barring Service (DBS) check and a Declaration of Disqualification by Association form. You will also need to respond to targeted and relevant health questions. Guidance will be provided after you have been offered a place.\r\nWe recommend that you undertake observation time in a state secondary school prior to interview but this is not essential. [Activities to support observation in school - either before or after interview - that you may find useful](https://www.herts.ac.uk/__data/assets/pdf_file/0006/164436/Secondary-School-experience-tasks.pdf)\r\n","status":1,"createdAt":"2021-12-02T14:51:18.846Z","updatedAt":"2021-12-02T14:52:24.695Z","canSponsorStudentVisa":"no","cycle":"2024"}
