{"id":"63e0b10e-7169-48d8-8a91-c41a0c7a741b","name":"Chemistry","code":"298V","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"912d4fb4-761b-42e9-8dc6-e968b791ea4e","code":"F1","name":"Chemistry"}],"locations":[{"id":"3ade54ca-2615-4bbb-8b37-b54797557ec0","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"7de12b69-695f-4948-83a8-75c63265f242","code":"1QM","name":"Northamptonshire Teaching School Hub"},"accreditedBody":{"id":"3e6c62a3-5d34-4a91-9c23-01c7409fd909","code":"L34","name":"University of Leicester"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Please refer any questions to the Admissions Office in the first instance.\n\nCandidates will be required to arrange and fund equivalency tests if required.\n\nPlease refer to (https://www.equivalencytesting.com/) or (https://www.bcu.ac.uk/education-and-social-work/initial-teacher-training/gcse-equivalency-test/gcse-equivalency-tests-non-bcu-applicants) for details of equivalency tests.","courseLength":"OneYear","feesUK":9250,"feeDetails":"Tuition fees for the 2022/2023 academic year are yet to be confirmed.\r\n\r\n","aboutCourse":"In this course, professional and subject theory courses are delivered by the University of Leicester and the two school placements are within the Northamptonshire Teaching School Hub partner schools.  In the first school placement, there will be the opportunity to mix with trainees from other disciplines in supplementary training sessions and to consider the ways in which theory is translated into good practice by outstanding teachers.\r\n\r\nThe PGCE Secondary Science programme aims to:\r\n\r\n* develop your understanding of the role of Science teachers both within the department and in their wider professional responsibilities;\r\n* introduce you to current theories and practice in Science teaching;\r\n* help develop your academic and critical thinking skills to support effective Science teaching and learning for all your students;\r\n* help you set high expectations for yourself and your students; and\r\n* help you to understand what contribution Science education can make to the wider education of young people.\r\n\r\nThe Science course supports the core PGCE Teacher Development Course, through:\r\n\r\n* Specialist sessions to develop your curriculum subject knowledge;\r\n* Exploring effective teaching and learning in Science classrooms;\r\n* Consideration of the role of practical work and your responsibility for safe classroom practice;\r\n* Developing reflective practice to support your planning, delivery and evaluation of lessons; and\r\n* Developing an understanding of recent curriculum change.\r\n\r\nIn addition to your specialist subject sessions and core science sessions, you will be allocated to a mixed team of specialists from all science disciplines in order to develop pedagogy related to science teaching.\r\n\r\nMixed teams and whole science sessions will include focus on:\r\n\r\n* The science curriculum\r\n* Lesson planning\r\n* Behaviour for learning and classroom management\r\n* Assessment\r\n* Literacy and numeracy in science\r\n* Differentiation and inclusion\r\n* Earth science\r\n* ICT in science, including data logging\r\n* Teaching controversial issues in Science\r\n* The Nature of Science\r\n* Science outside the classroom\r\n* Safety issues and risk assessment\r\n* Classroom practice related to learning theories\r\n* Demonstrations and practicals\r\n\r\nContinuous assessment is used throughout the course and there are no examinations.\r\n","interviewProcess":"There is a two-stage interview process.  If invited for interview, you will first meet members of the Teaching School Hub team and will have the opportunity to meet current or former trainees and to see our lead school, Brooke Weston at work.  The interview takes the form of a conversation which will explore your ideas about education and your subject; the object is to ensure that those who join the course will have the best possible chance of becoming good and outstanding teachers.\r\n\r\nIn the second interview, which is at the university, you will meet members of the course team who will give an overview of the course and answer any questions you may have.  You will participate in a group task with candidates from a range of subjects and give a brief presentation as part of a small group.  Subject tutors will introduce a written subject task that you will complete during the day and you will have an individual interview with a subject tutor. The interview is not a daunting process but rather a discussion about your suitability and preparation for going into teaching. During the interview, you will explore any additional preparation needed to help put you in the best possible position to engage successfully with the course from the start.\r\n","howSchoolPlacementsWork":"You will undertake two secondary teaching placements in the Brooke Weston Teaching School Alliance  partner schools. The placements are referred to as 'Phase A' and 'Phase B' placements.\r\n\r\nPhase A\r\n\r\nAfter induction you will spend 8 weeks in your Phase A placement school.   This placement offers ample opportunity to observe and learn from outstanding teachers.  Trainees also have the opportunity to discuss their work and progress with each other and to enhance their understanding of ways to apply what they have learned through a practical school-based programme of professional studies. You will build on existing experience and develop new skills with support from the Coordinator for Initial Teacher Education and a subject mentor who will oversee your professional development. Both will liaise closely with your university tutor who will also support you. During this placement you will be expected to fulfil a 50% timetable.\r\n\r\nPhase B\r\n\r\nDuring your second placement you will spend about 14 weeks in a different school, also supported by a mentor, ITE Coordinator and university tutor.  We try to place trainees in contrasting schools to ensure you have a rich and varied experience in your initial training year and that you have the opportunity to teach across the 11-18 age range. During this placement you will be expected to fulfil a 66% timetable.\r\n\r\nPrimary placement\r\n\r\nAll trainees will also undertake a week in a primary school following their Phase A placement to support their understanding of the broader context of education and to support writing of one of the PGCE assignments.\r\n","personalQualities":"You must have a genuine interest and enthusiasm for science and for working with young people. The PGCE is a challenging course and  applicants need a wide range of skills, knowledge, experiences and an aptitude for teaching. These skills include the ability to form relationships, good communication, commitment to learning and teaching and reflective qualities.\r\nApplicants without Chemistry as a major subject are expected to undertake essential background reading before the course starts.\r\nWe expect all prospective trainees to have spent some days observing, possibly assisting, students and teachers in science classrooms to familiarise themselves with current developments.\r\n\r\n","otherRequirements":"Admission to the course is subject to a satisfactory medical report. The University will provide more information about this should you be offered a place.\r\nAll offers are subject to a satisfactory enhanced DBS disclosure. We will provide instructions regarding the DBS application process once you have accepted an offer of a place on the course.\r\n","status":1,"createdAt":"2021-07-06T10:54:37.560Z","updatedAt":"2021-10-04T16:07:56.536Z","canSponsorStudentVisa":"yes","cycle":"2024"}
