{"id":"dd6b6263-273c-4670-badb-2cfa57a1bb7c","name":"Primary","code":"298R","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"3ade54ca-2615-4bbb-8b37-b54797557ec0","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"7de12b69-695f-4948-83a8-75c63265f242","code":"1QM","name":"Northamptonshire Teaching School Hub"},"accreditedBody":{"id":"d4a65e61-defa-4861-b837-17ef2a1157c7","code":"N38","name":"University of Northampton"},"profPost":"BO","degreeGrade":"1","english":"1","maths":"1","science":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"If you are considering taking a GCSE equivalency test, please contact Admissions for advice prior to your application.","courseLength":"OneYear","feesUK":9250,"feeDetails":"Tuition fees for the 2022/2023 academic year are yet to be confirmed.","aboutCourse":"Throughout the PGCE Primary programme you will be enhancing your subject knowledge in conjunction with curriculum and pedagogic knowledge to enable all children to make progress. \r\n\r\nThere are two modules \r\n* Teaching, Learning and Assessment \r\n* Professional Studies. \r\n\r\nThese are taught at the University of Northampton's new Waterside Campus by experienced and expert tutors and the course aims to address Initial Teacher Training Content, National Curriculum coverage and national priorities in primary education. \r\n\r\nOver the year, there are blocks of centre-based learning events and school experiences. There are assignments, which are spread over the year. The School Experience Library is an excellent resource offered to students to enhance their use of research and resources to inform practice in the classroom. The University of Northampton is rated as Gold in the Teaching Excellence Framework. \r\n\r\nSchool placements are spent in the partnership schools of the Northamptonshire Teaching School Hub, which offer contrasts in size, intake and organisation.","interviewProcess":"Applicants selected for interview will have an individual interview with a member of staff and a teacher from a partnership school.  This will explore an applicant's commitment to teaching, prior experiences and awareness of current educational contexts.  It is intended to be a positive experience, not a daunting one.\r\n\r\nIt is the policy of The University of Northampton that candidates should not be prejudiced as a result of any disability and reasonable adjustments will be made to mitigate unfair discrimination. Therefore, all candidates with disabilities are encouraged to identify and/or request support for actual or potential circumstances.\r\n\r\n","howSchoolPlacementsWork":" The PGCE programme includes three school experiences and one self organised experience. The normal pattern is referred to as ABA where the autumn term and summer term are based in school A in the same class and the spring term in school B in the alternative key stage.  \r\n\r\nBoth school A and school B are Northamptonshire Teaching School Hub partner schools and are chosen to give a good contrast, to help trainees to become confident of their ability to teach in any school.  In each school, an experienced teacher will mentor a trainee to offer support and challenge.  Mentors work closely with the university.\r\n\r\nThe self-organised experience normally takes place in the spring term. ","personalQualities":"To be considered for entry for the PGCE, prospective candidates must have the necessary personal attributes, meet the entry requirements required by the Teacher Regulation Agency for schools and provide suitable references to support their academic qualifications and/or their prior experiences.\r\n\r\nPersonal attributes include commitment to working with children and making a difference to their progress, organisation and time management skills, ability to work with others and respond to advice, and use of standard spoken English.\r\n","otherRequirements":"You must be interviewed, and we will explore your suitability for teaching including undertaking DBS and Disqualification by Association and Prohibition checks.\r\n\r\n","status":1,"createdAt":"2021-07-06T10:54:37.529Z","updatedAt":"2021-10-01T14:13:03.298Z","canSponsorStudentVisa":"no","cycle":"2024"}
