{"id":"086c0f0f-3084-42dc-a5a2-99db667d7160","name":"Primary","code":"2PV4","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"7a328aef-8186-4160-a9ac-d2f2c44ef22a","name":"Hursthead Junior School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"b22cbff4-7ea1-48ce-8b17-554045d0bc10","code":"27X","name":"Hursthead Junior School Alliance"},"accreditedBody":{"id":"9d03acb4-95ce-41e1-8458-0b4bec147b6b","code":"M20","name":"The University of Manchester"},"profPost":"PG","degreeGrade":"0","english":"1","maths":"1","science":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"“Currently, the University of Manchester does not offer equivalency tests, but would accept equivalency tests from these providers:\n\nhttps://www.equivalencytesting.com/\n\nhttps://www.bcu.ac.uk/education-and-social-work/initial-teacher-training/gcse-equivalency-test/gcse-equivalency-tests-non-bcu-applicants\n\nhttps://astarequivalency.co.uk/”","courseLength":"OneYear","feesUK":9250,"feesInternational":20000,"feeDetails":"The fees quoted above will be fully inclusive for the course tuition, administration and computational costs during your studies.\r\n\r\nAll fees for entry will be subject to yearly review and incremental rises per annum are also likely over the duration of courses lasting more than a year for UK/EU students (fees are typically fixed for international students, for the course duration at the year of entry). \r\n\r\nSelf-funded international applicants for this course will be required to pay a deposit of £1,000 towards their tuition fees before a confirmation of acceptance for studies (CAS) is issued. This deposit will only be refunded if immigration permission is refused. We will notify you about how and when to make this payment.\r\n\r\n","financialSupport":"The Alumni Scholarship offers eligible applicants a £1,000 cash bursary. It supports applicants who wish to progress to a PGCE and: \r\n*are University of Manchester graduates;\r\n*are international, EU or home students;\r\n*are applying within three years of receiving their degree;\r\n*have received a First Class honours degree.\r\n\r\nYou do not need to apply for this scholarship. You will be considered on the basis of your application for the course. If you meet the eligibility criteria, you will be awarded the bursary automatically.\r\n\r\nIn addition, there are three types of Government funding available for teacher training:\r\n\r\n1.  tax-free bursary or scholarship;\r\n2.  tuition fee loan and maintenance loan;\r\n3.  extra financial support if you're a parent, or have an adult dependant or a disability.\r\n\r\nPlease visit the DfE site to find out more about the funding available for teacher training courses starting in academic year 2022/23.","aboutCourse":"You will train to teach children aged 5 to 11 and this ten-month course provides training in all primary-stage National Curriculum subjects. It leads to both a postgraduate qualification (PGCE) and qualified teacher status (QTS).\r\n\r\nOur School Direct programme includes both school-based and university-based learning.  You will spend over 50% of your time training in our six alliance schools, as well as spending time at The University of Manchester, whose PGCE course has been graded as 'Outstanding' by Ofsted (Ofsted Report, 2019) and who has been highlighted as the best university provider of initial teacher training in the North of England (Good Teacher Training Guide 2017).\r\n\r\nYou will spend a significant amount of time studying each of the core subjects of English, mathematics and science. You will also spend time studying Religious Education (RE), Physical Education (PE), history, geography, art, music, and design and technology.\r\n\r\nProfessional studies are a central component of the course, covering topics such as: pupil assessment; lesson planning; managing pupil behaviour; the role of the reflective practitioner; making primary education inclusive for all.\r\n\r\nAll training sessions deploy a wide range of teaching methods, including group discussion, practical workshops, lectures and presentations. You will be an active participant and driver in your own professional development.  \r\n\r\nAs a School Direct trainee, in addition to teaching placements, you will receive on average 18 days school-based learning within the six schools in our alliance.  In these sessions, you will be taught, coached and mentored by experienced, highly-effective practising teachers.  \r\n\r\nYou will be assessed during your school placements and you will receive high-quality feedback to enhance your development.\r\n\r\nYour subject knowledge in English, Mathematics and Science will be audited regularly through taught course sessions, and you will also complete four Master's-level assignments during the year.\r\n\r\nThe written assignments will allow you to gain a maximum of 60 Master's-level credits, and guidance and support to complete these assignments will be available from your University tutor\r\n\r\nYour university-based learning will take place at The University of Manchester's Oxford Road campus, adjacent to Manchester's city centre.  Your school-based learning will take place at:  Hursthead Juniors/Infants, Handforth Grange, Bradshaw Hall, Oak Tree and Heald Place.  All locations are accessible by road or by an extensive network of public transport including trains, trams and buses.","interviewProcess":"The School Direct Lead and Head Teacher at Hursthead Junior School review all written applications jointly.  We consider a range of factors in the written application, other than the entry requirements, and your personal statement should make clear:\r\n* your commitment to and enthusiasm for teaching\r\n* your rationale for applying to be a Primary teacher\r\n* an awareness of the role and responsibilities of the teacher\r\n* any relevant experience suggesting suitability for the role\r\n* a good standard of written English.\r\n\r\nIf successful, you will be invited to an interview with two members of the alliance.  As part of the formal interview you will be asked to give a pre-prepared presentation, details of which will be sent out in a letter to you.  \r\n\r\nYou will need to provide photographic  ID (such as your passport or driving licence) and proof of your academic qualifications on the day of the interview.\r\n\r\nIn addition to the interview, there will be a small group task.  For this, we will ask you to select a book to introduce to a group of six children and prepare an activity for them linked to the story.\r\n\r\nOffers made following the interview day are subject to meeting all of the University of Manchester criteria.  Please see the 'Requirements' section.","howSchoolPlacementsWork":"The main professional placements are:\r\n* ten weeks in the autumn term in either Key Stage 1 or Key Stage 2\r\n* eleven weeks in the summer term in either Key Stage 1 or Key Stage 2\r\n* two weeks placement in the Early Years Foundation Stage\r\n* one-week Inclusion placement.\r\n\r\nWhen on placement, you will observe and teach classes under the guidance of an experienced primary teacher, who will act as your mentor.\r\n\r\nYour school-based placements will take place at one of these 6 schools:\r\n\r\nHursthead Junior School provides children with a bespoke creative curriculum, rich in wider learning activities inside and outside the classroom.  The school has subject specialists in English and Maths, with a wealth of teaching and training experience.\r\n\r\nHursthead Infant School excels in creating a nurturing environment for young children, whilst stimulating their minds with a creative, cross-curricular approach to learning. \r\n\r\nOak Tree Primary School is a purpose-built, 3-form entry school that has heavily invested in new technology.  The school, which has a wealth of expertise in SEN and a Maths specialist, offers an exciting opportunity to experience life in a rapidly expanding and developing school. \r\n\r\nHandforth Grange Primary School provides a wealth of creative learning opportunities within and outside the core curriculum, particularly in Music and Art.  A Gold Kitemark PE School, it also has Resource Provision for children with Autistic Spectrum Condition.\r\n\r\nBradshaw Hall Primary School is an innovative school, particularly in the fields of computing and outdoor learning.  The school has the Primary Science Quality Mark Gold Award.  With a warm and welcoming learning environment, the school also has a Speech and Language unit on site.\r\n\r\nHeald Place Primary School serves a very rich and diverse community in the heart of Central Manchester.  The school offers a number of specialisms: computing, art, outdoor games, dance, bespoke therapeutic approaches, ECO.\r\n\r\nMost of our partner schools are in the Cheadle Hulme area.  Handforth Grange is 10 minutes by car from Hursthead Junior School and Heald Place is located in Rusholme (25 minutes by car from Hursthead Junior School).","personalQualities":"Our trainees will need to:\r\n* have a ‘can do’ philosophy and a creative approach to learning\r\n* enjoy working with young people and have a passion for learning\r\n* be flexible and have the ability to use initiative \r\n* carry out professional duties in a positive and courteous manner\r\n* have high expectations for their students and themselves\r\n* be committed to ongoing professional development\r\n\r\nPersonal Qualities:\r\n* A sensitive, caring professional\r\n* A committed, hard-worker\r\n* A team player\r\n* A confident, engaging communicator \r\n* A resilient learner","otherRequirements":"The Government has replaced professional skills tests with a new system of provider-led assurance in relation to trainees' fundamental knowledge in English and Mathematics. Under this new approach you will not be required to pass professional skills tests prior to commencing your PGCE, but you will need to demonstrate your fundamental knowledge by the end of the programme.\r\n\r\nSuccessful candidates are required to comply with a confidential health screening check and an enhanced check through the Disclosure and Barring Service.","status":1,"createdAt":"2021-07-06T10:47:22.007Z","updatedAt":"2021-09-21T10:42:15.629Z","canSponsorStudentVisa":"yes","cycle":"2024"}
