{"id":"5f1c4642-daf2-45a4-97a6-0fb91dca5c8d","name":"Art and design (SEND)","code":"L589","qualification":"qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"other","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"yes","subjects":[{"id":"d461a678-3335-4ca2-9616-1dc479d31a49","code":"W1","name":"Art and design"}],"locations":[{"id":"2321e852-065a-441b-bf26-412de65c94c2","name":"Portal House","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"d1969afe-15a1-410d-b1bc-279921ed2c05","code":"29C","name":"KsENT"},"accreditedBody":{"id":"1165d5fd-11f4-4dab-99c9-47b309481463","code":"C10","name":"Canterbury Christ Church University"},"degreeGrade":"1","additionalDegreeSubjectRequirements":"false","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","aboutCourse":"*Successful candidates will have training in a base SEN school. There will also be a contrasting placement in a mainstream school setting. Each trainee teacher will have a nominated mentor within their base school. \r\n\r\n*KSENT provide an SEN-specific in-school training programme for all those  on the Schools Direct Programme. \r\n\r\n*There will also be schools direct training and support from Canterbury Christ Church University who are our accredited provider.\r\n \r\n*All trainee teachers will be assessed regularly throughout the course against the teaching standards.  \r\n\r\n*Those who successfully complete the course will be qualified to teach in both mainstream and SEN settings.\r\n","interviewProcess":"For candidates who pass the shortlisting process and are invited to interview:\r\n\r\nPre-Interview Tasks include:\r\n *a tour and learning walk in the school in which you have applied to teach\r\n *teaching a lesson, observed by members of SLT\r\n* Maths and Literacy tasks\r\n\r\nFollowing this, candidates will be interviewed by a panel, including a member of SLT from their chosen school and a representative from CCCU. \r\n\r\n","howSchoolPlacementsWork":"Successful applicants will have two placements – one in their base school, which will be an SEN setting, and another 30-day contrasting placement in a mainstream school. \r\n\r\nThere may also be options for trainee teachers to visit an additional placement. This is reviewed on a case-by-case basis. \r\n\r\nKSENT is an alliance of 26 Special Schools. The average distance between home and school is roughly 20 miles, but this will vary depending on which school you select.\r\n","status":1,"createdAt":"2022-01-11T16:12:08.435Z","updatedAt":"2022-01-12T09:24:39.971Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","applicationsOpenDateOther":"2022-01-12T00:00:00.000Z","salaryDetails":"You will be paid on the unqualified teachers pay scale.\r\n\r\nAll QTS course fees will be covered by the host school.\r\n"}
