{"id":"46275eae-6bb0-4ab3-8ce2-2ddcad2ad94e","name":"Design and Technology","code":"2KG7","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"B","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"118fabd7-86d0-4a40-9e9a-e5c302abe59b","code":"DT","name":"Design and technology"}],"locations":[{"id":"3c0db5ab-dd05-488e-8917-f6cf1611c82a","name":"Harris Initial Teacher Education","isPublished":"Y","status":"R","vacancies":"B"}],"trainingProvider":{"id":"e93b7f77-cc5c-4ff1-9679-84470019b39e","code":"1TZ","name":"Harris Initial Teacher Education"},"accreditedBody":{"id":"45cef0fd-ad2f-4353-b7df-d45abd016a5d","code":"1WU","name":"Harris ITE"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"If you are required to complete an equivalent GCSE, you will be responsible for meeting the cost. \nWe recommend: \n* A star equivalency (preferred)\n* Equivalencytesting.com\n\nYou need to have completed these equivalency examinations and have the results prior to the start of the course (1st September 2022). The minimum grade is equivalent to a grade 4.","courseLength":"OneYear","feesUK":9250,"feesInternational":9250,"feeDetails":"On this Tuition-Fee route you will be required to pay the fees.\r\n\r\nThe fees that you are due to pay can be split into three termly payments or they can be paid in full at the start of the academic year.\r\n","aboutCourse":"Our full-time courses last for one academic year, from September to July. As a trainee teacher, you’ll be based at one of our 52 Harris Federation academies or partner schools, where you’ll learn to teach alongside expert classroom practitioners in an exciting, vibrant environment. \r\n\r\nDuring the course you will spend one day a week at Core Training, based at Harris Academy Bermondsey in South East London. The rest of your time is spent in your school placement. School Direct is an immersive programme where you will be teaching across the year.\r\n\r\nThe training sessions are facilitated by our expert practitioners who will model outstanding planning, teaching and assessment, to support your development as a teacher. You will have lots of opportunities to interact and learn from peers from across subjects and phases.\r\n\r\nThere are a number of Subject-specific training days as part of the Core Training which includes the following content as a minimum:\r\n\r\nThere are a number of Subject-specific training days as part of the Core Training which includes the following content as a minimum:\r\n\r\n*What is Design & Technology? Managing Behaviour effectively in practical lessons.\r\n*What is Food Technology?\r\n*What is Textiles Technology?\r\n*Meeting the needs of all learners in Design & Technology.\r\n*Assessment in Design & Technology. Promoting Critical thinking in Design & Technology.\r\n*Design & Technology Curriculum: KS4 Lesson Planning. \r\n*Electronics in the D&T curriculum.\r\n*The use of new and emerging technology.\r\n*Planning for the future. \r\n*Embedding intelligence.\r\n\r\nAssessment and Accreditation\r\n\r\n* The Harris School Direct programme leads to the award of QTS through Harris Initial Teacher Education (an accredited SCITT provider), with PGCE and Master’s Level Credits awarded in partnership with Kingston University. \r\n* As a trainee teacher, you will be assessed holistically against the Harris ITE Curriculum, across the training year in both your school-based training and Core Training. By the end of the course, this will enable you to demonstrate that you have met the Teachers’ Standards as required for Qualified Teacher Status. \r\n* The elements that make up the holistic assessment include: Mentor reports; Evidence bundles; Final QTS Assessment panel presentation; Subject and curriculum knowledge; Attendance and punctuality; Professional behaviours; Mathematics and English proficiencies; and engagement and input in training.\r\n* The PGCE element of the programme is assessed by: Master’s level assignments; School experience.\r\n\r\nCourse arrangements and content may be subject to change in line with training partnerships with DfE requirements. \r\n\r\n\r\n","interviewProcess":"If your application is successful, we will invite you to the first stage of our interview process which will take approximately half a day. This consists of:\r\n* An interview with Harris ITE Tutors where you will teach a 5-minute starter (that you have planned in advance) and a formal interview where you will answer some questions designed to assess your suitability to train to teach;\r\n* A group discussion; \r\n* Two independent written tasks designed to assess your subject/phase knowledge and your understanding of professionalism.\r\n\r\nWe will also be assessing your English proficiencies and collecting your eligibility documents for verification.\r\n\r\nPlease be prepared to bring any ID documents and original qualification certificates we request from you.\r\n\r\nIf you have been successful at first interview, we will organise a visit to your potential placement school where you will be interviewed by the Principal or Senior Leader. When you apply to us, you are applying to the Harris Federation as a central provider, which means we can select your placement academy in discussion with you at first interview stage. We will work with you to agree a suitable placement.\r\n\r\nFollowing a successful second interview, we will make you a formal offer, which you will need to accept to secure your place on the course.\r\n\r\nAll offers are subject to the satisfactory completion of pre-programme checks including an Enhanced DBS Check, Barred List and Prohibition Order checks, and a Medical Questionnaire to assess your fitness to work. ","howSchoolPlacementsWork":"In order to ensure a well-rounded School Direct experience, you will undertake two school placements. You will be placed at your main placement academy for the majority of the year.\r\n\r\nAt your main placement academy, you will have your own personal mentor – an experienced teacher who will oversee the school-based element of your training year. They will support you, be a model of effective practice, observe your practice and meet with you weekly. \r\n\r\nYou will also benefit from a short second placement at a different Harris academy or partner school. This means you can experience teaching in a contrasting school, to help you to develop your skills in a different context or age-range. We organise this based on a range of criteria to ensure an enriching school experience.\r\n\r\nDuring the course you will spend one day a week at Core Training with your fellow trainees at Harris Initial Teacher Education, largely based at Harris Academy Bermondsey in South East London. \r\n\r\nOur Primary courses cover the age range 3-11 and our Secondary courses cover 11-16. This means you will have experience across these age ranges. There are also opportunities for trainees to teach at Key Stage 5, if appropriate to their subject. \r\n\r\nWhen selecting your main school placement academy we take in to consideration the distance from your home, childcare or caring responsibilities, mode of transport and any other pertinent information. Please note, once you have accepted an offer, we are unable to make changes to the main placement academy.\r\n\r\n\r\n","personalQualities":"We're looking for people who want to become outstanding teachers; people for whom teaching is a passion and who will be relentless in securing academic and aspirational progress for every child. You will need the ability to develop effective relationships with relevant stakeholders: children, parents and carers, colleagues and peers, as well as external agencies. \r\n\r\nFurther essential qualities are outstanding organisation and communication skills, a proactive approach, good interpersonal skills and a commitment to securing the best education for all children. You should also have determination and energy, high standards of English, maths and excellent subject knowledge.\r\n\r\n","otherRequirements":"Alongside meeting all of the eligibility criteria, and having original certificates of all your qualifications, you must pass the pre-programme checks.  These will include an Enhanced DBS Check, Barred List and Prohibition Order checks, and a Medical Questionnaire to assess your fitness to work. ","status":1,"createdAt":"2021-07-06T10:47:25.471Z","updatedAt":"2021-10-01T11:25:08.788Z","canSponsorStudentVisa":"no","cycle":"2024"}
