{"id":"3e085b40-eac5-46cf-bafe-d66a67d36bf9","name":"Modern Languages (French, German and Spanish)","code":"R9X1","qualification":"pgde_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"9727f674-61ba-4efa-b1f2-21ec7e354442","code":"15","name":"French"},{"id":"ce8523ef-9236-4cd9-b260-d826c7a521b3","code":"ML","name":"Modern Languages"},{"id":"fbb00c08-2dbc-4f26-adb3-3b23afba18c1","code":"17","name":"German"},{"id":"e34fd2a3-a32e-44e9-aea1-666badf3ac03","code":"22","name":"Spanish"}],"locations":[{"id":"cfb3051a-28e9-43cd-bae3-a262f6d49d9a","name":"LJMU School of Education","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"ec34b77c-cba3-4598-93be-23f0471adff1","code":"L51","name":"Liverpool John Moores University"},"profPost":"PG","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"Applicants  will usually have a minimum 2:2 honours degree (or recognised equivalent) in a Modern Languages-related discipline normally with significant content in French, Spanish, German or a combination.\n\n Applications are also very welcome from graduates in other subject areas who are native or near-native speakers of French, Spanish or German. This includes those whose degrees were undertaken outside the U.K. \n\nIf you have qualifications that were not gained in the U.K. you will be required to have their equivalence checked through NARIC. Please contact education@ljmu.ac.uk for more details.\n\nDon't hold back from applying for teacher training in Modern Languages because of your subject knowledge. You may still be able to train to teach Modern Languages by building up or refreshing your existing knowledge with a funded subject knowledge enhancement (SKE) programme. SKEs are  also available to enhance or learn a second Modern Language. Please contact Get into Teaching for more information or email our recruitment team at LJMU education@ljmu.ac.uk","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Please contact education@ljmu.ac.uk if you have queries about suitable equivalency tests.\n\nLevel 2 Numeracy and literacy qualifications are not considered equivalent to GCSE. If you have any non-standard qualifications please check them with LJMU staff, including qualifications gained outside of the United Kingdom. Please do not assume that qualifications are GCSE equivalent without checking them with our staff first. We can help you to find a suitable equivalency test provider if necessary. Fees may be payable for equivalency tests.","courseLength":"OneYear","feesUK":9250,"feesInternational":14000,"feeDetails":"There are a range of ways in which you can arrange to pay your course fees, including in monthly instalments.","financialSupport":"Hardship bursaries may be available for some students, depending on individual circumstances.\r\n\r\nA contribution towards travel to school placements may be made in some circumstances.","aboutCourse":"Our popular Modern Languages (ML) course is  taught by experienced and friendly staff. Your tutors were all successful teachers, who maintain strong links with schools and actively engage with up to date educational research. You will join a community of students at our  city centre campus and within our LJMU Partnership schools .\r\n\r\nLJMU is unique in the North West in offering a Post Graduate Diploma in Education together with Qualified Teacher Status. This means that our Modern Languages teaching graduates are skilled teachers already two thirds of the way towards a Masters, which many go on to complete during their early career.\r\n\r\nThe Modern Languages PGDE begins with a 3 week LJMU induction early in September. Until January, student teachers normally spend Fridays (and sometimes the occasional full week) on campus and the other 4 days in school. Later in the year, students return to LJMU for additional full training weeks, but spend 5 days on placement in schools. \r\n\r\nThe ML programme will focus predominantly on developing your subject knowledge and subject pedagogy, in French, Spanish, German and their combinations so that you have the knowledge, understanding and skills needed to become a  confident  teacher of ML. You will be supported to teach 2 languages, one of which may be at beginner's level. This will make you highly employable.\r\n\r\nIn addition, lead lectures and seminars will develop your confidence in a range of relevant issues; classroom and behaviour management; meeting individual needs and inclusion; planning and assessment etc. There is a strong emphasis on social justice issues in education and on mental health and well-being. We want you to develop into an inclusive and reflective teacher, with the skills, energy and resilience needed to make a real difference in schools.\r\n\r\nIn order to achieve Qualified Teacher Status, you will demonstrate that you are able to meet all the requirements of the Teachers’ Standards. This aspect of assessment is largely undertaken by our school-based mentors. LJMU staff are in regular contact with all trainees on placement, undertake co-observations of their teaching and Quality Assure the school-based training across the Partnership. \r\n\r\nThe Postgraduate Diploma is taught and assessed through  4 Modules. The Award of QTS forms one of these Modules. You will also be assessed by completing  two essays based on your classroom practice, (one of which focuses on the development of a Scheme of Work) and delivering a case-study presentation.","interviewProcess":"Applicants are shortlisted and all  who meet our entry requirements will be invited to attend an on-line interview.  Opportunities to visit the campus are also made available. \r\n\r\nThe selection process involves a presentation to applicants about the programme and an individual interview with members of the course team. \r\n\r\n Details to support preparations for the interview are sent to successful applicants in advance. Our selection and interview process provides an opportunity to meet our staff team and to ask questions about training to teach with LJMU. Interviews can sometimes involve staff from our partner schools. \r\n\r\nAn applicant's performance at interview is assessed and a final decision is made, based on a judgement of their performance against a range of criteria. Applicants are normally informed of decisions within 24 hours.\r\n\r\nApplicants will be assessed for their: \r\n*  Depth of relevant subject knowledge and their interest and enthusiasm for teaching Modern Languages\r\n*  Ability to successfully engage learners and to make learning exciting and meaningful to young people in a range of contexts\r\n*  Commitment to supporting learners, including in areas of challenging social context\r\n*  Enthusiasm, energy and resilience and ability to work with others in teams  and at  Master’s level.\r\n\r\nApplicants for Modern Languages will also be asked to speak and to write in their first Modern Language. \r\n\r\nPrior to starting the course, applicants must be able to provide exam board certified  certificates/statements of results of GCSEs (or equivalence)  in English and Mathematics.  Degree certificates will also be needed once achieved.\r\n\r\n \r\n\r\n","howSchoolPlacementsWork":"Your school-based experience takes place largely in a Home School, supported by well- trained mentors. We have found that being in a Home School ensures that you are fully integrated into school life and get to know staff, pupils and your subject mentor extremely well, to the benefit of all involved. A member of LJMU staff is normally attached to each school and is responsible for visiting regularly in order to support all trainees and their mentors. Relationships are very close and constructive. \r\n\r\nAll trainees are entitled to weekly review and feedback meetings with their mentors and to tutorials with LJMU staff. This “wraparound” care ensures that you are consistently supported from start to finish, both personally and professionally.\r\n\r\nYou will be allocated to your Home School during Induction and every effort is made to select schools within reasonable travelling distance. Placements are selected from within the Partnership of LJMU schools, which extends across many local authorities across Merseyside and beyond and includes a diverse range of settings. Our LJMU family of schools are committed to student teacher development and to the Partnership with the University. A range of mentor training and development events hosted both at LJMU and in schools, ensure that our mentors understand our expectations and commit to offering high quality guidance and support to each trainee. \r\n\r\nIn addition to the time spent in a Home School, you will also undertake an alternative placement of roughly 6 weeks in a contrasting school between January and February. This placement has an explicit focus on diversity and inclusion. Additional experiences are also often provided for instance through visits to Special Schools and to Primary Schools. Although the LJMU programmes focus on 11-16 experience, many trainees also gain experience of Post 16 planning and teaching during their school experience.\r\n\r\nSchool experience is structured in Phases, beginning with an observation phase, so that you can develop appropriate confidence and competence, only taking on greater responsibility for planning and teaching as the year progresses. Your final assessment for QTS is conducted at the end of the year in collaboration with your mentor. \r\n","personalQualities":"We are looking for applicants who have a passion for Modern Languages and wish to share their passion with young people.   You should have a genuine  belief that education transforms life chances and want to make a positive difference to young people and to their communities. At interview we hope to  to see your enthusiasm along with evidence of some experiences which have informed your decision to become a teacher. A minimum of 5 days’ work experience in a UK secondary school is helpful prior to commencing the programme. ","otherRequirements":"You are  required to meet the Department for Education’s standards for physical and mental fitness to teach and clearance to work with children. Further information, including a Declaration of Health questionnaire and details of how to apply for a Disclosure and Barring Service (DBS) Enhanced Disclosure will be sent to you after you have firmly accepted an offer. These form part of your conditions of offer.\r\n\r\nYour offer is conditional until ALL conditions of entry are completed and verified. Please check conditions carefully. If you need duplicate GCSE certificates you will need to contact your exam board\r\n","status":1,"createdAt":"2021-07-06T10:52:11.079Z","updatedAt":"2021-09-10T13:11:43.493Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
