{"id":"b7b50c2e-a471-4f55-b2c9-30cb4da67fce","name":"Design and Technology","code":"2BHD","qualification":"pgde_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"118fabd7-86d0-4a40-9e9a-e5c302abe59b","code":"DT","name":"Design and technology"}],"locations":[{"id":"cfb3051a-28e9-43cd-bae3-a262f6d49d9a","name":"LJMU School of Education","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"ec34b77c-cba3-4598-93be-23f0471adff1","code":"L51","name":"Liverpool John Moores University"},"profPost":"PG","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"Applicants for Design & Technology may have an Undergraduate Degree in a variety of related disciplines from Product Design, to Food Technology, to Fashion etc. We welcome applicants from all areas of Design and Technology but you should not expect to ONLY teach one area of Design & Technology on school placements. Subject Knowledge Development will support you in developing a broad range of D & T expertise. Sometimes pre-course Subject Knowledge Enhancement may be required. Sometimes you may be required to supplement your school timetable with associated subjects eg Design as part of Art and Design etc. These expectations will make you more attractive to employing schools.","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Please contact education@ljmu.ac.uk if you have queries about suitable equivalency tests. \n\nLevel 2 Numeracy and literacy qualifications are not considered equivalent to GCSE. If you have any non-standard qualifications please check them with LJMU staff, including qualifications gained outside of the United Kingdom. We can help you to find a suitable equivalency test provider if necessary. Fees may be payable for equivalency tests.","courseLength":"OneYear","feesUK":9250,"feesInternational":14000,"feeDetails":"There are a range of ways in which you can arrange to pay your course fees, including in monthly instalments.","financialSupport":"Hardship bursaries may be available for some students, depending on individual circumstances.\r\nA contribution towards travel to school placements may be made in some circumstances.","aboutCourse":"Our popular Design and Technology course is  taught by experienced and friendly staff. Your tutors were all successful teachers, who maintain strong links with schools and actively engage with up to date educational research. You will join a community of students at our  city centre campus and within our LJMU Partnership schools .\r\n\r\nLJMU is unique in the North West in offering a Post Graduate Diploma in Education together with Qualified Teacher Status (QTS). This means that our Design and Technology teaching graduates are skilful teachers who are already two thirds of the way towards a Masters, many go on to complete this during their early career.\r\n\r\nThe Design and Technology PGDE begins with a 3 week LJMU induction early in September. Until January, student teachers normally spend Fridays (and sometimes the occasional full week) on campus and the other 4 days in school. Later in the year, students return to LJMU for additional full training weeks, but spend 5 days on placement in schools. \r\n\r\nOur D & T student teachers come from a range of degree backgrounds, but share a passion for Design & Technology teaching. The programme will focus above all on developing your Design and Technology subject knowledge and pedagogy so that you have the knowledge, understanding and skills needed to become a  confident  Design and Technology teacher.  In addition, workshops and seminars will develop your confidence in a range of relevant issues; classroom and behaviour management; meeting individual needs and inclusion; planning and assessment etc. There's a strong emphasis on social justice issues in education and on mental health and well-being. We want you to develop into an inclusive and reflective teacher, with the skills, energy and resilience needed to make a real difference in schools.\r\n\r\nIn order to achieve Qualified Teacher Status, you will demonstrate that you are able to meet all the requirements of the Teachers’ Standards. This aspect of assessment is largely undertaken by our supportive school-based mentors. LJMU staff are in regular contact with all trainees on placement, undertake co-observations of their teaching and Quality Assure the school-based training across the Partnership. \r\n\r\nThe Postgraduate Diploma is taught and assessed through  4 Modules. The Award of QTS forms one of these Modules. You will also be assessed by completing  two essays based on your classroom practice, (one of which focuses on the development of a Scheme of Work) and delivering a case-study presentation.\r\n\r\n","interviewProcess":"Applicants are shortlisted and all  who meet our entry requirements will be invited to attend an on-line interview.  Opportunities to visit the campus are also made available.\r\n\r\nThe selection process involves a presentation to applicants about the programme and an individual interview with members of the course team. \r\nApplicants for  Design  and Technology may also be required to share a portfolio.\r\n\r\n Details to support preparations for the interview are sent to successful applicants in advance. Our selection and interview process provides an opportunity to meet our friendly staff team and to ask questions about training to teach with LJMU. Interviews can sometimes involve staff from our partner schools. \r\nAn applicant's performance at interview is assessed and a final decision is made, based on a judgement of their performance against a range of criteria. Applicants are normally informed of decisions within 24 hours.\r\n\r\nApplicants will be assessed for their: \r\n*  Depth of relevant subject knowledge and their interest and enthusiasm for teaching  Design and Technology\r\n*  Ability to successfully engage learners and to make learning exciting and meaningful to young people in a range of contexts\r\n*  Commitment to supporting learners, including in areas of challenging social context\r\n*  Enthusiasm, energy and resilience and ability to work with others in teams  and at  Master’s level.\r\n\r\nPlease note that prior to starting the course, applicants must be able to provide exam board certified  certificates/statements of results of GCSEs (or equivalence)  in English and Mathematics.  Degree certificates will also be needed once achieved.\r\n\r\n","howSchoolPlacementsWork":"Your school-based experience takes place largely in a Home School, supported by subject and professional mentors. We have found that being in a Home School ensures that you are fully integrated into school life and get to know staff, pupils and your subject mentor extremely well, to the benefit of all involved. A member of LJMU staff is normally attached to each school and is responsible for visiting regularly in order to support all trainees and their mentors. Relationships are very close and constructive. \r\n\r\nAll trainees are entitled to weekly review and feedback meetings with their mentors and to tutorials with LJMU staff. This “wraparound” care ensures that you are consistently supported from start to finish, both personally and professionally.\r\n\r\nYou will be allocated to your Home School during Induction and every effort is made to select schools within reasonable travelling distance. Placements are selected from within the Partnership of LJMU schools, which extends across Merseyside and includes a diverse range of settings. Our LJMU family of schools are committed to student teacher development and to the Partnership with the University. A range of mentor training and development events hosted both at LJMU and in schools, ensure that our mentors understand our expectations and commit to offering high quality guidance and support to each trainee. \r\n\r\nIn addition to the time spent in a Home School, you will also undertake an alternative placement of roughly 6 weeks in a contrasting school between January and February. This placement has an explicit focus on diversity and inclusion. Additional experiences are also often provided . Although the LJMU programmes focus on 11-16 experience, many trainees also gain experience of Post 16  teaching during their school experience. You should expect to teach aspects of Design and Technology beyond your specialist area. \r\n\r\nSchool experience is  in Phases, beginning with an observation phase, so that you can develop appropriate confidence and competence, only taking on greater responsibility for planning and teaching as the year progresses. Your final assessment for QTS is conducted at the end of the year in collaboration with your school.. \r\n","personalQualities":"We are looking for applicants who have a passion for Design and Technology to share with young people.  Although you will have a specialism you should be prepared to teach beyond it. You should have a genuine  belief that education transforms life chances and want to make a positive difference to young people and to their communities. At interview we hope to  to see your enthusiasm along with evidence of some experiences which have informed your decision to become a teacher. A minimum of 5 days’ work experience in a UK secondary school is helpful before the programme starts. ","otherRequirements":"You are  required to meet the Department for Education’s standards for physical and mental fitness to teach and clearance to work with children. Further information, including a Declaration of Health questionnaire and details of how to apply for a Disclosure and Barring Service (DBS) Enhanced Disclosure will be sent to you after you have firmly accepted an offer. These form part of your conditions of offer.\r\n\r\nYour offer is conditional until ALL conditions of entry are completed and verified. Please check conditions carefully. If you need duplicate GCSE certificates you will need to contact your exam board\r\n\r\n","status":1,"createdAt":"2021-07-06T10:52:10.459Z","updatedAt":"2021-09-10T13:08:08.985Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
