{"id":"ebfda97c-93b8-4d12-80ea-f745b4035bb0","name":"Postgraduate Teaching Apprenticeship","code":"3BQH","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"TA","fundingType":"apprenticeship","studyMode":"F","ageRange":"3_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"bc1fabfc-d519-49e5-99ae-80a7ed1779d3","name":"Oakthorpe Primary School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"010f4997-79c0-45f4-9e74-6ba418c0d2a5","code":"151","name":"Oakthorpe Primary School"},"accreditedBody":{"id":"82fd3a3b-6bfd-40d1-8343-0c19e34a847a","code":"T92","name":"2Schools Consortium"},"degreeGrade":"9","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":null,"aboutCourse":"Oakthorpe Primary School operating as 2Schools Consortium provides the Postgraduate Teacher Apprenticeship Level 6 (Primary) leading to QTS (Qualified Teacher Status) in line with the Teacher Apprenticeship Standards framework and to PGCE, validated by the University of Brighton. \r\n\r\nRanked in the 10 best Teacher Training providers for Primary Teacher Training in 2015, 2Schools Consortium has been an accredited provider since 2002.\r\n\r\nYou will benefit from the expertise of an Outstanding (Ofsted, May 2014) teacher training provision working within a partnership of 40+ primary schools in North London across the Enfield, Harringay and Barnet local authorities.\r\n\r\nApprentices will be placed in and employed by the employer’s school for the duration of their course and will also have a second school placement.\r\n\r\nThe structure of the Postgraduate Teaching Apprenticeship differs from existing ITT programmes as it lasts 12 months and has an end-point assessment (EPA) carried out by a different provider during the following autumn term.  \r\n\r\nApprentices will benefit from spending 20% of each week attending training led by experts practitioners and completing weekly academic tasks to develop their knowledge, skills and behaviours.\r\n\r\nTraining will be delivered both in school by school based mentors and during off-the-job sessions by school based trainers with QTS and specific expertise related to the [Teacher Apprenticeship Standards](http://www.2schools.org/wp-content/uploads/2017/11/Teacher_apprenticeship_standard.pdf).\r\n\r\nOn completion of this apprenticeship all apprentices will be assessed against the Teachers’ Standards, for the awarding of Qualified Teacher Status (QTS). Once the Apprentice is an ECT (Early Career Teacher) the end-point assessment (EPA) must be completed within three months. \r\n\r\nThe end-point assessment comprises of: \r\n\r\n* A lesson observation observed, and assessed, by the independent assessor. A short professional dialogue about the observed lesson will follow this;\r\n\r\n* A professional discussion, which will assess the apprentices’ knowledge, skills and behaviours with regard to the Teachers’ Standards. The professional discussion will be held between the apprentice and a panel, composed of the independent assessor, a representative from the apprenticeship training provider and a representative from the employer who has been involved in the apprentice’s training and development (such as professional mentor or support tutor). The apprentice should bring with them a portfolio of work completed during Initial Teaching Training. The portfolio will not be assessed but will provide the apprentice with an aid to the professional discussion.\r\n","interviewProcess":"Applicants are shortlisted by the training team according to a scoring system against our (person specification)[http://www.2schools.org/school-direct/what-are-we-looking-for/].\r\nand if successful are invited for interview. The interview lasts half a day and usually takes place at the lead school Oakthorpe Primary.\r\n\r\nIf successful at interview  candidates will be invited to the next stage in the interview process, which involves the delivery of a half hour literacy or maths session observed by one of the school's leaders and a member from the provider's management board. There will also be time spent in class and candidates will need to take our internally set maths and literacy tests. Maths will be at approximately KS3 level and literacy will be an extended writing task.\r\n\r\nApplicants who are successful at interview, are offered a conditional place. These are subject to:\r\n\r\n* Satisfactory references\r\n\r\n* Satisfactory medical assessment and Disclosure and Barring Service check (DBS)\r\n\r\n* National and Local Terms and Conditions of Employment\r\n\r\n* Satisfactory completion of between 1 and 5 days in one of our schools (this will depend on your experience)\r\n\r\nThe purpose of the additional days in school is to ensure that following the Apprenticeship with us is the right decision for both the candidate and the Consortium. It is also an opportunity for the Consortium to gain information about the candidate to inform the initial needs analysis and the setting of pre-course tasks.\r\n\r\nWe run information sessions to support applicants. Please check in our [News & events section](http://www.2schools.org/information-sessions/).\r\n","howSchoolPlacementsWork":"\r\n\r\nMost of the course is spent at the main placement school which will be one of the 40+ primary schools in the partnership across North London in a class under the supervision and guidance of an experienced and supportive mentor (often the class teacher or a senior member of the school’s staff).\r\n\r\nTeaching Apprentices may be required to take responsibility for a whole class up to 3 days a week, depending on the needs of the employing school.\r\n\r\nTrainees on the course can choose to focus on EYFS and KS1 (3-7) or KS1 and 2 (5-11), but all trainees will be exposed to the primary curriculum.\r\n\r\nThe course will include a minimum of two placements/practices. One of these practices will take place in a partnership school and in a different KS.\r\n\r\nThroughout this experience trainees acquire the skills, knowledge and behaviours  which make an outstanding teacher, as specified in the Apprenticeship Teachers’ Standards; from developing good relationships with children that promote learning, with other colleagues, to working within a framework and national and school policies to deliver the Curriculum.\r\n","personalQualities":"* Ability to work on own initiative and manage own work load \r\n\r\n* Ability to combine work and study\r\n\r\n* Ability to work cooperatively and effectively with colleagues\r\n\r\n* Ability to build relationships with children that promote learning\r\n\r\n* Clear and accurate verbal and written communication skills\r\n\r\n* An interest in and enjoyment of working with children \r\n\r\n* Ability to reflect on own practice and learning and listen to advice \r\n\r\n* An understanding of children’s needs\r\n\r\n* An understanding of the professional boundaries related to child protection procedures\r\n\r\n* Willingness to implement and promote equal opportunities policies\r\n\r\n\r\n","otherRequirements":"We accept GCSE equivalent qualifications in maths, English and science to be eligible for the programme and to be awarded QTS.\r\nTo meet the requirements for the PgTA End Point Assessment, candidates with GCSE equivalent qualifications in either or both maths and English, will also be required to obtain a Functional Skills Level 2 qualification.\r\n\r\nWith the removal of the skills tests, we will seek evidence of a candidate' proficiency in maths and English. \r\n\r\nOffers of appointment are conditional upon a satisfactory criminal record (DBS) check, satisfactory outcome of a health questionnaire and two references that meet safer recruitment requirements.","status":1,"createdAt":"2021-07-06T10:48:48.858Z","updatedAt":"2021-07-07T08:38:12.003Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024"}
