{"id":"4d5ac003-d852-411f-8137-075edc70fe72","name":"Art and design","code":"2ZDX","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"d461a678-3335-4ca2-9616-1dc479d31a49","code":"W1","name":"Art and design"}],"locations":[{"id":"1ae3a696-efc4-4547-af0a-8bd0681502be","name":"Rodillian Academy","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"387efe47-51b3-4387-82bb-09861f5906ba","code":"2DS","name":"The Rodillian Multi Academy Trust"},"accreditedBody":{"id":"154509e2-743e-4f0b-9d99-396393aa57ff","code":"L27","name":"Leeds Beckett University"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9000,"aboutCourse":"During your course you will gain the benefits of assimilating early on into schools within our MAT, as well as gaining tuition and expertise from Leeds Beckett University which has an excellent track record in Art and Design Initial Teacher Education. Art and Design is a popular subject in all our schools and you will be working with some excellent teachers.\r\n\r\n* Phase 1 - September - December - Introduction to Teaching.\r\n\r\nYou will spend 4 weeks in University exploring methods of teaching. From October until Christmas you will be based in your placement school.  Your time in school will initially include some orientation tasks, observing lessons and getting to know the Art and Design department. You will experience Art and Design being taught as a form of communication and a means of expressing ideas and feelings. Your classroom practice will begin with team teaching alongside your mentor or other host teachers, as your confidence grows this will lead to teaching some lessons independently. \r\nYou will attend Professional Studies sessions designed to give insights and strategies to issues that you will face in your training placements, when applying for your first job and in the first years of the profession.\r\n\r\n* Phase 2 -  January- March Developing your Knowledge. \r\n\r\nYou will be in your second placement school five days a week, building up to 60% of an ECTs timetable - 14 lessons a week. During this placement you will appreciate the benefit of our course as the behaviour policy will be the same as your previous school allowing you to focus on developing your classroom practice and understanding of how students learn.  You will be supported by your mentor and other members of the Art and Design department to take on more responsibility for planning, teaching and evaluating your impact on a wider range of classes. You will be treated as a member of the Art and Design team, you will be included in whole school CPD and encouraged to get involved in Art and Design department meetings, Parents meetings and school visits. Professional Studies  sessions will also continue during Phase 2.\r\n\r\n* Phase 3 - March until June. \r\n\r\nThe majority of time will be spent in your placement school with some university days.  By the end you will be teaching 16 lessons a week. \r\n","interviewProcess":"You will be invited to interview at one of our academies.  \r\n The interview process will allow us the opportunity to make a decision as to your suitability for a place on the course – please remember we are looking for enthusiasm for teaching Art and Design and training potential rather than the finished product.\r\n\r\nThe interview panel will comprise of the Rodillian MAT Initial Teacher Training (ITT) Lead and a subject expert.  A tutor from Leeds Becketts University may also be in attendance.\r\n\r\n\r\n The day will comprise of:\r\n* A welcome talk.\r\n* A tour of the Academy given by students - this gives you the opportunity to see the school in action and talk to our students.\r\n* You will be asked to prepare in advance a short teaching task which you will discuss with the interview panel.\r\n* A formal interview.\r\n\r\n\r\nWe hope to conduct live interviews but if this is not possible we will interview online, providing you with guidance on how to access the interview.","howSchoolPlacementsWork":"We aim to offer you a range of experiences and you will complete placements in at least 2 of our academies.  You will mostly be teaching in the 11-16 age range, but there are also opportunities for gaining sixth form experience.   \r\n\r\nYou will be well supported throughout the course by well-trained subject mentors in school and university. Each of our academies also has an ITT coordinator who will support you, your mentor and liaise with your university mentor and tutors,\r\n\r\nAll our schools are easily accessible by public transport and from the M62 corridor. We place trainees based on the availability of quality mentors within a school, but will also take into consideration any special requests.\r\n","personalQualities":"We are looking for dedicated future professionals who are resilient, flexible, hardworking and  with a real love of  subject.  Teaching is an exciting and fulfilling career, and we would like to train future colleagues who want to work with us and our pupils.\r\n\r\n","otherRequirements":"All offers are subject to enhanced DBS checks","status":1,"createdAt":"2021-07-06T10:53:13.804Z","updatedAt":"2021-10-04T15:09:14.364Z","canSponsorStudentVisa":"yes","cycle":"2024"}
