{"id":"65116264-15b1-4b00-8f49-0a3b1daeb0ab","name":"Music","code":"F430","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"24311bef-8673-41fb-933c-53f887fb6976","code":"W3","name":"Music"}],"locations":[{"id":"cf8a1d4d-cc2f-4299-9e85-4848a07b3d05","name":"Scalby School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"426debcc-b86e-4622-8f29-870475a5c0fe","name":"University Of Hull","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"9a6a9e08-cc69-4f23-aade-1fe4803acb5e","code":"ST8","name":"Scarborough Teaching Alliance Secondary"},"accreditedBody":{"id":"0bc933b8-dad9-4149-8bb2-fd2041d567c2","code":"H72","name":"The University of Hull"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"financialSupport":"You may be eligible for a loan while you study. \r\nYou would need to find out about financial support if you’re from outside the UK. \r\n","aboutCourse":"The Postgraduate Certificate in Education with QTS is an initial qualification in education for those who intend to have a career in teaching. Its three main threads are to provide you with the information, knowledge and skills to enable you to embark on a teaching career and become an effective teacher help you develop a professional interest in educational issues as the basis for further thought or training.\r\nYou will also receive 60 credits towards your Masters should you wish to pursue further academic research.\r\nYou will follow a Model 3 programme, this means you will attend The University of Hull for 1 day per week up to October half term to look at Learning and Teaching.  Your method / subject knowledge will be delivered by key teaching staff within the alliance.\r\nYou will have two school placements your first placement will be in what we class as your host school.  Your second placement will be March to May.  You will then return to your host school for the remainder of the summer term.\r\n","interviewProcess":"We will be holding interview days throughout the next academic year. (please ask us or check out our website for more details) You will be invited to interview in one of our host schools where you will be given a tour of the school and an introduction to the Scarborough Teaching Alliance. You will have a chance to ask questions and find out more about the alliance and your particular area of teaching.\r\nYou will spend time in your subject department and you will be observed delivering a lesson (of which you will have prepared prior to interview)\r\nFollowing in the observation you will be interviewed by lead staff from the alliance and a member of staff from the University of Hull.\r\nYou will be informed of the decision within 48 hours of your interview\r\n","howSchoolPlacementsWork":"You will be placed in your 'host school' in the Autumn Term. You a sixth form placement in January and a diversity (alternative school placement  March - May. You will then spend the remainder of your placement back in your 'host' school.\r\nYour placements will be interspersed with blocks of study at the university on Campus & school delivered elements.\r\n","personalQualities":"We want students who can demonstrate the characteristics of effective learning themselves: to show real interest and enthusiasm for children's learning, to be resilient and be prepared to work hard, to show creativity and be able to critically reflect on their own learning. We have high standards for the children in our schools and the adults who work with us.","otherRequirements":"DBS checks will be carried out on all trainees before they are able to begin placement. Any offer of a place on the programme will be subject to a satisfactory DBS check.","status":1,"createdAt":"2021-07-06T10:51:19.233Z","updatedAt":"2021-10-05T12:57:46.304Z","canSponsorStudentVisa":"yes","cycle":"2024"}
