{"id":"cd6d13d8-739d-4487-beec-c5b2937f1052","name":"Physics","code":"2KH3","qualification":"pgce_with_qts","startDate":"2024-09-01T07:00:00.000Z","applicationsOpenDate":"2023-10-11T07:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"B","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","trainingProvider":{"id":"2b472176-ced0-4b0a-8f81-a8bb49b33858","name":"NIoT@Trinity Institute of Education","code":"1YF"},"accreditedBody":{"id":"b1e31bc9-515a-460b-8301-b3011e4adf37","name":"NIoT: National Institute of Teaching, founded by the School-Led Development Trust","code":"2N2"},"degreeGrade":1,"english":3,"maths":3,"profPost":"BO","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"If you are required to complete an equivalent GCSE, you will be responsible for meeting the cost. \nWe recommend: \n* A star equivalency (preferred)\n* Equivalencytesting.com\n\nYou need to have completed these equivalency examinations and have the results prior to the start of the course (1st September 2023). The minimum grade is equivalent to a grade 4.","canSponsorSkilledWorkerVisa":"no","canSponsorStudentVisa":"no","cycle":"2024","createdAt":"2022-10-05T21:55:28.729Z","updatedAt":"2022-11-17T03:31:41.869Z","locations":[{"id":"3c959ad0-a937-4af7-b204-cee47fb6b395","name":"Bradford Forster","status":"R","vacancies":"B"},{"id":"4569564c-1b97-416f-9681-976570f0e48c","name":"Calder High School","status":"R","vacancies":"B"},{"id":"3fcbcf47-8bba-457e-8c6f-eb618096ce45","name":"Highbury (Community special school)","status":"R","vacancies":"B"},{"id":"12bbebf2-6994-4a88-9bcd-8f276013637f","name":"Horbury Academy","status":"R","vacancies":"B"},{"id":"9c3bca6a-8a01-4439-b097-747accc3ce83","name":"Huddersfield New College","status":"R","vacancies":"B"},{"id":"e6da35e2-7ef3-448f-8530-de59b9a051e3","name":"Leeds City Academy","status":"R","vacancies":"B"},{"id":"bf901307-509a-4b6b-bf21-5cee90ab2b0b","name":"Leeds West Academy","status":"R","vacancies":"B"},{"id":"1f076431-9a8d-4b55-b5fc-c3c008ca1e46","name":"Lightcliffe Academy","status":"R","vacancies":"B"},{"id":"e44cefcc-5592-4152-bf80-e316e9d0cf31","name":"Mirfield Free Grammar","status":"R","vacancies":"B"},{"id":"b9fb724b-a836-4130-a2a4-0c71cea4ee3a","name":"New Road Primary","status":"R","vacancies":"B"},{"id":"8e6c609e-200d-4511-8634-ed901f91c497","name":"North Halifax Grammar School","status":"R","vacancies":"B"},{"id":"7de12e80-ccdf-4023-b0a0-5be73a0830e3","name":"North Nuddersfield Trust School","status":"R","vacancies":"B"},{"id":"cb86ca1e-1a64-4cc0-a884-bf0a98f96444","name":"Ossett Academy","status":"R","vacancies":"B"},{"id":"35251259-a96d-4594-8f5e-0f9baa054129","name":"Rastrick High School","status":"R","vacancies":"B"},{"id":"9b1acafb-9d81-4bd1-9c5f-cfb143c27e31","name":"Royds School","status":"R","vacancies":"B"},{"id":"b8c70eaa-e9b2-4a18-a288-d6dbdfa2f9ef","name":"Ryburn Valley High School","status":"R","vacancies":"B"},{"id":"bcdcc1d0-629d-4eb0-82ff-2fc5a0d1c683","name":"Shelley College","status":"R","vacancies":"B"},{"id":"ce4a1a0f-fc27-4bc8-ad0d-1b2327831aba","name":"St. Mary's Menston","status":"R","vacancies":"B"},{"id":"79b7f4b5-7d37-4c84-84a2-7c972d451351","name":"The Halifax Academy","status":"R","vacancies":"B"},{"id":"0b6bd15f-0a43-45c7-b363-265f9ae444b9","name":"Thornhill Academy","status":"R","vacancies":"B"},{"id":"07cbbb0c-c9e6-4458-a54c-753da37e86e2","name":"Todmorden High School","status":"R","vacancies":"B"},{"id":"0da91a31-ca69-44dd-acc2-aece9dc1962d","name":"Trinity Academy Bradford","status":"R","vacancies":"B"},{"id":"a9d6c7b9-c15a-46a2-9b4f-36e4523afa46","name":"Trinity Academy Cathedral","status":"R","vacancies":"B"},{"id":"3f5388ac-ade8-472f-af03-119fd9cb5447","name":"Trinity Academy Grammar","status":"R","vacancies":"B"},{"id":"6f32cbdb-1fd0-4dd4-8c07-8e61fe6729af","name":"Trinity Academy Halifax","status":"R","vacancies":"B"},{"id":"9ffa2438-9113-46c0-8d97-da8ed2c083f1","name":"Trinity Academy Leeds","status":"R","vacancies":"B"},{"id":"8f38652d-eea1-4f03-80a0-05f9e8c51350","name":"Trinity Academy St. Edward's","status":"R","vacancies":"B"},{"id":"00c835ba-7e64-476e-80e3-51efe97b2c2c","name":"Trinity Sixth Form Academy","status":"R","vacancies":"B"},{"id":"4f74e5bc-01a3-465e-9f6e-0bd92aede73a","name":"Wardle Academy","status":"R","vacancies":"B"},{"id":"2635ee3d-8fe5-4923-a18c-02e74aac348f","name":"Whitcliffe Mount","status":"R","vacancies":"B"},{"id":"9d85cd38-b1cc-4342-8e99-2e4bd765f25d","name":"Woodhouse Primary","status":"R","vacancies":"B"}],"subjects":[{"id":"bf97cd0a-224c-43d3-a021-84143df13e8d","name":"Physics","code":"F3"}],"feesUK":9250,"feeDetails":"On this fee-funded (tuition-fee) route you will be required to pay the fees.\r\nThe fees that you are due to pay can be split into three termly payments or they can be paid in full at the start of the academic year.\r\n\r\nFor part-time trainees the course fees are £6,935 per academic year (inclusive of VAT) and will be payable by the Trainee to the National Institute of Teaching (NIoT) by one of the following methods: \r\n\r\na) In full - Trainees who opt to pay the fees in full shall pay the fees on or before 4th September 2023; \r\n\r\nb) Instalments - Trainees who opt to pay the fees by way of instalments shall pay the fees as follows in Year 1: \r\n4 September 2023 = £2,311.67 \r\n9 January 2024 = £2,311.67 \r\n17 April 2024 = £2,311.66 \r\n \r\nc) Through Student Finance England - Trainees with the benefit of a tuition-fee loan may opt to have the fees paid directly to the NIoT in three instalments.  It is the trainee’s responsibility to ensure that the NIoT receives the fees and the NIoT may, in discretion, having considered all of the relevant circumstances, refuse admission or terminate attendance to the course in the event that payment has not been received by any due date.  \r\n \r\nIn Year 2, fees are dependent on how many terms you are with us. Please see our website http://www.niot.org.uk for more details.","aboutCourse":"Our full-time programmes last for one academic year, from September to July. As a trainee teacher, you’ll be based at one of our partner schools, where you’ll learn to teach alongside expert classroom practitioners in an exciting, vibrant environment. \r\n\r\nDuring the course you will spend one day a week at Core Training. This will be a blended model of online and face-to-face sessions, based at Trinity Institute of Education.  This is a school-centred, immersive programme where you will be teaching across the year, the rest of your week is spent in your school placements.\r\n\r\nThe training sessions are facilitated by our expert practitioners who will model outstanding planning, teaching and assessment to support your development as a teacher. You will have lots of opportunities to interact and learn from peers from across subjects and phases.\r\n\r\nThere are a number of Subject-specific training days as part of the Core Training which includes the following content as a minimum:\r\n\r\n* Lesson Planning/Subject Knowledge 1 \r\n* Behaviour for Learning: Science/Subject Knowledge 2 \r\n* Questioning/Active AFL/Subject Knowledge 3\r\n* Literacy and Numeracy in Science/Subject Knowledge 4\r\n* Teaching for Exam Success: Assessment Objectives/Subject Knowledge 6\r\n* Teaching for Exam Success: Required Practicals/Subject Knowledge 6\r\n* A-Level Science\r\n* Curriculum intent, implementation and Impact/Subject Knowledge 7\r\n* Observing good practice\r\n* Engaging and Enthusing in Science\r\n\r\nAssessment and Accreditation\r\n\r\n* The National Institute of Teaching (NIoT) programme leads to the award of Qualified Teacher Status (QTS) through the NIoT (an accredited provider), with PGCE and Master’s Level Credits awarded in partnership with the University of Birmingham. \r\n\r\n* As a trainee teacher, you will be assessed holistically against the NIoT Curriculum, across the training year in both your school-based training and Core Training. By the end of the course, this will enable you to demonstrate that you have met the Teachers’ Standards as required for QTS. \r\n\r\n* The elements that make up the holistic assessment include: mentor reports; evidence of application in practice; subject and curriculum knowledge; completion of Intensive Training and Practice (IT&P) reflections; attendance and punctuality; professional behaviours; mathematics and English proficiencies; engagement and input in training and a final assessment panel presentation.\r\n\r\n* The PGCE element of the programme is assessed by: master’s level assignments; school experience.\r\n\r\nCourse arrangements and content may be subject to change in line with training partnerships with DfE requirements.","courseLength":"OneYear","salaryDetails":null,"qualifications":"Requirements and eligibility\r\n\r\nGCSE:\r\n\r\nApplicants must have English and Maths GCSE at grade 4/C or above, or equivalent to train in secondary teaching. If you have completed an equivalent GCSE outside the UK, you will need to obtain NARIC certification.\r\n\r\nDEGREE:\r\n\r\nApplicants should have a good honours degree (2.2 or above) and an appropriate level of subject knowledge in your chosen subject.  If you have completed an equivalent degree outside the UK, you will need to obtain NARIC certification.\r\n\r\n\r\n\r\n","feesInternational":9250,"financialSupport":"The National Institute of Teaching scholarships and support are available for some subjects and phases (and are also dependent on schools).","interviewProcess":"If your application is successful, we will invite you to a face-to-face interview with the National Institute of Teaching Lead Mentors, which will consist of: \r\n\r\n  \r\n\r\n* Two independent written tasks designed to assess your subject/phase knowledge and understanding of professionalism. \r\n\r\n* a panel interview with a 7-minute teaching episode and formal questions designed to assess your suitability to train to teach.  \r\n\r\n* an opportunity to ask any of your own questions.  \r\n\r\n  \r\n\r\nWe will also be assessing your proficiency in English and collecting your eligibility documents for verification at the face-to-face part of the interview process. \r\n\r\n  \r\n\r\nPlease be prepared to bring any identification documents and original qualification certificates. \r\n\r\n  \r\n\r\nWhen you apply to us, you are applying to the National Institute of Teaching@Trinity Institute of Education as a central provider for our region. We will select the most appropriate placement following a discussion with you at interview. Please apply for one location only. We reserve the right to select the most appropriate placement and will discuss this at interview. \r\n\r\n \r\n\r\nFollowing this meeting, we will make you a formal conditional offer, which you will need to accept to secure your place on the course. You will then be sent a link to complete an online maths diagnostic assessment. \r\n\r\n  \r\n\r\nAll offers are subject to the satisfactory completion of pre-programme checks including an Enhanced DBS and Prohibition Order checks, two suitable references and a Medical Questionnaire to assess your fitness to work.","otherRequirements":"Alongside meeting all of the eligibility criteria, and having original certificates of all your qualifications, you must pass the pre-programme checks.  These will include an Enhanced DBS and Prohibition Order checks, and a Medical Questionnaire to assess your fitness to work. \r\n\r\nIf you have lived and/or worked overseas during the last 5 years you will need to provide an Overseas Police Check. \r\n\r\nYou will need to have the Right to Work in the UK as we do not offer visa sponsorships.","personalQualities":"We're looking for people who want to become outstanding teachers; people who genuinely enjoy working with children and young people; people who are passionate about education and who are relentless in their drive to ensure positive outcomes for children. \r\n\r\nYou will need the ability to develop effective relationships with relevant stakeholders: children, parents and carers, colleagues and peers, as well as external agencies. \r\n\r\nFurther essential qualities are outstanding organisation and communication skills, resilience, a proactive reflective approach and good interpersonal skills.  You should also have determination and energy, high standards of English, maths and excellent subject knowledge.","howSchoolPlacementsWork":"In order to ensure a well-rounded school-centred experience, you will undertake two school placements and four weeks of Intensive Training and Practice. You will be placed at your main placement academy for the majority of the year. We will work with you to agree a suitable placement which will be no longer than one hour’s travel from your home.\r\n\r\nThroughout your training you will have a personal mentor, who is an experienced teacher, to oversee the school-based element of your training year. They will support you, be a model of effective practice, observe your teaching and meet with you weekly. \r\n\r\nThere will be regular advice and guidance on strategies to promote wellbeing and safeguard against instances of mental and physical ill-health. Support might take the form of 1:1 meetings with a Lead mentor or Wellbeing Officer, access to the Employee Access Programme (EAP) or Intensive Practice on key areas e.g. behaviour management of children.\r\n\r\nYou will also benefit from a short second placement at a different partner school. This means you will experience teaching in a contrasting school to help you to develop your skills in a different context or age-range. We organise this based on a range of criteria to ensure an enriching school experience.\r\n\r\nDuring the course you will spend one day a week at Core Training. This will be a blended model of online and face-to-face sessions, based at Trinity Institute of Education.  This is a school-centred, immersive programme where you will be teaching across the year, the rest of your week is spent in your school placements.\r\n\r\nOur Secondary courses cover 11-16. This means you will have experience across these age ranges. There are also opportunities for trainees to teach at Key Stage 5, if appropriate to their subject. \r\n\r\nWhen selecting your main school placement, we take into consideration the distance from your home, childcare or caring responsibilities, mode of transport and any other pertinent information. The list of schools provided are who we work with and not a definite placement - we will discuss this with you.","status":1}
