{"id":"000d9618-cbec-4414-9648-9df050e5f7be","name":"Music","code":"3C2K","qualification":"pgce_with_qts","startDate":"2024-07-31T23:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"24311bef-8673-41fb-933c-53f887fb6976","code":"W3","name":"Music"}],"locations":[{"id":"1ffe4555-d138-4a62-9146-6f48ba0764a4","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"48245589-8feb-475b-aaf9-a44bf5204017","code":"2BN","name":"Southam Teaching Alliance"},"accreditedBody":{"id":"ef09ce50-ccfc-4346-a0ce-43e840153dab","code":"W20","name":"The University of Warwick"},"profPost":"PG","degreeGrade":"1","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feeDetails":"The fee for a School Direct Training place is paid directly to Warwick University by the applicant. ","aboutCourse":"The School Direct training route will prepare you to teach Music to students aged 11 to 18. You will spend most of your time in the base school but will also have the opportunity to complete a second placement for 6 weeks at a complementary school within our teaching alliance. You will spend 4 days a week in school and one day at Warwick University. You should consider this course if you have a passion for the subject and would like to contribute to young people's development by supporting them to acquire a knowledge base for life long skills in Music. \r\n\r\nAt Warwick University there will be a set amount of PGCE assignments to complete across the course. Within our school, you will receive specialised support from a subject mentor and a professional mentor. You will have regular mentor meetings to review your progress and reflect on how your teaching is developing. We aim to produce teachers who are outstanding in their practice, self reflective and engage in action research to support their further development. At Warwick University you will be taught by teams of highly experienced practitioners who have a national reputation for the quality of their training. \r\n\r\n\r\n\r\n","interviewProcess":"Interviews will be held with the Head of the Teaching School and either the Head Teacher of Southam College (the lead school for the teaching school alliance) or the Head Teacher of a partner school. ","howSchoolPlacementsWork":"We partner with 3 different Secondary schools within our alliance. You may be placed at any one of these schools for a School Direct Training place, where they have indicated they have specialised subject support. You will be based in one school for the majority of your year with an additional complementary placement for 6 weeks in another school. You will teach across the 11 to 18 age range in your placements. ","personalQualities":"We are looking for applicants who have a genuine passion for working with young people and supporting their development on both academic and personal levels. ","status":1,"createdAt":"2021-07-06T10:54:30.016Z","updatedAt":"2021-09-20T09:51:46.308Z","canSponsorStudentVisa":"yes","cycle":"2024"}
