{"id":"04560d37-1024-4a2a-b7bc-650245fdc1f0","name":"Biology","code":"1XT2","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"322cfc19-d51d-45db-91e3-bd7b4738470f","code":"C1","name":"Biology"}],"locations":[{"id":"1ffe4555-d138-4a62-9146-6f48ba0764a4","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"48245589-8feb-475b-aaf9-a44bf5204017","code":"2BN","name":"Southam Teaching Alliance"},"accreditedBody":{"id":"3e6c62a3-5d34-4a91-9c23-01c7409fd909","code":"L34","name":"University of Leicester"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feeDetails":"The fee for a School Direct Training place is paid directly to the University of Leicester by the applicant.","aboutCourse":"The School Direct training route will prepare you to teach Biology to students aged 11 to 18. The PGCE course at the University of Leicester is divided into two halves, Phase A and Phase B, each with clearly delineated priorities to guide progress towards successful completion. \r\nTwo-thirds of the time (currently 24 weeks out of 36) is spent in schools, starting with a two week preliminary attachment to a Primary school with time spent in a Secondary school that its pupils transfer to.  You should consider this course if you have a passion for the subject and would like to contribute to young people's development by supporting them to acquire a knowledge base for life long skills in science/Biology. \r\n\r\nAt the University of Leicester there will be a set amount of PGCE assignments to complete across the course. Within our school, you will receive specialised support from a subject mentor and a professional mentor. You will have regular mentor meetings to review your progress and reflect on how your teaching is developing. We aim to produce teachers who are outstanding in their practice, self reflective and engage in action research to support their further development. At the University of Leicester you will be taught by teams of highly experienced practitioners who have a national reputation for the quality of their training.","interviewProcess":"Interviews will be held with the Head of the Teaching School and either the Head Teacher of Southam College (the lead school for the teaching school alliance) or the Head Teacher or Deputy responsible for Teaching and Learning at either Bilton School (Rugby) or Kineton High School (Kineton).  The interview process may also involve a representative from the University of Leciester. During  your day, you will also be asked to complete a numeracy and literacy focused task to assess the functional competencies required for a school setting. ","howSchoolPlacementsWork":"We partner with 3 different Secondary schools within our alliance. You may be placed at any one of these schools for a School Direct Training place, where they have indicated they have specialised subject support.  You will teach across the 11 to 18 age range in your placements.\r\n\r\nPhase A\r\nAfter induction you will spend 8 weeks in your Phase A placement school.  You will build on existing experience and develop new skills with support from the school's Coordinator for Initial Teacher Education and a subject mentor who will oversee your professional development during the placement and liaise closely with your university tutor who will also support you.  During this placement you will be expected to fulfil a 50% timetable.    \r\n\r\nPhase B \r\nDuring your second placement you will spend about 14 weeks in a different school, also supported by a mentor, ITE Coordinator and university tutor.  During this placement you will be expected to fulfil a 66% timetable.   \r\n\r\nAll students will also undertake a week in a primary school following their Phase A placement to support their understanding of the broader context of education and to support writing of one of the PGCE assignments.\r\n","personalQualities":"We are looking for applicants who have a genuine passion for working with young people and supporting their development on both academic and personal levels.","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:54:29.645Z","updatedAt":"2021-09-30T08:32:16.546Z","canSponsorStudentVisa":"yes","cycle":"2024"}
