{"id":"375e2846-f142-4e37-8612-7d062c481913","name":"Primary","code":"E225","qualification":"pgce_with_qts","startDate":"2024-07-31T23:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"1ffe4555-d138-4a62-9146-6f48ba0764a4","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"48245589-8feb-475b-aaf9-a44bf5204017","code":"2BN","name":"Southam Teaching Alliance"},"accreditedBody":{"id":"ef09ce50-ccfc-4346-a0ce-43e840153dab","code":"W20","name":"The University of Warwick"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":20055,"aboutCourse":"The Primary programme is offered in a partnership between Southam Teaching School, Bishops Itchington Primary School, (Bishops Itchington), Temple Herdewyke Primary School, (Temple Herdewyke), Byfield Primary School (Byfield) Rokeby Primary School (Rugby), St Lawrence C of E Primary School (Napton) , Stockton Primary School (Stockton) and the University of Warwick. It is a high-quality programme of professional education, leading to qualified teacher status (QTS) and Master’s level credits. The course aims to develop you into a highly reflective practitioner, able to adapt and respond to changes in settings and national educational contexts, and able to take responsibility for your ongoing professional development in preparation for future leadership.\r\n\r\nOn the School Direct programme, the taught programme is approximately 35 days at the University of Warwick, and you’ll spend the remainder of your time in school. Time in school is organised into two placements over the three school terms.\r\n\r\nIn school, you will directly observe pupils as they learn and teachers as they teach, as well as trying out ideas in practice in classrooms for yourself. The course is designed to ensure that your experience in schools complements and builds on what is addressed at the University. In addition to lectures and seminars, you will have the opportunity for independent study. You will be assessed through written master’s level assignments spread across the year, which are aimed to assess your professional and subject specific learning. You’ll also be assessed on whether you meet the Teachers’ Standards at a level appropriate for a newly qualified teacher.\r\n","interviewProcess":"Interviews for Primary School Direct will be held in one of our base primary schools, You will be interviewed by the head teacher of the primary school and the Head of Southam Teaching School. You will receive a tour of the school and have the opportunity to ask questions about the school. You will be asked to prepare a 20 minute micro teach (you will be sent full details beforehand to help you prepare) and this is followed by a formal interview. During  your day, you will also be asked to complete a numeracy and literacy focused task to assess the functional competencies required for a school setting. ","howSchoolPlacementsWork":"During your training year, you will spend the majority of time in one school with a second later in the year. This is to give you a contrasting experience of schools and an opportunity to work with different learners and different practitioners from different schools. \r\n\r\nWe partner with 6 primary schools to deliver Primary School Direct placements all within a 20 mile radius of Southam Teaching School. \r\n\r\n","personalQualities":"We are looking for individuals who are motivated, enthusiastic and have a passion for working with young people. Teaching is full of challenges and rewards and the best teachers can nurture students to their full potential. ","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:54:30.191Z","updatedAt":"2021-09-20T09:53:02.196Z","canSponsorStudentVisa":"yes","cycle":"2024"}
