{"id":"f107f809-a984-4ded-961f-08f75cd8122b","name":"History","code":"29SS","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"5a3609a0-5bbb-4377-b919-5d89932ab622","code":"V1","name":"History"}],"locations":[{"id":"b4c18c9a-6e41-4466-bb31-b551741cca90","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"15d69054-c862-4f7a-b0ba-bb86087ce2f7","code":"N42","name":"Northampton Teacher Training Partnership"},"profPost":"PG","degreeGrade":"1","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"no","additionalGcseEquivalencies":"We do not offer Equivalency Tests.","courseLength":"OneYear","feesUK":9000,"aboutCourse":"On the NTTP History course, students will train towards a professional teaching qualification, achieving Qualified Teacher Status. The course requires a study of academic literature and completion of professional assignments, alongside two school based placements. The course is designed to show that trainee teachers demonstrate that they have met the standards for Qualified Teacher Status. \r\nYou will explore a wide ranging content, and be expected to convey the subject with passion and enthusiasm to students. The material taught will be in line with Placement School curriculum, but you can assume to have a spread of modern, medieval and ancient history lessons.\r\nThe development of core history skills is a key focus in both KS3 and KS4, and you will be taught how best to convey complex historical events, as well as embed both sourcework and historiography to lessons. Through support of excellent mentors, in supportive schools, we will ensure you have the best opportunity to develop into an outstanding History Teacher.\r\nYou will receive a practice-led, hands on experience. Trainees are supported by a Subject Based Tutor within school, the Professional Tutor of the school, the Lead Subject Mentor from the NTTP SCITT, the Programme Facilitators. Subject Studies and General Professional Study sessions enhance your knowledge of teaching and learning and help to develop your pedagogy. Constant self-reflection allows trainees to assess their strengths and development potential, which should allow progression and confidence.\r\nYou will spend the majority of your course in the classroom; working with dedicated professionals. This is the best place to learn the art of teaching.   During your placements you will teach pupils in the 11 to 16 age range. \r\n\r\nSubject Studies are delivered as twilight sessions and take place in the first half of the year so that you have the tools to succeed in your school placements. Sessions are delivered by your Lead Subject Mentor and other experienced teachers.\r\nA selection of subject studies sessions are as follows: \r\nWhat is Humanities? – Understanding why students need to study Humanities subjects\r\nChallenging mis/preconceptions in Humanities – how to tackle stereotyping in History\r\nDifferentiation within Humanities – How do you stretch students in a content heavy subject?\r\nAssessment for learning in Humanities – Measuring learning within humanities\r\nUse of sourcework in lesson – How to make sourcework engaging for students\r\nTeaching outside the classroom – making Humanities an outdoor subject\r\nApproaches and Methodologies towards KS5 Humanities – ","interviewProcess":"As with any interview, the key to success is preparation. Make sure you do your research into the course, as well as the issues surrounding education and teaching in general. Policies and practices change quickly, so your knowledge needs to be up to date.\r\nThe Interview process will entail: \r\n•\tAdministrative Questions \t\t\t\t-\t10 minutes\r\n•\tPresentation - “Why I want to become a teacher”\t-\t5 minutes\r\n•\tPresenting a ‘Starter’ of your choice\t\t\t-\t5 minutes\r\n•\tInterview \t\t\t\t\t\t-\t40 minutes\r\n•\tLiteracy written task\t\t\t\t- \t20 minutes\r\n•\tSubject Knowledge Task\t\t\t\t- \t30 minutes\r\n•\tPortfolio of work/video for Art and Performing Art subjects\r\n\r\nYour interviewers will be looking for you to demonstrate a number of qualities. You should therefore try to tailor your answers and contributions to reflect these qualities. They are:\r\n-\tA commitment to and understanding of secondary education and the role of the teacher\r\n-\tGood personal, intellectual and communication skills\r\n-\tA positive attitude towards children and working with children\r\n-\tAn enthusiasm for and understanding of your subject (s) and teaching in general.  \r\n","howSchoolPlacementsWork":"We have long-established partnerships and rewarding connections with a wide variety of secondary schools across the county.  Ideally, you will be required to spend a minimum of 12 weeks in two of our placement schools whilst on the course.  You will work closely with our trained school based tutors receiving weekly one-to-one meetings to monitor your progress throughout your first and second placement.\r\nTo qualify for QTS we will provide trainees with enough time in schools to demonstrate that they have achieved all the Teachers’ Standards.\r\nYou will train with pupils in the 11 to 16 age range, however in many of our partnership schools there will be the opportunity to experience Post 16 Education too.\r\nYou will be allocated to your placement school as a result of an initial induction and skills audit conducted early in the course.  Your placement school will be identified to meet your needs and therefore may not be your nearest school.\r\n\r\n","personalQualities":null,"otherRequirements":null,"status":1,"createdAt":"2021-07-06T10:53:27.961Z","updatedAt":"2021-09-29T14:11:54.162Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
