{"id":"596c00fc-f505-4ed8-97ce-048ef9ad0251","name":"History","code":"C636","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"B","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"5a3609a0-5bbb-4377-b919-5d89932ab622","code":"V1","name":"History"}],"locations":[{"id":"17ce0a72-4ba5-4444-a756-a9935fc6acc6","name":"Stour Valley Community School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"d868a8a8-7843-4c81-b0e9-61336a99a28d","name":"Stowupland High School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"384be93e-d7e1-4e22-ae66-84bea5800d83","name":"Stowmarket High School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"1e5ae8f2-f3d7-482e-85e7-b3be328e90e1","name":"Ormiston Endeavour Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"d6d5f670-ebc4-453f-91d7-9fc195c177e3","name":"Ormiston Sudbury Academy","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"19fc94ac-62e3-4176-ac49-9c36b6d8a349","code":"4T6","name":"The OAKS Suffolk"},"accreditedBody":{"id":"7f349baa-f4ef-4fd5-b228-fcc56247e9b9","code":"24P","name":"The OAKS (Ormiston and Keele SCITT)"},"profPost":"PG","degreeGrade":"1","additionalDegreeSubjectRequirements":"false","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Passes at GCSE in English Language and Mathematics at grade C or above (or recognised equivalent)","courseLength":"OneYear","feesUK":9250,"feeDetails":"With The OAKS there is a pre-course fee which covers\r\n- Enhanced DBS check\r\n- Fitness to teach\r\n- Purchasing of Bristol Guide (reduced cost from The OAKS)\r\n- Residential trip.  \r\n\r\nIn 2020/1 the total price for the above was £115, at this moment in time we are unable to confirm the price for 2022/23, but do not foresee this increasing dramatically.\r\n","aboutCourse":"All History course participants undertake areas of study in Learning, Teaching and Assessment in History. The OAKS course is built upon History in the National Curriculum, the Standards for the award of Qualified Teacher Status and the needs of Trainee Teachers, pupils and schools. History sessions will essentially look at ways of teaching History content through the 11-18 age range. Typical topics for History sessions include:\r\n\r\no\tUsing the national curriculum in the classroom – How to choose what topics in history to teach.\r\no\tHow to teach the following key topics; Battle of Hastings, World War One, World War Two, The English Civil War, Slavery, The Holocaust.\r\no\tCreativity in the classroom – How do you engage pupils?\r\no\tExam technique – how do we prepare our students for the exam?\r\no\tStarter and Plenary tasks to engage historians.\r\no\tDifferentiation in history – How to allow access for all students in history.\r\n\r\nAn important part of the course is learning how to create a stimulating and caring environment. To help create such an environment, you need to be enthusiastic and lessons need to be well planned and related to the needs of pupils. They need to be conducted in a well-organised way with a positive approach to control. You will be able to prepare in advance for handling different situations, since strategies for maintaining discipline and managing the learning in a History laboratory are considered and discussed.\r\n\r\nYou will be encouraged to make use of Digital Technologies. \r\n\r\nThese sessions are delivered by History Subject Experts in schools.\r\n","interviewProcess":"Our selection process is a two way process where you can find out if the OAKS is the training programme for you and we can decide if you can potentially become a good/outstanding secondary teacher.  We always carry out our interviews in one of our partnership schools, where you will be expected to teach either a class or a small group of their students for 15 minutes.  The students  give us feedback on your lesson, which we share with you during a formal interview.  This focuses on your lesson, your subject knowledge and your commitment to teach.  There are also several tasks for you to complete; these include a written subject specific activity, trial skills tests (unless you have already passed your literacy/numeracy) and a generic writing task.  The whole process should take no more than half a day at the school.  You are interviewed by Partnership School staff and OAKS tutors,  who will talk through the programme and school placements. There will always be plenty of time for you to ask questions and the decision as to whether you are accepted on to the course is usually made on the same day (this may vary depending on the subject/time of year).\r\n\r\nWe want the interview to be a very positive experience for you; please arrive promptly and formal dress is expected.  We look forward to meeting you!\r\n","howSchoolPlacementsWork":"We will send you to two secondary schools where you will receive an 11-16 experience; the time spent in both of these placements is the same.  Hopefully they will give you two very different experiences.  We make sure that you also receive a pre and post phase enhancement so you will be placed in a primary school for one week and gain experience in a post-16 environment (possibly in one of your secondary placements).  We are very proud of our alternative education placements that we arrange for you on our programme.  Hopefully you will gain experience in an EAL school, pupil referral unit (PRU), special school and maybe an independent school.  \r\n\r\nTravel to and from your placements is always a key concern and we make every effort to make sure that you can easily commute to your schools.  We guarantee that you will never have to travel more than 75 minutes.  In fact, most of our trainees travel well under an hour to their teaching experiences, with many training in the town they live.  \r\n\r\n We train and then monitor all of our school based mentors and the quality of our school’s provision annually; so rest assured that you will have a good teaching experience with us at the OAKS.\r\n\r\n","personalQualities":"- Highly motivated individuals who want to make a positive contribution to the education of young people.       \r\n- Trainees who are passionate about their own specialism subject, with very good subject knowledge.  \r\n- Who are able to inspire their learners and create an environment where everyone wants to succeed.       \r\n- Candidates that show enthusiasm and a willingness to participate in the all aspects of the training course.       \r\n- Robust, resilient applicants who want to make a difference in the classroom.       \r\n* People who want to become good or outstanding classroom practitioners, with a desire to improve themselves and their student's.\r\n","otherRequirements":"- a medical report which is deemed satisfactory;\r\n- a completed DBS enhanced disclosure which is deemed satisfactory by the The OAKS;\r\n- a successful completion of a minimum of 10 days teaching experience in a secondary school/college during the last two years. This could be either before or after selection (undertaking this before the selection process commences will strengthen your application).\r\n","status":1,"createdAt":"2021-10-27T13:32:22.810Z","updatedAt":"2021-10-27T13:33:56.834Z","canSponsorStudentVisa":"no","cycle":"2024"}
