{"id":"a0793a40-5dae-4524-a1d1-fc503802ce9d","name":"Art and design","code":"Q703","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"B","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"d461a678-3335-4ca2-9616-1dc479d31a49","code":"W1","name":"Art and design"}],"locations":[{"id":"d868a8a8-7843-4c81-b0e9-61336a99a28d","name":"Stowupland High School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"1e5ae8f2-f3d7-482e-85e7-b3be328e90e1","name":"Ormiston Endeavour Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"17ce0a72-4ba5-4444-a756-a9935fc6acc6","name":"Stour Valley Community School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"d6d5f670-ebc4-453f-91d7-9fc195c177e3","name":"Ormiston Sudbury Academy","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"19fc94ac-62e3-4176-ac49-9c36b6d8a349","code":"4T6","name":"The OAKS Suffolk"},"accreditedBody":{"id":"7f349baa-f4ef-4fd5-b228-fcc56247e9b9","code":"24P","name":"The OAKS (Ormiston and Keele SCITT)"},"profPost":"PG","degreeGrade":"1","additionalDegreeSubjectRequirements":"false","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Passes at GCSE in English Language and Mathematics at grade C or above (or recognised equivalent)","courseLength":"OneYear","feesUK":9250,"feeDetails":"With The OAKS there is a pre-course fee which covers\r\n- Enhanced DBS check\r\n- Fitness to teach\r\n- Purchasing of Bristol Guide (reduced cost from The OAKS)\r\n- Residential trip.  \r\n\r\nIn 2020/1 the total price for the above was £115, at this moment in time we are unable to confirm the price for 2022/23, but do not foresee this increasing dramatically.\r\n","aboutCourse":"Are you looking for a career that will enable you to use your skills in art and design to encourage young people to explore, challenge and understand the world in which they live? If so, our Secondary Art and Design course is for you. Art and Design is an exciting secondary school curriculum subject and incorporates a wide range of design disciplines including Art, Textiles, Ceramics and Photography. As a trainee you will learn how to teach art and design to pupils in the 11-16 age range within the secondary age phase, with additional primary and post-16 enhancements. You will learn how to develop skills, knowledge and understanding for teaching art and design through a combination of university-led and school-led training\r\n\r\nThe course is often tailored to the areas of weakness identified by trainees at the start of the course. However, typically these topics have included:\r\n\r\n- Word and Image/Journal Art \r\n- Print making\r\n- Ceramics\r\n- Mixed media textiles\r\n- Digital Photography \r\n- Photoshop \r\n- Critical Analysis/Analysing Art \r\n- Digital Photography \r\n- Portfolio Polish\r\n\r\nThe course also considers the following pedagogical aspects: Exam technique: looking in some detail at how we prepare our students for their exams and practical tasks, how pupils are assessed, and how to manage and record assessments efficiently.\r\n\r\nYou will be encouraged to create a dynamic and creative atmosphere within your classroom, given insight into how to work well in a practical environment and how to make use of other qualified adults. To help create such an environment, you need to be both enthusiastic and well organised!\r\n\r\nThese sessions are delivered by an Art & Design Subject Expert in schools.\r\n\r\nTo sum up, the course aims to help you become a competent, professional and, above all, creative practitioner, capable of developing the imaginations and abilities of the young people with whom you have the privilege of working","interviewProcess":"Our selection process is a two way process where you can find out if the OAKS is the training programme for you and we can decide if you can potentially become a good/outstanding secondary teacher.  We always carry out our interviews in one of our partnership schools, where you will be expected to teach either a class or a small group of their students for 15 minutes.  The students  give us feedback on your lesson, which we share with you during a formal interview.  This focuses on your lesson, your subject knowledge and your commitment to teach.  There are also several tasks for you to complete; these include a written subject specific activity, trial skills tests (unless you have already passed your literacy/numeracy) and a generic writing task.  The whole process should take no more than half a day at the school.  You are interviewed by Partnership School staff and OAKS tutors,  who will talk through the programme and school placements. There will always be plenty of time for you to ask questions and the decision as to whether you are accepted on to the course is usually made on the same day (this may vary depending on the subject/time of year).\r\n\r\nWe want the interview to be a very positive experience for you; please arrive promptly and formal dress is expected.  We look forward to meeting you!\r\n","howSchoolPlacementsWork":"We will send you to two secondary schools where you will receive an 11-16 experience; the time spent in both of these placements is the same.  Hopefully they will give you two very different experiences.  We make sure that you also receive a pre and post phase enhancement so you will be placed in a primary school for one week and gain experience in a post-16 environment (possibly in one of your secondary placements).  We are very proud of our alternative education placements that we arrange for you on our programme.  Hopefully you will gain experience in an EAL school, pupil referral unit (PRU), special school and maybe an independent school.  \r\n\r\nTravel to and from your placements is always a key concern and we make every effort to make sure that you can easily commute to your schools.  We guarantee that you will never have to travel more than 75 minutes.  In fact, most of our trainees travel well under an hour to their teaching experiences, with many training in the town they live.  \r\n\r\n We train and then monitor all of our school based mentors and the quality of our school’s provision annually; so rest assured that you will have a good teaching experience with us at the OAKS.\r\n\r\n","personalQualities":"- Highly motivated individuals who want to make a positive contribution to the education of young people.       \r\n- Trainees who are passionate about their own specialism subject, with very good subject knowledge.  \r\n- Who are able to inspire their learners and create an environment where everyone wants to succeed.       \r\n- Candidates that show enthusiasm and a willingness to participate in the all aspects of the training course.       \r\n- Robust, resilient applicants who want to make a difference in the classroom.       \r\n* People who want to become good or outstanding classroom practitioners, with a desire to improve themselves and their student's.\r\n","otherRequirements":"- a medical report which is deemed satisfactory;\r\n- a completed DBS enhanced disclosure which is deemed satisfactory by the The OAKS;\r\n- a successful completion of a minimum of 10 days teaching experience in a secondary school/college during the last two years. This could be either before or after selection (undertaking this before the selection process commences will strengthen your application).\r\n","status":1,"createdAt":"2021-10-27T13:06:07.623Z","updatedAt":"2021-10-27T13:07:27.972Z","canSponsorStudentVisa":"no","cycle":"2024"}
