{"id":"42561805-b51e-4c5e-90aa-a99d48ad0a87","name":"Computing","code":"2TSK","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"e6be6a9c-8696-4b88-8fbd-1ba1bef1b6fc","code":"11","name":"Computing"}],"locations":[{"id":"a93c51ec-2da0-419f-a8fc-2a0b05dcfc56","name":"Main Site","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"4bebc07c-d4e1-4ea7-aa23-e37b64516422","code":"1KT","name":"SJPTSA"},"accreditedBody":{"id":"e843cb68-d310-478c-8dba-cf9633fea086","code":"C55","name":"University of Chester"},"profPost":"BO","english":"2","maths":"2","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feesInternational":12450,"feeDetails":"Bursaries and scholarships are available to trainees on a fee-based teacher training course in England that leads to the award of qualified teacher status. Availability is dependent on your highest relevant academic award and the subject in which you are training to teach. To receive a bursary or scholarship you must be entitled to support under the Student Finance England criteria. Both elements will be assessed by your teacher training provider. If you have a degree from outside the UK, you should refer to the overseas degree equivalency table to see the bursary your degree may attract. ","aboutCourse":"The course starts in September with your first placement starting immediately. You will spend most of your time in school, either here at SJP or in one of our partner schools, with a dedicated subject mentor and a professional mentor who will oversee your training. You will be part of the school community from day one. You will start observing lessons and will gradually start teaching at a pace that suits you. You will be guided every step of the way by our experienced mentors and teachers. ","interviewProcess":"Interview takes the form of a written task, an opportunity to interact with students, observation of your chosen subject and an interview with one of our Senior Leadership Team and the Head of the Department that you have applied to join.","howSchoolPlacementsWork":"You will have three placements, with two of them being in the same school setting. You will be teaching students aged 11 to 18 over the course of your three placements. At least one of your placements will be in St John Plessington Catholic College. \r\n\r\nIt is important that you are able to travel as placements will be in Alliance schools and trainees may also have joint professional development sessions in Alliance schools. Placements will be in schools of contrasting natures and you will have the opportunity to benefit from first-class professional development.","personalQualities":"","otherRequirements":"","status":2,"createdAt":"2021-07-06T10:48:32.055Z","canSponsorStudentVisa":"yes","cycle":"2024"}
