{"id":"93484303-a08d-49a8-afdc-d8207d53686a","name":"Business Studies","code":"3374","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"14_to_19","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"de6477b2-6027-48e6-b9f7-3206774705c2","code":"08","name":"Business studies"}],"locations":[{"id":"f5b9432a-e6ad-4824-b0fa-7adc24ff3774","name":"Derby Hub","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"52152e02-61fc-4c95-a124-496d673831e5","code":"186","name":"Landau Forte College Derby SCITT"},"profPost":"BO","degreeGrade":"0","additionalDegreeSubjectRequirements":"false","english":"2","maths":"2","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feeDetails":"The fees are £9,250 for QTS with PGCE. If you are training to be a teacher, you can apply for finance to cover course fees.","financialSupport":"You may be able to take out a student loan to pay for your tuition fees and living costs.","aboutCourse":"You will spend the majority of your week based in school, learning from outstanding teacher educators who will provide the mentoring, pastoral care and subject support you need on a daily basis. \r\n\r\nYou will have a one day induction in July and a week induction in September.  Some of our partner schools may also invite you to join their July/September induction days. Following this induction you will start in your main placement school and meet the team, complete all compulsory safeguarding training, shadow and observe colleagues and start to immerse yourself in school life. In a short period you will begin to take on classes to teach by yourself, always with the support of other colleagues in your team and at a pace you are happy with depending upon your previous experience. You won’t begin to teach straight away but take the first few weeks to observe great teaching and get to know your base school and the students you will be teaching.\r\n\r\nThroughout the course you will have weekly Education and Professional Studies sessions based at the SCITT hub at Landau Forte College. These sessions will provide a framework for you to develop as a teacher and support the practical side of your training with up to date academic research based input. \r\n\r\nTrainees highly value our subject training. An experienced Subject Knowledge Tutor will support the development of your subject delivery and those areas which have been highlighted from your subject knowledge audit. Subject Knowledge sessions will deepen your subject knowledge in relation to curriculum needs and appropriate teaching and learning strategies, with a particular focus on how educational issues such as assessment, planning, and delivery can be most effectively achieved in the classroom.  The focus is on practical solutions to ensure that you develop as a creative and reflective classroom practitioner.\r\n","interviewProcess":"It is important to take the time and care over your application to us. Whilst previous school experience is not required, we would expect you to show a passion for your subject, especially if you are applying for a subject which is not related to your degree discipline. Once you have been shortlisted, you will be invited to attend the assessment process either online or face to face at our SCITT hub in Derby or at one of our partnership schools (COVID permitting). \r\n\r\nWe ask candidates to teach a short 15 minute lesson in your subject to a small group of students. An interview with a small panel will include some general teaching and subject specific questions which allows you to demonstrate your passion and enthusiasm for your subject and why you have decided to become a teacher. We want to get to know the person behind the application. You will also be expected to complete a number of other subject related tasks; a subject knowledge audit so we can review your level of subject knowledge prior to the course, a subject GCSE exam question, a literacy task based on a piece of reflective writing and a maths challenge.\r\n","howSchoolPlacementsWork":"Our partner schools are located in Derby, Derbyshire and Tamworth. Most of your school based training will take place in one school from September to July, with a shorter second placement in a contrasting school in January/February. \r\n\r\nTrainees will be expected to be able to travel to locations up to a 30 minute drive so that we are able to give you a contrasting experience.\r\nWe also organise primary placements and a specialist placement to a local SEND school to develop your knowledge of transition to secondary and SEND. A placement is also available at a pupil referral behavioural unit for those trainees who wish to experience this. Throughout your placement, you will have the opportunity to take part in all aspects of life as a teacher. You will have a close team of people around you to support, guide and mentor you to achieve success as a trainee and feel ready to take up the challenge of being a Early Career Teacher.\r\n\r\nTraining and teaching in Derby offers the best of both worlds - multicultural city life on the doorstep of a stunning rural environment. Derby is at the heart and centre of the country and has great transport links such as East Midlands Airport and train links to all areas of the country. It is home to global businesses like Rolls Royce, Bombardier and Toyota and the UNESCO World Heritage site of Derwent Valley Mills.\r\n","personalQualities":"A genuine interest in young people and a passion for their development and well-being are key. We expect you to be resilient, work hard and be committed, but the work will be rewarding.  Teaching is a job where you can really make a difference to young people's lives. Teaching is about working with others - pupils, colleagues, parents and carers.  By working in our schools we encourage you to work collaboratively, both with other trainees and with our teachers.","otherRequirements":"We are committed to safeguarding and promoting the welfare of children and young people and expect all staff and volunteers to share this commitment. All trainees will have a Disclosure and Barring Service (DBS) criminal records check including a check of the children’s barred list.","status":1,"createdAt":"2021-07-06T10:49:26.587Z","updatedAt":"2022-01-12T10:24:17.537Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
