{"id":"52d65972-0eb9-4bac-ad36-39f79a06d8e2","name":"Religious education","code":"B395","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"724b5d16-28dd-4431-bc17-ea4be4daedc4","code":"V6","name":"Religious education"}],"locations":[{"id":"4b332e6f-7612-4121-a500-3cedb45a8013","name":"Healing School - A Science Academy","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"d63dbf19-431b-48e2-9905-17ebff79d484","code":"1ES","name":"Harbour Learning Trust"},"accreditedBody":{"id":"1d95b6cb-0e08-4485-848a-0e304d71102a","code":"B38","name":"Bishop Grosseteste University"},"profPost":"PG","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"Candidates should be advised that their degree subject should match or be closely related to religious Education.","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"The equivalency tests accepted remain at the discretion of our HEI partnerships. The recommendation is that a candidate who wishes to train with the Harbour Learning Trust for ITT directly contact the relevant HEI provider, prior to submission of their application for all equivalency enquiries.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"A Postgraduate Certificate in Education (PGCE) with Qualified Teacher Status (QTS) is awarded to successful trainees at the end of the full School Direct Training year. This allows you to teach in England, Scotland, Wales and Northern Ireland. This qualification is also recognised internationally. Many PGCE courses include credits that count toward a Master’s degree. The School Direct Programme runs from September through to July, for each academic year.\r\nThe Harbour Learning Trust (HLT) provides an exceptionally high standard and varied compulsory CPD training programme throughout the training year. All CPD is delivered by outstanding teachers from across the region, both within and externally to our trust alliance. At the start of the year trainees attend compulsory blocks of training at the HEI and subsequently attend the HEI once a week throughout the remainder of the School Direct training year.\r\n\r\nTrainees work very closely with an institution/school-based mentor, have weekly meetings with this mentor and monitor personal progress against The Core Content framework (CCF.) The amount of time trainees spend teaching will gradually increase over the course of the year. It is unique according to each trainee’s individual progression paths, their confidence and prior classroom experience. Trainees will work towards teaching a 70% timetable by the end of the programme.\r\n\r\nAll trainees will work with a school-based mentor from within their specialist subject area, or key stage. They will observe and teach lessons with both the mentor and host teachers within the specific area. \r\n","interviewProcess":"Once shortlisted by The Harbour Learning Trust (HLT), applicants will be invited to attend interview with both The Harbour Learning Trust and HEI partner, following a telephone pre-screening. \r\nThe interview requires applicants to undertake a series of individual teaching based tasks. Applicants will be interviewed either face-to-face in a school setting or via video conference. \r\nThe interview tasks include: an assessment of classroom proficiency and teaching potential, through a taught lesson or presentation. An assessment of applicant’s reflection and evaluation skills, followed by a formal panel interview.","howSchoolPlacementsWork":"The School Direct training programme will take place in two institutions over the course of the academic year.\r\nA key benefit of the The Harbour Learning Trust Training is that applicants can select their phase one placement institution, which is returned to for the entirety of phase three. The Harbour Learning Trust allocates the phase two contrasting institution placement, which is based around the specific training needs of those on our courses.  \r\n","personalQualities":"Applicants must show enthusiasm and confidence for the subject; a commitment to teaching and possess a genuine desire to enhance the learning experiences of young people. \r\nApplicants must have the ability to work effectively as a member of a team, show good interpersonal skills and display reflection on their own practice. Good communication and organisational skills are essential to a trainees progression throughout this course.","otherRequirements":"Please note that prior school-based experience is not a statutory requirement for our applicants. We do, however, view such experience as desirable.\r\nAll applicants to the Harbour Learning Trust must possess an Enhanced DBS criminal records check, as a compulsory requirement, to enable them to work across Schools within our partnership. This must be in place by 2 weeks prior to the commencement of the course and is sourced in conjunction with the HEI provider.","status":1,"createdAt":"2021-07-06T10:48:30.047Z","updatedAt":"2021-10-05T16:27:07.384Z","canSponsorStudentVisa":"yes","cycle":"2024"}
