{"id":"a11082c9-37aa-4991-8d42-e20c78671df5","name":"Modern Languages (Spanish with French)","code":"2Y65","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"ce8523ef-9236-4cd9-b260-d826c7a521b3","code":"ML","name":"Modern Languages"},{"id":"9727f674-61ba-4efa-b1f2-21ec7e354442","code":"15","name":"French"},{"id":"e34fd2a3-a32e-44e9-aea1-666badf3ac03","code":"22","name":"Spanish"}],"locations":[{"id":"64b889c2-8e7e-402a-b3d0-97f106143c4a","name":"Pioneers Partnership SCITT (placement schools discussed at interview)","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"4ea9c371-fd1b-4d83-bb71-392224146d87","code":"1Z8","name":"Pioneers Partnership SCITT"},"profPost":"PG","english":"2","maths":"2","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"financialSupport":"Bursaries are available for a number of different Secondary Subjects. Student Finance options also available. Further details available on the 'Get Into Teaching' website.","aboutCourse":"The main training placement for this particular post will be at one of a number of schools in the Rochdale and Tameside area.\r\nThe placement of at least 28 weeks, split into different phases, will begin with observations and very soon, you will be given the increasing responsibility for teaching groups of learners, whilst also gaining understanding of a teachers pastoral responsibility.\r\nYou will be assessed at key points throughout the year. Your teaching will be observed and you will gather evidence from a range of different sources to show how you are meeting the Teacher Standards.\r\nThroughout your training from September to July you will have a personalised programme of support from a Subject Mentor and a Professional Mentor. Their role is to facilitate your development as a teacher and build on your strengths, expertise and subject-knowledge.   You will be encouraged to continually reflect upon your practice, identifying your strengths and implementing strategies to improve your practice further.\r\nAll trainees meet weekly for Professional Development and Pedagogy. These sessions also give trainees the opportunity to share good practice with their peers and to work collaboratively to secure further improvements. In addition, you will meet periodically with your subject tutor and will be enrolled on the MMU PGCE.\r\n\r\n*Subject to change due to COVID 19 adaptations.*","interviewProcess":"We are looking for talented graduates who have the enthusiasm, passion and resilience that being an outstanding teacher requires. Teacher training is a challenging programme and we are looking for the commitment that will ensure that trainees complete the year successfully and go on to have outstanding careers.\r\nExcellent subject knowledge is expected, along with the ability to communicate this effectively to people of all ages and abilities. We understand that some applicants will have less experience but some time in schools, either working or observing would be beneficial.\r\nAbove all, we are looking for applicants who have a genuine enthusiasm for working with young people, along with the drive to become an outstanding teacher.\r\nAll applicants who demonstrate that they meet the eligibility criteria will be considered.\r\nThe Director of SCITT and Partnership schools will shortlist and will invite successful applicants for interview.  The interview will include:\r\n- Lesson Observation\r\n- A chance to meet with pupils\r\n- Literacy task (also numeracy for Primary trainees)\r\n- Formal interview\r\n- An opportunity to ask questions about the course\r\n\r\n*Subject to change due to COVID 19 adaptations.*","howSchoolPlacementsWork":"The main training placement for this particular post will be at one of a number of schools in the Rochdale and Tameside area.\r\nThe placement of at least 28 weeks, split into different phases, will begin with observations and very soon, you will be given the increasing responsibility for teaching groups of learners, whilst also gaining understanding of a teacher's pastoral responsibilities.\r\nYour second placement of approximately seven weeks, will give you the opportunity to develop your teaching in a contrasting school within the Partnership. Here you will develop the skills from your host placement school and adapt them to the needs of different groups of learners in a different environment.\r\nYou will then return to your host school where it will enable you to consolidate any of the Teacher Standards which you need to develop further. The final placement will also give you the opportunity to gain experience in a special school, a sixth form college or a Pupil Referral Service School.\r\n\r\n*Subject to change due to COVID 19 adaptations.*\r\n","personalQualities":"We are looking for talented graduates who have the enthusiasm, passion and resilience that being an outstanding teacher requires. Teacher training is a challenging programme and we are looking for the commitment that will ensure that trainees complete the year successfully.\r\nExcellent subject knowledge is expected, and the ability to communicate effectively.\r\nWe understand that some applicants will have less experience but some time in schools, either working or observing would be beneficial.\r\nAbove all, we are looking for applicants who have a genuine enthusiasm for working with young people, along with the drive to become an outstanding teacher.\r\n\r\n","otherRequirements":"All successful applicants will undertake a DBS check and a Health Check which determines ‘fitness to teach.'","status":2,"createdAt":"2021-07-06T10:55:50.912Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
