{"id":"ef93d7a9-3795-4881-bdfc-721f494095f2","name":"Primary","code":"29YW","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"yes","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"21a9e40e-4754-401f-b15e-e49f5fc41801","name":"Main Site- Boldmere Junior School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"78e2ac24-5caa-4856-997f-d6987bb5268c","code":"13B","name":"The Federation of Boldmere Schools"},"accreditedBody":{"id":"62d5803b-89ca-4e21-bb6f-5c74944c56ad","code":"B25","name":"Birmingham City University"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"You must use a third party to acquire these as it is not something that we are able to offer or support with.","courseLength":"OneYear","feesUK":9250,"feeDetails":"For more information regarding fee details please do visit the website of Birmingham City University. More details can be found regarding the course fees and what you are entitled to on this website.\r\nIn order to obtain this information please search Birmingham City University, School Direct Tuition Fees. This should enable you to find all related information to make an informed decision of this route in to teaching.","financialSupport":"If you are currently working in a school environment in any capacity and your school where you are employed offer you a bursary of any description. We can then negotiate with your current employers for you to access our route in to teaching with a 'home' school arrangement being put in to place. This will enable you to work in your existing school as a trainee teacher.","aboutCourse":"Our school Direct route in to teaching provides practical and supported teacher training experiences in the schools from within our partnership. Your training will include a minimum of 120 days in schools and 60 days of school and University based training. The majority of the 120 days in schools will take place in your 'Home School' but you will also undertake a block placement in a second school of a totally different context to that of your 'Home School'. Enabling you to have the opportunity to experience working in schools that widen your knowledge of educational provision.\r\nThe focus of our programme is School Direct (unsalaried), General Primary and successful completion leads to the internationally recognised Post Graduate Certificate of Education (PGCE) with Qualified Teacher Status. We do not offer any other route in to teaching and we ensure there is a consistent approach to the delivery of the Initial Teacher Training that we deliver.\r\nWe are looking for high calibre, articulate and deep-thinking graduates with a proven track record of academic success, who are committed to learning how to provide outstanding educational opportunities for all pupils that they work with.\r\nThroughout your chosen route in to teaching you will be rigorously assessed against the Teacher Standards, which will be a vital element of all your training. With lots of support, advice and guidance, you will be required to produce a Personal Development Portfolio as you are training. This portfolio will be assesses on a termly basis to ensure that you are gathering evidence that demonstrates your successes against the Teachers' Standards. Whilst you are training in your schools and carrying out class teaching and learning activities, your practice in the classroom will be observed at least once a week, giving you more valuable guidance of what next steps need to be taken to ensure you are meeting all of the course requirements.\r\nWhilst studying at BCU for certain elements of the course, you will also be expected to write three essays across the course of the academic year. You will complete one essay per term and each essay will be given a weighting of 20 credits, totally 60 credits across the year, with the final 40 credits being assessed whilst on school placement.\r\nThe School Direct Programmes start in the first week of September to ensure trainee teachers can be in school at the start of the academic year.","interviewProcess":"All interviews take place at Boldmere Junior School and generally the process takes half a day. After your application has been approved, you will be sent information regarding our interview process. When attending the interview you are required to bring your original GCSE and degree (if already obtained) certificates that you have listed on your application. You will also be asked to bring ID such as a passport or driving licence. Our interview process generally commences at 9.30am, the process will be divided in to two parts, with part one including the following:\r\n- A General Knowledge Test, assessing the breadth of knowledge that the government and the university acknowledge is vital for primary practitioners who teach the whole curriculum. All questions relate directly or indirectly to Primary Education.\r\n- A discussion task, assessing your understanding of some issues surrounding primary education and the challenges and rewards of the profession. In preparation for this task it would be useful to familiarise yourself with the Teachers' Standards (DfE 2012).\r\n- Teaching task, you will teach an introduction to a lesson of no longer than 15 minutes. You will be asked to teach a maths introduction to 12 Year 3 mixed ability children.\r\n- Written task, you will choose a topic in which you will demonstrate your understanding of issues within primary education.\r\nPart two will include your interview, enabling candidates to draw on personal experiences, demonstrating their understanding of primary education, the role of the teacher and their attitudes towards learning.\r\n ","howSchoolPlacementsWork":"We have several good and outstanding schools, as rated by their last Ofsted inspection and we use these schools as they have a proven track record of success, when placing our trainees. We have been working with a number of schools right from the very beginning of offering our initial route in to teaching. We have also added more schools as we have grown our number of trainees each year. The schools that we work with have their own unique individual context, each very different to another enabling us to ensure our trainees gain the vital experienced that is required to be a successful teacher.\r\nThis year we have successfully placed our trainees in the following schools: Newhall Primary, Boldmere Infant and Nursery, Boldmere Junior School, Penns Primary, Topcliffe Primary, Twickenham Primary, St Joseph's Catholic Primary, New Oscott Primary, St Nicholas Catholic Primary, Maney Hill Primary and Yenton Primary.\r\nWe have built up significant relationships with our schools and this year we had more schools wanting to host placements than trainees available, even though we recruited to our maximum number of trainees. Schools that have also had trainees previously and would have liked a School Direct trainee this year were, Walmley Juniors, Walmley Infants, Whitehouse Common Primary and Holland House Infant and Nursery. \r\nAll schools have had a consistent approach in ensuring all of our trainees experience the right support and this has led to a 100% of our trainees successfully passing the programme and gaining full time employment.\r\nWhen selecting the school that you will have your placements in we try to meet needs of locality as we believe that you should not be wasting time making long and exhausting journeys to school. The average distance that you will be required to travel from home to school is normally within three miles, most of our schools are in the north area of Birmingham.\r\nDue to the number of schools we work with we are able to offer the 3-7 age phase or 5-11 age phase route in to teaching and you will experience one placement in each of these.","personalQualities":"Although it is not a requirement, it would be preferable if you have some relevant experience of volunteering/working in a school. As we feel this is an important aspect of demonstrating your desire to become a teacher. This vital experience will allow applicants to be fully aware and informed of the aspects and challenges that the profession of teaching has. This vital experience may also allow you to obtain a reference from someone in education, which will be incredibly beneficial when submitting your application. We desire applicants that demonstrate a real hunger and passion for teaching through their experiences.","otherRequirements":"All successful applicants will be subjected to the appropriate Disclosure and Barring Service (DBS) checks before commencing the course, so that we are reliably informed of your suitability to work with children.\r\nThe appropriate Health Checks will also be carried out prior to commencing this route in to teaching.\r\nAny other relevant checks will be discussed at the point of an offer being made for our route in to teaching, so that we are certain that you are safe and dedicated enough to work with children in an educational setting.\r\n","status":1,"createdAt":"2021-07-06T10:51:11.888Z","updatedAt":"2021-11-18T14:21:20.698Z","canSponsorStudentVisa":"yes","cycle":"2024"}
