{"id":"24a8dc79-5ef3-417e-bae2-7b26847c7c9a","name":"Primary (Special Educational Needs)","code":"2QD2","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"yes","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"952554c7-b510-46df-a921-a2806e8ea4f0","name":"Southampton Inclusion Partnership","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"2c9bd644-9451-4605-aa68-1586fea4863d","code":"26W","name":"Southampton Inclusion Partnership"},"accreditedBody":{"id":"3700fb02-7007-40c8-9127-b070e146d6cb","code":"W76","name":"University of Winchester"},"profPost":"PG","degreeGrade":"1","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"There are various equivalency qualifications we accept which would need to be checked upon submission. \n\nFor those needing to re-take GCSEs or an equivalent test, the University currently accepts GCSE equivalency tests taken through either Equivalency Testing (www.equivalencytesting.com) and A Star Equivalency (www.astarequivalency.co.uk).","courseLength":"OneYear","feesUK":9250,"feeDetails":"Successful completion of the course leads to Qualified Teacher Status, either a Postgraduate or Professional Graduate Certificate in Education and credits towards a Master's degree, dependent on the number of credits achieved at Level 7. \r\n\r\nThis link provides helpful information about how student finance works including the application process:\r\n\r\n(https://www.gov.uk/student-finance-register-login)","financialSupport":"Please speak to Student Finance to see if you are eligible for any bursaries. ","aboutCourse":"Our trainees are school based Monday to Thursday and supported by the class teacher, their teacher tutor for the placement. After an induction period in September, trainees begin by co-teaching with the class teacher and with support slowly begin to take on more teaching and planning. The balance of teaching and learning is carefully managed throughout the year and increases with each placement and trainee confidence. \r\n\r\nEvery Friday is spent training either at the University of Winchester or within a SIP school. The training days cover the knowledge and skills you need to become a teacher and support your school based days. \r\n\r\nThe University provides training on English, maths, science, personalising learning and professional theory and practice. There are three university based assignments spread out over the year linking to the different modules. The University provides an assignment tutor and assignment guidance. SIP allocates trainees study days to aid with workload at specific points in the year. \r\n\r\nSIP provides training days based in our partner schools or local mainstream schools. These days complement the university based training but also delve deeper into the theories and practicalities of teaching pupils with SEND. Our training days are led by experienced teaching staff, multi-professionals, senior leaders and specialist leaders of education from both special and mainstream settings. \r\n\r\nTraining is adapted yearly based on current educational reforms, the Core Content Framework for ITT and feedback from course leads and trainees. Successful completion of the course results in trainees who are well equipped to teach SEND but also mainstream pupils. ","interviewProcess":"Our interviews include representatives from our partner schools and The University of Winchester. The interview process has been carefully adapted to ensure you get the very best from the experience. We talk to you about our partnership and have lots of opportunities for you to get to know us better. \r\n\r\nOur interview process includes: \r\n\r\n* a short classroom observation\r\n* an interview\r\n* a brief written and maths task \r\n\r\nPlease note - The Department for Education has withdrawn the requirement for ITE applicants to complete literacy and numeracy Skills Tests.  During the selection process and as part of your training, you will be required to demonstrate competency in Fundamental skills in English and mathematics.\r\n\r\nWe encourage candidates to attend our recruitment events which include a tour of one of our special schools and a chance to speak to staff from the school as well as past trainees. SIP also arrange volunteer days to give candidates the opportunity to spend time in schools of their choice. This experience is valuable as SEND is wide ranging so all our special schools are very different. Please contact us for more details and check our website (https://www.southamptoninclusion.net)","howSchoolPlacementsWork":"There are three school placements over the year plus an enhanced placement. Two placements are within special needs schools and one placement is within a mainstream school. Placements take place Monday to Thursday during the school terms, Fridays are training days. During the placements, trainees will teach across the primary age-range Key Stage 1 to Key Stage 2. We work closely with our trainees to choose the appropriate placements. \r\n\r\nThe Enhanced Placement takes place during the month of June at the end of the programme. Trainees get the wonderful opportunity to spend a short time in up to four very different schools. These range from nurseries, secondary special schools to a hospital school.  Trainees are not expected to teach during this placement, the aim is to expand their knowledge of other educational settings.\r\n\r\nThe two longer placements are within our special needs schools. We believe it is important for our trainees to experience two different schools as the nature of SEND is so wide ranging, we wish to fully prepare our trainees for their future career. For our trainees who wish to experience a further mainstream placement, we can offer mainstream experiences during the enhanced placement. ","personalQualities":"\r\n* A strong and genuine commitment to teaching\r\n* A commitment to improving outcomes for children and young people with SEND\r\n* An understanding of different types of SEND\r\n* An understanding of the challenges you might face during your training\r\n* An ability to reflect on, and learn from your own practice\r\n* An ability to develop and sustain effective working relationships.\r\n* Emotional resilience, a sense of humour and energy to deal with competing demands.\r\n* An ability to communicate clearly, effectively and succinctly.\r\n* An awareness of current issues in education and the role research plays","otherRequirements":"Any offers made are subject to successful completion of:\r\n\r\n* a criminal record check DBS\r\n* occupational health clearance \r\n* at least a GCSE Grade C or a Grade 4 in English language, maths and a science subject.\r\n* our minimum entry requirement for a first (bachelor's) degree is a lower second, a 2:2 or above.","status":1,"createdAt":"2021-07-06T10:46:22.872Z","updatedAt":"2021-09-24T11:23:30.953Z","canSponsorStudentVisa":"yes","cycle":"2024"}
