{"id":"b8deba14-f10d-4590-a33e-f76b0245558d","name":"Primary (SEND)","code":"L561","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_11","subjectLevel":"primary","isSend":"yes","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"7d5f0dcc-7e69-4752-b589-9063eae8a344","name":"Benton Dene School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"1116b22f-57b5-4fa0-8710-9bd51f1b73d6","code":"18O","name":"Benton Dene School"},"accreditedBody":{"id":"b384b008-59e2-461e-a15f-3551d1165c1e","code":"N77","name":"University of Northumbria at Newcastle"},"profPost":"PG","degreeGrade":"9","english":"1","maths":"1","science":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Our vision at Benton Dene School  is driven by a desire for all stakeholders to share a passionate commitment to learning, recognising and celebrating the uniqueness of each individual learner.  We believe our approach will inspire a love of lifelong learning and unlock the potential that lies within all our children, preparing them to be happy and successful in all stages of their life, as well as being responsible citizens.\r\n\r\nBenton Dene School includes a vast array of expertise and as a result, we are excited to be offering a multi-faceted school-based training programme.\r\n\r\nWe work alongside Northumbria University to provide this year-long course which allows trainees to gain QTS and PGCE. \r\n\r\nSuccessful applicants will spend a year working in one of the alliance schools alongside an experienced mentor. A placement in a second school is arranged ensuring all trainees have experience in two different settings and an alternative Key Stage.\r\n\r\nWe work alongside the SHINE Teaching Alliance which ensures that all of our trainees receive  mainstream experience along side SEN.\r\n\r\nYou will have training in areas of English, Maths, foundation stage subjects, assessment , behaviour management and safeguarding.\r\n\r\nWe pride ourselves on our approach to personalise the training course to meet the needs of all our trainees.  \r\n\r\n ","interviewProcess":"The interview process will consist of the following,\r\n\r\nPupil Panel. This will usually consist of children from the school council. They will ask the candidate a range of questions about themselves and what they can offer school. \r\n\r\nA task that will be delivered to a small group of children\r\n\r\nA formal interview with the Headteacher/Deputy Headteacher, a link person from Northumbria University and the lead teacher of School Direct in school. The interview is usually no longer than an hour. ","howSchoolPlacementsWork":"During the placement year, you will complete three placements.\r\n\r\nTwo of these placements will be based at the host school and the other will be at another local school. This placement will be organised by Benton Dene school and is usually about 8-9 weeks long. This gives you time to settle into your new class ready for your assessed placement.\r\n\r\nIn terms of placements we like to give you a range of experiences throughout all primary phases, including EYFS, Key stage 1 and Key stage 2.\r\n\r\nWe endeavour to provide exposure to a range of classes over school and will tailor your course to meet your individual needs.  \r\n\r\nYou will have a lead mentor at Benton dene as well as a class mentor on all placements. ","personalQualities":"These are the qualities we would like to see in a trainee teacher.\r\n\r\npassion for teaching/the subject.\r\ngood communication and organisation.\r\ncritical thinking.\r\npatience.\r\nsense of humour.\r\nability to communicate new ideas and concepts.\r\nliking young people.\r\n\r\nWe also ask that you have had experience working with children in an educational setting.  ","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:49:27.443Z","updatedAt":"2021-10-06T16:45:22.081Z","canSponsorStudentVisa":"yes","cycle":"2024"}
