{"id":"5436105a-d3c9-49d0-977c-985d28c49db4","name":"Primary","code":"A363","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"5ac546c7-6eba-483b-9745-145474bd4926","name":"Southampton","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"2a4e5292-329f-4924-b5e2-d7ff455be4b5","code":"2X3","name":"Aspire Community Trust"},"accreditedBody":{"id":"2b84ae64-ebca-4e4d-88b1-13effff3a411","code":"S27","name":"University of Southampton"},"profPost":"PG","degreeGrade":"1","english":"1","maths":"1","science":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"If we offer to anyone who needs an equivalency, we would require this to be our own equivalency test (rather than one taken elsewhere) and would administer this.","courseLength":"Up to 1 year","feesUK":9250,"feesInternational":21000,"feeDetails":"Fee for EU & international students is £19,850","financialSupport":"\r\n","aboutCourse":"Trainees will follow the full university led PGCE teaching programme, with two teaching placements in Aspire Trust schools. \r\n\r\nThe programme will suit people who aspire to become excellent primary teachers and want to gain an understanding of some of the theory underpinning effective teaching and learning in order to improve their practice. We aim for creative, reflective and dynamic practitioners who are committed to promoting the learning of all pupils in their classes and to help every child make progress in their primary education. Planned and delivered in close collaboration with practising teachers in local primary schools, the primary course introduces you to the whole primary curriculum while providing a secure basis for you to learn how most effectively to plan, teach and assess subjects of the National Curriculum and to organise and manage a classroom, for children aged 5-11 years. The course aims to develop your subject knowledge through a range of teaching and learning approaches: workshops, seminars, lectures and demonstrations, fieldwork and micro-teaching activities, independent and group research, and through reading and writing activities. \r\n\r\nThere are 4 Modules across the year. Three are 4000 word (or equivalent) assignments for the award of PGCE. The fourth assignment is a practical portfolio that is assessed for the award of QTS.  The assignments include a high degree of choice and strongly link theory and practice.  As well as preparing you to teach across the Primary Curriculum, you will also have several opportunities to personalise your course and begin exploring areas of specialism such as Science, MFL and English through additional opportunities.\r\n\r\nThe portfolio for QTS is collated weekly, over the course of the whole Academic Year, with a final submission at the end of the course in June.  The three PGCE assignments are handed in across the Academic year - with hand-in dates approximately at Christmas (early January), Easter (late February) and at the end of the course in May/June.","interviewProcess":"Interviews will be held in one of the Trust schools. If you are invited for interview you will be asked to organise and deliver a short teaching activity with a small group of pupils from the school.  You will also be interviewed by senior members of staff from Trust schools and one or more members of the university course team. We also ask you to undertake a short task to satisfy ourselves of your capability in written English. Decisions about acceptance are only made when all assessments are collated and discussed by the interview panel. We would encourage all prospective students to spend time in a Primary School so you are informed about the school environment, to confirm your own wish to teach and inform your own views. As these views will be explored at interview, you need to be able to reflect on aspects of what teachers and schools do and be able to talk convincingly about teaching in primary schools.","howSchoolPlacementsWork":"We aim to provide schools that offer contrasting placement experiences in order to develop a breadth and range of skills. At the beginning of the programme, trainees will be based in their host school for 2-3 days per week for seven weeks with the rest of these weeks spent in University. During the first placement block, one day every two weeks is dedicated to training in the university to allow trainees to integrate theory and practice during the early stages of their training. During the second placement, trainees attend school from Monday-Friday. Whilst on placement, each trainee is allocated a mentor who is the teacher of the class in which the trainee is placed. Trainees will also receive visits from their University tutor to support them in their teaching and professional development.","personalQualities":"We are looking for highly motivated, successful graduates who are committed to a teaching career in the Southampton area.  We want candidates who are passionate about working with children and focused on providing the best teaching and learning for all children.   We want graduates who have a strong understanding of what being a teacher involves, have strong communication and interpersonal skills and are happy to receive and act upon feedback.","otherRequirements":"We are committed to safeguarding & promoting the welfare of children & young people & expect you to share this commitment.  You will be required do the following before commencement of the programme:\r\n\r\nComplete a form describing your state of health which will be checked against the DfE Fitness to Teach regulations;\r\n\r\nProvide an Enhanced Disclosure from the Disclosure and Barring Service (DBS) to confirm that there are no criminal offences on your record which should bar you from teaching. Visit www.disclosure.gov.uk for more information. \r\n\r\n\r\n","status":1,"createdAt":"2021-07-06T10:51:32.420Z","updatedAt":"2021-10-05T09:57:33.392Z","canSponsorStudentVisa":"yes","cycle":"2024"}
