{"id":"7fdab8f0-34b9-44c8-bc90-2026293ff917","name":"Primary","code":"2XNK","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"44dceba5-78c3-42f5-8ed4-2d3e10776e02","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"4674a356-4808-4804-a59f-b0dc4420e905","code":"2CA","name":"Aquila"},"accreditedBody":{"id":"1165d5fd-11f4-4dab-99c9-47b309481463","code":"C10","name":"Canterbury Christ Church University"},"profPost":"BO","degreeGrade":"1","english":"1","maths":"1","science":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"no","courseLength":"OneYear","feesUK":5960,"feeDetails":"£5,960 is QTS Route ONLY\r\n\r\n£9,250 is PCGE with QTS\r\n \r\nInternational students are not eligible for non-salaried routes.\r\nThere are more details at (https://www.canterbury.ac.uk/study-here/courses/postgraduate/school-direct-18-19.aspx) under ‘Fees And Additional Costs’.\r\n","aboutCourse":"The training covers the whole primary curriculum with additional bespoke sessions for church schools on ethos, vision and values. All trainees are welcome to attend these sessions. We also provide training on teaching RE and leading an act of collective worship. You will have a bespoke induction day with the team and the opportunity to attend our MAT conference. Assessment is through the portfolio of evidence and academic assignments for the PGCE and masters level credits, both of these are optional additions to the main QTS training. PGCE assignments are intended to be based in practice and you will be supported by an academic tutor through the process of research and writing these essays. All CCCU training days are held at a CCCU campus. Aquila training may be in any of the Trust or partner schools.","interviewProcess":"The interview is intended for you to show that you have a passion for teaching and an understanding of the needs of primary aged pupils and how to engage them in learning. You will be interviewed by a panel which will include representatives of Aquila and CCCU.\r\nYou will be expected to complete a maths task and undertake a short piece of reflective writing as part of the interview process.  Alongside this we would ask you to plan a 30 minute reading activity for a group of mixed ability pupils.\r\nOnce you are successful, you will be given a list of schools offering a training placement and you should have a conversation with that school to ensure you will fit in with their team and you are confident they can meet your training needs.\r\n","howSchoolPlacementsWork":"Within Aquila, The Diocese of Canterbury Academies Trust you will have the choice of one of our Aquila primary schools across Kent.  The second school experience will be a minimum of a 4-week block of 20 days. Any missed days must be made up so that a minimum of 20 days are completed by all student teachers. Aquila will place you in a contrasting school for the whole of term 3.  Our schools are paired so you will build a relationship with the trainee who is usually in the school and the mentor. Student teachers should have visit days, in advance of, and in addition to, their block, in order to become familiar with their second school and gather the required information in order to make the best start to, and prepare to teach on, their second school placement. You will teach in your usual age range and a contrasting age class. You can elect to teach 4-7 year olds or pupils aged 5-11. There are currently 14 schools within Aquila but we will also partner with other schools which are equally committed to providing high quality teaching. All trainees also have the opportunity to see strong teaching practice in a nursery setting and visit a secondary school to see how subjects develop through a child's school career.\r\n\r\n","personalQualities":"Teaching is a highly rewarding profession. We expect you to be able to articulate a genuine passion for teaching and to be able to back this up through practical experience of working with primary aged children. We prefer this experience to be within a primary school and for a sustained period of time so you are prepared for the expectations of the training year. ","otherRequirements":"Aquila is committed to safeguarding and promoting the welfare of children. Successful candidates will be subject to a Disclosure and Barring Service check.\r\nWe aspire to excellence; to secure the best possible outcomes for children and young people, enabling them to fulfil their potential and make a worthwhile contribution to our diverse, dynamic society.\r\nOur academies design their coverage of the curriculum to provide challenging and exciting learning experiences in a caring and nurturing environment which is based on our strong values. Our academies value every individual and celebrate differences through their culture of mutual trust and shared values.\r\n","status":1,"createdAt":"2021-07-06T10:53:38.400Z","updatedAt":"2021-10-01T14:56:28.976Z","canSponsorStudentVisa":"yes","cycle":"2024"}
