{"id":"2f914325-9fcf-4a6e-9d95-053034939d32","name":"English with Media","code":"38CQ","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3aed1aa8-ae46-4b68-92bb-a6cc20655c59","code":"Q3","name":"English"}],"locations":[{"id":"4edf0752-128b-4c1d-b6a1-77e3f6e14b25","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"30bda414-7b00-426c-956b-18a187efe967","code":"L68","name":"London Metropolitan University"},"profPost":"BO","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"A UK degree, preferably grade 2.2 or equivalent. \nIf you hold a third class degree, you may still be considered, particularly if this qualification is supported by a completed Master's degree or relevant work experience.","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Require GCSE English grade B/6 and Mathematics grade C/4 or above (or equivalent). \nIf you need to take an equivalency test for any of the required GCSEs, please sign up for A Star Equivalency or Equivalency Testing. They offer all three GCSE equivalencies. Please be aware that you may need to undertake study towards the exam, either with the equivalency organisation or independently.\nAlternatively, you might want to sign up for a college course in the relevant subject, though this is likely to take longer and you may not have the chance for a re-sit, if required, prior to the start of the PGCE course.","courseLength":"OneYear","feesUK":9250,"feesInternational":13250,"feeDetails":"There may be some extra costs for books and learning materials. \r\n\r\nGraduates of London Met can save up to 20% on their postgraduate studies with us. This discount is available to home, EU and international graduates of London Met.  \r\n\r\nFor further details see the [London Met website](https://www.londonmet.ac.uk/applying/funding-your-studies/postgraduate-uk-students).","financialSupport":"You may be eligible for financial support while you study. See the DfE website for further details of bursaries and scholarships available for this course.\r\n\r\nYou can also explore [funding options with the university](https://www.londonmet.ac.uk/applying/funding-your-studies/).","aboutCourse":"This Secondary English with Media course leads to Qualified Teacher Status and to the academic PGCE qualification. It prepares you to teach 11 to 16-year-olds, while also giving you the opportunity to teach at a college level by arrangement. \r\n\r\nYou’ll learn to equip pupils with a strong command of the spoken and written language, and to promote high standards of literacy. This will help develop school pupils’ love of literature for their own enjoyment, alongside developing an interest in media studies.\r\n\r\nWe run this course in collaboration with the English and Media Centre (EMC), an award-winning educational charity. EMC tutors will provide you with support throughout the course, drawing on their extensive experience of consultancy for schools and running Continuing Professional Development (CPD) for teachers. You’ll continue to receive support from a dedicated EMC tutor throughout your school experience.\r\n\r\nThis PGCE course benefits from our London location and will broaden your understanding of teaching in multicultural and diverse urban environments. Through study, discussion and teaching, you’ll develop an understanding of how children learn and the methods you can use to help them to effectively develop their English and media skills.\r\n\r\nWe place great emphasis on sharing feedback with your peers and colleagues. You’ll complete a weekly reflection and contribute to discussions online in order to further develop your understanding of the role of a secondary teacher.\r\n\r\nIn the university-based sessions at our Holloway campus, you’ll develop your teaching strategies and pedagogical techniques, as well as discovering the fundamentals of how pupils learn. These sessions will include collaborative projects and school-based projects with other trainees, learning about the principles of teaching, as well as pupil assessment.\r\n\r\nThroughout your school placements, our school-based mentors and university tutors will support you in the classroom. University tutors will also teach your university sessions, ensuring there is continuity in the support you receive. By gaining experience both in the classroom and at university, you have the chance to reflect on links between your own teaching practice and theory. \r\n\r\nWith its high-quality teaching, this course is highly rated by Ofsted, who praised the 'inclusive, welcoming and open ethos and culture created by course leaders. Combined with the tailored and personalised support trainees receive, which enables them to successfully complete their training and confidently go on to gain employment.' (Ofsted 2016)\r\n\r\nFor more information, please see [PGCE Secondary English with Media](http://ldnmet.ac/Bztu50Db8xG).","interviewProcess":"All applications to London Met teacher training programmes, and those offered in conjunction by our Schools Direct partners, are checked and assessed at our Admissions Office based at our Holloway campus.\r\n\r\nDue to COVID-19, interviews and essential maths and English assessments are currently taking place online. Shortlisted applicants will be invited to an online interview and to complete online maths and English assessments. If you've applied to multiple routes of the same course offered by London Met (ie directly to London Met and also to one of our partner schools for the same subject) you'll only need to attend one interview. \r\n\r\nOnce you've completed your interview, we will normally confirm the decision through UCAS within one week. If you're offered a place at London Met, we will additionally email you to confirm how to meet any conditions of your offer. \r\n\r\nIf you're unsuccessful at any stage, the decision will be communicated through UCAS. We do try to indicate a reason in UCAS as to why we haven't been able to offer you a place. \r\n\r\nIf you have any queries relating to your application, please contact the Course Enquiries Team at London Met, even if you applied to a specific school for a course accredited by London Met. ","howSchoolPlacementsWork":"Placements for all teacher training routes offered or accredited by London Met are arranged by the University. We have a very broad range of partner schools located across the whole of London, though most are in North London.\r\n\r\nTrainees undertake two placements (SEA and SEB) in two different schools, adding up to a legal minimum of 120 days in school. Once you've met the conditions of your offer, we will send you a placement form to complete about where you're based, modes of transport you have access to and any other information, so that we can arrange placements that are appropriate for you. \r\n\r\nIf you've applied to a particular school, your placements may not necessarily be in that school but may be in partner schools attached to that school. ","personalQualities":"We are looking for dynamic, energetic, enthusiastic and caring trainees. As a teacher, you'll need to be passionate and enthusiastic about your work and your specialism. You'll need a desire to share this and make a real difference to young people's lives and futures. \r\n\r\nIdeally, you should: \r\n* be able to express why you want to teach\r\n* have visited a local school to observe and gain experience of how teaching and learning is organised\r\n* have participated in the School Experience Programme \r\n* be able to discuss current educational thinking and topics e.g. The Times Educational Supplement ","otherRequirements":"All candidates are required to pass literacy and numeracy skills tests. \r\nTrainees are subject to enhanced DBS checks and are required to make a declaration about any criminal convictions.\r\n\r\nPlease note, we will need to see originals of documents and qualification certificates etc. It is usually possible to order duplicates if you no longer have the originals.","status":1,"createdAt":"2021-07-06T10:51:15.363Z","updatedAt":"2021-07-21T11:04:24.664Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
