{"id":"d2c32c0b-6839-4ef6-a75e-c8b914a4b0ca","name":"Physics","code":"F3X1","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"bf97cd0a-224c-43d3-a021-84143df13e8d","code":"F3","name":"Physics"}],"locations":[{"id":"4edf0752-128b-4c1d-b6a1-77e3f6e14b25","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"30bda414-7b00-426c-956b-18a187efe967","code":"L68","name":"London Metropolitan University"},"profPost":"BO","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"A UK degree, preferably grade 2.2 or equivalent, in physics or related subjects including geology, metallurgy, chemical engineering and forensic science.\nIf you hold a third class degree, you may still be considered, particularly if this qualification is supported by a completed Master's degree or relevant work experience.","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Require GCSE English and Mathematics grade C/4 or above (or equivalent).\nIf you need to take an equivalency test for any of the required GCSEs, please sign up for A Star Equivalency or Equivalency Testing. They offer all three GCSE equivalencies. Please be aware that you may need to undertake study towards the exam, either with the equivalency organisation or independently.\nAlternatively, you might want to sign up for a college course in the relevant subject, though this is likely to take longer and you may not have the chance for a re-sit, if required, prior to the start of the PGCE course.","courseLength":"OneYear","feesUK":9250,"feesInternational":13250,"feeDetails":"There may be some extra costs for books and learning materials. \r\n\r\nGraduates of London Met can save up to 20% on their postgraduate studies with us. This discount is available to home, EU and international graduates of London Met.  \r\n\r\nFor further details see the [London Met website](https://www.londonmet.ac.uk/applying/funding-your-studies/postgraduate-uk-students).","financialSupport":"You may be eligible for financial support while you study. See the DfE website for further details of bursaries and scholarships available for this course.\r\n\r\nYou can also explore [funding options with the university](https://www.londonmet.ac.uk/applying/funding-your-studies/).","aboutCourse":"This Secondary Science with Physics course leads to Qualified Teacher Status (QTS) and to the academic PGCE qualification, which is worth up to 60 credits at master's level. \r\n\r\nBy choosing to train with London Metropolitan University, you'll be joining a powerful partnership of diverse teachers and schools. We place an emphasis on teaching in an urban and multicultural environment, which is ideal for teaching in a city setting. \r\n\r\nYou'll undertake two school placements of 10 and 14 weeks, giving you hands-on practical experience and skills to become a competent teacher of science for students in Key Stage 3 and physics in Key Stage 4. You may also have the opportunity to work with 16 to 18-year-olds.\r\n\r\nDuring university-based sessions on our Holloway campus, you’ll develop teaching strategies, pedagogical techniques and discover the fundamentals of how children learn. These sessions include collaborative projects and school-based projects with other trainee teachers, as well as learning the principles of teaching and pupil assessment.\r\n* Curriculum studies will introduce you to the issues of teaching within urban, multicultural and multilingual schools. You'll address the challenges of language, diversity and equality across the curriculum and learn how to teach with these in mind. You’ll also ensure that your subject knowledge is up-to-date and relevant, plus be able to explore some of the latest education research.\r\n* Professionalism and Inclusive Practice (PIP) develops your understanding of the broader contexts of teaching, including the range of responsibilities on teachers. You'll make links to the United Nations Convention on the Rights of the Child (UNCRC), giving you a framework for meeting the needs of all students. By also undertaking a research project, you can engage with a topic of your choice in greater depth.\r\n\r\nThroughout your school placements, our school-based mentors and university tutors will support you in the classroom. University tutors will also teach university sessions, ensuring the support is consistent. By working in both environments, you have the chance to reflect on the links between your own teaching practice and relate this to teaching theory. \r\n\r\nWith its high-quality teaching, this course is highly rated by Ofsted, who praised the 'inclusive, welcoming and open ethos and culture created by course leaders. Combined with the tailored and personalised support trainees receive, which enables them to successfully complete their training and confidently go on to gain employment.' (Ofsted 2016)\r\n\r\nFor more information please see [PGCE Secondary Science with Physics](http://ldnmet.ac/URak50Db9md).","interviewProcess":"All applications to London Met teacher training programmes, and those offered in conjunction by our Schools Direct partners, are checked and assessed at our Admissions Office based at our Holloway campus.\r\n\r\nDue to COVID-19, interviews and essential maths and English assessments are currently taking place online. Shortlisted applicants will be invited to an online interview and to complete online maths and English assessments. If you've applied to multiple routes of the same course offered by London Met (ie directly to London Met and also to one of our partner schools for the same subject) you'll only need to attend one interview. \r\n\r\nOnce you've completed your interview, we will normally confirm the decision through UCAS within one week. If you're offered a place at London Met, we will additionally email you to confirm how to meet any conditions of your offer. \r\n\r\nIf you're unsuccessful at any stage, the decision will be communicated through UCAS. We do try to indicate a reason in UCAS as to why we haven't been able to offer you a place. \r\n\r\nIf you have any queries relating to your application, please contact the Course Enquiries Team at London Met, even if you applied to a specific school for a course accredited by London Met. ","howSchoolPlacementsWork":"Placements for all teacher training routes offered or accredited by London Met are arranged by the University. We have a very broad range of partner schools located across the whole of London, though most are in North London.\r\n\r\nTrainees undertake two placements (SEA and SEB) in two different schools, adding up to a legal minimum of 120 days in school. Once you've met the conditions of your offer, we will send you a placement form to complete about where you're based, modes of transport you have access to and any other information, so that we can arrange placements that are appropriate for you. \r\n\r\nIf you've applied to a particular school, your placements may not necessarily be in that school but may be in partner schools attached to that school. ","personalQualities":"We are looking for dynamic, energetic, enthusiastic and caring trainees. As a teacher, you'll need to be passionate and enthusiastic about your work and your specialism. You'll need a desire to share this and make a real difference to young people's lives and futures. \r\n\r\nIdeally, you should: \r\n* be able to express why you want to teach\r\n* have visited a local school to observe and gain experience of how teaching and learning is organised\r\n* have participated in the School Experience Programme \r\n* be able to discuss current educational thinking and topics e.g. The Times Educational Supplement ","otherRequirements":"All candidates are required to pass literacy and numeracy skills tests. \r\nTrainees are subject to enhanced DBS checks and are required to make a declaration about any criminal convictions.\r\n\r\nPlease note, we will need to see originals of documents and qualification certificates etc. It is usually possible to order duplicates if you no longer have the originals.","status":1,"createdAt":"2021-07-06T10:51:15.496Z","updatedAt":"2021-07-21T11:09:01.852Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
