{"id":"d7766532-2b02-4633-9532-bc645aba4eca","name":"Health & Social Care","code":"2HNX","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"b1c3659e-5021-4f1e-a218-16b115f46fbc","code":"L5","name":"Health and social care"}],"locations":[{"id":"a7b786f6-8aea-4df0-b3cf-7e04ef595b73","name":"Cardinal Hume Catholic School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"31e5515a-d236-40a2-8baa-8dc145f19888","name":"Cramlington Learning Village","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"1f069b7d-ab6c-491c-8320-a99098ba6c2f","code":"198","name":"Cardinal Hume Catholic School"},"accreditedBody":{"id":"917facc1-82bb-4a00-a765-a1522edcb916","code":"2BA","name":"Sacred Heart Newcastle SCITT"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9000,"feeDetails":"Course fees differ depending upon the ITT Provider for your chosen subject. The costs range from £9,000 to £9,250 for a one year programme. \r\nYou may be eligible for Student finance to support you with fees. Further information will be discussed if you are successful at interview.\r\n","aboutCourse":"Professional Studies\r\nEvery aspect of the programme is aimed at developing you as a Professional. Schools are looking to employ the best teachers, those that are aware of the current demands of teaching as a profession.\r\nOur 'Education and Professional Studies' will address assessment and reporting, special education needs, classroom organisation and management, pupil behaviour, the professional responsibility of teachers, current school and curriculum issues.\r\n\r\nCurriculum Studies\r\nThis course aims to develop your skills in teaching all aspects of the relevant curriculum in order to become a successful teacher.\r\nCurriculum studies considers aspects of teaching including current educational theories such as multiple intelligence theory, multi-cultural schools and EAL, extracurricular activities, the hidden curriculum, pastoral care and the teaching of the most and least able pupils.\r\n\r\nIn the classroom\r\nThe programme aims to develop the skills of the classroom progressively. The training starts with observations progressing to taking greater and more responsibility as confidence develops. \r\nCentral training will take place one day a week and will be arranged by your ITT provider. You will be school based in your main placement four days per week.\r\n\r\nThe Assessment of Trainees\r\nFor the successful completion of the course, trainees must demonstrate competence against all the QTS standards, and need to have successfully completed the Professional Skills Tests before the course begins.\r\n\r\nTrainees are also expected to have completed four short written assignments, which apply the theory of teaching to practical experience in the classroom.\r\n\r\nTrainees will be continually assessed through lesson observations and placement reports whilst in their school.\r\n\r\nDetailed but functional files and portfolios of evidence are submitted for final assessment which will demonstrate how trainees have met the Standards for Qualified Teacher Status. Wherever possible, the evidence gained will be 'naturally occurring', as a product of the work carried out in the classroom or around the school setting.\r\n\r\n\r\n","interviewProcess":"The selection procedures which follow aim to ensure that:\r\n- Entry requirements specified in DfE Qualified Teacher Status Standards (2012) are applied carefully, giving due weight to academic equivalencies, experiences and motivation.\r\n- Entrants are given a sound understanding of the nature and demands of the course in order to assure successful applicants complete the course and enjoy their new profession in education.\r\n- Interviews and selection tasks are based on criteria which lead to sound judgments of the entrant's subject knowledge and general suitability for teaching.\r\n\r\n","howSchoolPlacementsWork":"The main and second school placement will be chosen in consultation with the School and programme director dependent on your subject, age range and location. Central training will take place one day a week at the ITT provider. Each trainee teacher will have their own experienced classroom practitioner within each school, who will be assigned as their individual mentor. A Professional Tutor responsible for school based pedagogical training will be based in all partnership schools. All of our partnership schools have excellent facilities, resources and ICT provision. Each school will be assigned a centrally based senior member of staff as their Partnership Link Tutor and they will visit the trainee in their school setting on a half termly basis.","personalQualities":"We are looking for enthusiastic applicants with very good communication skills, the determination to succeed, a commitment to working hard and the ability to work with others.\r\n\r\nSuccessful applicants are confident and passionate about teaching and also able to contribute to the wider school ethos and community.\r\n\r\nTraining to teach is both challenging and rewarding. Developing excellent interpersonal skills will enable trainees to effectively support the learning of groups of young people from diverse backgrounds.\r\n\r\nWe are looking for people who strive to improve and who are committed to their own professional development. ","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:47:56.082Z","updatedAt":"2021-09-30T14:29:43.479Z","canSponsorStudentVisa":"no","cycle":"2024"}
