{"id":"fdae01bb-686b-4598-86d4-d043ac44130d","name":"Biology","code":"3347","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"322cfc19-d51d-45db-91e3-bd7b4738470f","code":"C1","name":"Biology"}],"locations":[{"id":"1291d2b8-4213-4b48-a10a-e75431d9e0d4","name":"St Robert of Newminster Catholic School and Sixth Form College","isPublished":"Y","status":"R","vacancies":"F"},{"id":"a7b786f6-8aea-4df0-b3cf-7e04ef595b73","name":"Cardinal Hume Catholic School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"31e5515a-d236-40a2-8baa-8dc145f19888","name":"Cramlington Learning Village","isPublished":"Y","status":"R","vacancies":"F"},{"id":"bd0ee1d6-f0b8-4c37-8034-30e210705b53","name":"Kingsmeadow Community Comprehensive School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"75693fca-0005-43f6-83a3-3313d8b63d59","name":"St Leonard'sCatholic School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"1f069b7d-ab6c-491c-8320-a99098ba6c2f","code":"198","name":"Cardinal Hume Catholic School"},"accreditedBody":{"id":"917facc1-82bb-4a00-a765-a1522edcb916","code":"2BA","name":"Sacred Heart Newcastle SCITT"},"profPost":"PG","degreeGrade":"1","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9000,"feeDetails":"Course fees differ depending upon the ITT Provider for your chosen subject. The costs range from £9,000 to £9,250 for a one year programme. \r\nYou may be eligible for Student finance to support you with fees. Further information will be discussed if you are successful at interview.\r\n","aboutCourse":"The School Direct course aims to develop your skills in teaching all aspects of the relevant curriculum in order to become a successful teacher.\r\nCurriculum studies considers aspects of teaching including current educational theories such as multiple intelligence theory, multi-cultural schools and EAL, extracurricular activities, the hidden curriculum, pastoral care and the teaching of the most and least able pupils.\r\n\r\nThe programme aims to develop the skills of the classroom progressively. The training starts with observations progressing to taking greater and more responsibility as confidence develops. In the classroom, initial observations and interpretation progresses to co-planning, teaching and evaluating parts of lessons.  With this experience you develop your lesson planning, teaching and evaluation at key stages and continue to participate in classroom teaching in your preferred age range and specialist subject, with expert practitioners. Towards the end of the academic year, you will be expected to be involved with up to 80% of a NQT timetabled week.\r\n\r\nThe main and second school placement will be chosen in consultation with the school and programme director dependent on your subject, age range and location. Each trainee will have their own experienced classroom practitioner within both schools, who will be assigned as their individual mentor. Central training will take place for secondary trainees one day a week at the ITT provider. \r\n\r\nFor the successful completion of the course, trainees must demonstrate competence against all the QTS standards, and are required to have acceptable numeracy and literacy skills, as set by the ITT Provider. Trainees will be continually assessed through lesson observations and placement reports whilst in their school.\r\n\r\nDetailed but functional files and portfolios of evidence are submitted for final assessment which will demonstrate how trainees have met the Standards for Qualified Teacher Status. Wherever possible, the evidence gained will be 'naturally occurring', as a product of the work carried out in the classroom or around the school setting.\r\n","interviewProcess":"The selection procedures which follow aim to ensure that:\r\n- Entry requirements specified in DfE Qualified Teacher Status Standards (2012) are applied carefully, giving due weight to academic equivalencies, experiences and motivation.\r\n- Entrants are given a sound understanding of the nature and demands of the course in order to assure successful applicants complete the course and enjoy their new profession in education.\r\n- Interviews and selection tasks are based on criteria which lead to sound judgments of the entrant's subject knowledge and general suitability for teaching.\r\n","howSchoolPlacementsWork":"Candidates complete assessment in two secondary/primary schools, fulfilling statutory requirements. Second school placements are selected according to candidates emerging targets and the need for a change of context - teaching in two consecutive key stages is statutory (typically KS3/4).","personalQualities":"We are looking for enthusiastic applicants with very good communication skills, the determination to succeed, a commitment to working hard and the ability to work with others.\r\n\r\nSuccessful applicants are confident and passionate about teaching and also able to contribute to the wider school ethos and community.\r\n\r\nTraining to teach is both challenging and rewarding. Developing excellent interpersonal skills will enable trainees to effectively support the learning of groups of young people from diverse backgrounds.\r\n\r\nWe are looking for people who strive to improve and who are committed to their own professional development.  \r\n","otherRequirements":"Successful entrants will be asked to bring appropriate certification and other documentation to verify their identity and for the Disclosure and Barring Service check prior to the start of the course.\r\n\r\nThe document check is made by the Administrator and provides an audit for registration purposes at the commencement of the course. All documents must be 'original' and not a photocopy.\r\n","status":1,"createdAt":"2021-07-06T10:47:56.685Z","updatedAt":"2021-09-30T14:21:34.096Z","canSponsorStudentVisa":"no","cycle":"2024"}
