{"id":"54091241-a92c-4cad-8f9a-6329ef747b69","name":"Religious Education","code":"35HJ","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"724b5d16-28dd-4431-bc17-ea4be4daedc4","code":"V6","name":"Religious education"}],"locations":[{"id":"7209fca8-58ed-45e2-8ad8-d771dae8d735","name":"King James's School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"83ea9389-1e92-4a90-bf1b-93c43bee334e","code":"196","name":"White Rose Alliance"},"accreditedBody":{"id":"19a3446e-382d-4c14-83bb-a76563cef3c1","code":"L24","name":"Leeds Trinity University"},"profPost":"BO","degreeGrade":"1","english":"1","maths":"2","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"This WRA School Direct course leads to a PGCE qualification and Qualified Teacher Status (QTS). The secondary course age range is 11-16 with 16-18 enhancement. \r\n\r\nThe course structure enables trainees to begin their development in school from the start of the course and build their confidence and teaching knowledge through their two school placements. \r\n\r\nTrainees will spend most of the training year based in their placement schools developing their teaching skills at their own pace, underpinned by weekly WRA Professional Studies (PS) sessions held at King James's School , and weekly academic/subject pedagogy training sessions held at Leeds Trinity University providing specialist support for the PGCE qualification.  Trainees are also able to access and benefit from the full range of university services e.g. writing and academic support, wellbeing services, library and IT, careers, etc.\r\n\r\nThe weekly WRA PS programme covers the core areas of the Initial Teacher Training (ITT) Core Content Framework (CCF) to equip trainees with the essential skills and knowledge they need to develop as professional educators.  Feedback from a former trainee : \"Can't rate these sessions highly enough in terms of how they have helped my progression through the year\".\r\n\r\nTrainee progress is monitored closely throughout the course and assessment made by mentors regarding their achievement of QTS status at the end of the course. Trainees will be required to complete 2 Masters level assignments for their PGCE qualification.\r\n\r\nWRA trainees have access to a comprehensive support structure covering every aspect of their training through staff in their placement schools (subject mentor, department/pastoral staff, ITT coordinator), their university (link tutor, coordinator, subject peers) and the White Rose Alliance (lead teacher, senior mentor, administrator and cohort peers). Feedback from a former trainee:\" Support from all aspects of the course has been excellent and has allowed me to really grow in confidence and competence throughout the year\". \r\n\r\nWhilst the intention is for university and White Rose Alliance sessions to be delivered in person, where this is not possible due to Covid-19 restrictions or exceptional circumstances, alternative arrangements will be made to run university & White Rose Alliance sessions virtually. \r\n","interviewProcess":"WRA interviews take place remotely. Candidates will generally be given one week's notice of interview whenever possible & dates/times are flexible. \r\n\r\nCandidates invited to interview will be required:\r\n* to complete an initial subject audit form ahead of the interview\r\n* to undertake a subject test (45 minutes) via email (before the interview if possible)\r\n* to prepare a lesson plan & resources for an imaginary 15 minute teaching/learning activity (to discuss during the formal interview)\r\n* have a formal interview (45 minutes) via Zoom. The panel for the formal interview will comprise 2 members of a combination of White Rose Alliance staff, partner school staff or university staff. \r\n\r\nThe initial subject audit form and subject test will be reviewed by a subject specialist who will provide advice to the interview panel.\r\n\r\nCandidates will be advised of the interview outcome as soon as possible after their formal interview, once all information from the interview activities has been collated. ","howSchoolPlacementsWork":"For the majority of the course, trainees are school-based. Trainees will be in their placement school unless attending sessions at their link university (in general terms one day per week), weekly Professional Studies sessions at King James's School on Wednesday mornings or School Experience Days at WRA partner schools.\r\n\r\nWRA partner schools are:\r\n\r\n* King James's School, Knaresborough\r\n* Bradford Grammar School\r\n* Stokesley School\r\n* The Grammar School at Leeds\r\n* Thirsk School and Sixth Form College\r\n* Ripon Grammar School\r\n* Sherburn High School\r\n* Boroughbridge High School\r\n* Ryedale School\r\n* Richmond School & Sixth Form College\r\n\r\nTrainees undertake 2 school placements: Placement 1 from September to Christmas and Placement 2 from January to June.\r\n\r\nSchool placements provide structured opportunities for trainees to observe experienced teachers and other professionals, and receive support as they progressively build confidence and skills towards independent teaching. During school placements trainees will be expected to cover the 11-16 age range plus obtain experience of some 11-18 teaching during their course. In school you will be given the opportunity to participate in all aspects of school life and the wider school context eg. attending school meetings, extra-curricular activities, school training days and other professional development activities, that will support you in developing your knowledge and understanding of the whole school environment. You will be supported during your school placements by a subject mentor and other school staff who are committed to your education and training.   \r\n\r\nWhen allocating school placements, we consider a number of factors including trainee home location and accessibility to transport (ie. ability to drive, access to own vehicle or reliant on public transport).  Not all WRA partner schools are able to provide placements for all subjects & therefore on occasions, it may be necessary for trainees to undertake placements in non-WRA schools. Trainees should expect, and be prepared for, some reasonable daily travel at their own cost. We will however, endeavour to  provide the most appropriate placements we can.   \r\n\r\nShould there be any impact on school placements as a result of Covid-19, virtual or alternative educational experiences will be arranged.","personalQualities":"\r\n* Strong subject knowledge & willingness to develop it\r\n* Enthusiasm for subject and a desire to share this\r\n* Passion for both learning and teaching\r\n* Genuine interest in young people and their development\r\n* Strong and committed work ethic\r\n* Ability to build good working relationships with others\r\n* Excellent organisation and time management skills\r\n* Confidence in communicating with young people and adults of all levels\r\n* Resilience to cope under pressure\r\n* Creativity\r\n* Self-motivation\r\n* Resourcefulness and adaptability\r\n* Openness to constructive criticism\r\n* Reflective approach\r\n* Sense of humour\r\n* Patience\r\n ","otherRequirements":"Standard university conditions will apply to all offers made at interview. These include proof of qualifications (candidates will be required to produce degree certificate & GCSE Maths & English certificates for verification), obtain Enhanced DBS clearance & complete a medical check.","status":1,"createdAt":"2021-07-06T10:49:55.889Z","updatedAt":"2021-09-14T08:48:27.248Z","canSponsorStudentVisa":"yes","cycle":"2024"}
