{"id":"2090f264-fd2d-42c0-ad24-d245918fee94","name":"Primary","code":"2QQ2","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"287f2122-a89d-418b-a6ef-8666bacf39d6","name":"St John's Catholic Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"f3f76e1e-be02-4598-af09-ccb53f8cb482","name":"St Fidelis Catholic Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"618ca212-3519-4098-8614-fbd66d46758f","name":"St Thomas More Catholic Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"7a428b17-c3e9-428b-ac9e-cb7f4a38e819","name":"St James the Great Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"e8eae8bc-676b-48b5-800a-459ec7ae808f","name":"St Stephen's Catholic Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"84d12959-454e-4882-b4b6-ef0820e59626","name":"St George's Cathedral Catholic Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"696b759b-f7cf-4eb9-a67d-67784e300b15","name":"St Joseph's Primary (George Row)","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"5fc43d72-6d2c-424f-adaa-dc58efa5de03","code":"134","name":"Catholic Schools’ Partnership"},"accreditedBody":{"id":"ef172d85-20e4-4aa2-96d0-9e3ae81f526d","code":"S64","name":"St Mary’s University, Twickenham"},"profPost":"BO","degreeGrade":"1","english":"1","maths":"1","science":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"GCSE equivalencies are required regardless of any higher qualification in a related subject.\n\nAn individual with an A Level or Undergraduate degree in Mathematics, English or Science also requires the appropriate GCSEs to undertake a teacher training programme.\n\nThe Institute of Education offers GCSE equivalency tests in Eng¬lish, Mathematics and Science. A pass in one of these equivalency tests is considered to be of the same standard as a GCSE C grade or Level 4 in the revised GCSE structure.\n\nExams will be sat under exam conditions. Examiners decisions are final and no appeals will be considered.\n* English: 1 hour 45 minutes\n* Maths: 1 hour 15 minutes\n* Science - Combined science: 1 hour 30 minutes\n\nIf you are applying to study at St Mary's the cost of our GCSE equivalency test for is £85. This is payable when you book your test. A second payment is required if you need to re-sit the test.\nYour result will be emailed to you within three weeks of taking your test.\n\nYou are allowed one resit for a failed test. Should you fail both tests you will be required to undertake a full GCSE qualification.\nFind out more [here](https://www.stmarys.ac.uk/teacher-training/prepare/gcse/equivalency-tests.aspx)","courseLength":"OneYear","feesUK":9250,"feesInternational":12730,"aboutCourse":"Why should I join the CSP? \r\n\r\nWe believe that the single most significant factor of a child’s success in school is the quality of their teachers. The Catholic Schools’ Partnership is, therefore, dedicated to developing staff with high expectations and a clear understanding of how to create a learning environment in which their students can flourish. Our focus is on developing teaching and learning through innovative ideas, creativity and intelligent collaboration. Our strong and supportive network is based on the shared values of our schools and colleges.\r\n\r\nWe at the CSP are passionate about developing a generation of outstanding teachers and want to provide as much support as we can to ensure committed, enthusiastic and capable people make it on to our teacher training scheme. We offer excellent teacher training in partnership with St Mary’s University, with all courses resulting in a PGCE qualification.\r\n\r\nWe run an extensive CPD programme including two Early Career Conferences in the autumn and summer terms and School Study Visits in the spring term, providing networking opportunities and the chance to observe teaching in other schools within the partnership, in line with both your university studies and personal areas of development. Opportunities for school-based research and reflection, along with the sharing of outstanding expertise within a business-like model form the heart of our work.\r\n\r\nAn induction programme will be provided in school to supplement your university provision. The weekly sessions will cover a range of topics relevant to your training, including safeguarding; lesson planning, marking, and pastoral aspects such as the role of a form tutor. You will be fully involved in the life of the school attending parents’ evenings and participating in school trips.\r\n\r\nAbout the University Course\r\n\r\nThe Primary PGCE programme provides an intense training experience that combines academic rigour with personal and professional learning experiences. The training is designed to meet the needs of each trainee to support and develop the skills, knowledge and attributes needed to start a teaching career.\r\n\r\nThe PGCE is a 60-credit, Masters-level course and students must pass the two M-level modules and demonstrate that they have met the Teachers’ Standards.\r\n\r\n[School Direct Primary at St Mary's University](https://www.stmarys.ac.uk/postgraduate-courses-london/pgce-primary) \r\n\r\nYou will attend university training days at St Mary's University alongside students recruited via other routes and other School Direct partnerships. On the Tuition Fee routes you will carry out academic assignments leading to the award of masters level credits.\r\n","interviewProcess":"At the CSP we are looking for candidates who can support our shared vision: Growing Teachers, Growing Learners, Growing Schools.  \r\n\r\nWhen applying please select your preferred school.  All applications are vetted upon receipt. Once your application has passed this process you will be invited to attend an interview.\r\n\r\nYou will be interviewed at the university in the first instance. The day will consist of a formal interview and a number of tasks.  Further details of the requirements will be provided if you are invited to interview. \r\n\r\nSuccessful applicants are invited to tour their chosen school. You will have the opportunity to spend some time observing classes, meeting with members of the department and getting to know the school. For some subjects a short interview will be conducted at the school. \r\n\r\nYou will also have the opportunity to ask any questions about the Catholic School's Partnership, School and the School Direct Programme at one of the interview dates and where possible the CSP Co-ordinator will attend the university interview day.\r\n\r\nAfter interview, the University and the Lead School will jointly reach a final decision regarding any offer.\r\n \r\nCandidates usually apply to schools that are located close to where they live and we are happy to arrange tours and an observation day in your preferred school prior to application. ","howSchoolPlacementsWork":"School Direct trainees with St Mary's University attend university for a number of weeks before starting in their chosen school. Term dates will be confirmed upon acceptance of an offer.  You will spend 120 days in school over the course of the year and you will be trained to teach the 5-11 age range.\r\n\r\nAs with all PGCE courses you will be expected to attend all university sessions. The taught elements of the programme include Professional Studies sessions, Building a Broad Curriculum, From Values to Vocation, as well as subject-specific sessions. The subject sessions will cover Mathematics, English, Science, Religious Education and Physical Education.\r\n\r\nPlacements are in Catholic schools and you will work with a mentor in each setting. \r\n\r\nAround half of the schools within the Catholic Schools’ Partnership offer training placements. Those who are able to support the main placement are listed for each course.\r\n\r\nAt the start of the training year we will contact all registered trainees to confirm where you are living and to ask about the type of school that you would like to be placed in for your second placement. Where possible, we will try to accommodate your request and placements are arranged with a maximum commuting distance of 1 hour 15 minutes based upon the address provided. Travel time is usually significantly less than this.\r\n\r\nYour tutor from the St Mary's University will visit you in school on a regular basis and liaise with your school mentor regarding your training and development. \r\n\r\nThe Primary PGCE programme provides an intense training experience that combines academic rigour with personal and professional learning experiences. \r\n\r\nYou will also complete an enrichment experience - a four-week placement of your choice. This could be a SEND, secondary or early years setting. This is a self-assessed placement and is measured against the targets set by you and your Academic Tutor from your first school experience.\r\n\r\nFor all Primary programmes, two of the three GCSEs required for primary teacher training must be held at the point of application. Only one equivalence test will be accepted. Applicants must hold two full GCSE qualifications.\r\n\r\n","personalQualities":"We are looking for individuals who have the capacity to develop into outstanding teachers. This requires a combination of personal and academic skills. \r\n\r\nDuring the interview and selection process, you will take part in  an ONLINE interview and discussion  that will allow you to evidence that you have thought carefully about your motives for becoming a teacher and can demonstrate that you have some emerging capability to reflect on what being a teacher means. The interview will be recorded in line with GDPR compliance.\r\n \r\n","otherRequirements":"Reference\r\nCandidates who have been working for a number of years should provide a reference from their current or most recent employer alongside an academic reference where this can be obtained.  Two employer references will be accepted.\r\n\r\nSt Mary's recommend that you aim to gain some experience in a classroom prior to interview. However, we understand that this isn't always possible, as such, applicants who have experience of working with children and young people, at sports clubs, youth groups and voluntary work are asked to make reference to these activities in their application. \r\n","status":1,"createdAt":"2021-07-06T10:55:43.164Z","updatedAt":"2021-09-28T14:05:53.306Z","canSponsorStudentVisa":"yes","cycle":"2024"}
