{"id":"278ec767-4393-4145-a627-0c636764a7a8","name":"Primary","code":"2YCX","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"287f2122-a89d-418b-a6ef-8666bacf39d6","name":"St John's Catholic Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"7a428b17-c3e9-428b-ac9e-cb7f4a38e819","name":"St James the Great Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"696b759b-f7cf-4eb9-a67d-67784e300b15","name":"St Joseph's Primary (George Row)","isPublished":"Y","status":"R","vacancies":"F"},{"id":"f3f76e1e-be02-4598-af09-ccb53f8cb482","name":"St Fidelis Catholic Primary School","isPublished":"N","status":"S","vacancies":"F"},{"id":"e8eae8bc-676b-48b5-800a-459ec7ae808f","name":"St Stephen's Catholic Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"954685fc-f3fa-4119-9a9d-d748e48b3892","name":"St John Fisher Catholic Primary School","isPublished":"N","status":"S","vacancies":"F"}],"trainingProvider":{"id":"5fc43d72-6d2c-424f-adaa-dc58efa5de03","code":"134","name":"Catholic Schools’ Partnership"},"accreditedBody":{"id":"7f11aaed-7c3e-42c5-af7a-023d33b45fa3","code":"U80","name":"UCL, University College London"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"UCL does accept the following in place of GCSEs:-\n*\tiGCSE in English Language or Maths or Science \n\nUCL does not accept the following in place of GCSEs:-\n*\tiGCSE for ‘English as a second language’\n*\tiGCSE or GCSE “applied” or “additional” subjects\n*\tFunctional Skills\n*\tBTECs\n*\tAccess courses \n\nThe equivalence of all overseas degrees is verified by UCL according to their requirements. This is in addition to any assessment of equivalence by NARIC.\n\nApplicants who do not hold the relevant GCSEs will need to demonstrate an equivalent standard by completing tests with either of the following testing organisations:- \n* [Equivalency Testing](http://www.equivalencytesting.com) \n* [Astra Equivalency](https://astarequivalency.co.uk)\n\nUCL requires **at least grade 5** and does not accept equivalency tests from any other testing organisations.\n\n[General Entry Requirements](https://www.ucl.ac.uk/prospective-students/graduate/teacher-training/entry-requirements)","courseLength":"OneYear","feesUK":9250,"feesInternational":22200,"aboutCourse":"Why should I join the CSP?\r\n\r\nWe believe that the single most significant factor of a child’s success in school is the quality of their teachers. The Catholic Schools’ Partnership is, therefore, dedicated to developing staff with high expectations and a clear understanding of how to create a learning environment in which their students can flourish. Our focus is on developing teaching and learning through innovative ideas, creativity and intelligent collaboration. Our strong and supportive network is based on the shared values of our schools and colleges.\r\n\r\nThe CSP is passionate about developing a generation of outstanding teachers and want to provide as much support as we can to ensure committed, enthusiastic and capable people make it on to our teacher training scheme. We offer excellent teacher training in partnership with UCL, with all courses resulting in a PGCE qualification. \r\n\r\nWe run an extensive CPD programme including two Early Career Conferences in the autumn and summer terms and School Study Visits in the spring term, providing networking opportunities and the chance to observe teaching in other schools within the Catholic Schools' Partnership, in line with both your university studies and personal areas of development. Opportunities for school-based research and reflection, along with the sharing of outstanding expertise within a business-like model form the heart of our work.\r\n\r\nAn induction programme will be provided in school to supplement your university provision. The weekly sessions will cover a range of topics relevant to your training, including safeguarding; lesson planning, marking, and pastoral aspects such as the role of a form tutor. You will be fully involved in the life of the school attending parents' evenings and participating in school trips.\r\n\r\nAbout the University Course\r\n\r\nUCL Institute of Education (IOE) is a global leader in teacher education.  Their programmes are recognised by Ofsted as “outstanding” in every criterion across Primary and Secondary Education.\r\n\r\nThe PGCE is a 60-credit, Masters-level course and students must pass the two M-level modules and demonstrate that they have met the Teachers’ Standards.\r\n\r\n[School Direct at UCL](https://www.ucl.ac.uk/ioe/courses/teacher-training/get-teaching-ioe-school-direct-partner-school) \r\n\r\nYou will attend university training days at UCL Institute of Education alongside students recruited via other routes and other School Direct partnerships. On the Tuition Fee routes you will carry out academic assignments leading to the award of masters level credits.\r\n\r\n[Primary School Direct](https://www.ucl.ac.uk/ioe/courses/teacher-training/primary-pgce)\r\n\r\nAll UCL School Direct students have full access to UCL student support services and facilities.","interviewProcess":"At the CSP we are looking for candidates who can support our shared vision: Growing Teachers, Growing Learners, Growing Schools. \r\n\r\nWhen applying please select your preferred school.  All applications are vetted upon receipt. Once your application has passed this process you will be invited to an interview at the location to which you have applied.\r\n\r\nThe interview day will include a tour of the school and a panel interview. Some time will also be spent in a class with the Head of Department where a school can arrange this. If you are successful at this point a recommendation will be made to UCL.\r\n\r\nIf you are successful at the school interview you will be invited to a second-stage interview at UCL Institute of Education. At your interview day you will take part in a combination of group and individual interviews with members of the programme team, and may also be asked to undertake written or presentation tasks, depending on your subject. You will have the opportunity to ask questions and take a self-guided campus tour.\r\n\r\nCandidates usually apply to schools that are located close to where they live and we are happy to arrange tours and an observation day in your preferred school prior to application. \r\n\r\nSchool Direct Tuition Fee students join the Primary PGCE course at the Institute, alongside trainees on the core PGCE, and have access to the full PGCE programme.\r\n","howSchoolPlacementsWork":"School Direct trainees usually start at their chosen school during the first week of the autumn term before registering at university the following week. Term dates will be confirmed upon acceptance of an offer. \r\n\r\nAs with all PGCE courses you will be expected to attend all university sessions.  The course runs from September to June. The taught elements of the programme include a Professional Studies component, Curriculum subject sessions and two masters modules (Specialism and Learning & Teaching). The Curriculum sessions will cover Mathematics, English, Science, Computing and Foundation Subjects.\r\n\r\nUCL offer a SE1, 2 and 3 placement structure for primary. The academic year will be split  between two contrasting schools and Key Stages (SE1 and SE3) with a two-week placement in an alternative setting in the middle (SE2). Placements are in Catholic schools and you will work with a mentor in each setting. \r\n\r\nAround half of the schools within the Catholic Schools’ Partnership offer training placements. Those who are able to support the main/first placement are listed for each course. \r\n\r\nAt the start of the training year we will contact all registered trainees to confirm where you are living and to ask about the type of school that you would like to be placed in for your second placement. Where possible, we will try to accommodate your request and placements are arranged with a maximum commuting distance of 1 hour 15 minutes based upon the address provided. Travel time is usually significantly less than this.\r\n\r\nYour tutor from the Institute of Education will visit you in school on a regular basis and liaise with your school mentor regarding your training and development. Your Institute tutor will carry out your final assessment in school against the national Teachers’ Standards.\r\n","personalQualities":"We are looking for individuals who have the capacity to develop into outstanding teachers. This requires a combination of personal and academic skills. \r\n\r\nYou should demonstrate awareness of what good teaching entails and show a desire to teach. \r\n\r\nThere are three main attributes required for teaching: \r\n1) Subject Knowledge - you need to show that you have a specialist understanding. \r\n2) An ability to communicate with an audience. Your class will be your audience and the relationship and command of this group is crucial. \r\n3) Good Interpersonal Skills - you need to demonstrate that you can work well with others. \r\n\r\n\r\n \r\n","otherRequirements":"Reference\r\nCandidates completing their degree, or who have recently left university, should provide an academic reference from a tutor at their university. Candidates who have been working for a number of years should provide a reference from their current or most recent employer. \r\n\r\nUCL recommend that you aim to gain some experience in a classroom prior to interview. However, we understand that this isn't always possible, as such, some applicants who have experience of working with children and young people, at sports clubs, youth groups and voluntary work are asked to make reference to these activities in their application. \r\n","status":1,"createdAt":"2021-07-06T10:55:43.861Z","updatedAt":"2021-10-01T15:35:31.280Z","canSponsorStudentVisa":"yes","cycle":"2024"}
