{"id":"32de77c1-4021-4d52-97c8-086dcfdacd1d","name":"Religious Education","code":"2HFW","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"724b5d16-28dd-4431-bc17-ea4be4daedc4","code":"V6","name":"Religious education"}],"locations":[{"id":"c7d2bc62-393f-4fbf-b5bf-fe647e7ca417","name":"St Michael's Catholic College","isPublished":"Y","status":"R","vacancies":"F"},{"id":"b971db8a-3ba0-4487-8629-12453595acb9","name":"Bonus Pastor Catholic College","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"5fc43d72-6d2c-424f-adaa-dc58efa5de03","code":"134","name":"Catholic Schools’ Partnership"},"accreditedBody":{"id":"36425fae-da68-4e79-89de-8b41ea733c37","code":"K60","name":"King’s College London (University of London)"},"profPost":"BO","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"Academic requirements:\n\n* either a degree in theology or religious studies; or\n\n* a joint degree in theology or religious studies and one other subject; or\n\n* a 2.2 or above in a subject where theology or religious studies constituted roughly 40 per cent of the content of your degree, particularly philosophy; or\n\n* a higher degree containing a range of theological or religious studies components such as a master's or a PhD.","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"[A Star Equivalency](https://astarequivalency.co.uk/), or [Birmingham City University](https://www.bcu.ac.uk/education-and-social-work/initial-teacher-training/gcse-equivalency-test/gcse-equivalency-tests-non-bcu-applicants). Please note that the Birmingham City equivalency tests are currently being offered online.","courseLength":"OneYear","feesUK":9250,"feesInternational":19800,"feeDetails":"Tuition fees:\r\nTuition fee loans are available for those who meet the Government’s criteria for this scheme. Further information is available at [GOV.UK](https://www.gov.uk/student-finance/new-fulltime-students)\r\n\r\nGovernment Training Bursaries:\r\nPlease note training bursaries are only available to students who have been classified as Home/EU for fee purposes.\r\n","aboutCourse":"Located in the heart of London, PGCE courses at King’s are rated Outstanding by Ofsted with excellent tutors on hand to support you through your training. In the last research assessment exercise, the department was rated second in the UK (REF, 2014). You will have the opportunity to work with experienced tutors who are actively engaged in research in their subject and in pedagogy more widely. 94% of 2018 graduates who sought teaching posts were employed within 6 months of qualifying. In our 2020 student survey, 98% of trainees rated their training as good, very good or excellent.\r\n\r\nThe PGCE RE course offers opportunities to investigate the different religious and non-religious worldviews that are taught in schools, but we still assume that you will come onto the course with significant subject knowledge. This is why we require degree level evidence of such knowledge.\r\n\r\nThe course is designed to train you to become a skilful and reflective classroom practitioner. To this end we focus equipping you to meet the professional standards required to attain Qualified Teacher Status and these provide the framework for the course. There are two strands to our course: one focuses on RE subject-specific work, the other encompasses an exploration of generic issues related to professional practice and educational policy.\r\n\r\nThe RE strand is met through subject-specific sessions, in which we explore, debate, and clarify the aims in religious education. We focus on how to translate these aims into effective classroom practice, exploring practically how to devise lesson plans, how to choose or create engaging and appropriate resources, and how to ensure that our planning is shaped by an accurate and responsive understanding of the nature and needs of our pupils. In this way we seek to enable our pupils to become religiously literate.\r\n\r\nThe other strand is met through our 'Policy and Professional Practice' programme, through which we explore and debate the aims, purposes and provision of education in the UK today. This programme is formed of a weekly lecture, followed by seminars in cross-curricular groups, in which you are encouraged to discuss and reflect upon these issues, in light of insights gained from your school placements.\r\n\r\n[Course information](https://www.kcl.ac.uk/study/postgraduate/taught-courses/pgce-religious-education.aspx)\r\n","interviewProcess":"Please note that at the point of application you can choose the school that you apply to. \r\n\r\nThe selection process normally involves an interview, a short presentation by the candidate, a discussion and a short piece of writing.\r\n\r\nWe select our trainees when we have evidence of the following qualities:\r\n\r\n* a conceptual understanding of the content of religious education or philosophical thinking\r\n* an ability to think and reason clearly\r\n* an ability to interact effectively with pupils\r\n* an ability to interact with colleagues\r\n* an ability to present ideas clearly and at an appropriate level\r\n* an ability to recognise own shortcomings\r\n* a strong desire to continue to learn\r\n* flexibility of mind and the potential necessary to improve\r\n* successful experience with children or clear potential for this\r\n* clarity and accuracy of written and spoken English\r\n* a successful study record\r\n* perseverance and stamina\r\n* a passion for Religious Education\r\n","howSchoolPlacementsWork":"With the CSP you can choose the school that you apply to.\r\n\r\nAll School Direct trainees start at their chosen school during the first week of the autumn term before attending university sessions the following week. School term dates will be confirmed once you have accepted an offer.\r\n\r\nAround half of the schools within the Catholic Schools’ Partnership offer training placements. Those who are able to support the main placement are listed for each respective course.\r\n\r\nCandidates tend to apply to schools that are located close to where they live and we are happy to arrange tours and an observation day in your preferred school prior to application. \r\n\r\nAt the point of application please select your first choice of school.  Once your application has passed our vetting process you will be invited to interview at KCL and if successful at this stage this will be followed by an interview at the school.\r\n\r\nWe offer an ABA placement route with King's College London. This involves one long placement with a 6-week placement at another school within the CSP in the spring term before you return to your original school for the remainder of the course. \r\n\r\nAt the start of the academic year we will contact all registered trainees to confirm the area where you are living and to ask about the type of school that you would like to be placed in for your second placement. Where possible, we will try to accommodate your request and placements are arranged with a maximum commuting distance of 1 hour 15 minutes based upon the address provided. Travel time is usually significantly less than this.\r\n\r\nWe are able to offer contrasting placements in single-sex or mixed schools and in schools with sixth forms where your main placement school is 11-16.  Where you have completed a placement in a single-sex school your second placement will be in a mixed school or a school with students of the opposite sex.\r\n\r\nShould you have any questions relating to the placement structure, please do not hesitate to email c.barclay@catholicschoolspartnership.org.uk for more information.","personalQualities":"* an ability to think and reason clearly\r\n * an ability to interact effectively with pupils\r\n * an ability to interact with colleagues\r\n* an ability to present ideas clearly and at an appropriate level\r\n* an ability to recognise own shortcomings\r\n* a strong desire to continue to learn\r\n* flexibility of mind and the potential necessary to improve\r\n* successful experience with children or clear potential for this\r\n* clarity and accuracy of written and spoken English\r\n* evidence of conceptual understanding\r\n* a successful study record\r\n* perseverance and stamina\r\n* a passion for Religious Education\r\n\r\n\r\n\r\n\r\n","otherRequirements":"You should provide:\r\n* a reference which identifies your academic strengths and personal qualities required for teaching\r\n* a reference with no reservations about suitability e.g. relating to academic achievement, effort, health, commitment, consistency, group working skills, communication skills\r\n\r\nThe DfE requires the Disclosure and Barring Service vet the background of persons working in their schools. Candidates offered a place on a PGCE course will be asked to complete an enhanced check with the DBS to ensure they do not have a criminal background which might prevent them from working as a teacher. ","status":1,"createdAt":"2021-07-06T10:55:42.874Z","updatedAt":"2021-09-17T13:33:25.362Z","canSponsorStudentVisa":"no","cycle":"2024"}
