{"id":"354119e6-73dd-4063-93df-c11e621fe8c3","name":"Design and Technology","code":"2HD7","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"118fabd7-86d0-4a40-9e9a-e5c302abe59b","code":"DT","name":"Design and technology"}],"locations":[{"id":"c7d2bc62-393f-4fbf-b5bf-fe647e7ca417","name":"St Michael's Catholic College","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"5fc43d72-6d2c-424f-adaa-dc58efa5de03","code":"134","name":"Catholic Schools’ Partnership"},"accreditedBody":{"id":"049fe65f-08dc-4686-9ac8-606dce490128","code":"G56","name":"Goldsmiths, University of London"},"profPost":"PG","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"Please note that the main placement for this subject is:\n\nSt Michael’s Catholic College\nLlewellyn Street, Bermondsey, London, SE16 4UN\n\n\n\nAn undergraduate honours degree, at 2:2 or above from a university in the United Kingdom or an international equivalent in a subject related to Design and Technology, such as theatre design, product design, graphics, silversmithing, or architecture","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Please note, we can only accept some UK and international GCSE equivalent qualifications. If you have a non-UK qualification that you believe is GCSE equivalent, you must check this with the Admissions team.\n\nEquivalency tests are only accepted from A Star Teachers or Equivalency Testing with grades A*-C or 4-9.\n\nPlease see [here](https://www.gold.ac.uk/pgce/apply/entry-requirements/gcse-accepted-equivalencies/) for more information.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Why should I join the CSP?\r\nWe believe that the single most significant factor of a child’s success in school is the quality of their teachers. The Catholic Schools’ Partnership is, therefore, dedicated to developing staff with high expectations and a clear understanding of how to create a learning environment in which their students can flourish. Our focus is on developing teaching and learning through innovative ideas, creativity and intelligent collaboration. Our strong and supportive network is based on the shared values of our schools and colleges.\r\n\r\nWe at the CSP are passionate about developing a generation of outstanding teachers and want to provide as much support as we can to ensure committed, enthusiastic and capable people make it on to our teacher training scheme. We offer excellent teacher training in partnership with Goldsmiths, with all courses resulting in a PGCE qualification. \r\n\r\nWe run an extensive CPD programme including two Early Career Conferences in the autumn and summer terms and School Study Visits in the spring term, providing networking opportunities and the chance to observe teaching in other schools within the partnership, in line with both your university studies and personal areas of development. Opportunities for school-based research and reflection, along with the sharing of outstanding expertise within a business-like model form the heart of our work.\r\n\r\nAn induction programme will be provided in school to supplement your university provision. The weekly sessions will cover a range of topics relevant to your training, including safeguarding; lesson planning, marking, and pastoral aspects such as the role of a form tutor. You will be fully involved in the life of the school attending parents' evenings and participating in school trips.\r\n\r\nAbout the University Course\r\nCourses last for one full academic year (September - July) and involve two placements (please see additional information below).  Successful completion leads to a PGCE with Qualified Teacher Status (QTS).\r\n\r\nThis secondary programme prepares you to teach all aspects of design and technology. You are shown how to plan, resource and organise lessons, and how to monitor, record, evaluate and assess the art practices of students. Workshops, lectures and seminars are conducted by Goldsmiths lecturers, artist teachers and gallery/arts educators.\r\n\r\n[Design and Technology at Goldsmiths](https://www.gold.ac.uk/pgce/secondary-design-technology/) \r\n\r\nYou will attend university training days with other School Direct and PGCE students. On the Tuition Fee route, you will carry out academic assignments leading to the award of 60 masters level credits.\r\n","interviewProcess":"At the CSP we are looking for candidates who can support our shared vision: Growing Teachers, Growing Learners, Growing Schools.  \r\n\r\nWhen applying please select your preferred school.  All applications are vetted upon receipt. Once your application has passed this process you will be invited to an interview at the location to which you have applied.\r\n\r\nThe interview day will include a tour of the school and a formal interview, which is usually conducted by a Senior Leader, Head of Department and the CTA Co-ordinator (where available). Some time may also be spent in a class with the Head of Department (wherever possible). \r\n\r\nWe follow the Enhanced route for School Direct with Goldsmiths University with all of the interview tasks being carried out by the school. A member of the teaching team from Goldsmiths may also attend. You will be asked to complete several tasks including a numeracy, literacy and subject knowledge task. Your interview for Design and Technology will also consist of a creative element. Further details will be provided if you are invited to interview. \r\n\r\nYou will have the opportunity to ask any questions about the Catholic Schools’ Partnership, School and the School Direct Programme at interview.\r\n\r\nAfter interview, the University and the Lead School will jointly reach a final decision regarding any offer.\r\n \r\nCandidates usually apply to schools that are located close to where they live and we are happy to arrange tours and an observation day in your preferred school prior to application (restrictions permitting).\r\n","howSchoolPlacementsWork":"School Direct trainees usually start at their chosen school during the first week of the autumn term. Term dates will be confirmed once released. \r\n\r\nUniversity sessions usually start on the Friday of the first week and will be arranged in blocks throughout the year. Trainees on the Enhanced route attend approximately 36 university days.  As with all PGCE courses you will be expected to attend all of the specified university sessions.  The course runs from September to June and trainees will spend 120 days in school over the course of the year.\r\n\r\nWe offer an AB placement structure with Goldsmiths and you will complete placements in two contrasting schools. You will be allocated a Subject Mentor and Professional Co-ordinating Mentor in each school and both placements will be hosted in Catholic Schools. \r\n\r\nAround half of the schools within the Catholic Schools’ Partnership offer training placements. Those who are able to support the main/first placement are listed for each respective course. \r\n\r\nAt the start of the training year we will contact all trainees to confirm where you are living and to ask about the type of school that you would like to be placed in for your second placement. Where possible, we will try to accommodate your request and placements are arranged with a maximum commuting distance of 1 hour 15 minutes based upon the address provided. Travel time is usually significantly less than this.\r\n\r\nWe are able to offer contrasting placements in single-sex or mixed schools and in schools with sixth forms where your main placement school is 11-16.  Second placements in a 6th Form College may also be possible. Where you have completed a placement in a single-sex school your second placement will be in a mixed school or a school with students of the opposite sex.\r\n\r\nYour tutor from Goldsmiths will visit you in school on a regular basis and liaise with your school mentor regarding your training and development. Your university tutor will carry out your final assessment in school against the national Teachers’ Standards.\r\n\r\nAdditional information can be obtained from C.Barclay the CSP Co-ordinator c.barclay@catholicschoolspartnership.org.uk\r\n","personalQualities":"We are looking for individuals who have the capacity to develop into outstanding teachers. This requires a combination of personal and academic skills. \r\n\r\nYou should demonstrate awareness of what good teaching entails and show a desire to teach. \r\n\r\nThere are three main attributes required for teaching: \r\n1) Subject Knowledge - you need to show that you have a specialist understanding. \r\n2) An ability to communicate with an audience. Your class will be your audience and the relationship and command of this group is crucial. \r\n3) Good Interpersonal Skills - you need to demonstrate that you can work well with others. \r\n\r\n\r\n \r\n","otherRequirements":"Satisfactory occupational health check from your GP, plus the return of completed self-declaration of suitability form. Please refer to the [Fitness to Train](https://www.gold.ac.uk/fitness-to-train/) section of the Goldsmiths website for further information on the required checks. \r\n\r\nAlthough not compulsory, at least one day of school observation is recommended prior to application, preferably with the same age group you’d like to work with i.e. primary or secondary.\r\n\r\nProviding original certificates of academic qualifications to the admissions office. \r\n\r\n","status":1,"createdAt":"2021-09-01T13:22:40.610Z","updatedAt":"2021-09-14T12:24:09.545Z","canSponsorStudentVisa":"yes","cycle":"2024"}
