{"id":"59d0b7c3-62c0-4341-8997-8d0de6d9371f","name":"Primary","code":"Z994","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_7","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"618ca212-3519-4098-8614-fbd66d46758f","name":"St Thomas More Catholic Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"e8eae8bc-676b-48b5-800a-459ec7ae808f","name":"St Stephen's Catholic Primary School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"5fc43d72-6d2c-424f-adaa-dc58efa5de03","code":"134","name":"Catholic Schools’ Partnership"},"accreditedBody":{"id":"049fe65f-08dc-4686-9ac8-606dce490128","code":"G56","name":"Goldsmiths, University of London"},"profPost":"PG","degreeGrade":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Please note that at the point of application you should already have two out of the three required GCSEs/Equivalencies. If you only have one of the three required subjects then you will be required to pass one equivalency test prior to application.\n\nDetails of the equivalency tests that Goldsmiths will accept can be found [here](https://www.gold.ac.uk/pgce/apply/entry-requirements/gcse-accepted-equivalencies/)","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Why should I join the CSP?\r\n\r\nWe believe that the single most significant factor of a child’s success in school is the quality of their teachers. The Catholic Schools' Partnership is, therefore, dedicated to developing staff with high expectations and a clear understanding of how to create a learning environment in which their students can flourish. Our focus is on developing teaching and learning through innovative ideas, creativity and intelligent collaboration. Our strong and supportive network is based on the shared values of our schools and colleges.\r\n\r\nGoldsmiths University\r\n\r\nThe School Direct Primary programme (PGCE + QTS) has three distinct modules. These are: \r\n•\tSchool Experience  \r\n•\tStudies and Professional Issues in Education \r\n•\tCurriculum Studies \r\n\r\nSchool Experience \r\n\r\nYou will spend approximately 6 weeks of the programme in University. In this time, you will have mix of lectures and small group seminars to support you in developing a strong and confident knowledge of the subjects you will be teaching in the primary classroom. Underpinning the programme is the Professional Studies course which is designed to prepare you fully for the wider roles and responsibilities of the teacher. \r\n\r\nThe Primary School Direct Programme is taught and assessed at Masters Level. In addition to a recommendation for QTS, if you pass all academic elements of the programme, you will also leave with level 7 credits equivalent to one-third of a master’s degree. Full academic support is provided to ensure you are fully prepared for assessment regardless of your prior experiences. \r\n\r\nStudies and Professional Issues in Education (SPIRE)  \r\n\r\nThe SPIRE module focuses upon issues that most impact upon the young person’s experience of education in the 21st Century.  In sessions you will be asked to: consider a range of issues relating to diversity and inclusion; engage with research and policy and link all of this to your own experience in the classroom.  In your written assignment you will choose one area from this module to reflect upon more deeply. \r\n\r\nCurriculum Studies  \r\n\r\nFor students following a School Direct pathway this module will focus specifically upon Learning Theory and will ask students to reflect upon the impact that research in this area has on the policy and practice of their school.   \r\n\r\nThe Early Years Primary School Direct Programme with the Catholic Schools' Partnership offers training for the 3-7 age group (with placement in EYFS and Key Stage 1).\r\n\r\n[Primary School Direct at Goldsmiths](https://www.gold.ac.uk/pgce/primary/)\r\n","interviewProcess":"At the CSP we are looking for candidates who can support our shared vision: Growing Teachers, Growing Learners, Growing Schools.  \r\n\r\nWhen applying please select your preferred school.  All applications are vetted upon receipt. Once your application has passed this process you will be invited to an interview at the location to which you have applied.\r\n\r\nThe interview day will include a tour of the school and a formal interview, which is usually conducted by the Head Teacher or a Senior Leader and the CSP Co-ordinator (where available). Some time may also be spent in a class completing a short task with a group of pupils where a school can arrange this. \r\n\r\nWe follow the Enhanced route for School Direct with Goldsmiths University with all of the interview tasks being conducted in school. A member of the teaching team from Goldsmiths may also attend. You will be asked to complete a number of tasks including a numeracy and a literacy  task. Further details will be provided if you are invited to interview. \r\n\r\nYou will have the opportunity to ask any questions about the Catholic Schools' Partnership, School and the School Direct Programme at interview.\r\n\r\nAfter interview, the University and the Lead School will jointly reach a final decision regarding any offer.\r\n \r\nCandidates usually apply to schools that are located close to where they live and we are happy to arrange tours and an observation day in your preferred school prior to application. ","howSchoolPlacementsWork":"School Direct trainees start at their chosen school during the first week of the autumn term. Term dates will be confirmed upon acceptance of an offer. \r\n\r\nAll Primary trainees will spend approximately 6 weeks in university. As with all PGCE courses you will be expected to attend all of the specified university sessions.  \r\n\r\nWe offer an ABA placement structure with Goldsmiths and you will spend 6 weeks in the spring term in a contrasting school. You will be allocated a Mentor  in each school and both placements will be hosted in Catholic Schools. \r\n\r\nAround half of the schools within the Catholic Schools’ Partnership offer training placements. Those who are able to support the main placement are listed for each course.\r\n\r\nAt the start of the training year we will contact all registered trainees to confirm where you are living and to ask about the type of school that you would like to be placed in for your second placement. Where possible, we will try to accommodate your request and placements are arranged with a maximum commuting distance of 1 hour 15 minutes based upon the address provided. Travel time is usually significantly less than this.\r\n\r\nYour tutor from Goldsmiths will visit you in school on a regular basis and liaise with your school mentor regarding your training and development. Your university tutor will carry out your final assessment in school against the national Teachers’ Standards.\r\n\r\nAdditional information can be obtained from C. Barclay the CSP Co-ordinator c.barclay@catholicschoolspartnership.org.uk","personalQualities":"We are looking for applicants that understand the nature of working in an urban setting and a have a clear commitment and enthusiasm for working with children. You must be able to show resilience and be willing to work with others. \r\n","otherRequirements":"Satisfactory occupational health check from your GP, plus the return of completed self-declaration of suitability form. Please refer to the [Fitness to Train](https://www.gold.ac.uk/fitness-to-train/) section of the Goldsmiths website for further information on the required checks. \r\n\r\nPrior school experience is no longer a requirement but Goldsmiths recommend that you spend some time in a primary school to ensure that you are fully aware that the profession is right for you. \r\n\r\nProviding original certificates of academic qualifications to the admissions office. \r\n\r\n","status":1,"createdAt":"2021-09-28T11:26:58.023Z","updatedAt":"2021-09-28T14:07:45.974Z","canSponsorStudentVisa":"yes","cycle":"2024"}
