{"id":"a71a81de-7234-420a-9f8b-37f1a57e173c","name":"Computing with ICT","code":"2HD3","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"e6be6a9c-8696-4b88-8fbd-1ba1bef1b6fc","code":"11","name":"Computing"}],"locations":[{"id":"c7d2bc62-393f-4fbf-b5bf-fe647e7ca417","name":"St Michael's Catholic College","isPublished":"Y","status":"R","vacancies":"F"},{"id":"222e0810-c08d-44f7-99bd-98b6e1d90614","name":"Sacred Heart Catholic School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"91a8d8b3-94de-4bc7-873b-47ebd88583f3","name":"St Ursula's Convent School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"5fc43d72-6d2c-424f-adaa-dc58efa5de03","code":"134","name":"Catholic Schools’ Partnership"},"accreditedBody":{"id":"36425fae-da68-4e79-89de-8b41ea733c37","code":"K60","name":"King’s College London (University of London)"},"profPost":"BO","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"Bachelor's degree with a minimum 2nd class honours or higher degree (e.g. master's) (or international equivalent) required in computer science, computing, information technology or information systems. Related degrees that include a high computer science component may also be considered.\n\nKnowledge and understanding of the subject you intend to teach. Applicants must have experience enabling them to teach computer science theory and practice to GCSE level and information technology to A-level. \n\nEnhancement courses: If your degree is in information technology but your knowledge of computing is limited you may be asked to complete a one to six-month subject knowledge enhancement (SKE) course. You have to secure a place on a PGCE course before you can start SKE, and SKE typically starts in May or July, so you are advised to apply early for the PGCE.","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"no","additionalGcseEquivalencies":"[A Star Equivalency](https://astarequivalency.co.uk/), or [Birmingham City University](https://www.bcu.ac.uk/education-and-social-work/initial-teacher-training/gcse-equivalency-test/gcse-equivalency-tests-non-bcu-applicants). Please note that the Birmingham City equivalency tests are currently being offered online.","courseLength":"OneYear","feesUK":9250,"feesInternational":19800,"feeDetails":"Tuition fees:\r\nTuition fee loans are available for those who meet the Government’s criteria for this scheme. Further information is available at [GOV.UK](https://www.gov.uk/student-finance/new-fulltime-students)\r\n\r\nGovernment Training Bursaries:\r\nPlease note training bursaries are only available to students who have been classified as Home/EU for fee purposes.\r\n","aboutCourse":"Located in the heart of London, PGCE courses at King’s are rated Outstanding by Ofsted with excellent tutors on hand to support you through your training. In the last research assessment exercise, the department was rated second in the UK (REF, 2014). You will have the opportunity to work with experienced tutors who are actively engaged in research in their subject and in pedagogy more widely. 94% of 2018 graduates who sought teaching posts were employed within 6 months of qualifying. In our 2020 student survey, 98% of trainees rated their training as good, very good or excellent.\r\n\r\nThe PGCE Computing at King's trains Computing professionals and graduates to become effective teachers of Computing in secondary schools. The PGCE Computing programme examines in detail the specifications and expectations for Computing in UK secondary schools including GCSE and A-Level courses.\r\n\r\nLearning to be a teacher of Computing involves:\r\n\r\n* learning about teaching the Computing knowledge, skills and processes as laid down in the National Curriculum and examination specifications for Computing, Computer Science and Information Technology.\r\n* learning how to incorporate computational thinking into other subject areas in schools.\r\n\r\nA distinctive feature of the King's Computing programme is the emphasis on learning through critical reflection and discussion with colleagues. In the same way that you will encouraged to make your students think when they are analysing computing-based issues and problems, so staff at King's are keen for you to apply your developing understanding of teaching to help you think about your own practice.\r\n\r\nAt King’s we are at the forefront of research into computing education in schools, and this research impacts on the teaching in the programme. We also co-run the Computing At School (CAS) Regional Centre for London, running many professional development and networking events for teachers of Computing. Our PGCE students can get involved in all these activities.\r\n\r\nThis course aims to prepare students to:\r\n* become effective secondary school teachers\r\n* become knowledgeable subject specialists who can progress to take on responsibilities in curriculum development\r\n* become good classroom managers\r\n* become successful form tutors and collaborative colleagues.\r\n\r\n[Course Information](https://www.kcl.ac.uk/study/postgraduate/taught-courses/pgce-computing.aspx)","interviewProcess":"In addition to meeting the shortlisting requirements, it is desirable that you can demonstrate the following if you are to be offered a place:\r\n\r\n* conceptual understanding of some school Computing\r\n* knowledge of an appropriate level of Computing\r\n* ability to think and reason clearly\r\n* clarity and accuracy of written and spoken communication\r\n* successful experience with children or clear potential for this\r\n* ability to interact with pupils and colleagues\r\n* strong motivation to teach\r\n* ability to recognise own shortcomings\r\n* flexibility of mind and potential necessary to improve.\r\n* ability to present ideas clearly and at an appropriate level.\r\n\t\r\nIf you are shortlisted you will be invited to a group interview. This process will take half a day and is designed to:\r\n\r\n* enable you to demonstrate your potential for teaching Computing\r\n* help you to decide whether Computing teaching is the right career for you.\r\n\r\nDuring the interview process you will demonstrate your potential for teaching Computing through:\r\n\r\n* subject knowledge test (including questions on algorithms and programming)\r\n* oral answers during individual interview\r\n* a brief introduction to a lesson which you prepare at the interview and present to the rest of the interview group.\r\n\r\nPresentation - we will be looking for:\r\n* ability to explain concepts at a school level;\r\n* engagement with the audience;\r\n* use of simple resources (e.g. visual aids);\r\n* understanding of the subject you wish to teach;\r\n* confidence.\r\n\r\n","howSchoolPlacementsWork":"School Direct trainees start at their chosen school during the first week of the autumn term. Term dates will be confirmed upon acceptance of an offer.\r\n\r\nThe university course starts in the second week of September and is full-time until late June. Sessions are usually from 9:30 to 4:30 but much of the time is spent in schools and you are usually expected to be in school by 8:00 or 8:30. The course is very intensive and most students find that they are not able to do part-time work during this time.\r\n\r\nAround half of the schools within the Catholic Schools’ Partnership offer training placements. Those who are able to support the main placement are listed for each respective course.\r\n\r\nCandidates usually apply to schools that are located close to where they live and we are happy to arrange tours and an observation day in your preferred school prior to application. \r\n\r\nWhen applying please select your preferred school.  Once your application passes our vetting process you will be invited to interview at KCL followed by an interview at the school.\r\n\r\nWe offer an ABA placement route, this includes a 6-week placement at another school within the CSP in the spring term before you return to your original school for the remainder of the course. Your two placements will cover the 11-18 age group.\r\n\r\nAt the start of the academic year we will contact all trainees to confirm where you live and to ask about the type of school that you would like to be placed in for your second placement. Where possible, we will try to accommodate your request and placements are arranged with a maximum commuting distance of 1 hour 15 minutes based upon the address provided. Travel time is usually significantly less than this.\r\n\r\nWe are able to offer contrasting placements in single-sex or mixed schools and in schools with sixth forms where your main placement school is 11-16.  Where you have completed a placement in a single-sex school your second placement will be in a mixed school or a school with students of the opposite sex. \r\n","personalQualities":"Personal qualities we look for include:\r\n\r\n* Ability to engage interest and communicate your own enthusiasm for mathematics\r\n* Commitment to working with young people\r\n* Ability to explain ideas clearly and to think on your feet\r\n* Evidence of good interpersonal skills\r\n* Awareness of current educational issues\r\n","otherRequirements":"The Department for Education requires the Disclosure and Barring Service (formerly the Criminal Records Bureau) to vet the background of persons working in their schools. Candidates offered a place on a PGCE course will be asked to complete an enhanced check with the DBS to ensure they do not have a criminal background which might prevent them from working as a teacher. This must be completed before you register on the programme.\r\n","status":1,"createdAt":"2021-07-06T10:55:42.302Z","updatedAt":"2021-09-17T10:29:45.898Z","canSponsorStudentVisa":"no","cycle":"2024"}
