{"id":"b8be4f25-7ea0-4996-868d-572f5283e62d","name":"Modern Languages (French with Spanish)","code":"2HF3","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"e34fd2a3-a32e-44e9-aea1-666badf3ac03","code":"22","name":"Spanish"},{"id":"9727f674-61ba-4efa-b1f2-21ec7e354442","code":"15","name":"French"},{"id":"ce8523ef-9236-4cd9-b260-d826c7a521b3","code":"ML","name":"Modern Languages"}],"locations":[{"id":"18a10679-4c55-45af-8325-28bfe7d241ae","name":"St Columba's Catholic Boys' School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"5fc43d72-6d2c-424f-adaa-dc58efa5de03","code":"134","name":"Catholic Schools’ Partnership"},"accreditedBody":{"id":"ef172d85-20e4-4aa2-96d0-9e3ae81f526d","code":"S64","name":"St Mary’s University, Twickenham"},"profPost":"BO","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"MFL PGCE applicants are expected to have a good degree (2:2 or above) in a related subject. \n\nTwo languages (French and Spanish) are required for this course. Please contact the CSP Co-ordinator, Clare Barclay, c.barclay@catholicschoolspartnership.org.uk for further details regarding the level of fluency required. \n\nAdditional requirement information\nYour degree should have a significant proportion of the subject you wish to teach. Subject knowledge enhancement courses may be set as a condition in some cases, particularly when the degree is not clearly ‘in line’ with the subject you are applying to.","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"GCSE equivalencies are required regardless of any higher qualification in a related subject.\nAn individual with an A Level or Undergraduate degree in Mathematics, English or Science also requires the appropriate GCSEs to undertake a teacher training programme.\nThe Institute of Education offers GCSE equivalency tests in Eng¬lish, Mathematics and Science. A pass in one of these equivalency tests is considered to be of the same standard as a GCSE C grade or Level 4 in the revised GCSE structure.\nExams will be sat under exam conditions. Examiners decisions are final and no appeals will be considered.\n* English: 1 hour 45 minutes\n* Maths: 1 hour 15 minutes\n* Science - Combined science: 1 hour 30 minutes\n\nIf you are applying to study at St Mary's the cost of our GCSE equivalency test for is £85. This is payable when you book your test. A second payment is required if you need to re-sit the test.\nYour result will be emailed to you within three weeks of taking your test.\nYou are allowed one resit for a failed test. Should you fail both tests you will be required to undertake a full GCSE qualification.\nFind out more [here](https://www.stmarys.ac.uk/teacher-training/prepare/gcse/equivalency-tests.aspx)","courseLength":"OneYear","feesUK":9250,"feesInternational":12730,"aboutCourse":"Why should I join the CSP? \r\n\r\nWe believe that the single most significant factor of a child’s success in school is the quality of their teachers. The Catholic Schools’ Partnership is, therefore, dedicated to developing staff with high expectations and a clear understanding of how to create a learning environment in which their students can flourish. Our focus is on developing teaching and learning through innovative ideas, creativity and intelligent collaboration. Our strong and supportive network is based on the shared values of our schools and colleges.\r\n\r\nWe at the CSP are passionate about developing a generation of outstanding teachers and want to provide as much support as we can to ensure committed, enthusiastic and capable people make it on to our teacher training scheme. We offer excellent teacher training in partnership with St Mary’s University, with all courses resulting in a PGCE qualification.\r\n\r\nWe run an extensive CPD programme including two Early Career Conferences in the autumn and summer terms and School Study Visits in the spring term, providing networking opportunities and the chance to observe teaching in other schools within the partnership, in line with both your university studies and personal areas of development. Opportunities for school-based research and reflection, along with the sharing of outstanding expertise within a business-like model form the heart of our work.\r\n\r\nAn induction programme will be provided in school to supplement your university provision. The weekly sessions will cover a range of topics relevant to your training, including safeguarding; lesson planning, marking, and pastoral aspects such as the role of a form tutor. You will be fully involved in the life of the school attending parents’ evenings and participating in school trips.\r\n\r\nAbout the University Course\r\n\r\nCourses last for one full academic year and involve two placements.  Successful completion leads to a PGCE with Qualified Teacher Status (QTS).\r\n\r\nThe course covers all aspects of modern language teaching and learning, with an emphasis on practical activities for use in school. There is a strong emphasis on using the target language in the classroom, as well as planning for the whole ability range to ensure that all pupils are able to make progress.\r\n\r\n[MFL at St Mary's University](https://www.stmarys.ac.uk/postgraduate-courses-london/pgce-secondary-mfl) \r\n\r\nYou will attend university training days  with other School Direct and PGCE students. On the Tuition Fee routes you will carry out academic assignments leading to the award of 60 masters level credits.\r\n","interviewProcess":"At the CSP we are looking for candidates who can support our shared vision: Growing Teachers, Growing Learners, Growing Schools.  \r\n\r\nWhen applying please select your preferred school.  All applications are vetted upon receipt. Once your application has passed this process you will be invited to attend an interview.\r\n\r\nYou will be interviewed at the university in the first instance. The day will consist of a formal interview and a number of tasks.  Further details of the requirements will be provided if you are invited to interview. \r\n\r\nSuccessful applicants are invited to tour their chosen school. You will have the opportunity to spend some time observing classes, meeting with members of the department and getting to know the school. For some subjects a short interview will be conducted at the school. \r\n\r\nYou will also have the opportunity to ask any questions about the Catholic Schools' Partnership, School and the School Direct Programme at one of the interview dates and where possible the CSP Co-ordinator will attend the university interview day.\r\n\r\nAfter interview, the University and the Lead School will jointly reach a final decision regarding any offer.\r\n \r\nCandidates usually apply to schools that are located close to where they live and we are happy to arrange tours and an observation day in your preferred school prior to application. ","howSchoolPlacementsWork":"Trainees will attend university for a number of weeks prior to their school placement. However, all successful applicants will be invited to attend an induction day at their chosen school in the summer term prior to starting the course. \r\n\r\nUniversity sessions are delivered in blocks at the start of each term. Trainees attend approximately 40 university days.  As with all PGCE courses, you will be expected to attend all of the specified university sessions.  The course runs from September to June and trainees will spend 120 days in school over the course of the year.\r\n\r\nWe offer an ABA placement structure  and you will spend January to March in the spring term in a contrasting school. You will be allocated a Subject Mentor and Professional Co-ordinating Mentor in each school and both placements will be hosted in Catholic Schools.\r\n\r\nAround half of the schools within the Catholic Schools’ Partnership offer training placements. Those who are able to support the main placement are listed for each course. \r\n\r\nAt the start of the training year we will contact all registered trainees to confirm where you are living and to ask about the type of school that you would like to be placed in for your second placement. Where possible, we will try to accommodate your request and placements are arranged with a maximum commuting distance of 1 hour 15 minutes based upon the address provided. Travel time is usually significantly less than this.\r\n\r\nWe are able to offer contrasting placements in single-sex or mixed schools and in schools with sixth forms where your main placement school is 11-16.  Where you have completed a placement in a single-sex school your second placement will be in a mixed school or a school with students of the opposite sex.\r\n\r\nYour tutor from St Mary's will visit you in school on a regular basis and liaise with your school mentor regarding your training and development. Your university tutor will carry out your final assessment in school against the national Teachers’ Standards.\r\n\r\nAdditional information can be obtained from C.Barclay the CSP Co-ordinator c.barclay@catholicschoolspartnership.org.uk","personalQualities":"We are looking for individuals who have the capacity to develop into outstanding teachers. This requires a combination of personal and academic skills. \r\n\r\nYou should demonstrate awareness of what good teaching entails and show a desire to teach. \r\n\r\nThere are three main attributes required for teaching: \r\n1) Subject Knowledge - you need to show that you have a specialist understanding. \r\n2) An ability to communicate with an audience. Your class will be your audience and the relationship and command of this group is crucial. \r\n3) Good Interpersonal Skills - you need to demonstrate that you can work well with others. \r\n\r\n\r\n \r\n","otherRequirements":"* Two appropriate references (from an academic tutor or line manager) supporting your suitability for teaching.\r\n* Satisfactory Disclosure and Barring Service (DBS) check.\r\n* Physical and mental fitness to teach.\r\n\r\nSchool observation\r\nSt Mary's University would like all applicants to have made a fully informed decision about considering joining the teaching profession. As part of that decision making process, spending some time in school(s) observing what teachers do and beginning to give some consideration to how they manage learning can be really insightful and informative.","status":1,"createdAt":"2021-07-06T10:55:42.651Z","updatedAt":"2021-09-21T13:43:59.807Z","canSponsorStudentVisa":"yes","cycle":"2024"}
