{"id":"f2a20612-05f3-46eb-8dcb-ade0af74ddcf","name":"Modern Languages","code":"2NKM","qualification":"qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"ce8523ef-9236-4cd9-b260-d826c7a521b3","code":"ML","name":"Modern Languages"},{"id":"4608e5e3-2a1a-48a1-8236-56c7af5a139d","code":"24","name":"Modern languages (other)"}],"locations":[{"id":"1848752f-bbeb-4f7e-a62a-ee960bf2dc7f","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"2301745b-affa-4923-90f6-8f0808fa89e8","code":"1NK","name":"St George RC School"},"accreditedBody":{"id":"1165d5fd-11f4-4dab-99c9-47b309481463","code":"C10","name":"Canterbury Christ Church University"},"degreeGrade":"9","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":null,"aboutCourse":"Our subject mentors in Modern Languages are experienced teachers who are enthusiastic about your development and know what is required for you to succeed.\r\n\r\nThey have designed a thorough programme of teacher training for you that will enable you to learn new skills in Modern Languages and forge professional relationships with experienced teachers within the Academy Trust.\r\n\r\nAdditionally, CPD sessions are run on a weekly basis to ensure that you maintain and enhance the knowledge and skills you need within the teaching profession.\r\n","interviewProcess":"You will initially conduct a ~30 minute interview with representatives from CCCU and St George's school. Here you will be asked set questions regarding your experiences and how they has prepared you for teaching as well as questions around your readiness to teach your subject.\r\n\r\n\r\nFollowing the interview you will deliver a 15 minute teaching episode to the panel on a subject of your choice. The teaching episode must be designed for a higher ability year 7 class. You can chose to present the subject in any way that you wish. You will have access to a Windows computer and a projector. You will need to bring any additional resources that you need on the day with you (printing, equipment, etc).\r\n\r\nFollowing the teaching episode you will be asked to complete a ~15 minute reflection. The reflection should include the following:\r\n\r\n•the strengths of the teaching episode\r\n•the weaknesses of the teaching episode\r\n•how you would improve it if you had to teach it again\r\n","howSchoolPlacementsWork":"As part of the teacher training course, trainees will be expected to complete a 4-week placement in one of the Institutions within the Academy trust.","personalQualities":"","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:46:20.274Z","updatedAt":"2021-10-11T17:04:53.238Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"With School Direct (salaried) programmes you won’t need to pay any tuition fees. You’ll be employed by a school directly as an unqualified teacher. The amount you’ll earn will be dependent on the school you train in, and the subject you’re teaching."}
