{"id":"1294b238-ffd3-4985-9967-7fae7925db37","name":"Primary","code":"25P5","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"0a9910d0-4591-4311-afc5-c4397356a120","name":"Yorkshire Wolds Teacher Training","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"b78a6c0d-9694-4a77-8b8e-1e38cafdd4f5","code":"1OL","name":"Tidal Education Alliance"},"accreditedBody":{"id":"4cc0d82a-c0fc-4661-b1e0-4080bc75b27b","code":"2EV","name":"Yorkshire Wolds Teacher Training"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"Grade 4 (C) or above in English, maths and science, or equivalent qualification\n\nCandidates with pending GCSEs will be considered\n\nEquivalency tests will be accepted in English, maths and science\n\nEquivalency testing is available if you do not hold these qualifications, but please contact us before applying if this applies to you.\n\nYou should be a graduate (or about to graduate this year), preferably with a 1st, upper 2nd or lower 2nd class degree.\n\nAll teachers are expected to be competent in Fundamental English and mathematics by the end of ITT.","courseLength":"OneYear","feesUK":9250,"feesInternational":12800,"feeDetails":"Actual fee to be confirmed for 2021-22 entry, the fee published was for the fee for 2020-21 entry.\r\n\r\nTraining bursaries are available for some subjects for all UK and EU postgraduate teacher trainees. For information visit the following website for information.\r\n(https://getintoteaching.education.gov.uk/funding-and-salary/overview)\r\n\r\n","financialSupport":"You may be eligible for a loan while you study.\r\n\r\n\r\n\r\n","aboutCourse":"The programme is aimed at those who want to teach children in the 5–11 age range, that is, at Key Stages 1 and 2.\r\n\r\nIn order to be awarded Qualified Teacher Status trainees must meet the Teachers' Standards set by the Government and so the programme is designed to enable trainees to achieve this by offering a balance of school and YWTT SCITT based periods across the year.\r\n\r\nThe programme is one-year, full-time and its structure is closely linked to the term dates of local schools, with registration taking place in early September and the course finishing at the end of July.\r\n\r\nTrainees are matched with a host school and will spend the majority of their learning journey in this setting. A typical week is four days in school with one day at the training base.\r\n\r\nYorkshire Wolds Teacher Training (YWTT SCITT) was judged 'Outstanding' across all areas of its Ofsted report in October 2019.\r\n\r\nYWTT provides excellent training facilities with both primary and secondary simulated classrooms purposefully designed to enhance the programme delivery. YWTT provides a bespoke training experience for all our trainees and the Leadership has a wealth of experience and have a hands on approach to supporting all trainees to enable them to become the very best practitioners to ensure the next generation flourish.\r\n\r\nThe school-based element of the programme is largely taken up by two Teaching placements but there are also many other half and full-day visits to schools.\r\n\r\nIn addition to the award of QTS, trainees are able to gain a Post Graduate certificate in Education through Sheffield Hallam University which is delivered as part of the training programme at the Yorkshire Wolds Training base. The award of PGCE is separate to the award of QTS and, in order to achieve this, trainees must study for, complete and pass two assignments set and assessed by Sheffield Hallam University.","interviewProcess":"Competition for places is strong.\r\n\r\nSuccessful applicants will attend a selection day at one of our outstanding primary school partners. This will begin with a general introduction to the  programme by the Tidal leader, followed by an opportunity to ask questions. The rest of the sessions comprises four activities:\r\n\r\n•\tA 20 minute teaching task to a  group   of 6 to 8 pupils\r\n•\tA written task to assess the quality of your written English\r\n•\tA numeracy task\r\n•\tAn individual interview with a member of the Tidal Primary team and a headteacher from one of our partner schools.\r\n\r\nWe are looking for candidates with as much relevant experience of being in a school as possible, and evidence of why teaching is for them.\r\n\r\nApplicants who demonstrate a passion for working with young people and a strong desire to teach.\r\n\r\nApplicants who display a good level of spoken and written standard English.\r\n\r\n","howSchoolPlacementsWork":"Trainees undertake two periods of teaching across the year.\r\n\r\nDuring these placements, in two contrasting schools, trainees are expected to gradually build up portfolio of teaching and related evidence which enables them to demonstrate meeting the Teachers’ Standards. \r\n\r\nDuring the diversity placement a trainee will spend some time observing classroom practice, undertaking joint planning and delivery, reflecting on this with the subject mentor in weekly mentor meetings, undertaking a student progress tracking task and gradually developing teaching practices. \r\n\r\nThe Main placement is a longer placement in a suitably diverse school, where the trainee will spend time observing classroom practice, reflecting on this with the subject mentor in weekly mentor meetings, acting as a TA and gradually developing and embedding teaching skills, building up to a 70% teaching timetable by the end of the placement.  \r\n\r\nThe aim is to give every trainee a wide range of experience, encompassing pupils of different ages and schools of different size and type.\r\n\r\nFor each teaching placement, trainees are assigned a university tutor who offers support and guidance before and during the placement. This complements the role of the school mentor, who is able to monitor and assist the trainees’ development on a day-to-day basis.\r\n\r\nUniversity tutors and school mentors work closely in partnership with one another to ensure the best possible outcomes for all trainees.\r\n\r\nDuring the year trainees will have the opportunity to teach all primary curriculum subjects, with an emphasis on English and mathematics. The overall teaching load for the spring placement is 60-65%, with an increase in the summer to 70-75%. This provides a firm basis for the 80% teaching load during the NQT year.\r\n","personalQualities":"Personal qualities\r\nWe are looking for applicants with\r\n•\tA commitment to primary education\r\n•\tAn ability to motivate and inspire children of all abilities\r\n•\tEnergy and enthusiasm\r\n•\tEffective interaction with children\r\n•\tAn ability to work under pressure\r\n•\tPerseverance and flexibility\r\n•\tOral and written communication skills\r\n•\tThe ability to work co-operatively\r\n•\tAn awareness of current educational issues\r\n•\tA broad subject-knowledge base\r\n•\tReflection, self-evaluation and a willingness to learn\r\n•\tAwareness of what being a primary teacher entails\r\n","otherRequirements":"Successful applicants will undergo a DBS check.","status":1,"createdAt":"2021-07-06T10:53:41.360Z","updatedAt":"2021-07-08T10:36:42.598Z","canSponsorStudentVisa":"no","cycle":"2024"}
