{"id":"2a05130d-331c-4ab4-984f-0de5db83717d","name":"Primary","code":"U905","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"7_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"2c8eab15-95a8-4a62-b464-46a5cc4acd33","name":"St. Peter's Church of England Junior School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"efc5c0af-96d8-4b6b-a02d-965d674f236c","code":"1UH","name":"Calthorpe Park North East Hants and Surrey Borders Consortium"},"accreditedBody":{"id":"6439adcc-af64-4d3d-a1da-de045755db06","code":"R12","name":"The University of Reading"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feeDetails":"£7,710 for QTS","aboutCourse":"Your training will lead to the award of a PGCE by the University of Reading as well as a recommendation for the award of Qualified Teacher Status (QTS) by the Department for Education (DfE). The PGCE includes 60 credits at Masters level, the equivalent of one third of an MA that you can add to subsequently. Or you can decide to go for QTS only.\r\n\r\nThe programme is the result of long-standing close collaboration between the University of Reading and local Partnership Schools. Through this Partnership, we are able to make strong and effective links between the theoretical perspective, drawing on current and recent research, and the practical skills of teaching. The programme is designed to support you in developing the knowledge, understanding and skills that schools look for when appointing Newly Qualified Teachers (NQTs), as well as providing you with the skills and aptitude to develop your teaching career.\r\n\r\nAt University, time is spent studying both the theory and the practice of whole school issues. Lectures and seminars are led by University tutors, with contributions from expert teachers from local Partnership schools.\r\nIn schools, you will work alongside mentor teachers, further supported by University tutors. The placements are planned to support you to develop their knowledge and understanding by taking increasing responsibility for groups and whole classes\r\n\r\nYour training is a gradual, staged process. You will be given opportunities to observe good practice and work with groups before taking some full class responsibility. During the final school experience you will assume the teacher's role for the majority of the placement; however a trainee does not have sole responsibility for classes at any stage during their training\r\n\r\nAssessment is on-going through the programme. On the PGCE route academic work is assessed through assignments which can take the form of essays. Formative and summative assessment of practical teaching skills is on-going during the School Experiences\r\n\r\n","interviewProcess":"If your application is shortlisted, you will be invited for an interview and assessment day at the school where the placement is.\r\n\r\nIf you are successful at interview, a conditional offer of a place will be made. The conditions will include providing proof that you have met the eligibility conditions for Initial Teacher Training, including a criminal record check and an occupational health assessment. Further conditions may be discussed with you at interview.\r\n\r\nIf you accept the offer of a place, you will be required to attend an Induction and Needs Assessment Afternoon at the University of Reading. This will be an opportunity to meet the University tutor, who will help you identify pre-course targets to prepare you for your training. \r\n","howSchoolPlacementsWork":"We are looking to appoint an enthusiastic, creative and motivated student teacher to join our team from September 2022.\r\nSt. Peter’s Church of England Junior School is located in the most beautiful grounds, in a Grade 2 listed building – similar to that of a National Trust property!  We even have our own cellars!  At the heart of our school is our vision for all members of our school community to ‘learn to live life in all fullness’ – inspired by John 10:10.\r\nWe are looking for someone who believes in ‘living life to the full’ – someone who is committed to and passionate about delivering a fully rounded, whole education.  We believe in growing the whole child and best preparing our children for life in an ever-changing world.\r\nInspired by the life, work and impact of St. Peter, we strive to be courageous and to persevere in the face of challenge, learning from our experiences and ‘learning to live life in all its fullness’ for both ourselves and for others.  St. Peter’s School is at the start of an exciting, new journey and we warmly welcome you to join our team and truly make a difference.\r\n \r\nWe can offer you:\r\n•\tA supportive church school community with a heartfelt commitment to ‘life in all fullness’\r\n•\tSpacious classrooms within a beautiful Grade 2 listed building, including sash windows\r\n•\tBeautiful grounds and excellent facilities, including modern technology an amazing children’s kitchen\r\n•\tWell behaved, polite and lovely children who are enthusiastic and strive to do their best\r\n•\tA team of friendly, dedicated and hard-working staff\r\n•\tForward thinking and outward looking opportunities for CPD\r\n•\tThe chance to really make a difference at a school on an exciting journey \r\n\r\nhttps://www.stpeterscofejuniorschool.co.uk/\r\n\r\nWhilst on the programme you will work in two different schools. In each placement you will work alongside experienced teachers and gradually assume more responsibility for planning and teaching as your training progresses. Throughout this process, you will be supported by school based mentors and a University tutor. Assessment is on-going and against the Teachers Standards.\r\n\r\n\r\n\r\n","personalQualities":"A good range of 'A' Levels or equivalent which demonstrate some relevance to National Curriculum subjects will also be of significance in the selection process.\r\n\r\nIn addition to an excellent academic background, we are looking for people who have a strong yet considered desire to work with young people, a positive, informed, open outlook, good communication skills, confidence and determination, an ability to relate well to others in a range of circumstances, interests, hobbies, a sense of humour, a lively enquiring mind and a willingness to become fully involved in all aspects of the Primary curriculum.\r\n","otherRequirements":"Before applying for a place on the course you must spend some time in a Local Education Authority primary school, familiarising yourself with current practice. An awareness of the Primary Curriculum approaches will help you considerably. Speak to teachers and consider the issues affecting the role of teachers and school. Compare and contrast children's needs, desires and attitudes across more than two Key stages to help you gain an awareness of children's perceptions and to help you make or ratify your choice of age range.\r\n\r\n","status":1,"createdAt":"2021-07-06T10:48:41.438Z","updatedAt":"2021-09-20T11:38:09.091Z","canSponsorStudentVisa":"yes","cycle":"2024"}
