{"id":"33706738-b672-4fed-ae41-0f2f93b21813","name":"Primary","code":"T431","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"bf9c97e3-663f-4357-903f-4ca74159be96","name":"Dogmersfield Church of England Primary School","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"efc5c0af-96d8-4b6b-a02d-965d674f236c","code":"1UH","name":"Calthorpe Park North East Hants and Surrey Borders Consortium"},"accreditedBody":{"id":"6439adcc-af64-4d3d-a1da-de045755db06","code":"R12","name":"The University of Reading"},"profPost":"PG","degreeGrade":"9","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feeDetails":"£7,710 for QTS","aboutCourse":"Your training will lead to the award of a PGCE by the University of Reading as well as a recommendation for the award of Qualified Teacher Status (QTS) by the Department for Education (DfE). The PGCE includes 60 credits at Masters level, the equivalent of one third of an MA that you can add to subsequently. Or you can decide to go for QTS only.\r\n\r\nThe programme is the result of long-standing close collaboration between the University of Reading and local Partnership Schools. Through this Partnership, we are able to make strong and effective links between the theoretical perspective, drawing on current and recent research, and the practical skills of teaching. The programme is designed to support you in developing the knowledge, understanding and skills that schools look for when appointing Newly Qualified Teachers (NQTs), as well as providing you with the skills and aptitude to develop your teaching career.\r\n\r\nAt University, time is spent studying both the theory and the practice of whole school issues. Lectures and seminars are led by University tutors, with contributions from expert teachers from local Partnership schools.\r\nIn schools, you will work alongside mentor teachers, further supported by University tutors. The placements are planned to support you to develop their knowledge and understanding by taking increasing responsibility for groups and whole classes\r\n\r\nYour training is a gradual, staged process. You will be given opportunities to observe good practice and work with groups before taking some full class responsibility. During the final school experience you will assume the teacher's role for the majority of the placement; however a trainee does not have sole responsibility for classes at any stage during their training\r\n\r\nAssessment is on-going through the programme. On the PGCE route academic work is assessed through assignments which can take the form of essays. Formative and summative assessment of practical teaching skills is on-going during the School Experiences\r\n\r\n","interviewProcess":"If your application is shortlisted, you will be invited for an interview and assessment day at the school where the placement is.\r\n\r\nIf you are successful at interview, a conditional offer of a place will be made. The conditions will include providing proof that you have met the eligibility conditions for Initial Teacher Training, including a criminal record check and an occupational health assessment. Further conditions may be discussed with you at interview.\r\n\r\nIf you accept the offer of a place, you will be required to attend an Induction and Needs Assessment Afternoon at the University of Reading. This will be an opportunity to meet the University tutor, who will help you identify pre-course targets to prepare you for your training. \r\n","howSchoolPlacementsWork":"This placement is at Dogmersfield Primary School.\r\nOur key Christian values at Dogmersfield Primary School are “Love”, “Courage” and “Respect”. These underpin everything we do.  Every child deserves to feel valued and cared for and our small school with a PAN of 20 pupils allows us to bring this vision to life. \r\nDogmersfield Primary is at the heart of a small village in the North of Hampshire. We are surrounded by glorious countryside whilst still being close to facilities in neighbouring Fleet and Church Crookham.  \r\nWe have five classes across the school with four of them in mixed aged classes. Our dedicated staff are experienced and effective at supporting trainees. \r\n\r\nOur school improvement priorities have included developing ‘Reading for Pleasure’ which is well embedded into the ethos in all classes. We take a ‘mastery approach’ to Mathematics and use the ‘Mantle of the Expert’ across all cross-curricular learning to promote enquiry-based learning in authentic situations. We became a ‘Mantle’ training school in 2019. We are currently aiming to develop outcomes in writing using the research from ‘Writing for Pleasure’ while promoting good learning attitudes and a sense of wellbeing following the ongoing pandemic. \r\n\r\nWe are keen to help train the next generation of teachers and would welcome applications from interested candidates. \r\n\r\n\r\n\r\nThe PGCE Primary programme runs from September to the beginning of July. The programme is organised, with a balance of school and university based training which will support you on your learning journey.\r\n\r\nWhilst on the programme you will work in two different schools. In each placement you will work alongside experienced teachers and gradually assume more responsibility for planning and teaching as your training progresses. Throughout this process, you will be supported by school based mentors and a University tutor. Assessment is on-going and against the Teachers Standards.\r\n\r\nThe University based aspect of the programme comprises curriculum subjects and the wider professional role. We aim to develop the pedagogical and practical skills necessary to be an Outstanding teacher, as well enhancing subject knowledge.\r\n\r\n","personalQualities":"A good range of 'A' Levels or equivalent which demonstrate some relevance to National Curriculum subjects will also be of significance in the selection process.\r\n\r\nIn addition to an excellent academic background, we are looking for people who have a strong yet considered desire to work with young people, a positive, informed, open outlook, good communication skills, confidence and determination, an ability to relate well to others in a range of circumstances, interests, hobbies, a sense of humour, a lively enquiring mind and a willingness to become fully involved in all aspects of the Primary curriculum.\r\n","otherRequirements":"Before applying for a place on the course you must spend some time in a Local Education Authority primary school, familiarising yourself with current practice. An awareness of the Primary Curriculum approaches will help you considerably. Speak to teachers and consider the issues affecting the role of teachers and school. Compare and contrast children's needs, desires and attitudes across more than two Key stages to help you gain an awareness of children's perceptions and to help you make or ratify your choice of age range.\r\n\r\n","status":1,"createdAt":"2021-09-20T11:52:55.061Z","updatedAt":"2021-09-28T10:05:23.247Z","canSponsorStudentVisa":"yes","cycle":"2024"}
