{"id":"c22abb8e-e935-4e68-9b3d-ec21ea562aaf","name":"History","code":"2MR5","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"5a3609a0-5bbb-4377-b919-5d89932ab622","code":"V1","name":"History"}],"locations":[{"id":"209c0cb5-a713-4a0a-b003-8be5bbcc7f73","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"440755cf-fe06-4e4b-a5f5-a8d6fa2a5fec","code":"1F4","name":"The Priory Academy LSST"},"accreditedBody":{"id":"8dfae1fb-865e-4906-a241-4e872f0388cc","code":"25G","name":"Lincolnshire SCITT"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Candidates will be responsible to undertake an equivalency testing prior to starting the course in September and paying any associated costs to complete this.  Lincolnshire SCITT will give full support to applicants in recommending equivalency providers, if applicable, once an offer of a training place has been given.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Lincolnshire SCITT (School Centred Initial Teacher Training) works in partnership with schools across Lincolnshire to deliver high quality school-based primary and secondary teacher training. SCITT (core) and School Direct (fee paying and salaried) routes are offered and all trainees follow the same training programme irrespective of the route for which they apply.\r\n\r\nThrough a carefully sequenced and coherent framework of study trainees, within their phase of training, will gain the initial knowledge and skills to understand what it means to:\r\n• be a teacher • to teach • to teach a subject\r\n\r\nKey features of our programme include: \r\n*A training programme which blends the theoretical, academic and practical knowledge and skills of teaching\r\n*School-based training for the whole academic year\r\n*Training in a range of schools across Lincolnshire\r\n*A caring, nurturing and supportive programme for trainees\r\n*Dedicated mentor support\r\n*Strong partnership with the University of Lincoln, including access to the University’s facilities\r\n*Qualified Teacher Status (QTS) and a Post Graduate Certificate of Education (PGCE) with 60 masters’ credits on successful completion of the course.\r\n","interviewProcess":"Lincolnshire SCITT conducts a rigorous selection process in order to secure the best candidates for the teaching profession. Applicants successfully shortlisted will be invited to take part in a formal selection process involving schools and school leaders as well as SCITT personnel.\r\n\r\nThe selection activities may include: \r\n*A formal interview\r\n*A short presentation to a group of pupils within a specified area\r\n*A written task \r\n\r\nAs part of the selection process preferences for training schools will be discussed and school visits will be arranged giving the opportunity to meet school leaders, staff members and pupils.\r\n\r\nA formal offer of training will be made through DFE Apply for Teacher Training.  \r\n","howSchoolPlacementsWork":"Trainees are in their main training school for the full academic year gaining an insight into how a learning environment is created from the first day and building strong relationships with pupils and staff.  Trainees have a centralised training day each week of the academic year. \r\n\r\nIn addition, trainees expand their breadth of experience within a different school setting in the spring term.\r\n","personalQualities":"We are looking for trainee teachers who will inspire our students through their enthusiasm and belief in the intrinsic value of education \r\n* The ability to communicate knowledge to a range of learners\r\n* High levels of interpersonal skills\r\n* A flexible approach and an openness and willingness to learn\r\n* A solution focused approach to challenge\r\n* A determination/resilience to stay positive in the face of setbacks\r\n* Supportive and empathetic team player\r\n* The drive and ambition to become an outstanding teacher and future leader\r\n* Reflective on practice, with the ability to take and act upon advice\r\n","otherRequirements":"Throughout training fundamental English and mathematics proficiencies will need to be demonstrated.\r\n\r\nLTSA SCITT will also undertake the relevant safeguarding checks before training commences, including an Enhanced DBS check.  LTSA SCITT will give full support to applicants in completing these checks once an offer of a training place has been given.\r\n\r\n","status":1,"createdAt":"2021-07-06T10:51:56.398Z","updatedAt":"2021-09-28T10:57:27.432Z","canSponsorStudentVisa":"no","cycle":"2024"}
