{"id":"22ea80ce-8b4e-4f19-ac42-ae5f72885600","name":"Mathematics","code":"3DNZ","qualification":"qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"72345aa7-096c-488f-8649-085b8178cadb","code":"G1","name":"Mathematics"}],"locations":[{"id":"21a74a10-bbd3-49f6-b89e-a85cb2a9272e","name":"Alexandra Park School","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"6083f93b-c11f-4c8d-b2b0-2a119ecab189","code":"1JV","name":"North London New River Teaching Alliance"},"accreditedBody":{"id":"9188f17a-79c4-43a9-b459-4952815b739a","code":"M80","name":"Middlesex University"},"english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":null,"aboutCourse":"The PG Cert Teaching programme will introduce you to a range of perspectives on the mathematics classroom and enable you to develop a variety of approaches to address pupils' needs. You will learn how to make mathematics meaningful and to teach effectively. Middlesex mathematics educators have an international reputation for research and innovation and their research interests include curriculum, assessment and accountability in mathematics education; digital technologies in mathematics education; language and the learning of mathematics; identity in relation to learning mathematics; and social justice issues in mathematics education. The course introduces you to this research, prepares you for critical thinking about learning in general and learning mathematics in particular, and helps you to make connections between theoretical perspectives, research, policy and practice.  The course considers the purposes of mathematics education in the wider school context and in society as a whole, and looks at how mathematics can be made more relevant for pupils.\r\n\r\nBy the end of the course, you will be confident about teaching mathematics across the 11 to 16-age range. There will also be opportunities to develop some understanding of post-16 teaching. The course provides a strong basis for further professional development and leadership in mathematics education.\r\n\r\nYou will undertake two school placements during your training and these will be at two of our excellent alliance schools. One long placement and a shorter 6 week placement at a second school. Including: Alexandra Park School, Fortismere School, Woodside High School, Friern Barnet School, Park View School, Duke's Aldridge Academy, Highgate Wood School, Mill Hill County High and Christ's College Finchley.\r\n\r\nAll Middlesex Salaried School Direct students have full access to Middlesex student support services/facilities.\r\n\r\nThis programme awards the PG Cert Teaching award. The only difference is students apply directly via UCAS to the school or alliance. Candidates will still attend the same university lectures. [Please click here for more course information on the Middlesex University website](https://www.mdx.ac.uk/courses/postgraduate/teaching-pgcert)\r\n","interviewProcess":"Alexandra Park School is the lead school in the partnership and will be co-coordinating the recruitment process. This will involve attending an afternoon at one of the schools in the alliance and performing a variety of tasks, including some or all of the following: a short presentation, a lesson observation activity, a written feedback exercise, a group discussion activity and an interview.\r\n\r\nIf the placement is at another school in the partnership, staff from that school may also be involved. If you are successful at the school interview, our university partner will also invite you to an interview and this will also serve as an opportunity to learn more about the PGCert course, the tutors and the facilities at the University.","howSchoolPlacementsWork":"You will be trained in a highly supportive and aspirational environment and will develop the rigour, professional knowledge, understanding and skills necessary for the delivery of creative, purposeful and challenging teaching and learning. The placement schools you will be attending during your PGCE will be from across our alliance of good and outstanding schools. Prior to each of your two teaching placements, you will have several weeks of intensive preparation at university where you will study the theory and pedagogy behind becoming an outstanding teacher. \r\n\r\nYou can express a preference for a placement at a specific school in the partnership and we shall endeavour to match school placements with a particular student teacher's strengths. We do, however, have to take into consideration the ever-changing nature of the schools and work around curriculum and staffing changes. The aim of Schools Direct is to allow participants to train in schools which are local to them to increase recruitment opportunities upon completion of the course.\r\n\r\nWe aim to give all participants two contrasting experiences within their placements; whether that be with regards to student intake, uniform/non-uniform, post-16 education or a faith-based curriculum. You will be assigned a subject mentor from within your department at both of your placement schools and will attend regular Professional Studies sessions to equip you with the skills to plan and teach your lessons. Our mentors are excellent teachers who are required to undertake a rigorous training programme to develop their mentoring skills. You will also have many opportunities to observe and learn from other teachers throughout both placements.\r\n\r\nYou will also return to university at regular intervals throughout the year to continue your academic studies and discuss your experiences with your fellow participants. Successful completion of all aspects of the course will gain you the final award. \r\n\r\n","personalQualities":"","otherRequirements":"","status":2,"createdAt":"2021-07-21T16:10:43.941Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"Approximately £21,500"}
