{"id":"3f2f358f-3922-4611-ade3-4c81051f92f0","name":"Design and Technology","code":"3DVG","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"118fabd7-86d0-4a40-9e9a-e5c302abe59b","code":"DT","name":"Design and technology"}],"locations":[{"id":"21a74a10-bbd3-49f6-b89e-a85cb2a9272e","name":"Alexandra Park School","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"6083f93b-c11f-4c8d-b2b0-2a119ecab189","code":"1JV","name":"North London New River Teaching Alliance"},"accreditedBody":{"id":"049fe65f-08dc-4686-9ac8-606dce490128","code":"G56","name":"Goldsmiths, University of London"},"profPost":"PG","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":null,"aboutCourse":"Our aim is to develop teachers whose vision, imagination and professionalism takes them beyond the realities of current educational policy, and encourage them to continually seek to evolve new and better models of practice. The School Direct route into teaching enables participants to train to teach in schools which are local to them to avoid long commutes and to allow them to take an active role in the improvement of their own community. Previous participants have often been ex-students or parents of current students who recognise an opportunity for them to embark on a new career in their local area.\r\n\r\nGoldsmiths is our affiliated university who runs the PGCE (Secondary) course in Design & Technology. The curriculum includes working with resistant materials (product design), systems and control (electronics, CAD/CAM), textiles, and food technology. What unifies these is the subject of Design and the development of designing competence.\r\n\r\nYou'll be given the opportunity to specialise in one area to Key Stage 3 (age 11-14), and another to Key Stage 4 and beyond (age 14+). Key Stage 3 specialist fields are Materials; Textiles; Electronics and Communications Technology; and Food. The two Key Stage 4 specialist fields are Materials and Textiles. Through an integrated course that involves both a practical and theoretical approach, you'll be encouraged to reach your potential as a fully qualified teacher.\r\n\r\nThe school-based element of the PGCE course will involve you completing placements at two excellent schools from within our alliance. These include: Alexandra Park School, Fortismere School, Woodside High School, Friern Barnet School, Park View School, Duke's Aldridge Academy, Highgate Wood School, Mill Hill County High and Christ's College Finchley. You will split your time between the university and your school placements to enable you to support your practical experience with the robust research and pedagogical understanding needed to produce excellent results for students.\r\n","interviewProcess":"Alexandra Park School is the lead school in the partnership and will be co-ordinating the recruitment process. This will involve attending a morning or afternoon at one of the schools in the alliance and performing a variety of tasks, including some or all of the following: a short presentation, a lesson observation activity, a written feedback exercise, a group discussion activity and a panel interview. You will also have an opportunity to tour Alexandra Park School to gauge how our students and staff operate on an average day. \r\n\r\nIf you are successful at the school interview, our university partner Goldsmiths will also invite you to an interview and review your academic credentials. This day will also serve as an opportunity to learn more about the PGCE course, the tutors and the facilities at Goldsmiths. If the placement is at another school in the partnership, staff from that school will also be involved in processing your application and determining the outcome.","howSchoolPlacementsWork":"You will be trained in a highly supportive and aspirational environment and will develop the rigour, professional knowledge, understanding and skills necessary for the delivery of creative, purposeful and challenging teaching and learning. The placement schools you will be attending during your PGCE will be from across our alliance of good and outstanding schools. Prior to each of your two teaching placements you will have several weeks of intensive preparation at Goldsmiths where you will study the theory and pedagogy behind becoming an outstanding teacher. \r\n\r\nYou can express a preference for a placement at a specific school in the partnership and we shall endeavour to match school placements with a particular student teacher's strengths. We do, however, have to take into consideration the ever-changing nature of the schools and work around curriculum and staffing changes. The aim of Schools Direct is to allow participants to train in schools which are local to them to increase recruitment opportunities upon completion of the course.\r\n\r\nWe aim to give all participants two contrasting experiences within their placements; whether that be with regards to student intake, uniform/non-uniform, post-16 education or a faith-based curriculum. You will be assigned a subject mentor from within your department at both of your placement schools and will attend regular Professional Studies sessions to equip you with the skills to plan and teach your lessons. Our mentors are excellent teachers who are required to undertake a rigorous training programme to develop their mentoring skills. You will also have ample opportunity to observe and learn from other teachers throughout both placements.\r\n\r\nYou will also return to Goldsmiths are regular intervals throughout the year to continue your academic studies and discuss your experiences with your fellow participants. Successful completion of all aspects of the course will gain you the award of Postgraduate Certificate in Education (PGCE) which also carries 60 masters level credits that may be used towards a subsequent masters degree.  The course also leads to the award of QTS (Qualified Teacher Status).\r\n","personalQualities":"","otherRequirements":"","status":2,"createdAt":"2021-07-21T16:10:44.108Z","canSponsorSkilledWorkerVisa":"yes","cycle":"2024","salaryDetails":"Approximately £21,500 "}
