{"id":"63ec1814-1ada-4504-abe0-32a0fabb8934","name":"Computing","code":"3DLM","qualification":"qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"e6be6a9c-8696-4b88-8fbd-1ba1bef1b6fc","code":"11","name":"Computing"}],"locations":[{"id":"21a74a10-bbd3-49f6-b89e-a85cb2a9272e","name":"Alexandra Park School","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"6083f93b-c11f-4c8d-b2b0-2a119ecab189","code":"1JV","name":"North London New River Teaching Alliance"},"accreditedBody":{"id":"9188f17a-79c4-43a9-b459-4952815b739a","code":"M80","name":"Middlesex University"},"english":"3","maths":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"\r\nThe PGCert Computing will equip you to teach a range of courses up to and including A levels. During the course you will develop the skills required to be a specialist subject teacher capable of designing and delivering excellent lessons in both Computing and ICT.\r\n\r\nYou will be supported by tutors with many years of experience as classroom teachers, heads of department and subject advisory teachers. The course is carefully structured to support you through the early stages of observing and helping in classrooms, through to planning and delivering your own lessons. School-based staff will ensure that the teaching demands placed on you increase in line with your growing confidence, but you will always have ready access to support from your school mentor and university tutor.\r\n\r\nThe Computing with ICT PGCE benefits each year from a diverse range of students with a good gender balance, students of all ages and an ethnic diversity reflecting London's population. A key theme is collaboration and sharing and the course offers the opportunity to become a member of a supportive team of new teachers who often continue to work with each other after the end of the course.\r\n\r\nYou will undertake two school placements during your training and these will be at two of our excellent alliance schools. Including: Alexandra Park School, Fortismere School, Woodside High School, Friern Barnet School, Park View School, Duke's Aldridge Academy, Highgate Wood School, Mill Hill County High and Christ's College Finchley.\r\n\r\nMiddlesex is a global leader in teacher education.  Their programmes are recognised by Ofsted as “outstanding” in every criterion across Primary and Secondary Education. All Middlesex School Direct students have full access to Middlesex student support services and facilities.\r\n\r\nThis programme follows the exact same structure as the PGCert route and awards the PGCERT+QTS. The only difference is that students apply directly via UCAS to the school or alliance. Candidates will still attend the same university lectures.\r\n\r\n\r\n","interviewProcess":"Alexandra Park School is the lead school in the partnership and will be co-coordinating the recruitment process. This will involve attending an afternoon at one of the schools in the alliance and performing a variety of tasks, including some or all of the following: a short presentation, a lesson observation activity, a written feedback exercise, a group discussion activity and an interview.\r\n\r\nIf the placement is at another school in the partnership, staff from that school may also be involved. If you are successful at the school interview, our university partner will also invite you to an interview and this will also serve as an opportunity to learn more about the PGCert course, the tutors and the facilities at the University.\r\n","howSchoolPlacementsWork":"You will be trained in a highly supportive and aspirational environment and will develop the rigour, professional knowledge, understanding and skills necessary for the delivery of creative, purposeful and challenging teaching and learning. The placement schools you will be attending during your PGCE will be from across our alliance of good and outstanding schools. Prior to each of your two teaching placements, you will have several weeks of intensive preparation at university where you will study the theory and pedagogy behind becoming an outstanding teacher. \r\n\r\nYou can express a preference for a placement at a specific school in the partnership and we shall endeavour to match school placements with a particular student teacher's strengths. We do, however, have to take into consideration the ever-changing nature of the schools and work around curriculum and staffing changes. The aim of Schools Direct is to allow participants to train in schools which are local to them to increase recruitment opportunities upon completion of the course.\r\n\r\nWe aim to give all participants two contrasting experiences within their placements; whether that be with regards to student intake, uniform/non-uniform, post-16 education or a faith-based curriculum. You will be assigned a subject mentor from within your department at both of your placement schools and will attend regular Professional Studies sessions to equip you with the skills to plan and teach your lessons. Our mentors are excellent teachers who are required to undertake a rigorous training programme to develop their mentoring skills. You will also have many opportunities to observe and learn from other teachers throughout both placements.\r\n\r\nYou will also return to university at regular intervals throughout the year to continue your academic studies and discuss your experiences with your fellow participants. Successful completion of all aspects of the course will gain you the final award. \r\n","personalQualities":"","otherRequirements":"","status":2,"createdAt":"2021-07-21T16:10:43.661Z","canSponsorStudentVisa":"no","cycle":"2024"}
