{"id":"698aade0-a559-4373-b116-a3c718b7cd04","name":"Art and Design","code":"25G7","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"d461a678-3335-4ca2-9616-1dc479d31a49","code":"W1","name":"Art and design"}],"locations":[{"id":"21a74a10-bbd3-49f6-b89e-a85cb2a9272e","name":"Alexandra Park School","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"6083f93b-c11f-4c8d-b2b0-2a119ecab189","code":"1JV","name":"North London New River Teaching Alliance"},"accreditedBody":{"id":"7f11aaed-7c3e-42c5-af7a-023d33b45fa3","code":"U80","name":"UCL, University College London"},"profPost":"PG","english":"3","maths":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Please note: Information in the sections below may be subject to amendments / adjustments to meet Covid-19 requirements.\r\n\r\nThis challenging and forward-looking PGCE course will encourage you to relate art, craft and design education to contemporary art practice. It has a strong reputation for promoting innovation in education theory, practice and policy. The PGCE course provides excellent studio space and facilities, including a computing suite where you will learn about how information and communications technology (ICT) is used in art and design education.\r\n\r\nThrough seminars and studio-based activities, you will study the concepts, processes and skills of art, craft and design. You will share your knowledge and understanding with other student teachers, and consider how it relates to the secondary curriculum. Towards the end of the PGCE, you will build on your own practice by initiating a curriculum development project, and at a final exhibition, you will be able to display pieces of your work that represent your personal philosophy for art and design education.\r\n\r\nYour personal tutor will lead seminars and provide individual guidance, and a lecture programme featuring nationally and internationally renowned speakers will address contemporary issues in education. The programme emphasises the relevance of contemporary art, craft and design practice in understanding different cultural traditions. The course has strong links and partnerships with galleries and museums, which will enable you to analyse and reflect on current debates.\r\n\r\nYou will undertake two school placements during your PGCE training and these will be at two of our excellent alliance schools. Including: Alexandra Park School, Fortismere School, Woodside High School, Friern Barnet School, Park View School, Duke's Aldridge Academy, Highgate Wood School, Mill Hill County High and Christ's College Finchley.\r\n\r\nUCL Institute of Education (IOE) is a global leader in teacher education.  Their programmes are recognised by Ofsted as “outstanding” in every criterion across Primary and Secondary Education.\r\nAll UCL School Direct students have full access to UCL student support services and facilities.\r\n\r\nThis programme follows the exact same structure as the PGCE route and awards the PGCE and QTS. The only difference is that students apply directly via UCAS to the school or alliance and are recruited to a vacancy at that alliance. They will still attend the same university lectures.\r\n\r\n[Click here for to search for full details of the Art and Design course](https://www.ucl.ac.uk/ioe/courses/teacher-training/art-design-pgce)\r\n","interviewProcess":"Alexandra Park School is the lead school in the partnership and will be coordinating the recruitment process. This will involve performing a variety of tasks, including: a short presentation, a lesson activity, a written feedback exercise, a group discussion activity and an interview.\r\n\r\nIf the placement is at another school in the partnership, staff from that school will also be involved. \r\n\r\nIf you are successful at the school interview, our university partner will also invite you to an interview. This will also serve as an opportunity to learn more about the PGCE course, the tutors and the facilities at the Institute.\r\n","howSchoolPlacementsWork":"You will be trained in a supportive and aspirational environment and will develop the rigour, professional knowledge, understanding and skills necessary for the delivery of creative, purposeful and challenging teaching and learning.\r\n\r\nMost of the training will be delivered by expert teachers in the partnership schools. This will be enhanced by studies at the university.\r\n\r\nYou will be assigned to one of the schools in the partnership to do a teaching placement in the autumn term. In the spring term, you will do a second teaching placement at another of our partner schools. All schools have comprehensive intakes and you will get experience of working with young people of all abilities. At least one of your placements will give you access to post-16 learners.\r\n\r\nYou can express a preference for a placement at a specific school in the partnership and we will endeavour to meet your request. You will have full access to the Institute of Education. The course is identical to the PGCE so you will attend the exact same lectures. Prior to each of your two teaching placements you will have two weeks' intensive preparation at the university. As with the PGCE, much of your training will take place within the school itself.\r\n\r\nYou will be assigned two mentors from the staff of your assigned school, one from your subject area and one from the senior leadership team. From the beginning, you will be treated like a member of staff and will attend staff meetings and development days. Our mentors are outstanding teachers but they are required to undertake a rigorous training programme to develop their mentoring skills. \r\n\r\nSuccessfully completing all aspects of the course will gain you the award of Postgraduate Certificate in Education (PGCE), which also carries 60 master level credits that may be used towards a subsequent Masters degree.  The course also leads to the award of QTS (Qualified Teacher Status).\r\n","personalQualities":"We are looking for ambitious trainee teachers who are passionate and enthusiastic about their subject and have a desire to share that with young people of all abilities in the secondary age range. This will be demonstrated by meaningful experience of working with young people of this age. This does not need to be paid work but might be helping with a sports team, drama group or youth club. We would like you to have done some observation in a classroom or you may even have worked in a school.\r\n","otherRequirements":"","status":2,"createdAt":"2021-07-06T10:46:50.954Z","canSponsorStudentVisa":"yes","cycle":"2024"}
