{"id":"6f91ff96-00ca-438f-8198-e61859e50a4f","name":"Chemistry","code":"3DLV","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"912d4fb4-761b-42e9-8dc6-e968b791ea4e","code":"F1","name":"Chemistry"}],"locations":[{"id":"21a74a10-bbd3-49f6-b89e-a85cb2a9272e","name":"Alexandra Park School","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"6083f93b-c11f-4c8d-b2b0-2a119ecab189","code":"1JV","name":"North London New River Teaching Alliance"},"accreditedBody":{"id":"049fe65f-08dc-4686-9ac8-606dce490128","code":"G56","name":"Goldsmiths, University of London"},"profPost":"PG","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":null,"aboutCourse":"The Chemistry Salaried PGCE course will help you to develop the professional skills and knowledge you need to teach all aspects of science to pupils at least up to age 16, as well as Chemistry to pupils aged up to 18. \r\n\r\nThe course is committed to creative approaches to teaching science, and you will be encouraged to develop resources during the programme. The experienced tutors at Goldsmiths have previously been classroom teachers and heads of school science departments, and have worked in industry. They are actively involved in science education research and work on national curriculum development. \r\n\r\nYou will acquire a critical understanding of current debates and issues relating to science education, particularly physics, and the tutors will guide and support you in developing your subject knowledge. You are expected to engage with reading and research in science education and to regularly reflect upon your own progress.\r\n\r\nYou will undertake two school placements during your PGCE training and these will be at two of our excellent alliance schools. Including: Alexandra Park School, Fortismere School, Woodside High School, Friern Barnet School, Park View School, Duke’s Aldridge Academy, Highgate Wood School, Mill Hill County High and Christ’s College Finchley.\r\n\r\nYou will split your time between the university and your school placements to enable you to support your practical experience with the robust research and pedagogical understanding needed to produce excellent results for students.\r\n\r\n[Click here for full details of the course]( https://www.gold.ac.uk/pgce/secondary-science/)","interviewProcess":"Alexandra Park School is the lead school in the partnership and will be coordinating the recruitment process. This will involve performing a variety of tasks, including: a short presentation, a lesson activity, a written feedback exercise, a group discussion activity and an interview.\r\n\r\nIf the placement is at another school in the partnership, staff from that school will also be involved.\r\n\r\nIf you are successful at the school interview, our university partner Goldsmiths will also invite you to an interview. This will also serve as an opportunity to learn more about the PGCE course, the tutors and the facilities at the University.","howSchoolPlacementsWork":"YYou will be trained in a highly supportive and aspirational environment and will develop the rigour, professional knowledge, understanding and skills necessary for the delivery of creative, purposeful and challenging teaching and learning.\r\n\r\nThe placement schools you will be attending during your PGCE will be from across our alliance of good and outstanding schools. Prior to each of your two teaching placements you will have several weeks of intensive preparation at Goldsmiths where you will study the theory and pedagogy behind becoming an outstanding teacher.\r\n\r\nYou can express a preference for a placement at a specific school in the partnership and we shall endeavour to match school placements with a particular student teacher’s strengths. We do, however, have to take into consideration the ever-changing nature of the schools and work around curriculum and staffing changes. The aim of Schools Direct is to allow participants to train in schools which are local to them to increase recruitment opportunities upon completion of the course.\r\n\r\nWe aim to give all participants two contrasting experiences within their placements; whether that be with regards to student intake, uniform/non-uniform, post-16 education or a faith-based curriculum. You will be assigned a subject mentor from within your department at both of your placement schools and will attend regular Professional Studies sessions to equip you with the skills to plan and teach your lessons. Our mentors are excellent teachers who are required to undertake a rigorous training programme to develop their mentoring skills. You will also have ample opportunity to observe and learn from other teachers throughout both placements.\r\n\r\nYou will also return to Goldsmiths at regular intervals throughout the year to continue your academic studies and discuss your experiences with your fellow participants. Successful completion of all aspects of the course will gain you the award of Postgraduate Certificate in Education (PGCE) which also carries 60 masters level credits that may be used towards a subsequent masters degree. The course also leads to the award of QTS (Qualified Teacher Status).","personalQualities":"","otherRequirements":"","status":2,"createdAt":"2021-07-21T16:10:43.747Z","canSponsorSkilledWorkerVisa":"yes","cycle":"2024","salaryDetails":"Approximately £21,500 "}
