{"id":"7460c948-1cb8-41f7-aa05-1cb8e42e9157","name":"Mathematics","code":"37QZ","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"72345aa7-096c-488f-8649-085b8178cadb","code":"G1","name":"Mathematics"}],"locations":[{"id":"21a74a10-bbd3-49f6-b89e-a85cb2a9272e","name":"Alexandra Park School","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"6083f93b-c11f-4c8d-b2b0-2a119ecab189","code":"1JV","name":"North London New River Teaching Alliance"},"accreditedBody":{"id":"049fe65f-08dc-4686-9ac8-606dce490128","code":"G56","name":"Goldsmiths, University of London"},"profPost":"PG","english":"2","maths":"2","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"This programme is a pathway into one of the most challenging, fascinating and rewarding careers there is: teaching mathematics at Secondary level. London secondary schools need good maths teachers. This exciting and demanding programme will prepare you to become an effective and high-quality maths teacher, with a particular focus on the unique demands of working in a multi-ethnic London comprehensive school. We require you to be well-organised, resilient, tolerant and understanding of the attitudes of today’s teenagers, and with a commitment to young people as well as to your subject. \r\n\r\nThe PGCE will introduce you to a range of perspectives on the mathematics classroom and enable you to develop a variety of approaches to address pupils' needs. You will learn how to make mathematics meaningful and to teach effectively. The Goldsmith's mathematics educators have an international reputation for research and innovation and their research interests include curriculum, assessment and accountability in mathematics education; digital technologies in mathematics education; language and the learning of mathematics; identity in relation to learning mathematics; and social justice issues in mathematics education. The course introduces you to this research, prepares you for critical thinking about learning in general and learning mathematics in particular, and helps you to make connections between theoretical perspectives, research, policy and practice.  The course considers the purposes of mathematics education in the wider school context and in society as a whole, and looks at how mathematics can be made more relevant for pupils.\r\n\r\nBy the end of the course, you will be confident about teaching mathematics across the 11 to 16 age range. There will also be opportunities to develop some understanding of post-16 teaching. The PGCE provides a strong basis for further professional development and leadership in mathematics education.\r\n\r\nThe school-based element of the PGCE course will involve you completing placements at two excellent schools from within our alliance. These include: Alexandra Park School, Fortismere School, Woodside High School, Friern Barnet School, Parkview Academy, Greig City Academy, Duke’s Aldridge Academy, Mill Hill County High School and Highgate Wood School. You will split your time between the university and your school placements to enable you to support your practical experience with the robust research and pedagogical understanding needed to produce excellent results for students.\r\n\r\n\r\n[Click here for full details of the course](https://www.gold.ac.uk/pgce/secondary-mathematics/)\r\n","interviewProcess":"Alexandra Park School is the lead school in the partnership and will be co-ordinating the recruitment process. This will involve attending a morning or afternoon at one of the schools in the alliance and performing a variety of tasks, including some or all of the following: a short presentation, a lesson observation activity, a written feedback exercise, a group discussion activity and a panel interview. You will also have an opportunity to tour Alexandra Park School to gauge how our students and staff operate on an average day. \r\n\r\nIf you are successful at the school interview, our university partner Goldsmiths will also invite you to an interview and review your academic credentials. This day will also serve as an opportunity to learn more about the PGCE course, the tutors and the facilities at Goldsmiths. If the placement is at another school in the partnership, staff from that school will also be involved in processing your application and determining the outcome.","howSchoolPlacementsWork":"You will be trained in a highly supportive and aspirational environment and will develop the rigour, professional knowledge, understanding and skills necessary for the delivery of creative, purposeful and challenging teaching and learning. The placement schools you will be attending during your PGCE will be from across our alliance of good and outstanding schools. Prior to each of your two teaching placements you will have several weeks of intensive preparation at Goldsmiths where you will study the theory and pedagogy behind becoming an outstanding teacher. \r\n\r\nYou can express a preference for a placement at a specific school in the partnership and we shall endeavour to match school placements with a particular student teacher's strengths. We do, however, have to take into consideration the ever-changing nature of the schools and work around curriculum and staffing changes. The aim of Schools Direct is to allow participants to train in schools which are local to them to increase recruitment opportunities upon completion of the course.\r\n\r\nWe aim to give all participants two contrasting experiences within their placements; whether that be with regards to student intake, uniform/non-uniform, post-16 education or a faith-based curriculum. You will be assigned a subject mentor from within your department at both of your placement schools and will attend regular Professional Studies sessions to equip you with the skills to plan and teach your lessons. Our mentors are excellent teachers who are required to undertake a rigorous training programme to develop their mentoring skills. You will also have ample opportunity to observe and learn from other teachers throughout both placements.\r\n\r\nYou will also return to Goldsmiths are regular intervals throughout the year to continue your academic studies and discuss your experiences with your fellow participants. Successful completion of all aspects of the course will gain you the award of Postgraduate Certificate in Education (PGCE) which also carries 60 masters level credits that may be used towards a subsequent masters degree.  The course also leads to the award of QTS (Qualified Teacher Status).\r\n","personalQualities":"We are looking for ambitious trainee teachers who are passionate and enthusiastic about maths and have a desire to share that with young people of all abilities in the secondary age range. It is essential that you enjoy mathematics yourself and that you can explain mathematics in a clear way to stimulate pupils' interest and self-confidence. It is beneficial if you have some experience of working with young people. This does not need to be paid work but might be helping with a sports team, drama group, youth club or observation of lessons.\r\n","otherRequirements":"Normally we expect you to have a degree in mathematics, or with substantial mathematics content (for example, mechanical engineering or physics). We also consider applicants with a degree with some mathematics content; for example, statistics, chemistry and some economics or accountancy degrees. If you have a degree in a subject highly relevant to education such as psychology, philosophy or sociology, you are expected to have a grade A in mathematics at A level. Some applicants may be required to do a Subject Knowledge Enhancement course.\r\n","status":2,"createdAt":"2021-07-21T16:10:43.111Z","canSponsorStudentVisa":"yes","cycle":"2024"}
