{"id":"cb6730b9-b548-43cd-9e59-ea8091fa5062","name":"Geography","code":"2VB3","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3f47e67b-7fa5-4947-a5a0-74d528cd2a87","code":"F8","name":"Geography"}],"locations":[{"id":"21a74a10-bbd3-49f6-b89e-a85cb2a9272e","name":"Alexandra Park School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"6083f93b-c11f-4c8d-b2b0-2a119ecab189","code":"1JV","name":"North London New River Teaching Alliance"},"accreditedBody":{"id":"7f11aaed-7c3e-42c5-af7a-023d33b45fa3","code":"U80","name":"UCL, University College London"},"profPost":"PG","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"If you have an overseas qualification it must be of an equivalent standard from a recognised higher education institution. UCL does not accept third-class degrees for teacher training programmes.\n\nThe equivalence of all overseas degrees is verified by UCL according to their requirements for international qualifications. This requirement is in addition to any assessments by NARIC.","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"UCL does accept the following in place of GCSEs:-\n* iGCSE in English Language and Maths\n\nUCL does NOT accept the following in place of GCSEs:-\n* iGCSE for ‘English as a second language’\n* iGCSE or GCSE “applied” or “additional” subjects\n* Functional Skills\n* BTECs\n* Access courses\n\nApplicants who do not hold the relevant GCSEs will need to demonstrate an equivalent standard by completing tests with either of the following testing organisations:-\n\n* [Equivalency Testing](http://www.equivalencytesting.com/) \n* [A Star Equivalency](https://astarequivalency.co.uk/)  \n\nUCL requires at least grade 5 and does not accept equivalency tests from any other testing organisations.\n \nFor Maths, equivalency tests in Mathematics Foundation or Mathematics Higher are accepted.  \n\n[Click here for full details of the entry requirements for the Geography course](https://www.ucl.ac.uk/ioe/courses/teacher-training/geography-pgce)","courseLength":"OneYear","feesUK":9250,"aboutCourse":"On completion of the school direct Geography course, you will gain a PGCE and QTS (Qualified Teacher Status), equipping you to teach geography in secondary schools. During the PGCE, you will be supported to tackle the at once practical and conceptual questions of:\r\n* Who are the children I teach?\r\n* Why teach geography? \r\n* What geography should I teach? \r\n* How should I teach it?\r\n\r\nGeographical knowledge is dynamic and the world is constantly changing. As a geography teacher, you will take responsibility for introducing children to the ideas and methods of geography, helping them to investigate people, places and processes. You will support children to better understand the complexities and wonders of the Earth, enabling them in both their education and their everyday lives\r\n\r\nYou will be tutored by experienced academics who are researching and teaching in geography education at the IOE. This course is distinctive in helping you engage in current debates, issues and ideas as well as practical strategies for school geography teaching, so you can develop critical-thinking and leadership as geography teacher who can shape change in a curriculum for the future. University teaching includes debates, lectures, seminars, workshops, your own presentations, tutorials, structured independent tasks and a mix of online and face to face teaching, including fieldwork in London and the Lake District and teaching with GIS. \r\n\r\nThe course assessment is developmental for you. There is no written exam but you will undertake two Master’s level modules. \r\n\r\nYou will develop knowledge and understanding of the national curriculum, its targets and content, together with an understanding of wider statutory requirements. You will advance your teaching and classroom management skills to a high level, and enhance your capacity for self-reflection and further professional development. \r\n\r\nYou will undertake two school placements during your training and these will be at two of our excellent alliance schools. \r\n\r\nUCL IOE is a global leader in teacher education.  Their programmes are recognised by Ofsted as “outstanding” in every criterion across Primary and Secondary Education. All school direct trainees have full access to UCL student support services/facilities.\r\n\r\nThe school direct programme follows the exact same structure as the PGCE route and awards the PGCE and QTS. The only difference is students apply directly to the NRTA via the DfE 'Apply' service.  Candidates will still attend the same university lectures.\r\n\r\n[Click here for full details of the Geography course] (https://www.ucl.ac.uk/ioe/courses/teacher-training/geography-pgce)\r\n","interviewProcess":"Alexandra Park School is the lead school in the alliance and is responsible for coordinating the recruitment process. \r\n\r\nAll applications received are reviewed by the NRTA team.  If you are shortlisted, you will be invited to an interview and asked to perform a variety of tasks, which may include: a short presentation, a lesson activity, a literacy and maths exercise, a group discussion activity, and a panel interview.  The interview panel may include staff from partner schools as well as staff from Alexandra Park School.\r\n\r\nIf you are successful at the school interview, UCL IOE will invite you to an interview. This will also serve as an opportunity to learn more about the PGCE course, the tutors and the facilities at the Institute.\r\n","howSchoolPlacementsWork":"On the school direct course, you will be trained in a supportive and aspirational environment.  You will develop the rigour, professional knowledge and skills necessary for the delivery of creative, purposeful and challenging teaching and learning.\r\n\r\nMost of the hands-on training will be delivered by expert teachers in our alliance of schools and this will be enhanced by studies at UCL IOE.\r\n\r\nYou will be assigned two school placements at two of our partner schools. The first being in the autumn term and the second in the spring term. All schools have comprehensive intakes and you will get experience of working with young people of all abilities. At least one of your placements will give you access to post-16 learners.\r\n\r\nYou will have full access to UCL IOE during your training. The school direct course format is identical to the PGCE offered by UCL IOE, so you will attend the same lectures and spend the same amount of time in schools. Prior to each of your two teaching placements, you will have approximately three weeks intensive preparation at university. As with the PGCE, much of your training will take place within the school itself.\r\n\r\nYou will be assigned two mentors from the staff of your assigned school, one from your subject area and one from the senior leadership team. From the beginning, you will be treated like a member of staff and will attend staff meetings and development days. Our mentors are outstanding teachers but they are required to undertake a rigorous training programme to develop their mentoring skills. \r\n\r\nSuccessfully completing all aspects of the course will gain you the award of Postgraduate Certificate in Education (PGCE), which also carries 60 master level credits that may be used towards a subsequent Master’s degree.  The course also leads to the award of QTS (Qualified Teacher Status).\r\n","personalQualities":"We are looking for ambitious trainee teachers who are passionate and enthusiastic about their subject and have a desire to share that with young people of all abilities in the secondary school age range. \r\n\r\nThis might be demonstrated by meaningful experience of working with young people in this age group. This does not need to be paid work but could be helping with a sports team, drama group or youth club. Ideally, we would like you to have done some observation in a classroom or you may even have worked in a school.\r\n","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:46:51.273Z","updatedAt":"2021-10-04T13:09:29.702Z","canSponsorStudentVisa":"yes","cycle":"2024"}
