{"id":"d9b415c3-41f4-490b-ae12-f1e941a4e48e","name":"Drama","code":"37R2","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"69052223-ca45-4781-a8d3-cb92447a6d78","code":"13","name":"Drama"}],"locations":[{"id":"21a74a10-bbd3-49f6-b89e-a85cb2a9272e","name":"Alexandra Park School","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"6083f93b-c11f-4c8d-b2b0-2a119ecab189","code":"1JV","name":"North London New River Teaching Alliance"},"accreditedBody":{"id":"049fe65f-08dc-4686-9ac8-606dce490128","code":"G56","name":"Goldsmiths, University of London"},"profPost":"PG","english":"2","maths":"2","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Please note: Information in the sections below may be subject to amendments / adjustments to meet Covid-19 requirements.\r\n\r\nOur aim is to develop teachers whose vision, imagination and professionalism takes them beyond the realities of current educational policy, and encourage them to continually seek to evolve new and better models of practice. The School Direct route into teaching enables participants to train to teach in schools which are local to them to avoid long commutes and to allow them to take an active role in the improvement of their own community. Previous participants have often been ex-students or parents of current students who recognise an opportunity for them to embark on a new career in their local area.\r\n\r\nGoldsmiths is our affiliated university who runs the PGCE (Secondary) course in Drama. This programme is designed to create teachers who will operate as artists in education, empowering young people through Drama, and encourage you to reach your full potential as a qualified teacher.\r\n\r\nThe programme integrates process and performance, teaching both through and about the art form. In this way, you’ll be able to benefit from a whole host of transferable skills, enabling you to develop personally and professionally through both practical and theoretical enquiry. As well as focusing on the Drama curriculum in the first three years of secondary education, the programme covers Drama and performing arts courses for pupils from 14 to 19. We also pay special attention to the relationship between English and Drama in the National Curriculum. Candidates invited to interview are established practitioners in their own right with industry experience. This may vary widely from stage management, playwriting or design to acting in television, film or theatre.\r\n\r\nYou will undertake two school placements during your PGCE training and these will be at two of our excellent alliance schools. Including: Alexandra Park School, Fortismere School, Woodside High School, Friern Barnet School, Park View School, Duke’s Aldridge Academy, Highgate Wood School, Mill Hill County High and Christ’s College Finchley.\r\n\r\nYou will split your time between the university and your school placements to enable you to support your practical experience with the robust research and pedagogical understanding needed to produce excellent results for students.\r\n\r\n[Click here for full details of the course](https://www.gold.ac.uk/pgce/secondary-drama/)\r\n","interviewProcess":"Alexandra Park School is the lead school in the partnership and will be coordinating the recruitment process. This will involve performing a variety of tasks, including: a short presentation, a lesson activity, a written feedback exercise, a group discussion activity and an interview.\r\n\r\nIf the placement is at another school in the partnership, staff from that school will also be involved. \r\n\r\nIf you are successful at the school interview, our university partner Goldsmiths will also invite you to an interview. This will also serve as an opportunity to learn more about the PGCE course, the tutors and the facilities at the University.","howSchoolPlacementsWork":"You will be trained in a highly supportive and aspirational environment and will develop the rigour, professional knowledge, understanding and skills necessary for the delivery of creative, purposeful and challenging teaching and learning. \r\n\r\nThe placement schools you will be attending during your PGCE will be from across our alliance of good and outstanding schools. Prior to each of your two teaching placements you will have several weeks of intensive preparation at Goldsmiths where you will study the theory and pedagogy behind becoming an outstanding teacher. \r\n\r\nYou can express a preference for a placement at a specific school in the partnership and we shall endeavour to match school placements with a particular student teacher's strengths. We do, however, have to take into consideration the ever-changing nature of the schools and work around curriculum and staffing changes. The aim of Schools Direct is to allow participants to train in schools which are local to them to increase recruitment opportunities upon completion of the course.\r\n\r\nWe aim to give all participants two contrasting experiences within their placements; whether that be with regards to student intake, uniform/non-uniform, post-16 education or a faith-based curriculum. You will be assigned a subject mentor from within your department at both of your placement schools and will attend regular Professional Studies sessions to equip you with the skills to plan and teach your lessons. Our mentors are excellent teachers who are required to undertake a rigorous training programme to develop their mentoring skills. You will also have ample opportunity to observe and learn from other teachers throughout both placements.\r\n\r\nYou will also return to Goldsmiths at regular intervals throughout the year to continue your academic studies and discuss your experiences with your fellow participants. Successful completion of all aspects of the course will gain you the award of Postgraduate Certificate in Education (PGCE) which also carries 60 masters level credits that may be used towards a subsequent masters degree.  The course also leads to the award of QTS (Qualified Teacher Status).","personalQualities":"We are looking for ambitious trainee teachers who are passionate and enthusiastic about Drama and have a desire to share that with young people of all abilities in the secondary age range. \r\n\r\nThis will be demonstrated by meaningful experience of working with young people of this age. This does not need to be paid work but might be helping with a sports team, drama group or youth club. \r\n\r\nWe would like you to have done some observation in a classroom or you may even have worked in a school.","otherRequirements":"\r\n","status":2,"createdAt":"2021-07-06T10:46:51.546Z","canSponsorStudentVisa":"yes","cycle":"2024"}
