{"id":"a0f96066-01db-4223-b9cd-073b3bc30e9c","name":"Geography","code":"2ZQJ","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3f47e67b-7fa5-4947-a5a0-74d528cd2a87","code":"F8","name":"Geography"}],"locations":[{"id":"749791ff-68f7-4c8c-a901-e03a95706238","name":"Alcester Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"7a26c04d-e65f-4b05-b59f-4ef15fcb23f3","name":"Henley in Arden School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"cece6329-817e-40ed-9771-83cf0f2f6d2c","name":"Studley High School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"ab523fab-61dc-4893-8d6b-f8c74813e79a","name":"Stratford upon Avon School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"a0cda2a8-3f0e-4531-bcdc-68051446e421","name":"King Edward VI School for Boys, Stratford","isPublished":"Y","status":"R","vacancies":"F"},{"id":"c4394869-b614-470b-a3fa-629db334733a","name":"Alcester Grammar School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"33dc8b1a-ce5f-4bae-901e-aac843e1e97c","name":"Stratford Girls' Grammar School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"41882e18-1982-4a2b-810a-7b8ced6d74ae","name":"Shipston High School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"406ae1ab-7a0a-4254-b930-79e8fcd509a3","code":"2EB","name":"Shires Teaching Alliance"},"accreditedBody":{"id":"6019b3ce-f2f6-4b0e-b2a9-5813d74c4d54","code":"W80","name":"University of Worcester"},"profPost":"PG","degreeGrade":"9","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feeDetails":"For further information, please refer to the [University of Worcester fee section](https://www.worcester.ac.uk/courses/pgce-school-direct-secondary.html#section-6)\r\n","financialSupport":"For further information, please refer to the [University of Worcester fee section](https://www.worcester.ac.uk/courses/pgce-school-direct-secondary.html#section-6)\r\n","aboutCourse":"The School Direct Programme followed at the Shires Teaching School Alliance is aimed at those who want training to be based in a school where they can be fully immersed in the life of a teacher from day one. You will be part of a team from the very start, receiving support from experienced teachers and mentors. \r\n\r\nYou will also spend extended time in at least one other contrasting school. These placements will be complemented with experience days in other school settings, across at least two key stages, in order to gain the broad experience and knowledge required to become a qualified teacher. \r\n\r\nOur Professional Studies programme includes sessions taught by outstanding practitioners from across the alliance. From ‘managing well-being’ to ‘making marking matter’, you will experience training sessions that equip you to be a highly effective practitioner. \r\n\r\nWe work directly with the University of Worcester to deliver this course, which leads to a postgraduate certificate in education (PGCE) and qualified teacher status (QTS). \r\n\r\nYou will benefit from a comprehensive induction as well as personalised school mentoring and University Tutor support throughout the programme. As well as the time in school, there are taught days at the University with subject specialist tutors, which will link theory and classroom practice and support research into written assignments.\r\nYou will be assessed on the basis of coursework including 2 written assignments and your teaching practice. To gain qualified teacher status (QTS) you must demonstrate that you can meet the [Teachers' Standards]( https://www.gov.uk/government/publications/teachers-standards). The standards set a clear baseline of expectations for the professional practice and conduct of teachers, from the point of qualification.\r\nTrainees are required to monitor and direct their own progress, with the support of mentors and tutors. The teaching experience assessment is based on a portfolio which allows you to monitor your own developing competence and from this reflection, set targets to improve teaching and learning in your classroom. \r\n","interviewProcess":"We interview all shortlisted candidates prior to making an offer to train with us. If you are invited to interview you will be expected to be familiar with key issues and developments in secondary schools - especially those in your subject area. Your interview will take place within our alliance schools and will consist of small group or class teaching, subject-specific task and a presentation.  An interview will also take place at the University of Worcester to audit your subject knowledge. As part of the subject specific criteria, you will be asked to complete a written task, as well as being assessed for numeracy and literacy. ","howSchoolPlacementsWork":"As this is a school led programme, the majority of training takes place in schools.  There are three extended placements teaching in at least two different schools and two key stages.  You will be in your main placement school in terms one and three, with a complimentary school setting making up term two. Our programme includes a Post-16 element.\r\n\r\nThere are also many opportunities to gain additional experience in partner schools and settings. This can range from support on school trips to involvement in extra-curricular activities.\r\n\r\nPlease note that whilst we offer a range of locations in which to train and your preferences will be noted, you are not guaranteed a place at your preferred school. We endeavour to ensure that your needs are considered very carefully when deciding where your teacher training should take place, within our alliance of partner schools.\r\n","personalQualities":"Our alliance schools and the University of Worcester look for an interest in, and commitment to, education and young people. You will need to be enthusiastic about working with children, and possess an ability to relate to them. \r\n\r\nOral and written communication skills are very important to a teacher's role and your skills can grow and develop through teaching and your school experience. \r\n\r\nTeaching is physically and mentally demanding. You will need to demonstrate that you have the health and perseverance required to successfully complete the programme and continue a successful teaching career.\r\n","otherRequirements":"UCAS require two references, of which one will be an academic reference. For applicants who finished their studies more than five years ago, we realise that this may not be the most appropriate. In such cases, employers or teachers from the school(s) you visited whilst gaining your school experience can be used to provide a reference; they would be able to comment on your suitability for the teaching profession. For more information, please refer to the [UCAS website](https://www.ucas.com/teaching-in-the-uk) \r\n","status":1,"createdAt":"2021-07-06T10:46:55.222Z","updatedAt":"2021-09-09T08:31:39.720Z","canSponsorStudentVisa":"yes","cycle":"2024"}
