{"id":"e9a83d37-8c83-465b-a575-afbfa92afb5d","name":"Primary with Mathematics","code":"2T89","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"286cf12f-b3e3-41c5-9f33-2ff7807d2df0","code":"03","name":"Primary with mathematics"}],"locations":[{"id":"b56e3f0e-0f28-4c0a-9c8b-1dfc97bb5e9c","name":"West Vale Academy","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"a56b6aa1-6635-4c32-8ec3-fcd752cb7968","code":"2AT","name":"AA Teamworks West Yorkshire SCITT"},"profPost":"PG","english":"3","maths":"3","science":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"**In these difficult times, we remain committed to training the next generation of teachers. We have an adaptable admissions process that can be based on an online interview and task. Please do email teamworks@greetlandacademy.org.uk if you have any questions, we are only too happy to help.**\r\n\r\nOur primary maths course is designed and taught by a dedicated team of practising teachers. Our maths specialist programme is for applicants with a Maths A level at grade B or above. Trainees will teach all subjects but will develop their maths specialism with a view to becoming a maths coordinator. It is based on developing each trainee with a bespoke plan and experience designed to make you the best teacher you can be. You will be placed in two schools for your assessed placement from across our partnership schools in West Yorkshire. The normal pattern of the year is to be in your placement school for four days per week and to attend our training programme one day per week. We have every experienced mentors who are there to guide and support trainees throughout their training year and you will have the opportunity to visit a variety of schools on training days to broaden your experience and understanding. We provide all our trainees with their own laptop during the programme and have a dedicated website for trainee support and resources. All trainees are registered with the University of Huddersfield for a PGCE. For further details see our [website](www.teamworkstsa.org)","interviewProcess":"\r\n**During this pandemic, we will continue to interview candidates via online video, and any written assessments will be completed at a later date.**\r\n\r\nInterviews take place throughout the year, they include an interview with a selected panel of staff, a short activity designed for a group of pupils. These will take place in person where possible and online where not.  \r\n","howSchoolPlacementsWork":"Our programme places you in two schools from within the partnership across the year and you will work across two key stages, KS1 (5-7)  and KS2 (7-11).  Our Primary school partners are based in Bradford, Calderdale & Kirklees. Partnering with local schools in the area, we feel fully encompasses the geographical, social and economic diversity of West Yorkshire, offering our alliance breadth and depth. A key strength of our partnership is the diversity of schools; your two placement schools will be contrasting and the range of children and teachers you will work with will come from across the entire alliance ensuring you are trained to teach in all schools from the very start of your career.","personalQualities":"We are first and foremost looking for potential!  This is a training programme so we do not expect you to be the finished article but we are looking for people who are committed to teaching as a career, who are highly motivated, reflective and creative.  ","otherRequirements":"* It would be helpful to have spent time in school to ensure you have an understanding of the role of the teacher. In the current climate we are not able to provide a school experience placement.  To support candidates who lack school experience we would recommend: reading some articles about teachers and schools in the weekly newspaper Schools' Week, downloading the NationalCurriculum Orders and watching some online Oak Academy lessons.\r\n\r\n* You will also need to undertake an enhanced DBS check and an occupational health check","status":2,"createdAt":"2021-07-06T10:49:23.709Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
