{"id":"841d2d60-3152-4df0-947f-2aa390281a7a","name":"Primary","code":"29YV","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"348a32d3-b02f-4488-afb5-55a145d10a76","name":"Wensley Fold CE Primary Academy","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"cd761c54-aba9-4b6f-a46e-ff357c80f655","code":"1UC","name":"Blackburn Team Alliance"},"accreditedBody":{"id":"9be9f611-2d36-431a-9109-7fcbbfc88fc8","code":"C99","name":"University of Cumbria"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We only accept equivalency tests which are recognised by the University of Cumbria. Please contact us to check if an equivalency test would be accepted.","courseLength":"OneYear","feesUK":9250,"feeDetails":"Further information is available at:-  https://getintoteaching.education.gov.uk/funding-my-teacher-training\r\n","financialSupport":"\r\n","aboutCourse":"We deliver a school based primary PGCE.  Blackburn TEAM Alliance is committed to ensuring all trainees understand 'Quality First' approaches to teaching and learning and benefit from the highest standards in coaching and learning from theory and curriculum sessions into a real life classroom  environment.  \r\n\r\nThis is a full time/full school year program and a large amount of time is spent in school. The trainee has the opportunity to work alongside the teacher, who is their mentor, to observe and develop their knowledge and practice as the year progresses. there is a big focus on how and why with lots of opportunity to observe, reflect and apply.\r\n\r\nAs it is a PGCE it includes theory work at Masters level (Level 7) and in recognition of the high levels achieved by students on this program they are rewarded with 60 Masters level credits.\r\n\r\nThe course consists of the following modules:\r\n\r\n* Building Professional Understanding\r\n* Enhancing Professional Practice\r\n* Leading and managing change in the primary school.\r\n* Subject Knowledge and Pedagogy / Pedagogy Enrichment\r\n* The Teaching of Reading.\r\n\r\nPlacement Based Learning includes 3 assessed teaching placements throughout the year where a trainee is supported in working towards meeting the 'Teacher Standards' by the end of the training year. \r\n\r\nFor more information follow the link: (http://www.wensleyfold.co.uk/school-direct/)","interviewProcess":"If shortlisted, candidates will undertake a rigorous interview process to establish their suitability for the Blackburn TEAM Alliance School Direct Programme.\r\nMembers of the interview panel include Headteachers of Blackburn TEAM Alliance schools and the Partnership Programme Leader.\r\n\r\nAll interviews will be completed face to face at the lead school - Wensley Fold CE Primary Academy. We understand that candidates do not necessarily have school experience and therefore focus on your potential.\r\n\r\nDuring your interview day you will be expected to participate in the following:\r\n\r\n* Teach a short lesson to a small group of children that you have prepared beforehand- you will be given a learning objective to plan to a week in advance.\r\n* Complete a data task and an educational research reading task.\r\n* Complete a basic skills test for numeracy and literacy.\r\n* Answer questions in a formal interview.\r\n\r\nInterviews last approximately half a day.\r\n\r\nOur interview days are rigorous, thorough and designed to ensure we select the very best candidates for our course.\r\nWe encourage professional appearance and  a high level of spoken language throughout the day.","howSchoolPlacementsWork":"We currently have 20 Blackburn with Darwen schools in our partnership.  You will be allocated a main host school from September where you will spend every Monday and Tuesday, observing excellent classroom practice.  Your class teacher will be a fully trained mentor who will guide you through the year of training ensuring that it is tailored to your needs and experience. All mentors are kept up to date with developments in coaching and mentors trainees.\r\nWednesdays and Fridays will be spent studying National Curriculum subjects and what constitutes 'Quality First' teaching with areas of focus such as metacognition in children's learning, how children learn and using assessment to deliver effective feedback. These lectures are led by accredited Specialist Leaders of Education who are experts in their individual subject areas.  \r\nThursdays are spent studying the theory of education leading to Masters credits and this is delivered by a lecturer from the University of Cumbria.\r\n Trainees will have 3 assessed teaching placements throughout the year. You will  carry out the Beginning Placement - 6 weeks(Nov) and Extending Placement - 9 weeks(April) in your host school.  You will then be allocated a contrasting school for your Developing Placement - 6 weeks(Jan) which will also be a contrasting Key Stage to give you the best and wider experience. \r\n\r\nYou may select a preference of KS1 and KS2 for your host school.\r\nWe ask whether you are a driver when arranging school placements so that we can ensure you are placed in a school with easy access to public transport if needed. All schools are in the local area of Blackburn with Darwen so trainees will not be required to attend a school beyond this catchment area.\r\nPlacements are quality assured by us on a regular basis to ensure that all trainees are very well supported and guided through the training process. ","personalQualities":"We seek to recruit graduates who:\r\n\r\n* Possess a genuine desire to enrich the lives of young children and who conduct themselves in a professional, friendly, approachable, positive  manner.\r\n\r\n* Are motivated by the prospect of a career in teaching and dedicated to becoming brilliant role models for the children in their care.\r\n\r\n* Are interested in benefiting from a school based approach to teacher training- applying theory and research into practice and learning to teach from highly experienced and respected professionals\r\n\r\n* Are enthused by the prospect of working alongside good or outstanding teachers in high performing schools\r\n","otherRequirements":"Any experience of working in a school is not essential to gaining a place on this course but we highly recommend you arrange this if possible as it will benefit you in your mini teach at interview and in selecting which key stage is your preferred initial option when training. \r\n\r\nIn recognition of  how valuable this school experience is prior to starting the course,  we are able to arrange this for you in the lead school  prior to or following your interview.   \r\n\r\nPlease contact us for help with this.","status":1,"createdAt":"2021-07-06T10:53:38.810Z","updatedAt":"2021-10-04T12:13:54.632Z","canSponsorStudentVisa":"yes","cycle":"2024"}
