{"id":"d89e9c42-fbd5-4b6c-9e14-49fd4b924087","name":"Computing","code":"2QNV","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"e6be6a9c-8696-4b88-8fbd-1ba1bef1b6fc","code":"11","name":"Computing"}],"locations":[{"id":"6869091a-76bf-45b4-81fc-805b76d0f342","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"7f349baa-f4ef-4fd5-b228-fcc56247e9b9","code":"24P","name":"The OAKS (Ormiston and Keele SCITT)"},"profPost":"BO","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"The OAKS offers candidates the opportunity to train and develop as a subject specialist.  A minimum of 40% of the credits gained during your degree must be directly related to the subject you wish to train to teach.","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"The OAKS offers candidates the opportunity to sit our GCSE equivalence tests in English Language and Mathematics prior to entry.","courseLength":"OneYear","feesUK":9250,"feeDetails":"With The OAKS there is a pre-course fee which covers\r\n- Enhanced DBS check\r\n- Fitness to teach\r\n- Purchasing of Bristol Guide (reduced cost from The OAKS)\r\n- Residential trip.  \r\n\r\nIn 2021/22 the total price for the above was £115, at this moment in time we are unable to confirm the price for 2022/23, but do not foresee this increasing dramatically.\r\n\r\nThere is also a possibility of undertaking a First Aid course and / or a P4C (Philosophy for Children) course, these are optional and may incur an additional fee. ","aboutCourse":"In our current dynamic world of digital technology, the OAKS Computing Course is designed to offer an approach which incorporates both the ‘legacy’ ICT courses with newer, dynamic, cutting-edge computing courses and also satisfies the current NC Requirements for the subject. If you have a desire to shape the minds of the children of the future, contributing to their development as thinking individuals, then this course is for you.\r\n\r\nOur studies are structured around Computing in the NC and consider the needs of teachers, pupils, school requirements, and the requirements of commerce and industry. \r\n\r\nThe Computing course content includes the following: –\r\n(1) Understanding and application of the fundamental principles and concepts of CS and of computational thinking, including abstraction; decomposition; critical thinking; logical reasoning; algorithms and data representation.\r\n(2) Analysis of problems in computational terms, through the practical experience of solving such problems. \r\n(3) Gaining knowledge of a variety of software applications and programming languages, using a practical approach. Typical languages range might be Java, C, Visual Basic, Scratch, Python, ASP, Pascal, Logo, and development tools would include Access, App makers, Visual Studio, Macromedia Studio, and Movie Maker.\r\n(4) Understanding of how to harness the power of technology and think creatively, analytically, critically and logically, in order to devise novel solutions to problems:\r\n(5) Understanding of the components that make up the different types of digital system and how they communicate with each other and with other systems.\r\n(6) Understanding of the impact of technology, relative to both the individual and also to wider society\r\n(7) Application of mathematical skills relative to the CS.\r\n\r\nThe course also considers the following pedagogical aspects including exam technique and as a computer expert, you will be encouraged to develop your own expertise in the use of Digital Technologies.\r\n\r\nYou will be encouraged to create a dynamic and creative atmosphere within your classroom, given insight into how to work well in a practical environment.\r\n\r\nLessons need thorough planning and must be appropriately targeted, taking into consideration the variety of abilities and attitudes of your pupils. Classroom management will be discussed along with ways to enhance pupil learning and understanding. \r\n\r\nThe course has a large element of in school hands-on teaching: The OAKS has excellent working relationships with colleagues at both our lead schools and all other partnership schools, that will contribute to your continuing professional development.\r\n\r\n","interviewProcess":"Our selection process is a two way process where you can find out if the OAKS is the training programme for you and we can decide if you can potentially become a good/outstanding secondary teacher.  We always carry out our interviews in one of our partnership schools, where you will be expected to teach either a class or a small group of their students for 15 minutes.  The students  give us feedback on your lesson, which we share with you during a formal interview.  This focuses on your lesson, your subject knowledge and your commitment to teach.  There are also several tasks for you to complete; these include a written subject specific activity and a generic writing task.  The whole process should take no more than half a day at the school.  You are interviewed by Partnership School staff and OAKS tutors,  who will talk through the programme and school placements. There will always be plenty of time for you to ask questions and the decision as to whether you are accepted on to the course is usually made on the same day (this may vary depending on the subject/time of year).\r\n\r\nWe want the interview to be a very positive experience for you; please arrive promptly and formal dress is expected.  We look forward to meeting you!\r\n\r\n","howSchoolPlacementsWork":"We will send you to two secondary schools where you will receive an 11-16 experience; the time spent in both of these placements is the same.  Hopefully they will give you two very different experiences; one maybe in a small town or rural setting the other could be inner city.  We make sure that you also receive a pre and post phase enhancement so you will be placed in a primary school for one week and gain experience in a post-16 environment (possibly in one of your secondary placements).  We are very proud of our alternative education placements that we arrange for you on our programme.  Hopefully you will gain experience in an EAL school, pupil referral unit (PRU), special school and maybe an independent school.  \r\n\r\nTravel to and from your placements is always a key concern and we make every effort to make sure that you can easily commute to your schools.  We have a very large partnership in over five counties; one will have schools close to you.  We guarantee that you will never have to travel more than 75 minutes.  In fact, most of our trainees travel well under an hour to their teaching experiences.  When we visit our EAL schools we put on mini buses so nothing could be simpler.\r\n\r\nMany of you will have applied to one of our 5 hubs (geographical zones); this usually dictates the schools that you will be placed in.  Through evaluations all of our partnership schools are deemed to be at least \"very good training experiences\" for our trainee teachers.  We train and then monitor all of our school based mentors and the quality of our school’s provision annually; so rest assured that you will have a good teaching experience with us at the OAKS.\r\n","personalQualities":"* Highly motivated individuals who want to make a positive contribution to the education of young people.       \r\n* Trainees who are passionate about their own specialism subject, with very good subject knowledge.  \r\n* Who are able to inspire their learners and create an environment where everyone wants to succeed.       \r\n* Candidates that show enthusiasm and a willingness to participate in the all aspects of the training course.       \r\n* Robust, resilient applicants who want to make a difference in the classroom.       \r\n* People who want to become good or outstanding classroom practitioners, with a desire to improve themselves and their student's.\r\n","otherRequirements":"o\ta medical report which is deemed satisfactory;\r\no\ta completed DBS enhanced disclosure which is deemed satisfactory by the The OAKS;\r\no\ta successful completion of a minimum of 10 days teaching experience in a secondary school/college during the last two years. This could be either before or after selection (undertaking this before the selection process commences will strengthen your application).\r\n","status":1,"createdAt":"2021-07-06T10:47:26.490Z","updatedAt":"2021-09-27T11:17:03.934Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
