{"id":"7c629304-5256-4dc5-b56c-8fb8e14f5fcd","name":"Primary","code":"W828","qualification":"qts","startDate":"2024-05-31T23:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"TA","fundingType":"apprenticeship","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"32378d3a-9540-42fe-acd0-d16414f4a1aa","name":"Main Site Priestmead Primary School","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"f04a25ca-a0bf-4967-869e-92d435170911","code":"27Z","name":"Teach In Harrow: Primary School Direct"},"accreditedBody":{"id":"9188f17a-79c4-43a9-b459-4952815b739a","code":"M80","name":"Middlesex University"},"english":"3","maths":"3","science":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"Completed over 4 academic terms","aboutCourse":"The apprenticeship training programme mirrors that which we offer for School Direct in partnership with Middlesex University. \r\n\r\nFor more information about the course and entry requirements follow the link below;\r\nhttps://www.mdx.ac.uk/courses/degree-apprenticeships/postgraduate-teacher-apprenticeship-qts\r\n\r\nIn partnership with Middlesex University we provide ‘off-the-job’ training which incorporates the curriculum for ITT and enables successful trainees to meet the Teachers’ Standards and be recommended for QTS by the end of the programme. \r\n\r\nThe programme also includes the possibility to gain a PG Cert if successful with the module assignments. \r\n\r\nFollow the link below for more detail;\r\nhttps://www.mdx.ac.uk/courses/postgraduate/teaching-pgcert\r\n\r\n","interviewProcess":"There are three stages:\r\n\r\n1.   Your UCAS application form\r\n\r\n2.  An informal interview with two Headteachers from the Harrow Teaching School Alliance to explore your application with you in person (\"live\" shortlisting) (30 mins)\r\n\r\n3.  A formal interview to assess your skill set against the Teacher Standards including group task, teaching, reflecting, written task and a marking task.  You will be interviewed by a panel of Headteachers during the process. (half a day)\r\n\r\n4.Instead of the basic skills assessment, the DfE has asked Lead Schools to assess suitability for teaching including your subject knowledge for teaching and competency in the fundamental skills of English and Maths. We insist upon competence to GCSE grade 4 or equivalent. \r\n\r\nMore information at:\r\n(https://www.priestmead.harrow.sch.uk/harrow/primary/priestmead/site/pages/schooldirect)\r\nhttps://www.mdx.ac.uk/courses/postgraduate/school-direct-qts","howSchoolPlacementsWork":"Once successful, any of the Headteachers involved can offer you a placement at their school.  The course will start in JUNE/JULY.  Final Assessment will be by October of the following year.\r\n\r\nIf more than one school would like you, you have the chance to visit each school and choose which you would prefer.  Only a few offer the apprenticeship route.\r\n\r\nIf there was a specific school or you are currently at a school, we can try and accommodate this too.\r\n\r\nThe age ranges of our primary schools are ages 5-11 although we can support ages 3-7 is desired. \r\n\r\nYou will have the host school all year but also a second 6-week placement within the alliance and a KS3 experience at Secondary School, within your local cluster.  \r\n\r\nApart from University training on a Wednesday, you spend all other time in school, matching the working hour expectations of the school.  This includes access to staff training and involvement in school life - from a Summer Fair to a Parent Evening.\r\n\r\nThe more you put in, the more ready you will feel when you have your first class as a qualified teacher the following year!\r\n\r\nMore information at:\r\n(https://www.priestmead.harrow.sch.uk/harrow/primary/priestmead/site/pages/schooldirect)\r\nhttps://www.mdx.ac.uk/courses/postgraduate/school-direct-qts","personalQualities":"We seek experience of working with children as you will be teaching classes from the day you start!  \r\n\r\nWe look for transferrable skills for career changers.  \r\n\r\nWe want to see enthusiasm, passion, organisational skills, an understanding of educational pedagogy and practice.  \r\n\r\nAbove all else, every school has rigorous Safeguarding procedures and high expectations with all prospective staff to understand Safeguarding in its widest sense and having read Keeping Children Safe in Education (Part 1) - ensure it is the most recent version.\r\n\r\nMore information at:\r\n(https://www.priestmead.harrow.sch.uk/harrow/primary/priestmead/site/pages/schooldirect)","otherRequirements":"We want candidates who are realistic about education.  \r\n\r\nIt will be hard.  there are long hours, rainy wet play days and lots of planning and marking!  \r\n\r\nBut your drive and ambition must be to make a real difference to every child you teach and enable them to be the best they can be.  \r\n\r\nSchools are the heartbeat of our communities and every child matters - every teacher is part of their life journey.  \r\n\r\nBe inspired and make a difference in Harrow.\r\n\r\nMore information at:\r\n(https://www.priestmead.harrow.sch.uk/harrow/primary/priestmead/site/pages/schooldirect)","status":2,"createdAt":"2021-07-06T10:53:01.847Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024"}
