{"id":"eb5d469d-b1f2-4195-9ee4-56f46b08c564","name":"Primary (Special Educational Needs)","code":"39KY","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"yes","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"425c30bf-94d9-4ef8-8cb5-7330df9079ba","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"e46d3ef9-9b34-480a-bb64-1d408a14057c","code":"2JY","name":"Shanidar - West Yorkshire"},"accreditedBody":{"id":"e5b8e187-ccc1-4253-9dd0-376d6abf7e66","code":"2EY","name":"Exceed SCITT"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We ask candidates to use a third party for the equivalency tests and we would recommend they use Equivalency Testing. (https://www.equivalencytesting.com/)","courseLength":"OneYear","feesUK":9250,"feesInternational":9250,"feeDetails":"We are offering School Direct as a fee-funded/non-salaried route into teaching and fees for the programme are applicable. Graduates applying for initial teacher training (ITT) usually take out a student loan to pay their £9250 tuition fees to Exceed SCITT. Some trainees may be eligible for a government bursary as an incentive to train to be a teacher, but the government seem to reduce these each year or increase their expectations about the class of honours degree you need to have secured before you start teacher training. Although there’s a cost, applicants need to consider the starting salary of a teacher is £25,000 and there are many options to secure promotion within a few years of qualifying. The pain of paying a loan is compensated by a good starting salary and a rewarding career. \r\n\r\nFor more information about fees and funding please visit Student Finance.\r\n(https://getintoteaching.education.gov.uk/funding-and-salary/overview)\r\n","financialSupport":"At Exceed SCITT we want to ensure that all trainees with potential to become a teacher can access teacher training programmes. \r\n\r\nPlanning to train to be a teacher and choosing the right route into teaching for you is an exciting moment in your life. Getting the right financial advice and support is a crucial step in the decision-making process.\r\n\r\nStaff within the partnership can offer help, support and guidance on funding the tuition fees, applying for a student loan and managing your money throughout the duration of the programme.\r\n","aboutCourse":"This unique programme maximises your time in school and classrooms. Even the PGCE is drawn directly from your work in school and is not a separate taught course. Our programme design is innovative, with 4 potential pathways for you to choose from: \r\n\r\n* Autism (communication and interaction) \r\n* Generic SEND (cognition and learning) \r\n* Social, Emotional and Mental Health (SEMH) and \r\n* Sensory (VisuaI impairment / Hearing Impairment).   \r\n\r\nWe aim to match you with a home school in our partnership that matches your particular interest in SEND and/or suits your geographical location where this is possible.    We have 14 schools across Bradford, Keighley, Leeds and Skipton.    If you choose the Generic SEND route, we can place you in one of our 6 special schools as your home school.\r\n\r\nYou will start the course with an introduction at your home school.  This is followed by an assessed block in Key Stage 1 and an assessed block in Key Stage 2, both in mainstream primary schools. \r\n\r\nYou will have regular training courses in all aspects of teaching the national primary curriculum on Wednesdays and Thursdays.   We will also enhance this training with additional content on areas of special education needs.   This will cover a wide range of topics including positive behaviour management, inclusion, communication and interaction, attachment disorder, cognition and learning, and whole school communication strategies.  \r\n\r\nWe will provide continued opportunity to explore your interest in special provision and provide you with time in your home school where you can put what you are learning into practice. The route will equip you to move into employment in both main stream and special provision.\r\n\r\n\r\n","interviewProcess":"You will be interviewed at one of our partnership mainstream primary schools in either Bradford or Keighley.   There will be two people on the interview panel, including a member of the senior leadership team from the school.\r\nThere will be three parts to the assessment:\r\n* a short 30 minute interview \r\n* a 15 minute teaching observation\r\n* some written tasks\r\nWe will let you know the same day if you have been successful.   ","howSchoolPlacementsWork":"We will match you with schools that reflect your particular interest in special needs education and also best suit your geographical location.   All of our mainstream primary schools have an additional Designated Specialist Provision in either autism, social emotional and mental health (SEMH), visual impairment (VI) or hearing impairment (HI).  This enables you to train in a mainstream primary but also understand how to teach in highly inclusive and diverse environment.\r\n\r\nFor candidates selecting our SEMH route, we can offer either the Bradford Central PRU as a home school, or a mainstream primary school with a DSP for SEMH.  These are Cottingley Village Primary or Long Lee Primary.\r\n\r\nIf you select our Generic SEND route, you will attend a special school in either Leeds, Bradford, Bingley or Skipton as your home school.   We will combine this with assessed placements in our mainstream primary schools so that you get the valuable experience of teaching all key stages in a mainstream setting.\r\n\r\nFor applicants with an interest in sensory impairment education, we can offer Swain House Primary, Girlington Primary and Grove House Primary.\r\nWhichever route you decide, our unique and innovate course design ensures that you will be qualified to teach in either a mainstream primary or a special school.  You are treated like you are a member of the school staff, someone who the school is often looking to employ at the end of the year. \r\n\r\n","personalQualities":"We are looking for people with a passion for inclusive education.   ","otherRequirements":"We want to make sure that you have made the right choice in training to be a teacher. \r\n\r\nBefore starting the programme all applicants must be deemed suitable to train to teach so safeguarding checks will be undertaken. They must also demonstrate they are fit to teach so will need to complete a pre-ITT health questionnaire.\r\n","status":1,"createdAt":"2021-07-06T10:47:55.824Z","updatedAt":"2021-09-28T08:55:39.145Z","canSponsorStudentVisa":"no","cycle":"2024"}
