{"id":"0d3cbb82-09be-4e80-9edd-25d52e78a9db","name":"English","code":"2J8P","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3aed1aa8-ae46-4b68-92bb-a6cc20655c59","code":"Q3","name":"English"}],"locations":[{"id":"fb2ee1a7-66ef-4e60-8ced-05b85f37164e","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"787bb845-00d7-43b3-9682-5a2efd99c5bc","code":"219","name":"The West Bridgford School"},"accreditedBody":{"id":"2915cd8b-c4a4-4169-8715-78a9302d9548","code":"E31","name":"East Midlands Teacher Training Partnership"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9000,"aboutCourse":"We take a blended approach to training which we feel gives you a programme that can be bespoke to your needs. All trainees will follow both a Qualified Teacher Status (QTS) and PGCE programme, meaning that, upon completion, our trainees will attain QTS, PGCE and 60 Master’s credits.\r\n\r\nThe QTS programme consists of a variety of elements, based around your time in schools, including two school placements in your chosen phase. These placements will give you experience in diverse settings. Each school provides a mentor, who will be a subject/phase specialist, to support your progress and development, plus an ITT coordinator who provides further support. \r\n\r\nDuring placement, your requirement to plan and teach lessons will gradually increase over the year at a pace that best supports your development and circumstances. You will also undertake a two-week placement in a special school setting and carry out a cross-phase placement. This ensures that you will complete your training having experienced a range of students, settings and age ranges. You will develop a comprehensive understanding of where students have come from and where they may go during their journey through education.\r\n\r\nWhilst our course involves an extended period of time in schools, we also believe that understanding teaching pedagogy is crucial to success. Within the QTS qualification, we provide weekly pedagogical training which builds a firm foundation of understanding upon which practical skills of teaching can be built. These sessions also provide an invaluable pastoral and networking opportunity for trainees. \r\n\r\nSubject knowledge support is also provided through group and individual experiences and is facilitated by subject experts. It will identify areas of need that a trainee has and provide opportunities to develop these. This is hugely important given the ever changing educational landscape.\r\n  \r\nThe PGCE programme is undertaken in partnership with the University of Nottingham. This is a particularly exciting partnership as it means that our trainees do not have to rely on distance learning opportunities. During the year there are a number of face-to-face days at the University, the themes of which are carefully selected so that they dovetail with the school based training that you receive on the QTS programme. In order to support your work-life balance, we build in additional study days that enable you to work on the three written assignments and one presentation task that you will undertake to complete your PGCE. ","interviewProcess":"At the heart of our recruitment processes is you, the applicant. We will try to support you and work with you to make the process manageable.  Once your application arrives it is assessed by our recruitment team that consists of representatives from our partner schools and our accredited provider (EMTTP). We will assess your application against our entry requirements and, if successful, will invite you to interview. You will only be required to attend one interview as both our partnership and accredited provider will be in attendance. During the interview day you will have the opportunity to talk to course leaders, talk to a range of students and to deliver a session to a small group of students. These activities are designed to allow you to demonstrate your potential to be a good teacher. We are fully cognisant of the fact that you are not yet a qualified teacher. You will also undertake a subject knowledge task that, whilst giving us an opportunity to assess your subject knowledge, also allows us to ascertain any areas of support you may need moving forward. The day ends with a formal interview. Following the interview day, we would aim to give you a decision within 24 hours as we understand how stressful this process can be. If successful in gaining an offer, which you subsequently accept, we will work with you in ensuring that you can access support that might be relevant to you such as Subject Knowledge Enhancement courses. ","howSchoolPlacementsWork":"A huge benefit of following our school based training is that you gain an appreciation of how a school year works. You will have the opportunity to immerse yourself in a school and as such you will be expected to follow the school day of your placement school. Past trainees have told us that this immersion prepared them fully for their transition into their first teaching job. Our trainees will spend most of the training year in a main placement school. This main placement begins in September at the start of the school year and continues until Christmas. In January you will undertake a Second placement which will give you access to a different school setting. This placement lasts for 7 weeks. At the end of the Second placement you will return to your Main placement school where you will remain until the end of the training year. During these placements you will have access to key support mentors within school who will support your development on a day to day basis within the classroom. You will also have a school co-ordinator who will ensure that you have support in gaining insight into the wider school and the systems within it. Across these two placements we will ensure that you gain experience of teaching across the full age range within which you are training. A Tutor, from our accredited provider (EMTTP) will also visit you a minimum of 6 times during the year to support and assess your progress. \r\nYour time in school is Monday to Thursday. On Friday you will come together as a group to do Pedagogical training. This gives you a regular chance to network as well as reflect upon your teaching and how it is developing. These sessions are facilitated by a range of expert practitioners from within, and outside of our partnership. \r\n\r\nBeyond your two school based placements we offer a range of enhanced placements. Each trainee will undertake a two week SEND placement as well as cross phase placements that will give you insights in the phases immediately before and after your training phase.","status":1,"createdAt":"2021-07-06T10:48:06.292Z","updatedAt":"2021-07-23T12:46:20.666Z","canSponsorStudentVisa":"no","cycle":"2024"}
