{"id":"c9a27eef-ceaf-4615-a9af-934d2e48cff8","name":"Design & Technology (Product Design)","code":"AT38","qualification":"pgce_with_qts","startDate":"2022-09-01T09:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"},{"id":"118fabd7-86d0-4a40-9e9a-e5c302abe59b","code":"DT","name":"Design and technology"}],"locations":[{"id":"e5082e34-244f-44eb-9c9a-4e2b865ca292","name":"Main Site","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"a9e7123c-d730-4bc4-b329-b014ceed1a4d","name":"Enfield","isPublished":"false","status":"new","vacancies":"full_time"},{"id":"42fb36f0-dad7-4be9-b3bb-721da8836f17","name":"Havering","isPublished":"false","status":"new","vacancies":"full_time"},{"id":"9e35a10d-37d8-4bf9-b3cd-f53aeaeea0b2","name":"Waltham Forest","isPublished":"false","status":"new","vacancies":"full_time"},{"id":"d72bc138-fe97-482b-a351-e2a1e7045f90","name":"Essex","isPublished":"false","status":"new","vacancies":"full_time"},{"id":"a4da2034-7ca7-4ae2-af57-b7c0129601b1","name":"Hertfordshire","isPublished":"false","status":"new","vacancies":"full_time"},{"id":"4eb4f720-a15c-47ff-9f4f-4932b10f1d85","name":"Redbridge","isPublished":"false","status":"new","vacancies":"full_time"},{"id":"a9f1de87-3372-4f05-ad7c-dae7a5b1aa8e","name":"FIPC Training centre","isPublished":"false","status":"new","vacancies":"full_time"}],"trainingProvider":{"id":"fb5fd635-3bc9-44e9-9d05-caa875ff2565","code":"1TK","name":"Uffculme School"},"accreditedBody":{"id":"d41a1821-e35b-48eb-bf02-4842872b04a2","code":"E84","name":"University of Exeter"},"profPost":"PG","degreeGrade":"0","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"2.1 degree or above in Manufacturing, Design, Engineering, Food, Textiles, Architecture or a related subject. \n\nApplicants who apply with a 2.2 will be considered if they have been awarded a Masters or PhD.","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We accept equivalency tests from A Star Equivalency and equivalencytesting.com (please do contact us for further guidance before signing up for an equivalency test).","courseLength":"OneYear","feesUK":null,"aboutCourse":"We believe that teaching is an exciting, challenging and rewarding profession. We pride ourselves on having a proven track record over the past 20 years in training excellent practitioners and supporting them in gaining positions within our partnership schools. \r\nForest Independent Primary Collegiate, the accredited provider, has written this highly comprehensive and bespoke programme. It reflects the exceptional standards in Enfield schools and our understanding of what makes an excellent teacher. We are committed to offering high quality training for local candidates with the aim of securing the beginning of a successful career in teaching. We also aim to support trainees' careers after completing the programme through excellent CPD opportunities on offer within our school partnership. This includes subject knowledge and leadership training, and opportunities to take part in research and to work collaboratively with colleagues in other schools. \r\nWe scrutinize the School Direct applications and place trainees in the partnership schools. These are excellent mainstream schools that are committed to supporting the process of the training.\r\n","interviewProcess":"The selection process consists of an interview in one of our partnership schools, which will be carried out by a member of staff from FIPC and/or a member of staff from the partnership school. Applicants will be invited to visit a suitable school for observation with children.\r\n","howSchoolPlacementsWork":"This one-year primary course is based in one school for the majority of the year with a contrast setting placement. Candidates learn the art of teaching in the classroom for four days each week, guided by their mentors.  Each trainee is allocated a professional tutor who visits and supports the trainee on a regular basis. Host schools are able to offer insights into their successful practices and induct trainees in line with the best of current teaching.  Part of the course is theory based and there will be formal training each Friday.  School Direct requires a full time commitment of 5 days per week from September to July and trainees are expected to participate fully in the everyday life of the schools in which they train.","personalQualities":"","otherRequirements":"A satisfactory criminal records check and medical assessment is required prior to the start of the programme. ","status":2,"createdAt":"2021-07-06T10:50:49.310Z","updatedAt":null}