{"id":"ec3c3a7b-69d4-41de-9287-809b203ca71e","name":"Biology with Psychology","code":"S015","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"322cfc19-d51d-45db-91e3-bd7b4738470f","code":"C1","name":"Biology"},{"id":"1878e739-30bb-4de9-841e-42dacfb1fa0c","code":"C8","name":"Psychology"}],"locations":[{"id":"e5082e34-244f-44eb-9c9a-4e2b865ca292","name":"Main Site","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"fb5fd635-3bc9-44e9-9d05-caa875ff2565","code":"1TK","name":"Uffculme School"},"accreditedBody":{"id":"d41a1821-e35b-48eb-bf02-4842872b04a2","code":"E84","name":"University of Exeter"},"profPost":"PG","degreeGrade":"0","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"2.1 or above in Psychology or a related degree with a minimum of 50% Psychology content. \nOr 2.1 or above in Biology or a related degree with a minimum of 50% Biology content.","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We accept equivalency tests from A Star Equivalency and equivalencytesting.com (please do contact us for further guidance before signing up for an equivalency test).","courseLength":"OneYear","feesUK":9250,"feesInternational":20000,"aboutCourse":"Biology with  Psychology - School Direct @Exeter (SO15)\r\n\r\nSchool Direct@Exeter features all of the elements of a traditional University based PGCE but has the additional benefit of providing trainees with more time in school. \r\n\r\nTrainees following this programme become part of the school community from day 1, joining their home placement school at the start of term and being inducted into the school alongside other new members of staff. This time in school provides trainees with an invaluable experience. They are introduced to the culture and ethos of the school and get to know the schools’ routines and expectations, ensuring that they hit the ground running when they start their main school based learning in the Spring Term. \r\n\r\nDuring this initial phase trainees also undertake their cross phase placements and have taught sessions alongside other School Direct trainees.\r\n\r\nAutumn Term: \r\n\r\nTrainees join other School Direct trainees at Uffculme School for taught sessions aimed at familiarising them with both the Teachers’ Standards and the Exeter Model for ITE. They then join the University PGCE programme when it starts, normally the third week in September. Trainees return to their home school for a two week placement in November.\r\n\r\nSpring Term: \r\n\r\nTrainees are based in their home school where they are supported by both experienced and dedicated teachers and their University Visiting Tutor (UVT). During this time they will also attend three seminar days at the University. \r\n\r\nSummer Term:\r\n\r\nWhereas most courses offer a 6 week contrasting placement, our 10 week placement provides trainees with a fantastic opportunity to compare and contrast different approaches to all aspects of teaching and other wider areas of work that teachers are involved in. Trainees also have the opportunity to attend two further seminar days at the University. \r\n\r\nWhilst on placement trainees will have twelve contact hours a week of classroom-based work.\r\n\r\nAssessment:\r\n\r\n1. SPECIALIST SUBJECT KNOWLEDGE AND PEDAGOGY MODULE \r\nMasters level (30 credits) 6000 summative assignment (Autumn Term)\r\n2. EDUCATION AND PROFESSIONAL STUDIES (EPS) MODULE \r\nMasters level (30 credits) 6000 summative assignment (Spring Term)\r\n3. PROFESSIONAL LEARNING MODULE \r\nThe aim of this non-credit bearing module is to enable students to provide reflection on their professional development. Trainees complete an Individual Development Portfolio (IDP) that contains evidence of achieving the Teachers' Standards.  \r\n\r\nSuccessful completion of all three modules leads to the award of Secondary PGCE with QTS. \r\n","interviewProcess":"All applications are screened initially by the University of Exeter Admissions department to check suitability for the programme. Suitable applicants will then be contacted by the West Country Training School Alliance and invited to attend an interview. While we aim to interview candidates in person this year, there may be a return to online interviews should Covid restrictions change.\r\n\r\nApplicants will be asked to prepare a 20-minute section of a lesson to be delivered to a group of students on interview day. The title and learning outcomes for the lesson episode will be shared with applicants one week prior to the interview. A formal interview will be conducted by the Director of WCTSA and will include questions on the pre-interview tasks in addition to questions on safeguarding, knowledge and understanding of teaching and learning, education and experience. ","howSchoolPlacementsWork":"Trainees following the School Direct route into teaching are able to express a preference as to which of our partner schools they would like to be based in. This provides trainees with the opportunity to train close to home. Whilst most of our trainees are placed at Uffculme School for one of their placements we also offer placements in our Exeter, Mid Devon or Taunton based schools. Our diverse and extensive partnership of schools ensures that we can tailor our placements to meet the needs of our trainees. This can also include offering trainees an enriched experience of post 16 teaching or an opportunity to teach in the independent sector.\r\n\r\nThe length of the placements may vary but typically trainees spend 12 weeks in their home school and 10 weeks in their contrasting placement school. In addition to this they will also have a one week cross phase placement in a Primary setting. Trainees who are not based in an 11- 18 setting for one of their placements will also be provided with a one week post 16 experience. \r\n\r\nAll placements, including cross phase and post 16, are organised for trainees. \r\n","personalQualities":"We are looking for applicants who are passionate about teaching young people and who are driven by a desire to see every child succeed. Applicants should have a genuine love of their subject, they must be willing to learn and have the confidence to take risks. All trainees will need to possess resilience and above all they must be prepared to be reflective and learn from their experiences. \r\n\r\nOur trainees need to demonstrate that they have the potential to become outstanding teachers who are committed to teaching and to developing their own careers. \r\n\r\n","otherRequirements":"In addition to the academic requirements listed, selection is based on performance at interview, a satisfactory fitness to teach assessment and a satisfactory DBS enhanced disclosure. Note: the DfE entry requirement to pass professional skills tests in literacy and numeracy has been removed for 2020/21 entry onwards.  Instead PGCE trainees will be benchmarked during their training against a Government-defined set of fundamental mathematics and English skills.\r\n\r\nAlthough not essential it would be an advantage to be able to reflect on any school-based experience or experience working with young people in another context at interview.","status":1,"createdAt":"2021-12-08T16:37:44.538Z","updatedAt":"2021-12-08T16:39:28.254Z","canSponsorStudentVisa":"yes","cycle":"2024"}
