{"id":"283534b9-2df2-4461-b1a2-38692b1e6c0a","name":"English","code":"2CFS","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3aed1aa8-ae46-4b68-92bb-a6cc20655c59","code":"Q3","name":"English"}],"locations":[{"id":"64fca322-c011-4525-810b-3751b14bf0b4","name":"Rhyddings","isPublished":"Y","status":"R","vacancies":"F"},{"id":"bd01d126-592a-439a-8b2a-58498bfc43ee","name":"Marsden Heights Community College","isPublished":"Y","status":"R","vacancies":"F"},{"id":"e87227e6-097e-44ff-9bab-a9d337c071fa","name":"Ribblesdale High School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"d4861960-23d0-4382-aa2a-37b22a71fc85","name":"The Hollins Technology College","isPublished":"Y","status":"R","vacancies":"F"},{"id":"8859dd76-66eb-4eef-9270-1176db6001a6","name":"The Hollins","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"76c55af9-5232-41bd-a308-9fc5a4270cdd","code":"P38","name":"Pennine Lancashire SCITT"},"profPost":"BO","degreeGrade":"9","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"we will accept the equivalence tests from https://www.prestoleescitt.co.uk/Equivalency-Testing/\n\nplease contact us if you have any other for us to check","courseLength":"OneYear","feesUK":9000,"aboutCourse":"English teaching is pivotal in the success of any school, and having a great English teacher is crucial to any pupil’s hopes of success in the modern world.  Why is English so important? Not just for the chance to foster a love of reading and a love of language in the children in their charge, but because a competent and confident grasp of English opens doors in life that are denied to those without it.\r\n\r\nIf you have a genuine passion for English, going into a secondary classroom, to teach that subject, can be a wondrous experience. Passing on a love of literature is wonderful, and many teachers realise that they can never be bored teaching with so much variety in the job. Teaching itself is never boring - the kids are so entertaining, they will always surprise you.\r\n\r\nThe PL SCITT English course will provide you with a wealth of practical teaching experience, and is carefully designed to ensure you are prepared for your first lessons in the classroom. Our enhanced opportunities to experience EYFS and primary settings will give you a grounding in phonics and how pupils learn to read for example. \r\n\r\nWe work in partnership with other SCITTs in the north west of England to provide the subject specific pedagogy that underpins your classroom practice. Specialist Practitioners in Education (SLEs) lead these sessions, which don’t just allow you to gain knowledge of the best practical teaching approaches but also give you the opportunity to share ideas with other trainees in a wide range of schools. \r\n\r\nYou will be assessed both for Qualified Teacher Status (QTS) and through written assignments for Post Graduate Certification (PGCE). They are separate awards however, and the whilst the QTS will be assessed by ourselves within the SCITT, the PGCE will be assessed by  your university tutors.\r\n","interviewProcess":"Our interview procedure is a rigorous process, including a panel interview, subject knowledge audit and mini teach. \r\n\r\nFurther details of the interview process will be given to those successful at the first stage of the application process.","howSchoolPlacementsWork":"The Training Programme is designed by experienced professional practitioners who share a passion for teaching and learning.  Our common commitment is to ensure that our next generation of teachers is equipped on every level - personally, intellectually and professionally - to inspire new generations of learners in our schools. \r\n\r\nThe schools that form our SCITT partnership are\r\n:\r\n\r\n\r\nThe Hollins, Accrington\r\nMarsden Heights Community College, Nelson\r\nRibblesdale High School, Clitheroe\r\n\r\n.\r\n\r\nThroughout, you will be challenged, stretched, encouraged and driven to become an outstandingly good teacher.  You will be trained in at least two of the partner schools in order to gain contrasting experiences of educational issues, such as discipline/behaviour management, for example.  \r\n","personalQualities":"At  PLSCITT we are also looking for the following qualities in our teachers:\r\n\r\nAn ability to relate to and engage with young people\r\nA clear commitment to a career in teaching\r\nEffective communication skills including use of written and spoken English\r\nStrong subject knowledge\r\nAn ability to explain concepts clearly\r\nA range of personal characteristics including flexibility, independence and resilience\r\nExcellent interpersonal skills with evidence of high levels of Emotional Literacy and Emotional Intelligence\r\nLeadership potential including evidence of Vision\r\nThe ability to work well effectively as part of a group\r\nInitiative\r\n","otherRequirements":" If a formal offer is accepted, applicants will be required to meet the Department for Education’s standards for physical and mental fitness to teach and clearance to work with children. Further information, including a Declaration of Health questionnaire and details of how to apply for a  DBS  will be sent to you after you have firmly accepted an offer.\r\n\r\nSubject enhancement courses are available for some secondary subjects. If your degree subject does not link to your chosen teaching subject, we can arrange for you to undertake a subject knowledge enhancement course before you begin training.\r\n\r\n","status":1,"createdAt":"2021-07-06T10:57:00.206Z","updatedAt":"2021-08-24T08:58:07.651Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
