{"id":"c3b95b53-f97e-470f-938e-72cd3adb4d06","name":"Physical Education","code":"2PT7","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"74d64a54-5e34-4590-b6c7-528dd0cf26fe","code":"C6","name":"Physical education"}],"locations":[{"id":"8859dd76-66eb-4eef-9270-1176db6001a6","name":"The Hollins","isPublished":"Y","status":"R"},{"id":"d4861960-23d0-4382-aa2a-37b22a71fc85","name":"The Hollins Technology College","isPublished":"Y","status":"R"},{"id":"bd01d126-592a-439a-8b2a-58498bfc43ee","name":"Marsden Heights Community College","isPublished":"Y","status":"R"},{"id":"e87227e6-097e-44ff-9bab-a9d337c071fa","name":"Ribblesdale High School","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"76c55af9-5232-41bd-a308-9fc5a4270cdd","code":"P38","name":"Pennine Lancashire SCITT"},"profPost":"BO","degreeGrade":"9","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"e will accept the equivalence tests from https://www.prestoleescitt.co.uk/Equivalency-Testing/\n\nplease contact us if you have any other for us to check","courseLength":"OneYear","feesUK":9000,"aboutCourse":"Physical education is a creative discipline that equips pupils with a uniquely powerful set of tools to support the development of the Whole Child, assisting pupils in their emotional and physical development, enabling pupils to make healthy lifestyle decisions. Teaching physical education inspires all pupils to succeed and excel in competitive sport and other physically demanding activities, whilst providing opportunities for pupils to become physically confident in a way which supports their health and fitness. It builds character and helps to embed values such as fairness and respect through competition in sport and other activities. In short, establishing a sense of wonder and fascination with Physical Education is at the heart of an outstanding Physical Education teacher’s role.\r\n\r\nThe PL SCITT physical education course will provide you with a wealth of practical teaching experience. However, it is carefully designed to ensure you are prepared for your first lessons in the classroom and on the pitch.  We ensure you receive the necessary training in health and safety, preparation and planning so that you are confident when you first stand in front of the class.  \r\n\r\nWe work in partnership with other SCITTs in the north west of England to provide the subject specific pedagogy that underpins your classroom practice. Specialist Practitioners in Education (SLEs) lead these sessions, which don’t just allow you to gain knowledge of the best practical teaching approaches but also give you the opportunity to share ideas with other trainees in a wide range of schools. \r\n\r\nYou will be assessed both for Qualified Teacher Status (QTS) and through written assignments for Post Graduate Certification (PGCE). They are separate awards however, and the whilst the QTS will be assessed by ourselves within the SCITT, the PGCE will be assessed by  your university tutors.\r\n","interviewProcess":"Our interview procedure is a rigorous process, including a panel interview, subject knowledge audit and mini teach. \r\n\r\nFurther details of the interview process will be given to those successful at the first stage of the application process.","howSchoolPlacementsWork":"The Training Programme is designed by experienced professional practitioners who share a passion for teaching and learning.  Our common commitment is to ensure that our next generation of teachers is equipped on every level - personally, intellectually and professionally - to inspire new generations of learners in our schools. \r\n\r\nThe schools that form our SCITT partnership are:\r\n\r\n\r\nThe Hollins, Accrington\r\nMarsden Heights Community College, Nelson\r\nRibblesdale High School, Clitheroe\r\n\r\n\r\nThroughout, you will be challenged, stretched, encouraged and driven to become an outstandingly good teacher.  You will be trained in at least two of the partner schools in order to gain contrasting experiences of educational issues, such as discipline/behaviour management, for example.  \r\n","personalQualities":"At  PLSCITT we are also looking for the following qualities in our teachers:\r\n\r\nAn ability to relate to and engage with young people\r\nA clear commitment to a career in teaching\r\nEffective communication skills including use of written and spoken English\r\nStrong subject knowledge\r\nAn ability to explain concepts clearly\r\nA range of personal characteristics including flexibility, independence and resilience\r\nExcellent interpersonal skills with evidence of high levels of Emotional Literacy and Emotional Intelligence\r\nLeadership potential including evidence of Vision\r\nThe ability to work well effectively as part of a group\r\nInitiative\r\n","otherRequirements":" If a formal offer is accepted, applicants will be required to meet the Department for Education’s standards for physical and mental fitness to teach and clearance to work with children. Further information, including a Declaration of Health questionnaire and details of how to apply for a  DBS  will be sent to you after you have firmly accepted an offer.\r\n\r\nSubject enhancement courses are available for some secondary subjects. If your degree subject does not link to your chosen teaching subject, we can arrange for you to undertake a subject knowledge enhancement course before you begin training.\r\n\r\n","status":1,"createdAt":"2021-07-06T10:57:00.407Z","updatedAt":"2021-08-24T09:03:21.012Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
