{"id":"5b8fa600-3faf-44c0-b8a7-9e0905eef815","name":"Primary","code":"L035","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_7","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"63fa0afa-f27d-4ca3-b039-7ae0bdcd6e7b","name":"St. John's Primary School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"70891310-458b-4fb9-aaa0-91349926edc6","code":"1X5","name":"Penistone Area Partnership"},"accreditedBody":{"id":"899178cc-20a7-4df5-951a-ee83c1b3d4d1","code":"S21","name":"Sheffield Hallam University"},"profPost":"PG","degreeGrade":"1","english":"1","maths":"1","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"During the study of the course you will follow a programme of professional development to enhance your teaching pedagogy, alongside placements within your partnership’s schools. During your placement you will have the opportunity to observe and teach over various key stages, in a variation of schools. You will attend Sheffield Hallam University during professional development days, where you will benefit from high quality sessions from research informed practise, who will also provide assignment and teaching support, with the lead school in the partnership providing bespoke training to meet your needs and develop your teaching pedagogy.\r\nEvery trainee must also undertake a short secondary placement as part of their professional development during term, alongside observing SEND and EAL students. This will be undertaken at one of the partnership secondary schools.\r\nTo support trainees knowledge development, it may be possible to undertake an SKE (Subject Knowledge Enhancement) which will be delivered by an outstanding practioner from across the partnership.\r\nDuring the year trainees will complete professional assignments, which are worth master’s credits, gaining 60 in total. \r\nUpon completion of the course you will be awarded either QTS (Qualified Teacher Status) or QTS with PGCE (Post Graduate Certificate in Education), both allow you to continue into the teaching profession.\r\nAs part of ongoing support, each trainee will benefit from a school-based mentor, academic tutor, and a university link who are all experienced, helpful and approachable.\r\n","interviewProcess":"Once your application has been submitted and reviewed, the candidate will be invited to attend an interview at Penistone St Johns Primary School.\r\nAs part of the interview process the candidate will be interviewed by the School Direct Lead alongside a leading member of staff from the host school. It may also be possible a member of Sheffield Hallam University will attend the interview.\r\nThe interview will consist of;\r\n* formal interview\r\n* group activity\r\n* literacy task\r\n\r\nIf the candidate is successful, you will be offered a conditional or unconditional offer.\r\n","howSchoolPlacementsWork":"Each trainee undertakes 2 placements over the key stages (3-7) during the year.\r\n* Placement 1: Host school 1 (Term 1 & 2)\r\n* Placement 2: Host School 2 (Term 3)\r\n* Placement 3: Host School 1 (Term 4-6)\r\n\r\nThe partner schools include;\r\n* Cawthorne C of E  Primary School \r\n* Marsden Junior School \r\n* Millhouse Primary School \r\n* Penistone St John’s VA Primary School (Lead)\r\n* Silkstone Primary School \r\n* Silkstone Common Junior and Infant School \r\n* Tankersley St Peters CE Aided Primary School  \r\n* Thurgoland CofE Primary School \r\n* Thurlstone Primary School\r\n\r\n","personalQualities":"Do you have an engaging personality? High expectations? Good communication? \r\nThen you could be the future of the teaching profession here at the Penistone Area Partnership.\r\n","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:47:55.590Z","updatedAt":"2021-07-07T12:45:20.208Z","canSponsorStudentVisa":"no","cycle":"2024"}
