{"id":"2180c391-9b9c-40bc-bb76-45d86ba88d9b","name":"English","code":"346S","qualification":"pgce_with_qts","startDate":"2024-07-31T23:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3aed1aa8-ae46-4b68-92bb-a6cc20655c59","code":"Q3","name":"English"}],"locations":[{"id":"4c3e1024-5622-4e6d-9110-ff4b65b74234","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"ef09ce50-ccfc-4346-a0ce-43e840153dab","code":"W20","name":"The University of Warwick"},"profPost":"PG","degreeGrade":"1","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We can accept 3rd party tests from the following approved companies:\n\nEquivalency Testing - Offer a discounted rate of £160 (normal price £175)\n\nA Star Equivalency - Have a special offer for University of Warwick applicants for equivalency exams (all subjects) to be booked for £139 (normal price £165)\nPlease contact cte.admissions@warwick.ac.uk for the discount code.","courseLength":"OneYear","feesUK":9250,"feesInternational":20055,"feeDetails":"Fees are for 2021/22 academic year and subject to change. \r\n\r\nAdditional costs incurred during your PGCE training year\r\nTravel\r\nTrainees are required to pay for their travel to and from their placement schools either using private and public transport. You will need to be prepared for the possibility of extra travelling time to and from your schools – possibly over an hour by car or significantly longer by public transport, although we make every reasonable effort to minimise your journey times.\r\n\r\nBooks\r\nBooks are recommended but there is no requirement to purchase specific texts and you have access to the University of Warwick library.\r\n\r\nMaterials\r\nYou will need writing materials. Ideally, you will need a laptop or tablet: you will certainly need access to some type of PC.\r\n\r\nFees\r\nIf you are a nationality other than 'British' selected on your application you may be classed as having overseas fees status unless proven otherwise. Please contact our International Office for advice on your fees status before you apply (https://warwick.ac.uk/services/academicoffice/finance/policies/homefees/).\r\n","aboutCourse":"This course prepares you to teach English to pupils aged 11 to 18. You should consider this course if you want to contribute to young people's development by enabling them to acquire a knowledge base in English as well as the skills associated with practical aspects of the subject.\r\n\r\nOn a personal level, you will develop a professional understanding of current issues in education along with the ability to effectively communicate and reflect upon your teaching.\r\n\r\nOur aim is to produce confident, imaginative and successful English teachers.\r\n\r\nYou will be taught and supported by highly experienced teams who have a national reputation for the quality of their training. \r\n\r\nFurther Information:\r\nhttps://warwick.ac.uk/fac/soc/cte/start-teaching/secondary","interviewProcess":"Due to the current crisis the interview day has been moved to an on-line platform for the time being.  We will update according if this is likely to change.  ","howSchoolPlacementsWork":"In partnership with our schools, we ensure you have access to the best and most inspiring, practising teachers and mentors. You will have opportunities to observe the best classroom practice and your individual needs will be met through mentoring on each of your placements. \r\n\r\nFurther Information:\r\nhttps://warwick.ac.uk/fac/soc/cte/start-teaching/secondary#inspiring\r\n","personalQualities":"Through your motivation, enthusiasm and passion for a subject, you can make a difference to students. Teaching is full of challenges and extraordinary rewards and the best teachers nurture creativity, discovery and character development in students.\r\n\r\nFurther Information:\r\nhttps://warwick.ac.uk/fac/soc/cte/start-teaching\r\n","otherRequirements":"Fitness to Teach\r\nIn order to comply with the Department for Education, all applicants must satisfy to the University their physical and mental suitability to undertake teacher training.\r\n\r\n\r\nSchool Experience\r\n\r\nAlthough it is not a requirement, we recommend that you have had experience in schools focusing on mainstream Key Stages 3, 4 and 5, so that you are familiar with the atmosphere and demands across Secondary. \r\n(https://warwick.ac.uk/fac/soc/cte/start-teaching/school-experience)\r\n","status":1,"createdAt":"2021-07-06T10:54:27.142Z","updatedAt":"2021-10-04T12:49:53.579Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
