{"id":"83d475ab-6d79-470e-9f42-908ca65473bf","name":"Primary (2-7)","code":"X121","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"2_to_7","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"4c3e1024-5622-4e6d-9110-ff4b65b74234","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"ef09ce50-ccfc-4346-a0ce-43e840153dab","code":"W20","name":"The University of Warwick"},"profPost":"PG","degreeGrade":"1","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We can accept 3rd party tests from the following approved companies:\n\nEquivalency Testing - Offer a discounted rate of £160 (normal price £175)\n\nA Star Equivalency - Have a special offer for University of Warwick applicants for equivalency exams (all subjects) to be booked for £139 (normal price £165)\nPlease contact cte.admissions@warwick.ac.uk for the discount code.","courseLength":"OneYear","feesUK":9250,"feesInternational":20055,"feeDetails":"Fees are for the 2021/22 academic year and subject to change. \r\n\r\nIf you are a nationality other than 'British' selected on your application you may be classed as having overseas fees status unless proven otherwise. Please contact our International Office for advice on your fees status before you apply (https://warwick.ac.uk/services/academicoffice/finance/policies/homefees/).\r\n\r\nAdditional costs incurred during your PGCE training year: \r\n\r\nTravel\r\nTrainees are required to pay for their travel to and from their placement schools either using private or public transport. You will need to be prepared for the possibility of extra travelling time to and from your schools – possibly over an hour by car or significantly longer by public transport, although we make every reasonable effort to minimise your journey times.\r\n\r\nBooks\r\nBooks are recommended but there is no requirement to purchase specific texts and you have access to the University of Warwick library.\r\n\r\nMaterials\r\nYou will need writing materials. Ideally, you will need a laptop or tablet: you will certainly need access to some type of PC.\r\n\r\n","aboutCourse":"Our Primary (2-7 year olds) programme aims to develop you into a highly reflective practitioner, passionate about working with young children. It's based on a partnership between us and over 400 local schools in the region. \r\n\r\nStudying at Warwick means you’ll be taught and supported by highly experienced tutors, practitioners, and mentors. \r\n\r\nWe're known nationally for the quality of our training and the high outcomes for our trainees.\r\n\r\nYou’ll take part in interactive lectures, seminars and workshops, and a number of placements. You'll be challenged to develop your subject knowledge and expertise both in the classroom and outside of it; but balanced with more personalised support.\r\n\r\nProgrammes offer the opportunity for independent study and bespoke study ‘spaces’ across Warwick campus.\r\n\r\nThe course comprises of three modules.  They're all designed to equip you with the knowledge, understanding and practical skills you'll need in your successful teaching career:\r\n\r\nProfessional Studies\r\nYou'll develop a good understanding of the key factors in successful learning and teaching. We address central issues of planning, teaching, assessing and behaviour management as well as addressing such issues as the safeguarding of children, .\r\n\r\nSubject Studies\r\nProgrammes cover the three core subjects (English, Mathematics and Science) as well as non-core (Foundation) subjects: Art and Design, Computing, Design and Technology, Geography and History, Music, R.E., PSHE, developing your subject knowledge and pedagogy.\r\n\r\nProfessional Practice \r\nYou'll take placements in different settings to broaden your experience. This will help you develop an awareness of your professional development, reflect on progress on school placements and set targets for successful completion of the programme.\r\n\r\nBy the end of the course, you will meet the standards for Qualified Teacher Status and will be awarded a PGCE with 90 credits towards a Masters’ Degree at Warwick.\r\n\r\nFurther Information:\r\nhttps://warwick.ac.uk/fac/soc/cte/start-teaching/primary#inspiring","interviewProcess":"Due to the current crisis the interview day has been moved to an on-line platform for the time being.  We will update accordingly if this is likely to change.  \r\n\r\nIf invited for an interview, you will be required to engage in a number of tasks including:\r\n\r\n*Presentation by a PGCE Primary tutor\r\n*An individual presentation\r\n*An individual interview\r\n\r\nThere will be opportunities to meet a member of the PGCE Primary team who will be able to answer any questions you may have.\r\n\r\nIf you are successful, you will be sent a Needs Analysis Form which identifies targets for you to work on prior to starting the course.  \r\n","howSchoolPlacementsWork":"During this course, trainees will spend at least 120 days in school.  We’ll work with local partners to give you inspirational placements in local settings. You’ll be taught best practice in the classroom and be mentored on your placements, which will take place as follows:\r\n\r\nSerial Days: days of observation organised by the University in a local primary school to support trainees in developing an understanding of key aspects of teaching and classroom management.\r\n\r\nThree extended Professional Practice Placements in contrasting settings and age ranges in the autumn, spring and summer terms. For each of these placements, you will be assigned a class, school-based mentor as well as a university moderation-link tutor.  Over the course of each placement, you will emerse yourself in the day-to-day life of the school and gradually build up your teaching commitment to 80% of the timetable in the summer term.\r\n\r\nExperiential days: mini-placements focusing on EAL, Outside Learning Contexts, Transition\r\n\r\nSpecial Educational Needs and Disability: a week of observation organised by the University in a local special school providing an opportunity for trainees to observe specialist teaching\r\n\r\nFurther Information:\r\nhttps://warwick.ac.uk/fac/soc/cte/start-teaching/primary#inspiring","personalQualities":"Through your motivation, enthusiasm and passion for a subject, you can make a difference to students. Teaching is full of challenges and extraordinary rewards and the best teachers nurture creativity, discovery and character development in students.\r\n\r\nFurther Information:\r\nhttps://warwick.ac.uk/fac/soc/cte/start-teaching","otherRequirements":"Fitness to Teach\r\n\r\nIn order to comply with the Department for Education, all applicants must satisfy to the University their physical and mental suitability to undertake teacher training. \r\n\r\nSchool Experience\r\n\r\nAlthough not a requirement, recommend you have some experience in schools and/or Early Years settings focusing on the Foundation Stage as well as Key Stage 1 classrooms, so that you are familiar with the atmosphere and demands across the early years. (https://warwick.ac.uk/fac/soc/cte/start-teaching/school-experience)\r\n","status":1,"createdAt":"2021-07-06T10:54:27.430Z","updatedAt":"2021-10-04T12:53:06.231Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
