{"id":"fe790625-1ebb-4795-ae93-56ea3a9493c9","name":"Primary","code":"22FD","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"80f1a615-a109-4e38-8e11-3302e60f0f6a","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"13e1009e-7679-4772-afbd-39b47aed2a26","code":"1B5","name":"Severn Training and Schools Alliance"},"accreditedBody":{"id":"e843cb68-d310-478c-8dba-cf9633fea086","code":"C55","name":"University of Chester"},"profPost":"BO","degreeGrade":"1","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"Tests must be recognised by the University of Chester as an acceptable GCSE equivalent - please check with us before undertaking any equivalency test to ensure it is accepted.","courseLength":"OneYear","feesUK":9250,"feeDetails":"Course fees can be covered by a Student Loan as with all university courses and repayments will only start once full time employment begins.","aboutCourse":"Our School Direct Primary (non salaried) course is a one year Initial Teacher Training programme for those who want to teach Primary age children (4-11).  The course consists of two contrasting school placements, covering both key stages,  and centre based training days, where you will come together as a complete cohort to cover all curriculum subjects and a wide range of other topics.  Our Associate Teachers spend 120 days across the year on placement providing optimum opportunity to learn and develop as a teacher alongside highly experienced professionals in our good and outstanding partner schools.\r\n\r\nEach Associate Teacher is provided with a robust support network including a mentor, QA lead and University Link Tutor to guide them through the year.\r\n\r\nIn partnership with the University of Chester you will work towards gaining a Post Graduate Certificate in Primary Education.  Academic sessions all take place in Telford, and you will complete three assignments during the year.\r\n\r\nOur Primary course takes place entirely in Telford.","interviewProcess":"Our interview process is an opportunity for candidates to show us their enthusiasm for teaching and demonstrate various skills such as interaction with pupils and knowledge of education.  Depending on COVID restrictions our interview days will take place in one of our alliance schools, and will involve at least one senior leader from that school, as well as our director of ITT.  The day will consist of individual and group tasks.\r\n\r\nCandidates will be usually be notified of the outcome of their interview day within 24 hours, and we encourage all candidates to engage with all their chosen providers prior to making a decision on which course to choose.","howSchoolPlacementsWork":"We are extremely privileged to have 50 local schools within our Alliance, who fully support our Initial Teacher Training programme.  This provides us and our candidates with many and varied options when it comes to placement schools.  We take pride in matching our Associate Teachers to placements which best fit with them, for instance taking into account travel restrictions, and can also offer placements in local special schools for those who want to take that career path. \r\n\r\nYou will undertake two placements, in contrasting schools.  Your A placement will be the Autumn Term, you will go to a B placement for the Spring Term, returning to your A placement for Summer.  Centre based sessions are interspersed with school based days to provide a good balance.  Your school based days and teaching time will gradually increase as the course progresses.  In total 120 days are spent on placement during the academic year.","personalQualities":"Candidates need to have a genuine passion for teaching.","otherRequirements":"Ideally all applicants should have some school based experience, whether as a volunteer or having worked in school in a non teaching role.  \r\n\r\nDue to our relationships with our Alliance schools if this is something you need help or guidance with we will endeavour to help.\r\n\r\nAll candidates will be required to undertake a new DBS clearance via the University of Chester prior to the course commencing.","status":1,"createdAt":"2021-07-06T10:52:58.368Z","updatedAt":"2021-09-17T11:18:38.493Z","canSponsorStudentVisa":"yes","cycle":"2024"}
