{"id":"1ab56539-1904-4817-ab2e-e6e5b0a716de","name":"Primary","code":"38X4","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"7ee7c999-a274-43fb-bb4f-44c6bd2d7746","name":"Heybridge Primary School","isPublished":"Y","status":"R"},{"id":"ae292025-a181-4f79-8a19-1fff624d14b2","name":"Stapleford Abbotts Primary Academy","isPublished":"N","status":"S","vacancies":"F"}],"trainingProvider":{"id":"16996284-9b77-4e09-aff9-50968b547dda","code":"2AP","name":"Debden Park High School"},"accreditedBody":{"id":"1b2e3a7d-f712-48ff-b866-4a49733b8ab0","code":"K13","name":"TKAT SCITT"},"profPost":"PG","english":"3","maths":"3","science":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","aboutCourse":"Our programme prepares our trainees to be excellent teachers to enable them to deliver high quality, purposeful and inclusive learning experiences, inspiring a love of learning and successful outcomes.\r\n\r\nSalaried trainees may have responsibility for their own class and may be expected to teach a higher percentage of the teaching timetable compared to an non-salaried trainee.\r\n\r\nThis is achieved through:\r\n\r\n* A school-based programme where trainees work alongside expert colleagues four days a week\r\n\r\n* Trainees develop their knowledge and understanding of teaching through a weekly professional  studies day delivered at the regional training centre or through remote learning\r\n\r\n* All training is underpinned by current high-quality evidence and research \r\n\r\n* The General Professional Studies programme combines a pedagogical approach to learning with practical strategies for use in the classroom\r\n\r\n* Trainees will gain experience from practising teachers as well as specialist speakers in behaviour management, special educational needs and health and well-being\r\n\r\n* A two-week induction programme which provides every trainee with the knowledge and skill-base to prepare them for their placement schools, where they will observe expert colleagues in preparation for teaching\r\n\r\n* Dedicated mentor support throughout the programme with weekly observations and mentor meetings where targets are set to support a trainee’s development\r\n\r\n* Primary subject and curriculum knowledge support from expert practitioners\r\n\r\n* Experience and understanding of the key stages on either side of the training programme.\r\n\r\n* Course assignments are designed to help trainees demonstrate they have met the curriculum through planning, preparation and assessment of pupils. The programme is assessed through continual course work; there are no final exams.\r\n","interviewProcess":"Candidates take part in a selection and recruitment process designed to assess their suitability to train to teach. \r\n\r\nThe aim of the interview process is for candidates to demonstrate why they have chosen teaching as a career and allow us to see their potential as a teacher.\r\n\r\nThe interview will take place online and the administration team will take you through a step-by-step process.\r\n\r\nIf successful, candidates will be made a conditional offer of a place on the TKAT SCITT programme, subject to all course requirements being met.\r\n","howSchoolPlacementsWork":"Applicants apply for their preferred school where they will spend the majority of their training year. \r\n\r\nTrainees are required to complete a second (B) placement as part of training. \r\n\r\nThe second placement (B) will be for a minimum of four to six weeks in a contrast key stage and setting. This enables us to ensure that we offer trainees a breadth of experience in their training year. Every effort is taken to place trainees in a school geographically convenient for them, without compromising their training needs.\r\n\r\nOur programme is full-time (term time only). Trainees spend four days a week in school and one day a week at the allocated training hub for primary (The Atkins Centre, Sidcup) or via online training sessions. \r\n\r\n","personalQualities":"We are seeking  well-qualified graduates who have a passion for learning and a commitment to helping children be the best that they  can be.","otherRequirements":"* Disclosure Barring Service (DBS) Enhanced clearance;\r\n* Two satisfactory references;\r\n* Recommended as medically fit to teach.\r\n\r\n(TKAT SCITT meet the cost of the Enhanced DBS, however, if an overseas check is necessary, the additional cost will be met by \r\nthe trainee).\r\n\r\nTKAT is committed to safeguarding and promoting the welfare of our students, and expects all staff, trainees and volunteers to share this commitment.  \r\n\r\n","status":1,"createdAt":"2021-07-06T10:53:05.514Z","updatedAt":"2022-02-02T11:34:10.000Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"Trainees on the salaried route will be paid on an unqualified teachers' pay scale 1 (minimum) at the discretion of each individual employing school, and as advertised.\r\n\r\nThe cost of the Qualified Teacher Status (QTS) fee is met by the employing school.\r\n\r\nThe cost of the Post- Graduate Certificate in Education (PGCE) with 60 Masters Credits (optional) is £2,000 and is met by the trainee.\r\n\r\n* Please note that salaried trainees are not eligible for student finance and therefore would need to self-fund their PGCE fee.\r\n"}
