{"id":"d0f85fae-cb2e-4b8c-9462-5022e5612341","name":"Chemistry","code":"3CH4","qualification":"pgde_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_19","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"912d4fb4-761b-42e9-8dc6-e968b791ea4e","code":"F1","name":"Chemistry"}],"locations":[{"id":"d3f4ad6b-c652-4102-94df-e8b604e09a20","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"43c2e3e6-8768-4db6-b55f-c6c538c67ec8","code":"2L9","name":"Ashfield School ITT"},"accreditedBody":{"id":"7d0c173d-d084-47d1-8aea-909930227991","code":"S18","name":"The University of Sheffield"},"degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"If less than 50% of your degree is in your specialist subject you will be required to undertake an SKE course as a condition of entry.\n\nAs this is an 11-19 course we are preparing students to teach up to A-level and will normally take into account the balance of your degree content and profile of GCSE and A-level (or equivalent) subjects and results to assess your suitability for the programme.\n\nIf you have non-standard qualifications you are welcome to contact us to discuss your eligibility.","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We do not accept equivalency tests from third party organisations. If you are required to take an equivalency test, we will provide full details about our own test(s) at interview.  There is no charge for our tests.","courseLength":"OneYear","feesUK":9250,"feeDetails":"As this course leads to a professional qualification, student teachers will be required to undertake a DBS Enhanced Disclosure and Work Health Assessment. All Student teachers will also be required to complete Safeguarding training. The cost for these will be £71 and payable via the University's Online Shop. Student teachers who have already paid for a previous DBS Enhanced Disclosure and signed up to the DBS update service will need to pay the reduced cost of £27 via the University's Online Shop. These fees also include the cost of a learning journal, which will be provided at the start of the course.\r\n\r\nFurther information about fees and funding for the PGDE can be found [here](https://www.sheffield.ac.uk/education/mastersdegrees/pgde/pgce-fees-and-funding)\r\n","aboutCourse":"In partnership with the University of Sheffield and a wide range of partner schools, Ashfield School is offering an Initial Teacher Training (ITT) programme in secondary education for the 2022/2023 academic year in Biology.\r\n\r\nSuccessful applicants will complete their training in a school with over 10 years experience of supporting and developing trainee teachers into good and outstanding practitioners. Trainees will be given the opportunity to work in modern, well-equipped classrooms in one of the largest 11-19 secondary schools in the UK, located just five minutes from Junction 28 of the M1. \r\n\r\nThroughout the training year, trainees will be supported by their subject-based mentor, the School Direct Leader and by a wide range of experienced TLR holders who will deliver regular training sessions throughout the year. The School Direct course will enable trainees to gain QTS status, a PGDE qualification and MA credits awarded by the University of Sheffield on successful completion. \r\n\r\nWorking with our partner schools across the Two Counties’ Trust, Ashfield School ITT provide training placements in a variety of contexts, preparing graduates for a successful future in teaching. Furthermore, we will support trainees in the professional recruitment process should a suitable vacancy arise at Ashfield School or one of our partner schools.\r\n\r\nWe hope that you will choose to start your teaching career with Ashfield School ITT and help deliver an outstanding education for the benefit of the students in our care.\r\n","interviewProcess":"Once we receive your UCAS application we will consider a number of factors in making our decision about whether to interview you:\r\n\r\n* Do you demonstrate a clear interest in becoming a teacher?\r\n* Do you have strong references that suggest you have the capacity to train to be a teacher?\r\n* Do you have highly developed subject knowledge, or an awareness that you need to develop this?\r\n* Have you written a strong personal statement, demonstrating your commitment to teaching, your passion for your subject and an understanding of the realities of the profession?\r\n\r\nDepending on your subject, your selection day will take place either at the University or in a partner school, and will consist of the following elements:\r\n\r\n* Introduction to the course\r\n* A task designed to ensure that your subject knowledge is strong\r\n* A chance to interact with other candidates or with pupils, and to reflect on this experience\r\n* A written task\r\n* A formal interview, carried out by a university tutor and a school representative\r\n","howSchoolPlacementsWork":"\r\nYou will undertake four periods of school experience:\r\n\r\n* One week in a primary school early in the programme\r\n* A 7 week placement between October and December\r\n* A 14 week placement between February and June in a partner school\r\n* A 2-week enrichment/enhancement placement in June\r\n\r\nIn all curriculum areas you will also have the chance to visit a number of schools as a part of the University-centred parts of the PGDE. These visits will focus on specific themes such as working with pupils with EAL or supporting examination groups and will give you the opportunity to gain experience of schools beyond your main placements.\r\n\r\nWe work with over 40 schools in Sheffield, Barnsley, Derbyshire, Doncaster, North Nottinghamshire and Rotherham, as well as the schools in the Two Counties' Trust that we belong to. This range of inner-city, suburban and rural contexts provides rich opportunities for diverse and balanced experiences in schools, and we work hard to secure you two contrasting placements.\r\n\r\nWhen tutors are arranging placements, personal circumstances such as child-care and additional needs are taken into account as much as possible.\r\n\r\nFurther information about school placements can be found [here](https://www.sheffield.ac.uk/education/pgde).\r\n\r\n\r\n","personalQualities":"\r\nWe consider six key elements when selecting students for our PGDE programme:\r\n\r\n* Commitment to teaching\r\n* Insight into the realities of teaching\r\n* Resilience\r\n* An analytical approach to problem solving\r\n* Enthusiasm for your subject\r\n* Interpersonal and communication skills\r\n\r\nWe will consider your strengths in each area during the selection process, including when considering your application form.\r\n","otherRequirements":"As this course leads to a professional qualification, student teachers will be required to undertake a DBS Enhanced Disclosure and Work Health Assessment. All Student teachers will also be required to complete Safeguarding training.   Full information about how to undergo these checks will be provided once you accept your place on the course.","status":1,"createdAt":"2021-07-06T10:48:47.569Z","updatedAt":"2021-09-10T07:29:05.696Z","canSponsorStudentVisa":"yes","cycle":"2024"}
