{"id":"9c3a4517-63da-4c2b-9979-8eb688151978","name":"Primary","code":"R674","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"dc985419-1862-4ef0-98fb-4e629ac98a80","name":"St. Mary's Catholic Primary School","isPublished":"N","status":"S","vacancies":"F"},{"id":"45a67739-8682-402f-9bde-687ea435570a","name":"St. Gregory's RC Primary School","isPublished":"N","status":"S","vacancies":"F"},{"id":"0d03ff9b-90e4-4eeb-a483-c09ab6e84de3","name":"Our Lady of the Rosary Catholic Primary School","isPublished":"N","status":"S","vacancies":"F"},{"id":"787d1a54-d9df-46b4-8a0f-c75582246f7d","name":"SS Peter and Paul Catholic Primary School","isPublished":"N","status":"S","vacancies":"F"},{"id":"1c4ae60d-f59d-4943-9ffe-86934d384f70","name":"St. Aloysius Catholic Infant School","isPublished":"N","status":"S","vacancies":"F"},{"id":"68094602-76a7-4c35-a0da-9177da6ca064","name":"St. Joseph's Catholic Primary School","isPublished":"N","status":"S","vacancies":"F"},{"id":"88da893a-38e9-4dc0-aee0-7e7a7d9ba416","name":"St Matthew's Primary School","isPublished":"N","status":"S","vacancies":"F"},{"id":"3f51eff0-8b50-4ef3-8fd9-b56907671a42","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"},{"id":"3d35a643-a56a-4887-a319-1af778994369","name":"St. Aloysius Catholic Junior School","isPublished":"N","status":"S","vacancies":"F"}],"trainingProvider":{"id":"894dbbfd-63d0-46e7-870d-545d4cad5cd9","code":"1BM","name":"St Anthony’s Girls’ Catholic Academy"},"accreditedBody":{"id":"5bce9a0d-f372-4667-b3ec-3d58d42a1345","code":"C23","name":"Carmel Teacher Training Partnership (CTTP)"},"profPost":"PG","degreeGrade":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9000,"financialSupport":"Advice from Get Into Teaching Financial support from the government\r\nYou may be eligible for a loan while you study – note that you’ll have to apply for undergraduate student finance.\r\nFind out about financial support if you’re from outside the UK.\r\n","aboutCourse":"Professional Studies\r\nEvery aspect of the programme is focused upon developing trainees as professionals. Schools are involved in the recruitment and selection of trainees and want to recruit the most competent of teachers in their schools. The central training sessions address the key areas of professional practice including: - assessment, lesson planning, behaviour management, Safeguarding Level 1, Data and Progress 8, EAL, Inclusion and Diversity, Literacy, Phonics, Numeracy and Special Educational Needs and Disability; this training continues for trainees in their schools. Subject specific training is also delivered centrally and continues under the guidance of mentor and professional tutor. Leeds Trinity University deliver all elements of the PGCE academic reading and writing programme.\r\nCurriculum Studies\r\nThe training programme is designed to develop subject knowledge and understanding of the current curriculum issues in the chosen subject or phase of training.\r\nIn the classroom\r\nThe programme  develops pedagogical skills. The school- based training begins with observations of experienced practitioners where trainees learn to identify key elements of a successful lesson. Small group teaching, team teaching and co -planning of lessons are integral to build confidence and expertise. With this experience, trainees begin to develop all the skills of an outstanding teacher, independently and confidently planning and teaching. By the end of the training programme they will be teaching 70 -80% of an early Career Teacher's timetable.\r\nThe Assessment of Trainees\r\nFor the successful completion of the course, trainees must demonstrate competence against all the QTS standards. Trainees will be continually assessed through lesson observations. The Professional Tutor will complete a progress report each half-term which documents the progress made in each of the Standards. This is moderated by the Partnership Link tutor. Throughout the year, evidence will be collected in lesson observations, training and subject knowledge files and evidence against the standards is collated in a final presentation file. This evidence is also moderated by Leeds Trinity University.\r\n","interviewProcess":"The selection procedures which follow aim to ensure that: Entry requirements specified in DfE Qualified Teacher Status Standards (2012) are applied carefully, giving due weight to academic equivalencies, experiences and motivation.\r\nEntrants are given a sound understanding of the nature and demands of the course in order to assure successful applicants complete the course and enjoy their new profession in education.\r\nSelection will be based on: - a teaching activity related to the age and phase of the class, completion of a written task and a formal interview.\r\n","howSchoolPlacementsWork":"All trainees teach in two schools during their training year. Their second school placement is chosen to provide a different context to their main school experience. Trainees will have a mentor and professional tutor in this placement. A Partnership Link Tutor (PLT) is assigned to each trainee; each half term she/he will visit the trainee in school to support, observe and quality assure the school-based experience to moderate and to ensure consistency of training across the Partnership.","personalQualities":"We are looking for enthusiastic applicants with very good communication skills, the determination to succeed, a commitment to working hard and the ability to work with others. Successful applicants are confident and passionate about teaching and also able to contribute to the wider school ethos and community. Training to teach is both challenging and rewarding. Developing excellent interpersonal skills will enable trainees to support the learning of groups of young people from diverse backgrounds effectively. We are looking for people who strive to improve and who are committed to their own professional development.","otherRequirements":"All entrants will go through an enhanced Disclosures and Barring Service DBS, in order to ascertain that they have no criminal background which might prevent them from working with children. In addition, entrants are required to sign a declaration that they have not previously been excluded from teaching or working with children.\r\nSchool experience is a desirable characteristic but not essential and no applicant would be rejected because of a lack of school experience.\r\n","status":1,"createdAt":"2021-07-13T10:02:39.104Z","updatedAt":"2021-07-13T11:37:35.717Z","canSponsorStudentVisa":"no","cycle":"2024"}
