{"id":"fb506293-4996-4be0-82e5-289e6774437c","name":"Primary","code":"23Y9","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"390ae0ef-c913-4082-b19a-7a7926e1b7af","name":"The Mead at Wingfield","isPublished":"Y","status":"R","vacancies":"F"},{"id":"efb698c5-9beb-4df2-9b08-1cdcf1368a87","name":"Castle Mead School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"d8da9b94-d1ba-431f-ae64-1e151b076290","name":"The Mead Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"a07aa567-61f5-4f26-a1ea-0781d037aa99","name":"River Mead School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"54bc2ad7-9574-47b7-8fde-0737ec19d941","code":"1LE","name":"The Mead Academy Trust"},"accreditedBody":{"id":"9aa67012-b776-4027-89f4-5531efb3a9d2","code":"G50","name":"The University of Gloucestershire"},"profPost":"BO","degreeGrade":"1","english":"1","maths":"1","science":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We expect all Graduate Teachers joining our course to have passed any equivalency tests required by 1st July 2022. We do not provide equivalency testing - candidates will need to book and pay for this. The University of Gloucester can advise on appropriate equivalency tests, we are not able to advise or recommend any testing providers ourselves.","courseLength":"OneYear","feesUK":9250,"feeDetails":"This is a fee paying route, and is subject to the University of Gloucester's course fees.\r\n\r\nYou can read about them here: https://www.glos.ac.uk/life/finance/pages/postgraduate-fees.aspx","aboutCourse":"We call members of our School Direct Programme 'Graduate Teachers' (GTs) and they work within The Mead Academy Trust and our partner schools.  GTs follow a school-based training programme and work alongside outstanding practitioners. This develops the rigour, professional knowledge, understanding and skills necessary to create inspirational, creative, purposeful teachers, within a highly supportive environment.\r\n\r\nHigh quality training is delivered by outstanding teachers within The Mead Academy Trust, partnership schools and The University of Gloucester. Input within The Mead includes a range of specialist pedagogical workshops, seminars and practice-based opportunities. \r\n\r\nGTs have full access to The University of Gloucester, an outstanding provider of teacher education, and its excellent facilities.\r\n\r\nAll GTs receive the highest quality support throughout their School Direct experience from both The Mead and the University, including academic and pastoral support. The vast majority of training takes place in Trowbridge, and is facilitated by University and school staff. GTs attend the University's Cheltenham campus for a maximum of 8 days throughout the year. Access to your own transport, or willing use of public transport, is essential!\r\n\r\nEach GT is assigned a mentor who provides the highest quality coaching, mentoring and support.\r\n\r\nOur GTs receive dedicated SEND input, which ensures they are able to support the teaching and learning of children with additional needs. We also provide specialist music input. These enhanced modules provide pedagogical and practical input, supporting the development of a high level of knowledge, skills and understanding.\r\n\r\nThe programme begins on the first day of the school term and ends on the last day of the academic year. All GTs are welcomed as full members of staff and encouraged to immerse themselves in all aspects of school life (restrictions permitting), including development days, monitoring and evaluation, extra-curricular activities, residentials, and community events.\r\n\r\nHere are some of the things our past GTs said:\r\n'The Mead have provided a brilliant induction and everyone I've met has been so friendly and helpful. It's a very welcoming Trust! Overall a comfortable introduction to my teacher training with elements of stretch but no panic! One of the sessions I found most helpful was looking at the videos of teachers and analysing their teaching methods, questioning, behaviour management. This was really inspiring and very helpful in showing us how to observe and learn from our mentors'.\r\n\r\nThis fee-paying route is subject to the University's course fees (http://www.glos.ac.uk/life/finance/pages/fees.aspx).","interviewProcess":"Applications are carefully checked for spelling, grammar, and style of writing. It's a cliche but it's true - first impressions count. Make sure yours is a good one. You should complete the form with professionalism and attention to detail.\r\n\r\nYour personal statement and references should show us what you're like as a person.\r\n\r\nWhen you apply, we will aim to meet you personally and give you a tour of the school during your selection day. However, this may not always be possible and you could be invited to a virtual interview via an online video conference. We will let you know in your invite to interview whether it will be face-to-face or remote.\r\n\r\nEither way, this is your chance to share with us in more detail the type of person you are, and the kind of teacher you aspire to be. The panel will naturally have questions for you, and you will also have the chance to ask them questions.\r\n\r\nIf your presentation and interview are successful, we will make you an offer. ","howSchoolPlacementsWork":"Our Graduate Teachers (GTs) complete three placements during their School Direct year and are placed in at least one Mead Academy Trust school: \r\nTerms 1 & 2: Placement 1 - Host school within The Mead Academy Trust \r\nTerms 3 & 4: Placement 2 (Main Placement) - Alternative placement school within The Mead Academy Trust or a partner school\r\nTerms 5 & 6: Placement 3 (Enhancement Placement) - Placement school within The Mead Academy Trust\r\n\r\nWe will ensure that you have had the opportunity to teach in Key Stage 1 and Key Stage 2, and in two different schools, during your training year. \r\n\r\nTeachers from all Trust schools join together either face to face or remotely for staff meetings, planning, and social events, which ensures best practice and knowledge is shared across all of our schools.\r\n\r\nOur GTs are an integral part of these activities and benefit from the wealth of experience working across three schools brings.\r\n\r\nWe work hard to place GTs in a school that fits their needs and preferences. \r\n\r\nWe fully recognise the vibrancy, enthusiasm and drive GTs offer our school communities and our teachers are eager to share their knowledge and practice with the next generation. \r\n\r\nThe School Direct partnership does not provide any accommodation for GTs. However, there is a good range of rental accommodation available at reasonable prices.\r\n\r\nA range of childcare providers are available locally, including a nursery at all three schools. Our nurseries accept 2 and 3 year old funding, but you will need to apply for a place as you would any setting. Find more information about our nurseries on our individual school websites, and Wiltshire Council offers an online directory of providers: http://services.wiltshire.gov.uk/ChildCareOnline/index.php\r\n\r\nApplicants who would benefit from any environmental adjustments should let us know on application so we can ensure placements are made at appropriate schools. Please contact us at hello@themeadtrust.org to discuss specific access issues further.\r\n\r\nTrowbridge, Melksham and the surrounding area is well served by mainline rail/bus services.\r\n","personalQualities":"Our Graduate Teachers (GTs) are: \r\n\r\n* Passionate and enthusiastic\r\n* Motivated to become dedicated teachers\r\n* Eager to learn from our experienced staff\r\n* Able to respond positively to advice/mentoring\r\n\r\nYou need to be:\r\n\r\n* Confident with staff/parents/children\r\n* Able to build good relationships\r\n* Highly organised\r\n* Professional from day one\r\n* Able to demonstrate your motivation/ability to teach\r\n\r\nYou need to have some experience of working with children and be able to demonstrate how this inspired you to teach.\r\n\r\nSome GTs join us from University, others are pursuing a second career and we welcome applicants from all backgrounds.\r\n","otherRequirements":"Disclosure & Barring Scheme: You will be subject to an enhanced DBS check before you can begin your course.\r\n\r\nExperience: Before beginning the programme you need experience of working with primary school children - e.g. voluntary work with a children's group, or in a school. Crucially, you need to demonstrate how this experience has inspired you to become a teacher.\r\n\r\nTraining: You must complete online safeguarding, Prevent & GDPR training before beginning the course","status":1,"createdAt":"2021-07-06T10:48:58.410Z","updatedAt":"2021-07-07T14:14:27.432Z","canSponsorStudentVisa":"no","cycle":"2024"}
