{"id":"5cb0181e-b4b8-4578-856e-a3c3071637fd","name":"Primary","code":"J298","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"TA","fundingType":"apprenticeship","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"b8ec5665-ed06-4476-84b7-c157bc129c7f","name":"Main Site","isPublished":"Y","status":"S"}],"trainingProvider":{"id":"1f91f989-047b-4bbc-a73e-d45ffcfc1f28","code":"N43","name":"Norfolk Teacher Training Centre"},"degreeGrade":"9","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","aboutCourse":"The Postgraduate Teaching Apprenticeships (PGTA) programme provides an employment-based route leading to the award of Qualified Teacher Status (QTS). \r\n\r\nThe entry requirements for PGTA programmes are exactly the same as all graduate teacher-training routes, but the PGTA is specifically suited to those who already have strong experience working with children in the age range for which they wish to teach.  \r\n\r\nTo be ready for an apprenticeship, you will have already secured employment/come to an agreement with a school who want to employ you and support you throughout your training year.\r\n\r\nAs part of your programme, you will receive:\r\n80% in the classroom gaining practical experience and skills supported by your school-based mentor. This will involve subject knowledge, lesson observation, team teaching, solo-teaching and learning support \r\n20% of your course time will be spent off-the-job training back at college. This is largely provided by following the same PD programme as our school-direct trainees at College but can include other training based at your school.\r\n\r\nAfter successfully gaining QTS, you will be put forward to complete your End Point Assessment (EPA), in agreement with your employer. The EPA involves a formal observation and professional discussion conducted by an external assessor. This final assessment shows successful completion of your apprenticeship.\r\n","interviewProcess":"We are looking for people who can show that they are resilient and committed to both working with young people and joining the teaching profession. We are particularly interested in talking to people who have a proven track record in working with young learners.\r\n\r\nInterviews with either take place at your employing school or at City College Norwich within Covid19 guidelines. You will be fully briefed on the format. If we are unable to do face-to-face interviews they will be held online. You will be asked to carry out a 10-minute activity and then answer formal questions to enable us to judge that you are suited to the course.  \r\n","howSchoolPlacementsWork":"Individuals applying for this route will have already secured employment with a school who will support you through the majority of your training. NTTC works closely with the individual and their employing school to secure a second placement with another school within our partnership.","personalQualities":"Most importantly, you will be able to demonstrate why you want to work with young children and prove your commitment to the primary sector.","otherRequirements":"Most candidates will be able to demonstrate experience working with young people. However, we evaluate each application on a person-by-person basis and we are keen to take all your experience in to account. We will check your application against the Children’s Barred list and require a full DBS check from the school you are working in. \r\nFor all Primary Teaching Apprenticeships, you will need to have an employer, or come to an agreement with a school who is prepared to employ you from the start of the course.\r\n","status":3,"createdAt":"2021-07-06T10:53:38.188Z","updatedAt":"2021-08-24T14:22:57.366Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024"}
