{"id":"646ed0be-1d66-4a14-b001-8685d6203198","name":"Physics","code":"E815","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"bf97cd0a-224c-43d3-a021-84143df13e8d","code":"F3","name":"Physics"}],"locations":[{"id":"eafaa4fa-b615-4e64-8451-3d28fad920ac","name":"Reach Academy Feltham","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"1a66be16-ab17-44ac-982a-02035d8c3e84","code":"7K1","name":"Reach Academy Feltham"},"accreditedBody":{"id":"ff5e78c6-2928-44d6-b4e6-8fa2fed5feb7","code":"S66","name":"South West Teacher Training"},"degreeGrade":"9","additionalDegreeSubjectRequirements":"false","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":8350,"financialSupport":"If you are a trainee and you are not eligible for a government bursary, you may be eligible for a bursary from the Reach Foundation of up to £10,000. These bursaries are available for prospective trainees that would not be able to afford to train as a teacher without further financial assistance.","aboutCourse":"You will learn how to teach students about the laws of the universe and how these laws can help scientists to discover new things that we have previously not understood. You will train students in the use of mathematics to describe the behaviour of physical objects in a range of real world applications. Through practical work, you will prepare students to be the physicists and engineers of the future.\r\n\r\n\r\nThe programme includes:\r\n\r\n- In-house training days (1 day a week) - seminar and lecture style sessions and live practice that cover teaching theory, teaching techniques, pedagogy and academic literature (including ‘guest lectures’ from expert practitioners).\r\n\r\n- In-school teaching (4 days a week) - you will be: planning for, preparing and delivering lessons; observing and supporting the lessons of other teachers; and taking part in the day to day running of the school.\r\n\r\n\r\nCourse structure\r\n\r\nTrainees complete the following stages of progression (including hours of teaching each week):\r\n\r\n* Confident Teaching Assistant – 0-3 hours\r\n* Competent Lesson Deliverer – 3-6 hours\r\n* Considered Lesson Planner and Evaluator – 6-9 hours\r\n* Independent Early Career Teacher – 9-12 hours (or more)\r\n\r\nThe rate at which you progress will be decided in consultation between the trainee, their mentors in school and the course leader.\r\n\r\n\r\nAssessment\r\n\r\nYou will be assessed in your progress in the following ways:\r\n\r\n-          \tInformal mentor drop-ins weekly\r\n-          \tHalfway progress check\r\n-          \tFormal observations by a member of SLT\r\n-          \tEnd of phase review meeting\r\n-          \tReview of the evidence in your digital evidence folder\r\n\r\n\r\nDistinctive features of this course\r\n\r\n- Careful progression in teaching load to support a sustainable start to your teaching career.\r\n- Deliberate practice approach to teaching skills to rapidly develop teaching practice.\r\n- Emphasis on building strong relationships with pupils and their families.\r\n\r\n\r\nExperience of previous students\r\n\r\n“I really like the real-world applicability of the training. The teacher techniques we learn, script and then practice are so helpful for embedding every day and essential routines within teaching”\r\n\r\n“[I like the] real experience in a school and access to discussion with lots of expert teachers”\r\n\r\n100% of trainees this year:\r\n- describe the training as 'Very good' or 'Excellent'\r\n- would recommend the training to others\r\n","interviewProcess":"Applicants will go through the following process: \r\n* Initial application screening\r\n* A short telephone interview to explore background and fit; \r\n* An assessment centre which will include teaching a short lesson to a small group of pupils, an interview with senior staff, a check on your subject knowledge and a written task. \r\n* A visit to the prospective placement school (where an informal interview will take place) to ensure a good fit between trainee and placement school.\r\n","howSchoolPlacementsWork":"Trainees will be placed in a main placement school (either Reach Academy Feltham or a partner school) for four days a week from September for the majority of the school year. Trainees will attend training at Reach Academy Feltham one day a week (currently Wednesday although this is subject to change). You will teach classes from across Key Stage 3 and Key Stage 4 across the year with some experience of Key Stage 5 teaching where available. Placement schools are carefully chosen to ensure they have strong support available for trainees that are on our programme.\r\n\r\nAt some point in the year, all trainees will complete a second school placement at another school (likely to be in the spring term). If your main placement school is not Reach Academy Feltham, then Reach Academy will be your second placement school.\r\n\r\nYou will have a subject mentor at your main placement school who will be your main day to day contact. You meet formally with them at least once a week to discuss your planning, receive feedback on your teaching and practice a key teaching technique. You will also have a professional mentor who is the key contact between the course leader and your placement school. They will oversee your placement and arrange the observations that will need to take place as part of assessing your progress.\r\n\r\nYou will also be supported by the course leader who is responsible for overseeing the programme. This person facilitates weekly training sessions and quality assures the support that trainees receive in their main placement school. They arrange the second school placement and coordinate with all parties to ensure that trainees are on course to achieve their QTS/PGCE qualifications.\r\n","personalQualities":"We are seeking to train teachers to ensure that young people are able to go on to live lives of choice and opportunity. We are seeking candidates with the following background: \r\n\r\n* Passionate about sharing knowledge  \r\n* Great communication skills\r\n* Resilience\r\n* Ability to build relationships\r\n* The ability to take on board feedback and a desire to improve\r\n\r\nWe welcome applications from candidates with a connection to the community we serve and an interest in working in an all-through environment. \r\n\r\nPlease follow the link for our full person specification: (https://swtt.net/wp-content/uploads/2021/01/Trainee-Teacher-Person-Specification.pdf)\r\nPlease follow this link for role link: (https://swtt.net/wp-content/uploads/2021/01/Trainee-Role-Description.pdf)","otherRequirements":"* Have the right to live and work in the UK;\r\n* Criminal Record Checks\r\n* Two satisfactory references \r\n* Occupational Health check \r\n","status":1,"createdAt":"2021-07-06T10:57:14.864Z","updatedAt":"2021-11-28T18:22:15.081Z","canSponsorStudentVisa":"no","cycle":"2024"}
