{"id":"d182ab2d-3217-4391-975f-7c9cafea53b8","name":"Mathematics","code":"34KB","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"72345aa7-096c-488f-8649-085b8178cadb","code":"G1","name":"Mathematics"}],"locations":[{"id":"5cb91801-ae80-4a5c-87af-36bac2076782","name":"St Aldhelm's Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"6270ba96-3992-4f9c-b6e7-dd0b6579934a","name":"All Saints CofE Academy","isPublished":"Y","status":"R"},{"id":"a0054ad4-7c19-467e-8640-0125734a3dfc","name":"Wey Valley Academy","isPublished":"Y","status":"R"},{"id":"47d44c83-369f-447e-a3d8-6a452df85252","name":"LeAF Studio","isPublished":"Y","status":"R","vacancies":"F"},{"id":"c8a24aa9-d271-4de9-a7c2-0ca9d825d6e4","name":"The Bishop of Winchester Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"b165fcf1-0a52-4596-99be-3e94cc4d9f3e","name":"Oak Academy","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"4cb2f8ac-ba06-420b-b70e-cb2521dc1534","code":"135","name":"Ambitions Training School"},"accreditedBody":{"id":"3700fb02-7007-40c8-9127-b070e146d6cb","code":"W76","name":"University of Winchester"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We will only accept an equivalency in one subject, either Maths OR English, not both.","courseLength":"OneYear","feesUK":9250,"feeDetails":"The tuition fees for September 2021 entry are £9,250 for UK, EU and Islands (Channel Islands and Isle of Man) students, however the tuition fee for students outside the EU are yet to be confirmed for 2021 entry. Please contact studentsandmoney@winchester.ac.uk for confirmation of the fee.","aboutCourse":"The course prepares you to teach across the age ranges 11-16 and is structured around six modules - a combination of taught modules based at the University and placement modules based in schools or educational settings.\r\n\r\nYou will undertake studies in all elements of secondary education; extend your knowledge of learning and teaching, of the breadth and scope of the curriculum and the professional skills associated with high-quality teaching. You will then apply these areas of understanding and skill to classroom practice throughout the year, including during two assessed placements in schools or educational settings.\r\n\r\nUpon successful completion of the course you will be awarded a PGCE with recommendations for the award of Qualified Teacher Status (QTS).\r\n\r\nAnyone already in education will tell you that teaching is one of the toughest jobs out there. It's also one of the most rewarding. To make sure you’re a successful and confident teacher in the 21st-century, we have devised a vibrant programme informed by research and constantly reviewed to ensure students are equipped with the most up-to-date developments in primary education.\r\n\r\nOur passion is to provide you with a university experience that immerses you in the theory and practice of teaching. You will love studying at our beautiful campus where your lecturers know you by name, helping you to develop the confidence you need to be an outstanding teacher and make a real difference in the world.\r\n","interviewProcess":"If you already meet or are expected to meet our entry requirements, and have demonstrated your passion and commitment to teaching in your application, you will be invited to attend an interview. \r\n\r\nThe interview is your chance to demonstrate your potential to become a successful teacher. The interview day consists of a written task, maths task, short  lesson (30mins) to a group of pupils and individual interview. \r\nFurther information about the format of the day will be sent to you via email in advance of the interview date. \r\n\r\nThe interview is also your chance to find out more about the University, the course and the schools that we use for placements. ","howSchoolPlacementsWork":"Teaching placements are located  in Bournemouth and Poole, within schools that are part of the Ambitions Training School Alliance. \r\n\r\nTrainees stay in one school for the majority of the year apart from when they have a 6 week long placement in a contrasting school in the Spring Term. \r\n\r\nAll placements are for the 11 - 16 age ranges. \r\n\r\nWhen we call you for an interview, we will discuss whether you have any preferences for placements schools as the interview is usually undertaken at the school where your main placement will be. ","personalQualities":"We will look for evidence of a commitment to the teaching profession, an understanding of professional requirements, and an awareness of current educational issues in an application. Prior experience in a school is not required, however prospective students may find experience in a school useful for obtaining insights into the secondary education classroom. Experience in a school or similar setting may also provide reassurance to prospective students that teaching is the right choice for their career.","otherRequirements":"If you accept an offer of a place you will be required to complete a Disclosure and Barring Service (DBS) criminal records check and Prohibition Order check. If you have spent time overseas in the last 5 years you may also be required to obtain criminal records checks from each of the countries you visited. You will also be required to complete an occupational health check to confirm that you are fit to teach. The University of Winchester will send you more information about when and how you need to complete each of these checks if you accept our offer.","status":1,"createdAt":"2021-07-06T10:46:38.141Z","updatedAt":"2021-09-23T10:29:04.636Z","canSponsorStudentVisa":"yes","cycle":"2024"}
