{"id":"3954b57e-13b9-4817-8b72-7366acb95b28","name":"Primary","code":"L495","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"ba8a3d10-e1ac-4e31-9e71-b239bf266e1f","name":"Poulton-le-Fylde the Breck Primary School","isPublished":"Y","status":"S"}],"trainingProvider":{"id":"7a6612c8-b4fe-425b-a63e-479e034a8257","code":"4A7","name":"BBL Teacher Training"},"accreditedBody":{"id":"f23f176a-d733-46e3-ace2-122d6c91e5c8","code":"N83","name":"North West SHARES SCITT"},"degreeGrade":"9","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Applicants who do not hold the required GCSEs are required to undertake an equivalency with a recognised third party and any costs involved are paid by the candidate.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Throughout our rigorous and innovative, hands-on school-based initial teacher training programme you will study teaching in the Primary age range 5-11 with a self-selected curriculum focus.\r\n\r\nOur programme runs for a minimum of 38 weeks; you will spend four days per week in school and one day per week attending training seminars.\r\n\r\nOur training programme will enable you to develop knowledge of national statutory frameworks including; Primary National Curriculum, Assessment and Keeping Children Safe in Education and the skills to use these effectively in the classroom.\r\n\r\nAdditionally, you will benefit from systematic training linked to; theories of teaching and learning, mental health, working with children with EAL, SEN/D, parents and supporting vulnerable children. Our training ensures that you will have the most up to date knowledge, based on the most recent and relevant research which underpins all of our training, ensuring that you are able to integrate current theory into your classroom on a daily basis.\r\n\r\nFace to face training seminars are delivered at our training suite at Breck Primary School in Poulton-le-Fylde or Skelmersdale (where our accreditors are based). Additionally, our trainees may be offered the opportunity to benefit from an Enhancement placement in London where they will further develop skills in teaching children with EAL.\r\n\r\nTraining placements are carefully selected to suit your training needs and you will undertake 2 significant and sustained placements in 2 contrasting schools across 2 different key stages as follows:\r\n\r\nSeptember to January, Training School 1, KS2;\r\nFebruary to July, Training School 2, KS1.\r\nThese training placements will enable you to develop strong knowledge skills and competencies resulting in you being in high demand as you seek your first teaching post.\r\n\r\nOur training programme does not assess what you ‘write about teaching’, we believe you should be assessed, doing what you do best…… teaching children in the classroom! Your progress will be monitored through:\r\n\r\nRegular reviews of your teaching and learning;\r\nRegular progress targets to extend your teaching and learning;\r\nSummative assessments at the conclusion of each placement.\r\nWith many  years experience delivering school based ITT, we are delighted that schools ‘seek out’ our trainees as Early Career Teachers resulting in our impressive employment rate.","interviewProcess":"We intend to recruit the highest calibre of candidates and our interview process is designed to ensure that we establish your suitability and readiness to teach in the primary age range.\r\n\r\nWe are looking for candidates who are enthusiastic, well-organised, well prepared and who can demonstrate a commitment to successfully completing our School Based Initial Teacher Training Programme. Quite simply, we are looking to recruit our ‘future colleagues and future leaders!’.\r\n\r\nCandidates who are selected for interview, will be welcomed into Breck Primary School and will during the course of the day complete the following tasks:\r\n\r\nPlan and deliver a short lesson with an allocated class;\r\nComplete a subject knowledge task based on the Primary National Curriculum;\r\nEngage in an individual interview to share your current experiences and aspirations for yourself as a future teacher.\r\nOur aim is to find the best in you, so be yourself and be prepared to shine!\r\n\r\nApplicants with disabilities or special educational needs: We comply with equality legislation and ensure that the interview procedures promote equality of opportunity and avoid discrimination. Applicants with disabilities are under no obligation to disclose disability, however, where information is provided we will make reasonable adjustments to promote equality of access.","howSchoolPlacementsWork":"Originally established in the Fylde Coast, our ITT partnership now extends across Lancashire, meaning placements can suit your needs!\r\n\r\nWe also provide unique enhancement training opportunities including:\r\n\r\nTeaching children with English as an Additional Language\r\nTeaching children with complex needs\r\nExploration of the role of subject leader.\r\n\r\nYour placements will be intentionally diverse, they will challenge your thinking about teaching and learning, however, will enable you to learn from experts in their field, in their classroom for a sustained period of time. The critical learning for all of our trainees is to understand that your progress can be directly linked to the progress of the children in their class. If the children are making progress… then you are too!\r\n\r\nAn at the glance summary of our training placements:\r\n\r\nQu. Length of time in each placement? Ans. Minimum 18 weeks in each placement.\r\n\r\nQu. How is placement selected? Ans. Based on your training needs, we carefully match you, your school and mentor – trust us!\r\n\r\nQu. How far will I be required to travel? Ans. All of our trainees are placed within our alliance of schools, reducing the burden of travel to you.\r\n\r\nQu. What will my working hours be? Ans. Training Day 9-4.30. School Day while schools differ, most schools expect as a minimum 8.00-4.30.\r\n\r\nYou will attend staff meetings and support out of school club provision.","personalQualities":"We are looking for applicants who ‘want to make a difference to the life chances of children’.\r\n\r\nYou may have experience with children from a range of sources e.g. work, volunteer, placement, governor in school or summer clubs, sports, cubs etc. It is not how many days you have spent with children that matters, it is what you understand about being a teacher that is of interest to us. If you have determination, resilience, creativity and a passion for teaching, you possess the personal qualities that make superb teachers and leaders of the future. Show this at your interview!","otherRequirements":"All successful candidates are required to meet the following conditions of any offer by the programme start date:\r\n\r\n* Clear disclosure and barring service (DBS) criminal records check including children’s barred list information\r\n\r\n* Clear prohibition order check\r\n\r\n* Clear health and physical capacity to train to teach through an external occupational health check\r\n\r\n* Clear criminal record checks for overseas applicants\r\n\r\n* Clear criminal records checks for applicants who have lived or worked abroad for 3 months or more in the last 10 years\r\n\r\n* Two professional references\r\n\r\n* Develop fundamentals in Mathematics and Literacy proficiency","status":1,"createdAt":"2021-10-08T14:38:54.251Z","updatedAt":"2021-10-08T15:00:26.664Z","canSponsorStudentVisa":"no","cycle":"2024"}
