{"id":"c034189e-fd1a-4e64-9932-e9fb4d08393e","name":"Primary (SEND)","code":"P755","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"yes","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"ba8a3d10-e1ac-4e31-9e71-b239bf266e1f","name":"Poulton-le-Fylde the Breck Primary School","isPublished":"Y","status":"S"}],"trainingProvider":{"id":"7a6612c8-b4fe-425b-a63e-479e034a8257","code":"4A7","name":"BBL Teacher Training"},"accreditedBody":{"id":"f23f176a-d733-46e3-ace2-122d6c91e5c8","code":"N83","name":"North West SHARES SCITT"},"degreeGrade":"9","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Candidates undertaking equivalencies with recognised third parties will self fund the cost of the equivalency.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"We offer a rigorous and innovative, initial teacher training programme for trainees who wish to specialise in teaching children with complex learning needs and/or disabilities in the primary age phase 5-11.\r\n\r\nYou will gain significant and sustained experience in both mainstream and special schools, providing you will skills and expertise to teach in either sector at the conclusion of our programme. You will be trained by an experienced leader of special education and will gain a deep insight into the range of needs of children, statutory frameworks as well as considering how schools offer support to parents and carers. A unique experience for you as a trainee teacher.\r\n\r\nThe programme runs for a minimum of 38 weeks; you will spend four days per week in school and one day per week attending training seminars.\r\n\r\nYour training seminars will enable you to develop your knowledge and understanding of national statutory frameworks including:\r\n\r\n* Primary National Curriculum\r\n* Assessment\r\n* Keeping Children Safe in Education\r\n* SEND Code of Practice.\r\n\r\nAdditionally, you will benefit from training linked to; theories of teaching and learning, mental health, outdoor learning, working with children with EAL, parents.\r\n\r\nOur training ensures that you will have the most up to date knowledge, based on the most recent and relevant research which underpins all of our training, ensuring that you are able to integrate current theory into your classroom on a daily basis.\r\n\r\nYour training placements will be organised to suit your training needs, they will take place across 2 contrasting schools in KS2/KS1, which will immerse you in teaching in both the mainstream and special school sector. Quite simply, you will stand out from the crowd and be highly employable.\r\n\r\nOur training programme does not assess what you ‘write about teaching’, we believe you should be assessed, doing what you do best…… teaching children in the classroom! Your progress will be monitored through:\r\n\r\n* Regular assessments of your teaching and learning\r\n\r\n* Regular progress targets of your teaching and learning\r\n\r\n* Summative assessments at the conclusion of each placement","interviewProcess":"We intend to recruit the highest calibre of candidates and our interview process is designed to ensure that we establish your suitability and readiness to teach children with complex needs.\r\n\r\nWe are looking for candidates who are well-organised, well prepared and are already knowledgeable about statutory educational provision and who can demonstrate a commitment to successfully completing our School Based Initial Teacher Training Programme. Prior experience of educational provision in the SEND sector is highly recommended.\r\n\r\nOur vision is to train and recruit our ‘future colleagues and future leaders!’\r\n\r\nCandidates who are selected for interview, will be welcomed into one of our partner schools and will during the course of the day complete the following tasks:\r\n\r\n* Plan and deliver a short lesson with an allocated class\r\n\r\n* Complete a subject knowledge task based on the Primary National Curriculum\r\n\r\n* Engage in an individual interview to share your current experiences and aspirations for yourself as a future teacher\r\n\r\n* Successful candidates are provided with post interview targets and are supported to meet these targets prior to commencing the programme so that you can ‘hit the ground running.’\r\n\r\nApplicants with disabilities or special educational needs: \r\nWe comply with equality legislation and ensure that the interview procedures promote equality of opportunity and avoid discrimination. Applicants with disabilities are under no obligation to disclose disability, however, where information is provided we will make reasonable adjustments to promote equality of access.","howSchoolPlacementsWork":"Originally established by Breck Primary School in schools along the Fylde Coast, our ITT partnership now extends across Lancashire, meaning placements can suit your needs!\r\n\r\nWe also provide unique enhancement training opportunities including:\r\n\r\n* Teaching children with English as an Additional Language\r\n\r\n* Teaching children in KS3\r\n\r\nYour placements will be intentionally diverse, they will challenge your thinking about teaching and learning, however, will enable you to learn from experts in their field, in their classroom for a sustained period of time. The critical learning for all of our trainees is to understand that your progress can be directly linked to the progress of the children in their class. If the children are making progress… then you are too!\r\n\r\nAn at the glance summary of our training placements:\r\n\r\nQu. Length of time in each placement? Ans. 18 weeks in each placement.\r\n\r\nQu. How is placement selected? Ans. Based on your training needs, we carefully match you, your school and mentor – trust us!\r\n\r\nQu. How far will I be required to travel? Ans. All of our trainees are placed within our alliance of schools, reducing the burden of travel to you.\r\n\r\nQu. What will my working hours be? Ans. Training Day 9-4.30. School Day while schools differ, most schools expect as a minimum 8.00-4.30.\r\n\r\nYou will attend staff meetings and support out of school club provision.","personalQualities":"We are looking for applicants with a genuine interest/experience in teaching or supporting children with SEN/D.\r\n\r\nYou may have experience with children from a range of sources e.g. work, volunteer, placement, governor in school or summer clubs, sports, cubs etc. It is not how many days you have spent with children that matters, it is what you understand about being a teacher that is of interest to us.\r\n\r\nIf you have determination, resilience, creativity and a passion for teaching, you possess the personal qualities that make superb teachers and leaders of the future. Show this at your interview!","otherRequirements":"All successful candidates are required to meet the following conditions of any offer by the programme start date:\r\n\r\n* Clear disclosure and barring service (DBS) criminal records check including children’s barred list information\r\n\r\n* Clear prohibition order check\r\n\r\n* Clear health and physical capacity to train to teach through an external occupational health check\r\n\r\n* Clear criminal record checks for overseas applicants; -Clear criminal records checks for applicants who have lived or worked abroad for 3 months or more in the last 10 years\r\n\r\n* Two professional references\r\n\r\n* Develop fundamentals in Mathematics and Literacy proficiency.","status":3,"createdAt":"2021-10-08T15:39:06.061Z","updatedAt":"2021-10-08T15:42:19.910Z","canSponsorStudentVisa":"no","cycle":"2024"}
