{"id":"c87b8321-7038-4034-a51b-de9de282bdff","name":"Primary (3-7)","code":"Z952","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_7","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"ba8a3d10-e1ac-4e31-9e71-b239bf266e1f","name":"Poulton-le-Fylde the Breck Primary School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"7a6612c8-b4fe-425b-a63e-479e034a8257","code":"4A7","name":"BBL Teacher Training"},"accreditedBody":{"id":"cb360fcd-0c3a-4fc2-a4df-521e9475cd1c","code":"G65","name":"Bright Futures SCITT"},"profPost":"PG","degreeGrade":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"This course is designed to enable you to become a successful teacher of early years pupils aged 3 – 7 (nursery, reception and Key Stage 1).\r\n\r\nOver 120 days of the course will be spent in schools working alongside highly professional and well qualified colleagues. Specific subject knowledge training will enable you to build up a strong knowledge of the full curriculum for EYFS and key stage 1.\r\n\r\nTrainee timetables progressive in design. However, trainees are supported at all times to ensure a balance between challenge and support is met.\r\n\r\nProgress is monitored by subject mentors and moderation will take place throughout the year. Trainees reflect on progress on a weekly basis, culminating in termly written reports produced jointly with mentors.\r\n\r\nThroughout the course, trainees engage with professional development training, this training takes an evidence-informed approach to teaching and learning. Training seminars are delivered at our training suite at Breck Primary School in Poulton-le-Fylde or at Bright Futures SCITT in Manchester, where our accreditors are based.\r\n\r\nApplicants enrolled on the PGCE programme are expected to complete four written assignments leading to 60 M level credits.\r\n","interviewProcess":"If your application meets our entry criteria, we will arrange an interview which could be in person at Breck Primary School, or via an on-line platform.\r\nAt interview, you will:\r\n\r\n* Prepare and plan a lesson prior to interview, which you will then talk through with the interview panel\r\n\r\n* Have a formal interview with staff\r\n\r\n* Complete a written communication task\r\n\r\nYou might also be asked to complete a subject knowledge audit.\r\n","howSchoolPlacementsWork":"This course leads to qualified teacher status (3-7 years).\r\n\r\nAll trainees will undertake placements within nursery, reception and key stage 1. \r\n\r\nPlacement schools are chosen through a number of factors, including trainee prior experience, training needs and location.\r\n\r\nProfessional development sessions are timetable and often take place on a Thursday or a Friday.\r\n","personalQualities":"* A passion for the subject you wish to teach\r\n\r\n* The potential to train to teach\r\n\r\n* Excellent subject knowledge\r\n\r\n* Resilience\r\n\r\n* Enthusiasm\r\n","otherRequirements":"All applicants must undergo a suitability to teach check: this includes a disclosure and barring service check and a fitness to teach check.","status":1,"createdAt":"2021-12-14T15:04:24.157Z","updatedAt":"2021-12-14T15:09:07.268Z","canSponsorStudentVisa":"no","cycle":"2024"}
