{"id":"0bcc6b0c-3234-4b20-b5d0-8d72cad550a8","name":"Primary (5-11)","code":"X174","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"2eec3202-c1cd-43d3-9424-d880e1e8d825","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"4d4cceab-1516-4a6c-a9ab-5de0e32e1fe1","code":"S90","name":"University of Sussex"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"Candidates will need to be able to source and pay for their own equivalency test. We accept online tests offered by Birmingham City University, A Star,  and Equivalency testing.com We strongly advise those in need of an equivalency test to make arrangements to study for and book a test as soon as you accept your place on the course. Some candidates need to take their test more than once to secure a pass and we are not able to admit trainees onto the PGCE course in September without passes in all three subjects.","courseLength":"OneYear","feesUK":9250,"feesInternational":15250,"aboutCourse":"The Sussex Schools Partnership Primary PGCE course is offered as either a 1 year full-time programme or for 2 years part time.  \r\n\r\nSuccessful candidates will be awarded Qualified  \r\nTeacher Status (QTS) and a PGCE of 90 Masters Level Credits allowing  progress onto our Part-time Masters in Education for newly qualified teachers.\r\n\r\nThe PGCE course enables you to develop your own philosophy of learning with an investigative, hands-on approach in which the children you teach are engaged through exploration and discovery. We encourage, challenge and support trainees helping to become effective, reflective teachers whose classroom practice puts children at the centre of a creative and engaging learning process.\r\n\r\nThe Sussex course integrates education theory and practice encouraging you to critically reflect on approaches to learning and teaching and develop a subject specialism.  Over the year you will be placed in two different schools and required to pass both placements. Additional assessments are via a Masters level essay submitted in February and an innovative Viva style Masters level exit interview at the end of the course.\r\n\r\n\r\nWe have developed strong partnerships with primary schools who share our philosophy of a creative and reflective approach starting with the individual child and the environment. Teachers in these schools are key members of our training team and lead on many areas of this course.\r\n\r\nThe Sussex Primary course is unique in offering a very long first school placement of six months allowing you to really get to know your school and fully understand pupil progression. Your schools are carefully selected for you by the Primary Tutor team. \r\n\r\nThe shorter second placement builds on this by applying your skills and knowledge in another setting. You will also have opportunities to explore transition with time in key Stage 3 and Foundation Stage\r\n\r\n\r\nYou will  attend an exciting full-time three week induction course on our campus during September in preparation for starting your school placement. \r\n\r\nFull-time candidates then spend Monday to Thursday each week training school and attending the University Campus on Fridays for lectures, workshops and seminars with our team of experienced primary tutors. \r\n\r\nPart-time candidates also attend the university on Fridays but train for two days a week in school in year 1 and three days in year 2 with days individually negotiated with your school.\r\n\r\n\r\nFurther course information \r\nhttp://www.sussex.ac.uk/education/ite/primary\r\n\r\n\r\n","interviewProcess":"Applicants who meet the entry requirements will be invited to an online selection day.\r\n\r\nAs part of the interview process Sussex candidates would usually expect to;\r\n\r\nBefore the day \r\n* Listen to a video talk giving further information about the Sussex course\r\n* Complete some paperwork including our 'Suitability for Teaching Declaration'. \r\nBoth the above will be sent to you by email in your invitation to interview\r\n\r\nOn the selection day \r\n* An individual online interview, usually via Zoom, with a Sussex tutor and an experienced  teacher from a partnership school\r\n* Deliver a short pre-prepared classroom type teaching task or presentation to the panel. You will receive details of the task in your invitation to interview\r\n* Take part in a short group discussion type task with fellow candidates\r\n* Show the interview panel a form of photo ID on camera for checking\r\n* Have an opportunity to ask the panel questions you may have about the course and your individual circumstances.\r\n\r\nAfter the selection day\r\n* If we offer you a place on the course and you decide to accept we will need you to send us or bring in your original Undergraduate Degree, and GCSE Maths, English and Science certificates \r\n\r\nShowing  an awareness the curriculum and school life is part of the selection process so if logistically possible candidates may wish to prepare themselves by spending some time in an appropriate school setting for the subject/phase they intend to teach beforehand.\r\n","howSchoolPlacementsWork":"You will undertake two periods of Professional Practice in two contrasting schools over the academic year September to June.\r\n\r\nPlacement 1: End of September to Easter; Trainees benefit from a serial placement where the working week is divided between four days in school and a day of reflection and training at the University on Fridays. This ensures a weekly focus on theory and pedagogy as well as practice. In school, guided by an experienced teacher as a mentor, you will gradually build your teaching skills through support and feedback.\r\n\r\nPlacement 2: Easter to May halfterm in a contrasting school. There are fewer University days to give you experience of working a 5 day school  week. \r\n\r\nOur longstanding and historic partnership with  around 300 schools and Early Years settings across East and West Sussex, Brighton and Hove, Surrey, Kent, Hampshire and South London Fringes helps us secure placements where our trainees will thrive and be well exceptionally supported. We invest a lot of time in carefully arranging the most appropriate school for each individual in our cohorts.  \r\nYour Sussex tutor will personally select your two school placements based on a combination of factors; the practicalities such as living location and  transport needs but also on personality, subject knowledge level and previous experiences and using our in depth knowledge of the features of schools within our partnership. \r\n\r\n\r\nWe are also proud to offer an innovative optional training strand in Special Educational Needs and Disability (SEND) which includes enhanced training opportunities and a bespoke Placement 2 in a local partnership special school. This strand would suit any trainee interested in working in a SEND environment.\r\n\r\n\r\n\r\n","personalQualities":"\r\nAt Sussex we are looking for; \r\n\r\n* A passion for working with young children \r\n\r\n* A strong knowledge and understanding of Primary education, and a sound awareness of current issues in English Primary schools \r\n\r\n* Effective communication skills  and good organisational ability\r\n\r\n* Experience with young people and commitment to developing individuals\r\n\r\n* Enthusiasm, energy and creativity\r\n\r\n* The ability to evaluate practice and to address your weaknesses\r\n\r\n* Initiative, flexibility and responsiveness to change\r\n\r\n* A sense of responsibility\r\n\r\n* The ability to work in a team.\r\n","otherRequirements":"We also require the following\r\n\r\n* Working with children: You must not be excluded from working with children, as a result of a criminal record or other reason. The Disclosure and Barring Service provides access to records held nationwide through its disclosure \r\nservice. All trainees must obtain successful DBS clearance before starting an initial teacher-training programme.\r\n\r\n* Health requirements: All trainees must be screened for mental and physical fitness to teach by the University's Occupational Health Department before admission to the programme.\r\n\r\n","status":1,"createdAt":"2021-07-06T10:54:44.748Z","updatedAt":"2021-10-04T15:01:23.711Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
