{"id":"54ba9820-d0b7-4924-8764-f22936ec9d88","name":"Religious Education","code":"3293","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"B","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"724b5d16-28dd-4431-bc17-ea4be4daedc4","code":"V6","name":"Religious education"}],"locations":[{"id":"2eec3202-c1cd-43d3-9424-d880e1e8d825","name":"Main Site","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"4d4cceab-1516-4a6c-a9ab-5de0e32e1fe1","code":"S90","name":"University of Sussex"},"profPost":"PG","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"Trainees typically have degrees in subjects including Theology, Religious Studies, Philosophy, Ethics, Sociology with a keen interest in religion in all its forms. We offer a fully funded Subject Knowledge Enhancement course (SKE) to support candidates in developing greater breadth and depth of subject knowledge.","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Candidates will need to be able to source and pay for their own equivalency test. We accept online tests offered by Birmingham City University, A Star, and Equivalency testing.com We strongly advise those in need of an equivalency test to make arrangements to study for and book a test as soon as you accept your place on the course. Some candidates need to take their test more than once to secure a pass and we are not able to admit trainees onto the PGCE course in September without passes in both subjects.","courseLength":"TwoYears","feesUK":9250,"feesInternational":15250,"aboutCourse":"The Sussex Schools Partnership PGCE English course is offered as either a 1 year full-time programme or for 2 years part time to a limited number of applicants.  Successful candidates are awarded Qualified  Teacher Status (QTS) and a PGCE of 90 Masters Level Credits allowing  progress onto our Part-time Masters in Education for newly qualified teachers.\r\n\r\nWe believe that Religious Education is an integral part of any school curriculum, offering students the opportunity to think critically and creatively whilst providing opportunities to develop an understanding and appreciation of religions and their contribution to individuals, communities and societies. Whether at Key Stage 3, GCSE or A Level, Religious Education and the disciplines of Philosophy and Ethics allow students to both learn about and learn from different religious traditions whilst developing skills of reflection, enquiry, evaluation, analysis and empathy.\r\n\r\nTraining to teach Religious Education offers trainees the chance to tackle stimulating, thought-provoking topics with students and explore issues relevant to them in the 21st century. Trainees will encourage students to consider their own as well as others’ responses to big questions of meaning, purpose and life as well as challenging each individual to develop academically, offering a high quality and holistic education supporting students to construct balanced and informed arguments and responses to Religious, Philosophical and Ethical concepts.\r\n\r\nIntegrating education theory and practice and encouraging  critical reflection on approaches to learning and teaching is key to the Sussex approach. Excellent teachers from partnership schools are seconded to the tutor team and contribute additional currency to teaching and trainee support.   \r\n\r\nYou will  attend a full-time three week induction course on our campus during September  to prepare you for starting your school placement. \r\n\r\nThereafter our full-time candidates spend Monday to Thursday each week training in one of our partnership schools and attending the University Campus on Fridays for lectures, workshops and seminars with our team of experienced subject tutors. Part-time candidates also attend the university on Fridays and train for two days a week in school.\r\n\r\nOver the course you will be placed in two different partnership schools selected for you by your tutor and will be required to pass both placements. Additional assessments are via a Masters level essay submitted in late February and an innovative Viva style Masters level exit interview at the end of the course.\r\n\r\n[Further course information] \r\n(http://www.sussex.ac.uk/education/ite/pgceandschooldirectsecondary/religiouseducation)\r\n\r\n[RE Subject Knowledge Enhancement Course)(http://www.sussex.ac.uk/education/ite/ske)\r\n\r\n","interviewProcess":"Applicants who meet the entry requirements will be invited to a Sussex selection day either online or in person at the university campus in Brighton.\r\n\r\nAs part of the interview process Sussex candidates would usually expect to;\r\n\r\nBefore the selection day \r\n* Listen to a video talk giving further information about the Sussex course\r\n* Complete some paperwork including our 'Suitability for Teaching Declaration'. \r\nBoth the above will be sent to you by email in your invitation to interview\r\n\r\nOn the selection day \r\n* Have an individual online interview, usually via Zoom, with a Sussex tutor and an experienced  teacher from a partnership school\r\n* Deliver a short pre-prepared classroom type teaching task or presentation to the panel. You will receive details of the task in your invitation to interview.\r\n* Show the interview panel a form of photo ID on camera for checking\r\n* Have an opportunity to ask the panel questions you may have about the course and your individual circumstances.\r\n\r\nAfter the selection day\r\n* If we offer you a place on the course and you decide to accept we will need you to send us or bring in your original Undergraduate Degree, and GCSE Maths and English certificates \r\n\r\nShowing  an awareness of the curriculum and school life is part of the selection process so if logistically possible candidates may wish to prepare themselves by spending some time in an appropriate school setting for the subject/phase they intend to teach beforehand.\r\n","howSchoolPlacementsWork":"Our Full-time Course\r\nYou will undertake two periods of Professional Practice in two contrasting schools over the academic year September to June, training to teach in Key Stage 3 (11-14) and Key Stage 4 (14-16) with enhancement opportunities at Key Stage 5 (16-18).\r\n\r\nPlacement 1: End of September to February halfterm. Trainees benefit from a serial placement where the working week is divided between four days in school and a day of reflection and training at the University on Fridays. This ensures a weekly focus on theory and pedagogy as well as practice.\r\n\r\nPlacement 2: February Halfterm to May halfterm in a contrasting school. There are fewer University days to give you experience of working a 5 day school  week. \r\n\r\nOur Part-time Course (limited places - apply early)\r\nYear One: 2 days* a week in school and Fridays at the University \r\nYear Two 2 days* a week in a second contrasting school and occasional University days. \r\n\r\n* Days of the week individually negotiated to suit both school and trainee.\r\n\r\nOur longstanding and historic partnership with  around 300 schools across East and West Sussex, Brighton and Hove, Surrey, Kent, Hampshire and South London Fringes helps us secure placements where our trainees will thrive and be well exceptionally supported. We invest a lot of time in carefully arranging the most appropriate school for each individual in our cohorts.  \r\n\r\nYour Sussex tutor will personally select your two school placements based on a combination of factors; the practicalities such as living location and  transport needs but also on personality, subject knowledge level and previous experiences and using our in depth knowledge of the features of schools within our partnership. \r\n\r\nSEND Placement\r\nWe are also proud to offer an innovative optional training strand in Special Educational Needs and Disability (SEND) which includes enhanced training opportunities and a bespoke Placement 2 in a local partnership special school. This strand would suit any trainee interested in working in a SEND environment.\r\n\r\n\r\n\r\n","personalQualities":"\r\nAt Sussex we are looking for; \r\n\r\n* A passion for Religious Education and an interest in the subject beyond your degree\r\n\r\n* Knowledge and understanding of Religious Studies and Philosophy and an awareness of how the subject is taught in UK secondary schools.\r\n\r\n* Effective communication skills  and good organisational skills\r\n\r\n* Awareness of current educational developments and issues\r\n\r\n* Experience with young people and commitment to developing individuals\r\n\r\n* The ability to evaluate practice and to address your weaknesses\r\n\r\n* Initiative, flexibility and responsiveness to change\r\n\r\n* A sense of responsibility\r\n\r\n* The ability to work in a team.\r\n","otherRequirements":"We also require the following\r\n\r\n* Working with children: You must not be excluded from working with children, as a result of a criminal record or other reason. The Disclosure and Barring Service provides access to records held nationwide through its disclosure \r\nservice. All trainees must obtain successful DBS clearance before starting an initial teacher-training programme.\r\n\r\n* Health requirements: All trainees must be screened for mental and physical fitness to teach by the University's Occupational Health Department before admission to the programme.\r\n\r\n","status":1,"createdAt":"2021-07-06T10:54:44.344Z","updatedAt":"2021-10-04T17:54:14.849Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
