{"id":"c4579f26-7c98-42ff-ba75-8d387276b95f","name":"Primary","code":"D682","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"TA","fundingType":"apprenticeship","studyMode":"B","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"a60d5fe2-f112-4153-99ee-5524d2d07941","name":"Essex and Thames SCITT","isPublished":"Y","status":"S"}],"trainingProvider":{"id":"b8f9522b-9683-42d5-bbe9-249e510775f7","code":"2BQ","name":"The Federation of Greenways Schools"},"accreditedBody":{"id":"878d1a87-fbcc-4973-87e5-e35868dfa1e8","code":"T25","name":"Essex and Thames SCITT"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"Details of how to obtain evidence of equivalency or sit equivalency tests may be found below:\n\n[Equivalency Testing Brentwood](https://www.equivalencytesting.com/)\n\n[A Star Equivalency Islington](https://astarequivalency.co.uk/)","courseLength":"TwoYears","feesUK":null,"aboutCourse":"The Learning in Harmony Trust provides training in an innovative and values driven partnership in Southend and Newham. \r\n\r\nThis is a Salaried Graduate Apprenticeship in primary PGCE (5-11) with QTS.\r\n\r\nDuring the programme you will spend at least 120 days in schools and 70 days in out of school training. Our training is designed by a highly qualified team of senior teachers and leading academics and is primarily based in school.  The training is regularly adjusted to meet your emerging needs and to respond to the ever changing education landscape ensuring that you are learning at the cutting edge of research and best practice. \r\n\r\n\r\nTraining at the Centres\r\n\r\nIn these sessions you will be learning and practising your craft before teaching in the classroom. The training days include sessions in all National Curriculum subjects and associated areas, plus dedicated sessions for professional studies, SEND and inclusion, children’s mental health, behaviour and voice. We offer two training centres in Essex (Wickford and Southend) and give you access to all Anglia Ruskin University’s  facilities.\r\n\r\n\r\nTraining in School\r\n\r\nEvidence shows that the best learning comes from training alongside the highest quality teachers, and with us, you benefit from a significant amount of real school experience as you work alongside the best teachers in our area. \r\n\r\n\r\nSpecialisms\r\n\r\nWe offer free additional training in Special Educational Needs and Disability, Early Years Foundation Stage, Leadership and Mathematics.  All trainees are offered the opportunity to gain a sports coaching qualification during the year.\r\n\r\n\r\nAssessment\r\n\r\nThroughout the programme you will be regularly assessed by both school mentors and your SCITT-based tutors.\r\n\r\n\r\nAcademic work\r\n\r\nSuccessful trainees are awarded QTS and also have the opportunity to study for a PGCE by submitting one written assignment, one presentation and a research project. \r\n\r\n\r\nSupport\r\n\r\nWe have an exceptionally well regarded support programme in place for all trainees.  You will be assigned your own personal tutor, who will visit you in school and at the base, and a class and school mentor whose role it is to train and support you in school.\r\n\r\n‘The partnership ensures that trainees are well prepared for teaching … Headteachers confirm that NQTs are well prepared for the role of teacher.’  Ofsted 2016\r\n","interviewProcess":"Applications must be clearly written and provide evidence of a strong desire to be a primary teacher and an interest in children’s learning.  \r\n\r\nSuccessful applicants will be called to for interview as soon as we have received your applications from UCAS.  If you have applied and have not heard back from us just give our office a ring so that we can check on the progress of your application.  \r\n\r\nStage One of the interview is typically held remotely in the first instance.  At Stage Two successful candidates will be invited into potential employing schools for a further interview and observation. The process gives applicants a chance to demonstrate all the necessary qualities and skills needed to be a successful teacher.  \r\n\r\nYou will have a chance to ask SCITT staff any questions you might have during your initial interview. \r\n\r\nDuring the process you may be asked to:\r\n* Explain why you want to be a teacher\r\n* Give a short presentation\r\n* Reflect on your experiences in the classroom and teaching that you have observed. \r\n* Observe an experienced teacher and write about what you have seen;\r\n\r\nIt is important that you come to interviews prepared for the tasks set so that we are able to assess your suitability to train.\r\n\r\nSuccessful applicants will be notified of the outcome within 2 working days. ","howSchoolPlacementsWork":"We pride ourselves on being the preferred teacher training provider for over 100 Essex, Southend, Thurrock and London primary schools. The breadth of the partnership ensures that we are able to offer a diverse range of training opportunities, learning from  leading edge practitioners and experts.  Most of our schools are located near public transport and within easy reach for non drivers.  You can see our current list of schools on our website https://etpscitt.co.uk/about-etp-scitt/schools\r\n\r\n\r\nPlacements\r\n\r\nWe do our very best to match you with a school as near to where you live as possible.  We take your personal circumstances into account and aim to ensure that no trainee has to travel for more than an hour to reach their schools.  You will train in at least 2 school spending the last two terms in the same school.  For those on SEND and behaviour specialist routes you will spend terms 1 in a mainstream school and term 2 in a specialist setting then term 3 in either. We aim to ensure that you are offered experience in a range of socio-economic settings.\r\n\r\n\r\nWhat will you do in school?\r\n\r\nWorking alongside experienced teachers, you will be supported to take on a slowly increasing teaching role.  You will build up from working with small groups to teaching the whole class at 80% by the end of the final term.   A class teacher and a member of SLT will provide high quality mentoring and pastoral support throughout your placements.  \r\n \r\n“The partnership ensures that trainees are well prepared for teaching … Headteachers confirm that NQTs are well prepared for the role of teacher.”\r\nOfsted 2016\r\n\r\n\r\nBeyond the programme\r\n\r\nWe are thrilled and proud to say that a staggering 100% of our trainees are recruited into teaching posts at the end of their training, with around 85% being employed in our partnership schools.  Our school-based support extends into the NQT year with social events, a comprehensive NQT training programme and access to 1:1 support from SCITT staff as required.\r\n","personalQualities":"We would like to hear from you if you are:\r\n\r\nKeen to become an outstanding teacher;\r\nThe ability to communicate clearly in written and spoken English.\r\nCreative and imaginative;\r\nKeen to open the minds of young people to achieve their fullest potential;\r\nAble to work collaboratively;\r\nPrepared to innovate and take risks: \r\nPrepared to learn from research;\r\nPrepared to work hard to develop your skills  and your understanding of how children learn;\r\nCommitted to providing a positive nurturing learning environment.\r\n\r\nMost of all, we are looking to recruit trainees with a real passion for entering the teaching profession. \r\n","otherRequirements":"Once you have accepted your offer you will be subject to appropriate pre-selection checks. This will include obtaining and considering Disclosure and Barring Service (DBS) criminal records checks and children’s barred list information.\r\n\r\nAll candidates are required to make a fitness to teach declaration to Occupational Health.","status":3,"createdAt":"2021-07-06T10:55:58.361Z","updatedAt":"2021-08-16T14:54:14.051Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024"}
