{"id":"a3689fa1-041f-4bee-be02-28e16a8cce20","name":"Primary","code":"3BZ5","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"TA","fundingType":"apprenticeship","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"a22e0158-b89b-446e-8632-c3a7c8ed0cbd","name":"Ongar Place Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"bed5b4f7-4c9d-42b8-88db-183f3a4a8b0d","name":"Send CE Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"0b4efbea-c77b-493c-bf72-3467722560b3","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"},{"id":"c5df5287-34cf-42f1-afe0-f92d6954093b","name":"Lime Tree Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"775f8493-9c07-4c20-82ab-c8a073be0ffc","name":"Hale Primary Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"ef1472cb-3a08-48b2-8867-742c1aa43f6c","name":"Manby Lodge Infant School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"8fab414c-cd81-464e-84dc-739705a428c6","name":"Hurst Park Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"60c49cfc-dbc5-4342-affb-314f458fee49","name":"Claygate Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"cd4f20f1-348a-4d6a-b171-0f354db830c4","name":"Lingfield Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"88d2a386-6093-4f2e-a702-e23738dc36f7","name":"Epsom Downs Primary School and Children's Centre","isPublished":"Y","status":"R","vacancies":"F"},{"id":"b399ba69-1534-4a51-b3eb-848a0a4403cc","name":"South Farnborough Junior School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"5ac8116d-06e0-45e7-8f6b-26f3cb9cf517","name":"Barnsbury Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"4b1ca359-9a79-4ea6-a3ab-977004252108","name":"Haslemere - training location 2","isPublished":"Y","status":"R","vacancies":"F"},{"id":"960fdebb-680c-4723-a39a-435fbe62b7a0","name":"Beauclerc Infant and Nursery School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"95273e7f-1321-42d7-9af2-ffdacefeb796","name":"Solent - training location","isPublished":"Y","status":"R","vacancies":"F"},{"id":"f366e417-f1d6-4cca-91ea-ef5ac84ac8d3","name":"Beacon Hill Community Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"6605dd7b-6925-4a95-9561-a9eb3866efdd","name":"Haslemere - training location 1","isPublished":"Y","status":"R","vacancies":"F"},{"id":"40e1436b-82bd-40d9-a888-c3b6815041cb","name":"The Greville Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"9d18ef4d-7385-4c16-a626-8d85c3335a0c","name":"Morelands Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"5e90475a-146c-4d12-bd12-6f377ba8e9a4","name":"Yattendon School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"1be45947-048c-45a7-8419-823a678c76ed","name":"Reigate - training location 1","isPublished":"Y","status":"R","vacancies":"F"},{"id":"cf9e6187-64fb-4be3-81b9-7ba8ee509955","name":"Horsham - training location","isPublished":"Y","status":"R","vacancies":"F"},{"id":"b4d1e909-1bd3-4ff9-9f87-c76448a47f38","name":"Reigate - training location 2","isPublished":"Y","status":"R","vacancies":"F"},{"id":"0dfc5c6f-67a2-4c3d-a803-ef821257ba68","name":"Burstow Primary School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"d10e3e66-3981-4478-9214-3f9d5559df41","code":"13S","name":"Surrey South Farnham SCITT"},"degreeGrade":"9","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We advise candidates to apply to: www.equivalencytesting.com\n\nApprentices with an equivalency in maths and or English will need to have previously achieved a level 2 qualification in maths and or English in order to meet the gateway criteria for the apprenticeship End Point Assessment.","courseLength":"OneYear","feesUK":0,"feeDetails":"This programme is an employment based route.  Apprentices will be paid a salary by the employing school (unqualified teacher pay-scale, minimum point 1).  There are no tuition-fees for this programme.","aboutCourse":"SSF SCITT is an innovative, OFSTED outstanding, well established and highly respected provider of Primary Initial Teacher Training working across the South East including Surrey, Hampshire, West Sussex, Berkshire and the London Boroughs of Sutton, Croydon and Kingston.  We have a reputation for being amongst the best school-led teacher training providers in the country (Good Teacher Training Guide 2015 and 2017).\r\n\r\nThe Post-Graduate Teaching Apprenticeship enables schools to use apprenticeship funding for training. Apprentice teachers will have to meet the same statutory requirements for entry as all other ITT programmes and will be assessed against the Teachers’ Standards. The apprenticeship route combines paid work with on and off-the-job training. QTS will be awarded to successful apprentices after three terms in their fourth term (i.e. first term of their qualified teaching year) apprentices will undergo an ‘end point assessment’ by an independent assessor and, if successful, will then be deemed to have completed their apprenticeship training.\r\n\r\nApprentices  are employed by a host school and will have the opportunity for a contrasting second school experience and enhancement opportunities within the partnership of schools. \r\n\r\nApprentices are in school for four days each week.  This includes one day of school-based training time, to observe experienced colleagues and undertake course requirements.  The remaining three days could be used for additional employment responsibilities.  These will differ between employing schools and could include whole class teaching / cover, duties, classroom support etc. from the outset, in addition to course requirements.  One day each week is spent offsite at professional studies training (off-the-job training).\r\n\r\nSSF provides a diverse and engaging programme of weekly [professional studies training](http://www.ssfscitt.org.uk/page/?title=Weekly+Professional+Studies&pid=16), covering the range of primary curriculum subjects, SEND, behaviour management, EAL and others. Training is led by a team of local and national experts and outstanding primary practitioners. Each year the training has a 100% good or very good rating, but is constantly reviewed and updated to keep pace with the changing primary school landscape and national priorities.\r\n\r\nWe recognise that location is an important factor, so we run training in geographical cohorts which develops local support networks (2022 hubs are Farnham, Reigate, Leatherhead, Solent and Cobham).  \r\n\r\nConsideration of workload underpins programme design and structure.  Personalised training plans ensure deadlines are carefully scheduled and do not overlap. Every apprentice is allocated a school mentor and external support tutor to ensure that training is tailored to individual needs.\r\n","interviewProcess":"Once we have received your application through DfE Apply we will check that you meet eligibility criteria and that there is a suitable apprenticeship placement available (please check our website prior to submitting your application).\r\n\r\nWe will shortlist and invite successful applicants for an interview (we hold interview weekly).  These will be held at the lead school, South Farnham School (Menin Way, Farnham GU9 8DY).\r\n\r\nThe interview will consist of:\r\n\r\n* a panel interview with Head teacher / senior leaders from two partnership schools\r\n* a short teaching task (five minutes) where you will teach a given skills to the two panel members\r\n* core subject tests to assess your competency in Mathematics and English (these give us a greater insight into your training needs and enable us to offer subject knowledge enhancement)\r\n* an opportunity to ask questions and explore your personal training needs, placement school and programme options\r\n* candidates who are strongly recommend at the panel interview will progress to the school selection day stage.  This will likely include scrutiny of your planning, observation of you teaching a lesson, a professional discussion following the lesson and a formal focused interview\r\n\r\nIf successful offers will be made through DfE Apply that day.  Conditions will include qualifications and DBS checks.","howSchoolPlacementsWork":"Apprentices are based in their employing school but there are opportunities to visit a special educational needs school and to look at secondary, early years and EAL provision (pupils with English as an additional language).  A contrasting second school experience will be facilitated in coordination with the employing school.\r\n\r\nWe always welcome the opportunity to speak to Head teachers and senior leaders about becoming involved, particularly where a potential candidate is being supported by a school not currently in the partnership.\r\n","personalQualities":"We are looking for people with the desire and passion to challenge and inspire children. Excellent communication and inter-personal skills, resilience and determination are essential qualities.","otherRequirements":"All ITT providers are asked to ensure that all entrants take part in a rigorous process designed to assess their suitability to train to teach.  The employing school will conduct pre-employment checks.  This includes:\r\n\r\n* Health and physical capacity to teach\r\n* Disclosure and Barring Service (DBS) check\r\n\r\nAll teachers are expected to be competent in fundamental English and mathematics.  By the end of the training year, all trainees must be able to demonstrate competence in the following areas:\r\n* speaking, listening and communicating\r\n* writing\r\n*mathematical calculations and problems\r\n* use of data and graphs to interpret information\r\n","status":1,"createdAt":"2021-07-06T10:48:26.252Z","updatedAt":"2021-10-01T17:14:24.990Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024"}
