{"id":"e2f39be7-0047-46fc-be9b-a87234af2c3a","name":"Primary","code":"2NCQ","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"9d18ef4d-7385-4c16-a626-8d85c3335a0c","name":"Morelands Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"5ac8116d-06e0-45e7-8f6b-26f3cb9cf517","name":"Barnsbury Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"c5df5287-34cf-42f1-afe0-f92d6954093b","name":"Lime Tree Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"ef1472cb-3a08-48b2-8867-742c1aa43f6c","name":"Manby Lodge Infant School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"f366e417-f1d6-4cca-91ea-ef5ac84ac8d3","name":"Beacon Hill Community Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"cf9e6187-64fb-4be3-81b9-7ba8ee509955","name":"Horsham - training location","isPublished":"Y","status":"R","vacancies":"F"},{"id":"0dfc5c6f-67a2-4c3d-a803-ef821257ba68","name":"Burstow Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"1be45947-048c-45a7-8419-823a678c76ed","name":"Reigate - training location 1","isPublished":"Y","status":"R","vacancies":"F"},{"id":"60c49cfc-dbc5-4342-affb-314f458fee49","name":"Claygate Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"8fab414c-cd81-464e-84dc-739705a428c6","name":"Hurst Park Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"a22e0158-b89b-446e-8632-c3a7c8ed0cbd","name":"Ongar Place Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"40e1436b-82bd-40d9-a888-c3b6815041cb","name":"The Greville Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"b4d1e909-1bd3-4ff9-9f87-c76448a47f38","name":"Reigate - training location 2","isPublished":"Y","status":"R","vacancies":"F"},{"id":"b399ba69-1534-4a51-b3eb-848a0a4403cc","name":"South Farnborough Junior School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"88d2a386-6093-4f2e-a702-e23738dc36f7","name":"Epsom Downs Primary School and Children's Centre","isPublished":"Y","status":"R","vacancies":"F"},{"id":"4b1ca359-9a79-4ea6-a3ab-977004252108","name":"Haslemere - training location 2","isPublished":"Y","status":"R","vacancies":"F"},{"id":"95273e7f-1321-42d7-9af2-ffdacefeb796","name":"Solent - training location","isPublished":"Y","status":"R","vacancies":"F"},{"id":"5e90475a-146c-4d12-bd12-6f377ba8e9a4","name":"Yattendon School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"cd4f20f1-348a-4d6a-b171-0f354db830c4","name":"Lingfield Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"6605dd7b-6925-4a95-9561-a9eb3866efdd","name":"Haslemere - training location 1","isPublished":"Y","status":"R","vacancies":"F"},{"id":"bed5b4f7-4c9d-42b8-88db-183f3a4a8b0d","name":"Send CE Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"0b4efbea-c77b-493c-bf72-3467722560b3","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"},{"id":"960fdebb-680c-4723-a39a-435fbe62b7a0","name":"Beauclerc Infant and Nursery School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"775f8493-9c07-4c20-82ab-c8a073be0ffc","name":"Hale Primary Academy","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"d10e3e66-3981-4478-9214-3f9d5559df41","code":"13S","name":"Surrey South Farnham SCITT"},"profPost":"PG","degreeGrade":"9","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We advise candidates to apply to: www.equivalencytesting.com","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Surrey South Farnham SCITT is an innovative, OFSTED outstanding, well established and highly respected provider of Primary Initial Teacher Training working across the South East including Surrey, Hampshire, West Sussex, Berkshire and the London Boroughs of Sutton, Croydon and Kingston.  We have a reputation for being amongst the best school-led teacher training providers in the country (Good Teacher Training Guide 2015 and 2017).\r\n\r\nTeachers in England require QTS (Qualified Teacher Status) in order to be recognised qualified teachers. The PGCE (Post Graduate Certificate in Education) is an additional academic award.\r\n\r\nWe are aware of the demand of PGCE masters accreditation and we have developed a programme with the University of Roehampton that can be followed during the training year. This enables those who wish to engage with a PGCE to do so. \r\n\r\nThis is a fee-paying programme open to high quality graduates and leads to the award of QTS with PGCE.\r\n\r\nOur School Direct PGCE programme is built around a trainee having an on-going experience in  a local host school, a six week experience in a contrasting school and enhancement opportunities within other partnership schools. \r\n\r\nA very gradual increase of teaching commitments starts with co-delivery of aspects of a lesson and delivery of whole lessons.  As confidence increases you will deliver sequences of lessons and work up to three to four days a week by July 2023.  One day each week is spent off site with your local cohort at professional studies training and nine additional days of training with the University of Roehampton (front loaded in the first half of the autumn term) .\r\n\r\nSSF provides a diverse and engaging programme of weekly [professional studies training](http://www.ssfscitt.org.uk/page/?title=Weekly+Professional+Studies&pid=16), covering the range of primary curriculum subjects, SEND, behaviour management, EAL and others. Training is led by a team of local and national experts and outstanding primary practitioners. \r\n\r\nWe recognise that location is an important factor for you so we run training in geographical cohorts and build local support networks (2022/23 hubs are Farnham, Reigate, Leatherhead, Solent and Cobham).  \r\n\r\nAssessment is continuous and includes observations of your teaching, professional development tasks, articulation of practice using clear and transparent criteria.  There will be three additional academic assignments at masters level for the award of the PGCE.","interviewProcess":"Once we have received your application through DfE Apply we will check that you meet eligibility criteria.  Your personal statement will be read by the Director of ITT.\r\n\r\nWe will shortlist and invite successful applicants for an interview (we hold interview each week).  These will be held at the lead school, South Farnham School (Menin Way, Farnham GU9 8DY) .  You would be placed into a school local to you.  Weekly professional studies training takes place at venues across the region (currently Farnham, Reigate, Leatherhead, Solent and Cobham) to ensure ease of travel and to create local support networks for our trainees.\r\n\r\nThe interview will consist of:\r\n\r\n* a panel interview with Head teacher / senior leaders from two partnership schools\r\n* a short teaching task (five minutes) where you will teach a given skill to the two panel members\r\n* core subject tests to assess your competency in Mathematics and English (these give us a greater insight into your training needs and enable us to offer subject knowledge enhancement)\r\n* an opportunity to ask questions and explore your personal training needs, placement school and programme options\r\n\r\nIf successful we will make you an offer through DfE Apply that day.  Conditions will include qualification and DBS checks.\r\n","howSchoolPlacementsWork":"Trainees are based in various schools across the South East and new schools join us each year. We make every effort to place trainees based upon where they live, accessibility and to ensure that the placement is appropriate to their needs. Please [click here](http://www.ssfscitt.org.uk/page/?title=Where+we+Train&pid=10) to view our website and map of current partnership schools.\r\n\r\nAs a primary provider all our programmes covers the 5 - 11 age phase and you will be assessed within either the 5 - 9 age range  (covering early years, key stage one and lower key stage two), 5 - 11 age range (covering key stages one and two) or 7 - 11 age range (covering key stage two).\r\n\r\nThere are opportunities to experience two schools, visit a special educational needs school and to look at secondary, early years and EAL provision (pupils with English as an additional language).\r\n\r\nA benefit of our programme is that you will know which partner school you are to be placed in before attending a welcome meeting in late June/early July. This gives our trainees the advantage of being able to make links with their new school team before the programme starts.\r\n\r\nWe always welcome the opportunity to speak to Head teachers and senior leaders about becoming involved, particularly where a potential candidate is being supported by a school not currently in the partnership.\r\n","personalQualities":"We are looking for people with the desire and passion to challenge and inspire children. Excellent communication and inter-personal skills, resilience and determination are essential qualities.","otherRequirements":"All ITT providers are asked to ensure that all entrants take part in a rigorous process designed to assess their suitability to train to teach.  This includes:\r\n\r\n* Health and physical capacity to teach\r\n* Disclosure and Barring Service (DBS) check\r\n\r\nAll teachers are expected to be competent in fundamental English and mathematics.  By the end of the training year, all trainees must be able to demonstrate competence in the following areas:\r\n* speaking, listening and communicating\r\n* writing\r\n*mathematical calculations and problems\r\n* use of data and graphs to interpret information\r\n","status":1,"createdAt":"2021-07-06T10:48:26.105Z","updatedAt":"2021-10-01T17:08:01.631Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
