{"id":"37866bdf-501d-4af8-a823-e1bae47ffbb0","name":"Modern Languages (French with Spanish)","code":"2JH5","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"9727f674-61ba-4efa-b1f2-21ec7e354442","code":"15","name":"French"},{"id":"e34fd2a3-a32e-44e9-aea1-666badf3ac03","code":"22","name":"Spanish"},{"id":"ce8523ef-9236-4cd9-b260-d826c7a521b3","code":"ML","name":"Modern Languages"}],"locations":[{"id":"b7123533-522c-4a15-b171-3242597fd638","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"6e85e591-b777-44b0-a2c9-f4ab7aa0c31c","code":"1VU","name":"Pathfinder Teaching School Hub"},"accreditedBody":{"id":"3117eaa6-b483-49de-92a2-ee4ead1b0903","code":"Y50","name":"The University of York"},"profPost":"PG","degreeGrade":"1","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":19600,"feeDetails":"EU students are classified as international students as per government regulations.","aboutCourse":"This secondary teacher training course leads to a recommendation for Qualified Teacher Status (QTS). It prepares and equips you to teach your subject in secondary schools and post-16 colleges. School and university training is integrated throughout the course and University of York and the Pathfinder Teaching School Hub work closely together to identify your individual capabilities and needs and to enable you to make progress in your development as a teacher.\r\n\r\nThis PGCE course comprises of 60 credits at Masters level and 60 credits at level 6 plus the recommendation for the award of QTS.\r\n\r\nOn the course you  enhance your subject knowledge, understanding and skills, learn how to teach your subject, learn about the wider role of teachers in school, gain knowledge about schools and the education system, apply your skills and knowledge on school placements, gain experience of working alongside other professionals who support the care and development of individual pupils in schools.\r\n\r\nWe help you to develop the skills you need to be a successful teacher of pupils of all abilities and backgrounds. While studying with us you build your enthusiasm, confidence, knowledge and ability to teach your subject.\r\n\r\nThis course begins in early September and finishes by the end of June in the following year. The Pathfinder Teaching School Hub will offer places in French with Spanish through the unsalaried route.\r\n","interviewProcess":"Candidates who are invited to interview will be expected to undertake a teaching activity as well as a formal interview and other tasks related to teaching in their specific subject. Interviews will take place at the school. Prior notification of interview tasks will be provided to candidates in advance of the interview date.\r\n\r\nUniversity of York\r\n\r\nNo applicant will be admitted to the course without interview.  Normal procedure is invitation to interview by email following consideration of your application by admissions tutors.\r\n","howSchoolPlacementsWork":"The pattern of school experience allows trainees to gain deepening insights into teaching and learning, and systematically supports the development of professional knowledge and teaching skills. Over the course of the year trainees will gain experience in two contrasting schools.\r\n\r\nUniversity tutors and school teachers work together to manage school experiences, to link these to university-based activities and to direct trainees to appropriate reading.\r\n","personalQualities":"* Good verbal communication skills\r\n* Good interpersonal skills\r\n* The  ability to be reflective\r\n* Interact well with children\r\n* To demonstrate resilience\r\n* Good written communication skills\r\n* Committed to the well-being and development of children\r\n\r\nApplicants must possess the following:\r\n* Good subject knowledge in the area they wish to teach\r\n* An understanding of how children learn\r\n* Familiarity with issues in education\r\n\r\nCandidates should be prepared to engage in educational issues beyond their immediate day-to-day activities, and to examine - in a critical but constructive way - the current educational system and practice.\r\n","otherRequirements":"Participation in the course is an active process. Although there are lectures and presentations, much of the course centres on workshops, seminars, and school and classroom activities. Activities emphasise team work, and require trainees to share the responsibility for their learning. \r\n\r\nIn addition to the academic entry requirements, all PGCE candidates will be required to: \r\n\r\n- Obtain an enhanced DBS check (plus overseas police checks for any countries where 12 months or more have been spent in the last ten years)\r\n- complete an occupational health check\r\n- meet the Department of Education's English Language requirements (international students only) \r\n\r\n","status":1,"createdAt":"2021-07-06T10:55:45.214Z","updatedAt":"2021-09-16T11:37:41.441Z","canSponsorStudentVisa":"yes","cycle":"2024"}
