{"id":"173bceea-84c5-47aa-8e32-815b8368f2f7","name":"Primary","code":"2HV6","qualification":"qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"5c56e8be-e1f9-489b-aa00-10d5163d8742","name":"St George's CE Primary School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"3ceb44af-261f-4fab-8c65-f3ced24ab9c4","code":"22P","name":"Yarrow Schools Alliance"},"accreditedBody":{"id":"f23f176a-d733-46e3-ace2-122d6c91e5c8","code":"N83","name":"North West SHARES SCITT"},"degreeGrade":"2","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feeDetails":"Course fees for the academic year 2022-2023 are £9 250.\r\n\r\nThe Yarrow Schools Teaching Alliance is happy to give advice about Student Finance and DfE  Bursaries and to give help and advice with the application process. ","financialSupport":"We are happy to signpost applicants to information they may need on Student Finance. \r\n","aboutCourse":"‘Classroom ready. Classroom confident’. This is our ambition for successful applicants. Every element of our course is designed with this in mind. At Yarrow Schools Teaching Alliance, we are proud of our profession and want to ensure that its future is in the best hands. \r\n\r\nWe know the best place to train is in a school and so trainees spend the academic year in school with two 5 month long placements - one in Key Stage 2 running from September to the end of January and a Key Stage 1 placement from February to the end of the year. Trainees spend four days a week in class supported by a Class Mentor as well as a Link Tutor. All placements are secured by YSTA and take place in  member schools whose Governors and Headteachers are fully committed to school based training. \r\n\r\nOne day a week is spent engaged in compulsory theory based training. Our philosophy is that regular training is more effective than blocking seminars. Attending weekly training means that trainees can get straight back into class and put their learning into practice. \r\n\r\nTraining sessions, held either in Skelmersdale (where our accreditors are based) or in Chorley,  are led by expert practitioners, all of whom currently practise in their field. Training is designed to develop professional knowledge of national statutory curricula and current national priorities as well as enhancing understanding of theoretical principles of teaching and pedagogy.\r\n\r\nAssessment takes the form of regular teaching and learning reviews each with a defined focus. Following each review, targets are set for trainees to work and build on. To successfully achieve QTS, trainees must demonstrate that they have met all Teacher Standards. \r\n\r\nOver the course of the academic year, trainees have the opportunity to  look at provision in different settings eg schools where for a high number of pupils English is an additional language; small schools or  special schools. Such experiences can be organised by the YSTA and are undertaken in addition to the trainees'  Key Stage 1 and 2 placements. \r\n\r\nAll trainees are expected to keep an up-to-date planning file containing  planning, evaluations and lesson observations. Throughout the course of the year, trainees complete a series of short written observations in relation to the Teachers' Standards allowing them to reflect on their experiences and progress. Full guidance on this is given as part of the induction process and in subsequent training sessions. \r\n\r\n\r\n\r\n","interviewProcess":"Quite simply, we are looking for ambitious trainees who can demonstrate their commitment and desire to become outstanding teachers of the future and who understand the impact a teacher has on the lives of the children they teach. It is a pre-requisite that, as well as having the required academic qualifications, candidates should have the determination, enthusiasm and strength of character necessary to successfully make the transition from trainee to fully qualified, highly skilled classroom professional. In return, we promise to offer the best professional training available. \r\n\r\nHow we select:\r\n\r\nCharged with the training of teachers of the future, our selection and recruitment process is both rigorous and robust. The process is led by experienced Headteachers and senior leaders of schools within Yarrow Schools Teaching Alliance. \r\n\r\nThe selection process involves a thorough scrutiny of application forms to check that applicants meet the academic entry requirements and have the professional entry requirements. Personal statements should demonstrate that the applicant has a clear understanding of teaching and learning, national statutory frameworks as well as having a clear desire to become an outstanding teacher.\r\n\r\nShortlisted candidates are then invited to interview where they will be expected to demonstrate their skills and competencies in a range of situations which will include:\r\n\r\nTeaching a class \r\nPupil Panel Interview \r\nIndividual interview with a panel comprising Teaching School Leaders and Headteachers from across the Yarrow Schools' Teaching Alliance\r\nAn English and Mathematics assessment\r\n","howSchoolPlacementsWork":"Over the course of the year, trainees undertake two substantial placements in school. From September to the end of January, trainees are placed in a Key Stage 2 setting and from February to the end of June, they undertake a Key Stage 1 placement. Throughout each placement, trainees have the support of the class teacher on a day to day basis with additional input and support from a Link Tutor who will visit regularly and maintain close contact. \r\n\r\nAll placements are secured by YSTA on behalf of trainees and all take place in YSTA member schools. All schools are easily accessible and consideration is always given to any individual's personal circumstances when placing in school. \r\n \r\nAll member schools share our belief and passion that school-based ITT training is the best route into the profession and so trainees can be assured of a warm welcome and plentiful support. \r\n\r\nTrainees work alongside the Class Teacher in planning and delivering lessons and assessing learning. The length of each placement (approximately 5 months in each school) means that trainees not only have the opportunity to form good relationships with the children they teach but with the staff who work within the class and throughout the school. Trainees are welcomed as fellow professionals and are expected to play a full and meaningful role in school life - attending weekly staff meetings and INSET, carrying out break-time supervision, playing a part in Parents' Evenings and Open Evenings and assisting with extra-curricular activities. We believe that immersing oneself fully in the life of the school is the best way to develop classroom confidence and teaching stamina! \r\n\r\nWe are proud that as an Alliance of more than thirty schools based in and around Chorley, we are able to offer trainees a fully rounded experience. The range and breadth of establishments within the YSTA ensures that all our trainees gain real insight into the provision of education from ages 3 – 16. ","personalQualities":" We are looking for applicants who:\r\n\r\n- can inspire, motivate and challenge\r\n\r\n- can make each member of a thirty-strong class of children feel unique and special \r\n\r\n- can inspire a life long love of learning\r\n\r\n- have drive, commitment and enthusiasm\r\n\r\n- understand that teaching is not just a job but a privilege \r\n\r\n- have a desire to make a real difference to the lives of the children they teach","otherRequirements":"Following successful interview, a number of checks will be needed to confirm suitability to teach and potential to meet the Teachers’ Standards by the end of the training programme. These will include:\r\n-Health and Capacity to Teach checks \r\n-Disclosure and Barring Service checks\r\n-Police clearance from abroad if the candidate has lived/worked abroad in the last 5 years for 6 months or more\r\n-Prohibited Teachers Check (UK)\r\n-Prohibited to teach in EEA\r\nIn addition, trainees will be required to develop and demonstrate Mathematics and English proficiency prior to and during the programme.\r\n\r\n","status":1,"createdAt":"2021-07-06T10:47:18.771Z","updatedAt":"2021-09-23T14:09:31.671Z","canSponsorStudentVisa":"no","cycle":"2024"}
