{"id":"1f5fa8b7-d281-464d-acd1-22acd1bbeb5f","name":"English","code":"38RZ","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3aed1aa8-ae46-4b68-92bb-a6cc20655c59","code":"Q3","name":"English"}],"locations":[{"id":"87c0927f-14ab-4ad7-a3b7-752cafae1923","name":"The Bulmershe School","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"3654750b-61f6-4344-865a-7e47e6362390","code":"152","name":"The Wokingham Federation"},"accreditedBody":{"id":"6439adcc-af64-4d3d-a1da-de045755db06","code":"R12","name":"The University of Reading"},"profPost":"BO","english":"3","maths":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","aboutCourse":"This Secondary salaried PGCE English course leads to the award of Qualified Teacher Status (QTS). With the exception of the additional requirements imposed on salaried trainees, it is identical to the University of Reading's course [Q3X1](http://www.reading.ac.uk/ready-to-study/study/subject-area/education-pg/pgce-secondary-education-english.aspx). Applicants to this course, 38RZ, will however be interviewed at a Wokingham Federation school which is offering a salaried place and if successful will train in two Federation schools, the main one being the employing school. They will follow the same course as Q3X1 and will become members of the University in the same way as all the other successful applicants to this course.\r\n\r\nThe course supports its trainees to become reflective professionals, able to secure the very best for all children. We work with them to be resilient, creative and inclusive. With the highest expectations of learning, progress and development, trainees inspire young people to become confident, active citizens who are able to cope with the fast-moving demands of the 21st century.\r\n\r\nThe aim of the partnership of the Wokingham Federation and the University of Reading is to train excellent practitioners who have a positive impact on their pupils. This is accompanied by the recognition that excellent teachers continue to develop throughout their careers and never stop learning. Our intention therefore is that trainees should take ownership of their development during this year of training and establish the habits of reflective practice that will sustain them throughout their career.\r\n\r\nBoth the Federation schools and the University recognise the importance of being able to teach children to think, create and explore the world through language and literature. To achieve this, training to teach English on this course is therefore a dynamic, cutting edge and a ‘hands-on’ experience, which will enable trainees to share their passion for English with pupils, and develop professional skills so that they can become excellent English teachers.\r\n\r\nThe course is linked with National Association for the Teaching of English (NATE) and provides great networking and professional learning within a community of English teachers. \r\n\r\nBetween the campus environment and the diversity embedded within the Federation schools, our trainees develop a strong identity as beginner teachers and educators of the future. Please see [School Direct with the University of Reading](http://www.reading.ac.uk/education/pgce-qts/ioe-secondary-school-direct.aspx) for more details.\r\n","interviewProcess":"Applicants called to interview will be interviewed at a school which is offering a salaried place.\r\n\r\nThe interview process, which typically takes about 3 hours, will consist of:\r\n\r\n* an introductory meeting\r\n* a written task\r\n* a teaching task with a small group of students\r\n* a formal interview\r\n\r\nThere may also be additional tasks, for example to meet with a student panel or to observe a lesson and then share observations.\r\n\r\nIt is also possible that applicants will have to be interviewed remotely. When this is the case, the teaching task will be replaced with a presentation to the interviewing panel. \r\n\r\n","howSchoolPlacementsWork":"Trainees will work in two of The Federation's nine mainstream School Direct secondary schools, with the majority of the time being spent in the employing school. Please see [The Wokingham Federation](http://wokinghamfederation.co.uk/home/schools/) website for details of the schools.\r\n\r\nDuring the course of the year, all trainees will have experience of teaching all years from Years 7 - 13, including working with both GCSE and A Level groups.\r\n\r\nTo ensure they are fully supported during the course, trainees have a mentor at their schools and a tutor with the University, both of whom work closely with them throughout the year.\r\n\r\n\r\n","personalQualities":"We are looking for applications from people who have the desire, passion and determination to be outstanding teachers. The Wokingham Federation is proud of its schools and they are  all keen to work with trainees who would like to be a part of it, at least for a year and possibly for longer.","otherRequirements":"Applicants for the salaried route are expected to have at least three years' work experience (in any area) after their degree.\r\n\r\nIf you accept an offer from us, you will also be required to complete Occupational Health and Disclosure Barring Service (DBS) Enhanced Disclosure checks successfully.\r\n\r\nThese checks are required to ensure you meet the Department for Education’s requirements for physical and mental fitness to teach, as well as assessing your suitability for working with children.","status":2,"createdAt":"2021-07-06T10:47:20.706Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"Salary is paid on the pay scale for unqualified teachers.\r\n\r\nQTS course fees will be paid by the school. The costs of the PGCE may also be paid. This will be discussed at interview."}
