{"id":"231d2ab8-161c-4e1f-8091-1f50c8a4269f","name":"Business Studies","code":"3922","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"de6477b2-6027-48e6-b9f7-3206774705c2","code":"08","name":"Business studies"}],"locations":[{"id":"87c0927f-14ab-4ad7-a3b7-752cafae1923","name":"The Bulmershe School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"3654750b-61f6-4344-865a-7e47e6362390","code":"152","name":"The Wokingham Federation"},"accreditedBody":{"id":"23fba24b-1e90-4b68-9558-1814033bde74","code":"2EW","name":"Teach SouthEast"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Teach SouthEast trainees spend the majority of time in their placement schools, with the weekly day of training delivered by the Teach SouthEast SCITT and their partnership of schools. \r\n\r\nThe course offers trainees a weekly General Professional Studies (GPS) session lasting 3 hours, which is held at SJB School in Woking. In these sessions they will receive practical strategies and ideas to develop their practice within the classroom. Areas of pedagogy covered within these sessions include: assessment for learning, smart marking, lesson planning, behaviour management and differentiation. This fee-paying course leads to QTS and PGCE which carries 60 masters credits (awarded in partnership with the University of Sussex). \r\n\r\nAlongside General Professional Studies, all trainees receive subject specific training, which is led by one of the schools within the partnership. All subject hubs within the partnership have been chosen for their renowned reputation as training centres and outstanding levels of learning and teaching as well as results. \r\n\r\nBusiness Studies subject training gives trainees a weekly dedicated session focusing on subject related topics, preparing them to teach Business Studies to a high level within the classroom. Areas of training include planning an effective scheme of work, assisting students to develop analytical and critical thinking skills, differentiation, preparing students for examinations and equipping trainees with the skills to teach the full range of business subjects across Key Stages 4 and 5 (14 to 19 years). \r\n\r\nThe PGCE (60 masters credits) is delivered by and accredited by The University of Sussex, whose ITT provision has been graded as outstanding by Ofsted. Trainees have the opportunity to go to The University of Sussex on a number of occasions throughout the year to access keynote lectures and the PGCE element of the course is delivered at one of the schools within the SCITT.\r\n\r\n\r\n","interviewProcess":"Once an application is received, Teach SouthEast will make a call to interview within approximately one week. The interview day will be held at one of the schools within the partnership within approximately two weeks.\r\n\r\nThe interview day will consist of: \r\n* A tour of the school in which the interviews are being held \r\n* A subject knowledge test. This is usually part of a GCSE paper and will last no longer than 30 minutes \r\n* An exercise on resilience \r\n* Teaching an advised topic to a class of approximately 30 students for approximately 25 minutes \r\n* An interview with staff from Teach SouthEast and our partner schools \r\n* A literacy and numeracy skills test assessment to establish if the required standards of literacy and numeracy for teaching are currently being met, and if not, to establish how you can be supported.\r\n\r\nIt is possible that the interview will have to be held remotely. In this case, the teaching activity will be replace by a presentation.\r\n\r\nTo obtain an offer of a placement with the Wokingham Federation, there will also be a second interview with this partnership of schools.","howSchoolPlacementsWork":"Successful applicants for this course will work in two schools within the Wokingham Federation.","personalQualities":"We are looking for applications from people who have the desire, passion and determination to be outstanding teachers. The Wokingham Federation is proud of its schools and they are  all keen to work with trainees who would like to be a part of it, at least for a year and possibly for longer.\r\n\r\nPersonal qualities include:\r\n* A friendly and approachable nature \r\n* Good interpersonal skills   \r\n* An innate ability to communicate and relate to young people \r\n* A positive outlook and resilient nature \r\n* A creative and innovative approach \r\n* The ability to reflect on and improve practice ","otherRequirements":"All trainees are required to undergo an enhanced DBS check to verify their suitability for working with young people. \r\n\r\nThey will also be required to complete a Fitness to Teach on-line health questionnaire to ensure they are well enough for the rigors of the teaching profession.\r\n\r\nIf an applicant has lived overseas for more than 12 months in the past 10 years, an overseas police check is required.","status":1,"createdAt":"2021-07-06T10:47:20.784Z","updatedAt":"2021-09-27T12:00:01.200Z","canSponsorStudentVisa":"no","cycle":"2024"}
