{"id":"72e77354-9964-43fd-9759-7550d93cf3a9","name":"Computing","code":"22ZN","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"e6be6a9c-8696-4b88-8fbd-1ba1bef1b6fc","code":"11","name":"Computing"}],"locations":[{"id":"87c0927f-14ab-4ad7-a3b7-752cafae1923","name":"The Bulmershe School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"3654750b-61f6-4344-865a-7e47e6362390","code":"152","name":"The Wokingham Federation"},"accreditedBody":{"id":"6439adcc-af64-4d3d-a1da-de045755db06","code":"R12","name":"The University of Reading"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":16450,"financialSupport":"Students who have previously graduated from an undergraduate course at the University of Reading will be eligible for an alumni discount amounting to 10% of the tuition fee (up to a maximum of £1,000) for Home/EU students or £1,000 for International fee-paying students.\r\n\r\nYou may be entitled to a bursary and other support. Please see the [Get into Teaching](https://getintoteaching.education.gov.uk/funding-my-teacher-training) website for more details.\r\n\r\n\r\n","aboutCourse":"This Post Graduate Certificate of Education (PGCE) Secondary Computing course leads to the award of Qualified Teacher Status (QTS). It is identical to the University of Reading's course [IX99](http://www.reading.ac.uk/ready-to-study/study/subject-area/education-pg/pgce-secondary-education-computer-science.aspx). Applicants to this course, 22ZN, will however be interviewed by the Wokingham Federation and if successful will train in two Federation schools. They will follow the same course as IX99 and will become members of the University in the same way as all the other successful applicants to this course.\r\n\r\nThe course supports its trainees to become reflective professionals who are able to secure the very best for all children. We work with them to be resilient, creative and inclusive. With the highest expectations of learning, progress and development, trainees inspire young people to become confident, active citizens who are able to cope with the fast-moving demands of the 21st century.\r\n\r\nThe aim of the partnership between the Wokingham Federation and the University of Reading is to train excellent practitioners who have a positive impact on their pupils. This is accompanied by the recognition that excellent teachers continue to develop throughout their careers and never stop learning. Our intention therefore is that trainees should take ownership of their development during this year of training and establish the habits of reflective practice that will sustain them throughout their careers.\r\n\r\nTrainees have the opportunity to work with an experienced community of tutors, established in the field of Computing education and IT, who are engaged actively in teaching, research and national developments in Computing education and international projects in Technology Enhanced Learning. They will be taught about inclusive approaches to teaching computing, computational thinking, problem solving and demystifying computing for young people.\r\n\r\nAt the University, trainees learn through a series of practical seminars, workshops, microteaching activities, presentations by subject experts as well as independent and group research in a purpose-built IT suite with an extensive range of resources. Interactive and discussion-based teaching techniques encourage trainees to engage, reflect and challenge ideas around computing education and pedagogy.\r\n\r\nBetween the campus environment and the diversity embedded within the Federation schools, our trainees develop a strong identity as beginner teachers and educators of the future. Please see [School Direct with the University of Reading](http://www.reading.ac.uk/education/pgce-qts/ioe-secondary-school-direct.aspx) for more details.\r\n","interviewProcess":"Applicants called to interview will be interviewed at a Federation school on behalf of The Federation.\r\n\r\nThe interview process will consist of:\r\n\r\n* an introductory meeting\r\n* a written task\r\n* a teaching task with a small group of students\r\n* a formal interview\r\n\r\nThere may also be additional tasks, for example to meet with a student panel or to observe a lesson and then share observations.\r\n\r\nIt is also possible that applicants will have to be interviewed remotely. When this is the case, the teaching task will be replaced with a presentation to the interviewing panel. \r\n\r\n","howSchoolPlacementsWork":"Trainees will work in two of The Federation's nine mainstream School Direct secondary schools. Please see [The Wokingham Federation](http://wokinghamfederation.co.uk/home/schools/) website for details of the schools.\r\n\r\nDuring the course of the year, all trainees will have experience of teaching all years from Years 7 - 13, including working with both GCSE and A Level groups.\r\n\r\nTo ensure they are fully supported during the course, trainees have a mentor at their schools and a tutor with the University, both of whom work closely with them throughout the year.\r\n\r\n\r\n","personalQualities":"We are looking for applications from people who have the desire, passion and determination to be outstanding teachers. The Wokingham Federation is proud of its schools and they are  all keen to work with trainees who would like to be a part of it, at least for a year and possibly for longer.","otherRequirements":"If you accept an offer from The Wokingham Federation, you will also be required to complete Occupational Health and Disclosure Barring Service (DBS) Enhanced Disclosure checks successfully.\r\n\r\nThese checks are required to ensure you meet the Department for Education’s requirements for physical and mental fitness to teach, as well as assessing your suitability for working with children.\r\n\r\nYou will also need to demonstrate competence in Fundamental English and mathematics by the end of the course. This is a new DfE requirement which replaces the QTS skills tests in literacy and numeracy.","status":1,"createdAt":"2021-07-06T10:47:19.995Z","updatedAt":"2021-09-27T09:19:01.483Z","canSponsorStudentVisa":"yes","cycle":"2024"}
