{"id":"ba5a0aa5-86fd-405d-8fc7-10f5f13b59e2","name":"Biology","code":"G322","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"322cfc19-d51d-45db-91e3-bd7b4738470f","code":"C1","name":"Biology"}],"trainingProvider":{"id":"3654750b-61f6-4344-865a-7e47e6362390","code":"152","name":"The Wokingham Federation"},"accreditedBody":{"id":"6439adcc-af64-4d3d-a1da-de045755db06","code":"R12","name":"The University of Reading"},"profPost":"PG","english":"3","maths":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","aboutCourse":"We train teachers who become reflective professionals, able to secure the very best for all children. We support them to be resilient, creative and inclusive. With the highest expectations of learning, progress and development, they inspire young people to become confident, active citizens who are able to cope with the fast-moving demands of the 21st century.\r\n\r\nThe course offers considerable practical experience which is grounded in rigorous educational research. \r\n\r\nThe aim of the partnership of the University of Reading and the Wokingham Federation is to train excellent practitioners who have a positive impact on their pupils. This is accompanied by the recognition that excellent teachers continue to develop throughout their careers and never stop learning. Our intention is that you should take ownership of your development during this year of training and establish the habits of reflective practice that will sustain you throughout your career.\r\n\r\nBetween the campus environment and the diversity embedded within the Federation schools, our trainees develop a strong identity as beginner teachers and educators of the future. Please see [School Direct with the University of Reading](http://www.reading.ac.uk/education/pgce-qts/ioe-secondary-school-direct.aspx) for more details.\r\n\r\nOur commitment to ensuring equal opportunities is evident through our pastoral support which recognises and nurtures the potential in every trainee. ","interviewProcess":"Applicants called to interview will be interviewed at a Federation school on behalf of The Federation.\r\n\r\nThe interview process, which typically takes about 3 hours, will consist of:\r\n\r\n* an introductory meeting\r\n* a written task\r\n* a teaching task with a small group of students\r\n* a formal interview\r\n\r\nThere may also be additional tasks, for example to meet with a student panel or to observe a lesson and then share observations.\r\n\r\n","howSchoolPlacementsWork":"Trainees will work in two of The Federation's nine mainstream secondary schools. Please see [http://wokinghamfederation.co.uk/home/schools/] for details of the schools.\r\n\r\nDuring the course of the year, all trainees will have experience of teaching all years from Years 7 - 13, including working with both GCSE and A Level groups.\r\n\r\nTo ensure they are fully supported during the course, trainees have a mentor at their schools and a tutor with the University, both of whom work closely with them throughout the year.\r\n\r\n\r\n","personalQualities":"We are looking for applications from people who have the desire, passion and determination to be outstanding teachers. The Wokingham Federation is proud of its schools and they are  all keen to work with trainees who would like to be a part of it, at least for a year and possibly for longer.","otherRequirements":"","status":2,"createdAt":"2021-07-06T10:47:20.926Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"\r\nThe salary will be paid from the unqualified teacher pay scale.\r\n"}
