{"id":"bc60fabb-c404-403a-99d1-704eab89c991","name":"Primary with mathematics","code":"L419","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"286cf12f-b3e3-41c5-9f33-2ff7807d2df0","code":"03","name":"Primary with mathematics"}],"locations":[{"id":"87c0927f-14ab-4ad7-a3b7-752cafae1923","name":"The Bulmershe School","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"3654750b-61f6-4344-865a-7e47e6362390","code":"152","name":"The Wokingham Federation"},"accreditedBody":{"id":"6439adcc-af64-4d3d-a1da-de045755db06","code":"R12","name":"The University of Reading"},"profPost":"PG","english":"1","maths":"1","science":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feesInternational":16450,"financialSupport":"Students who have previously graduated from an undergraduate course at the University of Reading will be eligible for an alumni discount amounting to 10% of the tuition fee (up to a maximum of £1,000) for Home/EU students or £1,000 for International fee-paying students.\r\n\r\nYou may be entitled to other support. Please see the [Get into Teaching](https://getintoteaching.education.gov.uk/funding-my-teacher-training) website for more details.\r\n\r\n\r\n","aboutCourse":"\r\nFor this School Direct course, Wokingham primary schools work in close partnership with the University of Reading. The course offers a high-quality, school-focused and personalised approach to trainees from diverse backgrounds and experiences.\r\n\r\nThis course, G355, is a one-year full-time route into teaching, leading to the award of Qualified Teacher Status (QTS) and Post Graduate Certificate of Education (PGCE) on successful completion.\r\n\r\nTrainees spend most of their time in school, with approximately 30 days based at the University of Reading on its London Road campus. \r\nThey are based in one school for most of the year, with a minimum of six weeks in a contrasting school to broaden their training experience. \r\n\r\nThe course begins in early September, and finishes at the beginning of July the following summer. \r\n\r\nInitially, trainees will be observing and working alongside class teachers as they get to know the children and their routines. At a pace tailored to each individual, they will then begin to take on small groups, building up to being responsible for planning, teaching and assessing the children for 80% of their timetable by the end of the year. This ensures that trainees are completely confident in their teaching skills before entering the teaching profession. \r\n\r\nPlease see [Primary School Direct with the University of Reading](https://www.reading.ac.uk/education/pgce-qts/ioe-primary-school-direct.aspx) for more details.\r\n","interviewProcess":"\r\nInterviews will take place in a Wokingham Primary School Direct school and will typically contain an observation of a lesson, a short teaching task, a written task and a formal interview.\r\n\r\nThis will be an opportunity not only for schools to assess applicants, but also for applicants to decide whether the Wokingham Primary School Direct route is the best one for them. During the course of the interview process, there will therefore be many opportunities for all the parties involved to ensure this is a good match.\r\n\r\nMore details of the process will be confirmed in writing at the point of inviting to interview.\r\n\r\nIt is possible that interviews will have to take place remotely. If this is the case, the teaching task will be replaced with a presentation.\r\n","howSchoolPlacementsWork":"\r\nTrainees carry out their training in two Wokingham School Direct Primary Schools, with the course ensuring their work spans four year groups. \r\n\r\nDuring the second placement, trainees work towards leading on 60% of the timetable.\r\n\r\n","personalQualities":"\r\nWokingham is proud of its schools and we are looking for applications from people who have the desire, passion and determination to be outstanding trainee teachers within these schools. All the primary schools offering the School Direct route into teaching are keen to work with these trainees, at least for a year and possibly for longer.","otherRequirements":"\r\nNo school experience is required, but it would of course be helpful.","status":2,"createdAt":"2021-07-06T10:47:21.020Z","canSponsorStudentVisa":"yes","cycle":"2024"}
