{"id":"e595a9cc-16a9-40cd-b0ea-70deb1ad0c63","name":"Primary","code":"2H44","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"3_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"25dbb5cd-d8ae-43be-aadb-134e24241f69","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"74c02a9b-401d-4dec-a17e-ac860541e9fb","code":"C97","name":"Cumbria Primary Teacher Training"},"profPost":"BO","degreeGrade":"9","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"The course is solidly based on the Professional Standards for Qualified Teacher Status and embeds the Initial Teacher Education (ITE) Core Content Framework and thus covers all the varied demands made on the modern primary teacher from recent developments in the curriculum.  We are supported in this by the school-centred nature of our course. Our School Integrated Learning systems follow the curriculum delivery cycle of assessment, planning, delivery, practice, review and improve.  Which makes for very effective learning and allows us to work to our key belief that, if our trainees are to attain their full learning potential, it is essential for us to model best practice. It is also worth noting that, even though trainees will be working at post-graduate level and in a highly critical and analytical manner, all of our course content is directly and practically relevant to making them first-rate classroom practitioners. \r\n\r\nAll of the tutors and mentors working with our trainees are established, expert classroom practitioners.  \r\n\r\nOur target award for all our candidates is a Post Graduate Certificate in Education (PGCE) with Qualified Teacher Status (QTS.) The PGCE offers sixty credits at masters' degree level (approximately a third of a masters' degree.) However we recognise that the needs of all learners are different and therefore the course is designed flexibly to allow multiple exit qualifications: PGCE plus QTS; QTS only; and Professional Graduate Certificate of Education only. ","interviewProcess":"Feedback indicates that we have a very welcoming and friendly selection procedure that puts prospective candidates at their ease and allows them to relax and give of their best. This includes a thorough briefing pack that allows candidates to prepare thoroughly and to know exactly what is expected of them.\r\n \r\nWe take your application and selection very seriously and it involves the full spectrum of CTT staff: the SCITT Lead; head teachers of CTT Board; the Senior Administrator; and school-based mentors. You can be sure of a friendly, interested, welcoming, fair but very thorough approach.\r\n \r\nSelection begins with careful scrutiny of application forms. You will always receive personal feedback on your application, whether or not you are successful.\r\n \r\nIf you are then invited for interview you will be asked to:\r\n \r\n* Discuss a story that you would choose to read with a group of children and explain your reasons for this choice.\r\n* Complete a co-operative group discussion task with interviewers.\r\n* Complete a written task based on the above.\r\n* Give a short presentation.\r\n* Answer questions in a traditional interview.\r\n  \r\nYou will be informed on the day if we are going to offer you a place or not and, whatever the decision, you will receive detailed feedback on how you acquitted yourself.\r\n \r\nCTT is committed to safeguarding and we build this into our selection procedures. All centre staff involved in selection are trained in safe recruitment and all our schools have similar training, policies and procedures in place.","howSchoolPlacementsWork":"As a SCITT, the CTT partnership of schools currently comprises 17 good and outstanding schools based in and around West Cumbria. \r\n\r\nOur partner schools are all located on the fringe of the Lake District, adjacent to some of the most beautiful parts of the country. All of the CTT schools are located within a 40 minute drive of the training centre in Workington. Some of our schools are difficult to reach via public transport, so placements are organised with an awareness of your travel capabilities. \r\n\r\nA strength of our programme is the opportunity for trainees to engage with a diverse range of teaching and training experiences. The school catchments are contrasting, with schools covering urban areas, small towns and very rural regions.\r\n\r\nDuring the Autumn term trainees will undertake subject based, research focused, mini-placements on the core subjects, concluding the Autumn term with an extended placement of 4 weeks.\r\n\r\nDuring the Spring term trainees will undertake subject based, research focused, mini-placements on the foundation subjects, concluding the Spring term with an extended placement of 5 weeks.\r\n\r\nThe final school based extended placement will take place during the Summer term and is 10 weeks.\r\n\r\nIn all placements you will be supported by expert colleagues/mentors in the delivery of your lessons. The first extended placement will focus on the core subject areas. The second placement will further develop your teaching of the core subject areas and also foundation subjects. In the third placement you will develop your teaching skills in all areas, moving towards full time teaching by the end of the placement.\r\n\r\nYou will also experience strategic facility teaching opportunities.\r\n","personalQualities":"We look for individuals who have the potential to be inspirational teachers.\r\nYou should be enthusiastic and committed with a love of learning. \r\n\r\nYou should be polite, considerate and positive with an ability to form strong working relationships with children and colleagues. \r\n\r\nYou should have strong, foundation skills and subject knowledge that, combined with the attitudes above and our support, will allow you to progress well against the QTS standards. ","otherRequirements":"* Meet the Secretary of State's requirements for physical and mental fitness to teach. \r\n\r\n* Have not previously been excluded from teaching or working with children. \r\n\r\n* Present strong references from a main tutor of the most recent University attended (or current employer if you left University more than five years ago) and from a school if you have worked, or volunteered in one. ","status":1,"createdAt":"2021-07-06T10:57:09.721Z","updatedAt":"2021-10-06T11:48:36.168Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
