{"id":"591e63bd-c110-4716-9494-0bb705b75a5a","name":"Primary","code":"2DWD","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"12b2ef48-2d37-4c2e-b2fa-7bdc59e5b4f7","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"},{"id":"470e8995-0b54-41e9-a68c-0f9f9e551e6e","name":"St Mary's RC Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"ad858c8b-a6a6-4796-910d-5a717984c210","name":"Saint Gilberts Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"6da29d3b-71f8-4b02-9f59-66e053a88224","name":"St Teresa's RC Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"3df5b581-c6be-4626-9cf6-6ffa1481b6bd","name":"St Joseph the Worker RC Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"93bdc0e7-3eb2-4ca5-b1a0-8e29da654153","name":"Holy Cross and All Saints RC Primary School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"d6fb80a1-7ba4-41ba-b07b-86a21ff1eb49","code":"18A","name":"St Patrick’s Greater Manchester Alliance"},"accreditedBody":{"id":"e328aab3-a535-4921-8ded-5e37133c76dd","code":"L46","name":"Liverpool Hope University"},"profPost":"BO","degreeGrade":"0","english":"1","maths":"1","science":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"no","courseLength":"Sept  - End July","feesUK":9250,"aboutCourse":"During your training year you will receive outstanding professional issue sessions provided by staff currently working in a National Teaching School and across our family of Alliance Primary Schools. This research based training ensures that you have an effective understanding of Teaching and Learning so that you can make a real difference in your own classrooms.\r\n\r\nFind out more about our courses on our [website] (https://teachingschool.stpatricksrchigh.co.uk/initial-teacher-training/what-is-school-direct/)\r\n\r\nOur Primary course is led and developed by current Primary school teachers, including Specialist Leaders of Education (Primary) and Headteachers. \r\n\r\nThe course has training sessions in local primary schools, at Saint Patrick's RC high School and their are 12 University Sessions at Liverpool Hope to support you in gaining your PGCE. This means that you can be based in schools for delivery of sessions allowing you to gain first hand experiences of theory and see it in action in the classroom.\r\n\r\nSessions are timed to support what you are doing in schools and allow you to reflect and learn from your experiences. With a rich curriculum to develop Children you will receive focused sessions to support your teaching in all subject areas.\r\n\r\nThe course has a gradualised build up into teaching. You can plan, teach and share classes with the class teacher so that you can learn as your confidence develops. We have two full induction days before September and a chance to visit your placement schools. This helps you to build a wonderful community with all the trainees and staff that you will be working with.\r\n\r\nWe work in partnership with Liverpool Hope University who have a Gold Standard in Teaching Excellence, ensuring that you always receive the very best training during your teaching year. These 12 university sessions also provide you with an additional chance to network and share outstanding practice across Initial Teaching Training cohorts. As well as your QTS and PGCE you will receive 60 masters credits on our Schools Direct course.\r\n\r\nFind out more about our Gold Standard University partner by visiting their [website] (www.hope.ac.uk/teachereducation)","interviewProcess":"You will be interviewed by staff who are passionate about Education and supporting the next generation of teachers. These small panels may contain members of Saint Patrick's RC High School Teaching School, our Departmental Heads, Alliance School mentors and University partners. You are joining our family and we all wish to support you and get to know you.\r\n\r\nDuring the day you will have the opportunity to meet with pupils. We will email you all the information that you need before you attend an interview. We do not attempt to trip you up or have any surprises in your day.\r\n\r\nThe interview days are a wonderful chance to meet staff you will be working with, other trainees who may join you on the course next year and have any questions answered that you have.\r\n\r\nWe work in partnership with our Trainees, supporting them in becoming the best teachers so that young people in our care can achieve. Our interviews ensure that you have the opportunity to flourish. With this in mind we complete a short subject knowledge test. This is so that we can give you help and advice about the areas of the curriculum in schools that you might need to revise before your course begins.\r\n\r\nWe realise that you may have more than one interview offered to you and that your work commitments might prevent you from attending an interview. Please let us know if this happens so we can reschedule them for you.","howSchoolPlacementsWork":"Our trainees complete two contrasting placements so that they can develop the skills needed to be an effective teacher in a range of settings. \r\n\r\nThe Course offers a gradualised teaching timetable, slowly building up your teaching time.\r\n\r\nYou will work closely in one of our Primary Schools for most of the year. This Home school allows you to build up a real relationship with the class and school, you become a member of staff. During the programme you will also have the chance to work in a second school for a half term. This allows you to experience a different Key Stage and class. Seeing how other schools work enables you to develop a new set of skills before you return back to your home school.\r\n\r\nWhen deciding placements schools:\r\n\r\n*When possible we try to match where you live to Alliance Schools in your area. We have a wide range of schools in Greater Manchester and Blackburn schools.\r\n\r\n*We look carefully at the placement schools that you will be placed in. Sometimes an extra travel time benefits you as you work in a department that is supportive and welcoming. This reduces your stress and workload during the year.\r\n\r\n*We do allow you to make your own placements (it may be you have connections in schools or wish to work in a particular school you are currently working in as a TA or have completed school experience in). If the school matches our ethos and agrees to support you and join our alliance we can accommodate this.\r\n","personalQualities":"We are looking to support you as you enter a profession that is rewarding and life changing for the young people that we serve. The young people in our care deserve the very best. As a result we look to work with people who:\r\n*Have a passion for learning, social justice and supporting every child\r\n*Are reflective and always looking to improve and push themselves to excel\r\n*Work in collaboration and partnership. We expect our trainees to support each other, share advice and be open to learning. They are willing to ask for help and look forward, learning from mistakes.","otherRequirements":"You will be asked to provide certificates as prove of your academic achievements. You can get these from the exam board that you sat for GCSE or for your degree, from your University. We will ask you to complete a DBS check after interview and a short medical form. This is standard practice across many providers.","status":1,"createdAt":"2021-07-06T10:55:13.776Z","updatedAt":"2021-09-29T07:57:44.297Z","canSponsorStudentVisa":"no","cycle":"2024"}
