{"id":"e748036d-a4cd-475a-bc6f-95086ad3a702","name":"English","code":"2SBX","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3aed1aa8-ae46-4b68-92bb-a6cc20655c59","code":"Q3","name":"English"}],"locations":[{"id":"5b4eb849-b698-4352-9aab-53cc80adb0e2","name":"Hungerhill School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"86595f62-0f4f-4c9b-89bf-30c719d6ca89","code":"298","name":"Hungerhill School"},"accreditedBody":{"id":"43920484-d42a-42ca-8071-74b1ff5e81cc","code":"S97","name":"The Sheffield SCITT"},"profPost":"BO","degreeGrade":"9","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We do not offer equivalency tests ourselves but there are third party providers who do, for example equivalencytesting.com and A Star Equivalency.\n\nThere are up-front costs associated with these courses which you will need to fund. As the test centres could be a distance from where you live there could also be travel costs. \n\nIn addition, you may need to book the test in advance so make sure you give yourself plenty of time to pass the test before our course starts in September.","courseLength":"OneYear","feesUK":9250,"feeDetails":"There are Student Loans available to pay the fees. \r\n\r\nIf you decide to pay privately then the payment schedule is:\r\n\r\n* Term 1: £2,625\r\n* Term 2: £2,625\r\n* Term 3: £4,000\r\n\r\nEach amount is due on the first day of each term.\r\n\r\nYou will be required to pay the cost of the Enhanced Criminal Record Check in advance of starting the course.","financialSupport":"We are not able to offer any monetary financial support to trainees, however we can offer the following:\r\n\r\n* We will keep you informed as to whether you are eligible for a government funded Train to Teach Bursary. \r\n* We will support you with the Student Finance Application process.\r\n* We will also make you aware of any national scholarships that may be available for the subject you are training to teach.\r\n* We offer free membership of the 'Westfield Healthy Extras' emotional wellness support package to support you during your ITT year.","aboutCourse":"Hungerhill School is committed to providing quality first teacher training. We continually develop and review our programme of study to make it current and relevant. Our course exceeds the statutory requirements for Initial Teacher Training in all areas. Your training will be informed throughout by the evidence base as to what makes the most effective teaching.\r\n\r\nThis course entails 4 days per week in school, during which time you will be guided by an experienced mentor: they will introduce you to school life and help you to learn how to teach your subject as you work your way through the Teachers’ Standards. \r\n\r\nOn one day per week you will take part in study days with fellow trainees in our training centre on the Hungerhill School site. This involves specialist input from the best practitioners who will help you develop your practical classroom skills as well as a deep theoretical understanding of subject specific pedagogy. You will be trained on varied aspects such as how to walk and talk like a teacher, plan lessons effectively, behaviour management and how to really stretch and challenge students. \r\n\r\nThere are three formally assessed teaching practices throughout the year. You will begin, and spend the majority of the year, in your ‘Home School’ and there will be the opportunity to complete one teaching practice in a contrasting secondary school. \r\n\r\nOur PGCE is delivered through the University of Hull. You will spend approximately 4 days over the year with your tutors at the University of Hull alongside some virtual sessions to support with completing the two assignments.\r\n\r\nOur 100% school-based approach means you will experience the full cycle of the school year from welcoming and settling new students in September to celebrating the success of students in July: by the end you will be ready to embark on your first full year as an NQT.","interviewProcess":"Once you have applied we will then start the selection process based on your qualifications, experience and evidence of being ready to train to make a great teacher. \r\n\r\nMost interviews will only involve stage 2 (detailed below) however for over-subscribed subject areas where there are limited places, such as PE, stage 1 interviews will be carried out first. These are held at Hungerhill School and you will be required to participate in a group activity, which involves being able to take part in a discussion and reflect upon your contributions. This task not only assesses your awareness of education issues but also allow you to demonstrate your interpersonal and communication skills. Success at stage 1 will lead to a stage 2 interview. \r\n\r\nStage 2 interviews also take place at Hungerhill School and are led by the ITT coordinator and a subject specialist. The interview process will include a formal interview about subject knowledge and teaching methods, as well as a 15 minute teaching activity which we will ask you to write a written reflection about afterwards. We also ask you to complete a literacy and numeracy skills audit so we can see if you need support in either area before starting your training year.\r\n\r\nSubject knowledge enhancement courses are available through The Sheffield SCITT for some subjects: you may find this useful if your degree isn't directly related to your subject. We can advise you on this when we meet you.","howSchoolPlacementsWork":"You will spend most of the training year in your Home School (September to December and from Easter to July): these schools are central to the selection process and our school based interview system. You can express a preference for your Home School based on location, the type of school or a personal connection to a community you want to serve.\r\n\r\nThere is also a short alternative placement in a contrasting secondary school from January to Easter and a week long experience in a primary school. \r\n\r\nAll of our main and alternative placements schools are secondary schools: some have a Sixth Form and some don’t. Sixth Form teaching is not a requirement to gain QTS, however we can guarantee one of your placement schools will have a Sixth Form so you can gain experience in this phase if you choose. \r\n\r\nIt would be sensible for trainees to base themselves within commutable distance of their Home School so this is finalised with you before the summer holidays to allow you to arrange your accommodation. We make every attempt to make sure the alternative placement school is in an accessible location but it may involve a few weeks of travelling further to get that all important contrasting experience in the right school for you.\r\n\r\nAlongside Hungerhill, our ITT placement schools include:\r\n\r\n* Armthorpe Academy, Doncaster\r\n* Astrea Academy Woodfields, Balby, Doncaster\r\n* Doncaster UTC, College Road, Doncaster\r\n* Maltby Academy, Maltby\r\n* South Axholme Academy, Epworth, Doncaster\r\n* The McAuley Catholic High School, Cantley Lane, Doncaster\r\n* XP School, Doncaster\r\n\r\nHungerhill is our main placement school. As a Teaching School we take a leading role in recruiting and training new entrants to the profession, not least by exemplifying excellent standards of teaching. Charlie Taylor, the Chief Executive of NCTL, said: “Hungerhill School should be very proud of this achievement. The school has been recognised as a centre of excellence in its area, with an outstanding performance and a track record of raising standards through supporting other schools.’’\r\n\r\nFor further information, please visit the Hungerhill School website (https://www.hungerhillschool.com/page/?title=ITT+at+Hungerhill&pid=109) and/or email kinghorn.k@hungerhillschool.com","personalQualities":"We are looking for ambitious trainees who:\r\n \r\n* are passionate and enthusiastic about teaching\r\n* care about our schools, the communities they serve and the special ethos each school has \r\n* show potential to become the next generation of outstanding teachers\r\n\r\nWe look for evidence that you have had relevant experience of working with young people. Recent experience of working in a classroom in the age range you wish to teach means you should have a good awareness of how schools operate and teaching in action. Applicants should demonstrate how they have engaged, communicated with and inspired young people.\r\n","otherRequirements":"You will need to pass an Enhanced Criminal Record Check before starting the course. \r\n\r\nIdeally you will have experience working with children in a school or another organisation. However, this is not obligatory to apply.\r\n\r\nAs we are not allowed to hold a licence to sponsor visa applications, you will need to be a UK citizen or have been granted “Settled Status” by the UK Home Office. If you are not a UK citizen, you will need to prove you have access to Public Funds or can support yourself financially during your course prior to being offered a place.   ","status":1,"createdAt":"2021-07-06T10:57:12.448Z","updatedAt":"2021-10-03T20:21:52.851Z","canSponsorStudentVisa":"no","cycle":"2024"}
