{"id":"ea066019-877c-4844-82a0-2c6ec1779aeb","name":"Chemistry","code":"F2X1","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"912d4fb4-761b-42e9-8dc6-e968b791ea4e","code":"F1","name":"Chemistry"}],"locations":[{"id":"a38d4444-91d7-4acf-9076-39571408e213","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"feecdec5-259c-45e3-b1cf-4e391936ee90","code":"H36","name":"University of Hertfordshire"},"profPost":"BO","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"Usually we would expect the degree to have a minimum 50% content of the subject in which the applicant is applying. However, applicants whose degree does not meet this requirement should contact us to discuss further at secondaryteam@herts.ac.uk.","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"The PGCE Secondary course is a full time, one year Initial Teacher Education qualification introducing you to the requirements for teaching to the 11 – 16 age range. Where appropriate, opportunities to experience post 16 provision will be available. It has been designed to enable you to demonstrate evidence of having met the Teachers’ Standards that lead to Qualified Teacher Status. Whilst undertaking the University-led PGCE route into teaching you will work towards securing 60 Master’s level credits. This is an integral part of the programme. We strongly believe that innovative and effective teaching and learning is made possible through a teacher’s full engagement with research informed practice and underpinning theories of learning. This is fostered in two modules and developed through School Based Training. You will be well supported in becoming a critically reflective teacher capable of inspiring pupils to learn, achieve and flourish.\r\n\r\nYou will be supported and taught by specialist tutors with excellent experience, knowledge and research informed expertise. Partnership schools provide opportunities for you to learn about pedagogical approaches relevant to your subject specialism and the professional responsibilities of all teachers.\r\n\r\nYou will have two School Based Training placements, where, with the support of a teacher mentor and a university subject tutor, you will develop your skills to become an excellent classroom teacher. Training to teach is exciting, rewarding and demanding. By the end of the course you will be well prepared for employment as a Newly Qualified Teacher (NQT).","interviewProcess":"The ability to train to teach is assessed first on application and then at interview. The interview day is a two-way process in which we encourage all applicants to ask questions to ensure that our PGCE course is suitable for them. \r\n\r\nIf invited to interview, you will be greeted by the Admissions Tutor and members of the PGCE team. Interviews will begin with a brief introductory talk on the PGCE programme, followed by the completion of a short written task. You will then deliver a 5 minute pre-prepared, micro-teaching activity from your subject specialism to other applicants and two members of the PGCE team. This will be followed by a one-to-one interview with the same two members of the PGCE team. ","howSchoolPlacementsWork":"Schools in the University of Hertfordshire schools' partnership have a proven track record of strong engagement with Initial Teacher Education.  Schools are evaluated and monitored in relation to the quality and effectiveness of school based training provision.  School’s commit to enact the terms of the University of Hertfordshire Partnership for Initial Teacher Education. \r\n\r\nYour School Based Training will total a minimum of 120 days. In addition to the two main placements you will: \r\n* visit a primary school to consider Year 6 transition\r\n* visit a special school to explore effective differentiation and inclusion for pupils with complex learning needs\r\n* visit a school demonstrating excellent provision for pupils with English as an additional language","personalQualities":"In your application and during the interview process, you will need to demonstrate an ability to train to teach through the following:\r\n\r\n* genuine care for children’s learning, progress and achievement\r\n* a commitment and passion for your subject specialism\r\n* your motivation and interest in training to teach\r\n* excellent interpersonal and communication skills\r\n* a commitment to working with children and adolescents and improving their educational outcomes\r\n* the ability to be organised, adaptable and resilient\r\n* a willingness to work and learn from others and to be responsive to feedback\r\n","otherRequirements":"You will be required to complete a Disclosure and Barring Service (DBS) check. You will also need to respond to targeted and relevant health questions. Guidance will be provided after you have been offered a place.","status":1,"createdAt":"2021-07-06T10:50:56.647Z","updatedAt":"2021-09-29T08:30:25.766Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
