{"id":"1eabaed4-7985-4d63-a6f2-db37878f68c1","name":"Primary","code":"273P","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"740d5ae6-20f7-49e1-9eb8-2b8cb6451944","name":"Broomfields Junior School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"d0d173a3-514d-418a-9fbd-b48d98a5bdef","code":"1BD","name":"AIM Primary Alliance"},"accreditedBody":{"id":"e843cb68-d310-478c-8dba-cf9633fea086","code":"C55","name":"University of Chester"},"profPost":"PG","degreeGrade":"0","english":"1","maths":"1","science":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feesInternational":11450,"aboutCourse":"School Direct is an innovative Initial Teacher Training programme offering an outstanding, in school, experience with the highest and most rigorous expectations and intended outcomes.\r\n\r\nThe AIM Primary Alliance comprises of eleven primary partner schools with a proven, long-standing, track record in training the outstanding teachers of tomorrow. Our commitment is to create confident, creative and innovative classroom practitioners who share and embrace our aspiration to excellence.\r\n\r\nWorking closely with our university partner in a supportive and complementary relationship, we will offer all our successful applicants a school-based programme, in a range of schools and contexts, with a clear focus upon enhanced employability and leadership capacity. The AIM Primary Alliance School Direct partnership programme will lead to the award of QTS status and a PGCE including credits towards Masters-level accreditation.\r\n\r\nThroughout the school year there are three school based placements: Key Stage 1, lower Key Stage 2 and upper Key Stage 2.  The school-based programme is assessed at three review points, ensuring that there is support at each stage of the learning journey.  \r\n\r\nWe are looking to recruit outstanding graduates with a passion for working with young people with the commitment to make a difference each and every day.\r\n\r\n","interviewProcess":"Admissions Process:\r\n\r\nForms are carefully screened to select applicants for interview. Primary School Leaders within the alliance will consider how much recent experience candidates have had in primary schools, academic qualifications including predictions, personal qualities and suitability for teaching, and additional interests or experiences.\r\nSelected applicants will be invited to attend an interview. Offers of places cannot be made until an interview has taken place. \r\n\r\nInterview Process:\r\n\r\nApplicants invited to attend an interview will complete a number of activities on the day. Typically, applicants will be asked to carry out a teaching activity with a small group of children, complete a series of school based tasks and have an individual interview with head teachers or leaders from various schools within the alliance.\r\nPlease note that you will certainly be asked about your experience of working with children and your knowledge of how primary schools operate. The interviewers will be trying to find out about your commitment to teaching and whether you have properly considered what a career as a primary teacher will involve. You may bring along any evidence of your work with children in school, such as portfolios of work or letters from head teachers, to discuss with your interviewers. You will also be given the opportunity to ask questions about the programme. All relevant information regarding the day is forwarded in good time to those applicants invited for interview.","howSchoolPlacementsWork":"During the teaching year there are three school based placements: Key Stage 1 and lower and upper Key Stage 2.  These placements are planned for the year during a meeting with all school leaders within the alliance.  \r\n\r\nAll of the AIM Primary Alliance schools are within Warrington, ensuring travel is kept to a minimum.  The wishes of the trainees are also considered during the planning of these placements, so that the very best match can be made with the trainees and the eleven partner schools.\r\n\r\nWithin each placement, there will be a professional and a class based mentor who will meet with you weekly to discuss your progress and support you in  your areas for development. \r\n\r\nYou will be allocated a University Link Tutor who works alongside the schools in ensuring your progression against the Teacher Standards.","personalQualities":"We are looking to recruit outstanding graduates with a passion for working with young people with the commitment to make a difference each and every day.  \r\n\r\nWe are keen to hear about your experience in education, alongside other personal interests that could be brought into the classroom environment to benefit the children.","otherRequirements":"A minimum of a two week work experience placement/voluntary work within a primary school.\r\nDBS checks will be required prior to the course commencing.","status":1,"createdAt":"2021-07-06T10:48:04.519Z","updatedAt":"2021-10-28T18:59:40.383Z","canSponsorStudentVisa":"yes","cycle":"2024"}
