{"id":"3f729eca-c75b-4c98-8a29-abee49b823b2","name":"Primary (3-7)","code":"2F34","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"P","ageRange":"3_to_7","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"747ad9a4-e9e5-4e92-b6cd-f031ff453742","name":"Main Site","isPublished":"Y","status":"S"}],"trainingProvider":{"id":"b384b008-59e2-461e-a15f-3551d1165c1e","code":"N77","name":"University of Northumbria at Newcastle"},"profPost":"PG","degreeGrade":"1","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"Candidates use a third party and pay the costs of these tests personally. As an ITE provider, we are registered with Equivalency Testing, following this link for further information https://www.equivalencytesting.com/","courseLength":"TwoYears","feesUK":9250,"feeDetails":"The main additional expense is the cost of travelling to your placement schools. ","aboutCourse":"Northumbria University is a centre of excellence for initial teacher education, this innovative high quality distance learning Early Primary course has been specifically developed to provide a route for students wishing to achieve a PGCE in Early Primary Education with Qualified Teacher Status. It has been especially designed to facilitate students who prefer both a school based and distance based route into teaching and require a longer trajectory of study due to work and life commitments. Students complete the programme in two years.\r\n\r\nThe Early Primary (Blended) course is divided into two parts. Both Part 1 and Part 2 consist of: on line study with directed tasks to be completed in an experience school, module assignments and an assessed teaching placement. This is supported by two university focussed weekends each year and occasional study days. ICT confidence and access to a personal computer with a broadband internet facility are essential requirements\r\n\r\nThe Early Primary course is designed to support students towards achieving the Standards for QTS. Students gain an in-depth knowledge and understanding of the Early Primary curricula  with particular focus on the 3-7 range, whilst obtaining a broad range of experiences. Students will be expected to demonstrate their ability to work independently as a self-motivated distance learner with support from their curriculum and professional tutors online.\r\n\r\nThis is a route for designed for highly motivated people, from all walks of life. It enables them to have the opportunity to enter a hugely rewarding profession. In following this route you will receive an excellent introduction to the teaching profession.\r\n\r\nFor full details of the course content please visit our website at [PGCE Early Primary Education] (https://www.northumbria.ac.uk/study-at-northumbria/courses/pgce-early-primary-education-blended-learning-gtpype6/)","interviewProcess":"All candidates are interviewed before a place on the course can be offered.\r\n\r\nOur interviews are currently face to face online. You will have a single individual interview with a member of the academic team or a colleague from one our partnership schools. You can expect your interview to last approximately 20 minutes.\r\n\r\nThere will be a reading task as part of this interview. You will need to select a book which you think would be suitable to share with children within the early primary age range. Have this book with you for your individual interview. As part of the interview you will be asked to read it, or a section of it, to your interviewer, as though you were reading to a group of children. You need to also be prepared to discuss how you might use this book to address either an area of the National Curriculum  or an area of Development Matters for children in the Early Years Foundation Stage. \r\n\r\n","howSchoolPlacementsWork":"A significant amount of the year will be spent in schools in both an assessed and non-assessed capacity. You will be supported in school by the expertise of an experienced teacher who will act as your mentor. Your mentor, following the guidance provided by the University, will support you in reviewing progress and setting targets to help you fulfil your potential as a teacher. \r\n\r\nYou will learn through school-based practice how to develop your theoretical, pedagogical and subject knowledge in classroom practice including the use of ICT across the curriculum, for the relevant age phases of Early Years and Key Stages 1. You will apply this knowledge through the planning, delivery and assessment of effective lessons within the primary curriculum ages 3-7. You will continually reflect upon the effectiveness of your own practice in order to achieve improved outcomes for the children within the setting and action your own continued professional development. You will develop a range of other professional skills including your ability to work cooperatively as part of a team, communicate effectively, adopt a flexible approach, be highly organised and overcome professional challenges through being dedicated and resilient. The combination of all of these skills will allow you to gather evidence in support of the Teachers' Standards 2012 and requirements for qualified teacher status.\r\n\r\nYou are required to successfully complete two non-assessed practical placements (including the completion of school based tasks) as follows:\r\n1.\tIn Year 1: 26 days in total \r\n2.\tIn Year 2: 24 days in total \r\n\r\nYou also complete two assessed placements as follows:\r\nYou are required to pass both of the following components:\r\n1.     Initial Assessed Placement 8 weeks (4 weeks in a Reception Class at the end of the children's Reception Year plus the first 4 weeks of the autumn term with the same children as they begin Year 1)\r\n2.\tFinal Assessed Placement  10 weeks (Summer term of your second year, could be any class within the 3-7 age phase)\r\n","personalQualities":"Candidates should have a genuine desire to support young children to maximise their potential.\r\nThey should  \r\n(*) have good interpersonal skills \r\n(*) have a positive outlook\r\n(*) be resilient\r\n(*) have a flexible approach\r\n(*) enjoy challenge\r\n(*) be able to cope with change","otherRequirements":"Candidates should be aware that this is a programme designed for students unable to access traditional ITE programmes who have the skills or experience to be a motivated distance learner. Candidates must be in a position to undertake two assessed placements in England for 8 weeks (Part 1) and 10 weeks (Part 2).\r\n\r\nAll offers of places on this course are subject to a satisfactory DBS Disclosure and Health Clearance.\r\n\r\nAlthough not compulsory, any prior experience in supporting the educational opportunities of children in the 3-7 year age range is desirable","status":3,"createdAt":"2021-07-06T10:51:40.378Z","updatedAt":"2021-09-24T13:12:04.694Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
