{"id":"78f3cbbd-d45c-4b19-8839-8f0a5ba7382f","name":"Primary (5-11)","code":"X100","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"747ad9a4-e9e5-4e92-b6cd-f031ff453742","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"b384b008-59e2-461e-a15f-3551d1165c1e","code":"N77","name":"University of Northumbria at Newcastle"},"profPost":"PG","degreeGrade":"1","english":"1","maths":"1","science":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"Candidates use a third party and pay the costs of these tests personally. As an ITE provider, we are registered with Equivalency Testing, following this link for further information https://www.equivalencytesting.com/","courseLength":"OneYear","feesUK":9250,"feeDetails":"The main additional expense is the cost of travelling to your placement schools. ","aboutCourse":"This course is delivered via a mix of lectures, seminars and workshops to provide you with opportunities to develop your theory and practical skills, whilst reflecting on your school-based experiences.\r\nPlacements will form a large part of your learning and throughout the duration of your course you will undertake two assessed placements within our partnership schools. Arranged by Northumbria University, your placements will cover a wide range of activities including group and individual tasks, observation and the planning and delivery of lessons.\r\n\r\nThis course is assessed via a range of methods that include written assignments (at Level 6 & 7), presentations, reflective personal portfolios and school-based assessments related to the planning and conduct of teaching a lesson. These methods will enable you to demonstrate that you have met the requirements to achieve PGCE and Qualified Teacher Status, aligned to the Teachers’ Standards 2012.\r\n\r\nFor full details of the course content please visit our website at [PGCE Primary Education] (https://www.northumbria.ac.uk/study-at-northumbria/courses/primary-education-pgce-ft-gtfpmd6/)","interviewProcess":"All candidates are interviewed before a place on the course can be offered.\r\n\r\nYou will have a single online individual interview with a member of the academic team or a colleague from one of our partnership schools. You can expect your interview to last approximately 20 minutes.\r\n\r\nThere will be a reading task as part of this interview. You will need to select a book which you think would be suitable to share with children within the primary age range. Have this book with you for your individual interview. As part of the interview you will be asked to read it, or a section of it, to your interviewer, as though you were reading to a group of children. You need to also be prepared to discuss how you might use this book to address an area of the National Curriculum. \r\n\r\n","howSchoolPlacementsWork":"You will spend most of your time in school in both non-assessed and assessed  placements \r\n\r\nInitial Paired Placement (Non-Assessed): This is a 6 week placement that takes place in School A during November/ December.\r\n\r\nFirst Assessed Placement: This is a 5 week placement also in School A during January/February\r\n\r\nFinal Assessed Placement: This is a 10 week placement in School B during April - June\r\n","personalQualities":"Candidates should have a genuine desire to support primary aged children to reach their potential.\r\nThey should  \r\n(*) have good interpersonal skills \r\n(*) have a positive outlook\r\n(*) be resilient\r\n(*) have a flexible approach\r\n(*) enjoy challenge\r\n(*) be able to cope with change","otherRequirements":"All offers of places on this course are subject to a satisfactory DBS Disclosure and Health Clearance.\r\n\r\nAlthough not compulsory, any prior experience in supporting the educational opportunities of children in the 5-11 year age range is desirable.","status":1,"createdAt":"2021-07-06T10:51:40.465Z","updatedAt":"2021-09-24T13:11:11.747Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
