{"id":"1f57b6cd-dd5b-412b-afd6-6b86e74a0a2d","name":"Primary","code":"2GPB","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_7","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"d81ef1d5-0aa8-42a4-90b9-a83249058ba6","name":"Mills Hill Primary School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"3e0deb50-0f01-42ca-b225-59a385c48347","code":"1Y3","name":"Mills Hill Primary"},"accreditedBody":{"id":"154509e2-743e-4f0b-9d99-396393aa57ff","code":"L27","name":"Leeds Beckett University"},"profPost":"PG","degreeGrade":"1","english":"1","maths":"1","science":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feeDetails":"Your tuition fees cover the cost of registration, tuition, academic supervision, assessments and examinations.\r\nThe following are also included in the cost of your course:\r\n\r\n* 24/7 Library and student IT support\r\n* Free wifi via eduroam\r\n* Skills workshops and resources\r\n* Library membership, giving access to more than 500,000 printed, multimedia and digital resources\r\n* Access to software, including five free copies of Microsoft Office 365 to install on your PC, laptop and MAC, and access to free high-end software via the Leeds Beckett remote app\r\n* Loan of high-end media equipment to support your studies.","financialSupport":"http://www.leedsbeckett.ac.uk/postgraduate/financing-your-studies.htm\r\n","aboutCourse":"Early Years & KS1 [3-7]\r\n\r\n“Education is the most powerful weapon which you can use to change the world”\r\n[Nelson Mandela]\r\n\r\nTrain to be a primary teacher and embark on a career in schools teaching children between three and seven, in Key Stage 1 and the Early Years Foundation Stage.\r\n\r\nWe will develop your knowledge and understanding of the Early Years Foundation Stage and the National Curriculum to ensure your teaching fulfils the requirements set out by the Government. With an emphasis on mathematics, English and Science at both Key Stages, you will embrace areas of learning and principles of best practice in early primary education across all subjects.\r\n\r\nYou will put your theoretical knowledge into practice. As part of your training, you will complete three teaching placements in the Early Years Foundation Stage and Key Stage 1, developing your teaching skills across different age ranges and helping to prepare you for future employment. Throughout these placements you will gain the specialist knowledge and teaching skills required to meet the needs of pupils in the three to seven age range.\r\n\r\nYou will develop children's abilities through playful learning and creative teaching, and you will reflect on how your teaching methods and the opportunities and environments you create can influence outcomes. Your training will include a focus on outdoor play and learning. You will have the opportunity to attend a forest school workshop using our outdoor classroom, where you will learn different techniques to bring learning to life and spark your pupils' imaginations.\r\n\r\nAs a primary school teacher, you will work closely with teaching assistants, parents and complex teaching teams to deliver a range of activities. We will give you the skills and confidence to manage these relationships to ensure you can deliver an outstanding learning experience for your class.\r\n\r\nOne of your most important tools as a teacher will be your voice. You will learn how to use it effectively when addressing large groups of children and how to look after it.  The course leads to Qualified Teacher Status and qualifies you to teach in the primary (3-11) sector.\r\n\r\nFor the vast majority of your course, you will be based in your provider school or schools, learning on the job while being supported by experienced teachers and mentors. You will attend our Headingley Campus one day a week (usually a Friday) for key module seminars.","interviewProcess":"We are keen to identify candidates with clear potential to become excellent teachers of the future.\r\nMills Hill Primary School - Schools with Schools Teaching School Alliance operates a simple interview process. Candidates who meet our entry requirements will be invited to Mills Hill for a morning of activities.\r\nAs part of the selection process, candidates will:\r\n•\tdeliver a short teaching session to around 15 children. This will last around 20 minutes and will be based around a book or story. It will be observed by a member of school staff.\r\n•\tComplete a short maths test with a few number problems.\r\n•\tDo a spelling test containing key words that year 6 children are expected to know.\r\n•\tWrite a brief passage on a given topic.\r\n•\tExperience an interview with a couple of members of staff.\r\nCandidates are also asked to bring with them a small item/artefact to demonstrate why they want to become a teacher.\r\nDecisions are based on the whole process and difficulties with one of the activities will not automatically result in an unacceptable outcome.\r\n","howSchoolPlacementsWork":"You will complete placements in two of our partner schools, which are all within 15 minutes drive of each other. Each school has an experienced mentor and your development will be overseen by the assistant head of Mills Hill. \r\nOur main partner schools are:\r\n•\tYew Tree\r\n•\tMather Street\r\n•\tBurnley Brow\r\n•\tSt Hilda’s\r\nThere are 3 placements in total in two contrasting schools. The main placement school experience is in the Autumn term and later in the year in the Summer term while the second placement school experience occurs in a contrasting school in the Spring term.\r\nAdditionally, we provide additional experience in Kingfisher Special School and a nearby secondary school. \r\nThe percentage of time spent teaching gradually increases throughout the year. Initially, this may take the form of small group teaching moving to ultimately being responsible for a class of learners.\r\nExact timings vary from year to year but on average, you will spend Thursday and Fridays until October half term at Leeds Beckett, Fridays until Christmas in Leeds and pretty much the rest of the time in one of your allocated schools. Previous cohorts have made arrangements to car-share or travel together for the sessions based in Leeds.\r\nThis time spent in schools fully prepares you for the start of your career in September ’20. You will be immersed in the daily life of a school and expected to participate in routine school events such as staff meetings and inset sessions.\r\n\r\n","personalQualities":" We firmly believe in delivering the best possible outcomes for our children and we are privileged to work with the next generation of teachers in order to shape both the learning and teaching of the future.  \r\n\r\nYou will have a commitment to our children and  have had some experience of working with children in schools or similar settings. A positive attitude to lifelong learning and the academic ability to sustain their study are both essential. Teaching requires commitment, hard work and dedication but, as a reward for these efforts, brings great personal satisfaction in a job well done.","otherRequirements":"We usually require evidence of experience working with children of different ages within the 5-11 age-range. Preferably this would be across KS1 and KS2 in a UK Primary School / setting and would equate to about 10-15 days in total. In addition, we value experience of working with children in contexts other than school and will take these into consideration.\r\nWe recognise and will take into account the difficulties of the last 18 months in arranging this.\r\n\r\n \r\n","status":1,"createdAt":"2021-07-06T10:51:46.444Z","updatedAt":"2021-09-16T14:40:35.164Z","canSponsorStudentVisa":"yes","cycle":"2024"}
