{"id":"fd3afb7f-8779-49b9-bf02-b15076a68dfb","name":"Physics","code":"2LMV","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"bf97cd0a-224c-43d3-a021-84143df13e8d","code":"F3","name":"Physics"}],"locations":[{"id":"dfa63c29-b812-42d0-b6ee-c33fbdd38ba2","name":"Reigate School Training Hub","isPublished":"Y","status":"R","vacancies":"F"},{"id":"a5fe5c12-5107-42cb-9347-3f5f85315fe7","name":"Weydon School Training Hub","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"97b7d049-ddeb-466a-af09-3277b759f3a5","code":"24X","name":"i2i Teaching Partnership"},"profPost":"BO","degreeGrade":"9","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"We ideally look for candidates with a degree subject that matches, or is closely related to Physics. We will, however, consider applications from candidates without a related degree if they can demonstrate sufficient subject knowledge and expertise, either through work or through A' Level subjects or further studies.","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"As an i2i Trainee you will spend the majority of your time in your main placement school where you will be part of the school community from the very start. You will be assigned a Subject Mentor and a Professional Mentor to support and guide you. You will be introduced to the practice of teaching in a structured way, building up your teaching experience and timetable at a pace that matches your readiness. \r\n\r\nIn addition to your main placement you will have a six week second placement, a one day primary placement, a one day KS5 placement and 2 days of enrichment placements in an SEN and PRU setting. These will give you the opportunity to extend your practice and understand a wide variety of educational settings.\r\n\r\nCentre-based training consists of weekly Professional Studies days and Subject Study days.\r\n\r\nProfessional Studies training takes place every Monday at either of our two training Hubs in Farnham or Reigate. These sessions will immerse you in a rich and stimulating professional learning environment; you will receive practical strategies and ideas to develop your practice within the classroom, and reflect upon your school experience. The programme is front-loaded in the first half term - Professional Studies training takes place on Friday as well as Monday. There are no sessions during the latter part of the summer term in order to give you experience of ‘block’ teaching time when your timetable is at its fullest.\r\n\r\nSubject Studies training days are led by subject experts chosen for their renowned reputation as skilled trainers and outstanding practitioners. There are six sessions, where you work alongside your fellow Science Trainees, preparing you to teach Science to a high level. Your Subject Tutor will work with you to develop your subject specific pedagogical knowledge, develop your practical investigation skills within a classroom setting and to create teaching resources to enhance classroom learning. \r\n\r\nThe  i2i programme will support you to achieve both Qualified Teacher Status (QTS) and PGCE. The PGCE element is accredited by Bath Spa University and delivered via regular centre-based training sessions.\r\n\r\n[For further information please click here to visit the i2i website] (http://www.i2ipartnership.co.uk/112/the-programme)\r\n","interviewProcess":"Once we receive your application, successful applicants will be invited to attend an interview. The interview will be held at the SCITT training base at Weydon and is of half a day's duration. \r\n\r\nThe interview will consist of: \r\n\r\n* A literacy test\r\n* A lesson observation\r\n* A 20 minute practical activity with a small group of children \r\n* A panel interview with the SCITT Director and other SCITT member \r\n* Coffee and chat with a current Trainee\r\n\r\nYou will be asked to complete a subject knowledge competency assessment ahead of your interview.\r\n\r\nYou will be sent interview details in advance so you have plenty of time for preparation. We aim to make your interview as welcoming, enjoyable and informative as possible, enabling you to perform at your best and to gain the knowledge you need to accept a place if offered. Decisions about the offer are made very soon after the interview and the outcomes communicated through both the SCITT and DfE Apply. \r\n\r\n[Click here to visit the i2i website for more information](http://www.i2ipartnership.co.uk/93/teacher-training-faq#interview)\r\n","howSchoolPlacementsWork":"The i2i partnership consists of [26 highly successful secondary schools](http://www.i2ipartnership.co.uk/27/i2i-partnership-schools) around Surrey, Hampshire, Berkshire and Middlesex, all committed to providing outstanding teacher training and all experienced in delivering and leading initial teacher training.\r\n\r\nPlacing trainees is a complex process and we take many factors into consideration when doing so. These factors include:\r\n\r\n* Establishing which schools in the partnership have the capacity to host a trainee in a particular subject (please note this may not be the most local school to you)\r\n* Selecting a Mentor who will be the best fit for the trainee\r\n* Establishing at interview where the candidate will be living for the course, if the candidate drives and if they have access to a car or if they will be dependent on public transport.\r\n\r\nWe do not expect trainees to travel for longer than an hour each way to their placement school. Trainee journeys to their placement schools are typically between 20 - 40 minutes and we always do our best to accommodate trainees’ personal circumstances when placing them.\r\n\r\nTrainees will spend the first term in their main placement school. After Christmas, trainees will be given a six-week contrasting second placement until the February half term, after which they will return to their main placement school.\r\n\r\nAll of our Initial Teacher Training courses teach the age range 11-16 so every trainee will get an exposure to teaching Key Stages 3 and 4.  \r\n\r\nTrainees will also do one day KS2 and KS5 placements at a primary school, a Sixth Form, and one day enrichment placements in an SEN (Special Educational Needs) and PRU (Pupil Referral Unit) setting.\r\n\r\nAll our schools are committed to safeguarding and promoting the welfare of children and young children and safer recruitment procedures are followed by the i2i SCITT Partnership. We expect all staff and trainees to share responsibility for this.\r\n\r\n","personalQualities":"If you are enthusiastic and determined, and aspire to become an excellent teacher then we would love to hear from you. We look for the following personal qualities:\r\n\r\n* A friendly and approachable nature\r\n* Excellent interpersonal skills\r\n* Organisation and time management skills\r\n* A passion for your subject\r\n* An innate ability to communicate and relate to young people\r\n*A positive outlook and resilient nature\r\n* A creative and innovative approach\r\n* The ability to reflect on and improve practice\r\n* Potential leadership capabilities\r\n* A passion and drive for delivering first class education.\r\n","otherRequirements":"The i2i SCITT is committed to safeguarding and promoting the welfare of children and young people. We expect all our staff and trainees to share this commitment.\r\n\r\nSelf-disclosure will be required as part of the  recruitment process and all successful applicants will be required to undertake an Enhanced-level DBS check. If you have lived overseas for more than 3 months in the past 10 years, you will need to provide an overseas police check. \r\n\r\nAll Trainees will be required to complete a Fitness to Teach health questionnaire to ensure they are well enough for the rigours of the teaching profession. ","status":1,"createdAt":"2021-07-06T10:50:23.786Z","updatedAt":"2021-10-04T10:36:12.453Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
