{"id":"dae1f3e9-e08c-47d5-a397-4357321fb8a3","name":"Art and Design","code":"2ZC4","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"B","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"d461a678-3335-4ca2-9616-1dc479d31a49","code":"W1","name":"Art and design"}],"locations":[{"id":"ed509299-445a-4a0e-9a76-e5fac4ca17b6","name":"Goldington Academy","isPublished":"Y","status":"R","vacancies":"B"}],"trainingProvider":{"id":"f7b9f762-b988-4a87-8364-313534a9c54e","code":"2DM","name":"Goldington Academy"},"accreditedBody":{"id":"af388cc3-644a-4fd3-bd71-55503b74fc21","code":"B22","name":"University of Bedfordshire"},"profPost":"BO","degreeGrade":"1","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Our initial teacher training programme (accredited and delivered in partnership with University of Bedfordshire) is for high quality graduates wishing to train in the secondary phase. \r\n\r\nThis course will provide you with opportunities to teach key stages three and four. It includes the experience of teaching GCSE Art in our new Arts building which consists of  2 specialist classrooms, an exhibition space, kiln and preparation room. The department is well supported by an Art technician.\r\n\r\nYou will be attached to a tutor group and have the opportunity to develop pastoral skills.\r\nYou will have the opportunity to participate in the wide extra-curricular life of the school.\r\nThe school has a varied CPD programme which will be accessible to you.\r\nYou will have a mentor who you will meet with weekly to aid your development.\r\n\r\n\r\n","interviewProcess":"You will be invited to visit Goldington Academy where you will meet with the ITT coordinator. During this visit you will tour the school and meet with members of your department and your potential mentor. You will observe a variety of lessons and have the opportunity to work with a small group of students. \r\nYou will then attend an interview at the University of Bedfordshire where you will participate in group and written tasks, alongside a formal interview.\r\n","howSchoolPlacementsWork":"The full-time course is for one full academic year and involves two placements in two different schools covering the full secondary age range. You will spend the first and third term at Goldington Academy.\r\nYou will have an additional placement during the Spring term, in an alternative school, which will be local to your home (wherever possible).\r\n\r\nFour days will be spent in school, with one day (Friday) spent at the University of Bedfordshire with subject specific tutors.\r\n\r\n \r\nThe part-time course is for two full academic years and involves two placements in two different schools covering the full secondary age range. Each placement will last one year.\r\n\r\nTwo days (for two years) will be spent in school, with one day (Friday) spent at the University of Bedfordshire with subject specific tutors.\r\n\r\n","personalQualities":"","otherRequirements":"","status":1,"createdAt":"2021-07-12T13:48:11.981Z","updatedAt":"2021-09-07T13:13:20.694Z","canSponsorStudentVisa":"yes","cycle":"2024"}
