{"id":"60f35053-15bb-4a2b-b9c7-6cfc7b6ee570","name":"Primary","code":"G788","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"5a7c7a38-5d78-4170-a08a-8c02c72de7a9","name":"City College Norwich","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"31a50c17-1b5d-492f-8047-8524ea607889","code":"8H6","name":"Wensum Junior Partnership"},"accreditedBody":{"id":"1f91f989-047b-4bbc-a73e-d45ffcfc1f28","code":"N43","name":"Norfolk Teacher Training Centre"},"degreeGrade":"9","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We will advise you further on this at the interview stage.","courseLength":"OneYear","feesUK":9000,"feesInternational":9000,"aboutCourse":"On this course you will learn how to develop your subject knowledge in the context of the primary curriculum, within your chosen age phase. \r\n\r\nWe will support you as you explore ways of translating your subject knowledge in to effective and engaging learning activities. Throughout your training year you will encounter and explore different methods for using your knowledge and enthusiasm to grow into a teacher whose work inspires young minds.\r\n\r\nWe will involve you in developing your own understanding of the structure of the primary curriculum, and you will learn how to use this as the basis from which to build consistently strong lessons. You will learn the craft of lesson planning, creating learning-centred activities alongside a clear vision for how young minds learn. We have designed a high-quality Curriculum that will ensure you have access to the content of the Core Content Curriculum and will have the evidence to judge you against the Teachers’ Standards to award QTS. You will be supported in learning how to assess pupil progress and how to use the results of your assessments to refine your lessons. All our programmes help trainee teachers to channel their enthusiasm for their age phase specialism into lessons which are grounded in key principles of the curriculum and a commitment to see pupils achieve. You will explore how data is used in education to monitor and plan for progress.\r\n\r\nImportantly, you will also come to share our vision of how primary teaching contributes to the lives of development of young learners and prepares them for their schooling ahead.  As with all our programmes, you will learn a range of strategies for promoting and securing excellent behaviours for learning which have achievement and self-confidence at their core.\r\n\r\nYour school-based experience will be underpinned by a professional development programme. You will grow your understanding of the teaching profession and the key issues which shape educational provision for young people. The programme provides you with constant opportunities to reflect on your professional practice and to acquire a depth of professional understanding of teaching, learning and assessment.\r\n\r\nThroughout the programme, you will be supported by your mentor who will be a primary specialist who understands your needs and with whom you can work in partnership to ensure you have a fantastic and fulfilling year.\r\n","interviewProcess":"What are we looking for?\r\n\r\nWe are looking for people who can show that they are resilient and committed to both working with young people and joining the teaching profession.\r\n\r\nIf your previous professional experience is directly related to working with young learners, we want to hear from you.\r\n\r\nHow we select our trainees:\r\n\r\nNormally, Interviews will be held at a local school and will involve candidates in a full day of activities designed to test suitability to teach. Candidates will be asked to take part in an interview task, group exercises and have a one to one interview. You will receive a brief from us so you know what to prepare for your interview. With Covid19 restrictions we may need to interview you online. We will ask you to prepare a 10-minute activity to present to us and then ask you formal questions to help us decide if you are suitable for Teacher Training. We strongly believe that interviews should be a two-way process, so we aim to give you as much information on NTTC as possible and answer the questions we know you will have.","howSchoolPlacementsWork":"Individuals will not automatically be placed within Wensum Junior. Placements are co-ordinated through the NTTC and are based on where we know we can offer excellent mentoring and great opportunities to develop knowledge of the primary curriculum.\r\n\r\nAll trainees follow a programme of 4 days per week in school and 1 day at college. You will be placed at a minimum of two schools during the year which will offer you contrasting experiences of education in our region.\r\n\r\nAll trainees will gain experience teaching Key Stage 1. We discuss with you at interview if you would like a placement experience teaching in EYFS or Key Stage 2. \r\n\r\nTrainees are expected to travel for their placement, especially considering the geography of Norfolk and the locations of our Partner Schools. We offer fantastic training opportunities in both rural and urban schools. If you have any limitations on travel, please declare this to us at interview so that we can take these into consideration whilst planning your placements. ","personalQualities":"Most importantly, you will be able to demonstrate why you want to work with young children and prove your commitment to the primary sector.","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:46:37.470Z","updatedAt":"2021-08-24T14:32:39.767Z","canSponsorStudentVisa":"no","cycle":"2024"}
