{"id":"31cc26a0-2898-4445-a7d9-39ccb624501b","name":"Primary","code":"2S3L","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"dcc35b1e-696a-4676-9f69-67e9b5791b9c","name":"Main Site - Ashton","isPublished":"Y","status":"R","vacancies":"F"},{"id":"6ee01054-e105-498e-b27e-66b3a4d7bec8","name":"Higher Openshaw Community Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"84dbe7ae-94f1-4b69-9c90-d8e28a5233f7","name":"Lyndhurst Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"cccc5573-559e-4240-ad40-8f525e9591ea","name":"St Joseph's Catholic Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"1d331df0-19ab-4148-a409-bd33c723fea5","name":"Greswell Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"37543786-4f1a-4f20-ab52-7a549ed5da6a","name":"Padfield Community Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"0aab402c-7385-4da2-876d-7897bedd4210","name":"Poplar Street Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"05d24fd7-fa74-4b72-9f14-2850064de16b","name":"Bradley Green Primary Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"b4a1560a-21ee-45ac-8645-6c6a148f95fb","name":"Gorse Hall Primary","isPublished":"Y","status":"R","vacancies":"F"},{"id":"93f73b43-d42e-4d54-988f-7f37a6261be1","name":"St Luke's CoE Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"ca6c079a-1e69-436d-b08f-0970c0c671ba","name":"Millbrook Primary and Nursery School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"f77dcbe7-9944-4965-b5e1-14548b5ea8c0","code":"29O","name":"Ashton Teacher Training Partnership"},"accreditedBody":{"id":"8796f284-20bb-4ad7-a6e6-cd40fc05fb2d","code":"25F","name":"Associated Merseyside Partnership SCITT"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"Suitable providers and their fees will be discussed at interview.","courseLength":"OneYear","feesUK":9250,"feeDetails":"There is also an administration charge of £60 for a DBS certificate.","aboutCourse":"The Ashton Teaching Partnership School Direct model is a school based, 100% teacher led training route; we work in partnership with the [Associated Merseyside Partnership SCITT] (https://www.amp-scitt.lydiatelearningtrust.co.uk/)\r\nMany trainees have gone on to work within our partner schools, although there is no absolute guarantee of employment.\r\n\r\nKey aspects of the training\r\n\r\n* Day one in school- you start on the first day of term as a member of staff, welcomed by your fellow teaching professionals. \r\n* Develop the skills, enthusiasm and confidence, you need to be a successful teacher of pupils of all abilities through two separate and contrasting placements\r\n* Build your knowledge of primary education curriculum delivery for years 1-6 through working with practising teachers and the latest educational research.\r\n* Learn about the wider role of teachers in school and child development.\r\n* Develop as a reflective practitioner and be fully prepared for your first teaching post and the Early Career Framework.\r\n\r\nThis is an intense school led programme. Support is an important part of the training and you will receive personalised coaching that will enable you to set targets and achieve to your highest potential. You will receive support from;\r\n\r\n* Home Coach\r\n* School Head teacher\r\n* School Direct Leadership team and AMPSCITT Leadership\r\n* Our team of Subject Expert Practitioners for Phonics, Literacy, Numeracy, Science and the foundation subjects.\r\n\r\nThe course is 37 working weeks in length. You will spend 4 days a week on school placement and 1 day a week participating in our Centre Based ITT programme delivered from our School Direct base at Ashton Sixth Form College.\r\nThis means you will spend up to 150 days of the course actually training in school. One of the major strengths is that most of the training is delivered throughout the course by practising teachers within our schools who are able to model current best practice.\r\nDuring the course you will also complete a PGCE with Liverpool Hope University (60 Masters level credit), assessed by two written assignments. As a trainee teacher with Ashton Teaching Partnership, you will have full access to the Liverpool Hope University on-line library and student services to support your academic writing.\r\nAssessment for the QTS award is through an e-portfolio of evidence of your teaching practise and lesson observations.\r\nThere are 5 review points across the training year to support your continued development.\r\n\r\nVisit our website here (https://www.asfc.ac.uk/university-courses/primary-pgce-school-direct)\r\n","interviewProcess":"The initial stage of selection is reviewing your APPLY application. We ensure your qualifications meet our entry requirements and your personal statement indicates you have a passion for education and working with children. If you are successful, you will be invited to an online interview or an interview at one of our partner primary schools. This is usually within 1-2 weeks of receiving your application.\r\nThe interview process may include the following:\r\n\r\n* A panel interview probing your knowledge of Primary Education\r\n* Opportunity to ask questions/obtain further information\r\n* Assessment of Fundamental English and Mathematics\r\n* A prepared presentation\r\n* A discussion of your prepared lesson plan \r\n\r\nAt Ashton Teaching Partnership we are looking for candidates who have a solid foundation of Mathematics and English, but it is just as important that teachers have personal attributes that will help them to relate to young children and enable them to communicate effectively.  Appropriate ICT and interpersonal skills with an awareness of teaching and educational issues within primary schools is expected for a successful candidate. \r\n\r\n","howSchoolPlacementsWork":"Placements are carefully chosen for each Trainee by our team. We always try to consider the location of the school, your personal circumstances and current experience level. \r\nWe have placements available  in Primary schools throughout Tameside, Manchester, Greater Manchester and Derbyshire. \r\nAll trainee teachers are required to complete two contrasting school placements: with Ashton Teaching Partnership the main placement is known as the Home School.  In Term 2 you will experience a contrasting placement in your Away school for 10-12 weeks, returning to the Home school for the whole of term 3.  \r\nWe have a personalised approach to placement selection. We utilise information from interview to select the most appropriate home school to allow you to develop quickly and then your away school placement is informed by your e-portfolio.  Further details of our partner schools will be discussed at interview. There will be some scope for trainees to have additional enrichment placements including Special Needs and alternative settings depending upon your career aspirations and interests.\r\nIf you are currently employed in the education sector and wish to arrange your own placement at the school you are working in, we are happy to discuss this with the school and can provide them with the training and support they need.  \r\n\r\n","personalQualities":"Teachers inspire, that’s just one of the qualities Ashton Teacher Training Partnership looks for in our trainee teachers. You need to have the ability to empower students to think critically, be innovative, creative, adaptable, passionate, and flexible. Your interpersonal skills need to encourage and motivate students and you should able to solve problems, self-direct, self-reflect, and lead.","otherRequirements":"* You will be required to successfully complete a Disclosure and Barring Service (DBS) application    \r\n                                                                                                                                                           \r\n* Complete a health check to confirm that you are fit to teach                                                                                                                                                   \r\n                                                                                                                                                           \r\n* Demonstrate your ability and capacity to write at an appropriate level for your programme\r\n\r\n* You are also required to demonstrate competency in Fundamental English and Mathematics which will be assessed at interview.\r\n\r\n* Although not essential, applicants can benefit from relevant school experience. \r\n","status":1,"createdAt":"2021-07-12T13:49:13.597Z","updatedAt":"2021-09-20T11:02:19.260Z","canSponsorStudentVisa":"no","cycle":"2024"}
