{"id":"69ee1afe-275f-4a43-8d1d-33714dd7bb3e","name":"Primary","code":"36DS","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"89e88044-441e-4357-bcbd-647c665839ea","name":"St Benedict's RC Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"61d1e79a-0280-4972-8855-433c9f8bc955","name":"St Mary's RC Primary School, Malton - Main Site","isPublished":"Y","status":"R","vacancies":"F"},{"id":"2ac654bc-dac5-4984-986f-691405a71e8d","name":"St Wilfrid's RC Primary School, York","isPublished":"Y","status":"R","vacancies":"F"},{"id":"76e04d4e-4e7d-4f99-bc10-bb840df5b17d","name":"Pickering Community Junior School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"2c3fae86-c733-449a-a16e-fb0458ed29e3","name":"St Mary's RC Primary School, Market Weighton","isPublished":"Y","status":"R","vacancies":"F"},{"id":"aab8ff6f-df39-4911-b82d-b203e601c309","name":"St Peter's RC Primary School, Scarborough","isPublished":"Y","status":"R","vacancies":"F"},{"id":"cbff9457-a438-4f2b-8b9c-0d22ea0169f2","name":"St George's Catholic Primary Academy, Scarborough","isPublished":"Y","status":"R","vacancies":"F"},{"id":"fef77583-e3f8-4fce-9659-2a1528c15a27","name":"Thornton Dale Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"19b9309f-5734-4cb2-a2fc-1e19cab2cb91","name":"Sand Hutton Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"dc0e89e6-ce46-49da-aafd-675fbac601e5","name":"Hunmanby Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"8379ab32-5f65-4841-9901-b1b8087ac9fe","name":"The Danesgate Community","isPublished":"Y","status":"R","vacancies":"F"},{"id":"b066d6e7-d600-4d47-8071-487ca342d9ed","name":"St Paul's Nursery School","isPublished":"N","status":"S","vacancies":"F"},{"id":"4d3a86c0-3b19-4ed9-b61f-5dd6cf6c36f5","name":"Bishopthorpe Infants School","isPublished":"N","status":"S","vacancies":"F"},{"id":"d322ae69-311d-436a-bed5-c4ed97b7c5e1","name":"Huntington Primary Academy","isPublished":"N","status":"S","vacancies":"F"},{"id":"8b9746ff-1797-4535-89d0-a4585a2ec389","name":"St Mary's RC Primary School, Richmond","isPublished":"Y","status":"R","vacancies":"F"},{"id":"331640e9-d63c-40ee-8a49-dc88c3f2cbeb","name":"Our Lady & St Peter R C Primary School, Bridlington","isPublished":"Y","status":"R","vacancies":"F"},{"id":"70c8c723-1002-4793-9518-0c58c3d5eee3","name":"Kirkbymoorside Primary CP School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"8845ac4e-086b-4061-a021-2b007126c36c","name":"St John of Beverley R C Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"ec12da13-aae4-41a7-bb35-2da27406f8a7","name":"Sacred Heart RC Primary School, Northallerton","isPublished":"Y","status":"R","vacancies":"F"},{"id":"0975e6f9-7128-46bc-9684-281e995df8ec","name":"St George's RC Primary School, York","isPublished":"Y","status":"R","vacancies":"F"},{"id":"8c29c07a-74c6-487d-a158-f6a88e058b49","name":"Wykeham CofE Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"f0a0e4ad-1e1e-4545-b106-385586471e0a","name":"Forest of Galtres Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"dd82c0b9-12b1-42a4-a582-02d999c32441","name":"Our Lady, Queen of Martyrs Primary School, York","isPublished":"Y","status":"R","vacancies":"F"},{"id":"4364a270-42cb-4b73-afeb-3064ca8baa3c","name":"St Mary and St Joseph RC Primary School, Pocklington","isPublished":"Y","status":"R","vacancies":"F"},{"id":"bd13e624-aa5e-47ce-b50f-17606b186cc0","name":"St Joseph's RC Primary School, Pickering","isPublished":"Y","status":"R","vacancies":"F"},{"id":"e298efee-9d2f-48ff-9a33-fdb3b6b294b0","name":"Pickering Community Infants School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"a7b5d434-ef23-4c4e-94f1-0dde1bd9f405","name":"Warthill CofE VC Primary School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"910ed43d-7633-4513-8617-7cb494dc9a6d","code":"2GW","name":"Polaris"},"accreditedBody":{"id":"b011427a-6dff-4a77-9df3-c85a54be605a","code":"Y75","name":"York St John University"},"profPost":"PG","degreeGrade":"1","english":"2","maths":"2","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We accept equivalency tests from the following company  www.equicalencytesting.com\nA grade 4 or above is required.","courseLength":"OneYear","feesUK":9250,"feesInternational":12750,"aboutCourse":"For the majority of your teacher training with Polaris you will be based in school. We work in partnership with York St John University to deliver contemporary and highly relevant education and training - providing you with excellent opportunities to develop knowledge and understanding of primary education. \r\n\r\nIn addition to your ongoing classroom-based learning, you will attend 17 Polaris training days at St Mary's Malton. Here you will receive high quality professional training from Expert Colleagues and Tutors to support you in developing your knowledge and skills in the following core areas:\r\n\r\n*  teaching all subjects across the primary curriculum;\r\n*  principles of planning, teaching and assessment; \r\n*  pedagogy;\r\n*  behaviour and classroom management;\r\n*  meeting the needs of all children;\r\n*  safeguarding and professional expectations\r\n\r\nTo underpin and enhance your practical teaching experience in the classroom, you will also attend 17 days with York St John University across the year, where you will develop deep subject knowledge and pedagogy around primary education.\r\n\r\nYou will have plenty of opportunities to observe excellent teaching in the classroom, reflecting on and learning about good practice from teachers and mentors and getting to know the children in your class before you begin teaching a small amount of the timetable with lots of support. This gradually builds up over the course until you are teaching around 70-80% of the timetable for your final teaching practice. \r\n\r\nYou’ll be based within one school for the majority of your training where you will complete two teaching placements in different classes. You will also benefit from an 8-week contrasting placement in a different school. In school you will be welcomed as a valued member of staff, attending school staff meetings, participating in training days and other professional training opportunities throughout the year. Your training will focus on either the 3-7 or 7-11 age phase, although you will be trained and qualified to teach across both. \r\n\r\nAlthough ours is a very practical programme, we also work closely with YSJU to offer high quality academic preparation for teaching, designed to underpin your own understanding and practice as you progress through the course. You will need to pass two Masters Level academic modules leading to award of PGCE. \r\nYour teaching in the classroom will be assessed by teachers, mentors and tutors, all of whom support your progress as a primary practitioner. This is an ongoing and supportive process.\r\n","interviewProcess":"Our recruitment process is designed to enable us to assess the suitability of candidates for training and appoint trainees who have potential to be great teachers. Once you have submitted your application, York St John University will assess your suitability for the course using the following criteria:\r\n\r\nYour personal statement; References; Detailed breakdown of degree content; Details of other academic, professional or vocational qualifications\r\n\r\nSuccessful applicant details are then passed to Polaris and interviews take place shortly after. In addition to interview questions, you may be asked to teach a short activity to a group of children. There will also be an opportunity for you to find out more about our programme and ask any questions. \r\n\r\nIf you are successful at interview you will be offered a conditional place. Recruitment takes place regularly during the year, although we are a small programme and places are limited.  Once the number of offered places meets our maximum programme numbers, the programme will be closed.  We therefore recommend that you apply as soon as possible to avoid missing out on the programme of your choice.\r\n","howSchoolPlacementsWork":"The Polaris School Direct programme is a full time programme studied within one academic year (September to June). Our placements follow an ABA structure: we will place you in your 'home' school (A) from the very first day of the Autumn term. After Christmas you will have an 8 week placement in a different, contrasting school (B). Back in your home school you will be usually be placed in a different class to ensure get a good breadth of experience. \r\n\r\nAs the year is a very busy one and you do not want to spend too much time on the road, we aim to place you in a school within a 30-40 minute drive of where you live. We also try to match your interests with placements - for example you might prefer a school with a high number of EAL children, or a school with a special interest in sport.\r\n\r\nWe select placement schools very carefully - we only choose schools rated as Good or Outstanding and we place you in classes with established teachers who can model great practice and offer lots of support. In addition to our own Polaris schools, we work with lots of other local partner schools in order to offer quality and contrasting placement experiences. Our aim is for trainees to want to apply for jobs in our local schools at the end of the year programme.\r\n\r\nMany teachers and mentors in our schools also trained with us. We are incredibly proud of the fact that they are now supporting our new trainees on their journey into teaching.\r\n\r\n","personalQualities":"We welcome graduates from a diverse range of backgrounds; previous recent relevant experience of Early Years and Primary education is preferable but not essential. We are looking for high-calibre students who can demonstrate real passion and commitment to teaching; students who are resilient and resourceful, creative, hard working and who show a willingness to learn and reflect on their own development.","otherRequirements":"Disclosure and Barring Service (DBS)\r\nEntrants to the programme must undertake an enhanced DBS criminal records check.\r\n\r\nMedical Report\r\nAll entrants are expected to obtain a medical report in order to assess your fitness to teach. Information on how to obtain this will be forwarded to successful interviews.\r\n\r\n","status":1,"createdAt":"2021-07-06T10:54:01.378Z","updatedAt":"2021-10-05T20:53:24.546Z","canSponsorStudentVisa":"yes","cycle":"2024"}
