{"id":"11c29e82-eb68-4cd4-ba50-9d4c65436a4e","name":"Primary","code":"39NZ","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"TA","fundingType":"apprenticeship","studyMode":"F","ageRange":"3_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"ce87146b-1525-40f5-aed4-53dc78fa63f0","name":"Main Site","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"0ea19130-8c43-45a3-893d-0366dfef5236","code":"2BZ","name":"Elizabeth Garrett Anderson School"},"accreditedBody":{"id":"30bda414-7b00-426c-956b-18a187efe967","code":"L68","name":"London Metropolitan University"},"profPost":"BO","degreeGrade":"0","english":"2","maths":"2","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feeDetails":"Fees are paid by the employer.  Levy paying schools can reclaim the fees.  on levy paying schools can claim fees from other sources. \r\nTrainees do not pay fees.","aboutCourse":"This course is for applicants who are currently employed in a school as an unqualified teacher or teaching assistant, who will be employed as a teacher from September 2022.\r\n\r\nApplicants must have the support of their headteacher before they apply.\r\n\r\nApprentices will be working in schools teaching classes for 9/10 days across two weeks. One day per fortnight will be training at the London Metropolitan University.  Apprentices have a timetable of classes and will be responsible for teaching classes from day one in September.\r\n\r\nSuccessful applicants gain Qualified Teacher Status (QTS), Post Graduate Certificate in Education (PGCE) and their apprenticeship.\r\n\r\nThis course is aimed at Teaching Assistants (TAs) and Higher Level Teaching Assistants (HLTAs) who are working in schools and want to progress in their career. Applicants can not be considered if they are not already employed.","interviewProcess":"Applicants are interviewed and employed as an unqualified teacher by their current school. \r\n\r\nApplicants then apply via https://www.gov.uk/apply-for-teacher-training and will be interviewed at the London Metropolitan University. ","howSchoolPlacementsWork":"Apprentices work mainly in the school where they are employed. Apprentices are required to complete a second placement in another school. The second placement is a minimum of 6 weeks. \r\n\r\nWe will support in finding the second placements but cannot guarantee this. Applicants may have to find their own placement.\r\n\r\nApprentices will have a school based mentor and a work plan that is devised with their university tutor. \r\n\r\nThere will be tasks to complete in school to support their off the job training. ","personalQualities":"If you are working in a school, have the required qualifications and want to become a teacher then this may be the route for you. We are looking for candidates who are passionate about improving the life chances of young people, who want to be part of building the future and who see education as a process that goes beyond subject  leading, to developing the whole child.\r\nCandidates need to be resilient; able to work as part of a team and find creative solutions. Teaching is hard work but is very rewarding and you will never be bored.\r\n","otherRequirements":"All candidates will need to pass literacy and numeracy  tests set by London Metropolitan University and trainees are subject to enhanced DBS checks. \r\nCandidates will complete a self declaration on their suitability for teaching.","status":1,"createdAt":"2021-07-06T10:56:03.935Z","updatedAt":"2021-09-29T10:53:00.414Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024"}
