{"id":"88732997-3f57-4208-97cc-f3304504576d","name":"Biology","code":"39NT","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"322cfc19-d51d-45db-91e3-bd7b4738470f","code":"C1","name":"Biology"}],"locations":[{"id":"ce87146b-1525-40f5-aed4-53dc78fa63f0","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"0ea19130-8c43-45a3-893d-0366dfef5236","code":"2BZ","name":"Elizabeth Garrett Anderson School"},"accreditedBody":{"id":"30bda414-7b00-426c-956b-18a187efe967","code":"L68","name":"London Metropolitan University"},"profPost":"PG","degreeGrade":"0","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feeDetails":"Trainees pay fees directly to the university. \r\nBursaries are available for some trainees, please follow the below link for further information:\r\n\r\n[Gov.uk](https://www.gov.uk/education/initial-teacher-training-funding)","aboutCourse":"This is a Schools Direct tuition fee training programme. Candidates gain QTS (Qualified Teacher Status) and PGCE (Post Graduate Certificate in Education). Candidates study at London Metropolitan University and have training placements in two schools. \r\n\r\n\r\n","interviewProcess":"Applicants will be interviewed by London Metropolitan University. Currently interviews are remote. ","howSchoolPlacementsWork":"Trainees will spend time in their first placement school in early September to gain experience of how the school functions. They then spend two to three weeks at university before returning to their placement one school in October, where they will observe lessons, teach parts of lessons and gradually build up to teaching classes.\r\nPlacement two starts around February and trainees will be teaching more classes.\r\nDuring both placements trainees will have one afternoon of professional study sessions which run across the alliance, across subjects and, at times, primary and secondary trainees will work together. During both placements trainees will receive regular observations and feedback on how to improve.","personalQualities":"We are looking for candidates who are passionate about improving the life chances of young people, who want to be part of building the future and who see education as a process that goes beyond subject  leading, to developing the whole child.\r\nCandidates need to be resilient; able to work as part of a team and find creative solutions. Teaching is hard work but rewarding and you will never be bored.\r\nIt is an advantage if candidates have had experience working with young people. ","otherRequirements":"All candidates will need to pass literacy and numeracy tests  set by the university and trainees are subject to enhanced DBS checks. \r\nCandidates will complete a self declaration on their suitability for teaching.","status":1,"createdAt":"2021-07-06T10:56:03.739Z","updatedAt":"2021-09-29T10:26:52.402Z","canSponsorStudentVisa":"no","cycle":"2024"}
