{"id":"ed40ab14-740a-47eb-8d10-8df7e1bf51df","name":"English","code":"2YNS","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3aed1aa8-ae46-4b68-92bb-a6cc20655c59","code":"Q3","name":"English"}],"locations":[{"id":"ce87146b-1525-40f5-aed4-53dc78fa63f0","name":"Main Site","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"0ea19130-8c43-45a3-893d-0366dfef5236","code":"2BZ","name":"Elizabeth Garrett Anderson School"},"accreditedBody":{"id":"7f11aaed-7c3e-42c5-af7a-023d33b45fa3","code":"U80","name":"UCL, University College London"},"profPost":"PG","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feeDetails":"Trainees pay fees directly to the university. \r\nBursaries are available for some trainees, please follow the below link for further information:\r\n\r\n[Gov.uk](https://www.gov.uk/education/initial-teacher-training-funding)","aboutCourse":"This is a Schools Direct tuition fee training programme. \r\nTrainees gain QTS (Qualified Teacher Status) and PGCE (Postgraduate Certificate in Education). Candidates study at University College London Institute of Education one day per week and have training placements in two schools. Candidates also have weekly proessional studies sessions within the alliance. \r\n\r\n[Elizabeth Garrett Anderson School](http://www.egaschool.co.uk/244/the-angel-islington-teaching-school-alliance)\r\n","interviewProcess":"Applicants will be interviewed remotely at one of our partner schools. Successful applicants will then be recommended to University College London Institute of Education (UCL IOE) for a second interview.\r\n","howSchoolPlacementsWork":"Trainees will spend time in their first placement school in early September to gain experience of how the school functions. They will then spend two to three weeks at UCL IOE before returning to their placement one school in October, where they will observe lessons, teach parts of lessons and gradually build up to teaching classes. Trainees are observed regularly and get feedback on how to develop. Trainees will have a school based subject mentor.\r\nPlacement two starts around February and here trainees teach more classes. \r\nDuring both placements trainees will have one afternoon of professional study sessions which run across the alliance, for all subjects and, at times, will bring primary and secondary trainees together. ","personalQualities":"We are looking for candidates who are passionate about improving the life chances of young people, who want to be part of building the future and who see education as a process that goes beyond subject leading, to developing the whole child.\r\nCandidates need to be resilient; able to work as part of a team and find creative solutions. Teaching is hard work but rewarding and you will never be bored.\r\nIt is an advantage if candidates have had experience working with young people. ","otherRequirements":"All candidates will need to pass literacy and numeracy tests set by the university and trainees are subject to enhanced DBS checks. ","status":2,"createdAt":"2021-07-06T10:56:03.653Z","canSponsorStudentVisa":"yes","cycle":"2024"}
