{"id":"6ce757a5-3241-45b9-b8c5-12a35917cf39","name":"Primary","code":"R654","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"other","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"3_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"e28ed95a-493b-43a4-a5ff-f4e8c921761c","name":"Jupiter Primary School","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"387b24db-defc-4802-91b1-2db123f56b46","code":"3D3","name":"St Clement Danes School"},"accreditedBody":{"id":"feecdec5-259c-45e3-b1cf-4e391936ee90","code":"H36","name":"University of Hertfordshire"},"degreeGrade":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","aboutCourse":"The QTS Primary placement is structured to allow you to develop the skills required by primary teachers to teach the full range of National Curriculum subjects, with a strong emphasis on English and Mathematics, and to develop specific expertise for making a distinctive contribution to primary practice. The course also prepares you to meet the needs of individual learners by developing your awareness of child development, diversity, special educational needs and disabilities, behaviour and learners with English as an additional language.\r\n\r\nThe programme will prepare you to teach the entire primary phase (3-11).  Age ranges include: 3-7 (placements in EYFS and KS1) or 5-11 (placements in KS1 and KS2). It may be possible to undertake a 7-11 age-range of training (placements in upper and lower KS2).\r\n \r\nThe School Direct Salaried route leads to Qualified Teacher Status only and not to masters’ credits or a PGCE.\r\n\r\nAll students following the School Direct Salaried route must undertake a 5 consecutive week Second School Experience (SSE).\r\n","interviewProcess":"Interviews take place in our Danes Educational Trust: The Partnership training schools. Candidates will be asked to plan and teach a lesson to a primary school class. You may be asked to interact with a small group of children and respond to their questions. A formal panel interview will follow where potential trainees will have the chance to discuss their ideas and varied experiences with a Head of Department as well as a Lead ITT practitioner within the Trust.\r\n\r\nInterviews will be offered to individuals and will not be group-led.\r\n\r\nA standard written assignment will need to be completed to test candidates' competency in reading and writing in Standard English. \r\n\r\nCandidates will only need to complete one interview for any of our Danes Educational Trust: The Partnership schools.\r\n","howSchoolPlacementsWork":"Trainees will spend four days a week training in a Danes Educational Trust: The Partnership school. Training begins at the start of the calendar school year. One day per week will be assigned for university-led study (lectures, seminars and tutorials). \r\n\r\nA specialist mentor will be provided in school and protected time will be afforded. A Professional Mentor will quality assure the training provision and liaise directly with the university.\r\n\r\nOur schools offer the experience of teaching 3-11 years olds within Trust schools.\r\n","personalQualities":"We are looking for candidates with a genuine passion for their subject. Requisite skills to teach include skills in communication, listening, collaboration, adaptability, empathy and patience. Other characteristics of effective teaching include an engaging classroom presence, a recognition of the value of real-world learning, exchange of best practices and a lifelong love of learning.\r\n\r\nCandidates are allocated to one main school for their training year but will have the opportunity to train for one school half term (approximately 6 weeks) in a different school to broaden their experience. This process is managed in partnership with Trust schools and the university.\r\n","otherRequirements":"The university will carry out an advanced DBS check. School-based placements will commence in receipt of this being completed. \r\n\r\nMandatory Safeguarding training is required for all candidates seeking to work in schools as well as a compliance check for IT networks.\r\n","status":0,"createdAt":"2021-12-20T14:07:36.007Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","applicationsOpenDateOther":"2022-01-10T00:00:00.000Z","salaryDetails":"School employs candidate as a full-time member of staff on a minimum of point 1 of the Unqualified Teachers’ Pay Spine (£19,613).\r\n\r\nUniversity fees are covered by the Partner school. \r\n\r\nAll salaried students are registered as part-time students of the University of Hertfordshire.\r\n\r\n"}
