{"id":"e08bb202-5f8c-48d8-b4a9-e2f2b3d71e46","name":"Computing","code":"G038","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"e6be6a9c-8696-4b88-8fbd-1ba1bef1b6fc","code":"11","name":"Computing"}],"locations":[{"id":"5eb369c6-ba96-4d0d-9c71-1fff4db7c224","name":"Onslow St Audrey's School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"387b24db-defc-4802-91b1-2db123f56b46","code":"3D3","name":"St Clement Danes School"},"accreditedBody":{"id":"feecdec5-259c-45e3-b1cf-4e391936ee90","code":"H36","name":"University of Hertfordshire"},"degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"Candidates are required to have 2:2 or above.\n\nUsually we would expect the degree to have a minimum 50% content of the subject in which the applicant is applying.","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","aboutCourse":"Training is school-led and will run in partnership with a Masters level professional training programme. Trainees will be inducted in the requirements for teaching Computing within the 11-16 age range and our training programme leads to recommendation for Qualified Teacher Status. Where appropriate, opportunities to experience post-16 provision will be available across Danes Educational Trust: The Partnership. \r\n\r\nTrainee teachers will be apprenticed into the skills of a classroom practitioner and develop and enhance their own subject knowledge in line with relevant curriculum topics.\r\n\r\nSpecialist mentors will support with the development of curriculum knowledge as well as skills relating to pedagogy.\r\n\r\nUniversity-led sessions will run every week and will include lectures, seminars and workshops where active participation is encouraged. Collaboratively, trainees will benefit from the knowledge and expertise of a team of practising teachers who lead key sessions and support with school-based training as classroom expertise is developed.\r\n\r\nNo in-school assessments are set. Instead, trainees are assessed on their developing practice through observed lessons and structured feedback. The university will set two formal assignment modules across the year: \r\n\r\n1.\tSubject and Curriculum Knowledge\r\n2.\tSecondary Professional Learning and Development\r\n\r\nThis is a QTS qualification only, no PGCE. \r\n","interviewProcess":"Interviews take place in our Danes Educational Trust: The Partnership training schools. Candidates will be asked to plan and teach a lesson to a secondary school class. A formal panel interview will follow where potential trainees will have the chance to discuss their ideas and varied experiences with a Head of Department as well as a Lead ITT practitioner within the Trust.\r\n\r\nInterviews will be offered to individuals and will not be group-led.\r\n\r\nA standard written assignment will need to be completed to test candidates' competency in reading and writing in Standard English. \r\n\r\nCandidates will only need to complete one interview for any of our Danes Educational Trust: The Partnership schools.\r\n","howSchoolPlacementsWork":"Trainees will spend four days a week training in a Danes Educational Trust: The Partnership school. Training begins at the start of the calendar school year. One day per week will be assigned for university-led study (lectures, seminars and tutorials). \r\n\r\nA specialist mentor will be provided in school and protected time will be afforded. A Professional Mentor will quality assure the training provision and liaise directly with the university.\r\n\r\nOur schools offer the experience of teaching 11-16 years old with an additional option to gain experience of post- 16 within Trust schools.\r\n\r\nCandidates are allocated to one main school for their training year but will have the opportunity to train for one school half term (approximately 6 weeks) in a different school to broaden their experience. This process is managed in partnership with Trust schools and the university.\r\n","personalQualities":"We are looking for candidates with a genuine passion for their subject. Requisite skills to teach include skills in communication, listening, collaboration, adaptability, empathy and patience. Other characteristics of effective teaching include an engaging classroom presence, a recognition of the value of real-world learning, exchange of best practices and a lifelong love of learning.","otherRequirements":"The university will carry out an advanced DBS check. School-based placements will commence in receipt of this being completed. \r\n\r\nMandatory Safeguarding training is required for all candidates seeking to work in schools as well as a compliance check for IT networks.\r\n","status":1,"createdAt":"2021-10-12T17:15:48.324Z","updatedAt":"2021-10-13T11:17:19.397Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"Unqualified teacher salary. London (fringe) pay point 1.\r\n\r\nUniversity fees are covered by the Partner school.\r\n"}
