{"id":"4b1fccf6-ae35-4d14-b1cc-d80d54bbd969","name":"Dance","code":"W5X1","qualification":"pgce_with_qts","startDate":"2023-07-31T23:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_19","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"49dcc400-03df-4732-af93-1c56ae22897f","code":"12","name":"Dance"}],"locations":[{"id":"1cb762ae-f1a6-4710-b059-fec334543546","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"25fa6c5a-457b-4197-8fc8-dcd15c96fd45","code":"R55","name":"Royal Academy of Dance"},"profPost":"PG","degreeGrade":"0","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"Degree should be in Dance or a related subject with a substantial dance component","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We do not offer equivalency testing for candidates. If you believe you have a GCSE equivalent we would require you to evidence this through UKENIC.","courseLength":"OneYear","feesUK":7120,"feeDetails":"Other Fees:\r\n\r\n*   £120 registration fee on enrolment\r\n*  £60 audition fee is payable if you are invited to audition for this programme\r\n\r\nTypical Programme Costs\r\nRecurring Costs (for programme duration)\r\n\r\n * Dancewear & equipment as required £150-£350\r\n * Travel to and from Placement School between £50-£200 per week (cost varies on location of placement and trainee’s term time address)\r\n *  Accommodation whilst on placement up to £300 per week (depending on trainee’s term time address)\r\n\r\nCompulsory study visits and placement costs (for the programme duration)\r\n\r\n*  Study visits/trips £10-£100 (depending on trainee’s term time address)\r\n","aboutCourse":"If you want to teach dance in UK secondary education, then our full-time Postgraduate Certificate in Education: Dance Teaching programme is for you. It provides the opportunity to acquire the expertise to become a dance specialist teacher for the 11-19 curriculum, and UK government recognition as a teacher.\r\n\r\nThe programme comprises of a minimum of 12 weeks on site at the RAD in London and 24 weeks in professional placements within schools or colleges.\r\n\r\nModules located at RAD headquarters are delivered through taught sessions including practical sessions, lectures and seminars. Whilst on placement in schools and colleges our students work with School-based Tutors who are dance specialists able to provide support for planning, teaching and self-reflection.\r\n\r\nThere are three interrelated areas of study across the year:\r\n\r\n* Dance Studies\r\n* Professional Studies\r\n* School Experience and Teaching\r\n\r\n\r\nDance Studies\r\nDuring the programme you will extend your knowledge of dance as a subject in secondary education and study a selection of dance specifications, courses and curricula.\r\n\r\n\r\nProfessional Studies\r\nIn preparation for teaching, you will be introduced to education theories and pedagogies and study the professional standards and requirements for all teachers working in the UK state sector. In order to gain Qualified Teacher Status, you will be required to demonstrate achievement of all the Standards legislated by the UK government.\r\n\r\n\r\nSchool Experience and Teaching\r\nThe third strand of the programme takes place in our Partnership Schools and Colleges in the form of two different School Experience and Teaching placements.\r\n\r\nThree modules take place at RAD headquarters and focus on developing dance subject knowledge and pedagogical understanding. You will have the opportunity to work with the Faculty of Education’s highly-qualified teaching staff, study alongside other students and benefit from the RAD’s specialist dance facilities.\r\n\r\nThe other module takes place in our Partnership Schools and Colleges as two different School Experience and Teaching placements. You will take on different roles and responsibilities, undertaking carefully supervised teaching and becoming integrated into the life of the department and the school or college.\r\n\r\nYou will be required to complete written assignments, give presentations and be assessed in teaching. Throughout the programme, you will be continually assessed against the Standards for Qualified Teacher Status which must be met in order to qualify as a teacher.","interviewProcess":"After the initial application review by the Programme Manager you may be invited to send in a video submission which involes a short dance piece and an introduction. Specifics of what to include will be requested from you by the Admissions Officer.\r\n\r\nAfter a review of the video submission you might be invited to an onsite audition at the Royal Academy of Dance's main site in London. This normally includes:\r\n* An introduction presentation by the Programme Manager\r\n* A practical dance class led by an RAD tutor\r\n* Candidates leading a teaching extract\r\n* Participating in a group discussion\r\n* An interivew with an RAD tutor upon invitation\r\n\r\nFurther information about the audition day will be sent upon invitation.","howSchoolPlacementsWork":"Our Partnership Schools and Colleges are based in London and the home counties. These provide diverse cultural environments for school experience and teaching placements. The status of many Partnership Schools and Colleges is recognised through Arts Mark, Beacon Status, Specialist Status and Performing Arts Mark.","personalQualities":"","otherRequirements":"All Candidates must gain:\r\n\r\n* Criminal Records Check, assitance will be given by the Royal Academy of Dance\r\n\r\nIf your first language is not English and you are applying for a programme where an English Language Proficiency test is required, you must achieve one of the following qualifications:\r\n\r\n* International English Language Testing System (IELTS): band 7.0 overall, with a minimum of 6.5 in each of the subtests. The IELTS test must have been taken no earlier than two years before the date of the Confirmation of Acceptance for Studies is issued.","status":1,"createdAt":"2021-07-06T10:54:28.274Z","updatedAt":"2021-08-05T15:27:45.221Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
