{"id":"1ecca26e-d38a-49b4-8b7b-0042fd308b87","name":"Religious education with History","code":"R698","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"724b5d16-28dd-4431-bc17-ea4be4daedc4","code":"V6","name":"Religious education"},{"id":"5a3609a0-5bbb-4377-b919-5d89932ab622","code":"V1","name":"History"}],"locations":[{"id":"a62d32f3-9713-4e2b-9d1a-23b64e9c1533","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"3700fb02-7007-40c8-9127-b070e146d6cb","code":"W76","name":"University of Winchester"},"profPost":"PG","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"An honours degree, usually at 2:2 or above in religious studies, theology, philosophy, history, geography or a related field","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":14100,"feeDetails":"*Please note, students from the EU (excluding Republic of Ireland) are charged the international fee. Students from the Republic of Ireland are charged the same fee as UK students.\r\n\r\nApplicants to this course are expected to obtain Disclosure and Barring Service (DBS) clearance prior to beginning the course at the University. Our Admissions Team will be in contact with further information about when and how to obtain this clearance after an offer has been accepted. Please note, the cost of the check is covered by the applicant (currently £40).","aboutCourse":"Informed by research and responsive to developments in secondary education, the programme aims to produce creative and critically reflective teachers able to meet the needs of all pupils.  The course develops your knowledge and understanding of two humanities subjects (RE with History or Geography, History with RE or Geography, Geography with History or RE), developing the knowledge and skills you need to work within a humanities department.\r\n\r\nThe course prepares you to: \r\n* The course prepares you to teach across the age range 11-16 with opportunity to develop your understanding of post 16 teaching, \r\n* Develop your understanding of the locally agreed syllabi and the 11-16 curriculum for Religious Education and develop your knowledge and understanding of the 11-16 curriculum for history \r\n* Cover the essential areas of behaviour management, special education needs and English as an additional language\r\n* Gain experience of planning, teaching, assessing and evaluating your practical teaching\r\n* Be informed by current research and grounded in a practical understanding of key ideas in Religious and History education such as Holocaust education, cause and consequence, the teaching of emotive and controversial issues, and citizenship\r\n* Develop an understanding of inclusion and diversity \r\n* Complete academic assignments linking theory and practice \r\n\r\nOur Programmes, judged by OfSted as outstanding, provide our students with high quality training that enables them to demonstrate a strong breadth of subject knowledge, as well as the ability to reflect upon their teaching to identify areas of strength and development to ensure a focus on promoting pupil progress.  The main specialist RE routes works closely the Theology, Religion and Philosophy departments at the University, to provide subject knowledge enhancement sessions. There is an opportunity to achieve SAPERE Level 1 Philosophy for Children Foundation accreditation.  Our supplementary curriculum studies in history module draws on expertise within the University as well as across our partnership organisations to develop subject knowledge as well as an understanding of key conceptual and pedagogical principles. \r\n\r\nThe course prepares you to teach across the age range 11-16 or 11-18 and is structured around five modules - a combination of taught modules based at the University and placement modules based in schools or educational settings.\r\n\r\nUpon successful completion of the course you will be awarded a PGCE (the potential for up to 60 Master’s level credits) with recommendations for the award of Qualified Teacher Status (QTS). ","interviewProcess":"If you already meet or are expected to meet our entry requirements, and have demonstrated your passion and commitment to teaching in your application, you will be invited to attend an interview. The interview is your chance to demonstrate your potential to become a successful teacher. The interview day consists of a written task, individual presentation and interview.\r\n\r\nFurther information about the format of the day will be sent to you via email in advance of the interview date. The interview is also your chance to find out more about the University, the course and our campus, so if you are invited to interview please take the opportunity to explore our facilities. If you are located outside the UK we are able to consider Teams/Zoom or telephone interviews.","howSchoolPlacementsWork":"We place significant emphasis on enabling you to apply your learning to teaching in the classroom. During your teaching placements you will have the opportunity to work alongside some of the best and most inspiring teachers predominantly in Hampshire secondary schools. However, we also offer a number of placements in neighbouring counties, such as Dorset, Wiltshire, Berkshire and Surrey.\r\n\r\nOur Partnership Office will arrange your assessed teaching placements, ensuring that you have two contrasting experiences. Due to the large geographical area that we cover, we are able to offer placements in a variety of settings, including rural, inner-city and coastal schools. During your time in school, you will be allocated a Link Tutor from the University who will mentor and support you for the duration of your placement. The maximum travel time that we allow for teaching placements is one hour and thirty minutes in each direction. Please be aware that you will need to make your own travel arrangements at your own expense.","personalQualities":"We will look for evidence of a commitment to the teaching profession, an understanding of professional requirements, and an awareness of current educational issues in an application. Prior experience in a school is not required, however prospective students may find experience in a school useful for obtaining insights into the secondary education classroom. Experience in a school or similar setting may also provide reassurance to prospective students that teaching is the right choice for their career.","otherRequirements":"If you accept an offer of a place you will be required to complete a Disclosure and Barring Service (DBS) criminal records check and Prohibition Order check.\r\n\r\nIf you have spent time overseas in the last 5 years you may also be required to obtain criminal records checks from each of the countries you visited.\r\n\r\nYou will also be required to complete an occupational health check to confirm that you are fit to teach. The University of Winchester will send you more information about when and how you need to complete each of these checks if you accept our offer.","status":1,"createdAt":"2021-10-20T17:23:01.012Z","updatedAt":"2021-11-09T13:28:17.858Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
