{"id":"5cdee569-da46-47f1-83de-b41bbb268074","name":"Primary with Mathematics","code":"AS87","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"286cf12f-b3e3-41c5-9f33-2ff7807d2df0","code":"03","name":"Primary with mathematics"}],"locations":[{"id":"a62d32f3-9713-4e2b-9d1a-23b64e9c1533","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"3700fb02-7007-40c8-9127-b070e146d6cb","code":"W76","name":"University of Winchester"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":14100,"feeDetails":"*Please note, students from the EU (excluding Republic of Ireland) are charged the international fee. Students from the Republic of Ireland are charged the same fee as UK students.\r\n\r\nApplicants to this course are expected to obtain Disclosure and Barring Service (DBS) clearance prior to beginning the course at the University. Our Admissions Team will be in contact with further information about when and how to obtain this clearance after an offer has been accepted. Please note, the cost of the check is covered by the applicant (currently £40).","aboutCourse":"Teaching is a challenging and rewarding career that requires individuals to demonstrate initiative, creativity and resilience. We have devised a vibrant programme to ensure you become a successful and confident teacher in the 21st-century. Our passion is to provide you with a university experience that immerses you in the theory and practice of teaching. You will love studying at our beautiful campus where your lecturers will know you by name.\r\n\r\nOur PGCE programme design is informed by research and is responsive to developments in primary education. The programme aims to produce creative and critically reflective teachers able to meet the needs of all schools. The course prepares you to teach across the 5-11 age ranges and is structured around five modules - a combination of taught modules based at the University and placement modules based in schools or educational settings.\r\n\r\nYou will undertake studies in all elements of primary education; extend your knowledge of learning and teaching, of the breadth and scope of the curriculum and the professional skills associated with high-quality teaching. As a student on the mathematics special interest route in Semester 2 you will have the opportunity to extend and deepen your understanding of effective mathematics pedagogy.\r\n\r\nYou will examine a wide repertoire of teaching approaches and consider how these support children’s learning of mathematics. You will also develop your own practice through study, analysis and research, and where possible, will be supported in acquiring collaborative approaches to developing their practice. Your developing knowledge and skills are then applied to classroom practice during two assessed placements in schools or educational settings, totalling 120 days.\r\n\r\nUpon successful completion of the course you will be awarded a PGCE (the potential for up to 60 Master’s level credits) with recommendations for the award of Qualified Teacher Status (QTS).\r\n\r\nTo find out more, please visit the [University of Winchester](https://www.winchester.ac.uk/study/postgraduate/courses/pgce-primary-with-mathematics/).","interviewProcess":"If you already meet or are expected to meet our entry requirements, and have demonstrated your passion and commitment to teaching in your application, you will be invited to attend an interview. The interview is your chance to demonstrate your potential to become a successful teacher. The interview day consists of an interview and a number of tasks aimed at allowing you to show your potential.\r\n\r\nFurther information about the format of the day will be sent to you via email in advance of the interview date. The interview is also your chance to find out more about the University, the course and our campus, so if you are invited to interview please take the opportunity to explore our facilities. If you are located outside the UK we are able to consider Teams/Zoom or telephone interviews.","howSchoolPlacementsWork":"Teaching placements are predominantly in Hampshire primary schools, however we also offer a number of placements in neighbouring counties, such as Dorset, Wiltshire, Berkshire and Surrey. As a student on the mathematics special interest route you will be expected to experience teaching mathematics across the primary age phase.\r\n\r\nOur Partnership Office will arrange your assessed teaching placements, ensuring that you have two contrasting experiences.  Due to the large geographical area that we cover, we are able to offer placements in a variety of settings, including rural, inner-city and coastal schools.  During your time in school, you will be allocated a Link Tutor from the University who will mentor and support you for the duration of your placement.  The maximum travel time that we allow for teaching placements is one hour and thirty minutes in each direction.  Please be aware that you will need to make your own travel arrangements at your own expense.","personalQualities":"We will look for evidence of a commitment to the teaching profession, an understanding of professional requirements, and an awareness of current educational issues in an application, particularly those relating to primary mathematics education. Prior experience in a school is not required, however prospective students may find experience in a school useful for obtaining insights into the primary education classroom. Experience in a school or similar setting may also provide reassurance to prospective students that teaching is the right choice for their career.","otherRequirements":"If you accept an offer of a place you will be required to complete a Disclosure and Barring Service (DBS) criminal records check and Prohibition Order check. If you have spent time overseas in the last 5 years you may also be required to obtain criminal records checks from each of the countries you visited. You will also be required to complete an occupational health check to confirm that you are fit to teach. The University of Winchester will send you more information about when and how you need to complete each of these checks if you accept our offer.","status":1,"createdAt":"2021-07-06T10:50:13.712Z","updatedAt":"2021-10-04T17:30:02.918Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
