{"id":"9a7a0535-1a68-496f-85df-22dd9bcebfd9","name":"Geography","code":"2HQP","qualification":"qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3f47e67b-7fa5-4947-a5a0-74d528cd2a87","code":"F8","name":"Geography"}],"locations":[{"id":"a0d82907-9c6b-4d3b-93d9-9b9899c52372","name":"Weald of Kent Grammar School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"b83d3623-8687-41cb-bad4-15584d25827c","name":"Tonbridge Grammar School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"3f87a0e8-313c-4368-ba3f-21450e4c10c1","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"},{"id":"dabc2414-32b5-4c65-b8c8-5da035b667d2","name":"Hugh Christie Technology College","isPublished":"Y","status":"R","vacancies":"F"},{"id":"a7d210e2-a486-4aa6-9dd8-e8186defa14c","name":"Hadlow Rural Community School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"27771bee-a309-42dd-b85f-598b3185abdb","code":"1GR","name":"Mascalls Training Partnership"},"accreditedBody":{"id":"757d0dca-c7a9-43c8-8c3b-96c0a81539b6","code":"K30","name":"Kent and Medway Training"},"degreeGrade":"9","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We accept Level 2 in English and Maths only.\n\nLevel 2 in Literacy and Numeracy are not accepted.","courseLength":"OneYear","feesUK":7100,"feesInternational":7100,"feeDetails":"The fee of £7100 is the cost for all trainees leading to Qualified Teacher Status (QTS) only. This fee is payable by all non-salaried trainees but payable by the home school for salaried trainees.\r\n\r\nFor those wishing to 'top up' their qualification to the full Professional Graduate Certificate in Education (PGCE) a further £1950 (subject to change)  will be payable to the University of Leeds Beckett who are our PGCE accredited body. This fee is payable by both salaried and non-salaried trainees.\r\n","financialSupport":"Find out about any financial support in terms of tax-free bursaries, tuition-fee loans or maintenance loans at the Get Into Teaching Website:\r\n[Get Into Teaching] (https://getintoteaching.education.gov.uk/funding-my-teacher-training)","aboutCourse":"You will be trained in the craft of teaching in a highly supportive environment where you will be supported to develop the professional knowledge, understanding and skills necessary for the delivery of outstanding teaching and learning.\r\n\r\nMost of your training will be delivered by expert teachers in a school environment. You will generally spend four days per week at your placement A school and one day per week will be dedicated to study time and professional and curriculum studies arranged by KMT -  giving you the opportunity to share your learning with trainees from other schools, both in your own subject area and from other subjects too.  You will have the support of tutors from Kent & Medway Training. Your tutor will also visit you in your school setting to offer guidance and advice. \r\n\r\nYou will be assigned three mentors – one will be subject based, one pastoral and the other will be a member of the school’s Professional Mentor team. All of our mentors are experienced practitioners who have also undertaken training programmes to develop their mentoring and coaching skills. \r\n\r\nYou will also complete a six week teaching placement in another local school. As young people in Kent have the opportunity to sit the Kent 11 plus test, you will have the option of doing a second placement in a grammar school, a high school and/or a single sex school.\r\n\r\nYou will be assessed through formal lesson observations, your evidence portfolio, research projects and a progress tracker measured against the teaching standards.\r\n\r\n","interviewProcess":"We are looking for ambitious, forward-thinking, emotionally-intelligent and innovative trainee teachers who are passionate and enthusiastic about their subject and the prospect of working with young people of all abilities in a secondary school environment.  As a member of the teaching team you will be eager to learn how to deliver outstanding lessons and contribute to the wider education agenda; inspiring learners and raising standards.\r\nMascalls School is the lead school in the partnership and will coordinate the recruitment process.\r\nApplicants who are selected for interview will spend a full day at the school. During the day interviewees will be observed teaching a 20-30 minute lesson to a group of pupils, will complete literacy and numeracy fundamentals along with a subject knowledge test.This will be followed by a formal interview. You will be informed in advance about the content of the lesson, the age group and the abilities of the pupils you will be teaching. Opportunities will be provided for you to meet experienced teachers from your subject area and other trainee teachers. A representative from KMT will be involved throughout the day and the selection decision will be a joint decision between Mascalls Academy, your chosen school and KMT.\r\n\r\n\r\n","howSchoolPlacementsWork":"\r\nYou would be part of an organisation where we pride ourselves on high academic achievement, where personal qualities are valued highly and where the atmosphere is friendly and purposeful.  We enjoy a great reputation in the area and one that will develop your career; we have a fantastic track record through our Training School activities for which we have received the CPD Gold Mark; there are numerous opportunities for professional development.\r\n\r\nMascalls Training Partnership comprises Mascalls School, a mixed, 11-18 Comprehensive School, St Gregory's catholic comprehensive school (a mixed 11-18 comprehensive faith school), Hayesbrook school (a boys' 11-18 comprehensive school), High Weald academy (a mixed comprehensive school), Skinners Kent academy (a mixed comprehensive school) Hugh Christie technology college (a mixed 11-18 high school) and a variety of small and large primary schools. \r\nYou can either apply for a specific school or to the training partnership. Your interview will take place at the placement school.\r\n\r\nOur staff are very experienced in working with trainee teachers and you will have the opportunity to work with a range of teachers with a variety of specialisms. Trainees will each have a bespoke training programme and access to a large team of experienced Professional Mentors. We are totally committed to providing excellent training opportunities for our next generation of teachers.\r\n","personalQualities":"In order to train with us you must be:\r\n\r\n* passionate about your subject\r\n* resilient and resourceful \r\n* dedicated to educating and supporting young people\r\n* self-reflective\r\n* open to constructive criticism\r\n* professional\r\n* proactive\r\n* a strong communicator\r\n* be organised\r\n","otherRequirements":"Before the course begins, you will need:\r\n\r\n* at least 10 experience days in a secondary school or academy (if School and Government Guidelines allow)\r\n* at least 2 experience days in a primary school or academy (if School and Government Guidelines allow)\r\n* DBS check\r\n* Health check declaration\r\n\r\nIt is useful to attend at least one school experience day or informal chat with a school representative before applying so that you can get a feel for the chosen school and what it can offer as a training placement.","status":1,"createdAt":"2021-07-06T10:52:22.221Z","updatedAt":"2021-07-19T09:03:33.982Z","canSponsorStudentVisa":"no","cycle":"2024"}
