{"id":"abbcc6ee-0c04-4bbb-a69d-f3a9222733e7","name":"Mathematics","code":"2737","qualification":"qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"72345aa7-096c-488f-8649-085b8178cadb","code":"G1","name":"Mathematics"}],"locations":[{"id":"99d3365e-f74a-4bab-b1ba-8987a67b51de","name":"The Skinners School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"a0d82907-9c6b-4d3b-93d9-9b9899c52372","name":"Weald of Kent Grammar School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"dabc2414-32b5-4c65-b8c8-5da035b667d2","name":"Hugh Christie Technology College","isPublished":"Y","status":"R","vacancies":"F"},{"id":"f65414ce-5f24-472d-ba8e-773d3e7e2be9","name":"Grange Park School","isPublished":"Y","status":"R"},{"id":"b83d3623-8687-41cb-bad4-15584d25827c","name":"Tonbridge Grammar School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"a7d210e2-a486-4aa6-9dd8-e8186defa14c","name":"Hadlow Rural Community School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"2e80a25c-d5f0-4413-8f61-959ac20bb03f","name":"Skinners Kent Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"15d515e2-eddb-4edc-a33d-68c5ac9e1585","name":"Tunbridge Wells Grammar School for Boys","isPublished":"Y","status":"R","vacancies":"F"},{"id":"3f87a0e8-313c-4368-ba3f-21450e4c10c1","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"},{"id":"5ae1a7aa-11b4-4ecc-9cdc-d26169f4c1e3","name":"The Judd School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"5c624c08-58ca-49b8-8239-7e85b1401854","name":"Tunbridge Wells Girls' Grammar School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"27771bee-a309-42dd-b85f-598b3185abdb","code":"1GR","name":"Mascalls Training Partnership"},"accreditedBody":{"id":"757d0dca-c7a9-43c8-8c3b-96c0a81539b6","code":"K30","name":"Kent and Medway Training"},"degreeGrade":"9","english":"3","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We accept Level 2 in English and Maths only.\n\nLevel 2 in Literacy and Numeracy are not accepted.","courseLength":"OneYear","feesUK":7100,"feesInternational":7100,"feeDetails":"The fee of £7100 is the cost for all trainees leading to Qualified Teacher Status (QTS) only. This fee is payable by all non-salaried trainees but payable by the home school for salaried trainees.\r\n\r\nFor those wishing to 'top up' their qualification to the full Professional Graduate Certificate in Education (PGCE) a further £1950 (subject to change)  will be payable to the University of Leeds Beckett who are our PGCE accredited body. This fee is payable by both salaried and non-salaried trainees.\r\n","financialSupport":"Find out about any financial support in terms of tax-free bursaries, tuition-fee loans or maintenance loans at the Get Into Teaching Website:\r\n[Get Into Teaching] (https://getintoteaching.education.gov.uk/funding-my-teacher-training)","aboutCourse":"The course begins on the first day of INSET training with the rest of the staff, integrating you into the staff body, and will continue until the middle of June. This is so you can begin working in July in those schools that offer an early start. You will also have a six-week placement in a contrasting school to help to broaden your experience.\r\n\r\nYou will be in schools for four days a week where you will be involved in observations, teaching, staff training, parents’ evenings, school meetings, extra-curricular clubs: all the facets of a teacher’s school life. On Thursdays, you will have your pedagogical training with KMT that provides a mixture of specific Subject Studies, looking at aspects of teaching your specialism, and the more general Professional Studies sessions, which have a holistic approach to educational practices. \r\n\r\nYou will be supported by a network of established professionals, including a subject mentor in your school, usually a subject specialist, your Professional Tutor, your KMT Lead Mentor and Hub Director as well as the other teachers and trainees in your school. You will have a weekly mentor meeting to allow you to discuss any issues and organise any support you may need.\r\n","interviewProcess":"We are looking for ambitious, forward-thinking, emotionally-intelligent and innovative trainee teachers who are passionate and enthusiastic about their subject and the prospect of working with young people of all abilities in a secondary school environment.  As a member of the teaching team you will be eager to learn how to deliver outstanding lessons and contribute to the wider education agenda; inspiring learners and raising standards.\r\nMascalls School is the lead school in the partnership and will coordinate the recruitment process.\r\nApplicants who are selected for interview will spend a full day at the school. During the day interviewees will be observed teaching a 20-30 minute lesson to a group of pupils, will complete literacy and numeracy fundamentals along with a subject knowledge test.This will be followed by a formal interview. You will be informed in advance about the content of the lesson, the age group and the abilities of the pupils you will be teaching. Opportunities will be provided for you to meet experienced teachers from your subject area and other trainee teachers. A representative from KMT will be involved throughout the day and the selection decision will be a joint decision between Mascalls Academy, your chosen school and KMT.\r\n\r\n\r\n","howSchoolPlacementsWork":"You will have a ‘Home’ school which is where you will spend the majority of your training year, between September and January, and Easter and June. You will be learning how to teach your subject by slowly building up to teaching full lessons and then building up your number of lessons. You will be supported by  a mixture of expert teachers.\r\n\r\nYou will also have a six-week placement in a contrasting school. For example, from a non selective to a Grammar School or a single-sex school to a mixed school. This will usually take place between February and Easter.\r\n\r\nIn April and May, you will be finally assessed through both lesson observations and your completed portfolio to ensure that you have met the Teachers’ Standards. If you are successful, your QTS award will be confirmed during our final Exam Board. \r\n","personalQualities":"In order to train with us you must be:\r\n\r\n* passionate about your subject\r\n* resilient and resourceful \r\n* dedicated to educating and supporting young people\r\n* self-reflective\r\n* open to constructive criticism\r\n* professional\r\n* proactive\r\n* a strong communicator\r\n* be organised\r\n","otherRequirements":"Before the course begins, you will need:\r\n\r\n* at least 10 experience days in a secondary school or academy (if School and Government Guidelines allow)\r\n* at least 2 experience days in a primary school or academy (if School and Government Guidelines allow)\r\n* DBS check\r\n* Health check declaration\r\n\r\nIt is useful to attend at least one school experience day or informal chat with a school representative before applying so that you can get a feel for the chosen school and what it can offer as a training placement.","status":1,"createdAt":"2021-07-06T10:52:22.076Z","updatedAt":"2021-07-19T09:13:37.343Z","canSponsorStudentVisa":"no","cycle":"2024"}
