{"id":"d6b61ac9-6aa2-4eed-93a2-674256b0c8b8","name":"Business Studies","code":"35JM","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"de6477b2-6027-48e6-b9f7-3206774705c2","code":"08","name":"Business studies"}],"locations":[{"id":"b4b5ceac-4cc7-40ac-bc34-d6ed71548623","name":"Acklam Grange School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"f146be05-0295-4b53-94c0-0ef017f4c012","code":"2FD","name":"Acklam Grange School"},"accreditedBody":{"id":"99d7311e-6bc7-4ef3-a36b-72a3ff429155","code":"D87","name":"Durham SCITT"},"profPost":"PG","degreeGrade":"9","english":"2","maths":"2","acceptPendingGcse":"no","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"financialSupport":"Bursaries are available depending on the subject in which you are training to teach.\r\n\r\nPlease contact Acklam Grange Teaching school for more information.\r\n","aboutCourse":"The course is full time and runs from September until the beginning of July. \r\n\r\nAll trainees must demonstrate that they can fully meet each of the Standards for Qualified Teacher Status by the end of the course. Trainees will be continually assessed through lesson observations and placement reports whilst on teaching placements, and through a series of 3 short assignments. Detailed portfolios of evidence are submitted 3 times during the year to demonstrate how trainees are meeting the Standards for Qualified Teacher Status. Following the first 2 submissions, trainees receive feedback on their progress. \r\n\r\nThe PGCE is accredited by University of Sunderland and assessed through 2 written assignments. The 2 PGCE training modules will be held at The Work Place in Newton Aycliffe. \r\n\r\nIf a trainee does not meet the Standards for Qualified Teacher Status, but has passed the 2 PGCE modules, the credits can still be used towards a MA programme.\r\n","interviewProcess":"The first thing we look at is your application form and your references to decide whether or not we should invite you for interview. It is, therefore, important to include all the relevant information on the form to help us make this decision.\r\n\r\nIf you are invited to interview and have a disability, please let the Course Administrator know in advance if there are any special arrangements that should be made for the interview process, for example large print copies of documentation, additional time for reading or wheelchair access to the interview rooms.\r\n\r\nYou will be sent information about a 15 minute subject specific teaching task. The activity should be devised to be appropriate for a group of Year 10 (14 - 15) students. The interview panel will then ask you several questions to establish your motivation for wanting to teach in your chosen subject area and some administration questions. There will also be an opportunity for you to ask questions about the course. After the teaching task and formal interview, you will have a timed written and numeracy activity to complete.   \r\n\r\nThe formal interview panel will be made up of a subject specialist and Teaching School Leads. \r\n","howSchoolPlacementsWork":"The course is made up of General Professional Studies sessions, the Subject Specialism Programme and PGCE modules. It will also involve 3 teaching placements; the first runs from September until December. The second placement (in a different school) runs from January until March. For Placement 3 you return to your host school from April until July.\r\n\r\nPlacement 2 schools are selected to provide you with a different experience from that of your host school.","personalQualities":"","otherRequirements":"The Disclosure and Barring Service (DBS) provides employers and other authorised organisations with details of an individual's convictions, cautions, police reprimands and warnings held on the Police National Computer.  ","status":1,"createdAt":"2021-07-06T10:54:39.467Z","updatedAt":"2021-07-07T06:46:02.221Z","canSponsorStudentVisa":"no","cycle":"2024"}
