{"id":"b92b5876-742d-4d4d-b025-ecaa01213a31","name":"Primary","code":"2MBS","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_7","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"3dcb7835-afb1-491e-9400-d0eb7bb7749f","name":"Chelwood Nursery School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"9cee8e15-050e-425c-83e6-ad4aa549729f","code":"21K","name":"South Thames Early Education Partnership & Goldsmiths University (STEEPtsa)"},"accreditedBody":{"id":"049fe65f-08dc-4686-9ac8-606dce490128","code":"G56","name":"Goldsmiths, University of London"},"profPost":"PG","degreeGrade":"0","english":"1","maths":"1","science":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":17370,"feeDetails":"Annual tuition fees\r\nFees for students starting their programme in the 2021/2022 academic year can be found via this link:\r\n\r\nhttps://www.gold.ac.uk/pgce/primary/\r\n\r\n","financialSupport":"Goldsmiths offers a range of financial support details of which can be found no their website.\r\n\r\nScholarships, bursaries and fee waivers for PGCE students\r\nhttps://www.gold.ac.uk/pgce/fees-funding/scholarships/","aboutCourse":"STEEP Primary PGCE with Early Years Specialism\r\nWorking in partnership with Goldsmiths University, we offer this outstanding School Direct,  initial teacher training route, leading to the award of Postgraduate Certificate in Education (PGCE), with 60 Master's credits and Qualified Teacher Status (QTS). \r\n\r\nOn completion you will be well equipped to teach in Nursery and Primary schools in inner city London, within the UK,  and across the world.\r\n\r\nSuccessful applicants accepting a place on our course will:\r\n* Be allocated a place at one of our six outstanding Maintained Nursery Schools, where you will join a team of experienced, specialist professionals who are passionate about Early Childhood Education. \r\n* Receive high quality support and mentoring throughout your training and benefit from the expertise of Senior Leaders across all six settings.  \r\n* Track how children are supported and develop over the course of an entire academic year and how strong relationships with families is central to this.  \r\n* Complete a Reception and a Key Stage 1 placement, equipping you well to work in a Nursery, Reception and Primary School environment.  \r\n* Join our alumni of highly regarded Early Years specialist teachers where 100% of our STEEP students gain employment in their specialist area.\r\n\r\nYou will:\r\n* learn about the very latest theory and research, on which our teaching rests\r\n* have the opportunity to reflect on what theory looks and feels like in practice.\r\n* join Goldsmiths, University of London's Primary ITE programme, with full access to University services and facilities, benefitting from the expertise and the research profile of the Goldsmiths’ Primary team\r\n*  focus on 3-7 year-olds (Foundation Stage/Key Stage 1) and  spend time working with very young children \r\n* cover the National Curriculum subjects, including the three core areas of English, Mathematics and Science with additional sessions relevant to teaching in the Foundation Stage\r\n\r\nIn addition to the University based taught input you will:\r\n*  receive bespoke input from the STEEP partners and attend staff meetings and school in-Service training in their host school \r\n* attend the annual STEEP Conference, which has an attendance of over 200 and will be able to hear from leading Early Years academics and practitioners\r\n \r\nOn completing this course you will be well prepared to lead your own class with strong principles of practice, enabling you to provide high quality Early Childhood Education.\r\n\r\n","interviewProcess":"The interview,  with tutors from STEEP and the Department of Educational Studies at Goldsmiths College, forms an important part of our selection process and seeks to assess both your ability to communicate effectively and your academic and personal suitability to teach including. \r\n\r\nThe interview tasks cover the following areas:\r\n* Interpersonal skills and communication\r\n* Leadership and passion\r\n* Support and respect\r\n* Resilience and adaptability\r\n* Self-organisation and proficiency\r\n\r\nThe interview process lasts approximately 2 hours and involves a number of short elements including:\r\n* a group task with either adults or children\r\n* a written task\r\n* an individual interview\r\n\r\nIt is recommended that prior to starting the course you complete a five-day pre-program school placement.\r\n\r\nWe want to understand more about you, and the relevant experience you have gained which will support you in your Initial Teacher Training.\r\n\r\nWe are looking for applicants who are:\r\n* interested in young children and how they learn\r\n* able to communicate effectively with others, adults and children\r\n* excited by the unexpected and able to be flexible and adaptable to change\r\n* reflective and analytical and able to evaluate what is going well and what could be done better\r\n* interested in their own learning and professional development\r\n* with a willingness to take “risks” and try out new ideas\r\n* positive and optimistic in attitude\r\n* resilient and have a sense of humour\r\n\r\nNB. Interviews may be help virtually if the Covid pandemic persists.","howSchoolPlacementsWork":"Our course ensures you have the required a minimum of 120 days in school,  with additional time to reflect and hone your skills as a teacher and see cycle of the full school year and the development of the children over time.\r\n\r\nOver this PGCE year you will have placements in three schools: \r\n1.  Maintained Nursery School, your host/base school and final school placement\r\n2. Reception class placement in a Primary School - 5 weeks in the Autumn term.\r\n3. Key Stage 1 placement in a Primary School - 5 weeks in the Spring term.\r\n\r\nSTEEP arranges all the school placements within our Teaching School Alliance and partner schools.\r\n\r\nIn advance of each placement you will receive taught content provided by STEEP and Goldsmiths University to support your teaching on school placement.\r\n\r\nHost placement:\r\nSuccessful applicants will be allocated a place at one of our six outstanding Maintained Nursery Schools, with access to the support and expertise of a multi-skilled Early Years team.    This 'host' school will be your base for your the full academic year and the school Leadership and Staff of your host school form a significant part of your support network whilst you train, including when you are on placement in other schools.\r\n\r\nThroughout the course you are supported by your Class based mentor and your School based mentor who will visit and support you in your Reception and Key Stage One school  placements. This provides vital personalised support and consistency of approach ensuring students can develop and transfer their skills, across the age phases and in different settings.\r\n\r\nAlongside this you have blocks of time at Goldsmiths University, and taught sessions,  in each of the six STEEP schools, this includes the opportunity to visit each school in the Spring term to follow your own areas of investigation.","personalQualities":"We are looking for applicants who are:\r\n* passionately interested in how young children learn and develop\r\n* able to communicate effectively with adults and children\r\n* excited by the unexpected and able to be flexible and adaptable to change\r\n* reflective and analytical and able to evaluate what is going well and what could be done better\r\n* positive and optimistic in attitude\r\n* resilient and have a sense of humour\r\n","otherRequirements":"If you are successful at interview you will need meet the following conditions:\r\n\r\n* Occupational Health check ok (fitness to teach)\r\n* Clear DBS check\r\n* Self-declaration of suitability form\r\n\r\nIt is recommended that you complete 5 days school experience and have this validated by the school prior to interview.","status":1,"createdAt":"2021-07-06T10:54:15.239Z","updatedAt":"2021-10-06T13:04:34.961Z","canSponsorStudentVisa":"yes","cycle":"2024"}
