{"id":"8c95c7ff-6eee-4f50-9073-1e66b1ec09b4","name":"Primary","code":"2X7P","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"1f27ee08-0d39-4825-bfa8-a0b543985d8c","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"77e24da0-3669-4976-adb8-0f105e8757c3","code":"25M","name":"Fareham and Gosport Primary SCITT"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":9250,"feeDetails":"SCITT (tuition fee) training programme:\r\nAlthough trainee teachers will be based in a school they are not employed by the school. Fees must be paid by the trainee teacher through student finance.\r\n","aboutCourse":"The Fareham and Gosport Primary SCITT and Partner schools have extensive experience of involvement in and leading initial teacher training. Our training package is tailor made to meet the learning needs of trainee teachers working in Fareham and Gosport and beyond.\r\n\r\nWe offer a one year programme designed to enable trainee teachers to meet the Teachers’ Standards in addition to the academic award, PGCE. The training programme combines school experience with Professional Studies and Subject Knowledge development. We believe this blended approach of school based learning and academic study gives trainee teachers the ‘best of both worlds’; the opportunity to link theory and practice, thus developing reflective practitioners.\r\n\r\nFrom the first day trainee teachers will be in the classroom, part of an established teaching team in a school. The training programme will provide experience of teaching in key stages one and two and enrichment activities in both the secondary and Early Years phases. Expert class teacher mentors and professional mentors (often senior leaders/Head teachers) will support trainee teachers to develop and refine their teaching skills.\r\n\r\nTrainee teachers will spend the majority of the year in a school in the Fareham and Gosport area (or sometimes beyond), working within key stage one and key stage two. All trainee teachers will also undertake a second school placement, typically a half term, which will give them the opportunity to extend their practice in a different setting, age range and context.\r\n\r\nWe work closely with the University of Roehampton who will provide expertise and support for the academic assignments, (at Masters level) woven into the training programme. Trainee Teachers will have access to the study facilities, including the library, at the University.\r\n\r\nEvery week the group comes together at Harrison Primary School, one of the Partner schools or online, for the taught elements of the comprehensive training programme which is facilitated by SCITT Lead Facilitators and expert school practitioners. \r\n\r\nThe training programme is designed to support trainee teachers to achieve Qualified Teacher Status (QTS). On successful completion of the programme trainee teachers will be recommended for QTS by Fareham and Gosport Primary SCITT and awarded PGCE (Postgraduate Certificate of Education) by the University of Roehampton.\r\n","interviewProcess":"All interviews are currently conducted online using Microsoft Teams but will return to face -to-face in September 2021. A summary of our interview process\r\n\r\nStage 1:\r\n - a range on activities including a presentation.\r\n\r\nFollowing stage 1, selection of applicants who have shown sufficient potential to continue through to Stage 2.\r\n\r\nStage 2:\r\n - a teaching panel interview with a range of questions to identify applicants suitability and potential to train to teach.\r\n\r\nStage 3:\r\n - The interview panel will meet to discuss and confirm decisions about applicants’ suitability for the programme at the end of each cohort of interviews. The Chair of interview procedures will quality-assure the processes and decision-making. \r\n\r\nStage 4:\r\n - Applicants will be notified of the outcome of their interview within seven days via the UCAS system an via email.\r\n - We also offer feedback to candidates regardless of the outcomes of their interview.","howSchoolPlacementsWork":"It is the SCITT’s responsibility to secure appropriate placements of quality for trainees’ school experience. Partner schools have a commitment to the provision of high quality training and provision for Initial Teacher Training. They will:\r\n - provide a suitable setting and models of best practice for trainee teachers\r\n - have appropriately qualified, experienced and trained staff to take on the roles of Class Teacher Mentor and Professional Mentor\r\n - be fully involved in the SCITT Management Structure through participation in its development committees\r\n\r\nThe SCITT Director has responsibility for co-ordinating the allocation of trainee teachers to one of the partner schools. Allocation follows attendance by trainee teachers at partner school open days and the ‘school trainee teacher/Partner School Meet and Greet Event'. Both are designed to give Head teachers the opportunity to identify a potential trainee teacher for their school, whilst giving the trainee teachers the chance to meet and get to know some of the partnership schools’ Head teachers.\r\n\r\nTrainee teachers and Head teachers are then invited to provide feedback to the SCITT Director indicating their preferred options in terms of schools/trainee teachers. Taking into account trainees' geographical locations, this information is then used to allocate trainee teachers to their placements schools for the year.\r\n\r\nIn total, trainees will be placed with 2 partner schools during their training year. These will be their main placement school and their shorter second placement school.\r\n\r\nDuring each placement, trainee teachers will normally spend 4 days in their school and one day, typically Fridays, in formal training at Fareham and Gosport Primary SCITT.\r\n","personalQualities":"Potential applicants to our programme should demonstrate some or all of the following:\r\n\r\n - a genuine passion for teaching\r\n - an understanding of the role of a primary school teacher\r\n\r\nThe ability or willing to be: \r\n- reflective\r\n - committed\r\n - articulate and clear in their delivery\r\n - organised\r\n - creative\r\n - resourceful\r\n - respectful\r\n - knowledgeable\r\n - decisive\r\n - collaborative\r\n","otherRequirements":"All applicants are required to provide two academic professional references.\r\n\r\nSuccessful applicants will be subject to a Disclosure and Barring Service (DBS) check. \r\n\r\nAll Trainee Teachers must also complete the Health and Physical Capacity to Teach documentation, (Hampshire Education Authority checks), before being offered a place on the programme.\r\n\r\nFundamental English and mathematics proficiencies\r\n\r\nDuring the selection process and/or training programme, providers will assess and assure that individuals have the required fundamental English and mathematical skills set out by the Department for Education.\r\n\r\n\r\n\r\n","status":1,"createdAt":"2021-07-06T10:54:04.765Z","updatedAt":"2021-07-08T10:29:36.036Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
