{"id":"5712de7d-e1c1-4482-8987-22951d41cbae","name":"Art and design","code":"F207","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"d461a678-3335-4ca2-9616-1dc479d31a49","code":"W1","name":"Art and design"}],"locations":[{"id":"722f84b3-b5de-492f-be76-cd712f03d54b","name":"Main Site","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"2535bc32-6a20-4084-b43e-8d5c1ec0a80b","code":"1P2","name":"Ashmole Academy (North London Teaching Alliance)"},"accreditedBody":{"id":"252d7e03-741e-4453-b6a8-3d361e6c9d1b","code":"E69","name":"e-Qualitas"},"english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","aboutCourse":"School Direct trainees will receive subject-specific training coordinated by their personal mentor with the aim of developing subject knowledge and subject-specific pedagogy. Each trainee’s bespoke program will involve a weekly observation and review meeting where the mentor will provide personalised feedback and then coordinate appropriate support tailored to ensure you reach your full teaching potential. This may involve you observing other experts in your department, receiving specific guidance on aspects of delivery from experts across the school or liaising with specialists to enhance your skills in particular areas of teaching. \r\n \r\nEach week, all trainees within the school receive 2 hours of Professional Studies training.  These sessions will develop trainees’ understanding of best practice in each of the key Teaching Standards and are delivered by senior members of staff within the school enabling you to have access to the best guidance and support. Topics include professionalism in teaching, assessment, lesson planning and behaviour. \r\n\r\nAt the beginning of the course, you will teach approximately 10 hours per fortnight.  This will increase to around 18 hours by Christmas and 25 hours by Easter. This is a vital step in ensuring all trainees are prepared for the rigours of teaching as a Newly Qualified Teacher. Each trainee is different and mentors will ensure that individuals feel prepared for this uplift as the year progresses. \r\n \r\nDuring the year, you will spend 15 days at Middlesex University where you will have the opportunity to further develop subject-specific skills and share ideas with peers. These sessions are organised by the University and led by your University tutor.  \r\n \r\nMiddlesex University set a series of assessments throughout the year.  To complement these, trainees will complete weekly tasks that support the Professional Studies meetings, provide opportunities for refinement of skills and an additional focus for mentor meetings. \r\n","interviewProcess":"Candidates who are successful at the first round application stage will be invited to attend an employment-based interview at Ashmole Academy (or one of our partner schools).   During the interview day, you will be asked to teach a short lesson, work with a small group of pupils, and complete a written test and a subject knowledge interview.   An initial shortlisting will take place at this stage and successful candidates at the second round will be invited to stay for a panel interview.   The interview panel will normally consist of staff who are involved in the School Direct process and may be Headteachers or leadership member from other schools within the partnership.   The outcome of the interview will normally be communicated to you within one week of the interview day.","howSchoolPlacementsWork":"During your training year you will complete one placement at another school. This is a requirement of the course and an important part of your experience as it enables you to practice the things you have learnt in another, often different, school setting.  \r\n\r\nPlacements usually take place during the Spring term and last for around six weeks. You will be placed in either a school within our partnership or a school local to your main placement. Whilst on placement, you will have weekly meetings with a subject mentor, regular observations and feedback and Professional Studies sessions. Your university mentor will visit you whilst at the placement to ensure continuity and review your progress in your new setting. \r\n\r\nWe share information regarding your second placement during the first half of the Autumn term. We endeavour to make sure the placement is suitable to you regarding travel and other commitments but our primary aim is to ensure you have an opportunity to develop and hone the pedagogical skills necessary to be an outstanding teacher.   \r\n","personalQualities":"We are looking for ambitious trainee teachers who are passionate and enthusiastic about their subject and have a desire to share that with young people of all abilities in the secondary age range. This will be demonstrated by meaningful experience of working with young people of this age. This does not need to be paid work but might be helping with a sports team, drama group or youth club. We would like you to have","otherRequirements":"The  North London Teaching School Alliance is committed to safeguarding and promoting the welfare of children and young people and expects all staff and volunteers to share this commitment.    DBS checks will be carried out for all school direct trainees.","status":2,"createdAt":"2021-07-06T10:55:18.469Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"paid on point 1 of  the unqualified teacher's pay spine   "}
