{"id":"0845670b-109f-4c3f-a611-0d26832d091e","name":"Primary","code":"39MY","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"88366dba-205f-4ce9-9313-74d380bffbb4","name":"Prince Albert School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"49863b86-26f9-4b18-b7f9-21b1049ba8d3","code":"2JO","name":"Prince Albert Junior and Infant School"},"accreditedBody":{"id":"c357e0fa-802e-471b-818a-d0cd1434f9cd","code":"B32","name":"University of Birmingham"},"degreeGrade":"1","english":"2","maths":"2","science":"2","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feeDetails":"The course fees for UK students in 2021 to 2022 are £9,250","financialSupport":"You may also be eligible for a loan while you study – note that you’ll have to apply for undergraduate student finance.\r\n\r\nFind out about financial support if you’re from outside the UK\r\n","aboutCourse":"Our School Direct route leads to the award of a Post Graduate Diploma Primary Education (PGDipEd) with Qualified Teacher Status (QTS). The course combines school-based learning coordinated by the ‘Lead School’ with lectures, seminars, workshops, tutorials and practical sessions at the University of Birmingham. Study at the University is largely within the School of Education’s dedicated building which includes specialist facilities, student study areas and online learning support.\r\n\r\nThere are four main assignment tasks which are submitted throughout the year. These studies must show how practice and research combine to provide a framework within which you teach, refer to practical pedagogy in the classroom, research of academic literature and both reflection and evaluation. Educational studies are assessed by professional tutors and subject to moderation and review.\r\n\r\nPrimary routes focus on the study of teaching in all National Curriculum subjects. If you enrol onto the SD PGDipEd course you will follow the General Primary training route ( 5- 11 ) You will complete 2 school attachments  across Key Stages 1 and 2 which will take place in  2 different schools across the trust. \r\n\r\nOn successful completion of your PGDipEd and your ECT induction period,  you may return to study with the University on a part-time basis to complete your Masters in Teaching Studies.\r\n\r\nAs with all School Direct unsalaried places there is an intention, but no absolute guarantee, that you will be employed in your training school or if not, then a school within the partnership.\r\n","interviewProcess":"This year, we hope to conduct all interviews in school; there are some pre – interview tasks that will be an essential part of the process. \r\n\r\nPrior to the interview:\r\n\r\n* Applicants will be sent a short article about behaviour. They will be asked to talk about it during the interview. \r\n* Applicants will be asked to prepare a session where they will read a book / extract suitable for either Y2 or Y5 pupils. ( applicant's choice )\r\n* Applicants will then be asked to prepare a short 15/20 min learning activity with the children that follows on from the book / extract\r\n* Applicants will be advised to view the websites of the schools within the partnership to gain an insight into school life at PACT\r\n\r\nInterview date: \r\nYou will be invited to attend an interview at one of our schools  which will be attended by some members of the Trusts Senior Leadership Team.  You will: \r\n\r\n* Complete your reading activity with elected year group \r\n* Complete your learning activity with your elected year group\r\n*  Be asked set questions \r\n*  Be required to talk about the article and be prepared to answer questions on it \r\n* Have the opportunity to ask any questions yourself \r\n\r\nFollowing the interview, applicants will be contacted via the University of  Birmingham via email to let them know if PACT will be offering a place. Any formal offers of a place will then come from the University. \r\n","howSchoolPlacementsWork":"There are five schools, in addition to Prince Albert, involved in our Schools Direct partnership. Four are PACT schools: Heathfield, Highfield, Birchfield and Sutton Park Primary.\r\n\r\nHeathfield is a vibrant, friendly 2-form entry, which is approximately 1.5 miles from Prince Albert. Their expectations are high, both in work and behaviour and they do their utmost to ensure a world class education is given to each and every one of their children.\r\n\r\nHighfield is 4-form entry and is approximately 5 miles from Prince Albert and serves a highly diverse community. It is innovative in its approach to teaching and learning and has an incredibly friendly staff and atmosphere. The school has recently been graded as ‘good’ by Ofsted.\r\n\r\nBirchfield joined the trust in 2018 and is a friendly 3-form entry. It is approximately 1 mile from Prince Albert and is located in close proximity to the Trust Head Office. It is a vibrant and friendly school where relationships matter. The staff team are committed to providing children with a high quality curriculum and education in a caring and nurturing environment.\r\n\r\nSutton Park Primary is the newest primary  school to join the trust. It is located in Sutton Coldfield and is in close proximity to the trusts second head office base. The school hosts lots of outdoor space, including an outdoor gym for the children to play on.\r\n\r\nOur diverse group of schools mean that students will be able to experience the full breadth of primary school life and work with a variety of communities across Birmingham, adding depth to their learning.\r\n\r\nPlacement key features:\r\n•\tTrainees start on a 50% teaching commitment in term 1, increasing to 70% by term 3.\r\n•\tExtended second school attachment; (usually undertaken in the  Spring / Summer term)\r\n•\tLesson Observations: 1 per week (minimum); Mentor meetings: 1 per week; 6 review points through the year\r\n•\tAssignments: 4 across the year – English, Maths, Science & assessment and behaviour management \r\n•\tRegular University tutor observations/visits to support schools and trainees’ development.\r\n•\tTrainees complete reflective E-portfolio\r\n\r\n","personalQualities":"In addition, our Partnership applies the following criteria in order to judge whether an applicant may be offered a place:\r\n* The ability to communicate clearly and accurately in both written and spoken English.\r\n* Some practical, recent school-based experience is beneficial \r\n* Details of appropriate referees ( from a professional establishment )  who will provide confirmation of the applicant’s suitability for teaching.\r\n* The ability to cope with the demands and rigours of the profession.\r\n*  Evidence of appropriate levels of commitment and motivation for successful study, including the intellectual capacity for academic study at Master’s level\r\n","otherRequirements":"Successful applicants will be subject to a criminal record and enhanced DBS check","status":1,"createdAt":"2021-07-06T10:51:11.187Z","updatedAt":"2021-10-03T21:04:54.305Z","canSponsorStudentVisa":"yes","cycle":"2024"}
