{"id":"fc29f7f3-5a8c-4f2e-9c59-d8ca2c3b4920","name":"Modern Languages (French and Spanish)","code":"2TSY","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"ce8523ef-9236-4cd9-b260-d826c7a521b3","code":"ML","name":"Modern Languages"},{"id":"9727f674-61ba-4efa-b1f2-21ec7e354442","code":"15","name":"French"},{"id":"e34fd2a3-a32e-44e9-aea1-666badf3ac03","code":"22","name":"Spanish"}],"locations":[{"id":"2ebac0f7-429f-47c7-b884-e9f0b54bc0f4","name":"Westborough High School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"66de4cd1-c2d1-4d65-bbeb-d9a1d7377e56","code":"1NZ","name":"Heckmondwike Grammar School"},"accreditedBody":{"id":"74d0e1b3-80ac-4a0e-b93d-f19cb6587144","code":"1WK","name":"Kirklees and Calderdale SCITT"},"profPost":"BO","degreeGrade":"0","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feeDetails":"The course fees for this year are as follows:\r\n\r\n* UK students £9,250\r\n* EU students £9,250\r\n\r\nWe offer two options:\r\n\r\n* £9,250 for Post Graduate Certificate in Education (PGCE*)  with Qualified Teacher Status (QTS)\r\n* £7,500 for QTS only\r\n\r\n*The PGCE award equates to 60 Masters credits which we offer through the University of Huddersfield.","financialSupport":"You may be eligible for financial support (including bursaries, scholarships and loans) while you study. If required, the Kirklees and Calderdale SCITT will support you through the student finance process for fees and maintenance grants, administer SKE funding and even sign post other possible funding streams.","aboutCourse":"Initial teacher training (ITT) is delivered over the course of one academic school year, from September to July. Under the stewardship of a specialist mentor, trainees will first establish their existing subject knowledge and skillsets before negotiating a tailored training plan to follow.\r\n\r\nA typical week generally comprises of four days attending the host school and one day (traditionally Fridays) studying the theory of professional practice within a classroom setting, delivered by school leaders and pedagogical specialists. In addition to this, trainees will also take advantage of three subject weeks spread across the academic year (one week per term). These sessions provide an opportunity to further enhance subject specific knowledge and practice alongside other trainees with a similar subject focus.\r\n\r\nTo attain Qualified Teacher Status (QTS) trainees must demonstrate and evidence their ability within five core areas of practice that consolidate the Teachers’ Standards. The Teachers’ Standards define the minimum level of practice expected of trainees and teachers from the point of being awarded QTS (DfE. 2013). These five core areas include: behaviour management; pedagogy; curriculum; assessment; and professional behaviours. The course will provide the necessary training, opportunities and guidance to fulfil all such areas to the highest of standards, underpinned by empirical evidence. Trainees will need to demonstrate these competencies across two key stages as a minimum i.e. KS3/KS4 or KS4/KS5 dependent upon their chosen subject.\r\n\r\nTrainee progress will be constantly monitored and evidenced in a number of ways:\r\n\r\n* Weekly mentor meetings\r\n* Weekly observations of teaching practice accompanied with strengths and targets to make further progress\r\n* Half-termly reports compiled by a visiting tutor\r\n* Termly reports written by a mentor\r\n* A second placement report\r\n* Three reflection point assignments\r\n* A video of the trainee exemplifying their accomplishments against the five core areas of competence.\r\n","interviewProcess":"Successful applicants to ITT will be invited to an interview day at Heckmondwike Grammar School. The process offers an opportunity for candidates to demonstrate their suitability for teacher training in a number of ways. This is likely to include a short-written task; numeracy and/or literacy test; teaching a pre-prepared lesson; and an interview by a panel comprising of the Deputy Head, the ITT Coordinator, a subject specialist leader and a Kirklees and Calderdale SCITT representative.\r\n\r\nInterviewees must present the relevant documentation requested by the host school at this stage in the application process to adhere to safeguarding policy. This will include two forms of photo ID, proof of address and evidence of English and Maths GCSE qualifications through the presentation of certificates. \r\n\r\nITT trainees will be selected at the end of each interview day. The host school will endeavour to notify those successful in securing a teacher training place within 24 hours of the interview day. An offer of placement will be made to the candidate, which could carry conditional terms. \r\n\r\nAll trainees will be subject to an Enhanced Disclosure and Barring Service (DBS) check as a prerequisite before embarking upon teacher training.\r\n","howSchoolPlacementsWork":"Trainees are appointed to a designated host school for the majority of their training year. The placement will be sourced and arranged by the lead school before the beginning of the training year. \r\n\r\nA second placement at a contrasting school is undertaken by the trainee, usually throughout the first half-term following the new year (Jan-Feb). This experience provides an opportunity for trainees to gain additional and valuable experience within an antithetical school setting, which provides polarising challenges, cultures and academic priorities in comparison to the host school. \r\n\r\nThe second school placement offers trainees a chance to compare two different experiences and comprehend the type of school they wish to pursue when seeking gainful employment as an early career teacher (ECT).\r\n","personalQualities":"* A commitment to, and enthusiasm for, teaching and learning\r\n* An understanding of children as learners\r\n* A clear and positive educational philosophy\r\n* An understanding of current educational issues\r\n* A knowledge or understanding of the chosen subject specialism within the curriculum\r\n* A good standard of written and spoken English\r\n* Competent skills in ICT\r\n* An ability to establish effective working relationships* An understanding of the demands of the school-based route into teaching\r\n* A dedicated and resilient work ethic\r\n* A warm and nurturing nature towards others\r\n\r\n","otherRequirements":"Offers will be subject to an Enhanced Disclosure and Barring Service (DBS) check which will be organised for you. An overseas check may be required for those who have spent time outside of the UK. You will also be subject to the following checks:\r\n\r\n* Health\r\n* Identity\r\n* Relevant work qualifications\r\n* Right to work in the UK\r\n* Professional registration\r\n* References\r\n* A Childcare Disqualification and Disqualification by Association Declaration.","status":1,"createdAt":"2021-07-06T10:57:18.626Z","updatedAt":"2021-09-26T12:20:15.461Z","canSponsorStudentVisa":"no","cycle":"2024"}
