{"id":"2cf3cbda-3b51-4776-a028-674d1dec6968","name":"History","code":"2VPB","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"5a3609a0-5bbb-4377-b919-5d89932ab622","code":"V1","name":"History"}],"locations":[{"id":"4b1d15e2-a4cc-4e3c-8c45-0eb08d3abe8c","name":"Oriel High School","isPublished":"N","status":"S","vacancies":"F"},{"id":"f1fe4e92-4a02-4d37-9562-7d078b68fbbe","name":"Ifield Community College","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"cd45e2ae-fa2f-4863-8dbf-33eb0a279bde","code":"2LR","name":"Oriel ITT Partnership"},"accreditedBody":{"id":"d2ba71f2-c125-4d86-bb22-736e67043120","code":"B72","name":"University of Brighton"},"degreeGrade":"9","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Please refer to University of Brighton website for up to date information on accepted providers and qualifications - (https://www.brighton.ac.uk/studying-here/applying-to-brighton/undergraduate/entry-requirements/gcse-equivalence-tests/index.aspx)","courseLength":"OneYear","aboutCourse":"There are four strands to this course: subject study/subject education, education studies, school placements and professional development.\r\nWe keep our course content up to date with changes in local and national initiatives and legislation so that on course completion you will be confident that your working knowledge is based on current theory and practice.\r\nThe subject study/subject education strand builds on your existing expertise in History and provides you with the opportunity to develop skills, knowledge and understanding of History in the secondary school context. You will consider the learning and teaching strategies that are relevant to this specialist subject.\r\nThe subject education module is specifically related to teaching the specialist subject in school while the subject study module enables you to take your subject specialist studies to an increased depth. You can earn 20 masters-level credits through the assessment for the subject study module.\r\nThe education studies strand will give you a thorough understanding of the learning process itself, including an appreciation of individual differences. You will develop your practical competencies and analytical skills by studying the principles and practices of learning and teaching in both school and university settings. By the end of the course you will:\r\n•\trefine your understanding of pedagogy, including an appreciation of current and emerging educational theories and debate\r\n•\tlearn how to use and adapt a range of teaching, learning, management and assessment strategies in order to meet the varying needs of learners\r\n•\tunderstand how the progress and well-being of learners is affected by a range of influences and know how to take account of the principles of equality, inclusion and diversity.\r\n\r\nProfessional development is intrinsically linked to all key strands of the programme and is designed to enable you to evaluate critically and reflect on your learning in order to make improvements. You will be expected to gather and justify evidence of your achievements on a regular basis. Developing and implementing improvement plans.\r\n\r\nStudents use an e-portfolio to record their achievements; under the guidance of tutors you will review this throughout the course. You will make full use of an action plan to support your professional development during placements. This makes up a significant part of the improvement planning process.\r\n\r\nBy the end of the course you will have completed an e-portfolio, which you can use as evidence for meeting the Teachers’ Standards for the award of Qualified Teacher Status.\r\n","interviewProcess":"If you have applied for a School Direct place with us, you need to expect two interview stages - the first with the university, the second with the school offering the place.\r\n\r\nThe university interview will be with staff from the School of Education and the department of your subject. They will also want to check your documentation to ensure you are eligible and compliant, so it’s worth looking for the originals of GCSE, degree and marriage certificates before that interview. If you haven’t got them, or haven’t yet finished your degree, you will be given time to order copies and showing then to the university will become part of any conditional offer you might be made. Copies can take up to six weeks and there is a charge, so factor that in to your planning. If successful at the university stage, you will then be invited to a school-based interview which will take two to three hours. You will be expected to:\r\n•\tteach a short part of a lesson on a specific topic; you'll be given information as to the numbers in the group, their ability and the point they are at in that topic.\r\n•\tgive a short presentation to the interview panel – this is likely to consist of senior subject and leadership staff, possibly the Headteacher\r\n•\tcomplete a written task\r\n\r\nIf you are unsuccessful at the university stage, it is unlikely that the school will proceed any further with your application.\r\n","howSchoolPlacementsWork":"On the School Direct salaried route, you have applied to train at and be employed by a specific school and, following interview, will have been offered and accepted a place at that school.\r\n\r\nYou will start at your school in early September and will have a few days of induction to settle you in. You'll stay at this school until February half term and will be on site most of the week; on some weeks you may have additional training blocks at university. You'll be very much part of the school and the more you join in, the more you'll get out.\r\n\r\nAfter February half term, you will move to another school for your short second placement which lasts for most of the second half of the spring term. This second placement is sorted by the Lead school late in the Christmas term and under the directive given by the ITT criteria, must provide a contrasting experience to your host school. As with all second placements, you must expect up to 40 minutes travel.\r\nIf you have a child in a school in the partnership, you wouldn't be placed there, so please make this known early on.\r\n\r\nYou will return to your host school for the last week of the Spring term and the whole of the summer term when your training year will finish. You would expect to be awarded QTS (Qualified Teacher Status) towards the mid/end of June.\r\n","personalQualities":"We are looking for ambitious trainee teachers who are passionate and enthusiastic about their subject and have a desire to share that with young people of all abilities in this particular age range. Strong subject knowledge will make your training year easier.\r\n\r\nYou must like working with young people and making a difference to their lives; resilience and patience are also key qualities.\r\nAlthough school experience is no longer a compulsory requisite, we do feel that you should have a basic understanding of the challenges of education before you commence your training.\r\n","otherRequirements":"You will need three years of prior work experience, but not necessarily in an educational context.","status":1,"createdAt":"2021-07-06T10:50:12.137Z","updatedAt":"2021-10-10T12:06:12.948Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"Your pay will be in line with the unqualified teacher pay scale, your relevant experience will determine your starting point on this scale. It will be in the region of £17,000. \r\n\r\nThe course fees will be paid for by your school.\r\n\r\nNote that the bursaries available for shortage subjects make the tuition route an equally viable option for some.\r\n"}
