{"id":"77443c0c-1260-41dc-846f-de873a33b488","name":"Chemistry","code":"H363","qualification":"pgce_with_qts","startDate":"2023-05-31T23:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"TA","fundingType":"apprenticeship","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"912d4fb4-761b-42e9-8dc6-e968b791ea4e","code":"F1","name":"Chemistry"}],"locations":[{"id":"f1fe4e92-4a02-4d37-9562-7d078b68fbbe","name":"Ifield Community College","isPublished":"Y","status":"R","vacancies":"F"},{"id":"4b1d15e2-a4cc-4e3c-8c45-0eb08d3abe8c","name":"Oriel High School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"cd45e2ae-fa2f-4863-8dbf-33eb0a279bde","code":"2LR","name":"Oriel ITT Partnership"},"accreditedBody":{"id":"d2ba71f2-c125-4d86-bb22-736e67043120","code":"B72","name":"University of Brighton"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Grade 4 (C) or above in English and maths or equivalent qualification.\nCandidates with pending GCSEs will be considered. Equivalency tests will be accepted in English or maths.\nPlease refer to University of Brighton website for up to date information on accepted providers and qualifications - (https://www.brighton.ac.uk/studying-here/applying-tobrighton/undergraduate/entry-requirements/gcse-equivalence-tests/index.aspx)","courseLength":"Other","feesUK":null,"aboutCourse":"Postgraduate Teaching Apprenticeships are available for prospective primary and secondary school teachers in England.\r\nYou’ll be employed by a school while you learn on the job. \r\nIf you’re currently working as an unqualified teacher or teaching assistant, it offers new opportunities for career progression, plus higher earning capacity, recognition, and status.\r\nYou’ll receive a combination of classroom teaching and off-the-job training as you to work towards Qualified Teacher Status (QTS).\r\n\r\nPostgraduate Teaching Apprenticeship programmes combine paid work with on and off-the-job training. The design of the programme has been led by a group of experienced schools and teachers, specifically for apprentices\r\napprentices will split their time between school and university study. You’ll receive practical, school-led training alongside experienced staff, and spend at least 20% of your time off-timetable to learn the pedagogy of teaching\r\nin addition to working towards QTS on successful completion of the course, apprentices will also complete an end point assessment (EPA) after the summer to consolidate learning from initial teacher training.\r\n","interviewProcess":"If you have applied for an Apprenticeship place with us, you need to expect two interview stages - the first with the university, the second with the school offering the place.\r\n\r\nThe university interview will be with staff from the School of Education and the department of your subject. They will also want to check your documentation to ensure you are eligible and compliant, so it’s worth looking for the originals of GCSE, degree and marriage certificates before that interview. If you haven’t got them, or haven’t yet finished your degree, you will be given time to order copies and showing then to the university will become part of any conditional offer you might be made. Copies can take up to six weeks and there is a charge, so factor that in to your planning. If successful at the university stage, you will then be invited to a school-based interview which will take two to three hours. You will be expected to:\r\n•\tteach a short part of a lesson on a specific topic; you'll be given information as to the numbers in the group, their ability and the point they are at in that topic.\r\n•\tgive a short presentation to the interview panel – this is likely to consist of senior subject and leadership staff, possibly the Headteacher\r\n•\tcomplete a written task\r\n\r\nIf you are unsuccessful at the university stage, it is unlikely that the school will proceed any further with your application.\r\n","howSchoolPlacementsWork":"On the Apprenticeship salaried route, you have applied to train at and be employed by a specific school and, following interview, will have been offered and accepted a place at that school.\r\n\r\nYou will start at your school in early September and will have a few days of induction to settle you in. You'll stay at this school until February half term and will be on site most of the week; on some weeks you may have additional training blocks at university. You'll be very much part of the school and the more you join in, the more you'll get out.\r\n\r\nAfter February half term, you will move to another school for your short second placement which lasts for most of the second half of the spring term. This second placement is sorted by the Lead school late in the Christmas term and under the directive given by the ITT criteria, must provide a contrasting experience to your host school. As with all second placements, you must expect up to 40 minutes travel.\r\nIf you have a child in a school in the partnership, you wouldn't be placed there, so please make this known early on.\r\n\r\nYou will return to your host school for the last week of the Spring term and the whole of the summer term when your training year will finish. You would expect to be awarded QTS (Qualified Teacher Status) towards the mid/end of June.\r\n","personalQualities":"We are looking for ambitious trainee teachers who are passionate and enthusiastic about their subject and have a desire to share that with young people of all abilities in this particular age range. Strong subject knowledge will make your training year easier.\r\n\r\nYou must like working with young people and making a difference to their lives; resilience and patience are also key qualities.\r\nAlthough school experience is no longer a compulsory requisite, we do feel that you should have a basic understanding of the challenges of education before you commence your training.\r\n","otherRequirements":"All firm offer holders will be required to complete a satisfactory Suitability Declaration, DBS and Overseas Police check plus Occupational Health Questionnaire.\r\n\r\nApplicants must be a citizen of a country within the European Economic Area, or been ordinarily resident in the EEA for at least the previous three years on the first day of the apprenticeship start date (June 2022) or have some other residency eligibility status – See Annex A – apprenticeship Funding Rules. ","status":1,"createdAt":"2021-07-06T10:50:13.163Z","updatedAt":"2021-10-07T08:51:37.667Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024"}
