{"id":"9123d059-81fd-4f1a-b4a9-87d4f700ef4a","name":"Religious Education","code":"33XX","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"B","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"724b5d16-28dd-4431-bc17-ea4be4daedc4","code":"V6","name":"Religious education"}],"locations":[{"id":"7d028ac1-4f79-4720-a361-dbd872f2fa32","name":"Main Site","isPublished":"Y","status":"R","vacancies":"B"}],"trainingProvider":{"id":"1ae3bd2b-29fc-4ba7-83bd-8e008b7920d8","code":"2EH","name":"The Cotswold Teacher Training Partnership"},"accreditedBody":{"id":"e6c26d28-03d4-443c-9b65-5db7e183966c","code":"G48","name":"Gloucestershire Initial Teacher Education Partnership (GITEP)"},"degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"Closely related to subject being taught.  Please contact us if unsure.","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"All of our course details are available on our website:\r\n[https://cotswold.gloucs.sch.uk/teacher-training/](https://cotswold.gloucs.sch.uk/teacher-training/)\r\n\r\nFor more subject specific information please visit:\r\n[www.gitep.org.uk](www.gitep.org.uk)\r\n\r\nOur programme has 3 phases:\r\n\r\n1.\tExplore\r\nExplore covers induction and parent placement 1. Three weeks of taught professional studies in September are followed by three weeks of school induction, exploring the application of education theory in the context of the parent school. After October half-term, assessed teaching time gradually increases, to 9-11 hours a week by Christmas. In addition, trainees continue to explore aspects of subject pedagogy with their subject leaders and mentors. The PGCE assignment focuses on special educational needs and disabilities. Trainees will explore the differing needs of pupils and how teachers adapt their practice to include them in learning.\r\n\r\n2.\tEmbed\r\nEmbed covers the twin placement, taking place between Christmas and Easter. This gives trainees the opportunity to embed their practice in a different school context, a contrasting one as far as possible. Trainees will be encouraged to try new approaches and to be more creative as they look to embed their learning from Explore. Assessed teaching time increases to 11-13 hours a week. The PGCE assignment focuses on short to medium term planning, giving trainees the opportunity to reflect on their subject learning and embed this in their planning.\r\n\r\n3.\tEnhance\r\nEnhance covers parent placement 2, from Easter to June. Trainees return to a familiar environment with the opportunity to really progress and enhance their practice. The placement aims to give a better understanding of the big picture, with longer term planning and use of a variety of assessment techniques. Assessed teaching time increases to 13-15 hours a week. The PGCE assignment will focus on researching an area of interest within the subject curriculum, enhancing trainees understanding of subject pedagogy.\r\n\r\nSubject pathway\r\nA distinctive feature of our programme is that subject sessions take place every week throughout the programme, with the subject leader and other trainees in your subject. These sessions focus on exploring current issues in your subject, developing practical teaching strategies and subject expertise for teaching.\r\n\r\nAssessment\r\nThe programme leads to a PGCE awarded by the University of Bristol, with 60 Master’s level credits. No training takes place at the University - subject tutors from the University will visit the GITEP sessions in Gloucestershire.\r\n","interviewProcess":"Interviews will normally take place at The Cotswold School. The interview will normally be with the Training Manager, a subject specialist and the GITEP leadership team. Interviews typically last no more than two hours.\r\nThe interview will include a teaching episode presented to a small group of children and a formal interview. There will also be an opportunity to discuss the programme, any particular needs the candidate may have and potential placement schools.\r\n","howSchoolPlacementsWork":"All of our course details are available on our website:\r\n[https://cotswold.gloucs.sch.uk/teacher-training/](https://cotswold.gloucs.sch.uk/teacher-training/)\r\n\r\nFor more subject specific information please visit:\r\n[www.gitep.org.uk](www.gitep.org.uk)\r\n\r\nOn our School Direct course we will ensure one of your placements is at The Cotswold School.  We can also offer routes with placements at Chipping Campden School, a similarly outstanding school.  One of your other placements will be at a contrasting school.  We aim for this to be as close by as possible.\r\n\r\nThe GITEP programme follows a “parent/twin/parent” structure, with three school placements. Trainees are placed in a “parent” school from October to December, a contrasting “twin” school from January to March and return to the “parent” school from April to June. Placements are 9-10 weeks in length.\r\n\r\nEach school has a training manager, responsible for overseeing all the trainees within the school, and trainees are allocated a mentor, a subject specialist who will see them most days and meet with them individually once a week to review their training and plan next steps.\r\n\r\nWhen placing trainees, we take account of travel distance, particular needs and trainee requests. We are well aware that most of our applicants are looking for placements in local schools and we will not require trainees to drive long distances or move home between placements. The vast majority of our trainees travel less than 20 miles to placement schools.\r\n\r\nOur programme covers the 11-18 age range. If trainees are placed in a 11-16 school for their first placement, we ensure that the second placement gives the opportunity for sixth form experience.\r\n","status":1,"createdAt":"2021-07-06T10:56:23.846Z","updatedAt":"2021-10-01T12:53:55.716Z","canSponsorStudentVisa":"no","cycle":"2024"}
