{"id":"9d2195b2-85c8-43ea-b43c-230ae7c2554c","name":"Art and Design","code":"3CG9","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"d461a678-3335-4ca2-9616-1dc479d31a49","code":"W1","name":"Art and design"}],"locations":[{"id":"51b4e4fc-d2f6-48c4-9af6-9ca5a6f2c374","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"9257a6b9-5797-476a-ae73-6821f1e0b27e","code":"1ZW","name":"Sutton SCITT"},"profPost":"BO","degreeGrade":"9","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Candidates can either use a  third party or sit exams set by Sutton SCITT","courseLength":"OneYear","feesUK":9000,"feesInternational":9000,"aboutCourse":"Our Secondary programme leads to Qualified Teacher Status (QTS) and PGCE. The programme provides you with a rich, cohesive and personalised experience of initial teacher training that will enable you to become a confident, competent and excellent teacher, critically aware of your own and others' educational philosophy and practice. \r\n\r\nThe programme has four components: host-school experience, professional practice, taught sessions and a PGCE. School-based experience includes observation of experienced teachers at work, team teaching, working with small groups and with whole classes.\r\n\r\nDuring the Host-School Experience you spend three days in your host school and two days a week training; one day in a subject hub and one in a professional Studies hub. During this period, we begin to construct your individual training plan taking into account your previous achievements. \r\n\r\nWhilst completing your host-school experience you will also receive two full days of dedicated training led by our tutors each week: One subject-focused sessions at hub schools where you have the opportunity to work in subject cohorts on best practice and pedagogy through reflecting on your school-based experience and the literature. One professional studies day where the core skills and competencies of teaching are delivered irrelevant of subject.\r\n\r\nSubject Studies are led by experienced and expert practitioners in your subject. The sessions are held at a 'hub school’ that is expert in the teaching, progress and attainment of that subject. \r\n\r\nProfessional Studies are led by our ITT SLEs and it provides a unifying strand to the programme as a whole and ensures that trainees' subjects are placed in a whole-school and education system context. \r\n\r\nYou will have two formal periods of professional practice in which you will take on the role of a practising teacher with curriculum and pastoral responsibilities. Whilst on professional practice you will be supported by your school-based mentor who is responsible for supporting your development. Mentors have all undergone extensive training which enables them to support you as a coach, role model and trainer. \r\n\r\nThe PGCE Secondary course is assessed by means of two assignments. These are closely linked to your work in schools and are designed to encourage reflection on the practical and theoretical perspectives of teaching and learning. \r\n\r\nYour school experience and your school-based learning are assessed throughout the year. To be recommended for QTS you must demonstrate through your profile and portfolio that you have met the Teachers' Standards.\r\n","interviewProcess":"If your application is successful you will be invited to an assessment day at one of our schools. Our assessment days are designed to assess your potential and aptitude to teach. Each assessment day follows the same format and you can expect:\r\n•\tA group exercise\r\n•\tTeaching a 20 minute lesson on a prescribed topic in your chosen subject\r\n•\tComplete a written task\r\n•\tA subject interview\r\n•\tA general interview\r\n•\tIn some subjects we ask you to sit additional tests to assess subject knowledge\r\n\r\n","howSchoolPlacementsWork":"Trainees will be placed at two schools during the course of the training year. Our partnership comprises of 17 secondary schools all within or very close to the London Borough of Sutton therefore all schools are within easily travelling distance of the lead school, Glenthorne High School. Our schools comprise of mixed comprehensive schools, single sex faith schools, grammar schools and single sex comprehensives. All of our schools are 11-18 and although our programme is an 11-16 programme, you will gain experience and exposure to Key Stage 5. As a result, you are certain to gain an in depth understanding of the range of secondary schools in the maintained sector. Throughout your training year, you will visit many of the schools for training and development but you will be placed in two of the schools. You will be placed in one school from September to December and another from January to June. \r\n\r\nThe interview process will give us a clear indication of your strengths and areas for development and from this we will decide which school you will be best place in from September. You second school placement will be decided towards the end of your first placement once we have assessed your progress and training needs. Your second placement school will contrast your first placement, for example, if you were placed in a boy’s grammar school in September, you would be placed in either a mixed or girl’s comprehensive school for your second placement. Contrasting placements enable us to assess the strengths of your teaching in different settings and informs you of the type of school you wish to begin your career. The SCITT is committed first and foremost to the quality and experience trainees receive on the programme but in some cases we will consider personal circumstances when deciding placement schools, as long as your experience and training will continue to be the best for you as you learn to teach.","personalQualities":"• We expect all out trainees to demonstrate an understanding of the    challenges facing young people, a passion for their subject and desire to improve the educational and life opportunities of children. \r\n•\tExperience of working with young people\r\n•\tThe ability to inspire, motivate and support pupils\r\n•\tEvidence of the ability to listen and communicate effectively both   orally and in writing to a variety of audiences\r\n•\tThe potential to promote a positive ethos and pride in the school\r\n•\tThe ability to remain calm and reflective when working in challenging environments\r\n•\tA well-developed sense of humour\r\n","otherRequirements":"To ensure we have confidence in your ability to work with and keep children safe, before you will be able to take up a place on the programme you must also undertake a:\r\n•\tDBS check\r\n•\tFitness to Teach Survey\r\n•\tRight to study in the UK\r\n\r\n","status":1,"createdAt":"2021-07-06T10:54:58.202Z","updatedAt":"2021-09-22T12:54:05.910Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
