{"id":"ae5eac57-4a3c-4636-82fe-3343f574da7e","name":"Primary","code":"AH05","qualification":"pgde_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"other","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"0b8d869b-38d2-4d86-bd07-7064c531b94e","name":"Main Site","isPublished":"Y","status":"S"}],"trainingProvider":{"id":"77a44b00-3386-4d3f-a293-db762df43a68","code":"24Y","name":"Victoria Academies Trust"},"accreditedBody":{"id":"c357e0fa-802e-471b-818a-d0cd1434f9cd","code":"B32","name":"University of Birmingham"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":9250,"feeDetails":"Visit Get into Teaching for more information about bursaries, scholarships and financial support for 2020/21.","aboutCourse":"Our School Direct training programme lasts for one academic year, starting in September 2020. During the training year, time is split between school based placements where you are immersed in school life to develop your teaching experience and structured taught sessions that focus on key educational theory and practice and develop your subject knowledge across the primary curriculum.\r\n\r\nAs a School Direct Trainee with Victoria Academies Trust, you will attend taught sessions at Birmingham University with a few additional twilight sessions taught by our own team of highly skilled, practising teachers. These additional sessions are based on pupil independence and our challenge based curriculum. They will be held within one of the Trust schools and often provide the opportunity to observe teaching in practice, in order to facilitate simulating and highly relevant training experiences and make immediate links between theory and practice.\r\n\r\nThe teaching commitment is built up over the training year during school placements, where you will be immersed in school life and supported by school-based practitioners who are experienced and skilled teachers within our schools.\r\n\r\nTrainees are assessed via evidence gathered during the teaching experiences, school-based tasks and formal assignments linked to key areas of teaching and learning.\r\n\r\nSuccessful completion of the course will result in QTS and PGDipEd.\r\n\r\n","interviewProcess":"We work in partnership with our accredited provider, the University of Birmingham, to co-ordinate the recruitment process. Where possible, interviews will be held at either Victoria Park Primary Academy or at one of the schools within Victoria Academies Trust. Please note as a result of current restrictions due to Covid-19, interviews are presently being held remotely. \r\n\r\nThe interview process involves a combination of tasks including:\r\n\r\n•\treading an educational article and discussing key themes at interview\r\n•\tplanning a short reading activity and discussing how you would deliver this in person\r\n•\ta formal interview with Senior Leaders from across the Trust\r\n•\tand a student panel interview\r\n\r\nThe rigorous selection process is designed to help us decide if you are suitable to train to teach and for you to assess whether teaching is the right career path for you.\r\n","howSchoolPlacementsWork":"School-based experiences are a central part of the programme. During your training year, you will  carry out two placements within the nine schools that form Victoria Academies Trust ensuring you gain experience in both key stage 1 and 2 and enabling you to teach within the 5-11 year-old age range.  Although all schools within Victoria Academies Trust have shared values, ethos and approach, you will find the schools very diverse, offering you a range of training experiences and preparing you well for life after training. \r\n\r\nJust some of the diverse differences across the schools within the Trust include; pupils with English as an additional language, schools with a social enterprise, a school with an autism base, schools with nurseries and without, small one-form entry schools to larger three-form entry schools.\r\n\r\nWe have a range of schools across the Midlands to suit the candidate's location where possible:   \r\n\r\n•\tVictoria Park Primary Academy (Smethwick)\r\n•\tDevonshire Infant Academy (Smethwick)\r\n•\tDevonshire Junior Academy (Smethwick)\r\n•\tNorthfield Manor Primary Academy (Northfield)\r\n•\tFibbersley Park Academy (Willenhall)\r\n•\tFoley Park Primary Academy (Kidderminster) \r\n•\tBirchen Coppice Primary Academy (Kidderminster)\r\n•\tRowley Park Primary Academy (Stafford)\r\n•\tPoppyfield Primary Academy (Cannock)\r\n\r\n\r\n","personalQualities":"We are looking for applicants who can demonstrate their:\r\n\r\n•\tMotivation and genuine passion for teaching and working with children \r\n•\tResilience and a strong commitment to the teaching profession and continued-self development \r\n•\tCreativity in order to enable pupils to develop into confident, enthusiastic and effective learners.\r\n•\tExcellent communication skills and strong subject knowledge\r\n\r\nWe want to offer places to trainees who align to our values which are: Loyalty – by putting family first\r\nTenacity – by insisting on excellence\r\nKindness – by doing good as you go\r\nCourage – by embracing innovation\r\nBrilliance – by seizing Success.\r\n","otherRequirements":"Before commencing the programme successful candidates will need to:\r\n\r\ncomplete an enhanced Disclosure and Barring Service (DBS) check.\r\ncomplete relevant checks to ensure they have the health and physical capacity to teach.\r\nagree to abide by the University of Birmingham Code of Professional Conduct and Fitness to Practise.","status":3,"createdAt":"2021-07-12T13:48:33.146Z","updatedAt":"2021-11-05T16:22:32.845Z","canSponsorStudentVisa":"yes","cycle":"2024","applicationsOpenDateOther":"2021-10-19T00:00:00.000Z"}
