{"id":"da5a0bf1-cd71-4b2b-a379-e6b57f69acf6","name":"Primary","code":"2GR8","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"175bfe3e-1d49-40b7-9601-22fb1998e218","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"f761c87d-497d-4b8e-9b11-2540e666f13f","code":"1YQ","name":"Northern Teacher Training Hub"},"accreditedBody":{"id":"99d7311e-6bc7-4ef3-a36b-72a3ff429155","code":"D87","name":"Durham SCITT"},"profPost":"PG","degreeGrade":"1","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feeDetails":"The fees for our school direct programme are £9,250, however there are a range of subject specific bursaries and funding, which may be available to help cover training fees and living costs","aboutCourse":"During your trainee year you will be allocated a mentor within school who will oversee and monitor your development, supporting you with planning, preparation and effective classroom strategies. You will be fully immersed into the life of the school, taking part in whole school events and encouraged to set up and lead your own extra curricula clubs and opportunities. \r\nThroughout your training year you will take part in school based sessions and workshops with fellow trainees to embed the key pedagogical strategies that underpin the work of successful teachers. Your subject mentor will support you with bespoke feedback and guidance that will help you to reflect on what you have learned and develop further your understanding of effective classroom practice. You will also be assigned a professional tutor within  Durham SCITT who will quality assure the programme on offer and act as a further source of professional advice. \r\n\r\nThe course is full time and runs from September until the end of June. The majority of that time will be spent in schools and classrooms, putting theory into practice through engaging with pupils and staff. \r\n\r\nDuring the first few weeks of the course, you will spend a substantial amount of time at professional study sessions based at the SCITT HUB in Sunderland at Benedict Biscop Church of England Academy. You will participate in an induction programme that will ensure you understand the key systems and processes and help you to feel confident and well equipped to teach. This space is also used to deliver professional study session throughout the year, as well as a private study area for trainees to access themselves when needed. Each school within our partnership also has study facilities which trainees can use within their own setting.\r\n*Cleadon Church of England Academy – South Tyneside\r\n*Fulwell Infant School Academy – Sunderland\r\n*Hart Primary School – Hartlepool\r\n*St John’s Church of England Aided Primary School – Durham\r\n*Richard Avenue Primary School – Sunderland\r\n*St Oswald’s Church of England Primary School – South Tyneside\r\n*St Paul’s Church of England Primary School – Sunderland\r\n*St Peter’s Elwick Church of England Primary School – Hartlepool\r\n\r\nOur SCITT Hub at Benedict Biscop Church of England Academy Sunderland, is strategically positioned one mile from the A19 ( A690 junction) and seven miles from the A1 motorway ( junction 62). \r\n\r\n","interviewProcess":"Upon success application process, your interview task will consist of a mixture of hands on tasks and a formal interview.","howSchoolPlacementsWork":"You will be allocated a home school placement based in either KS1 or KS2. You will be treated as a member of staff from the first day, joining in with the routines.\r\nAt least one of your placements will provide you with experience of the Early Years Foundation Stage. This will enhance and deepen understanding of how children learn. Our partnership of schools are all highly successful in their own right with excellent track records in developing teachers from training to headship.\r\n*Cleadon Church of England Academy – South Tyneside\r\n*Fulwell Infant School Academy – Sunderland\r\n*Hart Primary School – Hartlepool\r\n*St John’s Church of England Aided Primary School – Durham\r\n*Richard Avenue Primary School – Sunderland\r\n*St Oswald’s Church of England Primary School – South Tyneside\r\n*St Paul’s Church of England Primary School – Sunderland\r\n*St Peter’s Elwick Church of England Primary School – Hartlepool\r\n","personalQualities":"","otherRequirements":"References will be required in all cases, together with a well-written personal statement which explains why you want to be a teacher and what you could bring to the profession.\r\nWe encourage applicants to apply to our school volunteering programme or attend a school experience day, this offers potential applicants the chance to enhance their application together with the experience and knowledge required for attending interviews.","status":1,"createdAt":"2021-07-06T10:48:21.448Z","updatedAt":"2021-10-13T09:41:34.153Z","canSponsorStudentVisa":"no","cycle":"2024"}
