{"id":"dd9b4d98-1eeb-44b1-974c-f4d863e6de20","name":"Design and Technology","code":"2Y6G","qualification":"pgce_with_qts","startDate":"2023-07-31T23:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"118fabd7-86d0-4a40-9e9a-e5c302abe59b","code":"DT","name":"Design and technology"}],"locations":[{"id":"feb465f9-448b-44cc-9427-72676a79e6b5","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"ecc695c5-f842-4507-a160-2e979cc9abfe","code":"2BS","name":"SD at Turton"},"accreditedBody":{"id":"ec34b77c-cba3-4598-93be-23f0471adff1","code":"L51","name":"Liverpool John Moores University"},"profPost":"BO","degreeGrade":"1","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"financialSupport":"Hardship bursaries may be available for some students, depending on individual circumstances.\r\n\r\nA contribution towards travel to school placements may be made in some circumstances.\r\n","aboutCourse":"The Post Graduate Certificate in Education: Design and Technology programme, provides an intensive training experience, tightly focused on providing you with the skills, knowledge and attributes you will need when embarking on a teaching career. Based on training geared to meeting the Teaching Standards and Qualified Teacher Status, as a post graduate programme it also supports the development of a high degree of:\r\n\r\n*\tCritical understanding of education theory and practice relevant to the subject area\r\n*\tReflective practice linked to professional development\r\n*\tPractitioner research skills for effective teaching and learning\r\n*\tDeep understanding and application of subject knowledge\r\n\r\nProgramme Structure\r\n\r\nThe programme includes a mix of on-campus, (at Turton School), online learning, and school based training, with the latter becoming predominant as you progress through the course. The university element of the programme is based around modules focussing on:\r\n\r\n*\tProfessional Practice\r\n*\tDeveloping Reflective Professional Practice\r\n*\tSubject Pedagogy\r\n*\tSchool based training\r\n\r\nYou will spend at least 120 days in school based training, mostly in your “Home School” with a shorter 6 week placement in a complementary school. Whilst in school, your teaching will predominantly be at Key Stage 3 and 4, though you will also gain experience at post-16 level.\r\n\r\nExperienced Subject mentors, working in partnership with LJMU tutors, will support your training in the home school and the alternate placement school. The excellent relationships established between LJMU and partner schools will help to ensure that you have an inspirational and supportive placement experience.\r\n","interviewProcess":"Our preferred interview process will be a face to face taught session, interview and tasks.  The current situation may well change and if this is the case, you will  be invited to a Zoom interview.   You will be interviewed by a subject specialist and member of the SD at Turton team. Interviews usually take place within a week of your application being approved. We discuss placement schools at interview. \r\n\r\nThere are three stages to our interview and recruitment process including a written task, a taught session (lesson content will be communicated to you prior to interview) and a formal interview with a primary or secondary specialist and a member of the SD at Turton training team. \r\n\r\nWe want to give you the opportunity to showcase your commitment, knowledge and passion for teaching. We consider all aspects of the interview day and will inform you within couple of days if you have been successful. \r\n\r\nThe process is explained very clearly on our website: (schooldirect.turton.uk.com)\r\n","howSchoolPlacementsWork":"Our programme differs from other, more traditional teacher training routes in that you are placed in a home school for the majority of your training.  We discuss home school placements when you have accepted any offer we might make. \r\n\r\nYour school-based experience takes place largely in a Home School, supported by teachers invested in teacher education.  We have found that being in a Home School ensures that you are fully integrated into school life and get to know staff, pupils and your ITT Mentor extremely well, to the benefit of all involved.  A member of LJMU staff is attached to each school and is responsible for visiting regularly in order to support you and your mentor.\r\n\r\nAll trainees are entitled to weekly review and feedback meetings with their mentors and to tutorials with LJMU staff, ensuring that you are  supported from start to finish, personally and professionally.\r\n\r\nA 6 week placement will be undertaken in January  in a complementary setting.  The most striking difference is the university involvement.  Liverpool John Moores University deliver the academic programme on site, at Turton School, on Wednesdays.\r\n\r\nSchool based training involves the preparation and delivery of learning sequences and lessons to small groups and whole classes of learners, with expectations and workload increasing during the course.  This work is supported by your Initial Teacher Training Mentor who will support your professional learning experience in school.\r\n\r\nThe course is delivered through a variety of teaching methods including lectures, seminars, interactive workshops, group discussion and reflection, problem solving and micro-teaching.  We also make full use of the University’s Virtual Learning Environment.\r\n\r\nThis programme is tightly focussed on providing you with the skills and knowledge required.  Your Personal Tutor will meet with you to monitor progress, provide guidance and advice and set targets for your development.\r\n\r\nYour ITT Mentor will organise and supervise your school-based training and will in turn be supported by an LJMU Tutor who will visit school several times during the year to support you.\r\n\r\n\r\n","personalQualities":"We are looking for applicants who have a passion for Design Technology and wish to share their passion with young people. You should have a genuine belief that education transforms life chances and want to make a positive difference to young people and to their communities. \r\n\r\nWe want to work with committed people who want to develop a critical understanding of educational research, theory and practice.  \r\n\r\nAt interview we hope to see your enthusiasm along with evidence of some experiences which have informed your decision to become a teacher.","otherRequirements":"You will be required to meet the Department for Education’s standards for physical and mental fitness to teach and clearance to work with children. Further information, including a Declaration of Health questionnaire and details of how to apply for a Disclosure and Barring Service (DBS) Enhanced Disclosure will be sent to you after you have firmly accepted an offer.\r\n\r\nYour offer is conditional on completing ALL conditions of entry. These will be made available on UCAS.\r\n","status":1,"createdAt":"2021-07-06T10:51:42.987Z","updatedAt":"2021-10-01T11:58:56.079Z","canSponsorStudentVisa":"yes","cycle":"2024"}
