{"id":"820663ba-947b-4799-9f05-8e84dd90b6d7","name":"Primary","code":"V978","qualification":"qts","startDate":"2023-05-31T23:00:00.000Z","applicationsOpenDate":"other","programType":"TA","fundingType":"apprenticeship","studyMode":"F","ageRange":"3_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"a41124de-6737-4a92-a887-7474eba3e59b","name":"Okehampton Primary School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"529174aa-ece6-4d7c-a36c-8e96278631c1","code":"2BT","name":"Dartmoor Teacher Training Partnership"},"accreditedBody":{"id":"a4e84530-e1f1-47c6-b57e-ec693d629637","code":"P63","name":"Plymouth Marjon University"},"degreeGrade":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","aboutCourse":"Please note: The window for receiving applications will open on 15th November 2021.\r\n\r\n* Do you want to make a positive impact on the lives of children?\r\n\r\n* Will you support and challenge children to achieve their full potential?\r\n\r\n* Do you want to train with a Trust that prides itself on supporting and developing its staff?\r\n\r\n* Do you want the opportunity to gain practical experience in a diverse range of schools?\r\n\r\n* Do you want to make the best possible start to your career in teaching?\r\nIf the answer to these questions is ‘yes’ then read on!\r\n\r\nDartmoor Teacher Training Partnership is delighted to be offering the Postgraduate Teaching Apprenticeship for prospective primary teachers. Our course is delivered in partnership with Plymouth Marjon University.\r\n\r\nThis one-year apprenticeship commences on 27th June 2022 until 31st July 2023. This is a full-time employment-based route into teaching. Primary apprentices will be employed within one of Dartmoor Multi Academy Trust’s primary schools for the duration of the apprenticeship. \r\n\r\nPrimary apprentices will combine study with practical on-the-job training, whilst also receiving a salary. Apprentices will work towards the Apprenticeship Standard, which sets out the knowledge, skills, values and behaviours of the apprentice and Qualified Teacher Status (QTS).  Apprentices will need to successfully complete an end-point assessment as part of the apprenticeship. This is a QTS only course. There is no PGCE qualification. \r\n\r\nDuring the apprenticeship, apprentices will split their time between school and university study.  Primary apprentices will receive practical, school-led training alongside experienced staff and spend at least 20% of their time off-timetable to learn how to teach. Apprentices will also receive weekly support from their school-based mentor. As the apprenticeship year progresses, apprentices will build up to a 70% classroom teaching commitment. \r\n","interviewProcess":"Applications are reviewed by the Dartmoor Teacher Training Partnership. Applicants will be contacted by phone or email shortly after we receive an application to discuss interview arrangements.\r\n\r\nInterviews are conducted within one of the Dartmoor Multi-Academy Trust primary schools. The process usually consists of a panel interview, a teaching episode and other tasks designed to allow candidates to demonstrate their aptitude for teaching. \r\n","howSchoolPlacementsWork":"Our primary teaching apprenticeship places will be in Dartmoor Multi Academy Trust schools. Apprentices will need to be prepared to travel to any of our primary school locations and have the means of transport to do so.\r\n\r\nOver the course of the apprenticeship, primary apprentices will spend their time in a minimum of two of the Trust’s schools. The ‘main placement’ school will be the employing school and is the school where the apprentice will spend most of their time in. A mentor will be assigned to provide support.\r\n\r\nIn addition to the main placement, apprentices will also spend time (usually half a term) in different a school within the Trust. \r\n\r\nDepending on the age range that apprentices wish to specialise in, placements will provide experience in the following age ranges:\r\n\r\n*  3-7 age range\r\n\r\n*  5-11 age range \r\n\r\n","personalQualities":"* Recent and relevant experience of working with children in early years, key stage 1 or 2\r\n\r\n* Commitment to the highest standards of child protection\r\n\r\n* Considerable personal enthusiasm with a high level of integrity and professionalism  \r\n\r\n* A willingness to listen to and act upon feedback \r\n\r\n* Commitment to equal opportunities\r\n","otherRequirements":"Please note - our primary teaching apprenticeship places will be in Dartmoor Multi Academy Trust schools. Apprentices will need to be prepared to travel to any of our primary school locations and have the means of transport to do so. \r\n\r\nOther requirements:\r\n\r\n* Selection based on the information provided on the Teacher Training application\r\n\r\n* Selection based on a successful interview\r\n\r\n* Satisfy the DfE requirements with regards to fitness to teach\r\n\r\n* All relevant safer recruitment checks completed, including enhanced Disclosure and Barring Service (DBS) checks\r\n\r\n\r\n\r\n\r\n","status":1,"createdAt":"2021-09-20T10:18:17.714Z","updatedAt":"2021-09-20T12:12:17.565Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","applicationsOpenDateOther":"2021-11-15T00:00:00.000Z"}
