{"id":"a9c030d3-7824-4a0d-947e-308739a42de6","name":"Primary (5-11)","code":"AW48","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"a41124de-6737-4a92-a887-7474eba3e59b","name":"Okehampton Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"610d9f34-9762-4b5f-ba8c-25c7c5f52991","name":"Marine Academy Plymouth","isPublished":"N","status":"S","vacancies":"F"}],"trainingProvider":{"id":"529174aa-ece6-4d7c-a36c-8e96278631c1","code":"2BT","name":"Dartmoor Teacher Training Partnership"},"accreditedBody":{"id":"d41a1821-e35b-48eb-bf02-4842872b04a2","code":"E84","name":"University of Exeter"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":19500,"aboutCourse":"\r\n* Do you want to make a positive impact on the lives of children and young people?\r\n\r\n* Do you want to train with a Trust that prides itself on supporting and developing its staff?\r\n\r\n* Do you want the opportunity to gain practical experience in a range of diverse schools?\r\n\r\n* Do you want to make the best possible start to your career in teaching?\r\n\r\nIf the answer to these questions is ‘yes’ then read on!\r\n\r\nDartmoor Multi Academy Trust is pleased to lead the Dartmoor Teacher Training Partnership. \r\n\r\nOur School Direct Primary (5-11 age range) PGCE with QTS course is delivered through the University of Exeter Distance Learning Programme. \r\n\r\nOkehampton Primary is our lead school for the primary programme. \r\n\r\nOur primary education course is delivered by high experienced and knowledgeable primary teachers and specialists from Okehampton Primary and the wider partnership of schools in our Trust. \r\n\r\nWhat does the course look like?\r\n\r\n* Trainees will spend one day a week at Okehampton Primary, taking part in training workshops which model the principles of effective teaching and build on the University of Exeter programme. \r\n\r\n* Three days a week will be spent in your placement school, where you will be supported by a team of experienced teachers and gain first-hand teaching experience. \r\n\r\n* A fifth day will be allocated to completion of the PGCE element of the course, which is delivered by the University of Exeter through their online Distance Learning programme. This comprises of two 30 credit modules which are designed to develop your understanding of core issues in education. \r\n\r\nDuring the year, all trainees will spend time in two schools. We offer placements in a wide range of schools; including the 13 primary schools within the Dartmoor Multi Academy Trust. \r\n\r\nTo find out more about Okehampton Primary School click [HERE](http://www.okehampton-pri.devon.sch.uk/) \r\n","interviewProcess":"Applications are reviewed by the Dartmoor Teacher Training Partnership and the University of Exeter. Applicants will be contacted by phone or email shortly after we receive an application to discuss interview arrangements.\r\n\r\nInterviews are usually conducted at Okehampton Primary School. The 2-hour process consists of a panel interview, a teaching episode and a written task designed to allow candidates to demonstrate their aptitude for teaching. \r\n ","howSchoolPlacementsWork":"We aim to place trainees in schools across Dartmoor Multi Academy Trust or in one of the primary schools affiliated with Dartmoor Teacher Training Partnership. We are proud to offer a diverse range of placement options including large schools, small village schools and church schools. \r\n\r\n\r\nHow placements are decided:\r\nWe will aim to best accommodate the applicant’s preferences when allocating placement schools.  There are 14 primary schools within the Dartmoor Multi Academy Trust. We also work in partnership with other schools in the area. Although trainees are expected to travel to the schools with whom they have been matched, we endeavour to minimise travel distance where possible. \r\n\r\nPlacement Structure:\r\nSchool based training is an important part of our course. During the year you will work in 2 schools (a main placement and an ‘alternative placement’)\r\n\r\n* Main placement: September-December + March-June\r\n\r\n* Alternative 6-week placement: January-February \r\n\r\nPlacement Trainee Provision:\r\nDuring main and alternative placements, trainees will be allocated an experienced teacher to lead their training within the classroom. They will work alongside the teacher to plan, deliver and assess teaching and learning as well as gaining experience in all aspects of primary teaching. \r\n\r\nPlacement schools also provide a school-based mentor who will guide the trainee towards meeting the Teachers’ Standards.\r\n\r\nIn addition, Exeter University allocate a tutor to each trainee. The tutor visits trainees in school and provides support for the PGCE distance learning programme.   \r\n\r\nWe also provide trainees with the opportunity to experience secondary teaching in one of our secondary Trust schools. \r\n","personalQualities":"","otherRequirements":"Entry to the course is conditional on:\r\n\r\n* Graduate or equivalent status. An honours degree of 2:2 or above. Passes at GCSE in English, Mathematics and Science at grade C or above or equivalent (or for GCSEs taken from Summer 2017 onwards, grade 4 or above)\r\n\r\n* Selection based on the information provided on the Teacher Training application\r\n\r\n* Selection based on a successful interview\r\n\r\n* A medical report which is deemed satisfactory\r\n\r\n* Safer recruitment checks - A completed Disclosure & Barring Service (DBS) enhanced check which is deemed satisfactory by the University\r\n","status":1,"createdAt":"2021-07-06T10:50:33.567Z","updatedAt":"2021-07-12T14:54:02.714Z","canSponsorStudentVisa":"yes","cycle":"2024"}
