{"id":"454b25c4-fb88-4fa9-9a7b-e74599dbc106","name":"Primary","code":"F429","qualification":"pgce_with_qts","startDate":"2022-09-01T09:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"3_to_7","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"11ffd0dd-2636-4eec-b55d-04c98d13e1e6","name":"Main Site","isPublished":"true","status":"running","vacancies":"none"}],"trainingProvider":{"id":"8fc49e65-eafb-43b6-bb62-ac056f3325fa","code":"277","name":"Equate L.E.A.D. Academy Trust"},"accreditedBody":{"id":"8dfae1fb-865e-4906-a241-4e872f0388cc","code":"25G","name":"Lincolnshire SCITT"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"GCSEs at grade C/4 or above in English and Mathematics or equivalent for secondary trainees with the addition of grade C/4 or above in a science for primary trainees.","courseLength":"OneYear","aboutCourse":"AET will be working with Ark Teacher Training to deliver initial teacher education across the trust. \r\n\r\nOver the year you will have regular training sessions which are focused on how to be a great teacher of Biology. During these sessions, we will cover a range of teaching approaches to Biology and you will have the chance to share resources and ideas between your own school and other partner schools. By collaborating like this, all our teachers have great support, and all our pupils receive the best possible education.\r\n\r\nAs part of the course you will:\r\n\r\nHave a School orientation experience: before your course starts, spend time in your school meeting your new colleagues and interacting with pupils so you can hit the ground running in September.\r\n\r\nJoin a summer School: all new trainees come together over two weeks in August for an introduction to the programme, our schools and the principles of great teaching. You’ll also cover the essential elements of behaviour management, so you are ready for day one.\r\n\r\nHave weekly coaching and learning to plan: every week you’ll be observed by your in-school coach, so they can offer you positive feedback and bite-sized improvement targets.\r\n\r\nHave a trained lead planner will help you create effective lessons, developing your planning skills and giving you the opportunity to ask detailed subject -knowledge questions.\r\n\r\nAttend weekly training: in-person training sessions with your tutors/peers.\r\n","interviewProcess":"","howSchoolPlacementsWork":"Your training school - in London, will be matched to your particular profile as a candidate, while taking into account your commuting distance and funding/subject preferences (and availability on our programme, which changes as we move through the recruitment cycle).\r\n\r\nBecause of Covid-19 restrictions and pressures on schools regarding external visitors, you may not be able to visit your school before accepting an offer there. However, please be assured that schools are equally as keen to invite you to visit in person and will work with you to arrange this as soon as they can (most likely after your DBS check has been completed).\r\n\r\nThe training programme itself is 100% school-based, but you will come out of school to spend a half day every week in a session with your Ark tutor and other trainees from the network.\r\n\r\nYou’ll also obtain experience in different schools throughout the year; you will have a three week placement in a different school to your own, and will also have the opportunity to visit other educational settings.","status":1,"createdAt":"2022-01-21T14:49:23.326Z","updatedAt":"2022-01-25T13:59:26.908Z"}