{"id":"781686f3-5071-400a-a630-9feda2844697","name":"Biology","code":"2PG2","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"322cfc19-d51d-45db-91e3-bd7b4738470f","code":"C1","name":"Biology"}],"locations":[{"id":"3e952569-9632-4b5d-997b-0a9907ef59bb","name":"The Grange Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"2d82a240-7ea8-47f5-8e29-607e175d687c","name":"Hillside High School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"9eb9b8d6-ad84-4e07-a83d-5c26a493003b","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"e4e2c0ab-04a5-483c-be62-ecd763da90da","code":"1KQ","name":"Wade Deacon Trust"},"accreditedBody":{"id":"e843cb68-d310-478c-8dba-cf9633fea086","code":"C55","name":"University of Chester"},"profPost":"BO","degreeGrade":"0","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"financialSupport":"Fees for School Direct are £9,250.00. However, many subjects offer bursaries to cover/ help towards these fees.\r\n\r\nWhen released, the 2020/21 bursaries will be published here: https://getintoteaching.education.gov.uk/funding-my-teacher-training/bursaries-and-scholarships-for-teacher-training\r\n\r\n\r\n\r\n","aboutCourse":"The School Direct programme offers a unique 'hands on' teacher training opportunity. All of your training will take place within a school, with the exception of a number of days at an affiliated university. \r\n\r\nYou will spend the majority of your time at the designated training campus developing your teaching skills, together with approximately half a term working at a different/ alternative school to your ‘home school’, in order to widen your experience in a classroom setting, and make you more employable. Alongside this schedule, you will gain short blocks of experience at setting both before and area the age range you are training in, and a Special Educational Needs school*. These varying training opportunities will provide you with enhanced teaching experience across different demographics and academic abilities. \r\n\r\nOn average you will spend one day a week in a University/ Discussion-based setting, where you will focus on different teaching strategies including theory, planning aspects etc. The 'hands on' element of the School Direct programme offers invaluable experiences for you to develop successful and innovative teaching skills. \r\n\r\nThe duration of the School Direct programme is for one academic year (Sept to July). Throughout the academic year you will be assessed at four main review points, when your teaching practise will be reviewed and you will present evidence to demonstrate how you have addressed each of the Teachers' Standards. Alongside this you will be set M-level assignments from our University partner, enabling you to demonstrate your ability to reflect on current teaching theories alongside your own practise. \r\n\r\n*Please be aware that trainees will be expected to arrange their own transport to different placements. \r\n\r\n","interviewProcess":"How we select our Associate Teachers:\r\n\r\nApplication forms are carefully screened to select applicants for interview. Schools will consider experience, academic qualifications including predictions, personal qualities and suitability for teaching. Additional interests and experiences will also be taken into account when selecting potential trainees. \r\n\r\nSelected applicants will be invited to attend an interview. Offers of places cannot be made until an interview has taken place. If an applicant cannot attend the specified interview date, an alternative date may be given, subject to places remaining available. \r\n\r\nInterview Process\r\nIf invited to interview, applicants will be asked to complete a range of tasks, including: \r\n\r\n        *Planning and delivering/explaining a teaching episode with a small \r\n          group of pupils or the interview panel if the interview takes place on \r\n          line\r\n        *Formal panel interview and presentation \r\n        *Literacy/ Numeracy test\r\n\r\n\r\n","howSchoolPlacementsWork":"When you apply for a training position with us, via UCAS, you should state the school which you wish to be placed in (your Home School/ Campus). You will then be interviewed by members of the School Direct training team, plus representatives of the school you wish to be placed in. If successful, you will spend the majority of your School Based Learning days at the school you have requested. However, it is a requirement of the course, that you spend 30 days (6 weeks) in a contrasting placement.\r\n\r\nThe six week alternative placement will be organised by the Teaching School.  Consideration will be given to travel/distance etc., and will ensure that you experience a different type of school setting, i.e. A faith school; A school with a contrasting Ofsted report to your home school; different demographic of pupils etc. This will ensure that you are not only more employable, but will help you to decide exactly what type/ area of school you wish to work in.\r\n","personalQualities":"We would expect all of our trainees to: \r\n* Be creative, enthusiastic and able to work in a team \r\n* Have a passion for your subject, and be committed to delivering this in the classroom \r\n* Possess exceptional organisational skills \r\n* Have the ability to reflect on practice and a drive to develop as a teacher \r\n* Have communication skills. Applicants must be able to demonstrate that they are able to communicate clearly and grammatically in spoken and written English. \r\n\r\nApplicants should also demonstrate an experience of and commitment to working with young people. \r\n","otherRequirements":"We are looking for enthusiastic and committed professionals willing and able to take responsibility for their personal professional development.  \r\n\r\nApplicants should indicate any additional experiences, hobbies or interests appropriate to the role of the teacher.","status":1,"createdAt":"2021-07-06T10:50:34.463Z","updatedAt":"2021-07-12T14:08:43.884Z","canSponsorStudentVisa":"yes","cycle":"2024"}
