{"id":"b9dca780-2be2-44f8-98da-7fd3584bfcc9","name":"Religious Education","code":"2XRT","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"724b5d16-28dd-4431-bc17-ea4be4daedc4","code":"V6","name":"Religious education"}],"locations":[{"id":"2a0ab0ab-4b1b-40ec-8d82-fa2ff6a55a32","name":"Sir Christopher Hatton Academy","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"4be7f6ce-ffa0-46a5-811c-90a464710fb2","code":"1Y7","name":"Hatton Centre for Education"},"accreditedBody":{"id":"3e6c62a3-5d34-4a91-9c23-01c7409fd909","code":"L34","name":"University of Leicester"},"profPost":"BO","degreeGrade":"0","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Student teachers within the Religious Education, Geography and History subject specialisms are taught as a PGCE Humanities group. \r\n\r\nYou will have specialist inputs on your chosen subject and also gain experience of issues in planning and teaching cross-curricular work within the Humanities. Your two school placements are in your specialist subjects.\r\n\r\nReligious Education is an exciting and relevant subject which plays a major role in helping children to contribute to a cohesive and compassionate society.\r\n\r\nThe PGCE programme is both challenging and rewarding and we hope that it will develop both your enthusiasm and confidence as a teacher and Religious Education specialist.\r\n\r\nPCGE Secondary Religious Education aims to:\r\n * Support students to extend and deepen their subject knowledge of Religious Education:\r\n\r\n * Expose students to a wide range of strategies for teaching and learning and assessment in Religious Education;\r\n * Support students in exploring the use of ICT in Religious Education teaching and learning, including Internet resources and services and Blackboard as integral parts of the course; and\r\n * Support students to individualise their learning on the course as competent and committed professionals.\r\n\r\nThe Religious Education subject specialism will cover a variety of areas including:\r\n * The meaning and purpose of Religious Education;\r\n * Teaching RE at KS3, GCSE and A Level;\r\n * The possibilities, opportunities and limitations in the implementation of the non-statutory National Curriculum Framework for Religious Education;\r\n * Assessment in Religious Education;\r\n * Learning about and learning from religion;\r\n * Teaching religion in a diverse community;\r\n * Social, moral, spiritual and cultural development;\r\n * Holocaust Education;\r\n * Emotive and controversial issues;\r\n * Curriculum Design; and\r\n * Personal, Social and Health Education.\r\n\r\nContinuous assessment is used throughout the course and there are no examinations.\r\n\r\nApplications are welcome from students with an Upper Second (although 2:2 will be considered) in a RE-related degree such as Religious Studies, Theology, Philosophy or in a closely related discipline.\r\n\r\nThose students with joint or combined honours degrees in relevant subjects are also welcome to apply e.g. Arts/Humanities, Law, Sociology or Social Anthropology where a significant amount of time was spent studying religion in other contexts.\r\n\r\nA good A level pass in Religious Studies would also be beneficial and students should be able to demonstrate a genuine interest in and enthusiasm for Religious Education at interview.\r\n","interviewProcess":"If invited for interview, you will take part in a two-step process.  Firstly, you will meet with the Professional Tutor for the Hatton Teaching School Alliance and will carry out a range of activities including a micro-teaching experience, a literacy task, a panel interview and you will give a presentation considering your motivation to become a teacher. This is subject to change, to keep up with Covid precautions.\r\n\r\nIf successful in this first step you will then meet members of the university course team who will give an overview of the course and answer any questions you may have.\r\n\r\nYou will participate in a group task with candidates from a range of subjects and give a brief presentation as part of a small group.\r\nSubject tutors will introduce a written subject task that you will complete during the day and you will have an individual interview with a subject tutor. The interview is not a daunting process but rather a discussion about your suitability and preparation for going into teaching. During the interview, you will explore any additional preparation needed to help put you in the best possible position to engage successfully with the course from the start.\r\n","howSchoolPlacementsWork":"You will undertake two secondary teaching placements in our Partnership Schools. We try to place students in contrasting schools to ensure you have a rich and varied experience in your initial training year and that you have the opportunity to teach across the 11-18 age range.\r\nThe placements are referred to as 'Phase A' and 'Phase B' placements.\r\n\r\nIn planning your placements, your subject tutor will try to balance the distance you are asked to travel with your individual needs and our knowledge of our wide range of school partners.\r\n\r\nPhase A:\r\nAfter induction you will spend 8 weeks in your Phase A placement school. You will build on existing experience and develop new skills with support from the school's Coordinator for Initial Teacher Education and a subject mentor who will oversee your professional development during the placement and liaise closely with your university tutor who will also support you. During this placement you will be expected to fulfil a 50% timetable.\r\n\r\nPhase B:\r\nDuring your second placement you will spend about 14 weeks in a different school, also supported by a mentor, ITE Coordinator and university tutor. During this placement you will be expected to fulfil a 66% timetable.\r\n\r\nAll students will also undertake a week in a primary school following their Phase A placement to support their understanding of the broader context of education and to support writing of one of the PGCE assignments.\r\n","personalQualities":"You should be able to demonstrate genuine interest and enthusiasm for Religions Studies at interview.\r\n\r\nWe recommend that all prospective students have spent some days observing, possibly assisting, learners and teachers in Humanities departments/classrooms to familiarise themselves with current developments.\r\n\r\nThe PGCE is a challenging course, and we are looking for applicants with a wide range of skills, knowledge, experiences and an aptitude for teaching. These skills include the ability to form relationships, good communication, commitment to learning and teaching and reflective qualities.\r\n","otherRequirements":"Admission to the course is subject to a satisfactory medical report. The University will provide more information about this should you be offered a place.\r\nAll offers are subject to a satisfactory enhanced DBS disclosure. We will provide instructions regarding the DBS application process once you have accepted an offer of a place on the course.\r\n","status":1,"createdAt":"2021-07-06T10:47:12.748Z","updatedAt":"2021-09-13T09:39:22.914Z","canSponsorStudentVisa":"yes","cycle":"2024"}
