{"id":"f026ea8e-0eb5-42ba-9ee9-32a829383f3b","name":"Primary","code":"2GZK","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"2a0ab0ab-4b1b-40ec-8d82-fa2ff6a55a32","name":"Sir Christopher Hatton Academy","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"4be7f6ce-ffa0-46a5-811c-90a464710fb2","code":"1Y7","name":"Hatton Centre for Education"},"accreditedBody":{"id":"3e6c62a3-5d34-4a91-9c23-01c7409fd909","code":"L34","name":"University of Leicester"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Our PGCE Primary has been running for over 60 years and schools tell us we are developing the kind of teachers they want to employ. This is reflected in 98% of our students achieving Good or Outstanding teacher grades at the end of their course and 95% of our graduates securing a teaching post by the end of the course.\r\n\r\nTutors on the Primary PGCE course all have extensive experience as classroom teachers and are specialists in a wide range of educational areas. These strengths are recognised within the Primary PGCE course, both in the specialist course options offered, and through the expert contributions to all strands of the course.\r\n\r\nYou will be required to select a Specialism Subject at the beginning of your PGCE. These may include, Mathematics, Early Years, Science, English and Inclusion (subject to availability).\r\nIf you choose Primary (5-11), your placements will be in Key Stage One, Lower Key Stage Two and Upper Key Stage Two.\r\n\r\nThe course comprises of three strands and school placements:\r\n * Curriculum Studies - Core and Broader Curriculum\r\n * Professional Studies\r\n * Academic Strand including Specialist Study\r\n\r\nTeaching Experience in primary schools. \r\nThese placements will be in contrasting schools to provide you with a broad range of experience.\r\n\r\nTeaching approaches are varied; whole-course lectures, taught sessions in tutor groups, some work in focus schools and individual tutorials. Some of these sessions will be taught in differentiated groups, with specialist Primary and Lower Primary based sessions and small group subject support sessions.\r\n\r\nThe PGCE Primary course prepares you to teach across the full range of the Primary Curriculum. We will introduce you to the wider context of teaching, including responding to diversity in schools and the inclusion of Special Needs Education, as well as equipping you with classroom management and planning skills.\r\n\r\nBy the end of the course you will meet the required professional standards for Qualified Teachers Status (QTS) and will be awarded a University of Leicester PGCE. You will also have 90 credits towards a Masters Degree. Our strong ethos of reflective practice will prepare you well for your future career in teaching.\r\n","interviewProcess":"If invited for interview, you will take part in a two-step process.  Firstly, you will meet with the Professional Tutor for the Hatton Centre of Education and will carry out a range of activities including a micro-teaching experience, a literacy task, a panel interview and you will give a presentation considering your motivation to become a teacher. This is subject to change, to keep up with Covid precautions.\r\n\r\nIf successful in this first step you will then meet members of the Primary PGCE Team who will give an overview of the course and answer any questions you may have.\r\n\r\nYou will participate in a group task with candidates and will lead a brief group discussion on one of the topics you will have been sent prior to the interview. You will also carry out written tasks in English and Maths.\r\nDuring the afternoon you will be interviewed by either a member of the Primary PGCE team or one of our school-based colleagues. The interview is not a daunting process but rather a discussion about your suitability and preparation for going into teaching.\r\n\r\nIf you are successful on the selection day, you may be given some targets to work on, prior to starting the course. These will help you to be in the best possible position to engage successfully with the course from the start.\r\n","howSchoolPlacementsWork":"You will be placed in three Partnership schools. Primary students (specialising in the 5-11 age range) are placed in a range of KS1 and KS2 classes, and Lower Primary students (specialising in the 3-7 age range) work in Key Stage 1 and Foundation Stage settings.\r\n\r\nIn addition to the three block teaching placements you will also visit different schools as part of a series of 'focus days', studying specific subject and professional topics in an intensive school-based context.\r\n\r\nThe school-based time is a vitally important element of the course. You will have the opportunity to observe skilled class teachers working and to discuss the things that underpin day-to-day classroom activities, as well as work alongside experienced teacher-mentors who will support your learning about classroom practice.\r\n\r\nTeaching Experience 1\r\nThis is a six-week placement in one class. You will focus on developing observation skills to support your understanding of teaching and learning and to put your learning into practice. During this Autumn Term placement you will work towards taking an increased responsibility for teaching the class.\r\n\r\nTeaching Experience 2\r\nThis takes place in the Spring Term and lasts for seven weeks. The amount of time spent teaching the class increases over the placement until you have responsibility for up to 80% of the timetable.\r\n\r\nTeaching Experience 3\r\nThis is another seven-week placement in the Summer Term with students working towards taking responsibility for 80% of the teaching timetable.\r\nThroughout each of these placements you will be encouraged to participate fully in the life of the school and to take full advantage of the tasks and activities designed by your tutors to support your development.\r\nIt is expected that through your three placements you will gain experience across the age range that you are training to teach.\r\n","personalQualities":"Primary (5-11) is a very demanding course and we are looking for applicants with a wide range of skills, knowledge, experience and aptitude.\r\n\r\nOur key selection criteria are:\r\n * Ability to form relationships\r\n * Good communication skills\r\n * Commitment to teaching\r\n * An awareness of the role of the teacher and the demands of the profession\r\n * Reflective qualities\r\n * Emotional resilience\r\n * Awareness of contemporary issues in education\r\n","otherRequirements":"Admission to the course is subject to a satisfactory medical report. The University will provide more information about this should you be offered a place.\r\n\r\nAll offers are subject to a satisfactory enhanced DBS disclosure. We will provide instructions regarding the DBS application process once you have accepted an offer of a place on the course.\r\n\r\nYou must have a GCSE Grade 4 (Old Grade) C in English Language.\r\n","status":1,"createdAt":"2021-07-06T10:47:12.501Z","updatedAt":"2021-09-13T09:38:06.855Z","canSponsorStudentVisa":"yes","cycle":"2024"}
