{"id":"25ed2cec-f5c9-4640-b2bb-195805195aab","name":"English","code":"2Z8N","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3aed1aa8-ae46-4b68-92bb-a6cc20655c59","code":"Q3","name":"English"}],"locations":[{"id":"23ca8f57-6b73-4837-a9ba-9500197dc3a0","name":"Main Site Hope Academy","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"3d474c90-bb57-4736-9292-817062831717","code":"1LA","name":"Aspirational Teaching Alliance of St. Helens"},"accreditedBody":{"id":"e328aab3-a535-4921-8ded-5e37133c76dd","code":"L46","name":"Liverpool Hope University"},"profPost":"BO","degreeGrade":"1","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"The Secondary Schools Direct programme will support students to consider the pedagogy of their chosen subject specialism in depth. This course aims to develop and integrate subject pedagogy and theory with classroom practice and equip student teachers with the skills necessary to become reflective and effective teachers of their chosen subject across the 11-18 age range.\r\nThe Aspirational Teaching Alliance of St Helens works in affiliation with the Postgraduate Certificate in Education (PGCE) courses at Liverpool Hope. These offer students the opportunity to combine a programme of theory with real world experience. The initial professional development focuses on what underpins the work of an effective and successful teacher, while school placements offer you the opportunity to put theory into practice. \r\n","interviewProcess":"You will be interviewed by School Leaders representing the Aspirational Teaching Alliance. Interview panels will include subject specialist teachers from our 10 St Helens Partnership Schools, as well as colleagues from Teacher Training routes at Liverpool Hope University.  Applicants inviting to interview will attend one recruitment day. This will include a literacy and numeracy test. ","howSchoolPlacementsWork":"Successful candidates are selected based on the strength of their applications and interview. All of our home and away placement schools are based within the St Helen’s Local Authority.  There is an opportunity to be based in both 11-16 schools and those with a sixth form provision 11-18. The Aspirational Teaching Alliance is partnered with 10 St Helen’s schools.  Successful candidates will be assigned two school placements. One will be a home placement school and an additional six week away placement. ","status":1,"createdAt":"2021-07-06T10:55:56.676Z","updatedAt":"2021-09-16T11:26:46.442Z","canSponsorStudentVisa":"no","cycle":"2024"}
