{"id":"dde03ed4-ab26-4bcd-8aca-594e6519aff2","name":"Primary","code":"25R5","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"5a96de88-64a4-47d1-a4e6-365ae6731cea","name":"Oasis Academy Greater Manchester Hub","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"7cb26c78-f71a-4cfb-8823-f8a8c2eff488","code":"1A2","name":"Oasis Innovation"},"accreditedBody":{"id":"9d03acb4-95ce-41e1-8458-0b4bec147b6b","code":"M20","name":"The University of Manchester"},"profPost":"PG","degreeGrade":"0","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":18500,"aboutCourse":"Our team is committed and promises to provide trainees with: \r\n* A PGCE with Masters credits from the University of Manchester as well as Qualified Teacher Status; high quality school based training within a range of primary schools combined with on campus study and quality assurance from the University of Manchester; and exceptional professional learning opportunities from across our teaching school alliance \r\n* A breadth of continuous professional development and strategic placements to meet personal needs; excellent online professional studies education; and a range of experiences within a nurturing environment, quality assured throughout \r\n* A guaranteed interview for employment as well as the opportunity to go into our NQT recruitment pool. ","interviewProcess":"Assessment days will take place at regular intervals starting late October. The interview process will normally take place in the lead school or online. You will be expected to complete a short presentation and undertake a formal interview. \r\n\r\nIn instances where interviews need to be conducted remotely, we will make arrangements with applicants well in advance of the interview date.","howSchoolPlacementsWork":"We want you to gain a well-rounded experience of teaching across more than one setting. We have carefully selected partner schools to join our training hub, with each one offering something unique. We offer placements across Oldham and Greater Manchester and our schools are diverse – a mixture of small and larger primary schools serving a range of different local communities and contexts. Our schools do have two things in common – all are committed to providing a first class education for their pupils and all are looking forward to recruiting inspiring new teachers who are bright, passionate and ambitious.","personalQualities":"We are looking for people who have the energy and determination to make a difference for our pupils. You will have bright ideas, great communication skills and a desire to innovate. You'll combine a strong work ethic with warmth, empathy and humility. A sense of humour is essential in this fast paced profession. You will need to be a good team player, ready to share ideas and to take advice. You'll have to be resilient. In short, you'll need to be someone special enough to inspire our pupils. ","otherRequirements":"Applicants must meet the Department for Education's requirements for Initial Teacher Training, which includes having the health and physical capacity to train to teach and successfully completing an enhanced disclosure via the Disclosure and Barring Service (DBS). ","status":1,"createdAt":"2021-07-06T10:47:45.532Z","updatedAt":"2021-10-20T09:41:55.149Z","canSponsorStudentVisa":"yes","cycle":"2024"}
