{"id":"7ab7690c-18ed-47ed-93e6-cf52067099b6","name":"Modern Languages","code":"39N5","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"4608e5e3-2a1a-48a1-8236-56c7af5a139d","code":"24","name":"Modern languages (other)"},{"id":"ce8523ef-9236-4cd9-b260-d826c7a521b3","code":"ML","name":"Modern Languages"}],"locations":[{"id":"fe05b6d1-fb06-46e9-a767-36220ea114ab","name":"Ribblesdale High School","isPublished":"Y","status":"S"},{"id":"46f35ec9-2c64-4591-9861-db46765ae6e2","name":"Marsden Heights Community College","isPublished":"Y","status":"S"},{"id":"964697d6-f58f-41f2-af73-f324b52375c7","name":"The Hollins","isPublished":"Y","status":"S"}],"trainingProvider":{"id":"32dccb00-6a89-4381-84b8-d8d1eec992e0","code":"2KB","name":"East Lancashire School Direct"},"accreditedBody":{"id":"76c55af9-5232-41bd-a308-9fc5a4270cdd","code":"P38","name":"Pennine Lancashire SCITT"},"profPost":"PF","degreeGrade":"9","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9000,"aboutCourse":"This is an exciting new course, you will spend time either here at The Hollins or in one of our 22 schools who form part of the East Lancashire Teaching School Alliance.  Our programme is accredited by the Pennine Lancashire SCITT.\r\n\r\nThe course will provide you with  critical understanding of education theory and practice relevant to Modern Foreign Languages:\r\n\r\nYou will become a reflective practitioner \r\ndevelop a deep understanding and application of subject knowledge\r\nunderstand how to assess this subject and curriculum developments that are taking place in key stages 3-5\r\n\r\nAssessment\r\n\r\nYou will be assessed both in school through observations of your practice as a teacher and are assessed against  the Teaching Standards required for QTS  through the development of a portfolio of evidence from your placements.\r\nThe PGCE academic assignments  support the professional development you are engaged in during the school based element of the training. \r\nComprising of  essays;  evaluations of school-based teaching and learning and presentations. They will support you to link your practical experience and  reflections to educational theory to ensure your students outcomes are the best they can be.\r\n\r\nSupport\r\n\r\nIn school, you will have a subject coach and a Professional Mentor who will support you to make outstanding progress through timetabled coaching sessions. \r\nThrough the PLSCITT you will be supported to develop your pedagogic understanding and your classroom practice.\r\nBy being part of The East Lancashire teaching School Alliance you will be able to engage in any of the ELTSA CPD programmes and subject networks that take place throughout the year and will have the opportunity to work with trainees across other subjects, key stages and settings.\r\nEnrichment\r\n\r\nTrainees are expected to take advantage of  a variety of enrichment opportunities that will challenge and extend their skills and enhance employment potential. Such activities may include Duke Of Edinburgh, after school clubs, educational trips and visits and being part of the pastoral team.\r\n","interviewProcess":"Interviews will usually take place within a week of your application being approved.\r\nThere are three stages to this process including a written task, a 20 minute taster lesson and a panel interview with a subject coach and a professional mentor. The interview is an opportunity for you to show us your enthusiasm and passion for teaching..\r\nAll aspects of the interview day are considered  and will you will be informed within a week if you have been successful.\r\nAs the lead school of the East Lancashire teaching School Alliance we have a range of placement schools across the locality.\r\nFor more information visit http://eastlancstsa.co.uk/eltsa-school-direct/\r\nThe UCAS website is also a great source of general information and there are some useful short films available on this site where advice is given around personal statements and preparing for interview.\r\n","howSchoolPlacementsWork":"On an ELTSA School Direct programme  you are placed in 2 schools during the year. These schools are all members of the East Lancashire Teaching School Alliance.\r\n\r\nYour time in school is  supported by a subject coach and a professional mentor. Being in School from the beginning ensures that you are fully integrated into school life and become a part of the school community.  A member of PLSCITT  is attached to each school and is responsible for quality assuring your training and is on hand for any additional support you may need.\r\n\r\nAll trainees are part of the ELTSA family and are free to take part in ELTSA subject networks and ELTSA CPD,\r\n\r\nYour second placement runs from February to June, this ensures you are fully integrated into two different schools and experience different t classes and teaching styles.\r\n\r\nSchool based training involves the preparation and delivery of learning sequences and lessons to small groups and whole classes of learners, with expectations and workload increasing during the course. This work is supported by your subject coach and your professional mentor.\r\nThe course is delivered through a number of methods including workshops, lectures, seminars, group discussion and reflection, problem solving and micro-teaching.  You will also join ELTSA ITT trainees at ITT conferences held 3 times a year looking at safeguarding, behaviour and SEND.\r\n\r\nThis School Direct programme will help you develop the skills and expertise needed to be an outstanding practitioner","personalQualities":"We are looking for applicants who have a real passion for being in the classroom and who want to share their love of  for Art and Design with our students.  \r\nYou will be passionate about your subject, dedicated to developing your craft and have the children in east Lancashire at the centre of your decision making.  We want teachers who are willing to go the extra mile to make a difference to our students lives. \r\n","otherRequirements":"\r\nYou will also be required to meet the Department for Education’s standards for physical and mental fitness to teach and clearance to work with children. Further information, including a Declaration of Health questionnaire and details of how to apply for a Disclosure and Barring Service (DBS) Enhanced Disclosure will be sent to you after you have firmly accepted an offer.\r\nYour offer is conditional on completing ALL conditions of entry. These will be made available on UCAS.\r\n","status":1,"createdAt":"2021-07-06T10:54:17.854Z","updatedAt":"2021-08-24T09:27:32.343Z","canSponsorStudentVisa":"no","cycle":"2024"}
