{"id":"fb06723c-0bfc-4bc9-958f-87b2f0df85fd","name":"Computing","code":"3DND","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"e6be6a9c-8696-4b88-8fbd-1ba1bef1b6fc","code":"11","name":"Computing"}],"locations":[{"id":"26ca8c54-e452-415d-82c1-1b1f4bc8c877","name":"Main Site","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"657a85c5-8835-405a-99f7-6c45e87f77bc","code":"1X7","name":"Compton SCITT"},"profPost":"BO","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feesInternational":9250,"aboutCourse":"Our course is entirely school centred providing classroom based, practical training, underpinned by a weekly educational studies programme leading to Qualified Teacher Status (QTS). In addition, trainees may opt in to gaining a Postgraduate Certificate in Education (PGCE) with University of Cumbria. The course is full time over 38 weeks (term time only). Trainees will receive an immersive training programme where they are working alongside outstanding teachers with current and relevant experience.\r\n\r\nTrainees receive structured classroom observations, weekly professional studies sessions and a phased introduction to small group teaching, team teaching and then whole class teaching.\r\n\r\nWe are very proud that we can also label our training as Outstanding, since our successful Ofsted inspection in 2017.\r\n\r\nTrainees will be assessed across the academic year against the ITT Core Content Framework within a supportive and developmental model. Experienced subject mentors facilitate bespoke weekly targets to ensure all Teachers' Standards are met by the end of the course. \r\n\r\nThere are 4 reflection pieces set over the training year. These are research based learning tasks embedded in the realities of the modern classroom. Current academic research and reading underpin all professional studies sessions and assignments.\r\n\r\nThe Compton SCITT Partnership is committed to the wellbeing of trainee teachers. We are aware that an ITT year will be demanding and therefore have a variety of mechanisms in place including a designated pastoral lead. \"Somehow you’ve struck a happy medium between the checkbox requirements of government legislation and the true humanity that underpins teaching.\" (Outstanding English trainee, 2017).\r\n","interviewProcess":"Applicants will be invited for interview on the basis of information provided on their application form. All SCITT Training Route trainees will be interviewed at The Compton School. School Direct trainees will be interviewed at their chosen base school.\r\n\r\nThe interview will typically involve a half-day at the school. This will include a 20 minute lesson observation and a numeracy and literacy assessment. Candidates will be told in advance about the content of the lesson and the age range you will be teaching.\r\n\r\nCandidates will be observed teaching by a member of our senior staff and a subject specialist. If successful in the first part of the interview candidates will then be invited to the final panel interview including the Headteacher.\r\n\r\nThe interview process is rigorous and thorough, designed to get the best match of applicant to the places available.\r\n","howSchoolPlacementsWork":"The course is full time over 38 weeks (term time only). Trainees will receive an immersive training programme where they are working alongside outstanding teachers with current and relevant experience.\r\n\r\nTrainees will be placed in one school for the entire academic year with a 6-week second placement at a contrasting partner school arranged by the SCITT Leadership Team. At interview trainees will be informed of potential placement schools. Training Route trainees will be placed at one of our local partner schools at the end of the recruitment cycle. School Direct trainees choose their base school at the application stage.\r\n\r\nAll partner schools are graded either Good or Outstanding by Ofsted. Partner schools are based locally to The Compton School in North London and are easily accessible by public transport. All partner schools have experienced subject mentors and professional tutors who are committed to high expectations of the SCITT Partnership. Compton SCITT trainees enjoy being part of a vibrant professional community across all partnership schools.\r\n\r\nTrainees will be awarded Secondary QTS (11-16) and have the option to take on a PGCE with University of Cumbria however, all partner schools ensure trainees have the opportunity to teach A-Level classes in preparation for their NQT year.\r\n\r\nWeekly professional studies training sessions will be held at The Compton School on a Monday, with trainees at their base school from Tuesday-Friday.\r\n","personalQualities":"Applicants must provide evidence of an interest in working with young people, possess high quality communication skills. Speak fluently, clearly and grammatically. Be able to think analytically and possess personal qualities such as warmth, enthusiasm, self-motivation and resilience.","otherRequirements":"","status":2,"createdAt":"2021-07-06T10:52:17.045Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
