{"id":"53b8d803-d31b-4a67-b2cd-694be6c6c88a","name":"Design and Technology (Product Design)","code":"37T4","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"118fabd7-86d0-4a40-9e9a-e5c302abe59b","code":"DT","name":"Design and technology"}],"locations":[{"id":"d7fc56e3-743d-48ae-be3e-f7d12f5b76ef","name":"Sidney Stringer Academy","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"cf53a0d4-4e3d-43e1-909e-999bc42a4bbf","code":"2A7","name":"The Coventry SCITT"},"accreditedBody":{"id":"cf53a0d4-4e3d-43e1-909e-999bc42a4bbf","code":"2A7","name":"The Coventry SCITT"},"profPost":"PG","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"must be a bachelor degree with honours","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"financialSupport":"Advice from Get Into Teaching\r\nFinancial support from the government\r\nYou may be eligible for a loan while you study – note that you’ll have to apply for undergraduate student finance.\r\n\r\nFind out about financial support if you’re from outside the UK.\r\nhttps://getintoteaching.education.gov.uk/","aboutCourse":"We offer a one year, full-time, school based training route. You will achieve QTS and be enrolled with Coventry University for the award of PGCE. You will spend your training year in your host school with additional training taking place at our centre based conference rooms or in one of our partner school located in Coventry. \r\nIn addition, you will complete a second placement in a contrasting school. Assessment will continue throughout the course, based on your classroom experience and achievement measured against the DfE Teaching Standards, while your academic PGCE study will be delivered in house by The Coventry SCITT and will comprise of four modules throughout the training year.\r\n\r\nIn school you will work closely with a subject / phase specific mentor and the professional mentor, who will meet regularly with you to assist you with your training plan. You will also have monitoring and assessment visits from the The Coventry SCITT who will visit you in school 5 times in the year to check on your progress towards meeting the Teachers’ Standards.\r\n\r\nTrainees will have access to an online e-portfolio system and online resources along with face to face training sessions. These along with the excellent support from in-school mentors and tutors from The Coventry SCITT, will mean you will feel fully prepared for working in the classroom. Your teaching load will start small and increase gradually as the year progresses. The rate at which this increases will be decided by you and your tutors and take into account any prior experience.\r\n","interviewProcess":"You will be invited to an interview in our office or one of our partner schools. This interview will include.\r\n\r\nID and qualifications check\r\nObservational task - 20 minutes\r\nLiteracy task - 30 minutes\r\nOral presentation; stating three reasons what influenced you to become a teacher - 10 minutes\r\nFormal Interview  - 30 minutes\r\n\r\nOne or more members of the interview panel have attended safer recruitment training and are committed to safeguarding of children and young people.\r\n","howSchoolPlacementsWork":"Trainees will complete training in two different schools during the course of the year.\r\n\r\nTypically trainees spend the autumn term in their host school and then go to a second placement school during the first part of the Spring term and then return to their host school for the remainder of the year.  The Coventry SCITT organises your second placement for you to ensure you have the opportunity to teach in a contextually different school.\r\n\r\nTrainees are in school 4 days a week and attend training every Monday.\r\n\r\nWe endeavour to keep travelling time to school to a minimum so we will take into account your home address when allocating a school. Trainees are involved in the decision making process when choosing a main placement school. We endeavour to place trainees in one of their first three choices of schools.\r\n\r\nThe programme covers the secondary age range 11-16. You will be required to teach at both KS3 and KS4 and will have the opportunity to teach KS5 but it is not a requirement.\r\n\r\n","personalQualities":"","otherRequirements":"","status":1,"createdAt":"2021-07-12T13:49:30.343Z","updatedAt":"2021-07-22T12:37:28.934Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
