{"id":"9d8e4597-9110-437f-a8e8-c9faa52fd371","name":"Design Technology- Product Design","code":"AP41","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"118fabd7-86d0-4a40-9e9a-e5c302abe59b","code":"DT","name":"Design and technology"}],"locations":[{"id":"df4451f5-95f3-4640-9ba8-d53268b9a3fc","name":"St James's School Direct Partnership","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"34da1f57-8568-4212-8e49-d45d4d26e35f","code":"18J","name":"St. James’s School Direct Partnership"},"accreditedBody":{"id":"e328aab3-a535-4921-8ded-5e37133c76dd","code":"L46","name":"Liverpool Hope University"},"profPost":"PG","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"Your degree should be related to or cover 50% of the subject you wish to teach.\n\nThose applicants who do not have a degree in the subject they wish to teach may be required to take up a subject knowledge enhancement course to confirm a place on a course.  St James’s School Direct Partnership will assist in getting applicants onto a suitable SKE programme","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"St James's School Direct Partnership offers a comprehensive training package for all our trainees on our School Direct PGCE with QTS course. We have experienced and fully trained subject mentors who are committed to developing the next generation of ‘Outstanding’ teachers. \r\n\r\nWithin our programme, trainees enjoy a blended programme which includes the following;\r\n\r\n* Trainees benefit from at least one hour per week of subject mentor \r\ninput as well as at least one hour of weekly Professional Studies with \r\nthe professional mentor.\r\n*Attending group training session with the cohort of trainees, receiving \r\nhigh quality practitioner-led training, peer support and joint practice development opportunities.\r\n* Trainees follow weekly themes which build up pedagogy and practice.  \r\nThemes such as getting to know your school, how to write \r\noutstanding lesson plans, how to question pupils effectively to \r\nmaximise learning and progress are to name but a few.\r\n* School-led professional learning where you would be able to take  advantage of a range of professional development opportunities \r\nwithin your own school and schools within the Partnership.\r\n* Attending high quality training provided by other schools and the Partnership throughout the year. \r\n*Completing at least 120 school based days\r\n* Completing the Liverpool Hope PGCE elements to the course consisting of 16 Subject away days, 5 Assess days and  3 Educational conferences at Liverpool Hope.\r\n*Complete 2 x 5000 word written assignments as a requirement of your PGCE (60 Masters credits)\r\n* Focussed support and mentoring, by the very best practitioner within their own school. \r\n* Trainees in secondary schools are attached to a form group and also gain PSHE experience from our trained PSHE mentors. \r\n*Complete the Certificate in Church School Studies, an additional certificate accredited by Liverpool Hope University.\r\n* Opportunities to participate in extra-curricular clubs which allows them to make a wider contribution to the life and ethos of their school.\r\n\r\nThroughout the year you will be very well supported. We are keen to see each individual trainee working to achieve the very best and enjoying success in their chosen career. We know professional development is a two way process. As such we will listen to you, work to identify your own development needs and support you in meeting your targets. \r\nTowards the end of the Programme of training, trainees will be fully supported to seek and obtain employment. \r\n","interviewProcess":"Our interview day will consists of all or a combination of the following tasks: \r\n\r\n* Group Task\r\n* Written task\r\n* Mini teach\r\n* Formal interview \r\n\r\nIn the current climate our interview process may take place virtually and be a combination of some of the above.  Candidates will be informed of the process if invited for interview.\r\n\r\nWe endeavour to inform applicants of the outcome of their interview on the same day. \r\n","howSchoolPlacementsWork":"Each Partnership school has unique qualities and these are shared with the cohort whichever school trainees are based in for placements. With our Programme, trainees will start their journey into teaching by coming into school on the first day of term in September and immediately feel like part of the school.  \r\n\r\nTrainees can be placed in any two of the partnership schools,  Placements are decided by the partnership.  Trainees will be placed in schools where the department is strong and the subject mentor is excellent, to allow the best possible learning journey for the trainee, this is organised in the following way; \r\n\r\nOur programme follows an AB model, during the year you will be attached to two schools (Placement A) from Sept-Feb and carry out a contrasting placement in another Partnership school (Placement B) from Feb-July. This is designed to enhance and extend your knowledge of different teaching contexts, and of how pupils respond in different environments. Our programme will include a small amount of time looking at primary education/post 16 education/alternative provision so that trainees understand the full education journey.  For candidates who have a desire to specialise in Post 16 education we can offer a placement in a school with a Sixth Form.\r\n\r\nPartnership Schools:\r\nSecondary: \r\n* St James's CE High School (Lead School) \r\n* Little Lever High School\r\n* Sharples School\r\n* Bury CE High School\r\n* Canon Slade School\r\n* Bolton St Catherine's Academy\r\n* Bolton Muslim Girls School\r\n* ESSA Academy\r\n* Smithills School\r\n* Westhougthon High School\r\n* St Joseph's RC High School\r\n* Bolton Impact Trust (Alternative Provision) including:\r\n    -Lever Park \r\n    -Youth Challenge PRU\r\n    -Personal Learning Centre\r\n    -Park School Teaching Service\r\n\r\nPrimary: \r\n* St Peter's CE Farnworth Primary School (Lead Primary)\r\n* St James's CE Primary School\r\n* Highfield Primary School\r\n* St John's CE Primary School\r\n* Queensbridge Primary School\r\n* All Saints CE Primary School\r\n* Kearsley West Primary School\r\n* The Ferns Primary Academy\r\n* The Orchards Nursery School\r\n* Cherry Tree Primary School\r\n* Bishop Bridgeman CE Primary School \r\n* The Forward Centre (part of the Bolton Impact Trust) \r\n","personalQualities":"We are looking for high quality graduates and career changers who want to make a difference to children and young people, to embark on our Initial Teacher Training Programme. We are looking to recruit outstanding trainees who have real potential to teach with the following personal qualities;\r\n\r\n* Passion and knowledge in your subject area\r\n* Ability to work as part of a team and maintain appropriate relationships\r\n* Good organisational and time management skills\r\n* Good level of literacy and numeracy skills\r\n* Willingness to be involved in the wider life of the school/extracurricular activities\r\n\r\n","otherRequirements":"You will be required to teach all aspects of Design Technology (not just Product Design).\r\n\r\nSuccessful applicants will be required to undergo a DBS check with Liverpool Hope University.\r\n\r\nCopies of the originals of all the applicant's qualification certificates must be seen, together with ID documents (passport; photo driving licence or two utility bills or similar from within the last 3 months, showing the applicant's name and address).","status":0,"createdAt":"2021-07-06T10:49:16.476Z","canSponsorStudentVisa":"no","cycle":"2024"}
