{"id":"deb75c9a-2499-4cc5-8911-598caf5929d8","name":"Chemistry","code":"C103","qualification":"qts","startDate":"2024-01-01T00:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"TA","fundingType":"apprenticeship","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"912d4fb4-761b-42e9-8dc6-e968b791ea4e","code":"F1","name":"Chemistry"}],"locations":[{"id":"d9a08c5e-3cff-455e-b55e-5918b4e1a5c7","name":"Train:Teach:Lead Partnership (Formally St James's Teaching School)","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"34da1f57-8568-4212-8e49-d45d4d26e35f","code":"18J","name":"St. James’s School Direct Partnership"},"accreditedBody":{"id":"252d7e03-741e-4453-b6a8-3d361e6c9d1b","code":"E69","name":"e-Qualitas"},"degreeGrade":"1","additionalDegreeSubjectRequirements":"false","english":"3","maths":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":null,"aboutCourse":"The Train;Teach:Lead Partnership (formally the St James's Teaching School Partnership) working in collaboration with e-Qualitas to provide this ITT course which is school-based, involving a blend of school-led training, independent study and training provided by e-Qualitas.  \r\n\r\nThe training modules cover: \r\n\r\n* planning learning; \r\n* managing pupils' behaviour; \r\n* assessing learning; \r\n* learning for all including high-attainers, EAL, those with special educational needs; \r\n* overcoming barriers to learning; \r\n* the organisation of the curriculum and cross-curricular issues; \r\n* effective teaching of the subject. \r\n\r\nThere are two assignments: one on learning for all and one on effective subject teaching.\r\n\r\nOur trainees spend most of their time in school. They move from co-teaching with experienced staff to independent teaching (with support and advice from other teachers). Most trainees are teaching about a 50% timetable by a third of the way through their course, rising to 60% in the middle term, and rising again in the final term. \r\n\r\nA 6-week placement in a contrasting school usually takes place in the middle of the training period which will be arranged with one of our Partnership Schools.\r\n\r\nTrainees attend about 10 training days with e-Qualitas (location to be determined).  There is a comprehensive on-line library to support independent study, and pro-forma that can be used for lesson planning, observations, structure evaluative writing etc. A tutor from e-Qualitas visits for a whole day each half term.\r\n\r\nAssessment is on-going, with self-assessment, 5-weekly assessment points for the in-school trainers' assessments and feedback, and tutor assessments. The final assessment for QTS is verified by an eQualitas tutor who has not been previously involved in the trainee's training.\r\n","interviewProcess":"The interview process will be undertaken by staff from the employing school  and will consist of some or all of the following:\r\n\r\n* Written task\r\n* Producing a lesson plan and resources \r\n* Formal interview\r\n\r\nPlease note that in the current climate the process may take place virtually.\r\n\r\nWe endeavour to inform applicants of the outcome either on the day of their interview or the following day\r\n","howSchoolPlacementsWork":"Each Partnership school has unique qualities and these are shared with the cohort whichever school apprentices are based in for placements. \r\nWith our Programme, apprentices will start their journey into teaching by coming into school on the first day of term in September and immediately feel like part of the school.  \r\n\r\nA 6-week placement in a contrasting school usually takes place in the middle of the training period which will be arranged with one of our Partnership Schools\r\n\r\nApprentices will be placed in schools where the department is strong and the subject mentor is excellent, to allow the best possible learning journey. This is designed to enhance and extend your knowledge of different teaching contexts, and of how pupils respond in different environments.   \r\n\r\n","personalQualities":"The e-Qualitas course suits people who are independent learners and self-motivated. Who are reflective and analytical, have really good inter-personal skills and who want to make a difference to children and young people. We are looking to recruit outstanding apprentices who have real potential to teach with the following personal qualities\r\n\r\n* Passion and knowledge in your subject area\r\n* Ability to work as part of a team and maintain appropriate relationships\r\n* Good organisational and time management skills\r\n* Good level of literacy and numeracy skills\r\n* Willingness to be involved in the wider life of the school/extracurricular activities\r\n","otherRequirements":"Relevant work experience is helpful because it puts the applicant into a stronger position at the start of the training period.\r\n\r\nDBS checks have to be passed and referees should endorse the applicant's capacity to become a successful teacher.\r\n\r\nCopies of the originals of all the applicant's qualification certificates are held by e-Qualitas, together with ID documents (passport; photo driving licence or two utility bills or similar from within the last 3 months, showing the applicant's name and address).\r\n","status":1,"createdAt":"2021-07-12T13:48:25.452Z","updatedAt":"2021-10-19T14:09:24.996Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024"}
