{"id":"78f729af-6fb6-4b0a-9190-0667c91fe5ae","name":"Business Studies","code":"3D6B","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"14_to_19","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"de6477b2-6027-48e6-b9f7-3206774705c2","code":"08","name":"Business studies"}],"locations":[{"id":"8db1986b-39c4-4672-816f-893eb7ac2362","name":"King Edward VI School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"0faff2ff-7366-430c-bcb0-477b2b6d4007","name":"Bottisham Village College","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"16075b74-df88-4bcc-b3ce-6e42f63261d5","code":"1WO","name":"The Cambridge Teaching Schools Network, CTSN SCITT"},"accreditedBody":{"id":"16075b74-df88-4bcc-b3ce-6e42f63261d5","code":"1WO","name":"The Cambridge Teaching Schools Network, CTSN SCITT"},"profPost":"PG","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"You would need a minimum of a 2.2 Honours Degree (or overseas equivalent confirmed by ENIC UK). Usually, at least 50% of your degree should be directly relevant to the subject you wish to teach. However, applicants who have a degree in a non-related subject but have significant work experience relevant to the subject they wish to teach may also be considered.","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feeDetails":"£9,250, often covered with a student loan. For many subjects generous training bursaries are also available. For further information please follow the link to the [Department for Education - Get into Teaching Website](https://getintoteaching.education.gov.uk/funding-my-teacher-training).","aboutCourse":"As a school based provider of initial teacher training, the CTSN SCITT is very much grounded in the life of its local schools.  The tutors on the course are experienced, practising teachers and, from the beginning of the course, trainees will spend four days a week (Monday – Thursday) in school and attend Core Training on Fridays, either in Cambridge or Bury St Edmunds.  Whilst in school, trainees will have some teaching, which will increase throughout the year, but also have plenty of time to get involved in other training activities: observing expert teachers; working with students in smaller groups, one-to-one tutoring; time for assessment & planning; reading, writing & research into effective learning and teaching.  Every trainee will have a dedicated subject specialist mentor, with whom training is planned and evaluated at weekly mentor meetings; these meetings are the hub of the school based training.  Most of the Core Training on Fridays will look at issues in learning & teaching common to all trainees, but there are also regular (approx. monthly) subject afternoons to look at more subject specific pedagogy.  In addition, each trainee will be assigned to one of the senior tutor team, who act as personal tutors throughout the course.  This course leads to the awards of Qualified Teacher Status (QTS) plus PGCE (with the Anglia Ruskin University).  For further details please follow the link to [CTSN SCITT](https://ctsnscitt.info).","interviewProcess":"At interview you will usually be asked to teach a small group of students, most probably in Key Stage 3.  In addition there will be a short written task and an interview with a SCITT Senior Tutor, together with a senior teacher from one of our partnership schools.","howSchoolPlacementsWork":"We have excellent relationships with a wide range of good and outstanding schools, across the Eastern region, which gives us considerable flexibility in placing trainees in local schools, within reach from the their home. You will spend the first term in one school and then, after Christmas, you would move to a different school for the rest of the course.  This will allow you to build significant relationships in this extended placement.","personalQualities":"As a school based ITT provider, CTSN SCITT works very closely with its partnership schools, and the vast majority of our trainees get jobs working in these local schools.  We are looking for creative, proactive, positive applicants who share our commitment that students in our local schools should have the best possible teachers, and a desire and determination to make this commitment a reality.","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:47:22.616Z","updatedAt":"2021-09-23T15:11:58.382Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
