{"id":"4b62303e-06e7-4044-94bf-0eb273710737","name":"Primary","code":"2NMY","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"3_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"2e525c9a-22fb-4fe3-9dde-f1f5c4117b67","name":"Main Site","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"c14ac88c-c00a-4266-8a32-637f00ad76b2","code":"15Q","name":"Town End Teaching and Support Alliance"},"accreditedBody":{"id":"b384b008-59e2-461e-a15f-3551d1165c1e","code":"N77","name":"University of Northumbria at Newcastle"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":null,"aboutCourse":"School Direct is a national teacher training initiative offering the exciting opportunity to train alongside outstanding practitioners, gaining valuable knowledge skills and professional attitudes that will enable you to start you on your journey to becoming an outstanding teacher and a future school leader. \r\n\r\nTETSA can offer you:\r\nOutstanding pedagogy delivered by specialist staff in all areas of the curriculum\r\nTraining sessions delivered by outstanding leaders and staff in our new training facility\r\nStrong and skilled support networks in the application of effective teaching and learning methodology\r\n Strong partnerships between Northumbria University and our school-based trainers\r\nContinuing professional development opportunities\r\nEmployment opportunities\r\nProfessional and approachable ITT mentors\r\nNQT support\r\nBegin the year with a thorough induction at our training suite.  Our celebration event  is hosted at the stunning Ramside Hall in County Durham.  This visit is inclusive of an overnight stay, all meals and use of the spa facilities.  These opportunities provide you with a relaxed environment to get to know one another and reflect upon your learning.\r\n","interviewProcess":"During the interview process you will be required to deliver a short teaching activity, complete a selection of written tasks and take part in a formal interview.  The formal interview panel will be made up of a TETSA Lead and members of Senior Leadership from schools within our partnership.  On occasion, course leaders from Northumbria University may also sit on the interview panel.","howSchoolPlacementsWork":"TETSA are a large and collaborative family of carefully selected schools across the North East, which can enable you to gain experience, knowledge and support in a diverse range of exciting and fulfilling settings.  With the wealth and breadth of experience across our alliance we can tailor your training and professional development to your needs.\r\n\r\nOur main site includes schools from within the WISE Academies Trust including:\r\nTown End Academy, Bexhill Academy, Hasting Hill Academy, North View Academy (Sunderland)\r\nWelbeck Academy (Newcastle)\r\nMalvin's Close Academy, Morpeth Road Academy, Croftway Academy (Blyth)\r\nPrudhoe West Academy, Adderlane Academy, Shaftoe Trust Academy, Haltwhistle Academy (Northumberland)\r\n\r\nWe currently offer placements within Early Years, Primary and SEN schools ranging from ages 3 to 11.  Trainees will take part in 3 school based placements across 2 different settings.  \r\n","personalQualities":"Experience working with children in a school or other settings will enhance your application as well as a reference containing a strong recommendation that you are suitable to train as a primary school teacher.  In addition to the academic qualifications we will consider the full range of knowledge, skills and prior experiences of every application in judging whether the applicant is capable of meeting the requirements.","otherRequirements":"Applicants must have been in full time paid employment for a minimum of 3 years.  \r\n\r\nAll places offered will be subject to a DBS check prior to starting the course.  This will be completed by Northumbria University.","status":1,"createdAt":"2021-07-06T10:55:03.238Z","updatedAt":"2021-09-23T11:26:09.247Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"Minimum salary of unqualified teacher scale "}
