{"id":"3ffb2dcb-8e97-44c5-82c6-a96f50a54316","name":"Primary (5-11)","code":"2ZVW","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"2ef08375-dd26-4dc8-b72e-454f943c8607","name":"Waterton Academy Trust West Yorkshire","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"c39d03d3-577e-4f3d-a382-19eab99ba840","code":"2EL","name":"Waterton Academy Trust"},"accreditedBody":{"id":"19a3446e-382d-4c14-83bb-a76563cef3c1","code":"L24","name":"Leeds Trinity University"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"“If you do not already have the appropriate GCSEs, or if you are unable to provide proof of your grades, we can accept GCSE equivalency tests taken with www.equivalencytesting.com, www.astarequivalency.co.uk or Birmingham City University (BCU) www.bcu.ac.uk. You only need to do the test if you are offered a place with us that you firmly accept. We can only accept tests from these providers and you will need to contact them directly for details on how to book and their costs.”","courseLength":"OneYear","feesUK":9250,"aboutCourse":"If you are considering starting a rewarding career in teaching where you can make a real difference in the lives of young children, come and find our what Waterton can offer you! \r\n\r\nYou’ll learn how effective teaching can impact a child’s educational progress, developing teaching skills informed by theory and subject knowledge. You’ll apply your knowledge in a classroom setting, working in all areas of the national curriculum. You’ll understand the roles and responsibilities of a teacher and develop the professional skills of planning, teaching and assessing learning, as well as how to build effective relationships with children.\r\n\r\nAs a partnership led course you will split your learning between placement schools and with Leeds Trinity University. The advantage of the School Based Training route is that you will spend a greater proportion of your time working within schools and a significant proportion of the training is delivered bespoke to the Waterton cohort by outstanding current practitioners.\r\n\r\nDuring the year you will have blocks of training at the Leeds Trinity Campus, focusing on the teaching of English, Maths, Science and Masters level Professional Studies. \r\n\r\nWhen in school, training will focus on a range of teacher knowledge and curriculum areas including:\r\n\r\n* Being a research led practitioner\r\n* Effective classroom organisation and behaviour management\r\n* Managing important relationships with adults\r\n* All National Curriculum subjects including extended PE training, Forest School and Drama\r\n","interviewProcess":"Appropriately qualified candidates will be invited to interview at one of our schools.\r\nYou will be asked to prepare a teaching activity to deliver to a group of children.\r\nYou will then have an interview with teaching colleagues from our schools which will encourage reflections on your chosen activity and questions which will help us understand the depth of your commitment to teaching as a profession.","howSchoolPlacementsWork":"Each successful candidate with be allocated a 'Home' school where you will spend the majority of the year learning. In that school you will carry out two block placements, including your final placement which plays the significant role in your final assessments for QTS. You will also carry out an alternative placement in another school within the Trust, ensuring that you have a wider view of school life.\r\nAs a Primary 5 to 11 PGCE, we will ensure that you teach a range of ages during the year, with placements that may include Reception, KS1 and KS2.\r\nWith 12 schools within our Trust, we have a range of community characteristic which provides our trainees with a full and robust understanding of many of the challenges facing teachers in England.\r\n\r\nThe twin cores of academic learning and school teaching practice makes  the PGCE process challenging and demanding. In order to ensure that our trainees are well supported, there is a multi level structure of mentors and tutors that our trainees can access and learn from.\r\nDuring the placement you will be closely supported by a Class Teacher Mentor who will guide and support you through the professional challenges of planning and delivering lessons to your class. They will also act as a role model to help you with the management of your classroom, including how to create a positive behaviour environment.\r\nYou will also have a School Professional Mentor who will ensure that you fulfil the school requirements to meeting the professional standards for QTS, and who will carry out your formal assessment activities.\r\nYou will also have a University Tutor for each placement who will guide you through the academic requirements for the PGCE, and will provide moderation of your placement to ensure that you are receiving the correct professional and personal support throughout your teaching practice.","personalQualities":"We look to bring people with a passion for teaching into our schools. Successful applicants have been able to share this in their interviews, including how they have ensured that they had tested their affinity to working with young children through volunteer roles or through working with children.\r\nSuccessful candidates have been able to communicate clearly and in a manner that engages their audience. This will be on different professional levels, working with pupils, colleagues and the leadership team of the ITE programme.","otherRequirements":"Waterton Academy Trust is committed to safeguarding and ensuring the welfare of children, young people and vulnerable adults and expects all employees and volunteers to share this commitment.\r\n\r\nThe suitability of all prospective trainees will be assessed during the recruitment process in line with this commitment.\r\nThis will include appropriate references, identity checks and an enhanced DBS check.\r\n\r\nCandidates will be asked to explain any gaps in their training and employment records, and to provide appropriate evidence of essential qualifications.","status":1,"createdAt":"2021-07-06T10:48:36.653Z","updatedAt":"2021-10-07T10:42:30.964Z","canSponsorStudentVisa":"yes","cycle":"2024"}
