{"id":"29c1c9ad-3898-4a9a-9622-bfcbd065cbe0","name":"Geography","code":"2SDS","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3f47e67b-7fa5-4947-a5a0-74d528cd2a87","code":"F8","name":"Geography"}],"locations":[{"id":"eeb80195-3bc3-4fe0-83d5-f37f6f1e8c8f","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"},{"id":"d7a16243-e24a-4e1f-956c-ff1e0c798937","name":"Rye College","isPublished":"N","status":"S","vacancies":"F"}],"trainingProvider":{"id":"7cf252b3-c098-46fb-9c61-851ec3c9dd25","code":"1C9","name":"Bromley Schools’ Collegiate School Direct"},"accreditedBody":{"id":"2cb11a46-97d4-4ced-a702-0dc37f7d6ebb","code":"B91","name":"Bromley Schools Collegiate"},"profPost":"BO","degreeGrade":"9","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Bromley Schools' Collegiate will offer candidates equivalency tests. These must be taken and passed before the start of the training course. If a candidate is awaiting results, they may be asked to take an equivalency test with Bromley Schools' Collegiate.","courseLength":"OneYear","feesUK":9000,"feeDetails":"The Tuition fee covers the cost for QTS and PGCE element. This can be paid via Student finance or by the trainee private funding.","aboutCourse":"Every child deserves to be taught by excellent teachers. Bromley Schools' Collegiate are committed to train and develop of the next generation of career teachers.   \r\n\r\n*  Trainees on the School Centred Initial Teacher Training programme are placed at one of our excellent partner schools in the borough of Bromley. \r\n\r\n*  Secondary Trainees spend Monday to Friday in their placement school with training taking place each Wednesday afternoon, usually at the Bromley Schools' Collegiate training suite. This is based at Hayes. Secondary School, West Common Road, Hayes, Bromley, Kent, BR2 7DB. \r\n\r\n\r\n*  The programme has been developed to deepen trainee's use of research informed practice. \r\n\r\n*  Trainees will receive high quality training from experienced facilitators, many who are drawn from our partnership schools, providing real-life context to the training. \r\n\r\n* Trainees will gain a strong understanding of how to meet the needs of all pupils through our curriculum based on caring for the whole child. \r\n* Right from the start of the course, trainees will be taught to develop critically reflective practice. \r\n* Subject Specific expertise will be developed and strengthened through the robust training programme. \r\n* Trainees are assessed throughout their placements by experienced leaders with a focus on making them career ready \r\n*The Training course runs from September to July. To meet the ITT criteria trainees must have experience of whole class teaching in two school settings. Placement 1 is September to December. Placement 2 is January to July. BSC will make these arrangements for you. \r\n * Qualification achieved is QTS with PGCE. The PGCE element is a bespoke programme delivered at Bromley Schools' Collegiate by Canterbury Christ Church University. \r\n* Trainees can opt out of the PGCE element. ","interviewProcess":"Successful applications will be invited for interview. We try to give as much notice as possible, however this may be within a week of receiving your application. \r\n\r\nThe interview will be to assess your suitability for teaching and Curriculum knowledge for your chosen subject. \r\n\r\nAs part of the selection process, we require you to prepare a short 4 minute presentation to be delivered to the interview panel. This should be delivered orally without powerpoint or any other electronic aid. After which you will be have a formal interview with senior management / headteacher. \r\n\r\nYou will also be asked to complete a timed written task which will be assessed as part of the selection process. Please do not worry about the content it is to see your use of grammar etc. ","howSchoolPlacementsWork":"Much consideration is given to placements. Each trainee must undertake two school placements to gain contrasting experience of teaching.  Each placement will be in a school within the partnership who have experience of mentoring and coaching trainees. ","personalQualities":"We are looking for candidates who want to make a difference to the lives of children. We want you to have a genuine passion for teaching.\r\nCompetence in English and maths skills will be assessed during the recruitment process.\r\n","otherRequirements":"We do not require candidates to have school / classroom experience before making an application.","status":1,"createdAt":"2021-07-06T10:52:19.762Z","updatedAt":"2021-10-02T16:11:26.481Z","canSponsorStudentVisa":"no","cycle":"2024"}
