{"id":"dfba4547-74ee-4901-8762-1165a0ea0e64","name":"Modern Languages","code":"2KT8","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"4608e5e3-2a1a-48a1-8236-56c7af5a139d","code":"24","name":"Modern languages (other)"},{"id":"ce8523ef-9236-4cd9-b260-d826c7a521b3","code":"ML","name":"Modern Languages"}],"locations":[{"id":"eeb80195-3bc3-4fe0-83d5-f37f6f1e8c8f","name":"Main Site","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"7cf252b3-c098-46fb-9c61-851ec3c9dd25","code":"1C9","name":"Bromley Schools’ Collegiate School Direct"},"accreditedBody":{"id":"2cb11a46-97d4-4ced-a702-0dc37f7d6ebb","code":"B91","name":"Bromley Schools Collegiate"},"english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","aboutCourse":"Trainees on the school direct salaried programme will be employed at one of our partner schools. \r\nTrainees spend Monday to Friday in their placement school with training taking place  each Wednesday afternoon, usually at the Bromley Schools' Collegiate training suite. This is based at Chislehurst School for Girls, Beaverwood Road, Chislehurst BR7 6HE.\r\n\r\nOur facilitators are experienced practitioners, many are senior leaders in our schools.\r\n\r\nTo meet the ITT criteria trainees must have experience of whole class teaching in 2 school settings. BSC will make these arrangements for you. This will take place in Spring term 1 (January and February ).\r\nThe Training course runs from September to July.","interviewProcess":"Successful applications will be invited for interview. We try to give as much notice as possible, however this may be within a week of receiving your application.\r\nThe interview will be to assess your suitability for teaching and National Curriculum knowledge for your chosen subject.\r\n\r\nAs part of the selection process, we require you to prepare a short 4 minute presentation to be delivered to a small panel of teachers. Which should be delivered orally without powerpoint or any other electronic aid. After which you will be have a formal interview with senior management / headteacher.\r\n\r\nYou will also be asked to complete a timed written task which will be assessed as part of the selection process. Please do not worry about the content it is to see your use of grammar etc.\r\n","howSchoolPlacementsWork":"Much consideration is given to placements. Each trainee must undertake 2 school placements to gain contrasting experience of teaching.","personalQualities":"We are looking for candidates who want to make a difference to the lives of children. We want you to have a genuine passion for teaching.\r\n","otherRequirements":"We do not require candidates to have school / classroom experience before making an application.\r\nCompetence in English and maths skills will be assessed during the recruitment process.","status":2,"createdAt":"2021-07-06T10:52:19.538Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"Please visit the BSC website for full details of salary."}
