{"id":"90002f6f-0b8d-4caf-8834-a333bb7a97be","name":"Modern Languages (French with Spanish)","code":"2N5D","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"e34fd2a3-a32e-44e9-aea1-666badf3ac03","code":"22","name":"Spanish"},{"id":"9727f674-61ba-4efa-b1f2-21ec7e354442","code":"15","name":"French"},{"id":"ce8523ef-9236-4cd9-b260-d826c7a521b3","code":"ML","name":"Modern Languages"}],"locations":[{"id":"dececcf9-a2f6-4d11-a6a9-e5aca40bd2e4","name":"South Birmingham SCITT","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"604f32f0-887f-4243-9e5d-addaec552b5e","code":"N32","name":"South Birmingham SCITT"},"profPost":"PG","degreeGrade":"9","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feeDetails":"£9250 tuition fee – you may be eligible for a student loan\r\nSubject dependent training bursaries may be available \r\n\r\n","aboutCourse":"Please visit our website at  (https://www.southbirminghamscitt.org.uk)  for further information and a map of our whole partnership\r\n\r\n* Full time; September to July\r\n* 1 day in Professional Studies training (South Birmingham SCITT site - Our training suite is located at The Sixth Form College, Solihull – 5 minutes from the centre of Solihull and 20 minutes from Birmingham City Centre\r\n* 4 days a week in school placement working with your assigned Daily Trainer and Lead Trainer\r\n* Placement schools allocated primarily upon the location of trainee\r\n* Professional Studies includes research and reflective practice, routines & behaviour, teaching & learning strategies, meeting all children’s needs, the importance of assessment, understanding of the wider educational context\r\n* subject specific pedagogy days - (Secondary held at Birmingham City University Campus on Mondays, Primary held at South Birmingham SCITT site)\r\n* Trainees become reflective practitioners with specific targets to move their practice forwards\r\n* Weekly reflection of teaching practice collates evidence and will culminate in a final assessment against the Teachers Standards to be awarded Qualified Teachers Status (QTS)\r\n* 3 research assignments (3000 words each - Nov, Feb and May submission)\r\n* 60 Level 7 Credits towards a Masters in Teaching and Learning \r\n* Ongoing early career development.  Birmingham City University offer  the opportunity to continue and complete your full Masters in subsequent years\r\n* One-to-one support in securing your teaching career\r\n* Expert support via School Based Trainers, Professional Tutors, Subject Tutors, Ex-Trainees and BCU Tutors – and cohort peers! \r\n\r\nOur programmes are all the same whether they are through our SCITT or our School Direct Partners. \r\n\tSouth Birmingham SCITT \r\n\tColmore Partnership Training School Alliance\r\n        Summit Learning Trust\r\n        The Augustine Partnership\r\n\t","interviewProcess":"Apply through 'Apply'  (https://www.gov.uk/apply-for-teacher-training) \r\n\r\nInterview day\r\n\r\n* 5 minute presentation about yourself \r\n* Formal panel interview\r\n* Talk through a pre-prepared 20 minute learning activity showing the intended impact on students\r\n* Group discussion activity\r\n* Subject Knowledge Baseline (to enable us to identify any specific gaps in knowledge) \r\n* Literacy and Numeracy assessments  (to inform us of support needed to ensure fundamental skills are in place)\r\n* Written reflection on the learning activity\r\n\r\nYou will have the opportunity to meet School Direct Leads, the SCITT Course Manager / Director and colleagues from the partnership. \r\nWe will inform you of our decision within 48 hours\r\nCheck out our website –  www.southbirminghamscitt.org.uk\r\n","howSchoolPlacementsWork":"School placements are based on two factors. The first is the home address of the trainee. We want to ensure that your travel time is accessible and not too time constraining. The second is the availability of a Partnership school in your location. We always limit travel time to no more than 1 hour from home. We will let you know your placement as soon as possible.\r\nWe have a map of all our Primary and Secondary schools on our website \r\n - (https://www.southbirminghamscitt.org.uk)  We have a wide selection of Primary  and Secondary Schools to choose placements from -  new schools ask to join us all the time!\r\n\r\nThe majority of our trainees will complete a short placement in the Autumn term and will then be placed in their main school for the Spring and Summer Terms.  We need to ensure that the short placement will give you a contrasting experience - this may mean different size, socio-economic catchment, faith/non-faith for example. This will mean a slightly different journey for you, but we will always ensure that it is accessible, for example if you don’t drive. \r\n","personalQualities":"* Enthusiasm \r\n* Dedication \r\n* Sense of humour\r\n* Passion\r\n* Resilience\r\n* Organisation\r\n* Patience\r\n* Professionalism\r\n* Reflective practice\r\n\r\nCheck out our website –  www.southbirminghamscitt.org.uk\r\n","otherRequirements":"If you studied outside of the UK, you will need to visit ENIC (https://www.enic.org.uk/) as a certificate of proof for equivalence will need to be obtained. \r\n\r\nWe do not expect you to have school experience upon application. But if you would like to gain some please get in touch and we will arrange this for you. \r\n\r\nA condition of your offer will be the successful completion of all Safeguarding procedures.\r\nYou will be asked to complete an Occupational Health Questionnaire \r\n","status":1,"createdAt":"2021-07-06T10:48:42.280Z","updatedAt":"2021-10-03T22:43:05.383Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
