{"id":"19d23095-7e13-4745-b568-434cd523b43e","name":"History","code":"G594","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"TA","fundingType":"apprenticeship","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"5a3609a0-5bbb-4377-b919-5d89932ab622","code":"V1","name":"History"}],"locations":[{"id":"1a2bb25a-f428-4bd3-b689-8514397693ca","name":"Alliance Secondary Schools","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"2caa774a-cb20-42f6-9c07-6bf03ff53c4d","code":"1YD","name":"Nottingham Catholic Initial Teacher Training Partnership"},"accreditedBody":{"id":"d2b7d074-fac9-42c5-a0d3-d5471b35f7d9","code":"N91","name":"Nottingham Trent University"},"profPost":"PG","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","aboutCourse":"This place is based at Long Eaton School:\r\n\r\nThe Teaching Apprenticeship Programme is a salaried, fee- free route into teacher training that offers school-based teacher training leading to PGCE & QTS.\r\n \r\nAs a Secondary School Teacher Trainee, you will be given the opportunity to teach the subject you’re passionate about in a school environment whilst receiving the support and guidance from experience teachers who will assist in your training.\r\n\r\nThis year-long programme will see a Secondary School Teacher Trainee building up your teaching responsibility and confidence in the classroom from day one, complemented by off-site training days and a support network of experience educators.\r\n\r\nIn addition to this quality training, a Secondary School Teacher Trainee will receive a salary that is paid in line with an unqualified teacher and you won’t have to worry about paying course fees.\r\n","interviewProcess":"If you meet the eligibility criteria, you will be invited to attend an interview at Nottingham Trent University.\r\n\r\n\r\n\r\n\r\n","howSchoolPlacementsWork":"This place is at Long Eaton School.\r\n\r\nWe believe contrasting placements are the key to a rich and diverse training experience, so as well as your main placement school you’ll also spend six weeks in another school. You will also undertake a shorter placement in other environments such as a feeder primary school. This means you’ll be exposed to all kinds of teaching experiences and challenges, gaining a clear insight on how to teach a full spectrum of learners in a range of school contexts.\r\n\r\nWe have close links with a number of selected partner Secondary schools across the East Midlands, which enables you to access a diverse range of establishments during your teaching practice. Our network of partner schools offer you a breadth of experience and the opportunity to train in schools of different sizes and specialisms\r\n","personalQualities":"*Desire and passion to become a teacher and to challenge and inspire your students.\r\n\r\n*Excellent interpersonal and communication skills, with proficiency in both written and spoken English.\r\n\r\n*Strong subject knowledge and an understanding of it in the context of educating young people.\r\n\r\n*Commitment to high standards and excellence.\r\n\r\n*A wider understanding of the purpose of education.\r\n\r\n*Resilience and determination to succeed both as a trainee and as a teacher.\r\n\r\n*The ability to meet the mental and physical demands of classroom teaching.\r\n","otherRequirements":"*DBS Checks.\r\n\r\n\r\n","status":2,"createdAt":"2021-07-06T10:55:17.813Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024"}
