{"id":"cb0affdb-5dea-463e-9d7a-96292d682614","name":"Physical Education","code":"2H2W","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"74d64a54-5e34-4590-b6c7-528dd0cf26fe","code":"C6","name":"Physical education"}],"locations":[{"id":"8a3c4aa9-db63-43db-ad15-2e3fede7df0b","name":"Christ the King School, Nottingham","isPublished":"Y","status":"R","vacancies":"F"},{"id":"f53deb5c-b129-4d81-81d1-3c5c5c310375","name":"The Becket School","isPublished":"N","status":"S","vacancies":"F"},{"id":"3c85f817-445e-4310-83e4-b36db90ca075","name":"De Lisle College, Loughborough","isPublished":"Y","status":"R","vacancies":"F"},{"id":"b49d2da2-ec73-470a-b68d-08f9d1f96360","name":"The Trinity School, Nottingham","isPublished":"N","status":"S","vacancies":"F"},{"id":"649437d4-566a-4dfa-89ea-7a036fee33b7","name":"St John Ferneley College","isPublished":"N","status":"S","vacancies":"F"},{"id":"187e91a5-5ddc-42bf-9ccf-0bcc3ec2c65b","name":"Blessed Robert Sutton","isPublished":"Y","status":"R","vacancies":"F"},{"id":"1f5f2f5f-01bd-4486-bb60-299a64295799","name":"All Saints' Catholic Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"2bb24e99-c3a3-4d21-9dc1-c292269474c4","name":"Leicester Grammar School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"2caa774a-cb20-42f6-9c07-6bf03ff53c4d","code":"1YD","name":"Nottingham Catholic Initial Teacher Training Partnership"},"accreditedBody":{"id":"d2b7d074-fac9-42c5-a0d3-d5471b35f7d9","code":"N91","name":"Nottingham Trent University"},"profPost":"BO","degreeGrade":"1","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"These must be from an NTU approved provider.","courseLength":"OneYear","feesUK":9250,"feeDetails":"trainees are responsible for paying their own university fees","aboutCourse":"Please note that we are open for recruitment as normal.  Our selection process will be in the form of face to face interviews subject to government guidance.\r\n\r\nCourse aims:\r\n•to gain practical teaching experience in contrasting schools\r\n•to build confidence and help you reflect on your professional practice\r\n•to become an authority on the latest curriculum development, issues and innovations\r\n•to learn to manage pupils' behaviour and maintain a purposeful learning environment\r\n•to grow confidence in the latest technologies and develop multimedia resources\r\n•to leave with the skills, knowledge and experience needed to begin your teaching career by taking three core modules.\r\n\r\n\r\nSubject Studies: You will learn all aspects of how to teach your subject, including planning, teaching, assessment and classroom management.\r\n\r\nProfessional Studies: You will learn about working in classrooms and schools, and the broader context of teaching today.\r\n\r\nProfessional Practice: You will have opportunities for observation, practice and investigation in two contrasting schools.\r\n\r\nTrainees will spend 4 days per week in school with 1 day per week being a training day at University. \r\n\r\nTraining days will  take place at Nottingham Trent University.\r\n","interviewProcess":"Our selection process will be in the form of face to face interviews subject to government guidance.\r\n\r\nIf you meet the eligibility criteria, you will be invited to attend an interview at Nottingham Trent University. \r\n\r\nYou will then be invited to attend an interview with us, usually held online with the Alliance school you have applied for, where you will be welcomed by a member of the NCITTP  team. \r\n\r\nAt interview you may be given the opportunity to demonstrate your subject knowledge through a short activity. You will also give a 5 -10 minute presentation on a topic connected to your interest in your subject area and your motivation to teach and a formal interview.\r\n\r\nThroughout the process you will be able to  ask questions and seek support with the next steps open to you. ","howSchoolPlacementsWork":"We believe contrasting placements are the key to a rich and diverse training experience, so as well as your main placement school you’ll also spend six weeks in another school. You will also undertake a shorter placement in other environments such as a  feeder primary school. This means you’ll be exposed to all kinds of teaching experiences and challenges, gaining a clear insight on how to teach a full spectrum of learners in a range of school contexts.\r\n\r\nWe have close links with a number of selected partner Secondary schools across the East Midlands, which enables you to access a diverse range of establishments during your teaching practice. Our network of partner schools offer you a breadth of experience and the opportunity to train in schools of different sizes and specialisms.\r\n\r\n\r\n","personalQualities":"*Desire and passion to become a teacher and to challenge and inspire your students.\r\n\r\n*Excellent interpersonal and communication skills, with proficiency in both written and spoken English.\r\n\r\n*Strong subject knowledge and an understanding of it in the context of educating young people.\r\n\r\n*Commitment to high standards and excellence.\r\n\r\n*A wider understanding of the purpose of education.\r\n\r\n*Resilience and determination to succeed both as a trainee and as a teacher.\r\n\r\n*The ability to meet the mental and physical demands of classroom teaching.\r\n","otherRequirements":"*DBS Checks.\r\n\r\n\r\n","status":1,"createdAt":"2021-07-06T10:55:16.723Z","updatedAt":"2021-10-06T11:05:18.922Z","canSponsorStudentVisa":"yes","cycle":"2024"}
