{"id":"ec79e56e-6e65-467e-aac5-75e1f34424a2","name":"Primary","code":"3C7L","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"53c3de9b-8bfe-4922-b61e-317441936a24","name":"St Anne's CVA Primary, Buxton (Derbyshire)","isPublished":"Y","status":"R","vacancies":"F"},{"id":"c0c6f500-480c-48e0-bed6-16da0d449a98","name":"St Edward's Catholic Academy, Swadlincote","isPublished":"Y","status":"R","vacancies":"F"},{"id":"a99bfea7-a414-4ef9-9605-0091fe1a88ea","name":"St Alban's Catholic Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"8c6b948d-2ad7-4e25-b1ca-5d84c232d136","name":"English Martyrs, Long Eaton","isPublished":"Y","status":"R","vacancies":"F"},{"id":"bafb73b0-8e9d-4363-b603-99ef34e354ff","name":"Christ the King Primary (Derbyshire)","isPublished":"Y","status":"R","vacancies":"F"},{"id":"dcd1b1f4-94f7-4ecf-98e1-d0873102de28","name":"Alliance Primary Schools","isPublished":"Y","status":"R","vacancies":"F"},{"id":"bd10547f-ede1-43ce-9468-0a5e2165c3c3","name":"Saint Philip Neri with St Bede Catholic Voluntary Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"f83a10ab-f0a3-4a54-b826-0bf0069401cf","name":"St Charles Catholic Primary School, Measham","isPublished":"Y","status":"R","vacancies":"F"},{"id":"1037a10b-0974-45ba-a7e4-1300cb6eaf70","name":"Holy Cross Primary Catholic Voluntary Academy","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"2caa774a-cb20-42f6-9c07-6bf03ff53c4d","code":"1YD","name":"Nottingham Catholic Initial Teacher Training Partnership"},"accreditedBody":{"id":"aa023df3-b71e-4249-b9c4-41fca8bd135e","code":"D39","name":"University of Derby"},"profPost":"BO","degreeGrade":"1","english":"1","maths":"1","science":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"These must be from an approved University of Derby provider","courseLength":"OneYear","feesUK":9250,"financialSupport":"School Direct trainees are responsible for paying their own training fees. Please contact Student Finance UK for further details.","aboutCourse":"Schools available:\r\n* Christ the King Catholic Voluntary Academy , Alfreton, DE55 7EN\r\n* English Martyrs' Catholic Voluntary Academy, Long Eaton, NG10 4DA\r\n* Holy Rosary Catholic Voluntary Academy, Burton-on-Trent, DE15 0JE\r\n* St Alban's Catholic Voluntary Academy, Derby, DE21 6NU\r\n* St Anne's Catholic Voluntary Academy, Buxton, SK17 7AN\r\n* St Charles Catholic Voluntary Academy, Hadfield, SK13 1PJ\r\n* St Edward's Catholic Academy, Swadlincote, DE11 0BD\r\n* St Elizabeth's Catholic Voluntary Academy, Belper, DE56 2JD\r\n* St George's Catholic Voluntary Academy, Derby, DE23 1GG\r\n* St John Fisher Catholic Voluntary Academy, Derby, DE24 0PA\r\n* St Joseph's Catholic Voluntary Academy, Derby, DE23 6SB\r\n* St Joseph's Catholic Voluntary Academy, Matlock, DE4 3FT\r\n* St Margaret's Catholic Voluntary Academy, Gamesley, SK13 6JH\r\n* St Mary's Catholic Voluntary Academy, Derby, DE22 1AU\r\n* St Mary's Catholic Voluntary Academy, Glossop, SK13 8NE\r\n* St Mary's Catholic Voluntary Academy, Marple Bridge, SK6 5BR\r\n* St Mary's Catholic Voluntary Academy, New Mills, SK22 3BL\r\n* St Philip Howard Catholic Voluntary Academy, Glossop, SK13 8DR\r\n* St Thomas Catholic Voluntary Academy,  Ilkeston, DE7 4LF\r\n* The Priory Catholic Voluntary Academy, Eastwood, NG16 3GT\r\n\r\nStudy options - Full-time: 1 year\r\n\r\nUK/EU fee - £9,250 per year (2018/19)\r\n\r\nCourse level - Postgraduate\r\n\r\nQualification - PGCE\r\n\r\nStart date - September\r\n\r\nLocation - Kedleston Road, Derby Campus\r\n\r\nHow you will learn\r\nYou will spend most of your time learning how to teach in schools linked to our network of partner schools. Located across the Midlands, they will work together in clusters to support you on placement. The placements and enhanced school opportunities will provide you with challenging and exciting experiences.\r\n\r\nYou'll also spend time at the University of Derby, working in their excellent facilities with University and school-based tutors, in order to develop your growing understanding of what it takes to become a great teacher.\r\n\r\nHow you're assessed\r\nAll assessments relate to your school placements; you will complete three assessed teaching placements, two in your main school and one in a second school, and additional enhanced school opportunities, which will provide you with the challenging and exciting experience you need. There will be in-depth teacher enquiry on school-based issues.\r\n\r\nYou'll also have the opportunity to reflect on and discuss your developing subject knowledge of the core and wider curriculum subjects, as well as developing your skills in research-informed practice.","interviewProcess":"When applying, we will contact you to ask which school you are interested in training at. If you can't see the location listed for the school you wish to train at, please contact us and we will provide you with the details.\r\n\r\nInterviews are currently taking place remotely online.","howSchoolPlacementsWork":"With the support of your mentor and link tutor, you will undertake two assessed school experiences as well as shorter school experiences.\r\n\r\nFor 'Professional Practice: Becoming a Teacher' you will observe experienced practitioners in the classroom, teach alongside your mentor and begin to take responsibility for the class as a whole. You will put into practice the skills of planning, delivery and assessment that you cover in your University-based training. You will also gain the wider professional skills demanded of a teacher such as dealing with parents, contributing to after-school activities and planning school trips.\r\n\r\nFor 'Professional Practice: Aiming for Excellence' you will be placed at a different school or setting, with the opportunity to work with children from another age group. At first, you will be given time to observe other teachers and get to know your class. You can then expect to progress more quickly to taking fuller responsibility for the class. ","personalQualities":"","otherRequirements":"A Disclosure and Barring Service (DBS) check is required at the point of accepting a place at the University. \r\n\r\nTrainees completing an Initial Teacher Training Programme must demonstrate the required competencies in the Fundamentals and English and Maths outlined by the Department for Education before Qualified Teacher Status is awarded. \r\n\r\nTo ensure trainees meet the required competencies you will be required to undertake and pass the University’s agreed assessment when you commence your course. Full details of the required competencies and assessment will be provided in due course.   Pease note it is the trainee’s responsibility to secure these fundamental skills.\r\n\r\n","status":1,"createdAt":"2021-07-06T10:55:17.653Z","updatedAt":"2021-10-07T07:22:10.232Z","canSponsorStudentVisa":"yes","cycle":"2024"}
