{"id":"dde07bdf-c231-4204-91bc-0bf48ae3bb81","name":"Primary","code":"26S7","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"5418ad3f-8296-45d7-be5b-24d5a4d41844","name":"Main Site","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"d406b156-2f1f-41a0-b495-2ea01c14b852","code":"1AZ","name":"Windsor, Ascot and Maidenhead Consortium"},"accreditedBody":{"id":"77a78d6a-170e-46b0-a6de-c3983d9caa52","code":"1WM","name":"The Royal Borough of Windsor and Maidenhead SCITT"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":null,"aboutCourse":"Course Content\r\nThe Training Programme consists of two modules: \r\nTeachers as Researchers and Reflective Practitioners and \r\nThe Principles and Practice of Effective Assessment. \r\nTrainees divide their time between school placements, central training and academic research through Buckinghamshire New University, leading to a PGCE and 60 masters credits.\r\n\r\nIn terms 1 and 2 trainees will commence on a 20% teaching timetable starting with starters, plenaries and small groups. Trainees will be mentored by a class teacher throughout with feedback given on every lesson taught. In terms 3 and 4 trainees will move to a 50% teaching timetable and will be observed at least one in two lessons. In terms 5 and 6 trainees will be teaching a 70% timetable. \r\nThroughout the year time is given for planning, preparation, assessment and observing other colleagues throughout the school.\r\n\r\nCentral training takes place once a week in school training rooms within the Consortium. This training is carried out by Local Authority and SCITT Advisers, Headteachers/Leading Practitioners and Buckinghamshire New University lecturers. Training covers subject knowledge and generic elements of teaching such as Behaviour Management, Inclusion and Assessment.\r\n\r\nPlease tell us about any  attributes, knowledge or transferable skills you possess related to working with young people or within education.\r\nWe are looking for someone who is passionate about working with children, has a thirst for learning and is showing an insight into current educational practices.\r\nAny evidence of any organisational and communication skills as well as a commitment to the programme.\r\n\r\n","interviewProcess":"Interviews will take place within a consortium school by a panel of Headteachers and will involve a small child initiated activity, a presentation and a written task.\r\nApplicants selected for interview will be required to complete the Borough Equal Opportunities and Disclosure proforma.\r\nApplicants successful following interview will be required to undergo an on line Disclosure and Barring Service (DBS) check before going into school.\r\n","howSchoolPlacementsWork":"Trainees are based in a Lead School for four days a week (Monday to Thursday) for Autumn and Summer terms. There is also an eight week second school placement in the Spring term in a contrasting environment. Short further placements take place in a special school and early years settings looking at phonics and early maths.","personalQualities":"\r\nPlease tell us about any attributes, knowledge or transferable skills you possess related to working with young people or within education.\r\nWe are looking for someone who is passionate about working with children, has a thirst for learning and is showing an insight into current educational practices.\r\nAny evidence of any organisational and communication skills as well as a commitment to the programme.\r\n","otherRequirements":"","status":1,"createdAt":"2021-07-12T13:49:20.451Z","updatedAt":"2021-12-06T07:40:10.157Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"Trainees on a salaried programme are on a minimum of Unqualified 1."}
