{"id":"78da3c08-7dd8-4a3a-b8fd-4da20537d8f1","name":"English","code":"H368","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"7_to_14","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3aed1aa8-ae46-4b68-92bb-a6cc20655c59","code":"Q3","name":"English"}],"locations":[{"id":"25e980ec-e713-4411-9d7f-1118da2c10e9","name":"Main Site","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"2cb11a46-97d4-4ced-a702-0dc37f7d6ebb","code":"B91","name":"Bromley Schools Collegiate"},"profPost":"PG","english":"3","maths":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9000,"aboutCourse":"Trainees spend Monday to Thursday in their placement school with training taking place each Friday, usually at the Bromley Schools' Collegiate training suite. This is based at Chislehurst School for Girls, Beaverwood Road, Chislehurst BR7 6HE.\r\nOur facilitators are experienced practitioners, many are senior leaders in our schools.\r\nTo meet the ITT criteria trainees must have experience of whole class teaching in 2 school settings. BSC will make these arrangements for you. Placement 1 is from September to December\r\nPlacement 2 is from January to March (Easter) returning for term 3 to Placement 1.\r\nThe Training course runs from September to July.\r\nThe PGCE element is delivered by Canterbury Christ Church University at the Bromley Schools' Collegiate training room at Chislehurst School for Girls, BR7 6HE. This programme is bespoke to BSC.\r\n","interviewProcess":"Successful applications will be invited for interview. We try to give as much notice as possible, however this may be within a week of receiving your application.\r\nThe interview will be to assess your suitability for teaching and National Curriculum knowledge for primary\r\nAs part of the selection process, we require you to \r\n* prepare a short 4 minute presentation to be delivered to a small panel of teachers. Which should be delivered orally without powerpoint or any other electronic aid. \r\n* have a formal interview with senior management / headteacher.\r\n* Read a book suitable to a class of children - year group will be given in advance. This will be observed and fed back to the interview panel\r\n* Complete to an acceptable standard a year 6 grammar test and a year 6 maths test\r\n","howSchoolPlacementsWork":"Much consideration is given to placements. Each trainee must undertake 2 school placements to gain contrasting experience of teaching. Full details will be discussed with successful candidates once an offer has been made. All placements will be in the borough of Bromley, Kent.","personalQualities":"We are looking for candidates who want to make a difference to the lives of children. We want you to have a genuine passion for teaching.","otherRequirements":"We do not require candidates to have school / classroom experience before making an application.\r\n\r\nAll successful candidates will be asked to complete health declarations and disclosure and barring service checks  - both must be clear. \r\n\r\nCompetence in English and maths skills will be assessed during the recruitment process.","status":2,"createdAt":"2021-07-06T10:51:43.649Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
