{"id":"6eb6144b-5d6d-4520-a022-b7e865670563","name":"Chemistry","code":"34JP","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"912d4fb4-761b-42e9-8dc6-e968b791ea4e","code":"F1","name":"Chemistry"}],"locations":[{"id":"a4347ed2-36d2-4e41-98f0-2c52017fc03f","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"88e5549a-3fc5-4d67-8eec-eb68ea17a2ed","code":"1T7","name":"Plymouth Teachers and Schools Alliance"},"accreditedBody":{"id":"a4e84530-e1f1-47c6-b57e-ec693d629637","code":"P63","name":"Plymouth Marjon University"},"profPost":"BO","degreeGrade":"1","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feeDetails":"Tuition fees apply","aboutCourse":"A one-year programme centred entirely in our Plymouth schools, where you will be part of a school team from day one. \r\n\r\nYou will benefit from a full 40-week schedule from the start of term in September 2022 to the end of the Summer Term 2023. Complementing your time learning the job in school you’ll receive training from our Specialist Leaders in Education (SLE) and HEI lecturers, and a contrasting second school experience. SLE Learning Hubs have been developed across the city to support subject and pedagogy specialisms. \r\nShared training across the Alliance gives complete and contrasting experiences. \r\n\r\nTrainees are ready for employment after completing their course and support will continue to be provided in your NQT years from your employer, Plymouth Local Authority and Plymouth Teaching School Alliance. \r\n\r\n\r\nThe training will include: \r\n\r\nPlymouth Marjon University Academic Modules and Four Conferences. \r\n\r\nPTSA Subject Knowledge Schedule  (Majority of SK sessions are PTSA SLE led)\r\n\r\nOracy session for all trainees\r\n","interviewProcess":"Teaching Schools such as PTSA  and Teacher Training providers in the South West are in the process of reviewing and forming their course offers for 2021-22 and beyond, in response to a Department of Education system review. \r\n\r\nWe want to give successful PTSA applicants added security, should training providers merge to form a larger regional hub. Therefore all PTSA School Direct offers for 2021-22 will be guaranteed by Marjon University, and a place on the appropriate PGCE programme protected should you choose to accept. \r\n\r\nPlease get in touch if you have any questions. ","howSchoolPlacementsWork":"PTSA School Direct trainees are placed in a Plymouth.\r\n\r\nThe host school placement is the school where you will work for most of the academic year.  \r\n\r\nYou will have a Subject Mentor and a PTSA school-based Professional Tutor in school to support you.  \r\n\r\nYou will have a second placement to gain teaching experience in a complementary school. \r\n\r\nThe HEI provide professional study support and a QA tutor for the PTSA school-based Professional Tutor to link with. \r\n\r\nFor all trainees, the PTSA School Direct programme follows the academic year in the Host School.  That is, it will begin on the first day of school in September and finish when the school year ends in July.","personalQualities":null,"otherRequirements":null,"status":1,"createdAt":"2021-07-12T13:47:56.824Z","updatedAt":"2021-07-28T10:39:24.504Z","canSponsorStudentVisa":"yes","cycle":"2024"}
