{"id":"c2265eba-9d93-4c31-acb9-56fbe5b16396","name":"Primary","code":"3XXF","qualification":"qts","startDate":"2024-05-31T23:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"TA","fundingType":"apprenticeship","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"a4347ed2-36d2-4e41-98f0-2c52017fc03f","name":"Main Site","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"88e5549a-3fc5-4d67-8eec-eb68ea17a2ed","code":"1T7","name":"Plymouth Teachers and Schools Alliance"},"accreditedBody":{"id":"a4e84530-e1f1-47c6-b57e-ec693d629637","code":"P63","name":"Plymouth Marjon University"},"degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"June 2020 - July 2021","feesUK":null,"aboutCourse":"The postgraduate teaching apprenticeship is a school-led initial teacher training (ITT) route that combines paid work with on- and off-the-job training, qualifications, and progression.  It allows candidates to train to become qualified teachers. \r\n\r\nPTSA will provide 20% of the apprentice’s timetable in off-the-job training, designed to build up skills, knowledge and competence in the classroom. \r\n\r\nHaving completed the training, apprentices must demonstrate the knowledge, skills and behaviours contained within the Teachers’ standards. Apprentices will work towards attaining qualified teacher status (QTS). They will need to meet the apprenticeship standard and will need to pass an end-point assessment as required for all apprenticeships. The end goal is to become a qualified teacher. \r\n\r\nSchools will employ the apprentice as an unqualified teacher, and from December 2021 the apprentice will be able to lead their own classes, as long as there is sufficient ‘distance supervision’ in place. \r\n\r\n","interviewProcess":"Teaching Schools such as PTSA  and Teacher Training providers in the South West are in the process of reviewing and forming their course offers for 2021-22 and beyond, in response to a Department of Education system review. \r\n\r\nWe want to give successful PTSA applicants added security, should training providers merge to form a larger regional hub. Therefore all PTSA School Direct offers for 2021-22 will be guaranteed by Marjon University, and a place on the appropriate PGCE programme protected should you choose to accept. \r\n\r\nPlease get in touch if you have any questions. ","howSchoolPlacementsWork":"Apprentices must already have a school in place and willing to host them before applying.\r\n\r\nThe host school placement is the school where you will work for most of the academic year.  \r\n\r\nYou will have a Class Teacher and a PTSA school-based Mentor in school to support you.  \r\n\r\nYou will have a second placement for one term to gain teaching experience in a complementary school. \r\n\r\nThe programme follows the academic year in the Host School.  That is, it will begin in June 2022 and finish when the school year ends in July 2023.","personalQualities":null,"otherRequirements":null,"status":1,"createdAt":"2021-07-12T13:47:56.937Z","updatedAt":"2021-07-28T10:54:47.939Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024"}
