{"id":"f241d293-36fa-404b-a649-eb1aea772a35","name":"Modern Languages (French and Spanish)","code":"V245","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"e34fd2a3-a32e-44e9-aea1-666badf3ac03","code":"22","name":"Spanish"},{"id":"9727f674-61ba-4efa-b1f2-21ec7e354442","code":"15","name":"French"},{"id":"ce8523ef-9236-4cd9-b260-d826c7a521b3","code":"ML","name":"Modern Languages"}],"locations":[{"id":"dc79724f-dcba-4d8b-8d39-1f41989dddd9","name":"King's Leadership Academy Warrington","isPublished":"Y","status":"R","vacancies":"F"},{"id":"1406cccc-bd81-41c7-8ee6-80124682eac6","name":"Kings Leadership Academy Hawthornes","isPublished":"Y","status":"R","vacancies":"F"},{"id":"7d7151d8-2cf3-4e9e-8038-5e3ec679008e","name":"Kings Leadership Academy Liverpool","isPublished":"Y","status":"R","vacancies":"F"},{"id":"f0ceb5f6-f998-4691-a5f3-b3758da45b8a","name":"Kings Leadership Academy Bolton","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"a7b4e077-ce5d-4ec3-ab33-404615fd0e6d","code":"2R7","name":"School Direct at The Great Schools Trust"},"accreditedBody":{"id":"9be9f611-2d36-431a-9109-7fcbbfc88fc8","code":"C99","name":"University of Cumbria"},"profPost":"PG","degreeGrade":"9","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Before taking an equivalency test, please check with us that the course is accepted.","courseLength":"OneYear","feesUK":9250,"feesInternational":14000,"feeDetails":"A range of financial support is available depending on the course you choose including bursary and scholarships for School Direct and payment of a salary for salaried School Direct. \r\n\r\nSchool Direct – Non Salaried Route On the non-salaried training route, you’re entitled to apply for a student loan to cover your costs. There are tax free bursaries available ranging between £7,000 and £24,000 for many secondary subjects.","financialSupport":"For Further Information on Funding and Bursaries, Please visit https://getintoteaching.education.gov.uk/ \r\n","aboutCourse":"If you choose to train to teach with The Great Schools Trust you will benefit from:\r\nClassroom to Boardroom Flightpath.  We provide a course of training that equips you to become an outstanding teacher within 12 months, empowering you with a multitude of career progression opportunities into subject leadership within 4 years and academy leadership within 6 years. \r\nExceptional Training A training needs analysis every 7 weeks ensuring you receive fully personalised CPD, recognising your strengths as well as your needs in developing towards an outstanding practitioner. A CPD mentor will align 2.5 hours of weekly CPD to your needs and aspirations.\r\nExceptional Support Network You will be supported every step of the way through an expert mentoring and coaching network including both an in school professional mentor and subject mentor whom you will meet with weekly. \r\n\r\nExceptional Role Models All training and professional mentoring is values based, follows a research led, evidenced based methodology, delivered by highly skilled, outstanding practitioners. Placements within the trust will supplement opportunities to undertake additional bespoke training and visits to a range of outstanding secondary, special and alternative provision schools.\r\n\r\nExceptional Outcomes We have a very successful history of Initial Teacher Education with over 30 of our staff having undertaken the School Direct Route into teaching. 100% were graded good or better by the end of their training year, 75% achieved outstanding status. On successful completion of the course you will receive Qualified Teacher Status with a PGCE with 60 Masters level credits.","interviewProcess":"We want the interview process to be a highly positive learning experience for you, where you can find out more about our academies, the training year and support programme and how we can help you to become an outstanding teacher.  \r\n\r\nOur selection centre is based at King’s Leadership Academy Warrington. We operate a values-based approach to selection and recruitment which is very much a two way process. Most importantly, you must be sure that the Great Schools Trust’s ethos and training programme is right for you, and then we must ensure that your values and character are the right fit for our organisation. The day will include a tour of the academy, interview and a delivery of a short lesson. \r\n\r\nPrior to the interview we will also offer a series of webinars and reading materials to help you decide if teaching is for you as a career and prepare you for your application and selection day.","howSchoolPlacementsWork":"Although you are in ‘placement’, you will be as valued and respected as any other member of the teaching and leadership team within our academy. Our School Direct course is firmly based on a residency training model in order to maximise opportunities for trainees to apply theory skills into teaching and leadership practice.  \r\n \r\nYou will be placed in one of the following King’s Leadership Academies:\r\nKing’s Leadership Academy Warrington - Woolston, Warrington. \r\nKing’s Leadership Academy Liverpool - Dingle, Liverpool. \r\nKing’s Leadership Academy Hawthornes - Bootle, Liverpool. \r\nKing’s Leadership Academy Bolton – Great Lever, Bolton. \r\n \r\nYour home school placement will be where you will spend the majority of your teacher training. You will be given weekly in school training to enhance your subject knowledge, as well as approaches to teaching. A key part of your training will be understanding and applying our ‘character through leadership’ philosophy into the daily curriculum, which underpins the Great Schools Trust ethos. \r\n \r\nThe University of Cumbria will support you through a mixture of professional and ‘Pedagogy for Learning’ days at both the University of Cumbria (Lancaster Campus) and at our Lead School. Support for all academic assignments will also be provided.\r\n \r\nYou will undertake a contrasting school placement which will enable you to develop your skills further and ensure that you can adapt your teaching skills into any educational setting you choose to specialise in. ","personalQualities":"Highly motivated trainees who want to make a positive contribution to the education of young people, with aspirations to achieve positive outcomes in education. \r\nConfident trainees who are passionate about their own specialism subject, with strong subject knowledge and self awareness for personal development.\r\nCreative trainees who are able to inspire their learners and create a professional environment where everyone wants to succeed.\r\nReflective trainees who will show enthusiasm and a willingness to participate in the all aspects of the training course. \r\nRobust, resilient trainees, who want to make a difference in the classroom, which will enable students to Endeavour.\r\n\r\n","otherRequirements":"","status":1,"createdAt":"2021-07-12T13:48:28.239Z","updatedAt":"2021-09-16T10:56:00.475Z","canSponsorStudentVisa":"yes","cycle":"2024"}
