{"id":"f4435b72-47cc-43bd-92ab-e42ab0db28f9","name":"Primary","code":"39Z2","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"1e787bb8-b23a-43d6-8ad2-8a1fd24f487a","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"fc46147d-83e4-430e-b210-9e0f58c55964","code":"2KT","name":"NET Academies"},"accreditedBody":{"id":"6033093f-acb8-4d05-8239-a622103af18f","code":"F82","name":"Forest Independent Primary Collegiate SCITT"},"degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","aboutCourse":"\r\nThe training focuses on learning through observation of outstanding practitioners. Our trainees work closely with experienced and outstanding teachers to plan for, deliver and assess learning opportunities to ensure pupil progress is paramount.\r\n\r\nMore formal training is provided by a range of experts and practitioners. Training includes the national priority areas of behaviour, SEND and EAL as well as a range of other subjects and educational theory.\r\n\r\nTrainees will spend 4 days per week training in the school setting - this will include opportunities to observe high quality practitioners on a weekly basis. The formal training course (held on Fridays) is situated at our NET Latton Green campus in Harlow.\r\n\r\nAssessment is through a mixture of written assignments, observations and portfolio evidence against the Teacher Standards. The two main assessment tasks consist of a school summary and an action research project. \r\n\r\nFIPC is a good training provider as noted by Ofsted in 2015, who noted that it produces 'strong levels of attainment by trainees and consistently high completion and employment rates.'\r\n\r\n","interviewProcess":"We encourage candidates to visit our school prior to the selection process consisting of the following:\r\n\r\n* The scrutiny of a lesson plan to teach a specified aspect of the curriculum.\r\n* The observation by a head teacher of the applicant delivering a lesson to the agreed year group \r\n* A formal interview\r\n","howSchoolPlacementsWork":"This one-year primary course is based in one school for the majority of the year with a contrast setting placement (lasting 5 weeks). Candidates learn the art of teaching in the classroom for four days each week, guided by their mentors.  \r\n\r\nEach trainee is allocated a professional tutor who visits and supports the trainee on a regular basis. Host schools are able to offer insights into their successful practices and induct trainees in line with the best of current teaching.  \r\n\r\nPart of the course is theory based and there will be formal training each Friday.  School Direct requires a full time commitment of 5 days per week from September to July and trainees are expected to participate fully in the everyday life of the schools in which they train.","personalQualities":"We are looking for people that:\r\n\r\n* are passionate about educating children.\r\n* are good at communicating with adults and children.\r\n* want to be part of something bigger.\r\n* are interested in developing the whole child.\r\n\r\n","otherRequirements":"Offers to the course will be subject to enhanced DBS checks.","status":1,"createdAt":"2021-07-06T10:57:13.884Z","updatedAt":"2021-10-04T11:12:22.067Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"* The salary is unqualified teachers' pay scale point one.  \r\n\r\n* The course fees are paid by the school."}
