{"id":"215511a3-4700-4d3d-a6d3-a9397e1d5e05","name":"Primary (3-7) Early Years","code":"X124","qualification":"pgce_with_qts","startDate":"2022-09-01T09:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"3_to_7","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"4dd8b102-6b22-40b8-af27-c41de872855e","name":"Chelmsford","isPublished":"true","status":"running","vacancies":"none"},{"id":"66df6a89-9a3e-4414-b6fb-09cea879413b","name":"Colchester","isPublished":"true","status":"running","vacancies":"none"},{"id":"f9959a6b-2a1f-47b1-943d-f18334d0aff8","name":"Basildon","isPublished":"false","status":"suspended","vacancies":"both"},{"id":"8ca27381-628b-4b12-86d8-8929855fb246","name":"Harlow","isPublished":"true","status":"running","vacancies":"none"},{"id":"6416683a-7d8e-4c91-b90e-8c832ec9d4d3","name":"Holy Cross College","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"235467b2-657d-43ac-b4d1-bb52d8896608","name":"Main Site","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"47d5d27a-6c49-4990-8071-bdb64f842c90","name":"Main Site","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"c9ee5046-3f49-4804-991b-e99bbe8b2247","name":"Main Site","isPublished":"true","status":"running","vacancies":"full_time"}],"trainingProvider":{"id":"d8c030de-91f2-420d-9ff7-4286c7f913fa","code":"E42","name":"Edge Hill University"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"If you are applying to Edge Hill University and don’t have the GCSEs  required for entry onto one of our PGCE courses, one of our equivalency programmes may be for you.\n\nThe equivalency tests offer you the opportunity to demonstrate that you satisfy our entry requirements for GCSE English, GCSE Mathematics and GCSE Science at Grade C or Grade 4 or above.\n\nWe offer tutor-led revision courses or standalone tests for applicants who feel they do not need tuition.\n\nAll tutor-led revision courses are delivered online, prior to sitting an exam on campus. You can choose to sit our standalone tests either on campus or at Holy Cross College & University Centre on selected dates throughout the year.\n\nFor more details visit [our website](https://www.edgehill.ac.uk/study/equivalency/).","courseLength":"This programme is offered as a one year full-time programme or as a two year part-time programme.  The P/T programme is typically 3 days a week.","feesUK":9150,"aboutCourse":"A one year, full-time, school based route.  Trainees will achieve QTS and be enrolled on a PGCE Programme with the Anglia Ruskin University.   Training is majority school-based with some centre-based training. Training is a blend of face to face and online and occurs at various locations across Essex so we take into account your home address to try to keep travelling time to a minimum.  You will receive training on the general aspects of successful teaching and training around teaching your specific subject in secondary or phase within primary. \r\n\r\nIn school you will work closely with a subject / phase specific mentor and the ITT co-ordinator, who will meet regularly with you to assist you with your training plan.   You will also have an external tutor who works for Essex Teacher Training, who will visit you in school 5 times in the year to check on your progress towards meeting the Teachers' Standards.\r\n\r\nThe PGCE is delivered locally in Essex by Anglia Ruskin University and comprises 2 assignments and related tasks, which are spread across the course of the year.\r\n\r\nTrainees will have access to an online e-portfolio system and online resources along with face to face training sessions.  These along with the excellent support from in-school mentors and tutors from Essex Teacher Training, will mean you will feel fully prepared for working in the classroom.  Your teaching load will start small and increase gradually as the year progresses.  The rate at which this increases will be decided by you and your tutors and take into account any prior experience.\r\n\r\nAssessment is via observations of you teaching, reflective pieces of writing and specific tasks relating to the different Teachers' Standards.\r\n\r\nIf you wish to train on the part-time SCITT programme, this is typically for 3 days a week over the course of 2 years.  The programme is very similar to the one year programme in terms of support and delivery, the only difference being that you will be in school 2 days per week and attend training on 1 day a week.  The majority of centre-based training will take place in Year 1 and you will be enrolled on the PGCE programme in Year 2.\r\n","interviewProcess":"You will be invited to an initial interview with our accredited provider, which will include a short presentation about why you wish to teach and formal interview with a small panel of representatives from Essex Teacher Training.  If successful at Phase I, you will be invited to an interview in one of our partner schools.  This interview could include: an activity with pupils eg teaching part of a lesson, or taking a group activity; a pupil panel interview and a formal interview with a small panel of representatives from the school and wider School Direct partnership.  If successful at Phase II, you will be given a conditional offer of a place to train.","howSchoolPlacementsWork":"Trainees will complete training in two different schools during the course of the year.  Typically trainees spend the autumn term in their host school and then go to a second placement school during the first part of the spring term and then return to their host school for the remainder of the year.  Trainees are in school 4 days a week and attend training on the 5th day. We endeavour to keep travelling time to school to a minimum so we will take into account your home address when allocating a school.  \r\n\r\nThe programme covers the primary age ranges 3-7 and you will be teaching within one of these age ranges.","personalQualities":"We are looking for high quality graduates with a passion for learning who are committed to transforming the lives of young people through education.  ","otherRequirements":"Satisfactory recruitment checks including enhanced DBS, children’s barred list, prohibition order check and reference check.","status":1,"createdAt":"2021-07-06T10:49:43.999Z","updatedAt":"2021-09-25T10:42:52.015Z"}