{"id":"28585f2d-5bd9-4d46-97cb-a493e7956539","name":"Primary (Mathematics Specialist)","code":"X1G2","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"286cf12f-b3e3-41c5-9f33-2ff7807d2df0","code":"03","name":"Primary with mathematics"}],"locations":[{"id":"235467b2-657d-43ac-b4d1-bb52d8896608","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"d8c030de-91f2-420d-9ff7-4286c7f913fa","code":"E42","name":"Edge Hill University"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"If you are applying to Edge Hill University and don’t have the GCSEs  required for entry onto one of our PGCE courses, one of our equivalency programmes may be for you.\n\nThe equivalency tests offer you the opportunity to demonstrate that you satisfy our entry requirements for GCSE English, GCSE Mathematics and GCSE Science at Grade C or Grade 4 or above.\n\nWe offer tutor-led revision courses or standalone tests for applicants who feel they do not need tuition.\n\nAll tutor-led revision courses are delivered online, prior to sitting an exam on campus. You can choose to sit our standalone tests either on campus or at Holy Cross College & University Centre on selected dates throughout the year.\n\nFor more details visit [our website](https://www.edgehill.ac.uk/study/equivalency/).","courseLength":"OneYear","feesUK":9250,"feeDetails":"Subject to eligibility, UK and EU students can apply for a Tuition Fee Loan from the Government to cover the full cost of tuition fees. UK and EU students may also be eligible to apply for additional funding to help with living costs.\r\n\r\nFor more details visit [our website](https://www.edgehill.ac.uk/study/fees-and-funding/).\r\n\r\nFinancial support information for international students can be found [here](https://www.edgehill.ac.uk/international/fees-and-scholarships/).","financialSupport":"Edge Hill University offers a range of scholarships with a competitive application process for prospective full-time PGCE students. These scholarships aren’t linked to academic success and celebrate determination, talent and achievement beyond your coursework, for instance in creativity, enterprise, ICT, performance, sport or volunteering.\r\n\r\nTo find out more about scholarships, to assess your eligibility, and to meet some of our dedicated scholarship winners, visit [our website](https://www.edgehill.ac.uk/scholarships).","aboutCourse":"The presence of a mathematics specialist in every primary school, who will champion this challenging subject, was a key recommendation of the Williams Report, 2008.\r\n\r\nThe PGCE Primary Mathematics Specialist with QTS is a school-led programme which combines on-campus study with training in placement schools and settings.\r\n\r\nYou will train to teach across the 5-11 age range in Key Stages 1 and 2 and achieve the Teachers’ Standards. The training experience is designed to fully prepare you for your first year as a Newly Qualified Teacher (NQT).\r\n\r\nDuring the programme, you will study all of the National Curriculum subjects and you will specialise in mathematics in great depth. You will qualify as a Primary teacher who will also be able to bring a passion for mathematics and excellent mathematics subject knowledge to a first teaching post.\r\n\r\nSuccessful completion of this PGCE will lay the foundations for you to become a leader in mathematics, generating enthusiasm for mathematics among children, and modelling and leading others in the development of enriching, engaging and challenging lessons.\r\n\r\nThe presence of a Mathematics specialist in every primary school, who will champion this challenging subject, was a key recommendation of the Williams Report, 2008.\r\n\r\nThe PGCE Primary Mathematics Specialist with QTS is a school-led programme which combines on-campus study with training in placement schools and settings.\r\n\r\nYou will train to teach across the 5-11 age range in Key Stages 1 and 2 and achieve the Teachers’ Standards. The training experience is designed to fully prepare you for your first year as a Newly Qualified Teacher (NQT).\r\n\r\nDuring the programme, you will study all of the National Curriculum subjects and you will specialise in Mathematics in great depth. You will qualify as a Primary teacher who will also be able to bring a passion for Mathematics and excellent Mathematics subject knowledge to a first teaching post.\r\n\r\nSuccessful completion of this PGCE will lay the foundations for you to become a leader in mathematics, generating enthusiasm for Mathematics amongst children, and modelling and leading others in the development of enriching, engaging and challenging lessons.","interviewProcess":"","howSchoolPlacementsWork":"On the Primary PGCE programme we work with a range of schools predominately in the North West working with just under 700 settings in 2018/19, but also includes distance placements such as Luton and The Isle of man or the opportunity to be placed from an alternative address e.g. Northern Ireland.\r\n\r\nTrainees are placed with children aged 5 to 11 years for the majority of their training and usually undertake two discreet placements, with an opportunity for an enhancement opportunity outside of the primary curriculum within Early Years, Special Educational Needs and Disabilities (SEND) or Key Stage 3 settings for ten days. The two longer blocks of up to 60 days each, in Key stage 1 and Key Stage two.\r\n\r\nTrainees develop their approaches to all aspects of the role of the teacher initially working with and teaching small groups, the placements are developmental, and the teaching responsibility increases accordingly. Trainees undertake a range of in school training experiences linked to the requirements of the placement and their own individual training needs.\r\n\r\nTrainees are allocated to placements based on a range of criteria including their geographical location, but also in relation to their training needs and requirements.\r\n\r\n","personalQualities":"When you apply, you are expected to have:\r\n\r\n* A commitment to, and understanding of, primary education, demonstrating the personal attributes, values and motivation required to train as a teacher\r\n\r\n* Suitable presentational qualities, including a good standard of written English.","otherRequirements":"If you accept a formal offer from Edge Hill University you will be required to meet the Department for Education’s standards for physical and mental fitness to teach and clearance to work with children. \r\n\r\nFurther information, including a Declaration of Health questionnaire and details of how to apply for a [Disclosure and Barring Service (DBS)](https://www.edgehill.ac.uk/dbs) Enhanced Disclosure will be sent to you after you have firmly accepted an offer. ","status":1,"createdAt":"2021-07-06T10:54:17.355Z","updatedAt":"2021-09-30T14:31:05.298Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
