{"id":"4f92aaea-f88b-4c53-838d-17f5c5e3c601","name":"History","code":"V1X1","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"5a3609a0-5bbb-4377-b919-5d89932ab622","code":"V1","name":"History"}],"locations":[{"id":"235467b2-657d-43ac-b4d1-bb52d8896608","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"d8c030de-91f2-420d-9ff7-4286c7f913fa","code":"E42","name":"Edge Hill University"},"profPost":"BO","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"A degree equivalent to UK first-class or second-class honours (2:2 or above) in a relevant subject from a UK university. Other subjects may be considered if you have an A Level in History.","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"If you are applying to Edge Hill University and don’t have the GCSEs  required for entry onto one of our PGCE courses, one of our equivalency programmes may be for you.\n\nThe equivalency tests offer you the opportunity to demonstrate that you satisfy our entry requirements for GCSE English Language and Mathematics at Grade C or Grade 4 or above.\n\nWe offer tutor-led revision courses or standalone tests for applicants who feel they do not need tuition.\n\nAll tutor-led revision courses are delivered online, prior to sitting an exam on campus. You can choose to sit our standalone tests either on campus or at Holy Cross College & University Centre on selected dates throughout the year.\n\nFor more details visit [our website](https://www.edgehill.ac.uk/study/equivalency/).","courseLength":"OneYear","feesUK":9250,"feeDetails":"Subject to eligibility, UK and EU students can apply for a Tuition Fee Loan from the Government to cover the full cost of tuition fees. UK and EU students may also be eligible to apply for additional funding to help with living costs.\r\n\r\nFor more details visit [our website](https://www.edgehill.ac.uk/study/fees-and-funding/).\r\n\r\nFinancial support information for international students can be found [here](https://www.edgehill.ac.uk/international/fees-and-scholarships/).","financialSupport":"Edge Hill University offers a range of scholarships with a competitive application process for prospective full-time PGCE students. These scholarships aren’t linked to academic success and celebrate determination, talent and achievement beyond your coursework, for instance in creativity, enterprise, ICT, performance, sport or volunteering.\r\n\r\nTo find out more about scholarships, to assess your eligibility, and to meet some of our dedicated scholarship winners, visit [our website](https://www.edgehill.ac.uk/scholarships).","aboutCourse":"This long-established, popular programme incorporates high quality tutoring and excellent placement support with opportunities to work with leading practitioners from the world of history education. You will be encouraged to develop innovative and modern approaches to teaching and learning, including the use of ICT, to make you a high quality and successful history teacher at secondary school level.\r\n\r\nThe programme aims to develop reflective and analytical skills as well as providing practical experience in planning effective lessons and learning strategies, hands-on classroom experience, and opportunities to explore different aspects of your subject knowledge.\r\n\r\nIf you are a graduate and want to excite the imagination and develop the historical awareness of secondary school pupils aged 11 to 16, this is the programme for you.","interviewProcess":"","howSchoolPlacementsWork":"We work with a range of schools and settings across the North West predominately, working with just over 200 settings in 2018/19. There may be opportunities beyond the North West, but this is considered on a bespoke basis but includes distance placements such as Luton, The Isle of man and the opportunity to be placed from an alternative address e.g. Northern Ireland. \r\n\r\nTrainees are placed with children aged 11 to 16 years and undertake assessed placements in at least two different settings. All trainees engage with additional experiences during the programme including Key Stage 2 and transition, Special Educational Needs and Disabilities, post-16 teaching and learning and working with learners for whom English is an Additional Language\r\n\r\nHands-on classroom experience, opportunities to further subject knowledge and establishing a wide range of exciting, innovative and interactive teaching methods are integral to the programme. Trainees develop their own learning skills and reflect upon, and take charge of, their own development as a trainee teacher. Trainees gain knowledge of how children learn and how their needs differ. The essential strategies for the core skills of planning, assessment, teaching and classroom management, along with an understanding of the education system, and of the wider professional role of a teacher in school are embedded throughout the trainees’ journey.\r\n\r\nPlacements vary in length from three day enhancements in specialised settings, up to sixty-nine days block placements. \r\n\r\nTrainees are allocated to placements based on a range of criteria including their geographical location, but also in relation to their training needs and requirements.\r\n","personalQualities":"When you apply, you are expected to have:\r\n\r\n* A commitment to, and understanding of, secondary education, demonstrating the personal attributes, values and motivation required to train as a teacher\r\n\r\n* Suitable presentational qualities, including a good standard of written English\r\n\r\n* Satisfactory levels of Information and Communications Technology competence","otherRequirements":"If you accept a formal offer from Edge Hill University you will be required to meet the Department for Education’s standards for physical and mental fitness to teach and clearance to work with children. \r\n\r\nFurther information, including a Declaration of Health questionnaire and details of how to apply for a [Disclosure and Barring Service (DBS)](https://www.edgehill.ac.uk/dbs) Enhanced Disclosure will be sent to you after you have firmly accepted an offer. ","status":1,"createdAt":"2021-07-06T10:54:17.251Z","updatedAt":"2021-09-30T15:10:44.050Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
