{"id":"d5cd8ba0-d80c-48e7-8dc9-b870e7ba3042","name":"Post-14 Education","code":"X341","qualification":"pgde","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","subjectLevel":"further_education","isSend":"no","subjects":[{"id":"9de4b2d2-5739-4c34-92d2-9b4384760298","code":"41","name":"Further education"}],"locations":[{"id":"235467b2-657d-43ac-b4d1-bb52d8896608","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"d8c030de-91f2-420d-9ff7-4286c7f913fa","code":"E42","name":"Edge Hill University"},"profPost":"PG","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"You should have a degree equivalent to UK first-class or second-class honours (2:2 or above) in a subject that is clearly part of the Further Education and Training curriculum. For applicants with a degree in a subject not related to the Further Education curriculum, other suitable Level 3 qualifications may be considered if these are supplemented by appropriate professional experience.","english":"9","maths":"9","science":"9","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"If you are applying to Edge Hill University and don’t have the GCSEs  required for entry, one of our equivalency programmes may be for you.\n\nThe equivalency tests offer you the opportunity to demonstrate that you satisfy our entry requirements for GCSE English Language and Mathematics at Grade C or Grade 4 or above.\n\nWe offer tutor-led revision courses or standalone tests for applicants who feel they do not need tuition.\n\nAll tutor-led revision courses are delivered online, prior to sitting an exam on campus. You can choose to sit our standalone tests either on campus or at Holy Cross College & University Centre on selected dates throughout the year.\n\nFor more details visit [our website](https://www.edgehill.ac.uk/study/equivalency/).","courseLength":"OneYear","feesUK":9250,"feeDetails":"Subject to eligibility, UK and EU students can apply for a Tuition Fee Loan from the Government to cover the full cost of tuition fees. UK and EU students may also be eligible to apply for additional funding to help with living costs.\r\n\r\nFor more details visit [our website](https://www.edgehill.ac.uk/study/fees-and-funding/).\r\n\r\nFinancial support information for international students can be found [here](https://www.edgehill.ac.uk/international/fees-and-scholarships/).","financialSupport":"Edge Hill University offers a range of scholarships with a competitive application process for prospective full-time PGCE students. These scholarships aren’t linked to academic success and celebrate determination, talent and achievement beyond your coursework, for instance in creativity, enterprise, ICT, performance, sport or volunteering.\r\n\r\nTo find out more about scholarships, to assess your eligibility, and to meet some of our dedicated scholarship winners, visit [our website](https://www.edgehill.ac.uk/scholarships).","aboutCourse":"The most recent Ofsted inspection (June 2014) judged Edge Hill University’s initial teacher education for further education to be Outstanding. The report commended “the exceptionally high-quality training in further education” which “develops deeply reflective trainees, guided by expert mentors who help them to attain outstanding outcomes.”\r\n\r\nThis programme carries eligibility for Qualified Teacher Learning and Skills (QTLS) status. Since April 2012, QLTS has been approved by the Department for Education as being equivalent to Qualified Teacher Status (QTS) for schools and therefore there is the possibility of teaching in a school if your specialist subject is part of the curriculum for the given age range.\r\n\r\nA PGDE in Post-14 Education will provide you with an endorsed qualification that can be used to teach or train in the Further Education/Lifelong Learning sector. It is suitable for those who are looking to enter teaching in the sector for the first time, as well as those who are already working in further education, a work-based learning setting, the voluntary sector or in public sector training such as the Police, Fire Service, Health Service and Prison Service. The programme will provide you with a wide range of practical skills and the insights to support you in becoming a confident and credible teacher or trainer of the highest quality.","interviewProcess":"","howSchoolPlacementsWork":"Colleges, schools and other settings are selected for trainees from within the Edge Hill partnership and Professional Practice placements are allocated to each trainee against their subject specialism/s and experience. There may also be opportunities for trainees to deliver across different subjects such as functional skills and subject to geographical and setting availability.\r\n\r\nFor the Further Education PGCE, trainees require a minimum of 100 hours teaching across the course of the programme, usually in the same setting.\r\n\r\nWe currently work with a range of different providers across the North West, which varies depending on the particular specialist subjects that providers offer, however if a trainee has any contacts with settings we will follow up on their behalf if it is a suitable placement. \r\n\r\nTrainees will gain experience teaching pupils aged 14 years and older if placed within a school or training provider, although most of the settings are Further Education Colleges and will be 16 years plus. \r\n\r\nThis programme carries eligibility for Qualified Teacher Learning and Skills (QTLS) status. Since April 2012, QLTS has been approved by the Department for Education as being equivalent to Qualified Teacher Status (QTS) for schools and therefore there is the possibility of teaching in a school if your specialist subject is part of the curriculum for the given age range.\r\n\r\n","personalQualities":"When you apply, you are expected to have:\r\n\r\n* A commitment to, and understanding of, further education, demonstrating the personal attributes, values and motivation required to train as a teacher\r\n\r\n* Suitable presentational qualities, including a good standard of written English\r\n\r\n* Satisfactory levels of Information and Communications Technology competence","otherRequirements":"If you accept a formal offer from Edge Hill University you will be required to meet the Department for Education’s standards for physical and mental fitness to teach and clearance to work with children. \r\n\r\nFurther information, including a Declaration of Health questionnaire and details of how to apply for a [Disclosure and Barring Service (DBS)](https://www.edgehill.ac.uk/dbs) Enhanced Disclosure will be sent to you after you have firmly accepted an offer. ","status":1,"createdAt":"2021-07-06T10:54:17.388Z","updatedAt":"2021-09-30T15:21:30.294Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
