{"id":"fbdeca0e-f70b-4535-b6ea-cff8ad7f845a","name":"Primary with Mathematics","code":"38RW","qualification":"pgce_with_qts","startDate":"2024-07-31T23:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"286cf12f-b3e3-41c5-9f33-2ff7807d2df0","code":"03","name":"Primary with mathematics"}],"locations":[{"id":"98b6fa67-fedd-45a8-bd35-a8a7c43c4a0c","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"cf768993-ee90-457e-96db-057c593ac1d3","code":"24H","name":"Flying High Futures SCITT – Inspiring Leaders Teacher Training"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"Candidates are offerred equivalencies where they have accepted their places with ILTT.","courseLength":"OneYear","feesUK":9250,"feesInternational":9250,"financialSupport":"\r\nOn our course, trainees are entitled to the same financial support as other teacher training courses. Those from the UK or EU are eligible for student loans in order to help cover tuition fees and maintenance.\r\n\r\n\r\nFor more information visit our websites:\r\n(https://www.inspiringleadersscitt.com)\r\n(https://www.flyinghighpartnership.co.uk)\r\n\r\n0116 3184066 or email us at info@iltt.org.uk\r\n","aboutCourse":"“The quality of training across the partnership is outstanding. A fully comprehensive training programme is in place and ensures complete coverage of the primary curriculum.” Ofsted 2017\r\n\r\n\r\nThis programme aims to support you to become an outstanding primary class teacher, whilst developing your knowledge in maths, with the view that you will use this specialism to impact on our schools as you progress through your career. \r\n\r\nOur SCITT / School Direct training route provides all trainees with a blend of school experience underpinned by an innovative and thorough taught programme, leading to the award of QTS and a PGCE, with our partners Nottingham Trent University. \r\n\r\nTrainees spend the greatest proportion of their time in school – please see ‘how placements work’.\r\n\r\nThe taught programme is delivered by outstanding practitioners, who work as teachers in our schools and as leaders of their subjects. This includes English, Maths, Science, Teaching & Learning, Inclusion and the Foundation Subjects – all up to date theory and practice that is being used with high impact in our schools now. As practising teachers who also guide other schools, our trainers have a wealth of current experience and ideas that you can use. The taught days, alongside a range of fun and immersive opportunities, including our residential, will ensure that you remain motivated throughout the programme and driven to become an exceptional teacher:\r\n“Laura, Tom and Cath inspired us throughout the programme, kept us going when things got hard and gave us new and innovative ideas to try in the classroom”- ILTT Trainee 2017/ 18.\r\n\r\nIn addition, you will have the opportunity to access specialist training days and experiences to develop your specialism in Maths, overseen by a national mastery specialist teacher.\r\n\r\nNottingham Trent University provide the PGCE qualification, which brings 60 masters credits. Sessions on campus give you academic underpinning to your teaching practice, with two assignments that weave into your experience in school. The first module takes place with the general primary course and covers Learning Theory, the second module and research project focuses on Maths.\r\n\r\nYour progress across the course is supported by our highly experienced Professional Tutor team, who will give pastoral/developmental support over the year, ensuring that you are able to make the most of the course. \r\n\r\n [For more information about our course, click here] (https://www.inspiringleadersscitt.com/the-course)\r\nRead comments from our trainees about how our training course inspired them via twitter page @ilscitt\r\n\r\n\r\n","interviewProcess":"\r\n\r\n“Leaders are constantly evaluating the recruitment and selection processes to make sure they attract high-quality candidates with the skills, the moral purpose and the ‘staying power’ to be a successful teacher” – Ofsted 2017\r\n\r\n\r\nSelecting the right people to train with us in our schools is of utmost importance.\r\nOur interviews are now virtual using MS Teams/Zoom and  we aim to make you feel relaxed enough to show us who you really are.\r\nThe interview includes includes: \r\n•\tan opportunity to find out more about us;\r\n•\tan formal interview in which we find out more about you and establish whether you are suitable to train with us and in our schools;\r\n•\tA lesson talk through that you will pre-plan which the interviewer will then ask you to expand on during the interview. (Full details are provided prior to the interview)\r\n•\tsafeguarding & identity checks.\r\n\r\n[Applying to our course] (https://www.inspiringleadersscitt.com/applying)\r\n","howSchoolPlacementsWork":"“The highly practical, school-based nature of the training which is valued by the trainees because it means they learn from the very best teachers’ practice and are given the time to apply their learning, academic research and training in their own classroom situations.” Ofsted 2017\r\n\r\nYour time in school is the largest part of the training and that in which you apply learning from different strands. It is in school where your teaching is shaped and your individual development needs addressed.\r\nSchool placements are not just about being in class – you will be part of the school team, taking a full part in the life of the school and making a real difference to the experiences for the children.\r\nOur General Primary course will require you working in two contrasting schools across our partnership.\r\nWe call these placements your host and your alternative school. You will complete your placement at your host school in the Autumn and Summer term, whilst your alternative placement will be completed in the Spring term. With each placement, you will change year group to gain experience over three age phases: Year 1 or 2; Year 3 or 4; Year 5 or 6.\r\nHost placements are decided based on your home location, your access to transport and other needs. \r\nAlternative placements are still arranged considering your travel, but are also selected to give you a contrasting experience and meet your emerging needs.\r\n\r\nIn each placement you will work in partnership with a Class Mentor, to the advantage of the children, planning and reviewing together. Your class mentor will give you on-going advice and model good practice.\r\nYour professional progress will be supported by an experienced teacher in school – your Learning Coach, who will observe and meet with you weekly.\r\n“I am in no doubt that the support I received from my in-school learning coach enabled me to complete this course and secure my first job as a teacher”- trainee 2017/18\r\n\r\nYour Professional Tutor will work closely with your host school and make visits during the placements.\r\n\r\n\r\n[For more information about our course, click here](https://www.inspiringleadersscitt.com/the-course)\r\n","personalQualities":"At Inspiring Leaders Teacher Training we are looking for 5 key qualities in our trainee teachers. These key qualities are what we think you will need in order to help you become a Qualified Teacher.\r\n*Emotional Intelligence and Resilience\r\n*Knowledge and Professionalism\r\n*Creativity\r\n*Good Communication Skills\r\n*A Capable Reflector\r\nWe are looking for candidates that are determined to change the lives of children and will put relationships at the heart of everything you do. If you are determined to make an impact on children’s lives, we will support and develop you to be a successful teacher. \r\n","otherRequirements":"\r\nPlease be aware that the welfare of our children is our highest priority, and all offers of training places are subject to DBS, identity and reference checks.\r\n\r\n\r\nCall us on 0116 318 4066 or email (info@iltt.org.uk)\r\n(https://www.inspiringleadersscitt.com)\r\n(https://www.discoveryschoolstrust.org.uk/)\r\n","status":1,"createdAt":"2021-07-06T10:53:06.967Z","updatedAt":"2021-10-05T09:07:46.004Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
