{"id":"007f7908-cd02-429e-870b-e41c8e22e3a3","name":"Primary","code":"2NY6","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"d3b3d90c-d52b-4a82-8684-f5570c7beed9","name":"Sparkenhoe Community Primary School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"16750442-7610-4767-a9bd-6055df156a16","code":"1RL","name":"Sparkenhoe School Direct"},"accreditedBody":{"id":"3e6c62a3-5d34-4a91-9c23-01c7409fd909","code":"L34","name":"University of Leicester"},"profPost":"BO","degreeGrade":"0","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"We offer a School Direct route into teacher training. This means part of your training will be school based and part of it will be University based.\r\nAll of our successful trainees will achieve a PGCE from the University of Leicester, 90 Masters Credits and QTS (Qualified Teacher Status).\r\nThe course is full time from the end of August until the following July. You will either be working in our schools or at the University of Leicester for academic study.\r\nYou will be assessed on written assignments and practical teaching in schools. You will have a University tutor and school based tutor for support, as well as mentors and lecturers.\r\nSparkenhoe School Direct is based at Sparkenhoe Primary School which operates as the Lead School for the group of schools we work with. We organise your teaching placements for you and manage your time in school. Our experienced teachers will be delivering Maths and English training for you.\r\nWe usually recruit up to 6 trainees meaning we can really get to know our cohort each year. Many candidates are attracted to our course because of its personal and friendly nature.\r\nOur candidates get to be part of our small, supportive group whilst having the benefits of being able to interact with their fellow PGCE trainees from other courses whilst at the University.\r\nIn addition to the three block teaching placements you will also visit different schools as part of a series of 'focus days', studying specific subject and professional topics in an intensive school-based context.\r\n","interviewProcess":"We operate a two stage interview process:\r\nThe school based stage includes preparing an activity for a small group of children and an informal interview.\r\nThe University stage includes debate, discussion, role-play and a formal interview.\r\nThe school based stage usually comes first. You must be successful at each stage to be offered a place.\r\n","howSchoolPlacementsWork":"We work with a number of schools both in the city and county.\r\n\r\nAs part of our School Direct course you will be placed in up to 3 different schools of contrasting location and setting. \r\n\r\nSome students spend 2 placements in one school and 1 in another while other students spend 1 placement in 3 different schools.\r\n\r\nWe will liaise with you to offer you the best range of placements to suit your needs and experiences. As the Lead School, we organise all of your placements with you in mind.\r\n\r\nWe currently offer placements across the whole Primary age range from Nursery to Year 6. Foundation Stage (age 3-5) KS1 (age 5-7) Lower KS2 (age 7-9) and Upper KS2 (age 9-11).\r\n\r\nYou will also visit different schools as part of a series of 'focus days', studying specific subject and professional topics in an intensive school-based context.\r\n\r\nThe school-based time is a vitally important element of the course. You will have the opportunity to observe skilled class teachers working and to discuss the things that underpin day-to-day classroom activities, as well as work alongside experienced teacher-mentors who will support your learning about classroom practice.\r\n\r\nTeaching Experience 1\r\n\r\nThis is a paired placement with two students working together in one class. It gives you the opportunity to work with a partner to develop classroom skills in a supportive environment. You will focus on developing observation skills to support your understanding of teaching and learning and to put your learning into practice. During this Autumn Term placement you and your partner will work towards taking an increased responsibility for teaching the class.\r\n\r\nTeaching Experience 2\r\n\r\nThis takes place in the Spring Term. The amount of time spent teaching the class increases over the placement until you have responsibility for up to 80% of the timetable.\r\n\r\nTeaching Experience 3\r\n\r\nThis is the Summer Term placement with students working towards taking responsibility for 80% of the teaching timetable.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n","personalQualities":"We are looking for passionate, enthusiastic applicants who want to make a difference in children's lives.\r\nWe want candidates who show a real commitment to want to shape and support the development of young children. We want people who acknowledge the huge impact teachers can have in children's lives.\r\nWe are looking for people who will gain real reward and job satisfaction from helping children flourish in every way.\r\n","otherRequirements":"We hope our candidates have spent some time in school before applying so that we feel they are making an informed career choice. This is desirable rather than essential.\r\nSuccessful applicants will require a full DBS check.\r\n","status":1,"createdAt":"2021-07-06T10:50:13.871Z","updatedAt":"2021-10-13T08:10:46.282Z","canSponsorStudentVisa":"yes","cycle":"2024"}
