{"id":"cabba549-7cb7-490a-8049-9fe43973bb12","name":"Mathematics","code":"2N64","qualification":"pgce_with_qts","startDate":"2024-07-31T23:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"72345aa7-096c-488f-8649-085b8178cadb","code":"G1","name":"Mathematics"}],"locations":[{"id":"23148eb5-f000-43fe-9ca9-73aec27fdca0","name":"Ormiston Chadwick Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"68eb2afb-5d3b-4da4-9115-c8d653168717","name":"The Heath School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"e8f2c47a-0731-4ef9-90b3-8b1cc3a18c9e","name":"Culcheth High School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"55270d06-2b50-4280-8b49-724d4fb76d5b","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"},{"id":"c4b03515-45d7-4aba-bc56-3b3e59944f40","name":"St Anselm's College","isPublished":"Y","status":"R","vacancies":"F"},{"id":"c78f3615-9002-4d7f-9764-fd011ef0c100","name":"The Prescot School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"d907cf6c-b11c-4379-bb76-f9c12b607e04","code":"1DO","name":"The Heath Consortium"},"accreditedBody":{"id":"ec34b77c-cba3-4598-93be-23f0471adff1","code":"L51","name":"Liverpool John Moores University"},"profPost":"BO","degreeGrade":"1","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":14000,"feeDetails":"There are a range of ways in which you can arrange to pay your course fees, including in monthly instalments.","financialSupport":"You may be eligible for financial support while you study, including bursaries, scholarships and loans. \r\n\r\nFinancial support if you’re from outside of the UK. \r\n\r\nFinancial support from the training provider\r\n\r\nHardship bursaries may be available for some students, depending on individual circumstances.\r\n\r\nA contribution towards travel to school placements may be made in some circumstances.\r\n","aboutCourse":"The  Heath Consortium Maths PGCE course, offered in collaboration with Liverpool John Moores University, is taught by experienced and friendly staff, who were all successful teachers and maintain strong links with schools. You will join a community of students at Education Building, Maryland St, L1 9DE for University – based sessions, which begin with a Summer School during the last week of August.\r\n\r\nOur student teachers normally spend 4 days in school and Fridays at the University. Throughout the year 10 days of training take place, delivered by The Heath Consortium with some additional days at LJMU. Student teachers spend the majority of time (at least 120 days) in schools.\r\n\r\nThe Maths programme will focus predominantly on developing your subject knowledge and subject pedagogy so that you have the knowledge, understanding and skills needed to become a confident Maths teacher. School – led sessions will develop your understanding in key areas related to our school context.University lead lectures and seminars will develop your confidence in a range of relevant issues; classroom and behaviour management; meeting individual needs and inclusion; planning and assessment etc. There is a strong emphasis on social justice issues in education and on mental health and well-being. We want you to develop into an inclusive and reflective teacher, with the skills, energy and resilience needed to make a real difference in schools.\r\n\r\nIn order to achieve Qualified Teacher Status, you will demonstrate that you are able to meet all the requirements of the Teachers’ Standards. This aspect of assessment is largely undertaken by our school-based mentors. School mentors and LJMU colleagues are in regular contact with all trainees on placement, undertake co-observations of their teaching and Quality Assure the school-based training across the Partnership.\r\n\r\nThe Postgraduate Certificate is assessed through 2 Modules. The Award of QTS is integral to one of these academic Modules. You will also complete one essay, in two parts which asks you to reflect on your practice,\r\n","interviewProcess":"All applicants who meet the entry requirements will be invited to attend a interview.\r\n\r\nThe day will consist of: (interview arrangements are subject to change, dependent on the current Covid-19 restrictions, we will advise accordingly.)\r\n\r\n* A panel interview\r\n* A short 20 - 30 minutes teaching task to a small group of Year 7 students (you will need to prepare and provide a lesson plan for this.)\r\n* A short literacy test\r\n","howSchoolPlacementsWork":"Your school-based experience takes place largely in a Home School, supported by well- trained mentors. We have found that being in a Home School ensures that you are fully integrated into school life and get to know staff, pupils and your subject mentor extremely well, to the benefit of all involved. Our School Direct programme is supported by LJMU, a member of LJMU staff is attached to each school and is responsible for visiting regularly in order to support all trainees and their mentors. \r\n\r\nAll trainees are entitled to weekly review and feedback meetings with their mentors and to tutorials with LJMU staff. This “wraparound” care ensures that you are consistently supported from start to finish, both personally and professionally.\r\n\r\nIn addition to the time spent in a Home School, you will also undertake an alternative placement of roughly 6 weeks in a contrasting school between January and February. This placement has an explicit focus on diversity and inclusion. Additional experiences are also often provided for instance through visits to Special Schools and to Primary Schools. Although The Heath Consortium programmes focus on 11-16 experience, many trainees also gain experience of Post 16 planning and teaching during their school experience.\r\n\r\nSchool experience is structured in Phases, beginning with an observation phase, so that you can develop appropriate confidence and competence,  taking on greater responsibility for planning and teaching as the year progresses. Your final assessment for QTS is conducted at the end of the year.\r\n\r\n","personalQualities":"We are looking for applicants who have a passion for their chosen subject and wish to share their passion with young people. You should have a genuine belief that education transforms life chances and want to make a positive difference to young people and to their communities.  At interview we hope to see your enthusiasm along with evidence of some experiences which have informed your decision to become a teacher. A minimum of 5 days’ work experience in a UK secondary school is helpful prior to commencing the programme. We can help to arrange this for successful applicants.","otherRequirements":"You will also be required to meet the Department for Education’s standards for physical and mental fitness to teach and clearance to work with children. Further information, including a Declaration of Health questionnaire and details of how to apply for a Disclosure and Barring Service (DBS) Enhanced Disclosure will be sent to you after you have firmly accepted an offer.\r\n\r\nYour offer is conditional on completing ALL conditions of entry. These will be made available on UCAS.\r\n","status":1,"createdAt":"2021-07-06T10:53:15.596Z","updatedAt":"2021-10-04T17:51:47.865Z","canSponsorStudentVisa":"yes","cycle":"2024"}
