{"id":"f5826c7b-e390-4739-89d0-89d8962c0688","name":"Chemistry","code":"278V","qualification":"pgce_with_qts","startDate":"2023-07-31T23:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"912d4fb4-761b-42e9-8dc6-e968b791ea4e","code":"F1","name":"Chemistry"}],"locations":[{"id":"23148eb5-f000-43fe-9ca9-73aec27fdca0","name":"Ormiston Chadwick Academy","isPublished":"Y","status":"R"},{"id":"55270d06-2b50-4280-8b49-724d4fb76d5b","name":"Main Site","isPublished":"Y","status":"R"},{"id":"68eb2afb-5d3b-4da4-9115-c8d653168717","name":"The Heath School","isPublished":"Y","status":"R"},{"id":"c4b03515-45d7-4aba-bc56-3b3e59944f40","name":"St Anselm's College","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"d907cf6c-b11c-4379-bb76-f9c12b607e04","code":"1DO","name":"The Heath Consortium"},"accreditedBody":{"id":"ec34b77c-cba3-4598-93be-23f0471adff1","code":"L51","name":"Liverpool John Moores University"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","aboutCourse":"The Salaried course at The Heath Consortium is offered in collaboration with LJMU and is aimed at applicants with prior experience. This normally involves previous employment in a school-setting but other career changers are welcome to apply. Applicants for this employment-based route must apply with the support of a school who is willing to employ them as an unqualified teacher for the duration of the programme.\r\n\r\nThe Salaried programme includes a Postgraduate Certificate, alongside Qualified Teacher Status. The PGCE is assessed through 2 Modules. The Award of QTS is integral to one of these academic Modules. You will also complete one essay, in two parts which asks you to reflect on your practice. The PGCE will be taught by experienced and friendly staff from LJMU and you will join a community of students at Education Building, Maryland St, L1 9DE for University – based sessions, which begin with a Summer School during the last week of August.\r\n\r\nAs a Salaried School Direct trainee you may be expected to teach up to 90% of a teacher timetable and be responsible for the planning, teaching and assessment of your class(es) from early on in the year. Trainees on the salaried programme are selected, recruited and employed directly by schools, and often continue teaching in their school following training.\r\nIn order to achieve Qualified Teacher Status, you will demonstrate that you are able to meet all the requirements of the Teachers’ Standards. This aspect of assessment is largely undertaken by our school-based mentors. LJMU staff are in regular contact with all trainees on placement, undertake co-observations of their teaching and Quality Assure the school-based training.\r\n","interviewProcess":"All applicants who meet the entry requirements will be invited to attend a interview.\r\n\r\nThe day will consist of: (interview arrangements are subject to change, dependent on the current Covid-19 restrictions, we will advise accordingly.)\r\n\r\n* A panel interview\r\n* A short 20 - 30 minutes teaching task to a small group of Year 7 students (you will need to prepare and provide a lesson plan for this)\r\n* A short literacy test","howSchoolPlacementsWork":"Your school-based experience takes place largely in your employing school, supported by well- trained mentors. A member of LJMU staff is attached to each school and is responsible for visiting regularly in order to support trainees and their mentors. Relationships are very close and constructive.\r\n\r\nAll trainees are entitled to weekly review and feedback meetings with their mentors and to tutorials with LJMU staff. This “wraparound” care ensures that you are consistently supported from start to finish, both personally and professionally.\r\n\r\nIn addition to the time spent in a Home School, you will also undertake an alternative placement of roughly 2 weeks in a contrasting school.\r\nAdditional experiences are also often provided for instance through visits to Special Schools. Your final assessment for QTS is conducted at the end of the year.\r\n","personalQualities":"We are looking for applicants who have a passion for their chosen subject and wish to share their passion with young people. You should have a genuine belief that education transforms life chances and want to make a positive difference to young people and to their communities.  At interview we hope to see your enthusiasm along with evidence of some experiences which have informed your decision to become a teacher. A minimum of 5 days’ work experience in a UK secondary school is helpful prior to commencing the programme. We can help to arrange this for successful applicants.","otherRequirements":"You will also be required to meet the Department for Education’s standards for physical and mental fitness to teach and clearance to work with children. Further information, including a Declaration of Health questionnaire and details of how to apply for a Disclosure and Barring Service (DBS) Enhanced Disclosure will be sent to you after you have firmly accepted an offer.\r\n\r\nYour offer is conditional on completing ALL conditions of entry. These will be made available on UCAS.\r\n","status":1,"createdAt":"2021-07-06T10:53:14.447Z","updatedAt":"2021-10-04T16:54:02.622Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"Please contact The Heath Consortium for more information regarding salary."}
