{"id":"53e9238e-9272-4b3c-8f8b-f7c8b3c0997e","name":"Art and Design","code":"2KTM","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"d461a678-3335-4ca2-9616-1dc479d31a49","code":"W1","name":"Art and design"}],"locations":[{"id":"68cfbed5-1f73-40fe-ac2f-cf5fb14fa77d","name":"Grey Court School","isPublished":"N","status":"N","vacancies":"F"},{"id":"519f381a-e861-48b6-ba91-043b4c8033b0","name":"Grey Court School","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"e8a86c7e-57c3-40d6-bc7e-d71df5d19fb4","code":"22S","name":"Grey Court Training School"},"accreditedBody":{"id":"049fe65f-08dc-4686-9ac8-606dce490128","code":"G56","name":"Goldsmiths, University of London"},"profPost":"PG","degreeGrade":"0","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"You will learn how to teach Art to students aged 11-16 and will be able to observe lessons in the AS and A-Level classes. Teaching is also about instilling a passion for your subject into young minds. We will support you to develop your teaching skills to be able to convey your knowledge effectively in order to enthuse your students about learning and making progress in your subject. \r\n\r\nCourse structure:\r\nThe course structure is progressive. First, you observe the experienced teachers, then you start to team teach, leading short parts of their lessons, and finally you the lead to teach the whole lesson. Throughout your placement, you are guided and supported by a trained and experienced mentor whom you will meet weekly. You will also have at least 1 day a week at the university in the first term, to focus on the theories of teaching and learning Art in schools. \r\n\r\nProfessional studies: \r\nYou will also have in school weekly training sessions, meeting all the trainees together.  learning about practical tips and theories to teach effectively and support your understanding to enable you to develop your strategies to meet the Teachers Standards. \r\n\r\nTime spent in school:\r\nYou will be in school Monday to Friday. Your timetable to be on average 7 to 9 lessons in your first placement and up to 16 lessons in the second placement. \r\n\r\nAssessment: \r\nYou are assessed through formal lesson observations weekly, as well as informal lesson observations. The teachers observing will provide some feedback to enable you to make progress and meet the Teachers Standards termly. \r\n\r\nWorkload:  \r\nYou will need to write your own lesson plans, with support from our mentors, and colleagues in your department. The university will guide you for the assignments you will need to write. \r\n\r\nLocations:\r\nYou will train in 2 different schools, and we will do our best to place you as near as possible to your home address. ","interviewProcess":"The interview panel: \r\nYou will be interviewed at school by the Art tutor at Goldsmith (if available),  the Grey Court Training School Director and the Head of Art of the school. In a face to face interview, 3 to 4 students will also be part of the interview panel as you will be asked to prepare and teach them a 15 minutes mini-Art lesson. \r\nWe are interested in your potential to teach and interaction with youngsters.\r\n\r\nIn an online interview, you will be asked to present the structure of a mini-lesson. This will be followed by standards teaching and learning questions. \r\n\r\nSecond interview: \r\nThis might be requested by the university. \r\n\r\nOther interview elements: \r\nAs part of the interview, you will be asked to respond to an educational article, a video clip about teaching or to some scenarios. You will also need to bring your Art portfolio with you to present it. ","howSchoolPlacementsWork":"Placements:\r\nYou will have 2 placements in 2 different schools.\r\n\r\nSchools selection: \r\nWithin the Grey Court raining School Partnership and South West region network of schools. All placements are within faculties and departments who are  experienced in training teachers. \r\n\r\nAverage distance: \r\nWe try our best to place you as near as possible to our home address. \r\n\r\nAge ranges:\r\nYou will be teaching students aged 11 to 16 and observe 17-18 lessons if possible. \r\n\r\nPartner schools: \r\n10 partner schools within Richmond and Kingston boroughs, and 6 schools within the South West London Teaching School network. ","personalQualities":"We are looking to recruit candidates who have a real passion for their subjects and the ability to transfer their subject knowledge effectively to enable young people to learn, enjoy and make progress in the Art learning. \r\nSelf-motivation and reflective qualities are crucial to teaching. Having a talent for public speaking, problem solving, taking initiatives and being able to receive constructive feedback to act upon it are essential traits in teacher training, ","otherRequirements":"Criminal records checks and fitness to teach medical checks will be carried out. ","status":0,"createdAt":"2021-07-06T10:47:17.592Z","canSponsorStudentVisa":"yes","cycle":"2024"}
