{"id":"9945b449-8dff-42d4-bcd0-3ce338272276","name":"Primary","code":"334X","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"68cfbed5-1f73-40fe-ac2f-cf5fb14fa77d","name":"Grey Court School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"e8a86c7e-57c3-40d6-bc7e-d71df5d19fb4","code":"22S","name":"Grey Court Training School"},"accreditedBody":{"id":"ef172d85-20e4-4aa2-96d0-9e3ae81f526d","code":"S64","name":"St Mary’s University, Twickenham"},"profPost":"PG","degreeGrade":"0","english":"1","maths":"1","science":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"As a Primary SD student teacher, you be be studying the skills and knowledge needed to teach young children from the ages of 4 to 11, ensure they have good numeracy and literacy levels before going to secondary school. Your training will develop your lesson planning skills and assessment work based on standards set out in the curriculum. This will be achieved through high quality professional studies at the university and the school experience placements.  \r\nYour  communication skills and excellent literacy and numeracy skills are essential for this role. ","interviewProcess":"Your first interview will take place at the university. \r\nYou will then be interviewed in school by the Teaching School Director with a Senior teacher at the school. This will give you the opportunity to have a clear idea about the school environment and ethos. \r\nAs part of the interview process in school, you will \"teach\" a mini-lesson of 15 minutes maximum with a small group of students (6 maximum). This will enable us to assess your communication and interaction with youngsters. There will also be a written task. ","howSchoolPlacementsWork":"There will be 2 placements during your training. September until Christmas in the first school, then January until May in the second school. \r\nThe schools are selected within the Grey Court alliance school partners which are all good or outstanding schools. On average, we do our best to place you in schools which are within 15 miles to your home address, but we do look at personal circumstances as well as your transport personal means. \r\nGrey Court Alliance has 10 school partners which include primary and secondary schools.  ","personalQualities":"We are looking for candidates who have experience with children, a genuine passion for teaching, and a talent for public speaking. \r\nYou will need to have the following attributes: \r\nSelf-motivated \r\nOrganised \r\nResilient \r\nApproachable \r\nTeam player \r\nListener \r\nProblem solver \r\nIT literate \r\nInnovative ","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:47:17.727Z","updatedAt":"2021-11-02T10:38:46.434Z","canSponsorStudentVisa":"yes","cycle":"2024"}
