{"id":"55ca3f94-718f-4638-a75d-cbb32a0b9980","name":"Primary","code":"3B3B","qualification":"qts","startDate":"2024-07-31T23:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"2_to_7","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"bd67e91a-1e9b-4a8c-b68c-170cee7a5f48","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"},{"id":"3be95968-eb74-420b-b3ab-469deadac0e4","name":"CEYP, St. Thomas Nursery School and Children's Centre","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"3c2b7bb3-71cc-4ae3-87b8-88f18b27d6d1","code":"2KO","name":"Warwickshire Early Years Hub"},"accreditedBody":{"id":"d06d9c3c-a3da-402b-9dfa-ab814cd0489c","code":"25R","name":"CREC Early Years Partnership"},"degreeGrade":"9","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"For candidates who need to undertake equivalency tests we will direct them to undertake these with Birmingham City University and can provide the relevant information.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"This course will give you the skills to teach children during their most important phases of development. \r\nYou will access a one year, full-time, Early Years, school based route to qualification as an Early Years or Primary Teacher with Qualified Teacher Status (QTS) and a specialist focus on 2-7 years (including the DfE designated age phase of Foundation Stage (3-5yrs), and KS1 (5-7yrs).  Along with covering all Teaching Standards, the training includes an emphasis on multi-agency working, leadership in the EYFS, working with 2-year olds, SEN/D and practitioner research.  It benefits from direct contributions from highly experienced teacher educators and a team of EY specialists and placement mentors.\r\nThe SCITT programme encompasses an induction and four accredited modules delivered by the CREC Early Years Partnership (CEYP) through 40 days of face to face teaching and 10 days of placements and directed study.  They are taught at level 7 and will provide the knowledge required to teach the Foundation Stage and KS1 Curriculum and the professional/pedagogic skills required to lead children’s learning across the Foundation years and KS1.\r\nYour school based training will take place in a range of good and outstanding schools and you will experience placements across Coventry and Warwickshire Nursery, Infant and Primary Schools for a total of 135 days  on the job training. You will complete an EYFS placement in your 'home' school and placements in KS1 in a 'host' school.  There is also an opportunity to access specialist placement days, for example observing practice in a special school. \r\nOn completion of the course, successful trainees will have met requirements of the Teacher Standards (2012) and will be able to demonstrate understanding and application of reflective practice and practitioner research.  Trainees will complete their PG Cert alongside their QTS and this is accredited by Birmingham City University (but delivered at CREC). This comprises 3 x 3000 word assignments which require Trainees to consider the application of theory to their own classroom practice and their reflections on this process. \r\nTrainees will have also gained 60 credits towards a masters level qualification. \r\nOfsted has rated the ITT programme as 'Good' (2017) and currently has a 100% employment rate for graduates.\r\n","interviewProcess":"Once your application is submitted, your application will be reviewed by the Early Years Hub team.  Your suitability to teach will be assessed via an interview, Criminal Records Check (DBS) and references. The interview process has now been adapted in the light of current circumstances around Covid-19 and attempts to limit its transmission.  \r\nYou will be asked to submit a 500 word written piece of work (title will be given to you if invited to interview), complete a straight-forward timed exercise with questions relating to data in EY and one final question asking for reflections on practice. You will then take  part in a 30 minute on-line interview.  In place of an observed teaching session, which we are not currently asking candidates to undertake due to Covid 19, we will also ask for a practice  reference from your employer. \r\nAll applicants are given feedback and notification is given via DfE of the outcome of the selection process. Successful applicants will usually be given targeted activities to complete before commencing, to ensure that they are as equipped and prepared as possible to successfully complete the course. All offers are made subject to Applicants obtaining satisfactory DBS clearance and Occupational Health clearance.","howSchoolPlacementsWork":"\r\nThe Warwickshire Early Years Hub has 11 members and additional strong links with other Warwickshire and Coventry schools.  We place trainees in schools that are either good or outstanding and where we are confident you will be supported by experienced and highly professional school mentors. We will always try and place you in schools that suit your circumstances and your training needs.  Your ‘home’ school for the autumn and summer term will be in a Foundation Stage class, where you will become immersed as a full member of the EYFS team from the beginning to the end of the academic year.  Your spring term will be spent at a ‘host’ school, which will provide you with Key Stage 1 (ages 5-7 years) experience.  You will work alongside an experienced KS1 teacher, gradually assuming more responsibility for teaching and learning within that classroom. You will be supported by a school mentor during each of these phases to help you meet the course expectations and to provide guidance. There will be specialist visits to complement your training and match your particular areas for development or interest.\r\n","personalQualities":"We are seeking trainees who can demonstrate:\r\n\r\n* Commitment to teaching and learning and a passion for Early Years. \r\n* An understanding of children as learners.\r\n* Recent experience of working with young children in an early years setting.\r\n* An understanding of educational issues and a clear educational philosophy.\r\n* An ability to establish effective working relationships.\r\n* A good standard of written and spoken English.\r\n* Commitment to progressing and taking responsibility for your own professional development. \r\n* An understanding of the demands of this school based route, an ability to work under pressure and emotional resilience.  ","otherRequirements":"Although there is no minimum requirement for work experience in schools we do expect applicants to be able to describe and reflect upon the way in which schools and teachers operate and how children learn. We would recommend that you undertake some form of classroom experience (particularly in the Early Years) to support your application. \r\nDBS clearance, and 'fitness to work' occupational health checks will be carried out prior to commencing the course.\r\n","status":1,"createdAt":"2021-07-06T10:51:32.354Z","updatedAt":"2021-08-01T07:01:07.541Z","canSponsorStudentVisa":"no","cycle":"2024"}
