{"id":"775bd02a-1e20-4564-ac28-0c0c5cb08e01","name":"Business Studies","code":"32D7","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"14_to_19","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"de6477b2-6027-48e6-b9f7-3206774705c2","code":"08","name":"Business studies"}],"locations":[{"id":"8f7ede1a-a22f-4251-991c-1dceb689be2b","name":"Havering Teacher Training Partnership Office","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"d4456a4a-cfcc-4451-a178-cde0016546a7","code":"1GJ","name":"Hall Mead School"},"accreditedBody":{"id":"f83184c0-eda1-4c5b-a6b4-5954bf7c6e66","code":"H17","name":"The Havering Teacher Training Partnership"},"profPost":"PG","degreeGrade":"1","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Approved equivalency tests;\nhttps://www.equivalencytesting.com/\nhttps://astarequivalency.co.uk/","courseLength":"OneYear","feesUK":null,"aboutCourse":"HTTP training is school based and trainees have benefitted from working with highly experienced classroom practitioners in a challenging but supportive environment.  Havering is a successful outer London Borough and almost all local secondary schools are partners.  As a result, we are able to carefully match trainees to a suitable school department ensuring that aspiring teachers have the best possible start.\r\n\r\nThe programme has established an enviable reputation and is well regarded by head teachers: our long term employment figures are exceptionally strong.   Our training sessions are provided by practising expert teachers from Partnership schools. They are thematically structured, blending pedagogy and practice, to equip trainees will the necessary skills and knowledge to become confident practitioners.  \r\n\r\nTraining takes place in a number of the Partnership's schools so that theory can be blended with current practice and trainees can experience \"Schools in Action\".  Most central training sessions will be at Bower Park Academy in a suite of dedicated rooms.\r\n\r\nStaff will monitor your progress and be available to support your development. We take great care to ensure all trainees are valued members of staff.  \r\n\r\nA senior member of HTTP staff works closely alongside each trainee and small tutorial groups ensure personal attention. Training is held weekly guaranteeing  regular contact with other trainees; weekly challenges will be set to ensure you apply the skills taught in the classroom and challenge yourself weekly. In addition, subject specific training is enhanced by the work of our highly skilled team of Subject Leaders to develop subject pedagogy.\r\n\r\nWe provide a PGCE for all trainees based upon 2 written essays, a viva and an eportfolio of evidence based on successful classroom performance.  This internationally recognised qualification will open doors so you can teach locally or travel the world.\r\n\r\nIn the current University of Buckingham's \"Good Teacher Training  Guide\" this programme is in the top ten in the country for employment.\r\n\r\nQuite simply, we pride ourselves on providing the highest quality entrants to the profession to make a difference to the lives of young learners.","interviewProcess":"The Havering Teacher Training Partnership will coordinate the recruitment process and support you to make the right decision for your training. If shortlisted, you will be invited to be interviewed by our Management team to determine whether you will make a suitable teacher. You will be expected to complete a short presentation and to show an understanding of teaching in your subject specialism.  After the initial interview, you will be asked to take a literacy and numeracy test via an online meeting.\r\n\r\nIf successful, you will attend a second interview hosted by a Partner School or Schools with an interest in employing a trainee teacher in your subject area where your subject knowledge will be assessed in further detail and where you will be expected to demonstrate your practical teaching skills. support and understanding along your journey.\r\nOur interview process is rigorous, fair and thorough. As the school direct route is challenging, we work hard to achieve the best match of applicants to the available places in schools, which is why our close relationships with our partnership schools enables us to personalise your support. \r\n\r\nWhilst we ask a lot from potential trainees; we ask more from our partner schools to support your training. Each school will provide a subject mentor and a Professional tutor, as well as a link course tutor. We also boast past trainees in all of our partner schools who can offer informal support.\r\n.","howSchoolPlacementsWork":"On this route, you will be employed by one of our partner schools but will also benefit from half a term's experience in a contrasting school. From the beginning, you will be treated like a member of staff and will attend staff meetings and training days. You will be in school from the first day of the school year to the last so you will feel part of the team from the outset and we will equip you with skills in lesson planning and behaviour management, before your teaching commences.\r\n\r\nYou will be teaching pupils in both KS4 and KS5 during the year in one of our 15 partner schools. The Partnership is an accredited ITT provider currently working with the following schools:  Bower Park Academy, The Brittons Academy, Harris Rainham Academy, The Coopers Company and Coborn School, Campion School, The Drapers' Academy, Emerson Park Academy, The Frances Bardsley Academy, Hall Mead School,  Hornchurch High School, Marshalls Park Academy, Redden Court School, Royal Liberty School, The Sacred Heart of Mary Girls' School and  Sanders  School.\r\n\r\n\r\nThe long established nature of the Partnership ensures you will be placed in a school and a department where HTTPP can be confident you will thrive.","personalQualities":"We are looking for the right blend of subject expertise and people skills to be able to impact upon the development of our young people. \r\n\r\nWe will expect you to speak clearly and coherently, and be comfortable talking to adults and students in a range of situations. You must be ready to accept constructive criticism to get the most from the experienced practitioners we will place you with. \r\n\r\nPassion for your subject is not optional! We will embrace your passion, drive and energy to support you to grow your teacher identity and become an effective practitioner.\r\n\r\n","otherRequirements":"You will have spent some time in an all-ability state school secondary school observing or possibly in paid employment. Alternatively you may have worked with teenagers in a voluntary capacity. We understand that early applicants may still be in the process of finding a school to visit or looking to gain experience if at all possible - we may be able to help with this if short-listed for interview.","status":1,"createdAt":"2021-07-06T10:54:41.101Z","updatedAt":"2021-09-22T13:25:09.426Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"You will be paid a minimum salary of point 1 on the unqualified teacher scale.\r\n\r\nFees of £7,000 are usually, but not always, paid by the employing school.\r\n"}
