{"id":"66598933-9759-4ae5-b417-252c1f03f0df","name":"Primary (Special Educational Needs)","code":"2T53","qualification":"pgce_with_qts","startDate":"2024-07-31T23:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"yes","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"2f5b710a-b5ad-4cb7-9e45-d2cfd20a435c","name":"Palmerston School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"dba51c7a-85a2-4b11-b033-04c4a1f29203","name":"Liverpool John Moores","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"b1367bab-7945-439d-8705-4c5b51ff06e1","code":"1AE","name":"Palmerston School"},"accreditedBody":{"id":"ec34b77c-cba3-4598-93be-23f0471adff1","code":"L51","name":"Liverpool John Moores University"},"profPost":"PG","degreeGrade":"1","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"Where candidate do not have a GCSE, we accept the Edge Hill Equivalency Certificates only.","courseLength":"September 22 - July 2023","feesUK":9250,"feesInternational":14000,"aboutCourse":"This School Direct course offers a good mixture of university led PGCE training and school led SEN focus sessions. The SEN focus sessions will take place at Palmerston School.\r\n\r\nParticipants will spend time in 3 schools, 2 SEN settings and 1 Primary mainstream setting.\r\n\r\nSchool settings are across Merseyside. ","interviewProcess":"Successful applicants will be interviewed at Palmerston School by the School Direct manager, and two Headteachers. Interviews take place over the course of a day and includes time spent supporting / observing students in class as well as writing a short reflection. \r\n","howSchoolPlacementsWork":"Participants will benefit from three separate school placements. \r\n\r\nHome school placements will be in an SEN setting and will take place over two terms (generally Autumn and Summer). These may be in a Primary or Secondary Special School.\r\n\r\nMainstream Primary placements will be over a half term (6 week period).\r\n\r\nAlternative special placements will also be over a half term (6 week period).","personalQualities":"A keen interest in SEN provision within all types of settings both mainstream and special, is essential. The motivation to ensure all learners receive a quality education that is suited to their needs is also deeply important. \r\nAn adaptable and flexible approach is required, alongside a willingness to work with learners with all types of SEN (may include but will not be limited to Severe Learning Difficulties / Profound and Multiple Learning Difficulties / Autism Spectrum Conditions / Social Emotional and Mental Health conditions). ","otherRequirements":"You will also be required to meet the Department for Education’s standards for physical and mental fitness to teach and clearance to work with children. Further information, including a Declaration of Health questionnaire and details of how to apply for a Disclosure and Barring Service (DBS) Enhanced Disclosure will be sent to you after you have firmly accepted an offer. \r\n\r\nYour offer is conditional on completing ALL conditions of entry. \r\n","status":1,"createdAt":"2021-07-06T10:56:33.712Z","updatedAt":"2021-10-05T11:25:46.965Z","canSponsorStudentVisa":"yes","cycle":"2024"}
