{"id":"7e2c1fb8-cf28-4e97-a347-ed1f02559b85","name":"Primary","code":"2XNN","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"6b622f89-495b-4dca-b0bf-8e36170e93e7","name":"St Mary's CE Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"e6988a52-986f-4688-a79e-f0af55c3262a","name":"Binsted CE Controlled Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"7302cdaf-a27f-4077-a7df-97fcf04a3eba","name":"Bentley CE Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"f4508657-e280-44e9-b7a7-c7869bcc07c7","name":"Anstey Junior School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"74a186cf-70b4-45cf-946b-a0cfb506e903","name":"The Butts Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"6303109e-c0ca-4f3e-a3ed-2e0c0edee176","name":"Andrew's Endowed CE Aided Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"92771281-b0d0-4dd5-824c-558ef5bb1019","name":"Chawton CE Controlled Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"51a3513f-e4a4-4fd4-9007-b9f3f0fe5172","name":"Alton Infant School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"28f24ffc-7ad1-44ac-b720-65575b7851f5","name":"Bushy Leaze Early Years Centre","isPublished":"Y","status":"R","vacancies":"F"},{"id":"eea8d389-6627-4786-af4d-7ae6ece26d51","name":"Wootey Junior School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"76696e67-053b-4b5e-9355-f322f0c28ef1","name":"Medstead CE Controlled Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"695e685d-702d-4c56-ad4e-ccd9101dc11b","name":"Rowledge CE Controlled Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"a60d8892-828a-417f-b4c5-52207b5bb5cb","name":"Wootey Infant School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"e6e151c4-9ade-4a53-8b81-359e06a521d3","name":"Selborne CE Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"0619d0b3-95a9-4835-b593-284d11ef9e16","name":"Saint Lawrence CE Primary School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"b7671104-4799-47f1-89d3-f8f0be7c908f","code":"2BY","name":"Alton Schools Teaching Alliance"},"accreditedBody":{"id":"3700fb02-7007-40c8-9127-b070e146d6cb","code":"W76","name":"University of Winchester"},"profPost":"BO","degreeGrade":"9","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"Please contact admissions@winchester.ac.uk for confirmation of the equivalency tests accepted","courseLength":"OneYear","feesUK":9250,"feeDetails":"The tuition fees for September 2022 entry are £9,250 for UK, EU and Islands (Channel Islands and Isle of Man) students, however the tuition fee for students outside the EU are yet to be confirmed for 2022 entry. Please contact studentsandmoney@winchester.ac.uk in the autumn for confirmation of the fee.\r\n\r\nVisit our website [www.altonschools.com](https://www.altonschools.com) to discover a variety of tools and articles that can help you with your application and finances.","aboutCourse":"We are really proud of our course, and know that it helps create brilliant teachers. So much so, many of our graduates have secured positions as Newly Qualified Teachers within our alliance schools, or in local partner schools.\r\nThe course prepares you to teach across the age ranges 4-11 and is structured around six modules - a combination of taught modules based at the University and placement modules based in schools or educational settings.\r\nYou will undertake studies in all elements of primary education; extend your knowledge of learning and teaching, of the breadth and scope of the curriculum and the professional skills associated with high-quality teaching. You will then apply these areas of understanding and skill to classroom practice throughout the year, including during two assessed placements in schools or educational settings.\r\n\r\nAt a glance, our School Direct programme includes:\r\n\r\n*\t12 core training days at the University of Winchester.\r\n*\tFull-time learning alongside our expert teachers who have a wealth    of knowledge, experience and strategies to pass on.\r\n*\tSpecialist focus training days within the Alliance. \r\n*\tA minimum of 2 placements in two different phases and schools.\r\n*\tThree University assessed assignments. \r\n*\tOn-going assessment of the quality of your teaching and learning.\r\n*\tA select cohort – the number of spaces available on our  programme   is purposefully kept low.  This is to benefit you as a student - you will be known and recognised within the Alliance, receiving personal attention and opportunities. \r\n\r\nUpon successful completion of the course, you will be awarded a PGCE with recommendations for the award of Qualified Teacher Status (QTS).\r\n\r\nVisit our website [www.altonschools.com](https://www.altonschools.com) to discover a variety of tools and articles that can help you with your application and finances.","interviewProcess":"All applications should be submitted via UCAS (code 2BY).    If you already meet or are expected to meet our entry requirements, and have demonstrated your passion and commitment to teaching in your application, you will be invited to attend an interview. The interview is your chance to demonstrate your potential to become a successful teacher, as well as making sure that the programme and placement is right for you.  You need to be very clear about why you want to become a teacher, the skills involved and what you can bring to the profession. \r\n\r\nThe interview panel is made up of senior staff from partnership schools and a representative from The University of Winchester.\r\nInterviews may include:\r\n\r\n*\tA tour of the school.\r\n*\tA reading activity with children.\r\n*      A short mathematics activity\r\n*\tA written task.\r\n*\tA formal interview.\r\n\r\nThe interview is also your chance to find out more about the course, the University and our alliance of schools, so if you are invited to interview please take the opportunity to visit our websites beforehand.\r\n[altonschools.com](https://www.altonschools.com)\r\n[www.Winchester.ac.uk](https://www.winchester.ac.uk/)\r\n\r\nIf you would like a tour of one of the Alton Cluster schools and a chat with a Headteacher before you apply, please do get in contact: info@altonschools.com \r\nIf you are located outside the UK we are able to arrange video conference or telephone interviews.\r\n","howSchoolPlacementsWork":"Our programme includes a minimum of 2 placements in two different phases and schools.\r\nThere are 15 schools in the Alton Cluster of our alliance, enabling us to offer a wide range of teaching experiences in Good and Outstanding; rural and town; infant, junior and all-through primary schools.  \r\nOur schools are located in Alton and the surrounding villages in East Hampshire, they are: \r\nAlton Infant; Andrews' Endowed CofE Primary; Anstey Junior; Bentley CofE Primary, Binsted CofE Primary, Bushy Leaze Nursery, Chawton CofE Primary, Medstead CofE Primary; Rowledge CofE Primary; Saint Lawrence CofE Primary; Selborne CofE Primary; St Mary's Bentworth CofE Primary; The Butts Primary; Wootey Infant and Wootey Juniors.  \r\n\r\nYour main placement could be in any one of these schools, and the school will be selected to give you the widest range of experience necessary to develop your skills and interests, and to fill any training gaps that have been identified.  There will also be opportunities for specialist visits such as Early Years Foundation Stage, Special Educational Needs, Maths, secondary experience days or behaviour for learning.\r\n","personalQualities":"We will look for evidence of a commitment to the teaching profession, an understanding of professional requirements, and an awareness of current educational issues in an application. \r\nPrior experience in a school is not a requirement, however prospective students may find experience in a school useful for obtaining insights into the primary education classroom. Experience in a school or similar setting may also provide reassurance to prospective students that teaching is the right choice for their career.","otherRequirements":"If you accept an offer of a place you will be required to complete a Disclosure and Barring Service (DBS) criminal records check and Prohibition Order check.\r\nIf you have worked overseas in the last 5 years you may be required to obtain criminal records checks from each of the countries you have worked in. \r\nYou will also be required to complete an occupational health check to confirm that you are fit to teach. \r\nThe University of Winchester will send you more information about when and how you need to complete each of these checks if you accept our offer.","status":1,"createdAt":"2021-07-06T10:50:41.251Z","updatedAt":"2021-10-11T07:10:35.898Z","canSponsorStudentVisa":"yes","cycle":"2024"}
