{"id":"18838c15-ea22-4e32-9a82-ca610fd24371","name":"Computing","code":"2786","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"e6be6a9c-8696-4b88-8fbd-1ba1bef1b6fc","code":"11","name":"Computing"}],"locations":[{"id":"0a7317ef-7b40-4637-a86e-076db283b1da","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"edad87dc-9350-40ce-9752-e74cedd2688e","code":"1HR","name":"George Spencer Academy SCITT"},"profPost":"PG","degreeGrade":"1","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9000,"feeDetails":"School Direct Training Route: Fees are £8,750 for QTS* only and £9,000 for QTS* with PGCE. You’ll pay in two instalments – 75% by 1 September and the remainder by 31 October.\r\n\r\nQTS* (*The title of this award is subject to change due to an ongoing government consultation. For the latest information, please visit https://consult.education.gov.uk/teaching-profession-unit/strengthening-qts-and-improving-career-progression/ )","aboutCourse":"We have an excellent heritage as an accredited ITT provider and in the 21 years we’ve been operating we’ve had superb results. \r\n\r\nIn 2015 we were named by the ‘Good Teacher Training Guide’ as one of the Top 10 teacher trainer providers in the country and the second best primary teacher trainer nationally.\r\n\r\nOur course completion, employment and trainee satisfaction rates have been consistently high. We believe this is down to our commitment, capability and credibility, which is underpinned by our ethos of bringing out the best in every individual.\r\n\r\nYou’ll be in school from the first day of the new school year, and as such you’ll be very much part of the team, treated as a member of staff and joining in with staff meetings and development days. You’ll also be given a comprehensive induction programme, so you can familiarise yourself with all that’s expected of you.\r\n\r\nOur weekly professional studies and subject knowledge programmes give you the perfect opportunity to meet and network with your fellow trainees, and are essential to developing your skills and knowledge as a teacher. We offer full training in areas such as learning technologies, special educational needs, lesson planning and behaviour management. \r\n\r\nYou’ll be supported by two mentors in school – one from your subject area and another senior member of staff. This is your opportunity to create a personalised training programme which will meet your own specific learning goals and ultimate ambitions. \r\n\r\nPractical and academic skills are assessed throughout the course via various methods including lesson observations, directed training tasks, mentor assessments and formal assignments (PGCE). \r\n\r\n\"I would highly recommend the George Spencer SCITT course to anyone that is interested in classroom teaching. My training was, by far, the most challenging but most rewarding year. The commitment, individualism and, most importantly, support that was in place for me as a training teacher was excellent and couldn’t be faulted.\"\r\nTrainee 2018/19\r\n","interviewProcess":"You will be invited to attend a one day interview at GSA or a partner school where you will be welcomed by a member of the GSA SCITT team. You will be interviewed by the Director of ITT or the Teacher Pathways Leader and a subject specialist from GSA or one of our partner schools.\r\n\r\nYou will spend time in the faculty and observe teaching in your subject. You will also give a 5 -10 minute presentation to students in a class regarding your interest in your subject area and your motivation to teach. \r\n\r\nAt interview you will be given the opportunity to demonstrate your subject knowledge through a 10 minute mock lesson.\r\n\r\nYou will undertake a series of tasks designed to assess your subject knowledge including Maths and English proficiency. This will give us an insight into what study you may need to take prior to starting your training year with us.\r\n\r\nFollowing the end of the process we invite you to reflect on your day and communicate this to us in writing which also serves as further evidence of your ability to reflect and your proficiency in written English.\r\n\r\nThroughout the day you will be able to meet staff and students, ask questions and seek support with the next steps open to you.  There will also be an opportunity to meet an existing or former SCITT trainee.\r\n","howSchoolPlacementsWork":"We believe contrasting placements are the key to a rich and diverse training experience, so as well as your main placement school you’ll also spend five or six weeks in another school. You will undertake a series of shorter placements in other environments such as a special school and feeder primary school. This means you’ll be exposed to all kinds of teaching experiences and challenges, gaining a clear insight on how to teach a full spectrum of learners in a range of school contexts.\r\n\r\nWe have close links with a number of selected partner Secondary schools across the East Midlands, which enables you to access a diverse range of establishments during your teaching practice. Our network of partner schools offer you a breadth of experience and the opportunity to train in schools of different sizes and specialisms.\r\n\r\nTrainees are asked to express a preference for their choice of placement schools and whilst this cannot be guaranteed, we consider every trainee's individual circumstances to ensure the best possible placement. \r\n\r\nBy the end of your programme, you’ll have transformed from a watchful observer to an active participant, taking on full classroom responsibility and preparing yourself well for an Early Career Teacher timetable.\r\n","personalQualities":"*Desire and passion to become a teacher and to challenge and inspire your students.\r\n*Excellent interpersonal and communication skills, with proficiency in both written and spoken English.\r\n*Strong subject knowledge and an understanding of it in the context of educating young people.\r\n*Commitment to high standards and excellence.\r\n*A wider understanding of the purpose of education.\r\n*Resilience and determination to succeed both as a trainee and as a teacher.\r\n*The ability to meet the mental and physical demands of classroom teaching.\r\n","otherRequirements":"*Applicants with relevant industrial or commercial experience are very welcome to apply along with career changers.\r\n*DBS Checks.\r\n*Occupational Health Assessment.\r\n*References.\r\n\r\n","status":1,"createdAt":"2021-07-06T10:53:26.704Z","updatedAt":"2021-07-15T14:13:14.696Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
