{"id":"06c3d52e-2560-4b20-a792-94c1d7a4223a","name":"Religious Education","code":"V6X1","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"724b5d16-28dd-4431-bc17-ea4be4daedc4","code":"V6","name":"Religious education"}],"locations":[{"id":"ad3694a6-6bf8-4cd0-a8bf-e6a3564dc4b2","name":"Main Site","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"b011427a-6dff-4a77-9df3-c85a54be605a","code":"Y75","name":"York St John University"},"profPost":"PG","degreeGrade":"1","english":"2","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We only accept equivalency tests from www.equivalencytesting.com","courseLength":"OneYear","feesUK":9250,"feesInternational":12750,"aboutCourse":"We work together with schools, mentors, subject communities and other education professionals to train outstanding Religious Education teachers.\r\n\r\nThis route, which is currently only available for the Religious Education subject specialism, means spending more time in academic sessions based at the University compared to the school-centred option. You will still have plenty of opportunity to build your teaching experience with school placements throughout the year.\r\n\r\nYour school placements will build your skills and confidence as you progress towards Qualified Teacher Status, while your academic sessions will deepen your understanding both of your subject and your profession. Our Schools Teaching Alliance partners work with us to develop our courses and to give you the best possible experience of teaching and learning.\r\n\r\nWe are committed to delivering outstanding education and training that is current and relevant. You will develop your knowledge and understanding of  both Religious Education and wider educational issues. You will leave us ready to be an outstanding teacher and leader with a strong professional identity.\r\n\r\nFor full course information, please see the York St John University website:\r\nhttps://www.yorksj.ac.uk/courses/postgraduate/education/secondary-education-re-pgce/","interviewProcess":"","howSchoolPlacementsWork":"The programme employs a range of learning and teaching strategies, including enquiry based and active learning approaches. You are encouraged to develop a strong sense of your personal professional identity as subject teachers and are nurtured to develop your own philosophy and values about secondary education. Tutors and school-based mentors are available to guide you.  There are also a range of enrichment opportunities within the programme such as trips and events and the opportunity to engage with the wider professional RE community.\r\n\r\n","personalQualities":"","otherRequirements":"You must obtain a satisfactory Disclosure and Barring Service (DBS) enhanced disclosure check and/or any other appropriate background check. \r\n\r\nYou will need to obtain a satisfactory medical report.\r\n\r\n","status":2,"createdAt":"2021-07-06T10:47:24.398Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
