{"id":"181d1770-10d1-4632-9cde-511943081ea6","name":"Primary","code":"W673","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"068a50af-95f1-459a-8c8b-0eaa9dd9ad1e","name":"Robert Wilkinson Primary Academy","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"b011427a-6dff-4a77-9df3-c85a54be605a","code":"Y75","name":"York St John University"},"profPost":"PG","degreeGrade":"0","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feeDetails":"The course tuition fees for UK students in 2022 to 2023 are £9,250.\r\n\r\nEbor Academy Trust offers the unsalaried route.\r\n\r\nYou will be able to apply for a Tuition Fee Loan from your funding body to cover the cost of your fees. You will be required to begin repayment of the loan once you are earning over the repayment threshold. \r\n\r\nMore details can be found at\r\n\r\n(https://www.yorksj.ac.uk/students/your-finances/)","financialSupport":"Ebor Academy Trust do not currently offer any financial support, however there is a range of support you can access.\r\n\r\nYou can get government support. This includes a Tuition Fee Loan to cover the cost of your fees and a Maintenance Loan that will help towards your living costs, which you only start to pay back once you have left university and are earning over repayment threshold.\r\n\r\nFinancial guidance can also be found on the YSJ website\r\n\r\n(https://www.yorksj.ac.uk/students/your-finances/)","aboutCourse":"Ebor Academy Trust and York St John University works in partnership to deliver high quality teacher education and training which leads to a PGCE qualification with QTS (Qualified Teacher Status).\r\n\r\nOur school-centred PGCE primary programme is a community of learning with partnership at the heart of the programme. The partnership works together to develop:\r\n*  outstanding student teachers who are transformative and creative\r\n*  highly motivated and committed\r\n*  autonomous and independent\r\n*  enquiry-based  and self-reflective practitioners. \r\n\r\nHistorically, a significant number of trainees secure teaching posts within Ebor Academy Trust and have gone on to senior roles within school, including active engagement in the delivery and supporting trainees on the programme.\r\n\r\nThe programme delivers contemporary and highly relevant education and training which provides excellent opportunities for you to develop knowledge and understanding of primary education and wider educational issues. You will be equipped to become an outstanding teacher and leader with strong subject knowledge and a clear professional identity. You will be supported by experts in both university and schools to ensure that you have opportunities to learn about current classroom practice and develop deep subject pedagogy. It combines school experience with taught sessions on subject knowledge and pedagogy  underpinned by the Initial Teaching Training Core Content Framework in the key themes of: behaviour management, pedagogy, curriculum, assessment and professional behaviour.\r\n\r\nAs part of the programme, you will complete two academic assessments which will need to be passed so you meet the programme aims and gain the PGCE award. These modules will underpin your own rigorous understanding of pedagogy and will provide you with 60 Masters level credits, which you may wish to use towards a full Masters qualification in the future.\r\n\r\nThe programme is a full and studied within one academic year (September to July), covering either the 3- 7 or 7-11 age phase. \r\n\r\nThe programme ensures that you fulfil the requirements of the current Teachers’ Standards for the award of QTS. It encourages you to engage critically with educational issues to enable you to develop as a reflective practitioner, with the ability to evaluate and adapt your practice to meet the diverse needs of pupils in primary schools. This is achieved through a range of learning, teaching and assessment strategies, including active learning and enquiry-based learning, which is considered essential in both modelling effective learning and teaching practice.","interviewProcess":"The recruitment process is rigorous and thorough. It is designed to enable Ebor Academy Trust and York St John University to assess the suitability of candidates for training and to appoint the best candidates for the places available.\r\n\r\nSelection is based on evidence given throughout the application process.\r\n\r\nInterview days usually take place in one of our partnership schools so that we can observe applicants interactions with children. Typical activities include:\r\n\r\n*a guided reading session \r\n*a short prepared teaching activity \r\n*written reflection based on your prepared task \r\n\r\nSuccessful candidates may then be invited to an interview which usually takes place on the afternoon of the tasks. The interview panel is made up of Ebor Academy Trust and York St John University staff.\r\n\r\nPlaces on the programme are limited and recruitment takes place regularly during the year. \r\n\r\nIf you are successful at interview you will be offered a conditional place. Once the number of offered places meets the agreed programme numbers, the programme will be closed. We therefore recommend that you apply as soon as possible to avoid missing out on the programme of your choice.","howSchoolPlacementsWork":"Placement in schools is an integral part of the programme; trainees report it helps them to fully immerse in the school community and become a valued member of staff from the start. During the year you will be based within one school for the majority of your training where you will complete two placements in your preferred age range of either lower (3-7 years ) or upper (7-11 years) primary. There is also a 6-week contrasting placement in a different partnership school. Trainees are placed in a diverse range of schools within York and the surrounding areas.\r\n\r\nDuring each placement you will observe teaching, work collaboratively with experienced staff and gradually increase the percentage of planning teaching and assessment. Trained mentors closely monitor students through weekly appraisals where strengths are identified and developmental points identified. Discussions are constructive and nurture students self reflection on lessons.Targets will be set to help you on your journey into becoming an effective teacher.\r\n\r\nYou will also attend school meetings such as staff meetings, participate in school training days and other professional development events as appropriate. From being in school you are exposed to a broad and diverse school life and the wider school context. This helps you to understand your own professional identity and be a fully committed member of a school community.","personalQualities":"Ebor Academy Trust welcomes applicants who:\r\n\r\n* show a passion towards working with children and a desire to make a difference\r\n* excellent communication \r\n* a team player but also the ability to work independently\r\n* curiosity and eagerness to learn\r\n* ability to adapt and be flexible- every day is different!\r\n* self awareness and ability to reflect constructively\r\n* resilient\r\n* creativity and an ability to be innovative\r\n* patience and understanding\r\n* fun and a good sense of humour\r\n\r\nIf this is who you are, Ebor Academy wants you to join!\r\n\r\n\r\n\r\n\r\n","otherRequirements":"You will be required to complete a medical check and DBS prior to starting the programme.\r\n\r\nWe recommend all applicants to engage in some school experience across the primary range range so that they can draw upon this experience at interview. ","status":1,"createdAt":"2021-09-29T20:04:28.548Z","updatedAt":"2021-09-29T21:00:40.576Z","canSponsorStudentVisa":"yes","cycle":"2024"}
