{"id":"97a5404d-2bcf-4902-b692-68a03b440ef1","name":"Lower Primary","code":"Q859","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"P","ageRange":"3_to_7","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"ad3694a6-6bf8-4cd0-a8bf-e6a3564dc4b2","name":"Main Site","isPublished":"Y","status":"R","vacancies":"P"}],"trainingProvider":{"id":"b011427a-6dff-4a77-9df3-c85a54be605a","code":"Y75","name":"York St John University"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We only accept equivalency tests from www.equivalencytesting,com","courseLength":"TwoYears","feesUK":9250,"feesInternational":12750,"aboutCourse":"We work closely with partnership school colleagues to support you in developing your professional practice, providing you with excellent opportunities to engage in wider professional issues relating to pedagogy and the curriculum.\r\n\r\nYou will be expected to critically engage with educational issues and develop as reflective practitioners, able to evaluate and adapt your practice to meet the needs of learners from diverse cultural backgrounds. The University provides a strong centre-based opportunity to develop and share good practice.\r\n\r\nYour professional development will be underpinned throughout the course by essential theoretical knowledge. You will assess current research and developments at local, national and international levels, critically engaging with the educational issues which will shape your teaching practice.\r\n\r\nYou will gain a thorough understanding of the current primary and early years curriculum, including core and foundation subjects. We emphasise the importance of meeting the individual needs of children from diverse backgrounds. This includes learning about the impact of ethnicity, the challenges raised by teaching those with English as an Additional Language (EAL) and the needs of children with Special Educational Needs and Disabilities (SEN/D).\r\n\r\nThe PGCE Primary programme is structured in phases (introductory, developmental and consolidation). Each phase builds upon the last to enable you to reflect upon your learning and make effective links with curriculum and pedagogy through relating theory to practice.\r\n\r\nFor full course details, please see the York St John University website:\r\nhttps://www.yorksj.ac.uk/courses/postgraduate/education/primary-education-university-centred-pgce/\r\n","interviewProcess":"","howSchoolPlacementsWork":"For the university-centred route there are opportunities to complete experiential placements in order to meet the requirement of 120 days of school-based training, as stipulated by the NCTL’s Initial Teacher Training (2018) criteria. The experiential placements are specifically designed to integrate with the taught modules so that you can widen your experience and develop a deeper pedagogical knowledge. You will observe children and young people in settings such as playgroups, nurseries and crèches, primary and secondary schools. Enrichment opportunities could include an international placement as well as focused days on, for example, phonics and behaviour management.","personalQualities":"","otherRequirements":"You must obtain a satisfactory Disclosure and Barring Service (DBS) enhanced disclosure check and/or any other appropriate background check, such as an overseas check. A satisfactory medical report is also required. ","status":1,"createdAt":"2021-07-06T10:47:24.339Z","updatedAt":"2021-09-28T10:58:12.043Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
