{"id":"549bce71-d565-4ffa-a4f7-d76751877cf1","name":"Primary","code":"B877","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_7","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"1b434d4f-1944-4e34-9cc3-843b8db5e944","name":"All Sites","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"381aced8-6a9a-4e44-a96d-d4f24226cd1e","code":"2EE","name":"Arbor Academy Trust"},"accreditedBody":{"id":"fce142fe-a2a1-4f4d-b2db-2e508280e68f","code":"24M","name":"London District East SCITT"},"degreeGrade":"1","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"This course is a Primary course for EYFS / Key Stage One (3-7) We were rated 'Outstanding' by Ofsted in October 2017. \r\n\r\n Our vision is 'Making a real difference to children's life chances.'  As a partnership of schools in East London, we work together to recruit and train excellent teachers, who are inspired and equipped to continue to develop their teaching and leadership skills throughout their careers.\r\n\r\nSchool Direct (Tuition Fee): By the end of this course you will gain your QTS. It is a school based training model and there will be cross phase Primary placements across our network of schools (see below). You will be trained, mentored and coached by highly experienced classroom practitioners and the course will have a strong focus on pedagogical understanding. ELA SCITT will accredit you with your QTS. \r\n\r\n You will be trained to teach from ages 3-7 ","interviewProcess":"WE ARE PRESENTLY CARRYING OUT INTERVIEWS VIA ZOOM. \r\n\r\nAll applicants who submit an application that meets the requirements, as set out in the application scrutiny process, will be invited to interview day 1. You will be interviewed by a panel of senior leaders and all details of the interview will be sent to you in advance. \r\n\r\nCandidates are encouraged to advise us of any Special Needs prior to the Interview days.\r\n\r\nIf you are successful at day 1, you will be asked to go to another informal interview at a school that would like to recruit a trainee teacher.  You will have to be successful at both stages in order to get onto the course. ","howSchoolPlacementsWork":"As a partnership of schools, we work together to recruit and train excellent teachers, who are inspired and equipped to continue to develop their teaching and leadership skills throughout their careers. We work with outstanding schools to develop a school led programme to meet the requirements of the Teacher’s Standards. These schools are usually within our Partnership and our Alliance. \r\n\r\nYou will have a main placement school and then in the Spring Term (6 weeks) complete a contrast placement in another school, in a different key stage. You will also get opportunities to experience a school outside of London, a specialist provision and a Secondary School to look at how pupils progress from KS2 to KS3. \r\n\r\nWe will select the schools for you based on your experience,   interview and commuting distance. Many of our schools have worked with us previously and we have excellent partnerships with them. You may come with a school that may be interested in sponsoring you and this will be asked at interview. The commute is usually between 30 minutes and an hour, sometimes shorter. ","personalQualities":"We are looking for applicants who have the passion to become a Primary School Teacher. Applicants who are confident,  resilient and willing to learn and work hard. We will support you to develop these skills and learn more. ","otherRequirements":"We recognise that not all applicants will have worked in schools before, we can support you gain some experience before you make your big decision. Presently, we are unable to do this due to current risk assessments. ","status":1,"createdAt":"2021-07-06T10:53:58.460Z","updatedAt":"2021-09-30T10:03:33.800Z","canSponsorStudentVisa":"no","cycle":"2024"}
