{"id":"e7072523-abf0-4549-a955-9e06eea309d2","name":"Art and design","code":"X944","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"d461a678-3335-4ca2-9616-1dc479d31a49","code":"W1","name":"Art and design"}],"locations":[{"id":"4ae4521e-b501-4b26-8208-90e75b281552","name":"Nottingham Academy","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"6019211a-2288-47aa-84ac-9e1038ba1854","code":"1EX","name":"Greenwood Academies Trust"},"accreditedBody":{"id":"d2b7d074-fac9-42c5-a0d3-d5471b35f7d9","code":"N91","name":"Nottingham Trent University"},"profPost":"PG","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Most of your training will take place 'on the job'; in the classroom and at weekly Continuous Professional Development (CPD) training sessions run by highly skilled staff in the academy.  You will also take part in whole-academy inset days and will attend Department and Team/Year Group meetings.  You will be part of the team from day one!\r\n\r\nTrainees attend lectures and seminars with the accredited provider typically one day a week, with the rest of the time spent in the academy.\r\n\r\nYou will be assigned an academy-based Subject Mentor and Professional Tutor. They will meet with you on a weekly basis to provide guidance and support.\r\n\r\nStarting on a zero timetable, with the support of your Subject Mentor and Professional Tutor this will gradually increase over the academic year until you are eventually teaching around 75% of a full timetable.\r\n\r\nA contrasting placement in a second setting is undertaken during the Spring term.  This will provide a broader view of educational issues and experiences.\r\n","interviewProcess":"We want resilient, ambitious and enthusiastic people who are passionate about learning and have a desire to share that with young people of all abilities and backgrounds.\r\n\r\nOur aim is to identify your aptitude and potential to meet the Teachers' Standards at the highest level, and to meet the demands of the PGCE course outcomes. If invited for interview, you will be asked to evidence the following:\r\n\r\n- Subject knowledge. We will explore the level of that subject knowledge in relation to your potential to teach the full breadth of the curriculum and the subject specific examination specifications at the relevant Key Stages.\r\n\r\n- Research into the teaching profession. We will explore your understanding of professional training for entry into the teaching profession.\r\n\r\nThe selection process will involve interviews at both the academy and the accredited provider, where the provider is Nottingham Trent University, Bishop Grosseteste University or the University of Nottingham. Where The Cambridge Partnership is the accredited provider there will be one interview at the academy with a representative from the provider in attendance.\r\n\r\nThe academy-based selection process includes a formal interview, a short observed teaching session with a small group of pupils, a handwritten Literacy test, the opportunity to talk to staff and pupils, and a group task with other candidates.\r\n\r\nOur accredited providers will be involved throughout and will have an equal say in the selection. It is a rigorous and thorough process, designed to get the best match of applicant to the places available.\r\n","howSchoolPlacementsWork":"A contrasting placement at a different school will take place during the Spring term.","personalQualities":"Achieving the best positive outcomes for our pupils is at the heart of all we do.  You should be driven by your own high personal standards and be committed to maintaining high expectations for the pupils in your care.\r\n\r\nEmpathy and a sense of humour will also help!","otherRequirements":"If your application is successful, before commencing your teacher training (this is not necessary prior to your interview), an enhanced Disclosure and Barring Service check (formerly known as a Criminal Records Bureau or CRB check) with barred list checks will be required.\r\n\r\n","status":2,"createdAt":"2021-07-06T10:48:00.156Z","canSponsorStudentVisa":"yes","cycle":"2024"}
