{"id":"f0fcf29d-a69c-4150-9301-940fb7a919c4","name":"Lifelong Learning (Pre-Service)","code":"X372","qualification":"pgce","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"14_to_19","subjectLevel":"further_education","isSend":"no","subjects":[{"id":"9de4b2d2-5739-4c34-92d2-9b4384760298","code":"41","name":"Further education"}],"locations":[{"id":"4730bd0b-57dd-4b73-bcfe-01b9af647ae3","name":"University Campus Oldham (Oldham College)","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"f8bdffd5-dabf-483f-b692-e637c41af3d0","code":"KG8","name":"University Campus Oldham"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"9","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":7500,"feeDetails":"Additional cost per year: DBS £40","aboutCourse":"Academic credit is gained by undertaking assignments and providing evidence of achievement. This allows you to explore topics that are of interest to you, relevant to your working environment, and to your career development. As part of the course, you will complete a subject specialist module. This requires attendance at the University of Huddersfield campus. You will be informed of the exact dates during the course.\r\n\r\nResearch Informed Teaching Learning and Assessment\r\nThis module develops an understanding of how people learn in post-compulsory education and training and of the role of assessment. You will be assessed on an assignment in two parts (coursework together worth 100% of the module). \r\n\r\nBecoming a Subject Specialist Teacher\r\nThis module is designed to help you learn how to identify and respond to learners’ needs with suitable teaching, learning and assessment strategies. You will engage in personal and professional development planning and, through two pieces of coursework, together worth 100% of the module marks, develop your practice. Key learning activities of the module are practical teaching experience and the engagement with other specialists through collaborative practice.\r\n\r\nBeing a Subject Specialist Teacher \r\nThis module builds on previous generic and subject specialist development in two ways. Firstly, it contributes to the development of more advanced strategies and methods for promoting learning and, secondly, it involves a sharper focus on specific specialist areas and the critical analysis of their pedagogy. The module achieves these purposes by enhancing the ability to reflect critically on, and to evaluate, teaching and learning; by recognising particular curriculum and professional challenges; and by developing critical responses to these concerns in sophisticated, innovative and creative ways. Key learning activities of the module are practical teaching experience and the engagement with other specialists through collaborative practice.\r\n\r\nPolicy and Professional Issues\r\nThis module will develop your understanding of the concept of policy, professionalism and the influences that shape it. Through two pieces of coursework, together worth 100% of the module marks, you will discuss theories and relate them to your own context and professional role. ","interviewProcess":"One half hour interview (one-on-one) with senior lecturer, no test required.","howSchoolPlacementsWork":"Much of the course is focused on the experience of practical teaching. You gain experience of learning and teaching alongside other professionals with support from tutors at UCO and a placement mentor, as a vehicle for your professional development. We help you to find a suitable placement (100 hours required).\r\n","personalQualities":"","otherRequirements":"Enhanced DBS required (£40 cost to student)","status":1,"createdAt":"2021-07-06T10:51:41.733Z","updatedAt":"2021-09-29T07:36:45.665Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
