{"id":"e18d3259-b41e-4994-82b6-6729af22b470","name":"Primary (3-7)","code":"384P","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"3_to_7","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"ccf815a8-5626-4f6f-9d4d-1e9820b818db","name":"Main Site","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"6e4b355e-5b57-43d9-b9fb-2b0f6adf2c41","code":"1WY","name":"Two Mile Ash School"},"accreditedBody":{"id":"6e6c8aa3-8d77-4c7d-af3c-4c7912b1cc2a","code":"T89","name":"Two Mile Ash ITT Partnership"},"profPost":"BO","english":"1","maths":"1","science":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":null,"aboutCourse":"PLEASE NOTE THERE IS NO LONGER ANY SALARY FUNDING FROM THE DFE FOR THIS ROUTE - IF YOU HAVE FINANCIAL BACKING FROM A HEADTEACHER, WHO IS PREPARED TO SALARY YOU, PLEASE LOOK AT OUR POSTGRADUATE APPRENTICESHIP ROUTES INSTEAD - SEARCH FOR TWO MILE ASH ITT PARTNERSHIP (T89) AND COURSES A965 (EARLY YEARS) AND V797 (GENERAL PRIMARY)\r\n\r\nTHIS IS OUR SD EARLY YEARS (3-7) PGCE PROGRAMME\r\nFOR SALARIED PRIMARY (5-11) PGCE, SEE 2V5W\r\n\r\nOur training programme is varied, innovative and inspiring. Through it, our trainees have access to excellent teaching and a variety of experiences in our partner schools. Although we offer different routes to QTS, the core elements of our programmes have been developed over years of experience. Our programmes are highly respected and, as a result of this, in addition to our PGCE routes, we now also offer a BA(Hons) in Primary and Early Years Education with Birmingham City University (see UCAS undergraduate website).  'Trainers and schools model excellent practice and raise trainees' awareness, aspirations and ability to emulate this' Ofsted 2013  \r\n\r\nYou will spend time in school every week, which promotes application of theoretical learning to your classroom practice. Training is front-loaded to the Autumn term, which means more time in school during the Summer term, preparing you for being a fully-fledged NQT. Whilst in school, you will observe successful teachers; teach children in small groups up to whole classes; plan and deliver learning to children (with coaching and mentoring from your expert School Based Trainer) and join in with school-led training opportunities.  \r\n\r\nWe assess your skills as teachers by judging your impact on the outcomes for the children you are teaching. You will present information for assessment in written formats, portfolios, presentations and tutorial discussions. All assessments are continuous throughout the year through individual tasks and group projects. \r\n\r\nCore Training takes place at our dedicated training centre and in venues across the area. It provides inspirational, hands-on training from safeguarding to subject knowledge; behaviour management to building resilience; well-being to pedagogy, and much more.  Training days provide an opportunity to share experiences, while learning from our expert trainers. These sessions provide you with ‘headspace’ and an opportunity to reflect on teaching as well as learning new skills and pedagogies to take back to school.   \r\n\r\n","interviewProcess":"We enjoy interviewing prospective teachers and discovering with you whether you are suited to teacher training and how our programme would work for you and your learning styles. The interviews are usually conducted by a member of the Initial Teacher Training team and a Head Teacher/Deputy Headteacher from one of our Partnership schools. \r\n\r\nOur interview process has been adapted currently to ensure safe practice and will initially be conducted online. When invited to interview, full details will be shared at that point, about the adaptations that we have made.\r\n\r\nPlease don’t worry about the interviews – we want to work with you to understand your motivations for teaching and are looking to see if you have the potential to train to teach – you don’t already have to be able to teach! The interview activities evidence how you engage and interact with children and this gives us an idea of your potential to train. \r\n\r\nRemember, learning to teach is a journey and you can be really successful from whatever starting point you have, whether you are a Teaching Assistant who has been in school for many years or someone with very little classroom experience. Our interview process is designed to explore that with you.\r\n\r\nAs this is our salaried route, which inherently has expectations of solo classroom teaching from the outset, the interview will reflect this extra expectation and applicants will need to demonstrate that they have the classroom experience and personal qualities to undertake this programme.\r\n","howSchoolPlacementsWork":"All our Partnership schools are selected on the basis of their effectiveness and expertise. The Partnership thrives because of the active role that schools take in the design and delivery of the programme and because of their commitment to training teachers in their schools. \r\n\r\nOur partnership includes a range of schools including large urban schools; those in areas of social deprivation; village schools and faith schools. 'Outstanding use of the considerable expertise in partnership schools provides trainees and NQTs with consistently high-quality training, for the whole group and at individual level' Ofsted 2013  \r\n\r\nOur schools are mainly in Milton Keynes and its surrounding areas, but we work with some schools in Northants, Beds and Bucks, so if you live in those areas and would like to train more locally to where you live, you can talk to us about this in your interview to see if it is possible. \r\n\r\nYou can train for either Early Years (age 3-7) or General Primary (age 5-11). You will be immersed in the school from the outset, meaning that you 'live and breathe' real-life teaching and become a valued member of the school team. You will spend most of the year in your ‘home school’, with a 6 week placement in an alternative school and alternative key stage, as well as a short time in a special school. Your School-Based Trainer will mentor you during the year, which means your programme is bespoke to you, resulting in you being the best teacher you can be!  ","personalQualities":"The most important personal quality for teaching is wanting to create opportunities for young people to learn new skills and develop their understanding of the world. Successful teachers co-operate, collaborate and work on their own initiative. The ability to make good, professional relationships with children is paramount to being a successful teacher and we value the individuality of our trainees. It is important that you have thought about training to teach and found out what the role of a primary teacher involves. You may have visited or worked in schools, this is not a requirement although it is helpful.  ","otherRequirements":"Many salaried trainees have already had experience in a school as a Teaching Assistant.  It is important that you understand that a salaried route has whole class teaching expectations inherent with it from the outset, so is, by and large, only offered where an applicant is deemed at interview to be suitable for fulfilling this role.","status":2,"createdAt":"2021-07-06T10:56:50.836Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"PLEASE NOTE THERE IS NO LONGER ANY SALARY FUNDING FROM THE DFE FOR THIS ROUTE - IF YOU HAVE FINANCIAL BACKING FROM A HEADTEACHER, WHO IS PREPARED TO SALARY YOU, PLEASE LOOK AT OUR POSTGRADUATE APPRENTICESHIP ROUTES INSTEAD - SEARCH FOR TWO MILE ASH ITT PARTNERSHIP (T89) AND COURSES A965 (EARLY YEARS) AND V797 (GENERAL PRIMARY)\r\n\r\nThis salaried route requires you to be paid as an Unqualified Teacher for a minimum of 10 months during the course. Your salary and your course fees will be paid for you by your employing school. Some of the schools in our partnership will support you through the PGCE and QTS route, while others may select to support you through the QTS only route. In the latter situation, you have the option to top up your qualification with the PGCE element by paying that cost yourself.\r\n\r\nAny travel costs to and from school placements and the training sessions are met by you. Our partnership schools are all in Milton Keynes and the surrounding area, so travel is not excessive. \r\n\r\n"}
