{"id":"f8a41aef-1ad6-4b25-af34-4b580c022a56","name":"Music","code":"3FDB","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"24311bef-8673-41fb-933c-53f887fb6976","code":"W3","name":"Music"}],"locations":[{"id":"ed026ace-7095-43b2-94ff-c7040a531856","name":"Salop Teaching Partnership","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"93047184-b62a-43bc-b7d5-16e9c65b0ded","code":"1Q6","name":"Salop Teaching Partnership"},"accreditedBody":{"id":"e843cb68-d310-478c-8dba-cf9633fea086","code":"C55","name":"University of Chester"},"profPost":"BO","degreeGrade":"9","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"Ideally you should hold a 2:1 degree, but applications from candidates with a 2:2 degree will be considered.","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"no","additionalGcseEquivalencies":"Please  contact us and we can advise whether your provider would be accepted.","courseLength":"OneYear","feesUK":null,"aboutCourse":"Trainees will complete a total of 180 days of training; 120 days will be in the classroom observing and building up to whole class teaching as soon as possible.  The aim of school direct as opposed to the conventional PGCE is that trainees are more quickly immersed in the practicalities of teaching resulting in a more confident and competent teacher.  This is a school-based PGCE with more time spent in developing classroom practice than a traditional PGCE programme.  Training is delivered across the partnership by practising professionals\r\n\r\nThere will be 30 days of professional studies based around wider educational issues such as Behaviour Management, SEND and Assessment.  These will be delivered on a rotation basis by highly experienced teachers from schools in our partnership.  This ensures you are developing an understanding clearly based on classroom practice and how educational theory sits within this.  In addition there will be subject-based tuition in your chosen secondary subject.  Some of this will be achieved locally, but there may be a number of days where trainees will have to attend university based sessions.  \r\n\r\nThere will be three university based assignments throughout the year.  Access to the university resources and virtual learning will ensure you have access to wider educational texts and journals to support your work.  You can gain up to 60 masters level credits through completion of this course as this is a PGCE with QTS.  This means your qualification is internationally recognised.\r\n\r\nIdeally, applicants need to have a 2:1 or a higher classification, but a 2:2 may be accepted.  Where this is in an unrelated subject to Music, the applicant should demonstrate a breadth of practical experience in a related field or job area.  Candidates should have at least one of their A levels in a related Music subject.\r\n","interviewProcess":"We are looking for candidates who have an empathy and understanding of the demands of teaching in the classroom.  They should enjoy working with young people and see teaching as a wider professional vocation.  Confidence in front of a classroom of teenagers is essential and we would encourage all applicants to gain some voluntary observation experience before applying.  As part of the interview process you will be required to teach part of a lesson so we can gauge your clarity of explanations as well as how you engage with our young people\r\n\r\nWe will receive your application via DfE Apply and this will be reviewed by senior colleagues from the Salop Teaching Partnership and our University partner.  We will look at your experience and qualification relevancy and will invite you to interview if your application meets our criteria.  The application should be supported by two professional references.\r\n\r\nIf successful, you will be invited to interview at school which will involve a mini-teach activity, subject knowledge and literacy test and a formal interview.  The programme will be sent to you in advance and you will have 7 days to respond to the invitation.  \r\n\r\nIf an offer of a place is made, it will either be unconditional or conditional based upon your successful completion of your degree, if you are still at university, or gaining more experience observing in a secondary school or completion of a subject knowledge enhancement course.\r\n","howSchoolPlacementsWork":"The School Direct (Salaried) route combines full time training with study.  You will spend the majority of your time in your employing school with a shorter placement in a contrasting school which will broaden your teaching experience.  You will have teaching responsibilities from commencement of the course and could be held accountable for the progress of students.\r\n\r\nPlease note with your school placements, you could be placed at any school in the partnership within the Shropshire and Telford and Wrekin area.  You will need to take into consideration travel time and distances that may be involved.\r\n\r\nIn both placements, you will have a subject-based mentor, a school professional tutor and a university based tutor as well as a partnership based School Direct team to support you throughout your PGCE programme.\r\n\r\nYou will be placed in departments who will be able to offer you the best support and guidance and with mentors who are willing to share their wealth of knowledge and experience to support your progression as a teaching practitioner.\r\n\r\nSome of our partner schools have sixth forms so you will gain experience of KS5 teaching.  If your placement schools do not have a sixth form, we will ensure that you gain this experience by arranging a short placement in Shrewsbury Colleges Group or one of our partner schools.\r\n\r\nWe will endeavour to take personal circumstances into consideration when allocating your placement school, but please be aware that you may have to travel up to 45 minutes for your school based learning.\r\n","personalQualities":"We are looking for candidates who have an empathy and understanding of the demands of teaching in the secondary classroom.  You should enjoy working with young people and see teaching as a wider professional duty.  As part of the interview process you will be required to teach part of a lesson so we can gauge your clarity of explanations as well as how you engage with our young people.\r\n\r\nWe are looking for the highest quality graduates who may well bring further work-related experience from previous careers which can help to strengthen the application.","otherRequirements":"We are looking for applicants who are able to commit the time needed to the training programme which will include academic assignments and study.  We would like candidates who want to be involved in the wider pastoral and extra-curricular life of our schools and who can give the time to this during their training year.  Trainees own transport would be advantageous so you can easily access your school placements as you may be placed up to 45 minutes travelling distance from home.\r\n\r\nA full DBS check will be undertaken","status":1,"createdAt":"2021-07-06T10:54:37.311Z","updatedAt":"2021-07-20T09:19:07.354Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"You will be employed by your sponsoring school who will pay the unqualified teacher pay scales.  The cost of the tuition fee is payable by the partnership, so you will not need to pay this fee.  To meet the requirements of the course, you will spend some time in another school setting which will be arranged by the partnership."}
