{"id":"cff37538-2d9d-4125-8c92-e31fb2c1146d","name":"Primary 5-11","code":"1LSN","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"8fa63cda-2930-4f3c-b582-4e2d2c21d9eb","name":"Fagley Primary School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"8c5a22f0-6307-44c9-91d6-7422b76db7e8","code":"E1P","name":"East One Partnership"},"accreditedBody":{"id":"19a3446e-382d-4c14-83bb-a76563cef3c1","code":"L24","name":"Leeds Trinity University"},"profPost":"PG","degreeGrade":"9","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"Please contact us regarding equivalency tests and what we may accept.","courseLength":"OneYear","feesUK":9250,"financialSupport":"You may be eligible for a loan while you study.\r\n\r\nFind out about financial support if you’re from outside the UK.","aboutCourse":"East One Partnership consists of a small, highly-successful group of schools within Bradford.\r\n\r\nWe provide high-quality, bespoke teacher training opportunities in a school-centred, supportive learning environment.  \r\n\r\nThe aim of our school direct programme is to maximise your training in school and in classrooms. Working with many inspirational teachers across the partnership, you will experience a wealth of classroom experience, supporting you with your continuous professional development. We will build your knowledge and teaching ability so that you can become a confident and inspiring practitioner. \r\n\r\nAt all stages of your training, you will be supported by experienced mentors who will support and encourage you to develop your skills and improve your performance. All mentors are trained so they will have the necessary coaching and mentoring skills to support you throughout your placement. \r\n","interviewProcess":"If you shortlisted for interview, this will take place at Fagley Primary School.\r\n\r\nThe interview process will consist of a classroom based exercise where you will be observed interacting with a group of pupils. There will be a short skills based task and a face to face interview with a panel of school leaders.  \r\n\r\nYou will also have the opportunity to look around school and ask any questions.\r\n\r\n\r\n","howSchoolPlacementsWork":"\r\nYou will gain substantial training in a school environment. The course will provide you with supported, school-based experiences, split into three teaching placements; giving you the opportunity to develop your confidence and teaching knowledge during each stage. \r\n\r\nYour first placement will be in a host school, followed by a second and third placement in a home school. All the placements will provide you with school-based training during which you will gradually build up the amount of time you spend teaching. \r\n\r\nAll of the placements will take place in our partnership schools. ","personalQualities":"","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:52:02.420Z","updatedAt":"2021-07-22T09:38:32.490Z","canSponsorStudentVisa":"yes","cycle":"2024"}
