{"id":"b4189939-d5a6-4168-837a-d30f8a3b5e87","name":"Primary (3-7)","code":"V168","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"3_to_7","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"d4fcc676-ab6e-4c13-9f79-7c0660c03848","name":"Main Site","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"c0eea843-9328-4ac7-a441-56564fb379a0","code":"1U2","name":"Redriff Primary School"},"accreditedBody":{"id":"049fe65f-08dc-4686-9ac8-606dce490128","code":"G56","name":"Goldsmiths, University of London"},"profPost":"PG","english":"3","maths":"3","science":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":null,"aboutCourse":"The Redriff Primary School Direct programme is a school-based model of teacher training where trainees are employed by a school within the partnership for an academic year (These schools include Redriff Primary School and Galleywall Primary School). \r\n\r\nTrainees are released for approximately 40 days to complete academic study at Goldsmiths College. There is also the opportunity to work at another contrasting school for a 6-week placement.\r\n\r\nThe programme covers all the National Curriculum subjects, and in each curriculum area, you will have the opportunity to develop understanding of the teaching and learning process, and to learn about effective classroom practice.\r\n\r\nIn addition to the work in classrooms and the academic studies, trainees will benefit from all school-based training. Trainees will have the opportunity to visit the school's on site resource base for children with Autism as well as observe teaching in Early Years, Key Stage One and Key Stage Two to learn about different approaches to teaching and learning.\r\n\r\nTrainees will be provided with a variety of support across their training year including both a school and university based mentor who will work with the trainee to develop a bespoke developmental plan to improve teaching practice.\r\n\r\nThis programme offers a PGCE with QTS and is assessed through observations of classroom competency, evidence to show the ability to meet the Department for Education Professional Standards as well as a series of academic assignments.\r\n\r\nThe school-based route of teacher training offered at Redriff Primary School is a dynamic programme of practical learning and academic study, which allows trainees to develop their skills and prepares them for their teaching career.\r\n\r\n","interviewProcess":"Successfully shortlisted candidates will be invited to an interview day which will comprise the following activities:\r\n\r\n•\tAn interview with a selection of senior staff from either Redriff Primary \r\n        School or Galleywall Primary School \r\n\r\n•\tA short written task evaluating a video of a short lesson\r\n\r\n•\tA literacy check\r\n\r\n•\tA maths check\r\n\r\n•\tA short interview with our Year 6 Heads of School \r\n","howSchoolPlacementsWork":"Redriff Primary is a lead school and students will be placed here or at Galleywall Primary, our sister school.\r\n\r\nStudents can be placed in any year group from Nursery to Year 2.\r\n\r\nWe are partnered with a number of schools which is where students can undertake their six-week placement, however, we are open to students finding their own suitable placements.","personalQualities":"We are looking for candidates who are motivated and enthusiastic about working with children. They should have at least some experience of working with children but this does not necessarily need to be in the education sector.","otherRequirements":"All candidates will need to have at least 2 years work experience post degree. This work experience can be in any field but some work with children would be preferred.\r\n","status":2,"createdAt":"2021-07-06T10:57:05.380Z","canSponsorSkilledWorkerVisa":"yes","cycle":"2024","salaryDetails":"Students will be paid on the Unqualified Teacher scale.\r\n\r\n"}
