{"id":"3a006d54-67ad-494c-9c48-445105e4aeb9","name":"Primary","code":"37SV","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"80401bbe-31f5-4b05-9ab1-b9c937690ab3","name":"Wilmington Primary School","isPublished":"Y","status":"R"},{"id":"f60013d1-16f1-447f-a372-c9a1c6842965","name":"Wentworth Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"5cad2959-a18c-43c5-8f8e-570c6f072a66","name":"The Brent Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"4e8f8948-290c-4753-8a80-6e4939bbc439","name":"Bishop Ridley C of E Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"7d1b8ba7-3c40-469a-a6db-04ab75b3437a","name":"Greenacres Primary School","isPublished":"Y","status":"R"},{"id":"e1aeee77-0cdc-4444-9106-fd654787e8e2","name":"Millennium Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"896e4cf3-bae3-4888-8eca-9c98069281c4","name":"Timbercroft Primary School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"be4c78ed-a87b-48af-a907-3de8e397c058","code":"29N","name":"Dartford Grammar School"},"accreditedBody":{"id":"757d0dca-c7a9-43c8-8c3b-96c0a81539b6","code":"K30","name":"Kent and Medway Training"},"degreeGrade":"9","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We accept Level 2 in English and Maths only.\n\nLevel 2 in Literacy and Numeracy are not accepted.\n\nWe accept equivalency in a single science (e.g. Biology)","courseLength":"OneYear","feesUK":7100,"feesInternational":7100,"feeDetails":"The fee of £7100 is the cost for all trainees leading to Qualified Teacher Status (QTS) only. This fee is payable by all non-salaried trainees but payable by the home school for salaried trainees.\r\n\r\nFor those wishing to 'top up' their qualification to the full Post-Graduate Certificate in Education (PGCE) a further £1800 will be payable to the University of Leeds Beckett who are our PGCE accredited body. This fee is payable by both salaried and non-salaried trainees.\r\n","financialSupport":"Find out about any financial support in terms of tax-free bursaries, tuition-fee loans or maintenance loans at the Get Into Teaching Website:\r\n[Get Into Teaching] (https://getintoteaching.education.gov.uk/funding-my-teacher-training)","aboutCourse":"The course begins on the first day of INSET training with the rest of the staff, integrating you into the staff body, and will continue until the middle of June. This is so you can begin working in July in those schools that offer an early start. You will also have a six-week placement in a contrasting school to help to broaden your experience.\r\n\r\nYou will be in schools for at least four days a week where you will be involved in observations, teaching, staff training, parents’ evenings, school meetings, extra-curricular clubs: all the facets of a teacher’s school life. On Thursdays, you will have your pedagogical training with KMT that provides a mixture of specific Subject Studies, looking at aspects of teaching your specialism, and the more general Professional Studies sessions, which have a holistic approach to educational practices. After Easter, you will be in school full time.\r\n\r\nYou will be supported by a network of established professionals, including a subject mentor in your school, usually a subject specialist, your professional tutor, your KMT lead mentor and course director as well as the other teachers and trainees in your school. You will have a weekly mentor meeting to allow you discuss any issues and organise any  support you may need.\r\n\r\nTo begin the year, you will observe lessons, developing into leading small parts of a lesson or working with small groups, and building until you are teaching 60% of a full timetable. You will be supernumerary, meaning there will always be a qualified teacher in the room with you. You will be formally observed once a week in order to receive feedback and make progress.\r\n\r\nAs well as your teaching, you will be working on charting you development and recording your skills through progress trackers, Reflective Professional Journals (RPJs), and collecting evidence to prove you are working towards meeting the Teachers’ Standards. These are spread across the year and you will be supported by your mentor and your lead subject mentor.\r\n\r\nIn addition, for those wishing to obtain the Postgraduate Certificate in Education (PGCE) as well as Qualified Teacher Status (QTS), you will be able to top up your qualification by paying an extra fee and completing other assignments throughout the year through distance learning with the University of Leeds Beckett.\r\n","interviewProcess":"The interview process varies slightly across the schools in the alliance; however, once you have applied by UCAS, if your application is strong, you are likely to be invited into the school to observe some lessons in your subject and meet some of the teachers.\r\n\r\nIf interested in pursuing the training placement, you will be interviewed by a representative from Kent and Medway Training, the school's Professional Tutor and a teacher from your chosen subject. This will include you presenting a plan for a lesson which will be defined for you before the interview. You will be asked to talk through your plan so to demonstrate your subject knowledge and ability to turn that into stimulating activities for young people. There will also be other questions to ascertain your resilience and dedication to teaching. At the same time, you will be asked to sit the KMT entrance test.\r\n\r\nIf all the panel members agree to offering you a training placement, you will be offered a conditional offer. If you are not successful, there may be the possibility that you will be offered a place at one of the other alliance schools if they have availability.\r\n","howSchoolPlacementsWork":"You will have a ‘home’ school which is where you will spend the majority of your training year. Here between September and January, and Easter and June, you will be learning how to teach your subject by slowly building up to teaching full lessons and then building up your number of lessons based on your capability. You will be supported by classroom teacher, your mentor and your Professional Tutor.\r\n\r\nYou will also have a six-week placement in a contrasting school. This will usually take place between February and Easter.\r\n\r\nIn April and May, you will be finally assessed through both lesson observation and your completed portfolio to ensure that you have met the Teachers’ Standards. The grades are then externally moderated and, if all the elements are completed to a good standard, your Newly-Qualified Teacher (NQT) status is confirmed and celebrated at a local hub-centred Awards Evening.\r\n\r\n","personalQualities":"In order to train with us you must be:\r\n\r\n* passionate about your subject\r\n* resilient\r\n* independent\r\n* dedicated to educating and supporting young people\r\n* self-reflective\r\n* open to constructive criticism\r\n* professional\r\n* proactive\r\n* a strong communicator\r\n","otherRequirements":"Before the course begins, you will need:\r\n\r\n* at least 10 experience days in a primary school or academy\r\n* DBS check\r\n* Health check declaration\r\n\r\nIt is useful to attend at least one school experience day before application so that you can get a feel for the chosen school and what it can offer as a training placement.","status":1,"createdAt":"2021-07-06T10:53:50.675Z","updatedAt":"2021-09-28T10:58:08.489Z","canSponsorStudentVisa":"no","cycle":"2024"}
