{"id":"028f7793-e9f8-453a-b71b-2486486326ea","name":"Primary","code":"369B","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"6f6d2a23-fa20-48fb-bb62-58a96c955b64","name":"Excalibur Academies Trust","isPublished":"Y","status":"R","vacancies":"F"},{"id":"923a9ed4-65ca-4ab4-a703-0dfe52950cdd","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"75f0fc2c-21c4-49e6-a53d-c6afaab51c31","code":"23Z","name":"Pickwick Learning"},"accreditedBody":{"id":"5d691db0-3d77-4a57-a4a2-5392b1ed8fc1","code":"24U","name":"North Wiltshire SCITT"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"Pickwick Learning and NWSCITT only accept equivalency tests from:\n\n* [Equivalency Testing] (https://www.equivalencytesting.com)\n* [A Star Equivalency] (https://astarequivalency.co.uk)\n\nIf you have an equivalency test from another provider, you will be required to retake one of the above tests.\n\nEquivalency tests are only suitable for someone who has previously taken a GCSE and not achieved grade C/4 or higher. If you have not attempted the GCSE, you will need to take a full GCSE in the required subject.","courseLength":"OneYear","feesUK":9250,"financialSupport":"Please contact us if you have questions about accessing any financial support available to you.","aboutCourse":"Our vision is to develop and prepare the teachers of tomorrow with the skills and knowledge they need to deliver creative and challenging teaching and learning.  \r\n\r\nOur inspirational programme is delivered by expert teachers and enhanced by attending central training with Pickwick Learning, NWSCITT and sessions led by Bath Spa University.  These aspects of the course bring together trainees from across the primary and secondary phases and from a range of schools, giving opportunities to network and reflect on different experiences. Our curriculum reflects the ITT Core Content: Managing behaviour, Pedagogy, Curriculum, Assessment and Professional Behaviours. Examples of aspects covered include: How children learn, Behaviour for learning and strategies for assessment. Primary trainees also learn about the way that we teach specific subjects in the curriculum. These central training days are either held at NWSCITT’s centre at Royal Wootton Bassett, at Lawn Manor in Swindon or virtually.\r\n\r\nOn your placement you'll be immersed in teaching and learning, gradually building up your teaching as your confidence grows and your skills and experience develop.  You will be released to attend central training.  During the Spring you will have a placement in a second setting in one of our partner schools. Trainees also have short  placements in a Special School and in a secondary School. We encourage our trainees to use the opportunities available through our extensive network of school partnerships to widen your experience, develop peer support and build networks to support your professional development. \r\n\r\nDuring your placements, you will be supported by your mentor (usually your class teacher).  You'll begin your placement on the first day of the school year and as a member of staff in the school you work in, you'll be expected to attend staff meetings and Training days as part of your development.  School mentors are experienced, quality practitioners.  They will support you in many different ways through coaching and mentoring, observations and feedback to ensure that you have the best possible preparation and training for embarking on your new career.  You'll also have opportunities to learn alongside the staff in your school to meet the varied needs of the children, adapting approaches and learning how to engage with parents and families, preparing you well for the challenges of teaching in the current climate.\r\n\r\nThere are 3 assignments during the year, supported by central training sessions led at NWSCITT, Lawn Manor or virtually by Bath Spa University. \r\n","interviewProcess":"Interviews for our programme (Primary QTS and PGCE with 60 Masters credits) are held at regular intervals throughout the year so that applications are processed efficiently.\r\n\r\nApplicants are required to attend one interview session where they will be asked to prepare a short teaching task (based on a text of their choice for a Key stage 1 or Key stage 2 class) and a brief presentation. \r\n\r\nSuccessful applicants are then asked to take two tests (English and Maths) to develop and support subject knowledge.","howSchoolPlacementsWork":"Placement schools are selected from across our partnerships which covers a wide geographical area: Bristol, Bath, and across Wiltshire - from our base in Corsham, moving north to Malmesbury, across to Swindon and Marlborough, south to Warminster and Salisbury and into Dorset. This means that we are able to ensure that trainees do not have unreasonable distances to travel to their placement school from their home.\r\n\r\nYou will have 2 contrasting placement schools during your training year (within Key Stage 1 & Key Stage 2.): \r\n* Host placement school from September - December and then again from Easter – June.\r\n* You will attend your Complementary placement school from January – Easter.\r\n\r\nWe have over 45 primary partnership schools working with us. When placing our trainees, we look at schools' context, location and their capacity to support our trainees.\r\n\r\nAlternative Placements:\r\n\r\nIn addition to the two main placements, we aim to offer trainees the experience of short secondary and specialist school placements to provide an understanding of alternative phase and alternative provision schools (Covid restrictions permitting).\r\n\r\nTeaching Timetable and Hours Worked:\r\n\r\n* The programme starts at the beginning of the school year \r\n* Trainees will initially observe in class, working alongside the class teacher before they begin team-teaching and small group teaching. Eventually, trainees will take on responsibility for entire classes, lesson planning and lesson sequencing.\r\n* Trainees can expect to begin by following a 40% teaching timetable, gradually increasing to 70%-80% by the end of the year. \r\n* Please expect to work full days during your course. It is also highly likely that you will be working outside of normal working hours at home. Central training days to run from 09.30am-4.00pm, subject to variation.\r\n\r\nCovid-19:\r\n\r\nIn the event of Covid-19 restrictions continuing to have an impact on schools, we will monitor, revaluate and amend our programme where necessary in response to guidance from the Government, Public Health England, DfE and NASBTT. This may include the structure of placements if necessary, or removal of alternative placements if not feasible.","personalQualities":"We are looking for committed, enthusiastic candidates who can demonstrate a passion for working with young learners to enable them to be the very best they can be.  We will be looking for meaningful, relevant experience of working with children or young people and some observation and experience of classroom practice. ","otherRequirements":"References:\r\nTwo references from a university tutor, employer or school-based contact\r\n \r\nExperience:\r\nIt is beneficial to show how you understand the role of a teacher and an understanding of how UK primary schools operate. \r\n\r\nSafeguarding:\r\n* An enhanced (DBS) and barred list check will be carried out.  (checked against the Teacher Regulation Agency).\r\n* If you have lived abroad in the last 10 years, you'll be required to present a Certificate of Good Conduct/Police Check from that country.\r\n* We reserve the right to check references/work history.\r\n* You will be subject to the Disqualification under the Childcare Act 2006.\r\n\r\n","status":1,"createdAt":"2021-07-06T10:55:20.263Z","updatedAt":"2021-10-01T13:54:39.921Z","canSponsorStudentVisa":"no","cycle":"2024"}
