{"id":"bc65ec4c-06d3-4a78-9c7f-0d3304a9e703","name":"Primary with Mathematics","code":"3F35","qualification":"pgce_with_qts","startDate":"2024-07-31T23:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"286cf12f-b3e3-41c5-9f33-2ff7807d2df0","code":"03","name":"Primary with mathematics"}],"locations":[{"id":"c60131c3-4c05-418f-9f64-30b091c19046","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"f8337932-0749-4e5e-8ac5-3bdb2b9c111d","code":"1DK","name":"LEAD Teaching School Hub Lincolnshire"},"accreditedBody":{"id":"ec9b83ed-1f6f-46b5-b172-44e52d93b21a","code":"N84","name":"The University of Nottingham"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We are able to offer an equivalency test to University of Nottingham School Direct PGCE offer holders only.\n\nYou are only able to take the equivalency test once.\n\nThere is no charge to take the test.\n\nWe do not accept any other equivalency tests.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"This route is ideal if you want to have an extra, mathematics focused, dimension to your training year. This may give you an enhanced profile for employment and promotion. \r\n\r\nL.E.A.D Equate, and the University of Nottingham work closely together to ensure that your progress on the course is closely supported and quality assured. \r\n \r\nUniversity days are spread throughout the year.  You will work with other primary trainees and the sessions will form an integral part of the work you do in school. You will be part of a large cohort of beginning teachers exploring the school curriculum and how to make it accessible and enjoyable to all pupils.\r\n\r\nYou will have a school mentor and a university tutor who will work closely with you and your mentor. From the beginning of the course you will be regarded as a member of staff but also a beginning teacher. You will attend development days, consultation sessions and extra-curricular activities.\r\n \r\nIn the second term you will undertake a placement in a second school. This is an opportunity to learn within a different context and share your experiences with other trainees.\r\n\r\nKey features of the mathematics specialist route include:\r\n* Exploration of your personal mathematics background, the aims and values of mathematics education and the importance of being a champion and advocate for mathematics\r\n* Two half-day sessions, focusing on your role as a mathematics specialist and the leadership and management of mathematics in primary schools\r\n* A twilight session once per term, that focuses on teaching challenging mathematics topics\r\n* An immersion day once per term, in which you will take part in a lesson study at a partnership school\r\n\r\nThe opportunity to:\r\n* Teach mathematics to more than one age range \r\n* See mathematics teaching at Key Stage 3 and in the Early Years, in order to understand the progression of the subject\r\n\r\nThe course is assessed at postgraduate level.  It incorporates two 30-credit modules which may be counted towards the MA in Education.  Assignments may be written pieces or presentations and may include collaborative work.\r\n\r\nPractical Teaching is assessed by a range of colleagues. Account is taken of your work over all school based elements of the course and your written records of such work.\r\n\r\nFor the award of the PGCE and to achieve QTS, you must have reached the required standard in both elements of the course.  \r\n\r\n\r\n\r\n","interviewProcess":"When you come for a School Direct interview at the University, there are likely to be other applicants being interviewed alongside you. You will not be in competition with the other applicants, in fact, we are keen to see that you can work collaboratively with others. The criteria we will use at interview to decide whether or not we offer you a place on the course are: \r\n\r\n* an awareness of current educational issues;\r\n* a realistic and positive view of schools and schooling;\r\n* an open and enquiring mind;\r\n* clear reasons for wanting to teach at the level for which you have applied;\r\n* motivation and commitment to teaching pupils of all levels of ability;\r\n* maturity and self confidence;\r\n* an appropriate level of subject knowledge in your chosen subject for secondary applicants.\r\n\r\nYou will be interviewed by staff from The School of Education.  You may be asked to carry out certain tasks that allow you to demonstrate your knowledge and skills, individually or in groups. \r\n\r\nWe then interview you in school. This will include:\r\n* Working with a group in class alongside class teacher\r\n* Q&A Interview\r\n\r\nWe will inform you of our decision asap after your interview. If you are given a conditional offer of a place on the School Direct course, you will receive a pack of information describing the steps you should take next. The conditional offer will become unconditional when we have received your acceptance and all the necessary clearances and documentation.\r\n","howSchoolPlacementsWork":"Placements will be based in one of our L.E.A.D. Academy Trust schools. When you visit a L.E.A.D. school you will notice these core characteristics:\r\n* the highest standards of behaviour and conduct; \r\n* outstanding teaching and learning; \r\n* a fully inclusive approach where all children are equally important;\r\n* a climate of mutual respect between the children, staff and community;\r\n* positive relationships;\r\n* high aspirations for all involved with the school – a ‘can do’ attitude; \r\n* a wide range of enrichment opportunities for all to get involved; \r\n* a celebration of all the cultures and faiths represented in the school; \r\n* an organisation where there are no excuses for underachievement.\r\n\r\nYou will be supported in developing a deepened understanding of the Mathematics Curriculum, given your specialism. \r\n\r\nTo find out more about L.E.A.D. schools please visit our [website](https://www.leadacademytrust.co.uk/schools)\r\n\r\nTo learn more about what L.E.A.D. Equate can offer whilst you are training, please visit our [itt overview pages] \r\n(https://leadequatetsa.co.uk/itt-overview/)\r\n\r\n","personalQualities":"* A passion for and dedication to teaching and the importance of education\r\n* The ability to develop positive relationships with students\r\n* A patient, caring, and kind disposition\r\n* Ability to develop a knowledge of all learners\r\n* Ability to engaging all pupils in learning\r\n* Resilience and optimism\r\n\r\n","otherRequirements":"All trainee teachers who enter the training programme will be expected to demonstrate that they are competent in Fundamental English and mathematics. \r\n\r\nAdmission to the course is subject to a satisfactory medical report, as you are required to meet the standards for 'Fitness to Teach'.  It is important that you disclose any medical condition or disability so that we can look at the best way of supporting you if you are offered a place on the course. \r\n\r\nYou will be subject to safeguarding checks which includes an enhanced DBS check.\r\n","status":1,"createdAt":"2021-07-06T10:46:30.179Z","updatedAt":"2021-10-04T18:50:16.101Z","canSponsorStudentVisa":"yes","cycle":"2024"}
