{"id":"68b1bd10-7d6c-4b0d-9c74-f3f85ce26703","name":"Modern Languages","code":"2MWN","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"ce8523ef-9236-4cd9-b260-d826c7a521b3","code":"ML","name":"Modern Languages"},{"id":"4608e5e3-2a1a-48a1-8236-56c7af5a139d","code":"24","name":"Modern languages (other)"}],"locations":[{"id":"8047cf56-7ae6-412a-a73c-769bd524f6ca","name":"Main Site","isPublished":"Y","status":"S"}],"trainingProvider":{"id":"3fe35a41-3037-4377-beed-e672835718e4","code":"L06","name":"North East SCITT (Formerly Shotton Hall SCITT)"},"accreditedBody":{"id":"3fe35a41-3037-4377-beed-e672835718e4","code":"L06","name":"North East SCITT (Formerly Shotton Hall SCITT)"},"profPost":"BO","degreeGrade":"9","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We accept equivalency tests via equivalencytesting.com","courseLength":"OneYear","feesUK":9250,"aboutCourse":"The first three weeks of the course is spent completing intensive training to build a foundation for your teaching career at The Academy at Shotton Hall and other North East Learning Trust schools. This involves: lesson observations, workshops and planning.\r\nAfter the initial training, trainees will then complete a five week teaching placement (before Christmas) then a twelve week teaching placement (after Christmas) in two different schools within our teaching school alliance.(Our schools are spread out from Teesdale to Northumberland and we will always consider your location when choosing your placement school.)\r\n\r\nAt each school, you will get time to get to know the school and department before diving in and teaching your first lesson.\r\n\r\nYou will also spend various days at The Academy at Shotton Hall and in Trust schools engaged in additional training which includes:\r\n\r\n•          Working within departments for literacy and numeracy intervention work\r\n•          PGCE training and support\r\n•          Interview and application guidance\r\n\r\nThroughout your teaching placements you will also take part in mini placements at different schools and educational settings. Some of these are compulsory and will give you the opportunity to explore particular areas of interest including:\r\n\r\n•          Primary\r\n•          Faith\r\n•          Special education needs and disabilities (SEND)\r\n•          Enquiry based learning (EBL)\r\n•          Sixth form (KS5)\r\n•          Behaviour management\r\n•          English as an additional language (EAL)\r\n•          Working with looked after children\r\n•          Early years and foundation stage (EYFS)\r\n•          Independent schools\r\n•          Working as part of a pastoral team\r\n•          Literacy and numeracy support \r\n\r\nAssessment happens throughout the ITT year, however it culminates with the QTS interview which takes place at the end of the year when trainees demonstrate how they have met the Teachers’ Standards.\r\n","interviewProcess":"This will involve a full day spent at The Academy at Shotton Hall in Peterlee for secondary applicants, or for primary places then interviews will be held at a primary school within the alliance. The day will consist of:\r\n\r\n•          A short written task\r\n•          A subject knowledge audit\r\n•          A 15 minute observed lesson (you will be informed in advance of the age group and topic of the lesson)\r\n\r\nIf you are successful at this stage, you will then be invited for a formal panel interview which will be held on the same day. You will also be given the chance to speak with staff, students and current trainees.\r\n\r\n*We are currently offering virtual interviews to candidates which will follow a very similar structure as described above, due to Covid-19 restrictions.\r\n\r\n\r\n","howSchoolPlacementsWork":"After the initial training, trainees will then complete a five week teaching placement (before Christmas) then a twelve week teaching placement (after Christmas) in two different schools within our teaching school alliance. (Our schools are spread out from Teesdale to Northumberland and we will always consider your location when choosing your placement school.) We work with over 80 schools across our teaching alliance.\r\n\r\nAt each school, you will get time to get to know the school and department before diving in and teaching your first lesson.\r\n\r\nFor primary trainees, you will get the experience to teach across two different age phases ranging from 4 to 7 years old and 8 to 11 years old. For secondary trainees, you will teach a range of age groups varying from 11 to 16 year olds and with some 16 to 18 enhancement.\r\n","personalQualities":null,"otherRequirements":null,"status":3,"createdAt":"2021-07-06T10:56:43.536Z","updatedAt":"2021-07-13T14:43:47.472Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
