{"id":"11f27194-41d0-4af8-b6ab-575f9c827b70","name":"Biology","code":"2586","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"322cfc19-d51d-45db-91e3-bd7b4738470f","code":"C1","name":"Biology"}],"locations":[{"id":"7b6778c0-fb7d-4377-be6a-55f7f582ca9a","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"396a845e-4c5c-4d50-8837-1548d9bdf8d5","code":"1GT","name":"Notre Dame High School, Norwich"},"accreditedBody":{"id":"d8370001-6f2b-4624-b30c-27ddc5beebfc","code":"S14","name":"Suffolk and Norfolk Secondary SCITT"},"profPost":"BO","degreeGrade":"1","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We do not offer equivalency tests.\n\nVisit bcu.ac.uk or  Equivalency Testing for more information.","courseLength":"OneYear","feesUK":null,"aboutCourse":"As a Secondary School Centred Initial Teacher Training Salaried trainee you will become part of a team of experienced professionals in a school from the start of the academic year and will, therefore, benefit from opportunities to work and learn alongside experienced teachers. Former trainees identify this as a particular strength, ‘On the job training is the best way to find out what works in practice’.\r\n\r\nDevelopment of a trainee’s subject knowledge is a key feature of our training programme and we create many opportunities for trainees to develop their subject knowledge, not only first hand from your school based mentors but also from our subject knowledge trainers who are all practising teachers and share their extensive knowledge and expertise about how to teach their subject to secondary school students.\r\n\r\nSecondary SCITT Salaried trainees receive core and subject knowledge training on one day per week (a Thursday) throughout the training period from September to June. \r\n\r\nOn this course you will achieve a Post Graduate Certificate in Education (PGCE) with 60 Masters’ credits and Qualified Teacher Status. In order to achieve Qualified Teacher Status, you will be assessed against all parts of the Teachers’ Standards as you accumulate the evidence across the ten month training programme. Additionally, to gain your PGCE there are three Masters' level assignments to write during your training and they help to link theory to the practice of what you are teaching in the classroom. Suffolk & Norfolk SCITT are a ‘personalised, relational, ethical’ Initial Teacher Training provider offering the Secondary Salaried PGCE programme.   All trainees on this course will obtain the following qualification, QTS, PGCE with 60 Masters' credits on successful completion of the course.\r\n","interviewProcess":"After your application is shortlisted by the SCITT and Lead School team, you will be invited to a formal interview by SCITT.   The interview will consist of questions by an interview panel and a subject knowledge task. If successful at the SCITT interview, you will be invited to the final part of the process known as Task Session which  will last approximately two hours.  You will complete group activities with other trainees and complete a couple of written tasks.\r\n\r\nIf you are successful after the SCITT Task Session and have attended an interview at a school, then you will be made an offer which is agreed by the Lead School and Suffolk and Norfolk SCITT as the training provider.","howSchoolPlacementsWork":"On the salaried programme you must have the support of a school who can offer you a placement in a subject we offer and meet the contributions to your salary at the time of application.  In partnership with Secondary SCITT we will ensure you have a high-quality school placement arranged.\r\n\r\nMost trainees train in subjects within the 11-16 age range but there is also the opportunity to train in the 14-19 age phase in specific subjects.","personalQualities":"We find that successful trainees have a passion for their subject which they wish to pass onto secondary school students. Trainees should be motivated, well-organised and demonstrate resilience.\r\n\r\nTrainees should understand  the importance of developing strong learning relationships with teenagers and can demonstrate that they view teaching as a valuable career. \r\n\r\nAdditionally trainees should be reflective, able to respond positively to feedback about their progress during their training year and also value being part of a team. ","otherRequirements":"\r\n* Confirmation of clear enhanced DBS check before you start the course.\r\n\r\n* Meet the 'Fit to Teach' criteria. Secondary SCITT use an Occupational Health provider to assess Fitness to Teach. The initial screening is paid for by Secondary SCITT, if further investigation is required, trainees may be asked to contribute towards the cost.\r\n","status":1,"createdAt":"2021-07-06T10:57:03.097Z","updatedAt":"2021-10-04T14:11:07.332Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"To be eligible for a place on the Salaried course you must have the support of a school who is willing to make contributions towards your salary.\r\n\r\nAs a guide towards your salary, trainees are paid full-time on point 1 of the unqualified teacher scale.\r\n\r\nSalaries will vary depending on which subject you are training in, number of hours taught and the length of your contract and this will be arranged by your placement school."}
