{"id":"4d38170a-930e-4c04-a909-97b47653634e","name":"Computing","code":"28HR","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"e6be6a9c-8696-4b88-8fbd-1ba1bef1b6fc","code":"11","name":"Computing"}],"locations":[{"id":"7b6778c0-fb7d-4377-be6a-55f7f582ca9a","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"396a845e-4c5c-4d50-8837-1548d9bdf8d5","code":"1GT","name":"Notre Dame High School, Norwich"},"accreditedBody":{"id":"d8370001-6f2b-4624-b30c-27ddc5beebfc","code":"S14","name":"Suffolk and Norfolk Secondary SCITT"},"profPost":"PG","degreeGrade":"1","english":"1","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We do not offer equivalency tests.\n\nVisit bcu.ac.uk or Equivalency Testing for more information.","courseLength":"OneYear","feesUK":9250,"feeDetails":"\r\n","aboutCourse":"You will achieve a Post Graduate Certificate in Education (PGCE) with 60 Masters’ credits and Qualified Teacher Status. In order to achieve Qualified Teacher Status, you will be assessed against all parts of the Teachers’ Standards as you accumulate the evidence across the ten month training programme. Additionally, to gain your PGCE there are three Masters’ level assignments to write during your training and they help to link theory to the practice of what you are teaching in the classroom.\r\n\r\nIn collaboration with our partnership schools, development of a trainee’s subject knowledge is a key feature of our training programme and we create many opportunities for this. Not only in school from your school based mentors but also from our subject knowledge trainers who are all practising teachers and share their extensive knowledge and expertise about how to teach their subject to secondary school students.\r\n\r\nCentre based training takes place in venues in either Norwich or Ipswich (can attend the closest venue to you) and this is approximately in six one week blocks throughout the year and in addition there are at least six subject knowledge days to attend which are mainly delivered in partnership schools across the two counties. Information about venues and dates of training for the whole year will be provided to you at induction at the end of August so you can make the appropriate travel arrangements.\r\n\r\nCentre based training is delivered by a range of classroom practitioners and experts in specific areas e.g. SEND, headteachers and local and national consultants. You have your first placement in one school for all of the autumn term; spring term is spent in a second school and then you return to the first placement school for the summer term until the end of June. This placement structure provides you with a breadth of experiences to help inform your choice of the type of school you wish to work in as an Early Career Teacher.\r\n\r\nAs part of our offer, we will also provide you with a laptop while on programme. (This has to be returned at the end of your training year.). As part of our commitment to you, and as an investment in your training, we will provide you with your own copies of a number of books by educationalists such as Tom Sherrington which will help to understand the evidence based approach to teaching and learning.","interviewProcess":"After your application is shortlisted by a team of subject specialists, you will be invited to a formal interview. This consists of a series of questions which ask you to demonstrate your subject knowledge and general knowledge of secondary schools, details of this will be given to you in advance. Interviews will take place online.\r\n\r\nAs well as completing a SCITT interview, you will be invited a Task Day which last approximately three hours. This session will be face to face and take place at the University of Suffolk in Ipswich. You will complete a subject knowledge assessment, group activities with other trainees and complete a couple of written tasks.\r\n\r\nAs a SCITT provider, we value the role our partnership schools play in the recruitment process as it is a key feature of our ‘personalised and relational’ offer to trainees and schools.\r\n\r\nTherefore, if you are successful at our Task Day you will be offered a place on the course and invited to a school placement interview in one of our partnership schools, local to you, and this interview will be organised by SCITT. This will give you the opportunity to observe the ethos and context of your potential placement school before your placement. The interview will usually take only ½ day and will give you the opportunity to engage and interact with students at your prospective placement school.","howSchoolPlacementsWork":"We will consider you for a training place in one of our local partnership schools, taking into account your home address and travel arrangements, as well as ensuring you have a high-quality school placement. Most trainees train in subjects within the 11-16 age range but there is also the opportunity to train in the 14-19 age phase in specific subjects.\r\n\r\nPartnership schools’ role in the recruitment process means that all school placement arrangements are in place by July, ready for you to attend your placement school on the first day of term in September.\r\n\r\nDuring each school placement you will work alongside a school based subject mentor who will be based in your department and will help to support and develop your teaching expertise in the classroom. In addition, you will also have two SCITT Tutors who will visit you between three and four times each term and help to guide you with your teaching but also provide extensive pastoral support where needed. With one of your SCITT Tutors, you will have weekly email contact so a close working relationship can be built to help support you during your training year.","personalQualities":"We find that successful trainees have a passion for their subject which they wish to pass onto secondary school students. Trainees should be motivated, well-organised and demonstrate resilience. \r\n\r\nTrainees should understand  the importance of developing strong learning relationships with teenagers and can demonstrate that they view teaching as a valuable career.\r\n\r\nAdditionally trainees should be reflective, able to take and respond positively to feedback about their progress during their training year and also value being part of a team. ","otherRequirements":"* Confirmation of clear enhanced DBS check before you start the course. This check is paid for by Secondary SCITT. There is an expectation that you will join the update service for £13 per year at a cost to you. \r\n\r\n* Meet the 'Fit to Teach' criteria. Secondary SCITT use an Occupational Health provider to assess Fitness to Teach. The initial screening is paid for by Secondary SCITT, if further investigation is required, trainees may be asked to contribute towards the cost. \r\n","status":1,"createdAt":"2021-07-06T10:57:03.791Z","updatedAt":"2021-10-04T14:09:17.120Z","canSponsorStudentVisa":"no","cycle":"2024"}
