{"id":"be51715b-846b-4256-926f-13c51d4528d1","name":"Primary","code":"2CLZ","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"72988510-9986-4789-b4b9-ad80675dd24b","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"0e0389ae-aa3b-4d13-be01-8eeb89907fb6","code":"1V5","name":"Halstow Primary School"},"accreditedBody":{"id":"049fe65f-08dc-4686-9ac8-606dce490128","code":"G56","name":"Goldsmiths, University of London"},"profPost":"BO","degreeGrade":"9","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feesInternational":14600,"aboutCourse":"The School Direct PGCE (QTS) programme with Halstow has three distinct modules. These are: \r\n•\tSchool Experience  \r\n•\tStudies and Professional Issues in Education \r\n•\tCurriculum Studies \r\n\r\nSchool Experience \r\n\r\nYou will spend approximately 6 weeks of the programme in University. In this time you will experience a mixture of lectures and small group seminars to support you in developing a strong and confident knowledge of the subjects you will be teaching in the primary classroom. Underpinning the programme is the Professional Studies course which is designed to prepare you fully for the wider roles and responsibilities of the teacher. \r\n\r\nThe remainder of your time will be spent in schools; the bulk of your experience will be spent in your main school, with an alternative 6 week placement in another hub school. We try to ensure that your 6 week alternative placement provides you with a contrasting context so that you develop a broader range of professional skills.\r\n\r\nOur school based training sessions take part in schools across the hub and give all trainees the opportunity to come together regularly for a whole day to observe excellent teaching and to develop key professional skills. This also provides a mutually supportive context for trainees.\r\n\r\nThe Primary PGCE (QTS) Programme is taught and assessed at Masters Level. In addition to a recommendation for QTS, if you pass all academic elements of the programme you will also leave with level 7 credits, which is equivalent to one third of a master’s degree. Full academic support is provided to ensure you are fully prepared for assessment regardless of your prior experiences. \r\n\r\nStudies and Professional Issues in Education (SPIRE)  \r\nThe SPIRE module focuses upon issues that most impact upon the young person’s experience of education in the 21st Century.  In sessions you will be asked to: consider a range of issues relating to diversity and inclusion; engage with research and policy; and link all of this to your own experience in the classroom.  In your written assignment you will choose one area from this module to reflect upon more deeply. \r\n\r\nCurriculum Studies  \r\nFor students following a School Direct pathway this module will focus specifically upon Learning Theory and will ask students to reflect upon the impact that research in this area has on the policy and practice of their school.  \r\n","interviewProcess":"Once a candidate is selected for interview you will be invited to a selection day at one of our hub schools. The selection process consists of:\r\n*A small group activity with children that the candidate plans and delivers  whilst being observed\r\n*Three short assessments covering phonics, mathematics and English\r\n*Group discussion task\r\n*Interview\r\n","howSchoolPlacementsWork":"The Primary PGCE Programme offers you the opportunity to specialise in one of three age phases. These are: \r\n•\t3-7 (with placement in Early Years Foundation Stage and Key Stage 1)\r\n•\t5-11 (with placement in Key Stages 1 and 2) \r\n•\t7-11 (with placements in Upper and Lower Key Stage 2). \r\n\r\nYou will be asked at interview to select the age phase you are most interested in working with. \r\n\r\nYour school-based time will be spent in two hub schools with the bulk of your experience spent in your main school, and an alternative 6 week placement in another hub school. We try to ensure that your 6 week alternative placement provides you with a contrasting context so that you develop a broader range of professional skills.","personalQualities":"We are looking for applicants that have an understanding of the nature of working in an urban setting and a have a clear commitment and enthusiasm for working with children. You must be able to show resilience and be willing to work with others to create positive, happy and ambitious environments for children to thrive in.","otherRequirements":"You do not need to have extensive school experience before applying but we do ask that you have spent a minimum of 5 days in a primary school in the last 5 years to ensure that you are fully aware that the profession is right for you. ","status":1,"createdAt":"2021-07-06T10:48:21.207Z","updatedAt":"2021-07-08T08:53:24.723Z","canSponsorStudentVisa":"yes","cycle":"2024"}
