{"id":"697d663e-68a1-4640-815a-3cf6cbca0fb8","name":"Mathematics","code":"37LD","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"72345aa7-096c-488f-8649-085b8178cadb","code":"G1","name":"Mathematics"}],"locations":[{"id":"48fb28cc-0a9d-4cec-8b72-94251682b1b6","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"6d68da9f-6219-46fe-93df-cb26b2fb518b","code":"1HQ","name":"Alliance of Leading Learning"},"accreditedBody":{"id":"e843cb68-d310-478c-8dba-cf9633fea086","code":"C55","name":"University of Chester"},"profPost":"PG","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"The University of Chester prefer applicants to have a minimum of a 2:1 but in most cases, we are able to justify offering a place to a student with a 2:2 depending on the circumstances and subject.","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We offer equivalency tests with Edge Hill University  which can be taken on site here at The Marches School. Here is the link\nhttps://www.edgehill.ac.uk/study/equivalency/\nWe will accept other other organisations.","courseLength":"OneYear","feesUK":9250,"feeDetails":"There are no additional fees for this course other than the stated £9250. Financial assistance is available through Student Finance England and Wales.\r\n(https://www.gov.uk/student-finance)\r\n(https://www.studentfinancewales.co.uk/)\r\n\r\n","financialSupport":"Bursaries are available through the DfE.\r\n\r\nIn some cases we may consider a salaried option depending on the subject involved and the individual student circumstances. Potential applicants should discuss this with us prior to applying if they would like to be considered for a salaried route. ","aboutCourse":"The Marches is a School Direct  lead school in partnership with Chester University. The school  has a bespoke training centre for teacher trainees which is apart from the main school building.\r\n\r\nIt features a study room with access to laptops, a common room with kitchen and bathroom facilities, printing facility, central work areas,  two other conference areas and car parking. In addition, trainees can study in the main school alongside the secondary teaching staff and have access to the school restaurant which features the most up to date cashless system and healthy menu options.\r\n\r\nThe school offers administrative staff who work solely with the trainees providing stationery, printing, induction training and support.\r\n\r\nThe course consists of two placements spread over the year with 130 days school based. There are 5 full weeks of study here at The Marches, three at the beginning of the course and two in the middle of the autumn term.   There are 25 days of study with the University of Chester which are currently on line and spread over the course. In addition there are 10 single study days at the The Marches for professional development delivery and academic learning.  The course is designed to maximise school based time as this is how we think that students learn best.  The Alliance currently have plans to develop two more delivery hubs, one from Haley Learning Community and one from Powys. \r\n\r\nThere are three modules with assignments that are spread over the year. These carry 60 masters credits at level  7.  We offer a huge amount of support with the academic study as we recognise that this is in addition to learning to teach. The modules are very well written to link with the teaching part of the course. \r\n\r\nStudents have timetabled confidential sessions with our well being tutor in order to manage the demands of the programme.\r\n\r\nDevelopment of the student's teaching is bespoke as we recognise that some individuals have more experience than others. It is anticipated that a student will build up to 35% of a usual timetable by the end of the autumn term, 60% by  the end of placement 1 and 80% by the end of the course. Students are assessed weekly and given feedback to develop. \r\n\r\nWe offer enrichment activity  to improve student's CVs and prepare them for a teaching role. There is also time to resubmit assignments if necessary.\r\n\r\n\r\n\r\n","interviewProcess":"\r\nApplications will be sifted by the lead school and the University. Applications will be expected to show necessary qualifications and any additional qualifications obtained.\r\n\r\nThe personal statement should be positive and to a high standard. Applicants should explain why they want to enter teaching, what they have to offer, should show their ability to reflect and think critically about their experience and education in general.\r\n\r\nThe interview process is on line and will consist of:\r\n•\tTwenty minute panel interview\r\n•\tTeaching task \r\n•\tShort presentation on an area of the syllabus \r\n•\tAcademic written task\r\n•\tSubject knowledge tests in English and Maths\r\n\r\nAt interview the applicant will be expected to reflect on their experience and discuss what attributes they can offer to the teaching profession.\r\nTraining to be a teacher requires excellent time management skills. It is important to keep on top of lesson planning alongside the commitment to assignments.\r\n\r\nThe interview panel will consist of the School Direct Director and the Business Develoment Manager who both run our ITT provision.   The applicant will be expected to have some knowledge of the national curriculum for their subject .\r\n\r\nThe interview process will require applicants to plan a short 20 minute lesson for a group of Yr 7 children.  The applicants will be asked to share their lesson plan and talk through how they would deliver the lesson.\r\n\r\n\r\n","howSchoolPlacementsWork":"Placement schools are chosen in partnership with the individual students. We have a large partnership which spreads across Shropshire, Powys, North Wales and Telford and includes independent school as as well state schools. \r\n\r\nThe course is rigorous and we therefore try to accommodate the wishes of students as far as travel is concerned, we endeavour to place students within 30 mins of their home so that home life is manageable for the duration of the course. \r\n\r\nSome of our schools offer A level opportunities and teaching at this level is normally included within the second placement. We try as hard as possible to ensure that A level experience is included in at least one of the placements. \r\n\r\nWe partner with many secondary schools which include:\r\n\r\n\r\n* The Marches School\r\n* Lakelands\r\n* Sir John Talbot\r\n* The Corbet\r\n* St Martins\r\n* Oswestry School\r\n* Ellesmere College\r\n* Thomas Adams School\r\n* Shrewsbury Academy\r\n* Shewsbury School\r\n* Charlton School\r\n* Ercall Wood \r\n* Grango School\r\n* Hadley Learning Community\r\n* Llanfyllin High School\r\n* Dinas Bran, Llangollen\r\n* The Grove School, Market Drayton\r\n* Llanfair Caereinion\r\n\r\n\r\n\r\nWe have a visiting tutor who will visit students in school early on in each placement to ensure that the mentoring structure is in place and all the paperwork has been provided. The tutor will then visit the trainee regularly over the following weeks to jointly observe the teaching element and also to complete the end of placement assessment.\r\n\r\nThe mentoring team provide maximum support to each of the students whilst on placement, sometimes issues arise which can be dealt with immediately because of our ability to communicate with each other.\r\n\r\n\r\n\r\n","personalQualities":"We are looking for those with a genuine passion for teaching and their chosen subject. \r\n\r\nAt interview the applicant will be expected to reflect on their experience in school and discuss what attributes they can offer to the teaching profession.\r\n\r\nTraining to be a teacher requires excellent time management skills. It is important to keep on top of lesson planning alongside the commitment to assignments.\r\n\r\nIt will be hard work and we expect those that we offer places to be committed to completing the course. We however guarantee to give you all the support that you need. \r\n","otherRequirements":"In addition to academic qualifications applicants will also need:\r\n\r\n*  An enhanced DBS check and possibly letters of good recommendation if they have lived and worked abroad.\r\n*  A medical form which may involve further investigation\r\n*  Completion of Subject Knowledge Enhancement courses if applicable\r\n*  A minimum of two weeks experience that is current and relevant in a secondary school prior to applying although we can arrange this. ","status":1,"createdAt":"2021-07-06T10:56:56.667Z","updatedAt":"2021-10-05T10:46:03.039Z","canSponsorStudentVisa":"yes","cycle":"2024"}
