{"id":"8394b3fa-90e9-4d36-9e6c-7aeefc175839","name":"Geography","code":"2PVV","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3f47e67b-7fa5-4947-a5a0-74d528cd2a87","code":"F8","name":"Geography"}],"locations":[{"id":"3cc80d6a-1eb3-49f3-8096-bdfc4b5a0942","name":"Heath Park School","isPublished":"N","status":"S","vacancies":"F"},{"id":"22a9d401-6373-4506-9de5-419a4d901533","name":"Coppice Performing Arts School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"48c2ca20-015d-4251-b7b1-2855958ef292","name":"Heath Park","isPublished":"Y","status":"R","vacancies":"F"},{"id":"47094494-0c88-4471-94b3-1e0c5e2aeb0f","name":"Moseley Park","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"28e7b0da-15c3-4164-ad9e-2646e4ff5ff6","code":"1VG","name":"Central Learning Partnership Trust"},"accreditedBody":{"id":"4da5abb2-b287-451e-8d75-c5b79e11c2bb","code":"W75","name":"University of Wolverhampton"},"profPost":"PG","degreeGrade":"0","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"Ideally your degree should match or closely relate to the course which you are pursuing for your Initial Teacher Training.","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"For information about the University of Wolverhampton's School Direct programme, please visit their website: \r\n\r\n(http://www.wlv.ac.uk/about-us/our-schools-and-institutes/faculty-of-education-health-and-wellbeing/institute-of-education/teaching/school-direct)\r\n","interviewProcess":"Potential trainees will be take part in a thorough selection process, in which we consider your suitability to enter what is a demanding, but very fulfilling profession. We will work closely with our university partners to co-ordinate this process. \r\n\r\nAs teaching is a pupil-centric profession, a key part of the interview process will be interaction with young people. This may be working with a small group or short teaching activity. You will be given clearer guidelines for this prior to interview though. Our young people are incredibly astute and you will also face a student panel, which is often worse than any job interview! You may be asked to complete a short literacy or numeracy test. However, you will be given details about this in advance. \r\nThere will also be a formal interview, in which our University partners will be involved. Whilst it can seem a daunting process, it is a thorough process that is designed to get the best match of applicant to the place available. \r\n\r\nThe interview process is designed to highlight a candidates areas of strength both pedagogically and in regards to their subject knowledge.  \r\n\r\nThe interview process typically includes:\r\n- A learning walk\r\n- The delivery of a short subject specific activity to a small group of students\r\n- Subject knowledge test\r\n- Student panel\r\n- Formal interview\r\n\r\nPlease note the interview process may vary from that detailed above due to COVID-19 restrictions.","howSchoolPlacementsWork":"We are looking for individuals- we know that no teacher fits a mould and we want you to bring your experience, enthusiasm and dedication. You should be ambitious and engaging, passionate about your subject, but most importantly, passionate about developing young people. \r\n\r\nYou should have some experience of working with young people. This might be, for example, visits to a school, but could also be helping with sports teams, drama groups or youth clubs. We would like you to have undertaken some school experience or you may have even worked in a school. However, we would gladly provide you with school experience in support of your application to our partnership. \r\n\r\nDuring your training you will spend the majority of your time in your placement school, during which time you will be required to teach across two different key stages.  \r\n\r\nYou will conduct a short 6 week placement in a contrasting school to enhance and broaden your experience of effective teaching and learning.","personalQualities":"We are looking for individuals.  We know that no teacher fits a mould and we want you to bring your experience, enthusiasm and dedication. You should be ambitious and engaging, passionate about your subject, but most importantly, passionate about developing young people. \r\n\r\n","otherRequirements":"In addition, it is expected that you have  undertaken some school experience and or have a good understanding of current issues in education. ","status":1,"createdAt":"2021-07-06T10:48:12.915Z","updatedAt":"2021-09-29T13:35:53.803Z","canSponsorStudentVisa":"yes","cycle":"2024"}
