{"id":"1a85f5da-8e3f-4b9f-be46-27a7c41d1de2","name":"Biology with Psychology","code":"C18X","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"322cfc19-d51d-45db-91e3-bd7b4738470f","code":"C1","name":"Biology"},{"id":"1878e739-30bb-4de9-841e-42dacfb1fa0c","code":"C8","name":"Psychology"}],"locations":[{"id":"ca360304-76de-49f9-9557-18144a47a136","name":"University of Exeter (Exeter Campuses)","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"d41a1821-e35b-48eb-bf02-4842872b04a2","code":"E84","name":"University of Exeter"},"profPost":"PG","degreeGrade":"0","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"Please check our [website](https://www.exeter.ac.uk/teachertraining/) for guidance on additional academic requirements specific to this course such as degree subject and A level requirements.\n\nWhile as standard we normally only accept applicants who meet this criteria, if you have a 2:2 or equivalent, or are coming from a different academic background which is equivalent to degree level, you are welcome to make an application through the DfE Apply system for consideration or contact our PGCE Admissions team for more information. Diverse teachers enrich schools and pupils' experiences and we value diversity in schools and encourage potential teachers from a range of backgrounds to consider applying.","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We accept equivalency tests from A Star Equivalency and equivalencytesting.com (please do contact the PGCE Admissions team for further guidance before signing up for an equivalency test).","courseLength":"OneYear","feesUK":9250,"feesInternational":20000,"feeDetails":"Note - eligibility for home fee status for applicants from EU countries has changed from 2021-22 onwards so please do check the guidance if this is relevant to you.  For more information, please see our [Fees and finance]( https://www.exeter.ac.uk/teachertraining/apply/feesandfinance/) webpages.","financialSupport":"For information on Government loans and training bursaries, please visit the [Student Finance England]( https://www.gov.uk/student-finance) and [Get into Teaching]( https://getintoteaching.education.gov.uk/) websites.\r\n\r\nThe University of Exeter offers a £520 bursary to all UK students studying for a PGCE, whose household income is £25,000 or less. There is no separate application procedure for this bursary. Instead, we make an assessment using the household income information you provide to Student Finance England (you must make sure you give consent for details of your SfE application to be shared with the University of Exeter). This consent to share is requested during the application for financial support, but can be given at any time throughout the year by contacting SfE. \r\n\r\nFor more information, please see our [Fees and finance]( https://www.exeter.ac.uk/teachertraining/apply/feesandfinance/) webpages","aboutCourse":"Our [Secondary Biology with Psychology PGCE course](https://www.exeter.ac.uk/teachertraining/secondary/science/biologywithpsychology/) is an 11-16 QTS (Qualified Teacher Status) course with post-16 enhancement. This means that whilst you must meet the standards for QTS within the 11-16 age range, you will also have additional experience of post-16.  \r\n\r\nThe programme has three fully integrated components:\r\n\r\n1. Education and Professional Studies - The Education and Professional Studies component introduces you to key educational ideas and principles and provides you with opportunities to consider these in relation to your subject specialism and the wider school context.  This component includes one summative assignment worth 30 Masters level credits.\r\n\r\n2. School Experience - Central to the course is the developing your ability to meet the DfE’s Teachers’ Standards which trainees must demonstrate in order to be recommended for Qualified Teacher Status (QTS). School-based tutors and mentors are responsible for your learning & development and receive well-designed training. You initially work with groups of children, before taking on more responsibility for planning and independently teaching whole classes. You will have two main placements offering contrasting environments.\r\n\r\n3. Specialist Subject Knowledge and Pedagogy (Biology with Psychology): The PGCE Biology with Psychology course will prepare you to teach all aspects of science to at least Key Stage 3, Biology to at least KS4 and psychology teaching at KS4/post-16 level.  The course includes: * Science education workshops; * 'National Curriculum Courses' to develop to GCSE level your subject knowledge of the areas of science outside your specialism and show you ways to teach these topics; * 'Subject specialist courses' to develop to A-level your specialist subject knowledge and show you ways to teach these topics; * 'Subject Support Groups' where students teach aspects of their own specialism to each other; * An optional weekend field course; * 'Education and Professional Studies' lectures; * A range of guest speaker sessions delivered by individuals from schools and science education organisations\r\n\r\nNote: The DfE entry requirement to pass professional skills tests in literacy and numeracy was removed in 2020. Instead trainees are now benchmarked during their training against a Government-defined set of fundamental mathematics and English skills. This is embedded into the training and does not involve any specific testing at interview. Trainees are given tools to help identify areas for development where needed.  The course includes activities to enable trainees to demonstrate the requisite skills by the end of the course.\r\n","interviewProcess":"For 2022-23 the interview process will take place online (this may change to face-to-face interviews later in the cycle, depending on the covid situation).   It comprises various elements, all designed so that you can showcase (and so we can assess) your skills, attributes and subject knowledge.  We notify all interviewees ahead of time what will be expected of them at interview, so you have plenty of time to prepare. \r\n * You will be sent a link to an online welcome presentation and some subject-specific information prior to the interview so you can find out about the structure of the programme, including school placements and the taught course \r\n * You will also be sent a link to a video and asked to submit a written reflection prior to the interview.\r\n * You will be asked to prepare a short presentation in which you present a teaching idea using an artefact of your choice\r\n * There will be a one-to-one interview with an Admissions Tutor, during which you will show your short presentation. This is where Subject Tutors will discuss your application, your suitability for teaching and your subject knowledge. This is also an opportunity to learn about the particular course you are applying for.  The Admissions Tutor may be joined by a teacher from one of our partner schools.\r\n\r\nThe interview process is designed to give you a flavour of the programme. There will be plenty of opportunities to ask questions. You should allow approximately half a day for the interview.","howSchoolPlacementsWork":"You will be working within at least two schools during the course and all of our partner schools have specially trained mentors who will assist you in learning to teach. These colleagues are essential to your development as a teacher and will help you to develop both classroom skills and reflective and evaluative strategies. Together with schools, we will provide you with opportunities, training and support.\r\n\r\nTerm 1 begins with two weeks of observation (preliminary school experience known as 'Anticipating Practice'). This leads into the university-based course which focuses on professional development, specialist subject knowledge, pedagogy and teaching skills. In November you will spend two weeks in your first placement school to begin your classroom practice.\r\n\r\nTerm 2 is spent in your first placement school with three seminar days led by the university. \r\n\r\nTerm 3 is spent in your second placement school with two seminar days led by the university. \r\n\r\nThe University of Exeter currently has partnership agreements with over 250 schools across most parts of the South West (Cornwall, Devon, Dorset and Somerset) as well as a small number of primary schools in London.\r\n\r\nEvery effort is made to take into consideration your personal circumstances and preferences when allocating your placements. Trainees generally live in and around Exeter or commute to Exeter for the Autumn term, and then move to the area their placements will be in. Once on placement, there are 5 seminar days led by the university throughout the year, offering the opportunity to share experiences and good practice. You can claim a contribution towards expenses for these days if you are living away from Exeter and the sessions are on campus.\r\n\r\nOur accommodation office can offer advice regarding finding accommodation for the Autumn term. Many trainees will be placed further afield than Exeter for the whole of their school-based work, and will need to find accommodation in that area. Once registered, we provide an accommodation database, which lists many accommodation options previously used by our trainees. Many trainees live together during their time on placement and some live with school staff.\r\n","personalQualities":"Energetic, able and committed science applicants will find this an empowering course which develops personal transferable skills, strength of character and offers the potential for playing a part in shaping the future of society.","otherRequirements":"In addition to the academic requirements listed, selection is based on performance at interview and a satisfactory fitness to teach assessment and DBS enhanced disclosure.\r\n\r\nAlthough not essential it would be advantageous to be able to reflect on any school-based experience or experience working with young people in another context at interview.\r\n","status":1,"createdAt":"2021-07-06T10:46:44.215Z","updatedAt":"2021-10-04T08:56:38.695Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
