{"id":"6628b6dd-5fe7-45e9-ac37-5c98da8a837d","name":"Mathematics","code":"Y425","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"7_to_14","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"72345aa7-096c-488f-8649-085b8178cadb","code":"G1","name":"Mathematics"}],"locations":[{"id":"ac4534db-57b5-4185-8611-02ebe0ee16c2","name":"Cleeve School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"0b962e51-0b1e-4bc8-a8af-fdd83f78a53a","name":"Walkwood Middle School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"c4e285d9-73fd-4d7c-b34f-e18f7445bd63","name":"Birchensale Middle School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"469f1848-b902-4395-89c8-6e3f43f344b4","code":"3B6","name":"Cleeve School"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"In this PGCE with middle school focus, you will specialise in teaching maths from year 5 to year 8.  \r\n\r\nYou will have 2 placements in our partner schools and specialist training at Cleeve Training Hub throughout the course as well as opportunities for further study at the University of Gloucestershire.\r\n\r\nThe middle years maths course is desirable to those who wish to teach their specialist subject in  depth and to a high level and gives excellent experience of Key Stage 2 and 3 curriculum.","interviewProcess":"If you are shortlisted for interview, you will have a an interview at Cleeve Training Hub or in one of our partner schools.  \r\n\r\nThe interview process consists of a short 'student task' which you will be informed of prior to the day in order to prepare.  This gives us the opportunity to see you engage with young people.  \r\n\r\nThere will be a panel interview consisting of the SLT link in charge of training, the subject mentor and representation from the University of Gloucestershire.\r\n\r\nDuring the day, you will also have a short subject knowledge task.  Again, you will be informed the nature of this in advance of the interview to allow sufficient time to prepare.","howSchoolPlacementsWork":"There will be 2 placements during the PGCE.  A shorter placement Monday- Thursdays from September - December, and a longer placement from January - June.\r\n\r\nFrom September - April, Fridays will be based in the training centre at Cleeve as we cover the core teacher training content.  Elements of this training will be accessible remotely.\r\n","personalQualities":"We are looking for applicants who are motivated to work with children to provide the very best outcomes for them.  We want to work with committed subject specialists with a passion to impart their subject.","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:55:25.774Z","updatedAt":"2021-10-05T10:02:17.034Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
