{"id":"75de6b0b-a80a-46f0-b9c2-b9ff1caa641c","name":"Design and technology","code":"Z290","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"118fabd7-86d0-4a40-9e9a-e5c302abe59b","code":"DT","name":"Design and technology"}],"locations":[{"id":"e62602a4-66e1-4517-a23a-a0beb21c4966","name":"Trinity High School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"d9a0dc68-3399-4966-97a3-e720a041518f","name":"Churchdown School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"3015c9b4-0364-497e-aa00-61206648e379","name":"Winchcombe School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"ac4534db-57b5-4185-8611-02ebe0ee16c2","name":"Cleeve School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"469f1848-b902-4395-89c8-6e3f43f344b4","code":"3B6","name":"Cleeve School"},"accreditedBody":{"id":"9aa67012-b776-4027-89f4-5531efb3a9d2","code":"G50","name":"The University of Gloucestershire"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"In this PGCE with secondary school focus, you will specialise in teaching Design and Technology from year 7 to year 13.  You will have the opportunity to teach other subjects during the course.\r\n\r\nYou will have 2 placements in our partner schools and specialist training at Cleeve Training Hub throughout the course as well as opportunities for further study at the University of Gloucestershire.\r\n\r\nThe secondary Design and Technology course is desirable to those who wish to teach their specialist subject in  depth and to a high level and gives excellent experience of Key Stage 3, 4 and 5 curriculum.","interviewProcess":"After applying for this course, you will be invited into Cleeve Hub for an interview with a subject lead and the Deputy Headteacher responsible for the Training Hub.  During the interview, you will have a short mini 'lesson' with a small group of pupils and a short subject knowledge task.  You will be given the breakdown of the assessment process in advance in order to better prepare.","howSchoolPlacementsWork":"You will have 2 placements during the Schools Direct programme.\r\nWe will work with trainees to find local schools within a short journey from your home address.\r\n\r\nPlacement 1: September - December \r\n4 days a week in placement school\r\n1 day a week training at Cleeve Hub\r\n\r\nPlacement 2: January - June\r\n4 days a week in placement school (Until Easter)\r\n1 day a week training at Cleeve Hub (Until Easter)\r\n5 days a week in placement school (April-June)\r\n\r\nYou will have a dedicated subject mentor in each school with a regular weekly mentor session, as well as a Senior professional mentor.\r\n\r\n","personalQualities":"We are looking for trainees with a genuine passion for their subject and a desire to impart this to the next generation.  We are seeking individuals who show a skill for working with young people and the understanding of what this will involve.\r\n\r\nWe hope to recruit trainees who are keen to develop and are able to listen to feedback and advice in order to make progress towards becoming an outstanding teacher.\r\n\r\nWe want to work with personable trainees who are fun and engaging\r\n","otherRequirements":"We believe it is important to have some experience within a school before undertaking the Schools Direct course and will work with prospective trainees to find relevant experience prior to the course start date.\r\nWe understand that trainees may already be in employment so we will work to find a suitable way to give trainees on site opportunities.\r\n\r\nAll course offers are subject to criminal record checks.","status":1,"createdAt":"2021-07-06T10:55:25.809Z","updatedAt":"2021-10-05T10:16:02.450Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
