{"id":"b7f3ddb0-208a-4f40-a522-c9cc4c66b74f","name":"Physics","code":"C360","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"bf97cd0a-224c-43d3-a021-84143df13e8d","code":"F3","name":"Physics"}],"locations":[{"id":"3015c9b4-0364-497e-aa00-61206648e379","name":"Winchcombe School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"ac4534db-57b5-4185-8611-02ebe0ee16c2","name":"Cleeve School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"469f1848-b902-4395-89c8-6e3f43f344b4","code":"3B6","name":"Cleeve School"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"The Schools Direct course comprises two school placements in Secondary Schools giving trainees the opportunities to teach students from 11-18.  You will be given high quality Physics training in a thriving and busy science department.  \r\n\r\nWhole school training will be held each Friday in Cleeve Training Hub and training will consist of up to date relevant educational issues, exciting teaching and learning strategies and opportunities for reflection and research.\r\n\r\nThe course is in conjunction with the University of Gloucestershire who provide excellent support around the assignments and high quality research opportunities.","interviewProcess":"There will be a short pupil task to see you engage with young adults, this will be based around your subject.\r\n\r\nFollowing this task will be an interview with key members of the course from Cleeve, partner schools and the University\r\n\r\nWe will invite candidates to have a short subject knowledge test after the interview.","howSchoolPlacementsWork":"There are 2 placements on this course\r\n\r\nPlacement 1 - September to January, Monday to Thursday.\r\nFridays are training days at Cleeve Taining Hub\r\n\r\nPlacement 2 - January - June \r\nFriday training days continue until April, thereafter placements will be full time (Monday-Friday) until course completion in June.\r\n\r\n","personalQualities":"We are looking for applicants with a passion for their subject and a desire to impart this knowledge to young people.  We are looking for potential teachers who will inspire students and willing to give them the very best life chances.","otherRequirements":"We will support successful applicants to have some school experience prior to their course start date","status":1,"createdAt":"2021-07-06T10:55:25.465Z","updatedAt":"2021-10-05T10:09:36.308Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
