{"id":"fefeb125-3075-456e-a1fc-420592386a49","name":"Primary","code":"X100","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"2a09e44f-5e6b-4fd7-9c7a-dd0762511f17","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"da50cf69-960a-4c7e-b113-ef6cea1c32d5","code":"P82","name":"Portsmouth Primary SCITT"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":9250,"aboutCourse":"Portsmouth Primary SCITT runs a one year course that qualifies successful trainees to teach children aged 5-11 years in primary, junior and infant schools.\r\n\r\nThis is a full-time PGCE course in which 70% of the time is spent in schools and 30% in training centres. You will have the opportunity to observe good teachers at work and be able to work alongside them, gradually developing your own teaching skills. You will receive high quality mentoring, together with support from the SCITT team to enable you to develop into a competent and confident newly qualified teacher.\r\n\r\nTrainees will have half a term of workshops in primary subjects, based mainly at our training room on the site of Beacon View Primary Academy, followed by half a term of teacher training in their placement school. Trainees will complete their practice at Key Stages 1 and 2. A total of three teaching practices is required and will cover the age range of 5-11. Two practices will take place in one school and one practice in another, which should have a contrasting age range and catchment area to the first school.\r\n\r\nAssessment is based on trainees’ ability to meet the standards in Professional Standards for Qualified Teacher Status and Requirements for Initial Teacher Training. Trainees are required to write two assignments based on classroom research embedded in primary practice. In addition, trainees make presentations based on their knowledge of English, mathematics and science.","interviewProcess":"Candidates are selected for interview from those received via UCAS or DfE Apply.\r\n\r\nThe interview process normally comprises of four components, (presentation, mini teach, interview and written task) completed across an assessment day held at our centre. \r\n\r\nAs 2020/21, we may adapt our process and conduct remote interviews depending on local lockdown and official government guidance, during the global pandemic. Candidates will be thoroughly briefed ahead of time.\r\n\r\nMost candidates will know within one week as to whether they will be offered a place on the course. We offer all candidates the opportunity to receive feedback if they are unsuccessful in their application to secure a place.\r\n\r\nIf candidates are offered a place they will be asked to spend some time preparing for the course. All candidates are told that it will be a challenging year when they are offered a place, but they are given a considerable amount of individual support from the course tutors, link tutors and mentors either in centre or school based training","howSchoolPlacementsWork":"All schools in the SCITT partnership are among the best that Portsmouth has to offer. They were selected for the quality of education they provide for Portsmouth children. Each school serves a very different catchment area. In practice, this means that Portsmouth Primary SCITT is able to offer a range of training experiences to prospective candidates.\r\n\r\nWe have an average of 20 schools in the SCITT partnership. Most schools are based in Portsmouth. Placements are made on an individual basis, considering: distance from home; careful pairing of mentors with trainees and various other factors which will give trainees the best school based experience possible.\r\n\r\nFurther information about placements schools can be found on our website, www.portsmouthscitt.co.uk.\r\n\r\n","personalQualities":"","otherRequirements":"Our expectation is that prospective candidates will have some knowledge of what it is like to work in a primary or early years classroom, either on a voluntary basis or possibly working as a Learning Support Assistant.\r\n\r\nTo be competent and confident in the use of ICT.\r\n\r\nYou must obtain an Enhanced Disclosure and Barring Service check (DBS) and an Occupational Health Assessment to determine fitness for teaching.","status":1,"createdAt":"2021-07-06T10:56:52.576Z","updatedAt":"2021-10-01T08:59:47.480Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
