{"id":"531a2f7c-1c88-4263-9b18-e98ab18ac22d","name":"Religious Education","code":"V6X9","qualification":"pgce_with_qts","startDate":"2022-09-01T09:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"724b5d16-28dd-4431-bc17-ea4be4daedc4","code":"V6","name":"Religious education"}],"locations":[{"id":"c6eceebd-4ffb-4a80-af98-98d4f37db91f","name":"Main site","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"97f4f68e-0711-458c-864b-03857f31d23e","name":"Main Site","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"235467b2-657d-43ac-b4d1-bb52d8896608","name":"Main Site","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"76880438-2931-40e2-83d4-d32cb549f95d","name":"Main Site","isPublished":"true","status":"running","vacancies":"full_time"}],"trainingProvider":{"id":"f8a389ed-1e76-445c-8d11-34e8979ed40e","code":"L26","name":"Leeds SCITT"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"If you do not already have the appropriate GCSEs, or if you are unable to provide proof of your grades, we can accept GCSE equivalency tests taken with www.equivalencytesting.com, www.astarequivalency.co.uk or Birmingham City University (BCU) www.bcu.ac.uk.\n\nYou only need to do the test if you are offered a place with us that you firmly accept. We can only accept tests from these providers and you will need to contact them directly for details on how to book and their costs.","courseLength":"OneYear","feesUK":9000,"feeDetails":"Students can apply for course fees through Student Finance (if eligible).","aboutCourse":"\r\n* Personalised, school-based training from September 2022- June 2023.\r\n* Achieve Qualified Teacher Status from a highly regarded, well established Provider in the northeast of England.\r\n* Post Graduate Certificate in Education (PGCE) awarded by Leeds Trinity University and delivered face to face in CTTP Lead Schools.\r\n* Dedicated, modern training facilities.\r\n* Our curriculum is designed by expert practitioners and delivered in practical and interactive weekly training sessions to compliment your classroom experience.\r\n* Allocated mentor for each trainee to ensure personalised, bespoke support and training to meet individual needs.\r\n* Unique recruitment process with schools represented at each stage- they ‘choose’ you!\r\n* Training in two school settings- main and second school placement (January- February).\r\n* Trainee progress is monitored throughout the year and assessed against the Teachers’ Standards.\r\n","interviewProcess":"The selection procedures which follow aim to ensure that:\r\nEntry requirements specified in DfE Qualified Teacher Status Standards (2012) are applied carefully, giving due weight to academic equivalencies, experiences and motivation.\r\n\r\nEntrants are given a sound understanding of the nature and demands of the course in order to assure successful applicants complete the course and enjoy their new profession in education.\r\n\r\nSelection will be based on: - a teaching activity related to the age and phase of the class, completion of a written task and a formal interview. ","howSchoolPlacementsWork":"All trainees teach in two schools during their training year. Their second school placement is chosen to provide a different context to their main school experience.  Trainees will have a mentor and Professional Tutor in this placement.  A Partnership Link Tutor (PLT) is assigned to each trainee; each half term she/he will visit the trainee in school to support, observe and QA the school-based experience to moderate and to ensure consistency of training across the Partnership.","personalQualities":"","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:57:19.475Z","updatedAt":"2021-10-04T16:53:33.585Z"}