{"id":"e7621138-a5f8-43d5-813a-c93a9c44360d","name":"Design and technology","code":"W9X1","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"118fabd7-86d0-4a40-9e9a-e5c302abe59b","code":"DT","name":"Design and technology"}],"locations":[{"id":"76880438-2931-40e2-83d4-d32cb549f95d","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"f8a389ed-1e76-445c-8d11-34e8979ed40e","code":"L26","name":"Leeds SCITT"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"If you do not already have the appropriate GCSEs, or if you are unable to provide proof of your grades, we can accept GCSE equivalency tests taken with www.equivalencytesting.com, www.astarequivalency.co.uk or Birmingham City University (BCU) www.bcu.ac.uk.\n\nYou only need to do the test if you are offered a place with us that you firmly accept. We can only accept tests from these providers and you will need to contact them directly for details on how to book and their costs.","courseLength":"OneYear","feesUK":9250,"feesInternational":12500,"feeDetails":"Leeds Trinity postgraduate Initial Teacher Training (ITT) tuition fees are £9,250 in 2020-21 for home students and £12,500 for EU/International applicants. Tuition fees may rise with inflation in future years.\r\n\r\n\r\nYou will not have to pay these fees upfront. Eligible UK students can apply for a tuition fee loan to cover the cost of tuition fees from the government.\r\n\r\n\r\nUK students on non-salaried places studying full-time can apply for a package of maintenance funding from the government to help with general living costs and additional funding if you have children and/or a disability.   \r\n\r\n\r\nFind out more information at www.gov.uk/studentfinance. This website also has a calculator which gives you an estimate of what you will receive.","aboutCourse":"This course is designed for people who would like to teach at the secondary age phase, 11 to 16. The course lasts for approximately ten months and is divided into three stages, each with the emphasis on being School Centred.\r\n\r\n\r\nThe Leeds SCITT Design Technology course provides you with the opportunity to specialise in Resistant Materials, Food Technology or Textiles up to KS4 (GCSE level). You will also have the opportunity to teach a second specialism at KS3 (ages 11 – 14). \r\n\r\n\r\nThe course lasts for ten months and is divided into three stages, each with the emphasis on being School Centred. Being in a school environment from week one provides you with the unique opportunity to build upon your prior skills and experience and enhance your subject knowledge and professionalism in a real life classroom context. \r\n\r\n\r\nTrainees develop their knowledge and understanding of the Design & Technology curriculum through conducting research assignments and lesson observations. Professional understanding of the requirements of being a teacher, including behaviour management strategies and how to support pupils with varying needs, are supported by central based training at Leeds Trinity University and at the Lead School.\r\n \r\n\r\nThroughout the course trainees are fully supported by the Lead Tutor for Design Technology, a Link Tutor from Leeds SCITT and subject specialist Mentors who are dedicated to training the very best teachers.","interviewProcess":"If you’re invited to an interview, you’ll receive an email from us that explains everything you need to know about your interview. This includes the date, time and the location, as well as what to prepare beforehand and what will happen on the day, so it’s really important to read this email very carefully. \r\n","howSchoolPlacementsWork":"The first part of your training (the Lead School Experience) is based predominantly in the Lead School for your subject. This school has a specialism in your subject area and the Lead Tutors are subject experts who are also excellent teachers and trainers.\r\n\r\nEach school has dedicated training areas so that your training consists of quality time with your tutors.\r\n\r\nThe initial training is focused on subject pedagogy:\r\n\r\n•\tHow highly effective planning leads to successful outcomes in the classroom;\r\n\r\n•\tHow you can ensure pupils make good progress in their learning;\r\n\r\n•\tHow you can assess learning to inform next steps and strategies to support highly skilled personalisation.\r\n\r\nYou will be immersed in the school environment from week one and you will be seen as a professional by school staff, pupils and parents. This allows you to take the theory, thinking and research and see / implement this in the classroom, ensuring you develop your ‘teacher’ persona as quickly as possible.\r\n\r\n\r\nThe next stage of the course is called Stage A.  This is a full-time placement in a partnership school with some core development days at your Lead School and Leeds Trinity University.\r\n\r\n\r\nDuring this stage you will have a dedicated Subject Mentor who will observe you teach, support you with your planning and developing your subject knowledge for teaching. They will be your first port of call during this stage of training when you establish yourself in the classroom as the teacher.\r\n\r\nThe third stage of the course Stage B is a full-time placement in a contrasting partnership school, again with some core development. \r\n\r\n\r\nIn the last two weeks of the training year, you will have the opportunity to undertake an enrichment and enhancement placement or experiences. What this looks like is entirely different for each trainee as this is a time to pursue an interest- such as working in a SEND school, an additional subject, organising out of school learning and many more options!\r\n","personalQualities":"What we see in successful applications and interviews\r\n\r\n\r\nPeople who:\r\n\r\n•\tHave a proactive and reflective approach to their own development\r\n\r\n•\tGenuinely desire to support young people and help them succeed\r\n\r\n•\tHave good interpersonal skills\r\n\r\n•\tAre friendly and engage with young people\r\n\r\n•\tHave a great love and enthusiasm for their subject\r\n\r\n•\tAre organised and can manage time and competing priorities\r\n\r\n•\tAre innovative and willing to try new ideas\r\n","otherRequirements":"Successful applicants also tend to have:\r\n\r\n*Advanced level qualifications (or equivalent) in Design & Technology.\r\n\r\n\r\nAn offer of a place is subject to:\r\n\r\n* A satisfactory Disclosure and Barring Service (DBS) Enhanced Disclosure Certificate \r\n* A satisfactory medical.\r\n","status":1,"createdAt":"2021-07-06T10:50:48.821Z","updatedAt":"2021-09-29T11:55:15.039Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
