{"id":"fa6a265e-d4d1-4072-8fa9-06ca978e37ec","name":"Primary (3-7)","code":"328W","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_7","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"2ef38ea5-d822-4709-a507-8ca903fd87a3","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"04adc47a-e3a7-4281-972c-d7b63335a29a","code":"2ER","name":"Westerton Partnership"},"accreditedBody":{"id":"e5b8e187-ccc1-4253-9dd0-376d6abf7e66","code":"2EY","name":"Exceed SCITT"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We ask candidates to use a third party for the equivalency tests and we would recommend they use Equivalency Testing. (https://www.equivalencytesting.com/)","courseLength":"OneYear","feesUK":9250,"feesInternational":9250,"feeDetails":"We are offering School Direct as a fee-funded/non-salaried route into teaching and fees for the programme are applicable. Graduates applying for initial teacher training (ITT) usually take out a student loan to pay their £9250 tuition fees to Exceed SCITT.  Although there’s a cost, applicants need to consider the starting salary of a teacher is £25,000 and there are many options to secure promotion within a few years of qualifying. The pain of paying a loan is compensated by a good starting salary and a rewarding career. \r\n\r\nTrainees need to consider how they transport themselves from their training school to the training venues across the Leeds Partnership. Some of our trainee teachers often car share, reducing travel costs. Having said this, please remember that our schools are geographically close to each other. \r\n\r\nFor more information about fees and funding please visit Student Finance.\r\nhttps://getintoteaching.education.gov.uk/funding-and-salary/overview\r\n\r\n","financialSupport":"At Exceed SCITT we want to ensure that all trainees with potential to become a teacher can access teacher training programmes. \r\n\r\n​Planning to train to be a teacher and choosing the right route into teaching for you is an exciting moment in your life. Getting the right financial advice and support is a crucial step in the decision-making process.\r\n\r\nFor further information about funding your teacher training, applying for student loans and maintenance loans please contact Get Into Teaching who will be able to signpost you in the right direction. ","aboutCourse":"Our unique school direct programme maximises your time in school and in classrooms. You'll be awarded Qualified Teacher Status (QTS) by Exceed SCITT and a Post Graduate Certificate in Education (PGCE) by a University. Even the PGCE is drawn directly from your work in school and is not a separate taught course. \r\n\r\nA strength of this course is the way in which theory and practice are related as a result of extensive time spent working with children in at least two schools. Throughout the programme, you will develop an understanding of the theories that underpin good practice, observe good and outstanding teaching and reflect and evaluate your impact on pupil progress. \r\n\r\nThis course is targeted at teaching pupils aged between 3 and 7 (Foundation Stage and KS1). The programme is organised into three stages which gradually take you from the beginnings of planning and teaching to being  a competent and confident, professional, reflective practitioner. Our unique programme focuses on the National Curriculum so that each trainee develops strong subject knowledge and teaching strategies to ensure pupil progress. Another key strand of the programme is Professional Practice, such as effective behaviour management and understanding inclusion. We also recognise that each trainee is an individual and we will ensure that the programme is bespoke to meet individual needs as personal well-being is also very important to us. \r\n\r\nEach candidate will be allocated a class based mentor. You will work with the mentor, receiving weekly tutorials to celebrate successes and work on areas for development. Your mentor will work with you to jointly agree your targets and next steps for development as a teacher. \r\n\r\nEvery aspect of the programme is led by practitioners/tutors working in our partnership schools. All of our practitioners/tutors have proven expertise in their subject and professional knowledge. We encourage a reflective approach to your learning so there is time to discuss, model  and work with other trainees to share best practice you have observed. \r\n\r\nIf you're wanting to train to be a teacher and make a difference to children's life chances, there is no better place to train than in our partnership schools. Leeds is a fantastic place to train to teach and our schools will provide you with a wealth of experience for starting your teaching career. ","interviewProcess":"Westerton Primary Academy is the lead school in the School Direct Partnership and will be coordinating the recruitment process in partnership with Exceed SCITT. \r\n\r\nMake sure that your application is clear and grammatically accurate. We are looking for your potential as a trainee teacher, not for someone who is already an experienced teacher. In your personal statement you might want to cover the following aspects, which we offer as a guide only.\r\n\r\n* Your reason for wanting to teach, why primary?\r\n*Your vision for education and your commitment to young people in Leeds. How do you know that teaching is the career for you? \r\n* Your subject knowledge - think about the primary curriculum.\r\n* Your experience of working with children and young people - what have you done and what did you learn?\r\n* Your other relevant and transferrable skills/experiences that can be related to teaching.\r\n\r\nAll our School Direct trainees who are shortlisted for interview will be invited into one of our partnership schools where you will be made very welcome.\r\n\r\nYou will be given a tour of the school and an opportunity to find out more about the programme. You will have an opportunity to lead a short teaching episode based upon a children's book and a 30 minute individual interview. This way we really get to know you and you get the opportunity to find out how our partnership supports you to be the very best teacher that you can be. ","howSchoolPlacementsWork":"You are in school all this time. In fact, even when you are working on the academic parts of the programme this is supported by a Tutor from the providing University who comes to one of our schools to work with you. \r\n\r\nAll of our partnership schools are 100% committed to your training and you will have a Host school and a Home school (where you do the majority of your training). Geographically our schools are located close to each other in the Morley and Tingley area of Leeds and our partnership is diverse. \r\n\r\nThis school direct programme specialises in working with children from 3-7 years old so your training will take place in Early Years Foundation Stage and Key Stage 1. \r\n\r\nWe select your schools based upon previous experience and individual circumstances. We are able to match your needs within the partnership schools due to the number of trainees we intend to train. The structure of the programme enables you to get to know the whole partnership because your dedicated training days are delivered by expert tutors from within the partnership. Having an opportunity to see practice and meet children in a wide range of schools helps you to reflect on what is going to have the most impact upon your progress towards QTS. \r\n\r\nYou will have a minimum of two schools throughout the year and your assessed blocks will provide you with a variety of experience and teaching practice, build your confidence and classroom excellence and equip you well for the reality of your ECT year. ","personalQualities":"We are looking for applicants with the potential to train to teach.  Individuals who are passionate and enthusiastic about children and education. A great rapport with children and a positive and reflective perspective are essential. We are looking for people that care about our schools and the communities they serve. \r\n\r\nRemember that we really try to get to know you as an individual at the interview so that you can evidence your personal qualities which will make a difference to the life chances of the pupils in our schools. \r\n","otherRequirements":"We want to make sure that you have made the right choice in training to be a teacher. \r\n\r\nBefore starting the programme all applicants must be deemed suitable to train to teach so safeguarding checks will be undertaken. They must also demonstrate they are fit to teach so will need to complete a pre-ITT health questionnaire. \r\n\r\n\r\n\r\n ","status":1,"createdAt":"2021-07-06T10:47:14.530Z","updatedAt":"2021-09-28T07:59:04.749Z","canSponsorStudentVisa":"no","cycle":"2024"}
