{"id":"e29b09dd-da48-4041-ae72-a304d986a462","name":"Primary","code":"3FRL","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"0dbf9e84-a81c-4349-a72d-183ba9be9b26","name":"Main Site Bransgore C of E Primary School Learning Centre (19F)","isPublished":"Y","status":"R","vacancies":"F"},{"id":"6fa4ea3c-0e0e-46e8-98c4-6c00455836ff","name":"St Luke's Church of England Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"fb79e301-a953-47b5-b165-ff669f9c5835","name":"Hordle CE (VA) Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"8444a78d-2580-43b7-9da6-a57065ee6186","name":"Trinity C of E V A First School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"5d670071-24b2-41e9-a4da-693afca92e59","name":"University of Winchester","isPublished":"Y","status":"R","vacancies":"F"},{"id":"d3432371-39f6-4014-ab9a-1d0e2ed5baea","name":"Ringwood C of E Infant School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"28cc43f0-ba55-4870-80f1-8b74598e978c","name":"Western Downland Church of England Aided Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"274328ae-5cc5-4a06-947b-746ae529f7ec","name":"Poulner Infant School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"abdea08c-1e1e-4ffa-af6a-2ecd96aa73e2","name":"Fordingbridge Infant School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"dacf9ca5-e2c3-4b0f-bdab-61fc14667219","name":"Christchurch Junior School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"f07e7521-5e83-4c11-95e7-09ebfb284777","name":"Twynham Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"6f556292-559a-412e-bed6-9effd7d4215b","name":"Somerford Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"33c50f01-ddaa-47c2-9a08-c051df0585dc","name":"St Katharine's C.E. (V.A.) Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"88633554-a7cb-4bc8-ae7b-ab34a33f0956","name":"William Gilpin Church of England VA Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"bdea7f01-3a71-4e83-ada4-6eea182f7671","name":"Highcliffe St Mark Primary School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"1cb7705c-e6cc-4d25-b825-e62cfc846732","code":"19F","name":"Bransgore Initial teacher Training (BITT) – School Direct"},"accreditedBody":{"id":"3700fb02-7007-40c8-9127-b070e146d6cb","code":"W76","name":"University of Winchester"},"profPost":"PG","degreeGrade":"1","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"Please see https://www.equivalencytesting.com/ for further details on how to organise and take an equivalency test. \n\n(Please note that a level 2 functional skills qualification in English, Maths and Science is not recognised as the equivalent to a grade C or above by the DFE for applications to teacher training courses).","courseLength":"OneYear","feesUK":9250,"feesInternational":9250,"financialSupport":"Financial help, in the form of loans for both tuition fees and living costs, is available from the Student Loans Company.\r\n\r\nFor further information and how to apply, please visit [https://www.gov.uk/student-finance]\r\n\r\n- Most students won’t have to pay anything up front. There are student loans to help with tuition fees and living costs.\r\n- Repayments are based on future earnings and not what you borrow and you only repay when you have completed your course and are earning more than £25,000. For example, in April 2018 the estimated repayment for someone earning  £27,000 is only £15 per month.\r\n- You don’t need to have accepted a place with us to apply for student finance. You can usually apply on-line by May.","aboutCourse":"Bransgore Initial Teacher Training (BITT) has a well established reputation and has trained over 100 teachers (formerly South Coast SCITT). Our Primary School Direct Programme is delivered over the course of an academic year and on completion of your training you will be awarded Qualified Teacher Status (QTS) and you will undertake a PGCE from the University of Winchester.\r\n\r\nWe work with a strong group of  partnership schools which has been praised by Ofsted and Winchester University for the high quality Initial Teacher Training delivered to students over many years. Training with us qualifies for you to teach children from 4-11 years. All students with us become students at The University of Winchester and have full access to University facilities and the opportunity to attend graduation at Winchester Cathedral upon successful completion of the PGCE.\r\n\r\nOur partnership spans the areas of Hampshire, Dorset and Bournemouth. Many of our trainees find employment within the partnership and often go on to become school-based mentors or contributors to the taught course. A distinctive feature of our partnership schools is their commitment to providing high quality provision, reflected by nationally recognised awards and inspection reports. The schools serve diverse communities including rural and urban catchments.\r\n\r\nPeople who undertake this course will learn about a wide range of facets of primary practice including planning, assessment and pupil progress, behaviour management, working with other professionals and parents and how to effectively teach all primary curriculum subjects.  \r\n\r\nOver the course of the whole year there are two written assignments and an additional presentation style assignment, each designed to embed understanding of core elements and to support trainees in linking educational research to the most current practice and tutors are always on hand to provide feedback and support.\r\n\r\nYou would receive the daily support of a school-based mentor whilst on placement, who is the teacher of the class in which you would be based. Practical assessment is ongoing with weekly lesson observations leading to an end of placement report. Trainees will also collect a portfolio of evidence demonstrating how they meet the National 'Teachers' Standards'. \r\n\r\nThe majority of the central training is based at Bransgore Primary school, near Christchurch in our purpose built 'learning centre' or at the University of Winchester delivered by subject experts. Occasionally, training is also based in schools or other premises in the Hampshire and Dorset areas.","interviewProcess":"We welcome applications via the new DFE APPLY website. You should write a full personal statement giving reasons for wanting to teach. You should include any experience of working with children (although strongly recommended, this is not an essential requirement for application). Successful applicants will be invited to attend interview during a selection morning (This may be via zoom depending on the current situation).  As part of the morning, you will be involved in some short tasks and a group teach. Your interview will be with the Bransgore School Direct Lead and a representative from the University of Winchester. The interview is your chance to demonstrate your potential to become a successful teacher. Dates for these are arranged on an ongoing basis throughout the academic year and full details of what to expect and how to prepare are sent in advance to each applicant so that they know exactly what to expect from the day. \r\n\r\nApplicants should possess the minimum qualification requirements or be working towards them with a view to them being in place by the time that the course begins. Please make it clear on applications if you are working towards GCSE or degree qualifications and when results will be known.\r\n\r\nBransgore ITT prides itself on very clear lines of communication. On completion of the assessments, prompt feedback is always given to candidates as to whether or not they have been successful during the selection process.","howSchoolPlacementsWork":"You will train across at least two school phases (KS1/ KS2) in two different schools, offering a range of different experiences to ensure that you are well prepared for the teaching profession.\r\n\r\nYou will spend two initial training weeks with all trainees based in Bransgore Primary School before beginning your first 10 week Formative placement in your main school. This provides an ideal opportunity to gather lots of experience without it being formally assessed.  Your time teaching is balanced with time out of class which may include observing and planning alongside other teachers, planning individually, visiting other classes/schools and having time to work on University assignments and research. \r\n\r\nAfter Christmas students partake in an assessed 6 week placement in a contrasting school/Key Stage before returning to their main school for a final assessed school experience lasting 10 weeks.  Whilst our assessed placements are not in Early Years, a number of our students go onto be successful Early Years teachers. The school direct route is bespoke to individual needs.\r\n\r\nIn a typical week, you will spend four days in your 'home' school learning from outstanding and supportive teachers and leaders.  Once a week you will attend a centre based session delivered by specialists from within our school partnership or at the University of Winchester. These training days cover a range of specific subject areas of study that will enable you to develop into a competent and confident Primary School Teacher by the end of the course. You will be supported along the way by a number of different colleagues and will be assigned a Personal tutor at Bransgore, University tutor and school based mentor. \r\n\r\nBransgore ITT works with a partnership of 10 to 20 schools based across Hampshire and Dorset. Placements are offered by partner schools annually which are then selected and matched to each trainee by the School Direct Lead. Decisions of where to place trainees are based on a number of factors including proximity to the trainee's home, what kinds of support or challenge they may require from their mentor, their personal characteristics and their prior background and experience. \r\n","personalQualities":"We are looking for trainees that are;\r\n- well organised and committed to teaching as a long-term career.\r\n- have the ability to use their initiative and demonstrate high levels of resilience. \r\n- the ability to learn quickly.\r\n- dedicated people who can demonstrate effective interpersonal and communication skills and who can work effectively as part of a team. \r\n-passionate about making a difference and reflect and think deeply about their practice, actively seeking advice and guidance in order to be the very best they can be.\r\n","otherRequirements":"- Successful interview\r\n- Provide proof of address and ID \r\n- Health Declaration check\r\n- Disclosure and Barring Service (DBS) check. This will be done by the University of Winchester. See more info at https://www.gov.uk/government/organisations/disclosure-and-barring-service\r\n- Although not compulsory, we believe that some recent school experience is extremely beneficial to those wanting to go into a career in teaching and many of our successful trainees have previously worked in roles such as teaching assistants or as a volunteer within school. We can help you to gain this at Bransgore prior to application if required.","status":1,"createdAt":"2021-07-06T10:48:24.890Z","updatedAt":"2021-08-27T14:22:39.056Z","canSponsorStudentVisa":"yes","cycle":"2024"}
