{"id":"bcb59530-dff6-4757-8176-acd8415bcd94","name":"Biology","code":"AP31","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"322cfc19-d51d-45db-91e3-bd7b4738470f","code":"C1","name":"Biology"}],"locations":[{"id":"a9bfd9ec-cf3e-4a6b-a86b-8b96c1c958c8","name":"Culcheth, Warrington","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"dbc9f149-9701-4e33-a9f3-2f69602006dd","code":"4F5","name":"Culcheth Campus"},"accreditedBody":{"id":"cb360fcd-0c3a-4fc2-a4df-521e9475cd1c","code":"G65","name":"Bright Futures SCITT"},"profPost":"PG","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"A UK degree of classification 2.2 or higher (we may consider experienced applicants with a 3rd class degree for a QTS only programme).\n\nYou should be able to demonstrate how approximately 50% of your degree course is relevant to the subject you wish to teach.\n\nAt least 3 GCSEs grade A*-C (4 or better) with GCSE grade C or above in both English and Mathematics (or equivalent qualifications)","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Equivalent to GCSE 'C', not functional skills.","courseLength":"OneYear","feesUK":9250,"feesInternational":9250,"feeDetails":"Applicants who are not British citizens or a citizen of one of the EEA (European Economic Area) countries will need a visa to study in the UK. More details can be found from the Home Office","financialSupport":"\r\n\r\n","aboutCourse":"This course is designed to enable you to become a successful teacher of Biology. Culcheth Campus, in partnership with Alliance for Learning SCITT offers trainees the opportunity to work with outstanding teachers and experienced practitioners from day one of the course. Over 150 days of the course will be spent in schools working alongside highly professional and well-qualified colleagues. Specific subject knowledge training and audits will enable you to build up a strong knowledge of the Biology curriculum for Key stage 3 and 4. Trainee timetables are designed to increase in size and complexity over the training year, but trainees are supported at all times to ensure a balance between challenge and support is met.\r\n\r\nAll trainees gain experience of both key stage 2 (upper primary) and Key stage 5 (post 16).\r\n\r\nTrainees are assessed holistically in partnership with their mentor and and the wider partnership team at Culcheth Campus and Alliance For Learning. Observations of teaching form a large portion of the assessment process, with a range of opportunities for trainees to reflect on their progress against the teachers’ standards (2012). Trainees reflect on a weekly basis, culminating in termly written reports produced jointly with mentors. This process is summarised through a moderation interview at the end of the course. Trainees are supported on this journey through a series of school based tasks to enable a thorough understanding of the teachers’ standards.\r\n\r\nThroughout the course trainees receive face to face training in pedagogy and subject knowledge. This training is delivered by current practitioners and takes an evidence-informed approach to teaching and learning, enabling trainees to adapt their own learning for the context of their placement schools. Whilst the majority of training takes place at Culcheth High School and Altrincham Grammar School for Girls, some training will take place in partner schools across Greater Manchester and Lancashire.\r\n\r\nApplicants undertaking the PGCE programme are expected to complete four written assignments leading to 60 M level credits.\r\n\r\n“The high quality face-to-face training, assignments and placements combine to give trainees a firm basis on which to develop their skills and knowledge” Ofsted 2017\r\n\r\n“Employers of trainees comment very favourably on the significant improvements in trainees’ expertise and knowledge, brought about by their training” Ofsted 2017\r\n","interviewProcess":"Following an application that meets our criteria,  an interview will be arranged with Culcheth Campus. This will included the following elements:\r\n\r\n* A short pupil-based activity where we ask you to prepare a lesson walk-through.\r\n* An interview with staff from the Culcheth Campus and the wider SCITT partnership.\r\n* A knowledge audit to ascertain your needs.\r\n* A written communication task.\r\n\r\nPlease note that interviews will take place via video conferencing until further notice.","howSchoolPlacementsWork":"This course leads to qualified teacher status (11-16). All secondary placements are arranged through an A-B-A model. This means that trainees will be placed at their teaching practice one school for the winter term, and then teach in a contrasting school from January to April. Following Easter, trainees will return to their main placement school until the end of June. Placement schools are chosen through a number of factors, including prior experience, training needs and location We do not expect anyone to be traveling for more than an hour to their placement schools, and usually it is much less.\r\n\r\nFace to face training takes place on Fridays. Whilst the majority of training takes place at Altrincham Grammar School for Girls, some training will take place at Culcheth Campus alongside our partner schools across Greater Manchester and Lancashire.","personalQualities":"A passion for the subject you wish to teach\r\nThe potential to train to teach\r\nExcellent subject knowledge\r\nResilience\r\nEnthusiasm\r\n\r\nApplicants must produce a well written and clear personal statement that sets out how they meet the course requirements. The personal statement is part of the application process.","otherRequirements":"All applicants must undergo a suitability to teach check: this included a disclosure and barring service check and a fitness to teach check.\r\n\r\nSome applicants may be required to complete a subject knowledge enhancement course.\r\n\r\nFull admissions policy can be found at: http://allianceforlearning.co.uk/scitt/policies/","status":1,"createdAt":"2021-07-06T10:55:58.074Z","updatedAt":"2021-09-17T14:04:13.434Z","canSponsorStudentVisa":"no","cycle":"2024"}
