{"id":"bfe86cbb-7459-47ff-898d-f5d713cacd2c","name":"Primary","code":"28TR","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"27b941dc-960e-4e7d-93c1-97214496330d","name":"Greentrees Primary School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"dd023fad-7961-43f9-a0e2-366a4a91f429","code":"1DD","name":"ArrowITT"},"accreditedBody":{"id":"3700fb02-7007-40c8-9127-b070e146d6cb","code":"W76","name":"University of Winchester"},"profPost":"PG","degreeGrade":"9","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"The training course is a PGCE  Level 7 with full QTS status. \r\nThe time spent at the University of Winchester is where the students are taught the modules of the PGCE programme. Further details of the content of the course are available from the University of Winchester.\r\nThe students spend 120 days in school on two block placements. A shorter 7 week placement in Term 2 of the Autumn Term followed by a longer 12 week placement in Terms 5 and 6.\r\nThe University assesses all the assignments. \r\nThe teacher tutor and the link tutor assess the teacher placements. There is a clear process to seek help from the University where students are at risk of reaching the minimum standards.\r\nThe University is an Outstanding University and the lead school, Greentrees is also outstanding (Ofsted March 2015)\r\n","interviewProcess":"Suitable applicants who meet all of the selection criteria, will be invited to interview.\r\nThe candidates will be assessed by at least two head teachers in the ArrowITT alliance and a representative from the University of Winchester. There will be a formal interview, a written task, a group task with other candidates and a 15 minute lesson with a small group of children. Candidates will need to demonstrate some understanding of education and current issues.  All the tasks are completed on a single day.\r\nIf successful at interview, commencement of training will be conditional on passing the skills tests and meeting all academic requirements, DBS checks, medical checks etc.","howSchoolPlacementsWork":"The schools are all in the Salisbury area making travel to schools easily accessible.\r\nOne placement will be in KS1 and one placement will be in KS2.\r\nThere will also be a three week School Based enquiry.\r\nWe have 11 partner schools in ArrowITT.\r\nThe schools in our cluster all have recent and relevant experience hosting students successfully.\r\nThe total number of days in schools will be 120.","personalQualities":"We are looking for highly committed potential trainee teachers who are passionate about a career in education. Applicants should enjoy working with young people and be hard working, flexible and have a sense of humour.\r\nSuccessful candidates will work well in collaboration with others as well as independently and will be creative in their outlook.\r\nWe are looking for candidates with some prior experience of working with children. \r\nWe are looking for candidates who are aware of the rewards and challenges of the year.\r\nWe are also looking for students who can listen and act upon advice.","otherRequirements":"A DBS and medical check will be required before commencing the course.","status":1,"createdAt":"2021-07-06T10:50:38.110Z","updatedAt":"2021-07-26T08:26:18.933Z","canSponsorStudentVisa":"yes","cycle":"2024"}
