{"id":"5d739e8d-50c8-48e9-8daa-908f4b1749b8","name":"Modern Languages","code":"J522","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"other","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"9727f674-61ba-4efa-b1f2-21ec7e354442","code":"15","name":"French"},{"id":"ce8523ef-9236-4cd9-b260-d826c7a521b3","code":"ML","name":"Modern Languages"},{"id":"e34fd2a3-a32e-44e9-aea1-666badf3ac03","code":"22","name":"Spanish"}],"locations":[{"id":"f5a92eab-7754-4735-88b4-ed115f25f45c","name":"Durham Johnston Comprehensive School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"2c9ee990-4051-4c32-b98c-ac23d8cbec2b","name":"Sedgefield Community College","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"ca89585b-587b-41d7-9432-e554c0410970","code":"4B4","name":"Think North East School Direct Partnership"},"accreditedBody":{"id":"f3a93938-0208-4680-ac22-b564b18ff02b","code":"D86","name":"Durham University"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"9","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We accept www.equivalencytesting.com in English and Mathematics.","courseLength":"OneYear","feesUK":9250,"feesInternational":20500,"feeDetails":"The tuition fees shown are for one complete academic year of full time study, are set according to the academic year of entry, and remain the same throughout the duration of the programme for that cohort (unless otherwise stated).\r\n\r\nPlease note that fees are subject to final confirmation from Durham University. ","aboutCourse":"Our School Direct programme is accredited by Durham University.  \r\n\r\nThe duration of the course is one academic year and comprises two placements.  You will complete one longer placement at your host school, with a second, shorter placement in another school, in the middle.\r\n\r\nDuring each school placement you will be supported by a subject mentor who will support you in developing your practice day to day.  You will undertake a range of lesson observations, observing excellent classroom practice, and will further-develop the skills needed to plan and deliver effective learning sequences for students in your subject area.\r\n\r\nAlongside your in-school training you will benefit from approximately 60 days of training delivered by Durham University, allowing you to take advantage of the university’s academic and research expertise.  This training is organised as three modules, providing an opportunity to explore issues relating to teaching and learning through lectures and seminar groups:\r\n\r\n* Research-Related Professional Practice - These sessions explore classroom-based issues and examine techniques for making each subject accessible and stimulating in a classroom environment.  This module is further-supported by the university's innovative Professional Opportunities for Development (POD) programme, which enables trainees to participate in training led and delivered by Sedgefield Community College, working in partnership with other local secondary schools.  This provides an invaluable opportunity for trainees to see first-hand how educational theory is applied in practice in a range of real-school contexts. \r\n* Teaching and Learning in the Curriculum - This module draws on the international research expertise within Durham University's School of Education.\r\n* Self-directed Study - This module is orientated towards your subject specialism and draws on your experience from school visits and small-scale action research.\r\n\r\nTraining and support provided by our partner schools and Durham University offer subject-specific training in the following areas:\r\n\r\n* Subject pedagogy - including how to motivate students, questioning strategies, and planning lessons to maximise student engagement and progress.\r\n* Curriculum sequencing - to develop an understanding of how sequences of lessons can help maximise pupil progress over time.\r\n* Subject knowledge - addressing your own understanding of the key concepts and skills underpinning the subject.\r\n\r\nSuccessful completion of the programme leads to the award of qualified teacher status (QTS) and Postgraduate Certificate in Education (PGCE), with 90 credits.  \r\n\r\nApplications will remain open until 30th June 2022, where places remain available.\r\n","interviewProcess":"Candidates invited to attend an interview will receive an email with full details of how the interview process will work.  In the event of continuing COVID restrictions, interviews will be held online via MS Teams.  The format of the interview is outlined below.\r\n\r\n* You will be asked to prepare a short presentation in advance of interview entitled ‘the area of my subject specialism which most interests and excites me’ and will present this on the day to members of the interview panel.\r\n*You will complete a short written task on the day, designed to highlight your logical thinking and organisation.\r\n* A formal interview will take place, providing an opportunity to demonstrate your knowledge and understanding of the teaching profession and contemporary issues in teaching, as well as your desire of becoming a secondary school teacher.\r\n\r\nAny offers made by Think North East are conditional on:\r\n\r\n* a DBS check and satisfactory checks to cover any time spent overseas;\r\n* a satisfactory medical report, meeting the standards for 'Fitness to Teach'.\r\n* provision of original documentary evidence of degree and GCSE qualifications (or equivalents).\r\n\r\nIn some cases, it may be necessary for you to complete a subject knowledge enhancement course (SKE) before your training begins, this can be discussed at interview.\r\n","howSchoolPlacementsWork":"You will be placed in schools for most of your course, totaling a minimum of 120 days across the three school terms.  The responsibility for training is shared between our schools and Durham University, providing a supportive professional environment in which you can develop your knowledge, skills, understanding and expertise.\r\n\r\nOur School Direct partnership is led by Sedgefield Community College, working alongside Academy 360, Durham Johnston Comprehensive School, Excelsior Academy and Wellfield School.  Where other training providers may see you placed in schools located far and wide, we are able to work with you to help ensure you are placed in a school that allows you to carry out your other commitments when training.\r\n\r\nAcross the training year, you will complete two placements.  The main Attachment Placement begins towards the start of the academic year and is the main placement school in which a trainee will spend most of their time during the year.\r\n\r\nA shorter Intensive Practice Placement takes place in a different school and aims to consolidate understanding of how research and evidence should shape practice.  Following this placement, trainees return to their original Attachment Placement where they can apply their improved skills and knowledge to their teaching practice.\r\n\r\nAt each placement school you will be supported by a Professional Tutor who oversees all aspects of Initial Teacher Training at the school, as well as subject mentor who will support you in developing your teaching practice on a day to day basis.","personalQualities":"During the recruitment process, we will be evaluating your potential to become an effective teacher.  Our preferred applicants will have the following qualities:\r\n\r\n* a desire to teach and work with young people from all backgrounds\r\n* effective communication skills and a collegiate approach\r\n* a passion for their subject and strong subject knowledge\r\n* a commitment to teaching and the determination to succeed\r\n* consistently high standards of personal and professional conduct, upholding the public trust in the profession","otherRequirements":"All successful applicants will be subject to safeguarding checks, which include an enhanced DBS check.\r\n\r\nAdmission to the course is subject to a satisfactory medical report, as you are required to meet the standards for 'Fitness to Teach'.  ","status":1,"createdAt":"2021-07-06T10:49:53.693Z","updatedAt":"2021-10-04T15:46:14.194Z","canSponsorStudentVisa":"yes","cycle":"2024","applicationsOpenDateOther":"2021-10-20T00:00:00.000Z"}
