{"id":"ac32dfa8-9b07-4942-9d9f-6cc338792b83","name":"Social sciences","code":"X785","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"P","ageRange":"14_to_19","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"bd9a2174-f682-4f18-9551-498c2f7a48f9","code":"14","name":"Social sciences"}],"locations":[{"id":"624dcaff-e287-4dc3-a4d9-96bd48180ef1","name":"The De Montfort School","isPublished":"Y","status":"R"},{"id":"a6604ca9-93e3-4f6b-8dd0-6ca7c3bb9089","name":"Haybridge High School -Main Site","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"0ab5238e-606a-4f42-9aea-90d321ad7dc8","code":"2B3","name":"Haybridge Alliance SCITT"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"TwoYears","feesUK":11250,"feesInternational":11250,"feeDetails":"Tuition fees are £11,250 (£5,625 per year) \r\nYou can apply for a loan to cover these fees and/or a means tested maintenance grant via the Student Loan Company. \r\nThere are a range of bursaries and scholarships available and their value by phase, subject and degree classification can be found by visiting the Department of Education website:-\r\nhttps://getintoteaching.education.gov.uk/bursaries-and-funding  ","aboutCourse":"Social Sciences is an exciting and varied subject area that might include teaching a combination of the following:\r\nSociology: Sociology involves the study of society and the influences it has in shaping us as individuals. \r\nPsychology: The scientific study of the mind and behaviour.  \r\nHealth and Social Care: The study of health and well-being that supports students in understanding how physical, intellectual, emotional and social development can influence an individual’s health.\r\nCriminology: The study of criminal behaviour on an individual and social level, how it can be managed and potentially prevented.\r\nPersonal, Social, Health and Economic Education (PHSE): Focuses on developing the knowledge, skills and attributes to keep children and young people healthy and safe and to prepare them for life and work.\r\nApplicants will gain experience of teaching throughout the Key Stages and will need to be able to deliver lessons that are relevant and engaging. \r\n\r\nTrainees will also benefit from Professional Studies and Subject Pedagogy sessions that are led by a Subject Specialist.  It is your responsibility to secure the required fundamental English and Mathematics skills and we will support you in this process to ensure you can demonstrate competence in the required fundamental English and Mathematics to gain QTS.","interviewProcess":"During the day, we assess different skills via various tasks.  Skills assessed through individual tasks:\r\n\r\nTime management and organisation\r\nInteraction with students\r\nSubject Knowledge\r\nResilience and flexibility\r\nArticulacy\r\nCore Skills\r\n\r\nSkills graded 1, 2, 3 or 4 with 1 being the highest.  Scores examined as part of the decision process and used to identify areas where candidates offered a place may need additional support.\r\n\r\nFormal interview with SCITT Director/Assistant Director\r\nTo evaluate applicants' rationale for wanting to become a teacher and suitability to carry out the role.\r\nSkills being assessed: resilience/flexibility/articulacy/core skills.\r\n\r\nTeaching Activity\r\nApplicants to prepare and deliver 30 minute activity on a specific topic with a group of students.  This activity will evaluate applicants' ability to facilitate students' interaction with them and each other.\r\nSkills being assessed: time management/organisation/interaction with students/subject knowledge/resilience/flexibility/articulacy/core skills\r\n\r\nSubject knowledge interview\r\nFocuses on applicants' subject knowledge together with ability to engage and inspire.\r\nSkills being assessed: subject knowledge/articulacy\r\n\r\nPresentation \r\nTo undertake a ten minute presentation with a member of staff on the  subject of “What makes an outstanding Teacher?”\r\nSkills being assessed: time management/organisation/articulacy/core skills.\r\n\r\nWritten Task\r\nTo assess applicants' literacy skills and ability to process, synthesise and evaluate information.\r\nSkills being assessed: time management/articulacy/core skills.\r\n\r\nMathematics Task \r\nTo assess applicants’ numeracy skills and ability to process, synthesise and evaluate information.\r\nSkills being assessed: time management/organisation/core skills\r\n","howSchoolPlacementsWork":"You will undertake a placement close to where you live during the Autumn and Summer terms in one of our partner schools.  \r\nYour second placement close to where you live will take place in the Spring term and will be in a contrasting school to your first placement.  You will gain experience of working with a range of young people with differing backgrounds, abilities and needs. You will have a professional mentor as well as a school mentor in each placement school.\r\n\r\nMost subjects involve teaching across the 14-19 age range and trainees will gain experience of teaching across Key Stage 4 and 5.  Other experiences include a three-day placement in a primary school and one-day placements in a special school, a school deemed to require improvement and a school that offers alternative provision.  Trainees will also gain experience of working with young people for whom English is an additional language.\r\n","personalQualities":"The SCITT Training Programme focuses on developing teaching skills. You should have a strong understanding of the subject you wish to teach before you start training and have clear potential to become a teacher.  High levels of resilience and self discipline are of paramount importance for successful completion of the programme.  If your degree subject does not link closely to your chosen teaching subject, you may be required to undertake a Subject Knowledge Enhancement (SKE) course before you begin your training year.\r\n","otherRequirements":"International\r\nIf you studied outside of the UK, you should visit the National Academic Recognition Centre (NARIC) website to find out whether your qualifications are of an equivalent level to UK GCSEs, A levels and an undergraduate degree.  You will also need to obtain a Certificate of Good Conduct from the country or countries that they have lived in for the past five years in order to satisfy the DBS checks.","status":1,"createdAt":"2021-07-06T10:50:56.209Z","updatedAt":"2021-09-21T11:53:36.873Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
