{"id":"d37bc1e2-0821-4e73-bb50-a37b33c91ac3","name":"Mathematics Part Time","code":"3DXS","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"P","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"72345aa7-096c-488f-8649-085b8178cadb","code":"G1","name":"Mathematics"}],"locations":[{"id":"a6604ca9-93e3-4f6b-8dd0-6ca7c3bb9089","name":"Haybridge High School -Main Site","isPublished":"Y","status":"R","vacancies":"P"},{"id":"624dcaff-e287-4dc3-a4d9-96bd48180ef1","name":"The De Montfort School","isPublished":"Y","status":"R","vacancies":"P"},{"id":"4b20ccde-49e4-43d5-b409-c7c674adeb59","name":"Holy Trinity School","isPublished":"N","status":"S","vacancies":"P"},{"id":"79837621-b4a4-40d7-9fb6-252e9681cb4b","name":"Kinver High School and Sixth Form","isPublished":"Y","status":"R","vacancies":"P"},{"id":"a5bb9cec-7f6f-4b78-a4a9-e0dcad2b31ab","name":"Lady Hawkins School","isPublished":"N","status":"S","vacancies":"P"},{"id":"0b336b44-1b0c-4942-b04c-dbae6e9992d1","name":"Moseley Park School","isPublished":"Y","status":"R","vacancies":"P"},{"id":"9b4cf593-e96b-48d5-b2d8-3fe4250a2f4f","name":"The Wordsley School","isPublished":"Y","status":"R","vacancies":"P"},{"id":"39c7723d-e0e4-407b-90c7-f8c806b6647a","name":"Dyson Perrins School","isPublished":"Y","status":"R","vacancies":"P"},{"id":"a919ba47-3bc1-4380-a924-c657928d8bc2","name":"Hagley Catholic High School","isPublished":"Y","status":"R","vacancies":"P"},{"id":"f57c1ab2-0000-4b35-a8d3-1bc2cdb926c2","name":"Ormiston Forge","isPublished":"Y","status":"R","vacancies":"P"},{"id":"077bce64-7587-4afe-a4e1-49141ca1b85a","name":"Ellowes Hall School","isPublished":"Y","status":"R","vacancies":"P"},{"id":"619475ae-468d-470e-bc81-18e3da3af6a5","name":"Kingswinford Academy","isPublished":"Y","status":"R","vacancies":"P"},{"id":"5d483e1d-6836-450f-b2a6-506502efda6a","name":"Telford Priory School","isPublished":"Y","status":"R","vacancies":"P"},{"id":"7852ce54-34ef-463a-b4d1-e33c6a89b4e6","name":"King Charles 1 School","isPublished":"Y","status":"R","vacancies":"P"},{"id":"c538271a-ca97-4ae0-bf2b-0eae9a03a23a","name":"The Pedmore High School","isPublished":"Y","status":"R","vacancies":"P"},{"id":"301f8b92-8fc0-47ab-b86c-b54d4aca8e2b","name":"Summerhill","isPublished":"Y","status":"R","vacancies":"P"},{"id":"fd350470-a7ce-47d5-ba0b-7c1806f48bdb","name":"Windsor High School","isPublished":"Y","status":"R","vacancies":"P"},{"id":"da9fb492-ec99-4af7-ad52-9cfb97ae8a5f","name":"Ormiston SWB Academy","isPublished":"Y","status":"R","vacancies":"P"},{"id":"0df309d0-577e-4710-84f5-cf2fc6324fe5","name":"Wolverley School","isPublished":"Y","status":"R","vacancies":"P"}],"trainingProvider":{"id":"0ab5238e-606a-4f42-9aea-90d321ad7dc8","code":"2B3","name":"Haybridge Alliance SCITT"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"TwoYears","feesUK":11250,"feesInternational":11250,"feeDetails":"Tuition fees are £11,250 (£5,625 each year)  \r\nYou can apply for a loan to cover these fees and/or a means tested maintenance grant via the Student Loan Company. \r\nThere are a range of bursaries and scholarships available and their value by phase, subject and degree classification can be found by visiting the Department of Education website:-\r\nhttps://getintoteaching.education.gov.uk/bursaries-and-funding  \r\n","aboutCourse":"Secondary Maths  Part Time(Age Range 11 – 16)\r\nMathematics teachers have the essential role of providing students with the numeracy skills they need for life, giving them access to science, technology and engineering by teaching the language of these subjects, and fostering a love of a subject that is the amalgamation of millennia of human thought about how the world works.\r\nTrainee mathematics teachers will teach a wide range of students, covering everything from addition and subtraction through to solving high-order equations or geometric problems of great complexity. You will need a love of mathematics, a keen desire to delve deeply into even the simplest of methods, and the determination to find ways of communicating mathematics to students of all ages and ability. During the course you will regularly reflect on your practice and your own subject knowledge, beginning a journey of learning about mathematics education that will continue your whole career.\r\n\r\nThis course will allow you to achieve Qualified Teacher Status (QTS) and a Post Graduate Certificate in Education (PGCE) qualification at the end of a two-year period.\r\n\r\nYou will be expected to work 3 days a week, which will comprise of days in school, professional study sessions and self-directed study time.  You will spend a minimum of 140 days in school over the 2 years.\r\n\r\nMondays are mandatory and will be mainly professional study days whilst there is some flexibility with the other 2 days.\r\nHaybridge SCITT will recommend QTS and Birmingham City University will award PGCE upon successful completion of 3 assignments taken over the two years.\r\n\r\nThis flexible approach means you can fit training to become a qualified teacher around other commitments, offering a more gradual introduction into the profession.   You will still be working towards the teacher standards and will gain QTS and PGCE at the end of the training period.\r\n\r\nTrainees will also benefit from Professional Studies and Subject Pedagogy sessions that are led by a Subject Specialist.  It is your responsibility to secure the required fundamental English and Mathematics skills and we will support you in this process to ensure you can demonstrate competence in the required fundamental English and Mathematics to gain QTS.\r\n\r\n\r\n","interviewProcess":"During the day, we assess different skills via various tasks.  Skills assessed through individual tasks:\r\n\r\nTime management and organisation\r\nInteraction with students\r\nSubject Knowledge\r\nResilience and flexibility\r\nArticulacy\r\nCore Skills\r\n\r\nSkills graded 1, 2, 3 or 4 with 1 being the highest.  Scores examined as part of the decision process and used to identify areas where candidates offered a place may need additional support.\r\n\r\nFormal interview with SCITT Director/Assistant Director\r\nTo evaluate applicants' rationale for wanting to become a teacher and suitability to carry out the role.\r\nSkills being assessed: resilience/flexibility/articulacy/core skills.\r\n\r\nTeaching Activity\r\nApplicants to prepare and deliver 30 minute activity on a specific topic with a group of students.  This activity will evaluate applicants' ability to facilitate students' interaction with them and each other.\r\nSkills being assessed: time management/organisation/interaction with students/subject knowledge/resilience/flexibility/articulacy/core skills\r\n\r\nSubject knowledge interview\r\nFocuses on applicants' subject knowledge together with ability to engage and inspire.\r\nSkills being assessed: subject knowledge/articulacy\r\n\r\nPresentation \r\nTo undertake a ten minute presentation with a member of staff on the subject of “What makes an outstanding Teacher?”\r\nSkills being assessed: time management/organisation/articulacy/core skills.\r\n\r\nWritten Task\r\nTo assess applicants' literacy skills and ability to process, synthesise and evaluate information.\r\nSkills being assessed: time management/articulacy/core skills.\r\n\r\nMathematics Task \r\nTo assess applicants’ numeracy skills and ability to process, synthesise and evaluate information.\r\nSkills being assessed: time management/organisation/core skills\r\n","howSchoolPlacementsWork":"You will undertake a placement close to where you live during the Autumn and Summer terms in one of our partner schools.  \r\n\r\nYour second placement close to where you live will take place in the Spring term and will be in a contrasting school to your first placement.  You will gain experience of working with a range of young people with differing backgrounds, abilities and needs. \r\n\r\nYou will have a professional mentor as well as a school mentor in each placement school.\r\n\r\nMost subjects involve teaching across the 11-16 age range and trainees will gain experience of teaching across Key Stage 3, 4 and 5.  Other experiences include a three-day placement in a primary school and one-day placements in a special school, a school deemed to require improvement and a school that offers alternative provision.  Trainees will also gain experience of working with young people for whom English is an additional language.\r\n\r\n","personalQualities":"\r\nThe SCITT Training Programme focuses on developing teaching skills. You should have a strong understanding of the subject you wish to teach before you start training and have clear potential to become a teacher.  High levels of resilience and self discipline are of paramount importance for successful completion of the programme.  If your degree subject does not link closely to your chosen teaching subject, you may be required to undertake a Subject Knowledge Enhancement (SKE) course before you begin your training year.\r\n\r\n","otherRequirements":"\r\nInternational\r\nIf you studied outside of the UK, you should visit the National Academic Recognition Centre (NARIC) website to find out whether your qualifications are of an equivalent level to UK GCSEs, A levels and an undergraduate degree.  You will also need to obtain a Certificate of Good Conduct from the country or countries that they have lived in for the past five years in order to satisfy the DBS checks.\r\n\r\n","status":1,"createdAt":"2021-07-06T10:50:54.411Z","updatedAt":"2021-09-21T11:25:48.057Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
