{"id":"4632ee10-0f0c-46aa-983b-914e301ada5b","name":"Primary","code":"2L28","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"58c318fd-bd76-464a-aa8e-db62555fd540","name":"Church Langton CE Primary School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"41d8835a-6727-4c7c-bb0e-23e8149bb539","code":"237","name":"Learn-AT School Direct"},"accreditedBody":{"id":"3e6c62a3-5d34-4a91-9c23-01c7409fd909","code":"L34","name":"University of Leicester"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"financialSupport":"For any trainees having to travel more than 25 miles* to their placement school we offer a travel bursary of £100 per placement.\r\n\r\n*We try to avoid trainees having to travel further than this where possible, although it may be necessary for their developmental training needs.\r\n","aboutCourse":"We offer a School Direct route into teacher training. This means part of your training will be school based and part of it will be University based.\r\n\r\nAll of our successful trainees will achieve a PGCE from the University of Leicester, 90 Masters Credits and QTS (Qualified Teacher Status).\r\n\r\nThe course is full time from the end of August until the following July. You will either be working in our schools or at the University of Leicester for academic study.\r\n\r\nYou will be assessed on written assignments and practical  teaching in schools. You will have a University tutor and school based tutor for support, as well as lecturers, school based mentors and personal tutors. \r\n\r\nLearn-AT School Direct is based at Church Langton CE Primary School who operates as the Lead School for the group of schools we work with. We organise your teaching placements for you and manage your time in school. Our experienced teachers will be delivering Maths and English training for you. We offer specialist workshops in subjects like RE, Music and Art. \r\n\r\nWe usually recruit around 10 trainees meaning we can really get to know our cohort each year. Many candidates are attracted to our course because of its personal and friendly nature.  \r\n\r\nOur candidates get to be part of our small, supportive group whilst having the benefits of being able to interact with their fellow PGCE trainees from other courses whilst at the University.\r\n\r\n\r\n\r\n","interviewProcess":"Our interview process is designed to provide candidates with different opportunities to display their passion for teaching.\r\n\r\nActivities include includes preparing a task for a small group of children based on a picture book of your choice, a formal interview and online English & Maths assessments.\r\n\r\nWe are hopeful that you will be able to come into school for your interviews this year. You will be able to meet staff and children, have a tour of the school and see a school day in action. However we are fully equipped to conduct interviews virtual if needed.\r\n\r\nAny questions please email schooldirect@clp.learnat.uk","howSchoolPlacementsWork":"We are very luck to work with 20 schools who are dedicated to teacher training:\r\n\r\n(https://www.teachingschool.learnat.uk/page/?title=Our+Schools&pid=32)\r\n\r\nAs part of our School Direct course you will be placed in 3 different schools of contrasting size, location and setting. \r\nWe currently offer placements in KS1 (age 5-7) Lower KS2 (age 7-9) and Upper KS2 (age 9-11) but also have many fantastic Reception class teachers (children age 4-5) who are keen to work with our students. \r\n\r\nWe will liaise with you to offer you the best range of placements to suit your needs and experiences. As the Lead School, we organise all of your placements with you in mind.\r\n\r\nAll of our students get to spend the start of term with us at Church Langton, seeing how the beginning of the year unfolds for children and staff. \r\n\r\nYou will then have a short 2 week Preliminary placement linked to your first main placement in October, lasting 6 weeks.\r\n\r\nYour second main placement is in the Spring term lasting 6 weeks followed by a final placement in the Summer term lasting 8 weeks. Each of the three main placements will be in different schools and in a different age group.\r\n\r\n","personalQualities":"We are looking for passionate, enthusiastic applicants who want to make a difference in children's lives.\r\n\r\nWe want candidates who show a real commitment to want to shape and support the development of young children. We want people who acknowledge the huge impact teachers can have in children's lives. \r\n\r\nWe are looking for people who will gain  real reward and job satisfaction from helping children flourish in every way.","otherRequirements":"We hope our candidates have spent some time in school before applying so that we feel they are making an informed career choice. This is desirable rather than essential.\r\n\r\nSuccessful applicants will require a full DBS check.","status":1,"createdAt":"2021-07-06T10:55:40.209Z","updatedAt":"2021-10-04T10:18:14.676Z","canSponsorStudentVisa":"yes","cycle":"2024"}
