{"id":"d7f0f4c3-a554-483b-b27a-33740536e297","name":"Religious Education","code":"2W4H","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"724b5d16-28dd-4431-bc17-ea4be4daedc4","code":"V6","name":"Religious education"}],"locations":[{"id":"caba348e-9966-45cc-8ba3-807c8ea5e5c0","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"a4e84530-e1f1-47c6-b57e-ec693d629637","code":"P63","name":"Plymouth Marjon University"},"profPost":"PG","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"Applicants must have a degree in the subject they wish to train to teach or a degree that’s related to the subject or an unrelated degree but relevant professional knowledge in the subject'","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":12000,"feeDetails":"EU  fees for 2021/22 are £12,000","aboutCourse":"The PGCE Secondary Course focuses clearly on student teachers' and individual needs. A subject knowledge audit at interview leads to the setting of individualised pre-course tasks. Student teachers are able therefore to work towards targets before the course starts. This profiling and tracking of student teachers' individual needs continues throughout the training programme in both University and Schools. This has been praised by the 2014 Ofsted inspection as a strength of the Partnership 'the quality of the assessment arrangements and how well the training is matched to individual trainees' developmental needs, ensuring that trainees make progress against challenging individual expectations'. A key strength of the Partnership is 'how well the partnership prepares trainees to make them employable, leading to all securing, and remaining in, teaching posts' Ofsted 2014 \r\n\r\nThe PGCE Secondary Course at the Plymouth Marjon University is for those who meet our Partnership expectations of: The University of St Mark & St John Teacher Education Partnership develops highly reflective and professional teachers and expects that: All trainees will achieve good or outstanding outcomes; all trainees will have enhanced employability skills; all stakeholders will engage in high quality support and training to meet the individual needs of all trainees; and all stakeholders will understand their responsibility to impact upon pupil progress. \r\n\r\nThroughout the course you study 5 modules, 4 that build Masters credits and one that recognises qualified teacher status, each are applied in nature and assessed in a variety of different ways  Learning Behaviours in Context (essay);  Becoming a Teacher: a reflective journey (Journal & presentation);Understanding the Learner: Assessment and progress (presentation); Inclusion in the Secondary Classroom: Maximising Achievement  (portfolio); Professional Practice in Schools (QTS portfolio).\r\n","interviewProcess":"Plymouth Marjon University works in partnership with schools to recruit teachers with a passion for seeing your people grow and develop into confident young adults. The recruitment process short lists applications , if you are invited for interview you will receive full details of what will be expected of you and a link to the website for the agenda and interview tasks. The Interview process  includes a subject specific presentation, learning plan activity, campus tour and formal interview. You will be asked to prepare for the interview in advance, come prepared to talk about your passion for your subject and experiences you have had through study, work, volunteering or other activities that have built skills and attributes that you might be able to apply to a career in teaching.  \r\n\r\nTo prepare research  key issues and developments in secondary schools - especially those in your subject area. It will help you to read the educational press and to talk to teachers and those currently undertaking teacher training. The interview process will explore knowledge and understanding of the role of a teacher in order to ensure that applicants have a real feel for what teaching life is like in a secondary school, and whether it is the right career for them. \r\n \r\nJudgements 4 criteria for the interview a) Appropriate qualities, attitudes, ethics & values;  b) Subject Knowledge and Understanding; c) Intellectual & Academic Capabilities; d) Suitability for the course\r\n","howSchoolPlacementsWork":"If you are successful in being offered a place with us, you will be based in two complementary schools across the year, but also working virtually with them in our increasingly digital age. The Partnership works across 6 counties, in the SW and London and includes a number of Co-operative Trusts, free schools, Academies, Federations and Alliances.\r\n\r\nFor school-based training, we place you in schools decided by an audit of need and experience, to best meet your training needs from the range of partner schools wishing to train in your subject.  The aim is to expose you to different policies, practices and values of schools which will prepare to you gain employment in a range of different types of school. In addition to your specialist subject trainees have the opportunity to gain an enhancement in a second subject or other area e.g. SEND or PSHE.\r\n \r\nThroughout placements you will be supported by a trained mentor to develop to your knowledge, skills, understanding and competence. Your progress will be assessed using an electronic document that allows mentor and trainees to track their progress and training and to set realistic and achievable targets throughout their training year. It is used at key review points during mentor meetings and allows trainees to focus on their progress linked clearly to the Curriculum. It is a formative document that allows both the trainee and mentor to track training and progress towards the award of QTS. \r\n\r\nThe mentoring model used by Marjon recognises as need for flexibility in approach. Mentors are aware that each trainee progresses at different speeds, so critical element to our model is the mentor’s ability to provide the appropriate support to address the trainee’s competence and confidence levels at a point in time. You become more autonomous as you progress and are empowered to take responsibility for your own learning. Trainees are more likely to reach their full potential on courses that encourage them to develop as independent learners and the best teaching supports this process.\r\nAll placements are flexible and adapt according to Department for Education guidance.\r\n","personalQualities":"\r\n* Personal Qualities of Confidence/enthusiasm/sensitivity/ maturity/potential to be a positive role model\r\n* Resilience through Commitment/perseverance/versatility/tenacity/stamina\r\n* The desire to work collaboratively with Teacher Education Partnership \r\n* The willingness to listen to and respond to feedback from Teacher Education Partnership \r\n* The ability to demonstrate a culture of high expectations for themselves and their pupils.\r\n* The desire to strive to plan, teach and assess in ways that enable pupils to make good or better progress in their lessons \r\n","otherRequirements":"\r\nPrior experience in a school is not required. However, where candidates have been able to gain experience in schools, providers might find reports from those schools helpful. \r\nA satisfactory DBS (Disclosure and Barring Service check).\r\nWe have a responsibility to ensure that trainees have the health and physical capacity to train to teach and will not put children and young people at risk of harm . Candidates must Meet the Secretary of State’s requirements for physical and mental fitness to teach by completing an on-line medical questionnaire.\r\n","status":1,"createdAt":"2021-07-06T10:57:01.172Z","updatedAt":"2021-09-01T10:38:08.060Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
