{"id":"7e4b7d8a-a9c0-45ac-b78a-a1eaf6d48eba","name":"Drama","code":"C633","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"TA","fundingType":"apprenticeship","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"69052223-ca45-4781-a8d3-cb92447a6d78","code":"13","name":"Drama"}],"locations":[{"id":"e90325b3-7e47-4166-a679-a3cbfec41ea0","name":"Academies Enterprise Trust:  Wishmore Cross Academy","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"fed1c2cd-b95f-4b75-9c3b-e9ad3b9f756f","code":"2CH","name":"Academies Enterprise Trust: London"},"accreditedBody":{"id":"252d7e03-741e-4453-b6a8-3d361e6c9d1b","code":"E69","name":"e-Qualitas"},"english":"3","maths":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"TwoYears","aboutCourse":"Based in and employed by a secondary school, apprentices will spend much of their time in class, teaching their specialist subject to the 11-16 age range and working with other teachers. They will draw on eQualitas' distance learning resources for independent study, and attend some training days in central London. \r\n\r\nApprentices have a visiting tutor from eQualitas, who spend a day in school each half term to observe them teaching, provide some training, review their developing evidence and assess their progress so that helpful targets are set for the apprentice's next steps. Assessment for QTS takes place towards the end of the training programme and QTS is awarded (if the Teachers' Standards are met). \r\n\r\nAfter 12 months, the apprentice has to pass the end-point assessment which checks whether he or she is maintaining and further developing what was attained in the QTS assessment.","interviewProcess":"Candidates whose application form shows that they meet our short-listing criteria will be invited to an Interview Day. \r\n\r\nThe selection process will usually involve: \r\n\r\n*A classroom-based task \r\n*Time with staff/departments \r\n*A formal interview \r\n*A written task \r\n\r\nWe recommend that you aim to gain some experience in a classroom prior to interview.  You will need to also pass a Skills Test for numeracy and literacy prior to commencing your placement.\r\n","howSchoolPlacementsWork":"You will spend the majority of time in your main placement school but will also be required to carry out a 2nd placement at another school or education setting which is usually for a period of 6 weeks.  \r\n\r\nYour 2nd placement will provide you with an excellent opportunity to compare and contrast different approaches to all aspects of teaching.\r\n","personalQualities":"","otherRequirements":"We are committed to safeguarding and protecting the welfare of children and expect all staff, trainees and volunteers to share this commitment.  A Disclosure and Barring Service Certificate will be required for this placement. This placement will be subject to enhanced checks as part of our Prevent Duty.","status":2,"createdAt":"2021-07-06T10:46:59.606Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024"}
