{"id":"d5621530-6d1b-4317-82f7-da12df972b03","name":"Primary","code":"X100","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"84aebbe0-83f0-49d5-81ea-102a81778837","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"db2188d3-0047-44ee-92d2-64d1b5e1a939","code":"N21","name":"University of Newcastle Upon Tyne"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feeDetails":"Please check Newcastle University's website for details of fees and funding. https://www.ncl.ac.uk/\r\n\r\n","financialSupport":"Please check Newcastle University's website for details of fees and funding. https://www.ncl.ac.uk/\r\n","aboutCourse":"The Newcastle Primary PGCE course allows you to gain Qualified Teacher Status (QTS) and 60 credits towards a Master’s degree. This is an M level course with a duration of approximately 10 months full time.  \r\n\r\nThroughout our course, you will not only acquire a wide repertoire of teaching strategies, but you will also develop the skills, understanding and attitudes necessary to critically enquire into education, learning and teaching. In your development as a trainee teacher, you will become a researcher who is able to unite theory and practice, and who understands classroom practice within the wider socio-cultural, political and moral contexts of education. Our trainee teachers develop as thinking and transformative professionals and as confident communicators who can look forward to contributing positively to the teaching profession.\r\n\r\nCentral to the course is a consideration of the educational needs of children in relation to their intellectual, physical, cultural and social development. We also offer our trainees a number of innovative and highly regarded pedagogical approaches as part of the programme, for example Philosophy for Children. The development of an understanding of the diversity of pupils' needs, social justice and ways in which education can maximise equity for all pupils are key elements of the course and provision for pupils with English as an Additional Language (EAL) is rated very highly by our students. Our trainee teachers have the opportunity to work towards the prestigious IEDP award, accredited by the Institute for Equality and Diversity www.iedp.org.uk/accreditation.  \r\n\r\nWe work in close partnership with schools in Tyneside, Durham and Northumberland and you will spend approximately 120 days of your course, typically in three different schools. This will give you a wide breadth of experience, which you will be able to share, reflect on and discuss with tutors and other trainees. We pride ourselves on the personal support given to our trainee teachers throughout the course. \r\n \r\nOur trainee teachers achieve excellent results and rate our course very highly. By the end of the programme, most trainees demonstrate a high level of achievement, with the potential to be Outstanding. The majority of our trainee teachers secure employment, often within a school where they have trained.","interviewProcess":"Under Department for Education regulations, the University is unable to offer places on its PGCE courses without a selection process that includes a personal interview. The selection day consists of:\r\n\r\n* a small amount of teaching;\r\n* a written task;\r\n* a mathematics task;\r\n* an individual interview.\r\n\r\nIn common with all initial teacher training providers, by the end of the course, you will need to show competency in both numeracy and literacy in line with the DfE guidance. A baseline assessment of your literacy and numeracy skills will be conducted as part of the selection process. This will be used to inform us of your particular strengths and areas for development that you will need to address during the PGCE.\r\n\r\nClassroom experience is advantageous so, where possible, we recommend applicants spend time working and/or observing in a UK primary classroom in England, as experience will inform your application and any later performance in the selection process.\r\n\r\n","howSchoolPlacementsWork":"You will spend approximately 120 days of the PGCE year in a number of partnership schools. These placements include periods of teaching practice where school and university staff supervise progress towards Qualified Teacher Status. Time is also spent learning about Diversity and Equality issues and Special Educational Needs in schools. The close integration of school-based experience and university based sessions is a powerful feature of the course and is achieved through close and collegiate working between staff across the sectors. Trainees experience a balance of teaching across both Key Stages (KS) 1 and 2. Placements are organised centrally based on the placements offered by our partnership schools. A typical pattern of school experience is as follows:\r\n \r\n* Term 1 Trainees in school for approximately 8 weeks;\r\n* Term 2 Trainees in school for approximately 7 weeks;\r\n* Term 3 Trainees in school for approximately 9 weeks.\r\n\r\nJudgments about trainee teachers’ progress and performance in the Teachers’ Standards required for Qualified Teacher Status, are made over time. The quality of trainee teachers’ teaching will be judged through evidence of their impact on the learning and progress of pupils over time.\r\n\r\nDuring the programme, you will build bundles of evidence drawing upon:\r\n \r\n* Formal observations of your teaching;\r\n* Your school-based files, including planning and assessment data;\r\n* Weekly tutorial meetings with school-based mentors;\r\n*  Action Planning and Target Setting.\r\n \r\nSchool based training involves:\r\n \r\n* Observation of teaching and learning;\r\n* Teaching individual pupils, small groups of pupils and whole class teaching;\r\n* Specific school-based learning enquiries;\r\n* Weekly mentor meetings with school based tutors;\r\n* Regular observation and feedback by mentors.\r\n ","personalQualities":"Candidates should possess a genuine enthusiasm to teach primary-aged children and demonstrate a positive, proactive and professional approach to work. Candidates should have the ability to communicate effectively and engagingly.","otherRequirements":"On accepting the offer of a place, you must apply to the Disclosure & Barring Service ( DBS) for an enhanced disclosure and complete a declaration of health for entry to teacher training (further details will be provided by the university).","status":1,"createdAt":"2021-07-06T10:50:16.604Z","updatedAt":"2021-10-01T11:04:10.479Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
