{"id":"daaefdac-507f-48bc-a028-f5a4249af1a7","name":"Mathematics","code":"G1X1","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"72345aa7-096c-488f-8649-085b8178cadb","code":"G1","name":"Mathematics"}],"locations":[{"id":"84aebbe0-83f0-49d5-81ea-102a81778837","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"db2188d3-0047-44ee-92d2-64d1b5e1a939","code":"N21","name":"University of Newcastle Upon Tyne"},"profPost":"PG","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"At least 50% of your degree should be in the subject that you intend to teach. We may accept closely related degree subjects.","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feeDetails":"Please check with Newcastle University website for details of fees and other funding.\r\nhttps://www.ncl.ac.uk/\r\n\r\n","financialSupport":"Please check with Newcastle University website for details of fees and other funding.\r\nhttps://www.ncl.ac.uk/\r\n\r\n","aboutCourse":"The Secondary PGCE forms a practical and theoretical introduction to teaching, providing student teachers with the professional expertise, knowledge and understanding to teach secondary age children, including where possible at post-sixteen. The strong emphasis of the course is on learning from experience through reflection and enquiry. This process of reflective enquiry underpins the development of teaching skills and forms the basis for the written work submitted as part of the Masters Level element of the programme. An understanding of the relationship between practice and theory, underpins the PGCE. This provides a firm practical and theoretical foundation for the professional journey towards becoming an outstanding practitioner.\r\n\r\nWe offer the following Secondary PGCE subject courses, which are supported by our Professional Studies Programme:\r\n\r\n* English \r\n* Geography\r\n* Mathematics \r\n* French\r\n* French with German \r\n* French with Spanish \r\n* German with French \r\n* Spanish with French \r\n* (We may also be able to provide places for those wishing to study Mandarin with French, German or Spanish and Spanish with German)\r\n* Science with Biology Specialism \r\n* Science with Chemistry Specialism \r\n* Science with Physics Specialism\r\n\r\nYou will undertake 60 credits of Master's-Level credits over three course modules which are rooted in school while being rooted in classroom practice and aligned with research and theory. Each module assignment is worth 20 credits. They work to complement your school experiences - enhancing outcomes and your professional development.  \r\n\r\nYou will graduate with a recommendation for Qualified Teacher Status (QTS) if you meet the Teachers’ Standards through your practical engagement in school, which will include PGCE on successful completion of the module assignments. \r\n\r\nCOURSE METHODOLOGY \r\n \r\nThe course starts early September and continues until June. The course structure follows school term dates not university semesters. All school and university sessions, including individual and small group progress check interviews, some of which will take place in school holidays, are compulsory and full attendance is expected.\r\n\r\n* Subject days, to develop your understanding of your subject pedagogy.\r\n* Progress days, to develop your understanding of the research and theory underpinning pedagogy and the wider aspects of schools and education.\r\n* Conferences based on key aspects of Professional Practice.\r\n* 1:1 and small group tutorials.\r\n\r\nAssessment is a mixture of academic assignments for the modules and successful completion of your teaching practice placement, evidenced through a series of Reports and the completion of a Professional Portfolio and Evidence Log.\r\n","interviewProcess":"Under Department for Education regulations, the University is unable to offer places on its PGCE courses without a selection process that includes a personal interview. Based on your application form including references you may be offered an interview, which will be conducted by a subject specialist.\r\n\r\nThe selection procedure consists of:\r\n* A presentation by the interviewer outlining the course;\r\n* An opportunity to discuss the course and expectations;\r\n* An individual OR group presentation;\r\n* A written task, relevant to teaching;\r\n* A subject-related (GCSE/A-level) exam question or questions;\r\n* An individual interview.\r\n\r\nA baseline assessment of your literacy and numeracy skills will be conducted both as part of the selection process and pre-course, this will be used to inform us of your particular strengths, and areas for development that we will support you with during the PGCE. In common with ALL initial teacher training providers, by the end of the course, you will need to show competency in both numeracy and literacy in line with the DfE guidance.","howSchoolPlacementsWork":"You will spend at least two thirds of the PGCE on school placements. Placements include periods of observation in preparation for teaching practice. This allows school and university staff to supervise your progress towards Qualified Teacher Status, to guide you in the planning, preparation and reflection process of the programme and completion of your M Level assignments.\r\n\r\nNewcastle University has positive and long-standing relationships with partnership schools across the North East; currently we are working with approximately 80 schools. This helps us to provide you with a range of experiences across a range of contexts and where possible trainees will have two contrasting school placements. When planning for school placements the university endeavour to take your personal circumstances into consideration.\r\n","personalQualities":"Teaching can be an immensely enjoyable profession when students commit themselves whole-heartedly to the endeavour to become a great teacher. It takes effort and requires stamina and resilience with exemplary professionalism and personal commitment. You will need to be proactive and take advantage of opportunities offered and seek others. We are therefore looking for students who are prepared to offer this level of commitment, who are flexible, able to adapt quickly to changing and challenging circumstances and genuinely want to work with young people.","otherRequirements":"It is desirable for you to have spent time working and/or observing in a UK secondary classroom before applying. \r\nExperience is advantageous as it will inform your application and any later performance in the selection process.","status":1,"createdAt":"2021-07-06T10:50:16.326Z","updatedAt":"2021-10-01T10:59:11.197Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
