{"id":"4ac94657-1696-4b89-a1c9-3fc60dc8d00d","name":"Primary","code":"S641","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"TA","fundingType":"apprenticeship","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"164a3999-8c5a-4a5d-a72d-5d059d3f6eae","name":"Lowdham C of E Primary School","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"e5b44d52-86b8-4298-bf6e-1fa5bfd8a5a6","code":"1EC","name":"The Minster Learning Alliance"},"accreditedBody":{"id":"d2b7d074-fac9-42c5-a0d3-d5471b35f7d9","code":"N91","name":"Nottingham Trent University"},"profPost":"PG","english":"1","maths":"1","science":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","aboutCourse":"In this Apprenticeship position you will experience teaching Primary Education across age and ability ranges in a Primary phase school throughout an academic year. Your training will cover a range of curriculum areas with a focus on the key areas of numeracy and literacy.\r\n\r\nWe are looking for people who have the potential to become outstanding teachers and school leaders of the future. You should possess a genuine enthusiasm for education and be able to communicate your understanding to others. You should be committed to inclusive and comprehensive education and believe passionately in the difference education can make to young peoples’ lives. Experience of working with young people is not a requirement for entry on to the course, but would be an advantage.\r\n\r\nThe programme contains elements delivered by the school, the Minster Teaching School Alliance and Nottingham Trent University. The programme includes both academic training and assessment as well as extensive classroom practice. \r\n \r\nApprentices will split their time between school and university study. You’ll receive practical, school-led training alongside experienced staff, and spend at least 20% of your time off-timetable to learn the pedagogy of teaching.\r\n\r\nIn addition, there will also be regular opportunities to reflect and work with other trainees from across the Alliance through our School Direct programme.  This will include working with trainees from primary and secondary phase settings, as well as some specific sessions focusing on key areas of development for your specific course.\r\n\r\nYou will have a trained mentor assigned by the school and a University tutor who will work closely with you. From the beginning of the course, you will be regarded as a beginning teacher and will attend development and professional learning activities within your school. ","interviewProcess":"","howSchoolPlacementsWork":"Throughout your year you will mostly be based in your host school, where you will experience life as a full-time member of teaching staff. ","personalQualities":"We aim to develop the teachers and leaders of the future who will work together with us to inspire young people. We are looking for candidates who enjoy working with young people and who are passionate about learning.\r\n\r\nYour application should demonstrate that you possess:\r\n• A desire to teach and work with young people\r\n• Effective communication skills\r\n• A commitment to work hard on the course\r\n• Determination to succeed\r\n• A readiness to reflect and share ideas\r\n• A flexible approach to learning and teaching.\r\n\r\n","otherRequirements":"Disclosure and Barring Service (DBS) \r\nFor all initial teacher training courses, applicants must complete forms requesting an Enhanced Disclosure from the DBS. In addition you will be required to disclose previous offences.\r\n\r\nLiteracy and Numeracy Competence\r\nAll teachers are expected to be competent in Fundamental English and mathematics. By the end of ITT all trainees must be able to demonstrate competence in:\r\n•\tSpeaking and Listening\r\n•\tWriting\r\n•\tData and graphs\r\n•\tMathematical calculations\r\nYour competence in these areas will be assessed by your university at application and throughout the course.\r\n","status":2,"createdAt":"2021-07-06T10:52:54.508Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024"}
