{"id":"4be3cb08-9f18-40bb-9440-71a21e2f992c","name":"English","code":"3CP6","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3aed1aa8-ae46-4b68-92bb-a6cc20655c59","code":"Q3","name":"English"}],"locations":[{"id":"0b5f52d5-af9b-487c-87c5-445322a6fca9","name":"Quarrydale Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"28f6ba0c-f356-4795-91bd-9553b35cab85","name":"The Elizabethan Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"f412cde8-8069-427f-b78e-aeca77dd125a","name":"The National C of E Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"dbd4113d-2c33-41ed-a691-506ac344d304","name":"Carlton le Willows Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"430a2d97-3190-4aae-81fb-6eec44703ea4","name":"Main Site - The Minster School, Southwell","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"e5b44d52-86b8-4298-bf6e-1fa5bfd8a5a6","code":"1EC","name":"The Minster Learning Alliance"},"accreditedBody":{"id":"d2b7d074-fac9-42c5-a0d3-d5471b35f7d9","code":"N91","name":"Nottingham Trent University"},"profPost":"BO","degreeGrade":"1","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"In this School Direct Trainee position you will experience teaching English across age and ability ranges in a comprehensive secondary school throughout an academic year. \r\n\r\nWe are looking for people who have the potential to become outstanding teachers and school leaders of the future. You should possess a genuine enthusiasm for English and be able to communicate your understanding to others. You should be committed to inclusive and comprehensive education and believe passionately in the difference education can make to young peoples’ lives. Experience of working with young people is not a requirement for entry on to the course, but would be an advantage.\r\n\r\nOur School Direct programme contains elements delivered by the school, the Minster Learning Alliance and Nottingham Trent University. The programme includes both academic training and assessment as well as extensive classroom practice. \r\n \r\nThe school and university work closely together to ensure that your progress on the course is closely supported and quality assured.  You will be based in your host school throughout the year and attend university and Alliance based days with other School Direct trainees. These days are an opportunity to work with primary and secondary trainees and the sessions will form an integral part of the work you do in school. \r\n\r\nWhen applying, please select your first choice of host school from our available locations. We may also be able to offer you the option of a host school from our other locations, which will be discussed when offering an interview. \r\n\r\nIn the second term you will undertake a placement in a second school for a period of six weeks.  This is an opportunity to learn within a different context and share your experiences with other trainees.\r\n\r\nYou will have a trained mentor assigned by the school and a University tutor who will work closely with you. From the beginning of the course, you will be regarded as a beginning teacher and will attend development and professional learning activities within your school. \r\n\r\nFurther information about placements within our host schools is available in our School Direct placement profiles via our website: \r\n\r\n(https://www.minster.notts.sch.uk/teaching-school/initial-teacher-training)","interviewProcess":"Candidates who submit successful applications will attend an initial interview with Nottingham Trent University to assess their suitability for the course. \r\n\r\nFollowing a successful university interview, candidates will then be invited to attend an interview at their chosen host school. You may also be offered an opportunity to be interviewed by other host schools, should you wish to. This will involve up to a day at the school including a number of activities designed to assess your aptitude and potential, as well as  a chance to familiarise yourself with the school and programme:\r\n\r\n• a welcome and introduction to the school\r\n• a tour of the school\r\n• an observed 15-minute student activity, (details provided in advance)\r\n• a subject knowledge discussion and interview. \r\n \r\nThe criteria we will use at interview to decide whether or not we offer you a place on the course are:\r\n\r\n- enthusiasm for working with young people\r\n- a realistic and positive view of education and an awareness of current educational issues;\r\n- an ability to reflect upon your own practice, \r\n- clear reasons for wanting to teach at the level for which you have applied;\r\n- motivation and commitment to teaching pupils of all levels of ability;\r\n- an appropriate level of subject knowledge in your chosen subject for secondary applicants.\r\n\r\nWe will inform you of our decision as soon as possible after your interview. \r\n\r\nThis is a thorough process - we and you need to be sure that teaching is for you!","howSchoolPlacementsWork":"Throughout the year you will mostly be based in your host school, where you will experience life as a full-time member of teaching staff. \r\n\r\nYou will undertake a 6 week long second placement at another school in the Spring Term, which will offer you a contrasting experience. In addition, you will attend training at schools around Nottinghamshire and can experience teaching in a different phase, as well as special or hospital school experience, if desired.\r\n\r\nYou will be assigned a mentor in school who provide support throughout each week, including observations of you and other teachers to develop your teaching persona and strategies. As a member of staff at the school, you will attend meetings and training throughout the year to develop a rounded experience of life as a full time teacher. \r\n\r\nYour colleagues will form an integral part of your training experience, offering support and an insight into the collaborative aspect of teaching, and you will become a key part of a teaching team. School Direct trainees will also undertake wider experiences such as participating in day and residential visits and seasonal events at school.\r\n\r\nUltimately, a School Direct training programme with us will offer you the opportunity to learn and apply an academic understanding of education and teaching while experiencing a full year as a working teacher. Our trainees enjoy this approach and feel well-prepared for their future careers.\r\n\r\nTo find out more about this placement, please view our school profiles which are available on our website:\r\n\r\n(https://www.minster.notts.sch.uk/teaching-school/initial-teacher-training)\r\n","personalQualities":"We aim to develop the teachers and leaders of the future who will work together with us to inspire young people. We are looking for candidates who enjoy working with young people and who are passionate about learning.\r\n\r\nYour application should demonstrate that you possess:\r\n• A desire to teach and work with young people\r\n• Effective communication skills\r\n• A commitment to work hard on the course\r\n• Determination to succeed\r\n• A readiness to reflect and share ideas\r\n• A flexible approach to learning and teaching.\r\n\r\n","otherRequirements":"Disclosure and Barring Service (DBS) \r\nFor all initial teacher training courses, applicants must complete forms requesting an Enhanced Disclosure from the DBS. In addition you will be required to disclose previous offences.\r\n\r\nLiteracy and Numeracy Competence\r\nAll teachers are expected to be competent in Fundamental English and mathematics. By the end of ITT all trainees must be able to demonstrate competence in:\r\n•\tSpeaking and Listening\r\n•\tWriting\r\n•\tData and graphs\r\n•\tMathematical calculations\r\nYour competence in these areas will be assessed by your university at application and throughout the course.\r\n","status":1,"createdAt":"2021-07-06T10:52:53.931Z","updatedAt":"2021-09-29T15:51:31.115Z","canSponsorStudentVisa":"yes","cycle":"2024"}
