{"id":"5dff8ee7-7ee8-4d58-a93a-4b60c5d54dee","name":"Design and Technology","code":"AT10","qualification":"pgce_with_qts","startDate":"2022-09-01T09:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"24311bef-8673-41fb-933c-53f887fb6976","code":"W3","name":"Music"},{"id":"118fabd7-86d0-4a40-9e9a-e5c302abe59b","code":"DT","name":"Design and technology"}],"locations":[{"id":"81232f6a-0655-4141-b008-7dcaf8ed9310","name":"Ortu Hassenbrook","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"f412cde8-8069-427f-b78e-aeca77dd125a","name":"The National C of E Academy","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"28f6ba0c-f356-4795-91bd-9553b35cab85","name":"The Elizabethan Academy","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"dc975b77-b0a3-4a29-b170-dce93e02222d","name":"Ortu Gable Hall","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"430a2d97-3190-4aae-81fb-6eec44703ea4","name":"Main Site - The Minster School, Southwell","isPublished":"false","status":"suspended","vacancies":"full_time"},{"id":"0b5f52d5-af9b-487c-87c5-445322a6fca9","name":"Quarrydale Academy","isPublished":"true","status":"running","vacancies":"full_time"}],"trainingProvider":{"id":"e5b44d52-86b8-4298-bf6e-1fa5bfd8a5a6","code":"1EC","name":"The Minster Learning Alliance"},"accreditedBody":{"id":"d2b7d074-fac9-42c5-a0d3-d5471b35f7d9","code":"N91","name":"Nottingham Trent University"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9150,"aboutCourse":"A one year, full-time, school based route.  Trainees will achieve QTS and be enrolled on a PGCE Programme with the Anglia Ruskin University.   Training is majority school-based with some centre-based training. Training is a blend of face to face and online and occurs at various locations across Essex so we take into account your home address to try to keep travelling time to a minimum.  You will receive training on the general aspects of successful teaching and training around teaching your specific subject in secondary or phase within primary.\r\n\r\nIn school you will work closely with a subject / phase specific mentor and the ITT co-ordinator, who will meet regularly with you to assist you with your training plan.   You will also have an external tutor who works for Essex Teacher Training, who will visit you in school 5 times in the year to check on your progress towards meeting the Teachers' Standards.\r\n\r\nThe PGCE is delivered locally in Essex by Anglia Ruskin University and comprises 2 assignments and related tasks, which are spread across the course of the year.\r\n\r\nTrainees will have access to an online e-portfolio system and online resources along with face to face training sessions.  These along with the excellent support from in-school mentors and tutors from Essex Teacher Training, will mean you will feel fully prepared for working in the classroom.  Your teaching load will start small and increase gradually as the year progresses.  The rate at which this increases will be decided by you and your tutors and take into account any prior experience.\r\n\r\nAssessment is via observations of you teaching, reflective pieces of writing and specific tasks relating to the different Teachers' Standards.","interviewProcess":"Initially you will be invited into the lead school for an informal meeting to find out more about you and to assess whether you would be suitable for a training place in one of our schools.  You will be asked to make a short presentation about why you want to teach to a small panel of teachers from the school.  If successful at this stage, you will be invited to an interview in the lead school or one of our partner schools.  This interview could include: an activity with pupils eg teaching part of a lesson, or taking a group activity; a pupil panel interview; a written task and a formal interview with a small panel of representatives from the school and wider School Direct partnership.  If successful, you will be given a conditional offer of a place to train.","howSchoolPlacementsWork":"Trainees will complete training in two different schools during the course of the year.  Typically trainees spend the autumn term in their host school and then go to a second placement school during the first part of the Spring term and then return to their host school for the remainder of the year.  Trainees are in school 4 days a week and attend training on the 5th day.\r\n\r\nThe programme covers the secondary age range 11-16 and you \r\nwill be required to teach at both KS3 and KS4.  You will also have the opportunity to teach KS5 but it is not a requirement.","personalQualities":"We are looking for high quality graduates with a passion for learning who are committed to transforming the lives of young people through education.","otherRequirements":"Satisfactory recruitment checks including enhanced DBS, children’s barred list, prohibition order check and reference check.","status":1,"createdAt":"2021-07-06T10:52:02.303Z","updatedAt":"2021-10-05T15:44:45.691Z"}