{"id":"0812cc9c-5957-4140-8b27-67f06294dfda","name":"Physical education","code":"W284","qualification":"pgce_with_qts","startDate":"2024-07-31T23:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"74d64a54-5e34-4590-b6c7-528dd0cf26fe","code":"C6","name":"Physical education"}],"locations":[{"id":"11fe9ec7-b6cb-474d-b4da-d5a57ef3cb28","name":"Sir Jonathan North College","isPublished":"Y","status":"R","vacancies":"F"},{"id":"27b0a4b6-12ac-4d11-984b-4aa755a08824","name":"The Martin High School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"969fd197-95bd-4a8e-82d0-337e04e95844","name":"Judgemeadow Community College","isPublished":"Y","status":"R","vacancies":"F"},{"id":"6ee96cbf-1e3d-4824-a343-c2dc08657f97","name":"Beauchamp College","isPublished":"Y","status":"R","vacancies":"F"},{"id":"6531d918-95e7-4ae2-a353-4052e7faf0ff","name":"The Cedars Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"1a0ed66c-3cf7-424d-9ff1-d598ed1a1a12","name":"Humphrey Perkins School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"dfd4b849-fdfa-4f62-af77-245e4512819e","code":"1O8","name":"Lionheart Teach"},"accreditedBody":{"id":"816ef4e7-51c7-4211-828f-dbf6bb48bb6d","code":"L79","name":"Loughborough University"},"profPost":"PG","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"One in which at least 50% of the content is Physical Education/Sports Science. Classification of which is no lower than a 2:1; or a 2:2 with extensive school experience.","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":18500,"aboutCourse":"Loughborough University is ranked 2nd in the top ten of higher education institutions in the 'Good Teacher Training Guide 2017' and has been ranked Top 10 for the past five years. Our courses have been highly rated in Ofsted inspections and Loughborough has been assessed as a category 'A' provider, representing 'outstanding' provision consistently.\r\n\r\nThe Loughborough PGCE course trains individuals to teach the 11-18 age range. All individuals on the PGCE course will experience teaching the 11-16 curriculum as well as post-16, and will be qualified to take up teaching posts in all secondary schools covering the 11-18 age range.\r\n\r\nThe Loughborough PGCE has been designed by university staff and teachers from schools, and is intended to set you on the path to becoming a well informed and reflective professional. The heart of the course is the development of your teaching competences. The course lasts 36 weeks and will give you teaching experience in two different secondary schools. Two thirds of the course is spent in schools where you will have the support and guidance of experienced teachers. For the rest of the time, you will work in the university with tutors and teachers who prepare you for your school experience, and guide you in making the important links between the theoretical and practical components of the course.\r\n\r\nOur course will help you to:\r\n\r\n* learn how to teach and relate to young people in a variety of learning situations;\r\n\r\n* develop the ability to plan sequences of lessons, and to teach and manage pupils effectively;\r\n\r\n* gain the confidence and competence to undertake your full role as a teacher within a secondary school;\r\n\r\n* develop sufficient knowledge and understanding of educational issues to be able to contribute effectively to the highest standards of teaching and learning, and to whole school improvement.\r\n\r\nAlongside teaching experience in schools, you will undertake two other elements within the course:\r\n\r\n1.Subject Methods courses in which you learn to teach Physical Education.\r\n\r\n2.General Professional Studies through which you come to understand the framework of the education system and how to contribute professionally to the wider role of the teacher responsible for the personal, social and health education of pupils.","interviewProcess":"You are required to attend an interview if you are selected for consideration for a place on this course \r\n\r\nThe selection process will determine whether you: have the intellectual capabilities needed to meet the Teachers’ Standards; possess appropriate qualities, attitudes and values expected of a teacher; are able to communicate clearly and accurately in Standard English.\r\n\r\nCareful consideration is given to every applicant. Loughborough University abides by its Equal Opportunities Policy. Ethnic minorities are currently under-represented in teaching and we particularly welcome applicants from such backgrounds.","howSchoolPlacementsWork":"Placements schools will be those within The Lionheart Educational Trust.  Schools are selected to ensure a breadth of experience, though we will consider any preferences.  You will have the opportunity to experience teaching across the 11-18 age range.\r\n\r\nThe placements are referred to as 'Phase 1' and 'Phase 2' placements.\r\n\r\nPhase 1\r\nYour first placement is the 'Phase 1' placement. After induction you will then spend about 10 weeks in this school. You will build on existing experience and develop new skills with support from the school's \r\nCo-ordinator for Initial Teacher Training and the subject mentor who will oversee your professional development during the placement.\r\n\r\nPhase 2\r\nDuring your 'Phase 2' placement you will spend about 12 weeks in your second placement school. The Phase 2 school has a Co-ordinator and mentor who have similar roles and responsibilities as those in the 'Phase 1' School.\r\n\r\nThroughout the year there will be opportunities for Lionheart Teach School Direct trainees to come together to share their experiences and good practice in our CPD days, while on placements. This enriches the experience and builds vital collaboration between trainees and subject areas.","personalQualities":"Awareness of, and sensitivity to others; a sense of responsibility; a balanced and positive outlook; open mindedness; enthusiasm; hard working; well organised; self-disciplined; adaptable; resilient; leadership.\r\nStrong commitment to teaching Physical Education and an enthusiasm for working with young people.","otherRequirements":"On entry, relevant and recent (e.g. in past year) experience of PE, normally in a state secondary school (e.g. observing and/or assisting teachers in schools). On application, relevant and recent experience (e.g., in the past 2 years) of working with young people.\r\n\r\nOn entry, holds a current suitable First Aid qualification.\r\n\r\nYou are required to satisfy this University that you are physically and mentally ‘fit to teach' before embarking on the course.\r\n\r\nYou are required to undergo an enhanced Disclosure and Barring Service (DBS) check to verify your suitability for working with young people.","status":1,"createdAt":"2021-10-11T17:05:25.163Z","updatedAt":"2021-10-11T17:12:10.557Z","canSponsorStudentVisa":"no","cycle":"2024"}
