{"id":"7ed8e362-c7f7-4b8f-b69b-5e914970bcdc","name":"English","code":"35P8","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3aed1aa8-ae46-4b68-92bb-a6cc20655c59","code":"Q3","name":"English"}],"locations":[{"id":"27b0a4b6-12ac-4d11-984b-4aa755a08824","name":"The Martin High School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"969fd197-95bd-4a8e-82d0-337e04e95844","name":"Judgemeadow Community College","isPublished":"Y","status":"R","vacancies":"F"},{"id":"6531d918-95e7-4ae2-a353-4052e7faf0ff","name":"The Cedars Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"11fe9ec7-b6cb-474d-b4da-d5a57ef3cb28","name":"Sir Jonathan North College","isPublished":"Y","status":"R","vacancies":"F"},{"id":"6ee96cbf-1e3d-4824-a343-c2dc08657f97","name":"Beauchamp College","isPublished":"Y","status":"R","vacancies":"F"},{"id":"1a0ed66c-3cf7-424d-9ff1-d598ed1a1a12","name":"Humphrey Perkins School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"dfd4b849-fdfa-4f62-af77-245e4512819e","code":"1O8","name":"Lionheart Teach"},"accreditedBody":{"id":"3e6c62a3-5d34-4a91-9c23-01c7409fd909","code":"L34","name":"University of Leicester"},"profPost":"BO","degreeGrade":"0","english":"1","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":15405,"feeDetails":"UK and EU Students\r\nThis is the total course fee.\r\n\r\nStarting in September 2020\r\nTuition fees for the 2020/21 academic year are yet to be confirmed.\r\n\r\nAs an indication of what you might pay, the fee for students who started in September 2019 was:\r\n\r\n£9,250\r\nPGCE students can apply for loans from Student Finance England and may be entitled to a tax-free NCTL bursary.\r\n\r\nScholarship\r\nTeacher Training Scholarships for Secondary Biology, Physics, Chemistry, Mathematics, Languages, History, Religious Education, English and Geography Trainees\r\n\r\nScholarships of up to £32,000 (depending on the subject) are awarded to the most talented trainees in place of the NCTL bursary.\r\n\r\nTo be awarded a Scholarship you will need outstanding subject knowledge and the potential to become an inspirational physics, chemistry, mathematics, languages or geography teacher. \r\n\r\nTo view the full eligibility criteria and submit an application, please visit the website of the appropriate organisation:\r\n\r\nInstitute of Physics (Physics and Physics with Maths)\r\nInstitute of Mathematics and its Applications (Maths)\r\nRoyal Society of Chemistry (Chemistry)\r\nRoyal Geographical Society (Geography)\r\nBritish Council (Modern Languages)\r\nInternational Students\r\nThis is the total course fee.\r\n\r\nStarting in September 2020\r\nTuition fees for the 2020/21 academic year are yet to be confirmed.\r\n\r\nAs an indication of what you might pay, the fee for students who started in September 2019 was:\r\n\r\n£15,405\r\nPlease note that International Students will not be eligible for bursaries offered by the Department for Education. For more information, please visit the Get into Teaching website.\r\n","aboutCourse":"How this course is organised? \r\n \r\nThe PGCE course at the University of Leicester is divided into two halves, Phase A and Phase B, each with clearly delineated priorities to guide progress towards successful completion.  \r\n\r\nTwo-thirds of the time (currently 24 weeks out of 36) is spent in schools, starting with a two-week preliminary attachment to a primary school with time spent in a secondary school that its pupils transfer to. A pack of materials incorporating designated tasks and critical reading enables student teachers to make the most of this experience and also supports the completion of a preliminary assignment.  \r\n\r\nOn arrival in Leicester, students begin Phase A of their training, starting with an intensive University-based programme consisting of days devoted to subject work and days for the core Professional Studies Programme, which all students follow (A1). This helps prepare students for their first school placement, which at Leicester comes early in the PGCE course. By Christmas, everyone will have completed over a month's teaching in school (A2). Students then return to the same school after Christmas, continuing with their teaching for a further two weeks. \r\n\r\nA similar format is repeated in the second half of the year (Phase B). Some mainly University-based weeks (B1) lead into a substantial period of teaching experience in a different school (B2). A concluding spell in the same school, working on a subject project and other activities while continuing with a reduced teaching load, (B3) is followed by a final week in the School of Education.  \r\n\r\nWhat is taught on this course? \r\nThere are two inter-related strands: subject work and the Professional Studies Programme, with elements of both developed through taught sessions in the University and through practical teaching experiences in schools.  \r\n\r\n A number of features are common to all courses, regardless of the specific subject students are preparing to teach: \r\n\r\nClose links between the University and its partner schools/colleges, ensuring  placement experiences in different institutions draw on and inform each other  \r\n\r\nIndividual Action Planning that helps students identify their own development needs and make appropriate plans to fulfil them as they progress through the course \r\n\r\nSubject sessions, particularly in the early part of the course, which concentrate on fundamental matters such as lesson planning and evaluation, literacy, preparation of resources, adapting to various levels of pupil ability and the importance of assessment, recording and reporting achievement  \r\n\r\n\r\n","interviewProcess":"Our selection process is in two parts: School based interview and University based interview.  During the process you will participate in a small group discussion and presentation activity with candidates from a range of subjects.\r\n\r\nTeachers from Partnership schools are normally involved, as well as University Tutors.\r\nThe day will also involve:\r\n\r\n* An individual interview with the University Subject Tutor(s) and visiting teacher(s). You will be encouraged to demonstrate commitment to your subject, to reflect on relevant previous experience, and expand upon the skills, knowledge, experiences and aptitude that you can bring to your training.\r\n\r\n* A short subject specific written task which is designed to explore aspects of your subject knowledge and the quality of your expression*\r\n\r\nFurther details about the selection process are on the School of Education website http://www.le.ac.uk/education\r\n\r\n*The University of Leicester is committed to Equal Opportunities for all students and potential students, and support is available for candidates for whom this task might present a challenge. Potential applicants for whom this may be a consideration are advised to contact the Secondary PGCE team in advance.","howSchoolPlacementsWork":"Placements schools will be those within The lion heart Educational Trust.  Schools are selected to ensure a breadth of experience, though we will consider any preferences based on location.  You will have the opportunity to experience teaching across the 11-18 age range.\r\n\r\nThe placements are referred to as 'Phase A' and 'Phase B' placements.\r\nYour first placement is the 'Phase A' placement. \r\nAfter a two a two day induction you will then spend around 10 weeks in your first school. You will build on any existing experience and develop new skills with support from the school's ITT Co-ordinator and the subject mentor who will oversee your progress and professional development throughout.\r\n\r\nDuring your 'Phase B' you will spend about 12- 15 weeks in your second placement school. You will work again with the schools' ITT Co-ordinator and mentor who will work with you to develop and refine you as a classroom practitioner and ensure you have focused opportunities to strengthen your subject knowledge and pedagogical approach to teaching and build on your Phase A practice.\r\n\r\nThroughout the year there will be opportunities for ourSchool Direct trainees to come together to share their experiences and build good practice on our CPD days, whilst on placement. This enriches your training experience and builds vital collaboration between trainees and their subject areas.\r\n\r\nThroughout your placements you will have weekly professional learning sessions that focus on all areas of practice and are underpinned by our Trust's key priorities in teaching and learning.","personalQualities":"Applicants without English as a major subject would be expected to undertake essential background reading before the start of the course. We welcome applications from mature students returning to full-time work or who are making carefully considered decisions to change careers.\r\n\r\nWe expect all prospective students to have spent 10 days or more observing, and possibly assisting, learners and teachers in secondary English classrooms in order to familiarise themselves with current developments in English teaching. We welcome applicants who have creative writing, drama, performance and media production skills which they wish to develop further for use in the classroom.","otherRequirements":null,"status":1,"createdAt":"2021-07-06T10:50:29.434Z","updatedAt":"2021-09-14T15:15:28.020Z","canSponsorStudentVisa":"yes","cycle":"2024"}
