{"id":"a6d981a6-8b4b-4648-8194-559a190dc955","name":"Business studies","code":"J824","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"de6477b2-6027-48e6-b9f7-3206774705c2","code":"08","name":"Business studies"}],"locations":[{"id":"6ee96cbf-1e3d-4824-a343-c2dc08657f97","name":"Beauchamp College","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"dfd4b849-fdfa-4f62-af77-245e4512819e","code":"1O8","name":"Lionheart Teach"},"accreditedBody":{"id":"d2b7d074-fac9-42c5-a0d3-d5471b35f7d9","code":"N91","name":"Nottingham Trent University"},"profPost":"PG","degreeGrade":"0","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"This highly practical course enables you to gain the skills, knowledge, understanding and experience needed to build on a degree and teach at secondary level. The course will equip you to respond effectively to the issues currently affecting schools. We place a strong emphasis on developing your individual strengths and skills within the content of the contemporary education environment.\r\nThe award of PGCE is offered at two levels:\r\n*Professional Graduate Certificate in Education; and\r\n*Postgraduate Certificate in Education, where 60 Masters-level credits can be gained.\r\nBoth of these are recognised teaching qualifications but the postgraduate award will allow fast-track entry onto a Masters course. \r\nSuccessful completion of the PGCE leads to Qualified Teacher Status. The majority of your time will be spent on placement in schools or colleges. This practical teaching is supported by University-based lectures, seminars, workshops and tutorials exploring learning and teaching in your subject and in the wider context. Trainees also engage in an independent research project that draws together academic and professional practice.\r\nThe PGCE in Business Studies prepares students to teach across the 14 to 19 age range, helping them to develop the professional skills and attitudes to teach business in schools and colleges, as part of both academic (A level and GCSE) and BTEC courses.\r\nStudents will understand how business is taught in schools, how pupils learn and make sense of the evolving nature of business. The course reflects the range of business related courses that are now offered by schools, sixth forms and colleges, with the focus in some instances on entrepreneurship, work skills and new business technologies.\r\n","interviewProcess":"Before the interview, you will be asked to complete two tasks. The first is to plan a KS4 lesson on a pre-determined topic. The second task will be to complete a business subject knowledge audit. Both of these tasks need to be sent back to the university prior to your interview. \r\nThe interview day... what to expect:\r\nWritten task\r\nYou will complete an English test of your reading and writing ability so we can ensure that you have a good and accurate use of Standard English. \r\nIndividual interview\r\nYou will have an individual interview lasting around 15 to 30 minutes with at least one course tutor, and I’m some cases, by a senior teacher from one of our partnership schools or a current trainee on the PGCE business course. The interview will focus on your personal qualities and skills, your suitability for teaching, your experience of working with young children in school settings and your current studies or employment. \r\nYou will also be required to do other tasks during your interview, such as a presentation based on an aspect relating to the teaching of your subject area.\r\n","howSchoolPlacementsWork":"School or college experience is central to the Secondary PGCE at NTU. At least 24 weeks are spent on placement in at least two secondary schools or colleges. For both placements, training is planned by mentors to enable students to attain QTS. This practical teaching element is assessed on a regular basis via formal observation by a subject mentor and University tutors, enabling us to monitor each individual trainee’s progress and effectively support their development. As a School Direct partnership your placements will be in two contrasting schools within the Lionheart Academies Trust and may be in city centre, suburban or semi-rural locations. This variety provides opportunities for a wide range of teaching experiences and lays a good foundation for your future professional development.","personalQualities":"","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:50:30.071Z","updatedAt":"2021-09-14T14:53:34.671Z","canSponsorStudentVisa":"yes","cycle":"2024"}
