{"id":"c66f2f18-7ed4-40e1-ad41-984240bcea04","name":"Geography","code":"E954","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3f47e67b-7fa5-4947-a5a0-74d528cd2a87","code":"F8","name":"Geography"}],"locations":[{"id":"27b0a4b6-12ac-4d11-984b-4aa755a08824","name":"The Martin High School","isPublished":"N","status":"N","vacancies":"F"},{"id":"969fd197-95bd-4a8e-82d0-337e04e95844","name":"Judgemeadow Community College","isPublished":"N","status":"N","vacancies":"F"},{"id":"11fe9ec7-b6cb-474d-b4da-d5a57ef3cb28","name":"Sir Jonathan North College","isPublished":"N","status":"N","vacancies":"F"},{"id":"6531d918-95e7-4ae2-a353-4052e7faf0ff","name":"The Cedars Academy","isPublished":"N","status":"N","vacancies":"F"},{"id":"1a0ed66c-3cf7-424d-9ff1-d598ed1a1a12","name":"Humphrey Perkins School","isPublished":"N","status":"N","vacancies":"F"},{"id":"6ee96cbf-1e3d-4824-a343-c2dc08657f97","name":"Beauchamp College","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"dfd4b849-fdfa-4f62-af77-245e4512819e","code":"1O8","name":"Lionheart Teach"},"accreditedBody":{"id":"d2b7d074-fac9-42c5-a0d3-d5471b35f7d9","code":"N91","name":"Nottingham Trent University"},"profPost":"PG","degreeGrade":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"GCSE English and Mathematics at minimum grade C or equivalent, We accept the GCSE equivalency taken via equivalencytesting.com or astarequivalency.co.uk. Applicants with pending qualifications will be considered.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"This highly practical course enables you to gain the skills, knowledge, understanding and experience needed to build on a degree and teach at secondary level. The course will equip you to respond effectively to the issues currently affecting schools. We place a strong emphasis on developing your individual strengths and skills within the context of the contemporary education environment.\r\n \r\nThe award of PGCE is offered at two levels:\r\n*Professional Graduate Certificate in Education; and\r\n*Postgraduate Certificate in Education, where 60 Masters-level credits can be gained.\r\n \r\nBoth of these are recognised teaching qualifications but the postgraduate award will allow fast-track entry onto a Masters course. \r\nSuccessful completion of the PGCE leads to Qualified Teacher Status. The majority of your time will be spent on placement in schools or colleges. This practical teaching is supported by both face to face and online University lectures, seminars, workshops and tutorials exploring learning and teaching in your subject and in the wider context. Trainees also engage in an independent research project that draws together academic and professional practice.","interviewProcess":"The interview day - what to expect. \r\nYou will be provided information regarding set tasks which need to be completed prior to the interview day.  These will form the basis of some discussion at the interview, including a discussion centred on an activity where you have planned a short lesson.\r\n\r\nYou will have an individual interview with one of the course tutors. The interview will focus on your personal qualities and skills, your suitability for teaching, your experience of working with young children in school settings and your current studies or employment. You may be required to do other tasks during your interview, such as a presentation based on your teaching subject area, or a group activity.\r\n\r\nYou will complete an English task of your reading and writing ability so we can ensure that you have a good and accurate use of Standard English.\r\n\r\nThe whole interview process will take around 90 minutes. \r\n","howSchoolPlacementsWork":"School or college experience is central to the Secondary PGCE at NTU. At least 24 weeks are spent on placement in at least two secondary schools or colleges. For both placements, training is planned by mentors to enable students to attain QTS. This practical teaching element is assessed on a regular basis via formal observation by a subject mentor and University tutors, enabling us to monitor each individual trainee’s progress and effectively support their development. As a School Direct partnership your placements will be in two contrasting schools within the Lionheart Educational Trust and may be in city centre, suburban or semi-rural locations. This variety provides opportunities for a wide range of teaching experiences and lays a good foundation for your future professional development.\r\n \r\n","status":0,"createdAt":"2021-10-10T17:43:15.866Z","canSponsorStudentVisa":"yes","cycle":"2024"}
