{"id":"fe84aa40-1497-4936-a9e8-cf4e54ca74aa","name":"Mathematics","code":"M243","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"72345aa7-096c-488f-8649-085b8178cadb","code":"G1","name":"Mathematics"}],"locations":[{"id":"27b0a4b6-12ac-4d11-984b-4aa755a08824","name":"The Martin High School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"1a0ed66c-3cf7-424d-9ff1-d598ed1a1a12","name":"Humphrey Perkins School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"6531d918-95e7-4ae2-a353-4052e7faf0ff","name":"The Cedars Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"11fe9ec7-b6cb-474d-b4da-d5a57ef3cb28","name":"Sir Jonathan North College","isPublished":"Y","status":"R","vacancies":"F"},{"id":"969fd197-95bd-4a8e-82d0-337e04e95844","name":"Judgemeadow Community College","isPublished":"Y","status":"R","vacancies":"F"},{"id":"6ee96cbf-1e3d-4824-a343-c2dc08657f97","name":"Beauchamp College","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"dfd4b849-fdfa-4f62-af77-245e4512819e","code":"1O8","name":"Lionheart Teach"},"accreditedBody":{"id":"d2b7d074-fac9-42c5-a0d3-d5471b35f7d9","code":"N91","name":"Nottingham Trent University"},"profPost":"PG","degreeGrade":"0","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"This highly practical course enables you to gain the skills, knowledge, understanding and experience needed to build on a degree and teach at secondary level. The course will equip you to respond effectively to the issues currently affecting schools. We place a strong emphasis on developing your individual strengths and skills within the context of the contemporary education environment.\r\n\r\nThe final award is offered at two levels:\r\n\r\n· Professional Graduate Certificate in Education (ProfGCE) – if all 120 academic credits gained at NQF level 6;\r\n\r\n· Postgraduate Certificate in Education (PGCE), if 60 of the 120 credits gained at NQF level 7 (Masters).\r\n\r\nBoth of these are recognised teaching qualifications but the postgraduate award also allows fast-track entry onto a Master’s course.\r\n\r\nSuccessful completion of the course leads to Qualified Teacher Status. The majority of your time will be spent on placement in schools or colleges. This practical teaching is supported by University-based lectures, seminars, workshops and tutorials which explore:\r\n\r\n· learning and teaching in mathematics;\r\n\r\n· general issues that affect all teachers, such as inclusion and behaviour management.\r\n\r\nWell-qualified mathematics teachers are in high demand in the UK and internationally. Trainees will develop an understanding of the nature of mathematics and its place in the National Curriculum, how pupils learn to think and reason mathematically and how to teach mathematics in such a way that learners enjoy it and choose to study it. The programme utilises a body of established knowledge in mathematics education, but also keeps you abreast of the latest developments. It prepares maths trainee teachers to teach the 11 to 16 age range, with opportunities to gain post-16 experience.","interviewProcess":"Once you have been invited for interview, you will receive a pack of more detailed information about the mathematics PGCE. We hope this will answer many of the questions you might have, and also provide a prompt for any additional questions you may wish to ask.\r\n\r\nInterviews are currently being conducted virtually. About 90 minutes before your interview time, you will be sent two tasks: a short written reflection on an educational article , and a set of mathematics questions that we will discuss during the interview. These are not ‘tests’ per se, but are designed to help us determine whether you may require additional support; they should take about an hour to complete.\r\n\r\nYour interview will usually be conducted by a panel of two mathematics tutors and will last around an hour. Following the panel’s questions and a discussion of the mathematics task, you will have the opportunity to ask any questions you may have a bout the course. A decision will be made on the day and you will be informed as quickly as possible, via UCAS.","howSchoolPlacementsWork":"School or college experience is central to the Secondary PGCE at NTU. At least 24 weeks are spent on placement in at least two secondary schools or colleges. For both placements, training is planned by mentors to enable students to attain QTS. This practical teaching element is assessed on a regular basis via formal observation by a subject mentor and University tutors, enabling us to monitor each individual trainee’s progress and effectively support their development. As a School Direct partnership your placements will be in two contrasting schools within the Lionheart Academies Trust and may be in city centre, suburban or semi-rural locations. This variety provides opportunities for a wide range of teaching experiences and lays a good foundation for your future professional development.\r\n \r\n","personalQualities":"","otherRequirements":"* Disclosure and Barring Service and Prohibition Order checks and a satisfactory health check passed prior to enrolling.\r\n\r\n* Two references - one academic and one vocational.\r\n\r\n* An interview with both the training school and NTU is part of the selection process.","status":1,"createdAt":"2021-07-06T10:50:30.103Z","updatedAt":"2021-09-14T15:00:45.636Z","canSponsorStudentVisa":"yes","cycle":"2024"}
