{"id":"21f122d7-1627-42d8-856e-e0a41525c14a","name":"Religious education","code":"F249","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"724b5d16-28dd-4431-bc17-ea4be4daedc4","code":"V6","name":"Religious education"}],"locations":[{"id":"a81daf63-58e8-434f-b19e-bb3565476dec","name":"Orleans Park School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"24bde592-c2e8-495f-aec3-d4ad325921fe","code":"2HZ","name":"Orleans Park Teaching Alliance"},"accreditedBody":{"id":"7f11aaed-7c3e-42c5-af7a-023d33b45fa3","code":"U80","name":"UCL, University College London"},"profPost":"PG","degreeGrade":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Candidates must take equivalency tests using:\nhttp://www.equivalencytesting.com\nhttps://astarequivalency.co.uk\nUCL requires **at least grade 5** and does not accept\nequivalency tests from any other testing\norganisations.\n\n\n\nApplicants who do not have sufficient subject knowledge may be required to undertake a Subject Knowledge Enhancement (SKE) course or other pre-course study as specified by the UCL subject team.\n\nAny pending qualifications are included as conditions\nin the UCL offer letter, to be met before enrolment in\nAugust 2022.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"This course will equip you with the skills to be an effective teacher and to have a clear understanding about how to engage learners in this subject. \r\nKey skills you will learn include:\r\n\r\n- subject specific knowledge\r\n- how to plan effectively for different year groups and to enable progression\r\n- how to help all learners access learning, including those with SEN, EAL or other specific needs\r\n- how to ask effective questions and deliver insightful feedback\r\n- how to use assessment purposefully in the classroom\r\n- your role as a tutor and how to support learners outside of the classroom\r\n- knowledge of your legal duty in order to safeguard staff and students\r\n- how to apply for your first teaching post\r\n\r\nYou will spend the first four weeks of the course at UCL Institute of Education campus in central London focusing on pedagogy and then one day a week throughout the training year. This allows you to receive excellent teaching and share best practice with other trainees in your subject. You will then have two school placements where you will be supported by a mentor. Whilst in school, you will also have Professional Studies sessions with our cohort of School Direct and PGCE students in order to share best practice and learn important skills. \r\n\r\nThe course leads to PGCE with MA credits.","interviewProcess":"You will apply to OPTA directly and have two interviews. We will invite you into our lead school for an interview and a short subject knowledge activity, as well as giving you the chance to tour our school and meet key staff. You will also have an interview with UCL Institute of Education staff  who accredit this course for our School Direct programme.","howSchoolPlacementsWork":"You will have two school based placements which will run across the majority of the year. The first placement runs from October to January, and the second placement runs from February to June. All of our schools in the alliance are based in Richmond and Twickenham. These are:\r\n- Orleans Park School (lead school)\r\n- Christ's School\r\n- Hampton High School\r\n- St Richard Reynolds Catholic College\r\n- Teddington School\r\n- Turing House School\r\n\r\nWe are also working with Richmond upon Thames school and Twickenham School this year.\r\n\r\nYou will gain experience of KS3 and KS4 teaching in both placements, and have an opportunity to experience KS5 lessons in at least one of your placement schools. \r\n\r\nTrainees will build towards having 9-11 lessons a week in  both placements, as well as having some periods for observation and supporting in lessons (potentially in another subject). You will have a mentor supporting you throughout this experience and they will provide both formal and informal feedback in order to help you achieve the teaching standards. You will attend in school professional studies sessions alongside whole school staff development sessions and have the chance to support extra curricular activities.","personalQualities":"","otherRequirements":"- evidence at application of the ability to demonstrate a high standard of written English\r\n- successful completion of skills tests in mathematics and English prior to\r\ncommencement of course.\r\n- health and physical capacity to teach, \r\n- an acceptable Disclosure and Barring Service (DBS) certification\r\n","status":1,"createdAt":"2021-10-07T22:20:18.934Z","updatedAt":"2021-10-07T22:22:34.101Z","canSponsorStudentVisa":"yes","cycle":"2024"}
