{"id":"0832b0f2-5f43-43af-ae52-dd4ef75bf9bc","name":"Design and technology","code":"C719","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"118fabd7-86d0-4a40-9e9a-e5c302abe59b","code":"DT","name":"Design and technology"}],"locations":[{"id":"c0f71ac9-c64d-48ea-b264-b10380ea251a","name":"Countesthorpe Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"90012db1-2bbf-458e-bdce-e6de3810992f","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"},{"id":"b8549d06-60cb-40cd-a254-0d73477d1f66","name":"Bosworth Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"b7b5e7dc-61c3-446d-9a31-6bf9c4655499","name":"Saint Martins Catholic Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"ff93f49f-ce6b-46d8-a531-4a26057c9d0d","name":"Ivanhoe College","isPublished":"Y","status":"R","vacancies":"F"},{"id":"5aa97042-ec3a-455b-bacd-87867528bfca","name":"Ibstock Community College","isPublished":"Y","status":"R","vacancies":"F"},{"id":"1191d389-35d3-4cb1-911c-6a56f362828b","name":"South Charnwood High School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"2c53188a-75cf-4779-b3a2-eb10c5656a23","name":"Brookvale Groby Learning Campus","isPublished":"Y","status":"R","vacancies":"F"},{"id":"8b29b5ab-6100-4f74-8aa7-0672b71dc96c","name":"The Winstanley School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"3ba3e3da-b2c4-42e4-a0a2-dd07fc9572a1","name":"Ashby School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"b4d00a08-4aa8-488a-9bf9-33183814d606","code":"1A4","name":"LiFE MAT and Partners School Direct"},"accreditedBody":{"id":"26797ebf-f835-47c8-9369-7d6d67fb2343","code":"C85","name":"Coventry University"},"profPost":"PG","degreeGrade":"1","additionalDegreeSubjectRequirements":"false","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":7500,"feeDetails":"This includes accommodation at any residential conferences","aboutCourse":"We are different from other University teacher training courses in that all of your time is spent in school. \r\n  \r\nYou will be in school for the full 5 days a week. In your school you will develop your craft of the classroom, guided by an in-school Mentor who will support you on a day-to-day basis.\r\n \r\nThis is underpinned by our interactive, online learning platform, which hosts our regular engagement with you in webinars, tutorials and podcasts, and allows opportunities for collaboration with fellow trainees. \r\n\r\nYou will also receive 1-1 support from your own University Tutor, who is part of a dynamic and highly-skilled University team.\r\n\r\nYou will attend up to four days in person with us at our educational conferences where you will share ideas with fellow trainees, and engage with leading educators and teachers.  Where Covid-19 prevents attendance in-person, the conferences are delivered online. \r\n\r\nAdditional advantages of training to teach with us are:\r\n•\tA flexible approach to training: You can start in September choose to train on a full-time.\r\n•\tThe practical relevance of in-school training combined with the quality and rigour expected of a University PGCE with 60 Masters-level credits.\r\n\r\nFor more course details, visit www.coventry.ac.uk/education ","interviewProcess":"Whilst an interview can cause apprehension, ours is designed to be fair and relaxed, and we will look at your suitability to train to teach more than anything else. It is a chance for you to share with us your knowledge about your chosen phase or subject as well as your enthusiasm for a career in teaching. The interview is a two-way process, and we encourage you to ask questions about our course and the teaching profession. \r\n\r\nLiFE MAT and Partners School Direct applications are required to attend an individual, virtual interview. \r\n\r\nThis will include:\r\n*A short presentation on your experience in schools to date\r\n*A task examining the qualities of a good teacher\r\n*A subject knowledge task\r\n\r\nThen followed by a formal interview with the Director of Learning, and a subject lead.","howSchoolPlacementsWork":"LiFE MAT and Partners School Direct is a wonderful group of nine schools serving many areas of the north and west parts of Leicestershire. \r\nPlacements school will be within the LiFE MAT and Partners. These schools  are judged good or outstanding by Ofsted in at least one area of the areas of inspection and it has been noted that they are schools where students want to learn. The placements are discussed with the trainee and based on partners' capacity and the availability of experienced staff to act as mentors.\r\n\r\nStudents have two placements in contrasting schools within the partnership and access to 11-19 age range and key stages 3-5. \r\n\r\n\r\nWe believe that outstanding, daily mentoring is one of the most important elements of teacher training.  On placement, your in-school Mentor will be an experienced, highly effective teacher who receives regular training from us. In addition, your University Tutor will oversee and help guide your progress throughout the course, including support with your assignments as well as providing practical tips for your teaching.\r\n\r\nThroughout the year there will be opportunities for LiFE MAT and Partners School Direct trainees to come together to share their experiences and good practice in our CPD days, while on placements. This enriches the experience and builds vital collaboration between trainees and subject areas.","personalQualities":"","otherRequirements":"Teaching is an intellectually demanding career that requires an ability to analyse and reflect upon experiences. This is likely to be demonstrated in our selection process by applicants expanding on their previous experiences in school settings and displaying a capacity to structure thoughts; to raise and answer related questions both in discussion and in writing.\r\nPrevious experience in a school setting would therefore be desirable. \r\nAll candidates will be expected to go through an Enhanced DBS Check.  ","status":1,"createdAt":"2022-01-17T11:08:30.515Z","updatedAt":"2022-01-20T12:48:23.898Z","canSponsorStudentVisa":"no","cycle":"2024"}
