{"id":"1f0f7ec6-b7fb-4777-a827-8254e493afb7","name":"Physics","code":"26VQ","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"bf97cd0a-224c-43d3-a021-84143df13e8d","code":"F3","name":"Physics"}],"locations":[{"id":"b8549d06-60cb-40cd-a254-0d73477d1f66","name":"Bosworth Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"90012db1-2bbf-458e-bdce-e6de3810992f","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"},{"id":"ff93f49f-ce6b-46d8-a531-4a26057c9d0d","name":"Ivanhoe College","isPublished":"Y","status":"R","vacancies":"F"},{"id":"3ba3e3da-b2c4-42e4-a0a2-dd07fc9572a1","name":"Ashby School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"8b29b5ab-6100-4f74-8aa7-0672b71dc96c","name":"The Winstanley School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"b7b5e7dc-61c3-446d-9a31-6bf9c4655499","name":"Saint Martins Catholic Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"2c53188a-75cf-4779-b3a2-eb10c5656a23","name":"Brookvale Groby Learning Campus","isPublished":"Y","status":"R","vacancies":"F"},{"id":"1191d389-35d3-4cb1-911c-6a56f362828b","name":"South Charnwood High School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"c0f71ac9-c64d-48ea-b264-b10380ea251a","name":"Countesthorpe Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"5aa97042-ec3a-455b-bacd-87867528bfca","name":"Ibstock Community College","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"b4d00a08-4aa8-488a-9bf9-33183814d606","code":"1A4","name":"LiFE MAT and Partners School Direct"},"accreditedBody":{"id":"3e6c62a3-5d34-4a91-9c23-01c7409fd909","code":"L34","name":"University of Leicester"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"The tests will be advised by the University of Leicester","courseLength":"OneYear","feesUK":9250,"feesInternational":16100,"feeDetails":"For loan and bursary information - \r\n\r\nPlease see the University of Leicester website for up to date information.\r\nhttps://le.ac.uk/courses/secondary-education-pgce/2020 ","aboutCourse":"The LiFE MAT and Partners School Direct PGCE, in partnership with the University of Leicester, is divided into two halves, Phase A and Phase B, each with clearly delineated priorities to guide towards successful completion. The partnership offers experience of teaching Key Stages 3,4,and 5.\r\n\r\nThe course is a combination of subject knowledge days and school placements. A pack of materials incorporating designated tasks and recommended reading enables student teachers to make the most of these experiences and prepare them for their first teaching placement. Placement A consists of 8 weeks in school before Christmas, before a similar format is repeated in the second half of the year - Placement B. \r\n\r\nIn total 21 weeks in school out of a total of 36, working with experienced teachers who will be skilled and trained mentors, subject specialists, passionate about sharing their knowledge and expertise to help you as a trainee to become an outstanding teacher.\r\n\r\nSuccessful completion of the course leads to either:\r\n\r\n*PGCE and 90 credits at Masters Level awarded by the University and Qualified Teacher Status (QTS) awarded by NCTL OR\r\n*PGCE and QTS.\r\n\r\nTrainees must:\r\n\r\n*Follow the course satisfactorily by attendance, participation and completion of set work.\r\n*Reach pass standard both in written assignments and in practical teaching - there are three subject related assignments in total.\r\n*Demonstrate that they have met all three of the Assessment Areas and teachers Standards laid down by NCTL including passing the QTS skills tests in numeracy and literacy.\r\n\r\nLiFE MAT School Direct  (formerly Groby and Partners School Direct) trainees have always been successful in securing teaching posts, with many of them gaining employment in partner schools. A good number of our former trainees now have posts of responsibility in schools and work as subject leaders, senior managers and Headteachers.\r\n","interviewProcess":"LiFE MAT and Partners School Direct applicants are only required to attend a school based assessment day.\r\nApplicants can be assured of a warm welcome to Bosworth Academy in Desford and the interview day will include the following:\r\n*Lesson observation and feedback\r\n*Designing and developing a task for a group of about four students\r\n*A short presentation on your experience in schools to date\r\n*A task examining the qualities of a good teacher\r\n*A subject knowledge task\r\nThese activities are followed by a formal interview panel comprising of senior staff from partner schools and subject leads.\r\nWhen we receive applications, we are initially looking for evidence across a range of areas such as:\r\n*Suitable academic qualifications\r\n*Experience (paid or voluntary) in schools or educational related settings, or in wider working with children of young people\r\n*A personal statement which shows an ability to reflect on this experience\r\n*An awareness of contemporary issues in education and the subject applied for\r\n*Any particular outstanding skills/experience including subject specific skills\r\n*Two references that substantiate performance to date and indicate potential (if you are an undergraduate, one of your referees should be able to comment on your predicated degree class)\r\nSuccessful teaching depends on a commitment to on-going professional development. We look for self-motivated candidates who are able to engage in informed discussion of key contemporary issues in education. Applicants should be able to show that they are able to take responsibility for developing their own professional skills and understanding.","howSchoolPlacementsWork":"LiFE MAT and Partners School Direct is a wonderful group of eight schools serving many areas of the north and west parts of Leicestershire. Judged good or outstanding by Ofsted in at least one area of the areas of inspection, and it has been noted that they are schools where students want to learn.\r\nStudents have two placements in contrasting schools within the partnership and access to 11-19 age range and key stages 3-5. The placements are discussed with the trainee and based on partners' capacity and the availability of experienced staff to act as mentors.\r\nPhase A comprises of 8 weeks of school based experience. Every trainee maintains a Professional Development Record. This is where you will log evidence of your progress. Students will also be expected to write entries in a Reflective Journal to record and reflect on key moments and critical incidents in their professional development. After Christmas Phase B begins and a substantial period of teaching experience. Phase B continues with a subject project, other activities and finally a reduced teaching load and a last week at University before the welcome summer break!\r\nIn school, your subject teaching will be closely monitored and supported by a mentor in the faculty. A senior member of staff, the Initial Teacher Training (ITT) co-ordinator, holds overall responsibility in school for the training of trainee teachers, including tutorials and the provision of opportunities for professional development and whole school concerns - such as the importance and use of technology in the classroom to facilitate learning and reduce workload.\r\n\r\nIn total student teachers will have spent 21 out of the 36 weeks in schools on placements and with LiFE MAT and Partners. Working with teachers who understand what trainees need to know in order to become exceptional Newly Qualified Teachers (NQT's).\r\n","personalQualities":"Developing positive relationships, the ability to listen, be sensitive, work collaboratively and to respond to the needs of others is crucial and our selection process pays particular attention to these qualities.\r\nTrainees should be able to express their ideas confidently, both orally and in writing and make effective use of technology to support learning.\r\nWe are looking to recruit individuals who understand the position of trust which teaching puts them in by demonstrating a professional regard for the schools you will work in and for promoting fundamental British values, positive values and attitudes.\r\n","otherRequirements":"Teaching is an intellectually demanding career that requires an ability to analyse and reflect upon experiences. This is likely to be demonstrated in our selection process by applicants expanding on their previous experiences in school settings and displaying a capacity to structure thoughts; to raise and answer related questions both in discussion and in writing.\r\nPrevious experience in a school setting would therefore be desirable. \r\nAll candidates will be expected to go through an Enhanced DBS Check.  \r\n","status":1,"createdAt":"2021-07-06T10:48:21.695Z","updatedAt":"2021-09-30T09:56:28.016Z","canSponsorStudentVisa":"yes","cycle":"2024"}
