{"id":"fd415587-3a41-4370-9e69-9267cd26240b","name":"Physical education","code":"C724","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"74d64a54-5e34-4590-b6c7-528dd0cf26fe","code":"C6","name":"Physical education"}],"locations":[{"id":"90012db1-2bbf-458e-bdce-e6de3810992f","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"b4d00a08-4aa8-488a-9bf9-33183814d606","code":"1A4","name":"LiFE MAT and Partners School Direct"},"accreditedBody":{"id":"816ef4e7-51c7-4211-828f-dbf6bb48bb6d","code":"L79","name":"Loughborough University"},"profPost":"PG","degreeGrade":"1","additionalDegreeSubjectRequirements":"false","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":18500,"aboutCourse":"Loughborough University is ranked 2nd in the top ten of higher education institutions in the ‘Good Teacher Training Guide 2017’ and has been ranked Top 10 for the past five years. Our courses have been highly rated in Ofsted inspections and Loughborough has been assessed as a category ‘A’ provider, representing ‘outstanding’ provision, three consecutive times since 2005.\r\n\r\nThe Loughborough PGCE course trains individuals to teach the 11-18 age range. It is formally registered with the Department for Education as an 11-16 QTS (Qualified Teacher Status) course with post-16 enhancement. In effect, this means that all individuals on the PGCE course will experience teaching the 11-16 curriculum as well as post-16, and will be qualified to take up teaching posts in all secondary schools covering the 11-18 age range.\r\n\r\nThe Loughborough PGCE has been designed by university staff and teachers from schools, and is intended to set you on the path to becoming a well informed and reflective professional. The heart of the course is the development of your teaching competences. The course lasts 36 weeks and will give you teaching experience in two different secondary schools. Two thirds of the course is spent in schools where you will have the support and guidance of experienced teachers. For the rest of the time, you will work in the university with tutors and teachers who prepare you for your school experience, and guide you in making the important links between the theoretical and practical components of the course.\r\n\r\nOur course will help you to:\r\n\r\nlearn how to teach and relate to young people in a variety of learning situations;\r\ndevelop the ability to plan sequences of lessons, and to teach and manage pupils effectively;\r\ngain the confidence and competence to undertake your full role as a teacher within a secondary school;\r\ndevelop sufficient knowledge and understanding of educational issues to be able to contribute effectively to the highest standards of teaching and learning, and to whole school improvement.\r\n\r\nAlongside teaching experience in schools, you will undertake two other elements within the course:\r\n\r\n1.Subject Methods courses in which you learn to teach your chosen subject (Physical Education or Mathematics).\r\n2.General Professional Studies through which you come to understand the framework of the education system and how to contribute professionally to the wider role of the teacher responsible for the personal, social and health education of pupils.","interviewProcess":"LiFE MAT and Partners School Direct applicants are only required to attend a school based assessment day.\r\n\r\nYou will be expected to attend an interview, which will be led by Loughborough University and have representatives from LiFE MAT and Partners School Direct.\r\n\r\nThe interview at Loughborough University will comprise of:\r\nGroup discussion\r\nWritten test\r\nIndividual interview\r\n \r\nYou will need to bring the following with you to the interview:\r\nPhoto ID (Passport/Driving Licence)\r\nOriginal Degree Certificate (if available)\r\nOriginal Maths GCSE Certificate\r\nOriginal English GCSE Certificate\r\n","howSchoolPlacementsWork":"LiFE MAT and Partners School Direct is a wonderful group of eight schools serving many areas of the north and west parts of Leicestershire. \r\nPlacements school will be within the LiFE MAT and Partners. These schools  are judged good or outstanding by Ofsted in at least one area of the areas of inspection and it has been noted that they are schools where students want to learn. The placements are discussed with the trainee and based on partners' capacity and the availability of experienced staff to act as mentors.\r\n\r\nStudents have two placements in contrasting schools within the partnership and access to 11-19 age range and key stages 3-5. \r\n\r\nThe placements are referred to as ‘Phase 1’ and ‘Phase 2’ placements\r\n\r\nPhase 1 Your first placement is the ‘Phase 1’ placement. After induction you will then spend about 10 weeks in this school. \r\n\r\nPhase 2 During your ‘Phase 2’ placement you will spend about 12 weeks in your second placement school. \r\n\r\nIn your placement schools, your subject teaching will be closely monitored and supported by a mentor in the faculty.\r\nA senior member of staff, the Initial Teacher Training (ITT) co-ordinator, holds overall responsibility in school for the training of trainee teachers, including tutorials and the provision of opportunities for professional development and whole school concerns - such as the importance and use of technology in the classroom to facilitate learning and reduce workload.\r\n\r\nThroughout the year there will be opportunities for LiFE MAT and Partners School Direct trainees to come together to share their experiences and good practice in our CPD days, while on placements. This enriches the experience and builds vital collaboration between trainees and subject areas.","personalQualities":"We are seeking to recruit highly motivated and inspiring individuals who are excited about the School Direct PGCE and have:\r\n a genuine commitment to teaching\r\n excellent communication skills\r\n ability to form good and effective relationships\r\n reflective qualities\r\n emotional resilience\r\n awareness of current educational issues\r\n energy and a sense of humour!\r\n experience in educational related settings, or wider experience of \r\n working with children or young people\r\n any particular outstanding/subject specific skills\r\n\r\nPlease use your personal statement to highlight these qualities and give us a clear picture of why you want to teach.\r\n","otherRequirements":"Teaching is an intellectually demanding career that requires an ability to analyse and reflect upon experiences. This is likely to be demonstrated in our selection process by applicants expanding on their previous experiences in school settings and displaying a capacity to structure thoughts; to raise and answer related questions both in discussion and in writing.\r\n\r\nYou are required to satisfy this University that you are physically and mentally ‘fit to teach’ before embarking on the course.\r\n\r\nYou are required to undergo an enhanced Disclosure and Barring Service (DBS) check to verify your suitability for working with young people.","status":1,"createdAt":"2021-11-30T10:36:10.787Z","updatedAt":"2022-01-06T11:15:22.703Z","canSponsorStudentVisa":"no","cycle":"2024"}
