{"id":"17be1926-b315-4137-9156-66e489371533","name":"Modern Languages (Spanish)","code":"2ZNF","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"ce8523ef-9236-4cd9-b260-d826c7a521b3","code":"ML","name":"Modern Languages"},{"id":"e34fd2a3-a32e-44e9-aea1-666badf3ac03","code":"22","name":"Spanish"}],"locations":[{"id":"a31353f1-6c40-4953-9b87-bb71dba1ad87","name":"Folkestone School For Girls","isPublished":"N","status":"N","vacancies":"F"},{"id":"8add96ec-0e6b-4311-af74-fdb17df74d80","name":"Harvey Grammar School for Boys","isPublished":"N","status":"N","vacancies":"F"},{"id":"358117ba-5e2d-45ee-8472-c8be12ca83ed","name":"Norton Knatchbull School","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"cb55fc52-1e77-49ce-b7c7-de75c76b13a1","code":"1NG","name":"Shepway Teacher Training"},"accreditedBody":{"id":"1165d5fd-11f4-4dab-99c9-47b309481463","code":"C10","name":"Canterbury Christ Church University"},"profPost":"BO","english":"3","maths":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feeDetails":"The fee above is that which applies to the QTS & PGCE route.\r\n\r\nThose who train  to achieve Qualified Teacher Status are trained at a reduced rate of £5,960.\r\n\r\nFor specific fee queries email [(fees@canterbury.ac.uk)].","aboutCourse":"Successful applicants for the 2021-22 School Direct Programme will work in two schools - a base school and a second school, which will provide a contrasting setting.\r\n\r\nTrainees will follow a school-based programme that will enable you to work alongside outstanding practitioners developing the rigour, professional knowledge, understanding and skills necessary to become inspirational, creative and purposeful teachers.\r\n\r\nAs a trainee you will have full access to Canterbury Christ Church University and all its facilities.\r\n\r\nIt is a requirement of all QTS courses that trainees get at least 60 days (or equivalent) training through the year, comprising at least 15 days of taught sessions at the University and ongoing professional development activities provided by the school. \r\n\r\nDevelopment in school will be supported by a mentor who will help you in your progress towards meeting the standards for QTS.\r\n\r\nProfessional Studies sessions aim to inform you about aspects of professional practice which are central to your work, whatever your subject or phase, including how do we learn, how do we include all children, how is teaching a professional activity, how can education be organised and how can learning be assessed.\r\n\r\nIn additional to the professional studies content, all trainees will undertake various Curriculum Studies modules. These involve work in studying key concepts that underpin the various curricula and syllabi for your subject or phase. The sessions allow discussion of different pedagogies and allow reflection on differing school approaches to develop your appreciation of what works and how.\r\n\r\nTrainees will be welcomed as full members of the staff team and encouraged to immerse themselves in all aspects of school life including professional development days, monitoring and evaluation activity, extra-curricular activities and community events.\r\n\r\nAssessment\r\n\r\nQTS Pathway – all students\r\nThroughout the course you will be assessed by your mentors and tutors who will grade you at key points to help you understand how well you are meeting the standards for QTS. At the end of the course you will have a final assessment. This will take the form of a review meeting to formally assess whether you have met the standards for QTS.\r\n\r\nSchool Direct PGCE Pathway\r\nIn addition to the above assessment process for the recommendation for QTS students who have opted for the School Direct PGCE Pathway will be required to submit three 4,000 word equivalent assignments, spread across the year, which will be assessed at Masters Level.","interviewProcess":"Each candidate shortlisted for interview will be notified directly through UCAS and by email from our team. \r\n\r\nIf candidates are notified that they have been successful in securing an interview, they may wish to visit the lead school prior to the interview.\r\n\r\nInterviews will be generally be held at the school to which you are applying and be conducted by senior teachers, the Head of Department and the Strategic Lead of the Teaching School Alliance. Some panels will also include a representative of the University.\r\n\r\nCandidates will be asked to complete a subject knowledge audit, which will form part of the discussions at interview in assessing your readiness to teach specific areas of the curriculum and to identify any requirements for subject knowledge enhancement prior to the starting the programme.\r\n\r\nCandidates should be able to discuss their recent relevant educational experience, which should be based on their work with children or young people.\r\n\r\nCandidates will be expected to demonstrate relevant skills through a brief teaching activity. You will also be asked to give a short, prepared presentation and complete short mathematics and literacy tasks.\r\n\r\nWe also require candidates to bring proof their qualifications to interview, including their degree certificate. This is to ensure that there are no subsequent problems with eligibility to train.\r\n\r\nWe are happy to respond to questions from candidates prior to interview. The process is designed to give each applicant the best chance to show their potential to be a successful trainee.\r\n\r\n\r\n","howSchoolPlacementsWork":"Successful applicants will spend the majority of the training year in one school, generally starting on the first day of the school term in September. \r\n\r\nShepway Teaching School Alliance works secondary schools in both Folkestone and Ashford districts, which offer a range of subjects each year according to need and capacity. \r\n\r\nIn most schools you will have the opportunity to teach across the 11-18 age range.\r\n\r\nTrainees will also experience a second placement, which is 4-6 weeks in Term 3. As Kent is a selective authority, we tend to swap those in one setting with the contrasting one for their second placement.","personalQualities":"We are looking for ambitious trainee teachers who have a passion for education, are positive, enthusiastic, organised, creative, flexible, patient and have a desire to share these skills with young people of all abilities in our schools.\r\n\r\nIt is an advantage to have experience of to have experience of British mainstream schools. \r\n\r\nKnowledge of the curriculum, the challenges a school may face in raising standards and the ability to talk about what makes for great teaching are particularly important. An awareness of current issues and an understanding of the pressures of the job will strengthen any application.\r\n","otherRequirements":"\r\nAll accepted candidates will be required to provide proof of their educational qualifications in the form of certificates. Transcripts are not accepted. We do not require these to be shown at interview, but any offer made will be conditional on satisfactory proofs being supplied.\r\n\r\nAll trainees who are accept an offer on our programmes will be required to undergo a new Enhanced Disclosure and Barring Service.\r\n\r\nWe operate a safe recruitment policy, which requires candidates to complete confidential disclosure (seen by the Head of the Teaching School), where there may be issues which would affect any subsequent DBS Check.\r\n","status":2,"createdAt":"2021-07-06T10:47:14.221Z","canSponsorStudentVisa":"yes","cycle":"2024"}
