{"id":"d090cb2f-9f4a-4b4d-be7f-06bb1d25685e","name":"English","code":"2RKJ","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3aed1aa8-ae46-4b68-92bb-a6cc20655c59","code":"Q3","name":"English"}],"locations":[{"id":"71a9088f-94e2-4864-8a31-b465af9dd21b","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"b4523d06-8c31-4fb3-b201-a7806c18bb0d","code":"274","name":"Bury Schools Alliance"},"accreditedBody":{"id":"812b70c4-7fc4-46fc-975b-3e4d00f77dc4","code":"M40","name":"The Manchester Metropolitan University"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Manchester Met offers equivalency tests in English and maths - (https://www.mmu.ac.uk/stepd/secondary/train-to-teach/).\n\n \n\nPlease note if you have the following qualifications instead of GCSE English and/or maths, you will be required to pass equivalency test instead: Functional Skills in English or Mathematics, Key Skills in English or Mathematics, Adult Numeracy or Adult Literacy.","courseLength":"OneYear","feesUK":9250,"feeDetails":"Tuition Fees\r\n\r\nTuition fees can be funded through a tuition fee loan from Student Finance England. The loan is not means -tested and covers the full amount of the tuition fees. These are paid direct to the University when you enrol on a PGCE course. You would repay the loan after you have graduated and are earning over £25,000.\r\n\r\nMaintenance Loan\r\n\r\nThis is available to help you with your living costs. The amount you will receive depends on your household income (parents’ or partner’s income plus yours) and the loan is repayable once you have finished the course and are earning over £25,000.\r\n\r\nA bursary or scholarship may also be available for this subject. Details of bursaries and scholarships available for 2020 - 2021 will be announced soon. Please visit Get Into Teaching for latest information:\r\nhttps://getintoteaching.education.gov.uk/funding-my-teacher-training/bursaries-and-scholarships-for-teacher-training\r\n","aboutCourse":"As a Bury Schools Alliance (BSA) School Direct English student teacher you will receive regular training delivered by expert teachers and well-qualified mentors in our alliance of Bury schools. This will be further enhanced by attendance on a number of days at our partner University, Manchester Metropolitan University. With support from experienced mentors and leaders from BSA, MMU and your placement school, you will be supported to put your new skills into practice to develop your teaching practice.\r\n\r\nYou will be based in two schools within the alliance where you will be trained and mentored by outstanding specialist teachers of your subject in successful departments and Key Stages. This course will equip you with the skills to teach the KS3 and KS4 curriculum (children aged from 11-16 years) in your chosen subject area. \r\n\r\nThe programme is highly personalised from your first contact with us at Bury Schools Alliance to taking up your first teaching job, hopefully in one of our alliance partner schools. To date, all of our School Direct students secured employment after completing the course. Several of our former students now hold middle and senior leadership roles in local schools. Other graduates have chosen to use their skills to teach overseas. \r\n\r\nIn addition to school-based training for Qualified Teacher Status, our successful student teachers achieve a PGCE with 60 Masters' level credits. \r\n\r\nAssessment is by coursework. The purpose of assessment is to complement and build on other work on the course. The assessment items are an integral part of the learning process, thus helping you enter your first appointment with confidence and competence. For this reason, all assessment is related to work in schools.\r\n\r\nThere are two assessment elements:\r\n1. The Teacher’s Standards and Personal and Professional Conduct (incorporating teaching and the teaching file)\r\n2. Written assignments (Critical Studies, Subject Pedagogy and Record of Professional Development).\r\n\r\nThere are three sets of course completion requirements:\r\n\r\n1. The professional development file (containing four items: audit of subject knowledge and understanding, observational and analytical tasks, and your record of professional review meetings with mentors and tutors)\r\n2. The career entry profile (completed at the point of becoming an early career teacher and taken with you into your first post)\r\n3. Good attendance. A minimum of 120 schools days experience is required to pass the course.\r\n\r\n","interviewProcess":"All applications are checked to ensure they meet course entry requirements by our partner university, Manchester Metropolitan University. The applications which fulfil the criteria are then shortlisted by our admissions panel. We will contact successful candidates and invite them to an online interview and assessment.  \r\n\r\nPrior to the online interview, applicants will be asked to provide: a lesson plan, PowerPoint presentation, lesson resources, photographic ID and GCSE certificates for Maths and English along with a degree certificate (if available) via email. The interview panel will be made up of Professional leaders of ITT. The online interview and assessment session will consist of the following elements:\r\n\r\n*\tan introduction to the School Direct programme\r\n*\tapplicant to talk through their lesson plan, resources and PowerPoint \r\n*\tinterview\r\n*\topportunities for questions and answers\r\n*\tWritten task to assess literacy skills \r\n\r\nThroughout the course, applicants need to demonstrate that they have the required knowledge in Mathematics and English before QTS is awarded. Further support can be provided to ensure student teachers meet the standards required by the end of the programme.  Applicants applying for a practical subject (Art and Design or DT Graphics/Product Design/Textiles) will be required to email photographs of their portfolio prior to the interview. \r\n\r\nWe endeavour to make the interview process as enjoyable and formative as possible and will answer any questions that applicants may have.\r\n","howSchoolPlacementsWork":"BSA works on an A B model where you will complete two school placements A and B; placement A in the autumn and early spring term at one of the schools in the Bury Schools Alliance and placement B in the latter half of the spring term and summer term where you will be allocated to a different school within the Alliance. To date, all secondary school placements have been within the Borough of Bury. If you have an interest in training to teach in a special school, we may be able to offer you the experience of working in a Bury special school for one of your placements. This will be in addition to a mainstream secondary school placement. All of our students will complete a one-week placement in a Bury special school.\r\n\r\nOur Alliance schools offer dynamic and diverse settings within which to train. You will get experience of working with young people of all abilities. You will also have the opportunity of observing in a primary school, sixth-form college and a special school to give you the experience of working with learners in all phases and contexts.\r\n\r\nThe first placement will start early September and involves teaching practice in school each week, with a number of Professional Study/ Training Days over the year delivered by outstanding colleagues from our Alliance schools enabling an opportunity to discuss teaching experiences with the whole School Direct cohort in Bury, share ideas and learning and access further training opportunities to suit the requests and needs of students. The first placement ends February half term. The second placement starts after February half term and ends in June.\r\n\r\nYou will have full access to the facilities of The Manchester Metropolitan University, which has national recognition for its high-quality Initial Teacher Training provision. The majority of your time will be school based but there are a number of days where you will be based at the University, far reduced compared to a traditional PGCE.\r\n\r\n","personalQualities":"We are looking for inspiring, knowledgeable and ambitious trainees who are passionate and enthusiastic about teaching to make a real difference to young peoples' lives and futures. If this is you, and you have the following attributes, we want to hear from you!\r\n\r\n* The confidence and ability to engage with children\r\n* Commitment to excellence in education\r\n* Excellent communication and organisational skills\r\n* A commitment to working hard\r\n* An ability to establish good working relationships\r\n* Commitment to a professional team\r\n* Flexibility - a crucial characteristic that is vital in this active and constantly changing climate\r\n","otherRequirements":"All teachers are expected to be competent in Fundamental English and mathematics. Initial Teacher Training (ITT) providers are expected to make an assessment of English and mathematics knowledge of a student before QTS is awarded. Skills will be assessed during course induction. Additional support can be provided to ensure you meet these conditions by the end of your training programme.\r\n\r\nSchool experience is no longer required for you to apply to train to teach with us. BSA do understand, and recognise, the value of school experience and should you wish to arrange this we would be happy to help you.\r\n","status":1,"createdAt":"2021-07-06T10:55:11.905Z","updatedAt":"2021-09-14T11:30:50.735Z","canSponsorStudentVisa":"yes","cycle":"2024"}
