{"id":"364472b1-59f5-4c41-ba72-a4ee911a83f4","name":"Physical Education with History","code":"3CYY","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"74d64a54-5e34-4590-b6c7-528dd0cf26fe","code":"C6","name":"Physical education"},{"id":"5a3609a0-5bbb-4377-b919-5d89932ab622","code":"V1","name":"History"}],"locations":[{"id":"c5ca60ba-518c-473e-b4d8-e804946b30da","name":"University of Wolverhampton","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"4da5abb2-b287-451e-8d75-c5b79e11c2bb","code":"W75","name":"University of Wolverhampton"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We will only consider the University of Wolverhampton equivalency test/s.","courseLength":"OneYear","feesUK":9250,"feesInternational":12000,"aboutCourse":"Our Postgraduate Certificate in Education (PGCE) in Secondary Education provides a high standard of training for those preparing to take up a teaching post in the secondary school sector. The course complies with the statutory guidance from the Department for Education for Initial Teacher Training courses.\r\n\r\nThe PGCE in Secondary Education is specifically designed to ensure that those who are successful will be recommended for the award of Qualified Teacher Status (QTS) - the professional award required by all those who wish to teach in a maintained school.\r\n\r\nThe aim of the Physical Education with History course is to develop thoughtful teachers who can respond effectively to the learning needs of young people in school by providing a balanced physical education programme. We also want to inspire a generation to become physically literate and active by providing well prepared, high quality physical education experiences for all students. In addition to this, you will also be able to effectively teach the History curriculum as a second subject. As a trainee you will learn how to teach Physical Education and History to pupils in the 11-16 age range within the secondary age phase, with additional primary and post-16 enhancements. You will learn how to develop skills, knowledge and understanding for teaching Physical Education and History through a combination of university-led and school-led training.\r\n\r\nSuccessful completion of the course will lead to recommendation for the award of Qualified Teacher Status (QTS), along with 60 credits at Master’s level.","interviewProcess":"Once your application has been received, your readiness to train to teach is individually assessed. If you meet the entry requirements, you will be offered an interview where you will be required to sit a subject-specific audit, undertake a practical performance and also a group discussion.\r\n\r\nThe audit is designed to identify your strengths and areas for development. You will be sent information on how to prepare when you are notified of your interview.\r\n\r\nThe main purpose of the interview is to:\r\n•\tgive you an insight into the nature of the course, the teaching profession and to assess your commitments to it\r\n•\texplore your subject strengths and areas for development\r\n•\tassess your ability to communicate effectively in spoken and written English\r\n•\tassess your readiness to train to teach\r\n•\tassess knowledge and understanding of the range of physical education specifications in schools\r\n•\tanswer any of your questions about the course.\r\n","howSchoolPlacementsWork":"One of our strengths is that we have a vast network of high quality partnership schools in which to place you for the extended school placements. We ensure that you receive high quality school-based training by selecting schools with highly trained mentors and a proven track record of excellent trainee outcomes. We will also take other factors into consideration when placing you, such as your geographical location and transportation, to provide you with the best possible experience in a convenient and suitable setting.\r\n\r\nThe University-led elements of the course take place at our Walsall Campus. Our PGCE starts in early September and ends in June, and it is an intensive academic and professional training course that effectively prepares you for your first teaching post and beyond.\r\n\r\nThe course comprises of a two day professional placement in mixed subject groups, two extended school placements in your subject specialism and two periods of University-based teaching – September to October and January to February. The programme also includes a short Primary school placement and additional opportunities for a range of enhancements to your course; for example, experience of teaching pupils with special educational needs or teaching pupils for whom English is an additional language.\r\n","personalQualities":"You will have to possess a real interest and aptitude for physical education and history and an ability to think creatively about presenting the subjects to others. Above all, you will need a real commitment to the education of young people and a desire to inspire a generation.","otherRequirements":"Once you have a Conditional Offer, you will need to complete a current enhanced Disclosure and Barring Service (DBS) check, a medical declaration clearance and a prohibition check prior to starting the course.","status":1,"createdAt":"2021-07-06T10:52:11.895Z","updatedAt":"2021-09-22T15:20:22.108Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
