{"id":"ee4be47b-4104-4fc4-8b68-8626c314c15e","name":"Primary","code":"X100","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"3_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"c5ca60ba-518c-473e-b4d8-e804946b30da","name":"University of Wolverhampton","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"4da5abb2-b287-451e-8d75-c5b79e11c2bb","code":"W75","name":"University of Wolverhampton"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We will only consider the University of Wolverhampton equivalency test/s.","courseLength":"OneYear","feesUK":9250,"feesInternational":12250,"aboutCourse":"Our Postgraduate Certificate in Education (PGCE) in Primary Education provides a high standard of training for those preparing to take up a teaching post in the primary school sector. The course complies with the statutory guidance from the Department for Education for Initial Teacher Training courses.\r\n\r\nThe PGCE in Primary Education is specifically designed to ensure that those who are successful will be recommended for the award of Qualified Teacher Status (QTS) - the professional award required by all those who wish to teach in a maintained school.\r\n\r\nYou will focus on the teaching of the National Curriculum for primary schools and specialise in teaching Key Stages 1 and 2 whilst also having valuable opportunities to experience alternative educational settings such as Early Years, Secondary, SEND and transition.\r\n\r\nSuccessful completion of the course will lead to recommendation for the award of Qualified Teacher Status (QTS), along with 60 credits at Master’s level.","interviewProcess":"Interview and Selection\r\n\r\nFirst Stage: \r\nAll applicants that are successful with their application will be invited to complete a set of short professional scenarios involving reading, writing and numerical tasks. These will provide us with an audit of your existing strengths as well as indicate any areas where you need to develop your knowledge and understanding during your course. \r\nIf you are offered a place following interview, you will be required to demonstrate your professional readiness through successful completion of all of the tasks as one of your conditions of acceptance before the course starts. This may mean that you are asked to attend support sessions in English and mathematics during your course to enable you to demonstrate a satisfactory level of proficiency by the completion of your course.  \r\n\r\nAny work to address shortfalls in English and mathematics must be undertaken by the trainee teacher in addition to other aspects of their training. It is the trainee’s responsibility to secure these fundamental skills before being recommended for Qualified Teacher Status.  \r\n\r\nSecond Stage: \r\nYou will engage in individual face to face interview.\r\n\r\nWe will be assessing your ability to be able to meet the Teachers’ Standards by the completion of your course.\r\n","howSchoolPlacementsWork":"Every effort is made to ensure that high-quality school placements are provided to you, facilitating learning through observing, co-teaching and being observed by experienced teachers in the classroom.\r\n\r\n120 days (24 weeks) of the 36 week PGCE course will be spent in schools. You will undertake two assesed placements in two different schools. We try to take your geographical location into account when placing you in schools but our first concern is to ensure that you have a high quality school placement that can provide a range of experiences. Additional training will therefore take place in partner schools other than your 'attachment' schools. Support is available from your University Tutor throughout your training, plus from experienced teachers accredited by the University as school based tutors.","personalQualities":"","otherRequirements":"Those successful in the audits and at interview will be subsequently required to meet enhanced DBS checks, fitness to teach and medical check and prohibition order check requirements. You will be expected to complete these forms once you have been successful and have a Conditional Offer.\r\nIf you have accepted a Conditional Offer made by the University of Wolverhampton you will receive correspondence asking you to complete an enhanced Disclosure and Barring Service (DBS) check. The charge for this will be a DBS fee of £44.00 and a £6.00 ID check service fee.\r\n","status":1,"createdAt":"2021-07-06T10:52:12.503Z","updatedAt":"2021-09-22T15:25:30.225Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
