{"id":"f648be66-7b56-4919-b1a9-6a8c3d559b2d","name":"Modern Languages","code":"R9X1","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"4608e5e3-2a1a-48a1-8236-56c7af5a139d","code":"24","name":"Modern languages (other)"},{"id":"ce8523ef-9236-4cd9-b260-d826c7a521b3","code":"ML","name":"Modern Languages"}],"locations":[{"id":"c5ca60ba-518c-473e-b4d8-e804946b30da","name":"University of Wolverhampton","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"4da5abb2-b287-451e-8d75-c5b79e11c2bb","code":"W75","name":"University of Wolverhampton"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We will only consider the University of Wolverhampton equivalency test/s.","courseLength":"OneYear","feesUK":9250,"feesInternational":12250,"aboutCourse":"Our Postgraduate Certificate in Education (PGCE) in Secondary Education provides a high standard of training for those preparing to take up a teaching post in the secondary school sector. The course complies with the statutory guidance from the Department for Education for Initial Teacher Training courses.\r\n\r\nThe PGCE in Secondary Education is specifically designed to ensure that those who are successful will be recommended for the award of Qualified Teacher Status (QTS) - the professional award required by all those who wish to teach in a maintained school.\r\n\r\nModern Foreign Languages are an exciting and relevant part of the school curriculum. Pupils learn skills in listening, speaking, reading, writing and translation, in a wide range of contexts drawing upon authentic foreign language materials and literary texts. As a trainee you will learn how to teach any combination of French, German and/or Spanish to pupils in the 11-16 age range within the secondary age phase, with additional primary and post-16 enhancements. You will learn how to develop skills, knowledge and understanding for teaching modern foreign languages through a combination of university-led and school-led training.\r\n\r\nSuccessful completion of the course will lead to recommendation for the award of Qualified Teacher Status (QTS), along with 60 credits at Master’s level.","interviewProcess":"Interview and Selection\r\n\r\nFirst Stage: \r\nAll applicants that are successful with their application will be invited to complete a set of short professional scenarios involving reading, writing and numerical tasks. These will provide us with an audit of your existing strengths as well as indicate any areas where you need to develop your knowledge and understanding during your course. \r\nIf you are offered a place following interview, you will be required to demonstrate your professional readiness through successful completion of all of the tasks as one of your conditions of acceptance before the course starts. This may mean that you are asked to attend support sessions in English and mathematics during your course to enable you to demonstrate a satisfactory level of proficiency by the completion of your course.  \r\n\r\nAny work to address shortfalls in English and mathematics must be undertaken by the trainee teacher in addition to other aspects of their training. It is the trainee’s responsibility to secure these fundamental skills before being recommended for Qualified Teacher Status.  \r\n\r\nSecond Stage: \r\nYou will undertake either an observed group task or a subject-specific activity (if you are applying for secondary teacher training).\r\n\r\nThird Stage: \r\nYou will engage in individual face to face interview.\r\n\r\nWe will be assessing your ability to be able to meet the Teachers’ Standards by the completion of your course.\r\n","howSchoolPlacementsWork":"One of our strengths is that we have a vast network of high quality partnership schools in which to place you for the extended school placements. We ensure that you receive high quality school-based training by selecting schools with highly trained mentors and a proven track record of excellent trainee outcomes. We will also take other factors into consideration when placing you, such as your geographical location and transportation, to provide you with the best possible experience in a convenient and suitable setting.\r\n\r\nThe University-led elements of the course take place at our Walsall Campus. Our PGCE starts in early September and ends in June, and it is an intensive academic and professional training course that effectively prepares you for your first teaching post and beyond.\r\n\r\nThe course comprises of a two day professional placement in mixed subject groups, two extended school placements in your subject specialism and two periods of University-based teaching – September to October and January to February. The programme also includes a short Primary school placement and additional opportunities for a range of enhancements to your course; for example, experience of teaching pupils with special educational needs or teaching pupils for whom English is an additional language.","personalQualities":"You will possess a real interest and aptitude for modern foreign languages and an ability to think creatively about presenting the language(s) and associated cultures to others. Candidates will be expected to teach a wide range of vocabulary, topics and grammatical structures in order to develop pupils’ linguistic competence and ability to express their ideas and opinions in speech and in writing. You need to be confident in the use of authentic foreign language materials, in teaching pupils to translate into and out of the foreign language and in working with literary texts such as stories, songs, poems and letters.","otherRequirements":"Those successful in the audits and at interview will be subsequently required to meet enhanced DBS checks, fitness to teach and medical check and prohibition order check requirements. You will be expected to complete these forms once you have been successful and have a Conditional Offer.\r\nIf you have accepted a Conditional Offer made by the University of Wolverhampton you will receive correspondence asking you to complete an enhanced Disclosure and Barring Service (DBS) check. The charge for this will be a DBS fee of £44.00 and a £6.00 ID check service fee.\r\n","status":1,"createdAt":"2021-07-06T10:52:12.436Z","updatedAt":"2021-09-22T15:15:15.322Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
