{"id":"0074b554-eba0-461c-a17c-059ae8023133","name":"Primary","code":"2H45","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"f7b82502-954d-4497-ae14-42603622c6d8","name":"Pate's Grammar School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"226e9ff7-92c1-43ad-ab01-ed9a173ac0d7","code":"1ZB","name":"Odyssey Learning Alliance"},"accreditedBody":{"id":"9aa67012-b776-4027-89f4-5531efb3a9d2","code":"G50","name":"The University of Gloucestershire"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9259,"feesInternational":13840,"aboutCourse":"Our programme has 3 phases:\r\n1.\tDeveloping\r\nDeveloping covers induction and parent placement 1.  Trainees spend three days at university for induction followed by around four weeks in school gaining experience of ‘life in school’ in an allocated EYFS/KS1 or KS1/KS2 class (supported by the class teacher and a mentor).  Around October half-term, the assessed teaching time begins, gradually increasing to approximately 65-70% of the teaching responsibility.  In addition, trainees explore aspects of pedagogy with their mentors who continue to support their learning and offer support and guidance on a weekly basis. \r\n\r\n2.\tBroadening\r\nBroadening covers the twin placement, taking place between Christmas and Easter. This gives trainees the opportunity to broaden their practice in a contrasting demographic of school and different key stage e.g. if a trainee selected the KS1/KS2 route and they did KS1 for first placement, they'll now do KS2 for the second placement.  The assessed placement starts sooner, with assessed teaching time increasing. Trainees will be encouraged to try new approaches and to be more creative as they look to broaden their learning from Developing.  \r\n\r\n3.\tEnhancing\r\nEnhancing covers parent placement 2, from Easter to June. Trainees return to a familiar environment with the opportunity to really progress and enhance their practice. The placement aims to give a better understanding of the big picture, with longer term planning and use of a variety of assessment techniques. Assessed teaching time increases further. \r\n\r\nUniversity Professional Studies\r\nSessions take place a day a week (outside of assessed placements) with university tutors and other trainees. These lectures focus on exploring current issues in primary education, developing practical teaching strategies and subject expertise for teaching.\r\n\r\nOdyssey Professional Studies\r\nTrainees attend 'Odyssey Professional Studies' with all Odyssey trainees that cover behaviour management, curriculum, pedagogy and professional development.  These sessions revisit concepts introduced in university p / school mentor sessions and provide some opportunities for unique and beneficial cross phase working with secondary colleagues. Additional sessions and opportunities may be introduced throughout the year.\r\n\r\nAssessment\r\nTrainees complete two PGCE assignments, supported by school-based training managers and mentors, and university tutors.  The programme leads to a PGCE awarded by the University of Gloucestershire, with 60 Master’s level credits. All elements of the course must be completed satisfactorily. School placements are jointly assessed by staff within schools and university link tutors, through observation of teaching and scrutiny of other evidence.\r\n","interviewProcess":"All interviews are held in Alliance schools. You will be invited to interview at one of our partner schools to be interviewed by serving Senior Leaders. At the interview we will explore the reasons behind your desire to teach and also your suitability for the course. We will ask you to either prepare a presentation, or to deliver a short lesson to a group of children. (Details will be provided in advance).","howSchoolPlacementsWork":"All trainees will undertake placements in 2 schools following a ‘parent/twin/parent’ structure. Trainees are placed in a “parent” school from October to December, a contrasting “twin” school from January to March and return to the “parent” school from April to June. Placements are 9-10 weeks in length.\r\n\r\nEach school has a training manager, responsible for overseeing all the trainees within the school, and trainees are allocated class teacher and a mentor, who will see them most days and meet with them individually once a week to review their training and plan next steps.\r\n\r\nOur partner schools are:\r\nBadsey First School (Badsey, Evesham)\r\nBishops Cleeve Primary Academy (Bishops Cleeve, Cheltenham)\r\nGlenfall Community Primary School (Cheltenham)\r\nGreat Oldbury Primary Academy (Stonehouse, Stroud)\r\nLinden Primary School (Gloucester)\r\nLongford Park Primary Academy (Gloucester)\r\nRowanfield Infant School (Cheltenham)\r\nRowanfield Junior School (Cheltenham)\r\nSpringbank Primary Academy (Cheltenham)\r\nTredington Community Primary School (Tewkesbury)\r\n\r\nPlacements are arranged in discussion with trainees, depending on key stage preference, home location etc. We cannot guarantee any particular school placement, however we are always keen to work with trainees to find the right school for them. \r\n","personalQualities":"We know that outstanding teachers come from many different backgrounds and have a range of prior experiences. We welcome applications from trainees from all walks of life and recognise the different qualities and skills that they can potentially bring to the profession. Passion, resilience and a willingness to reflect and learn as a professional are however key. ","otherRequirements":"All trainees will be subject to an enhanced DBS check prior to the start of the course. Trainees with less prior experience in school may also be required to undertake a short period of work experience.","status":1,"createdAt":"2021-07-06T10:56:33.775Z","updatedAt":"2021-10-04T14:21:13.143Z","canSponsorStudentVisa":"no","cycle":"2024"}
