{"id":"5460e871-39fe-4de3-a8de-43d225b8f8b9","name":"Physical Education","code":"2YDY","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"74d64a54-5e34-4590-b6c7-528dd0cf26fe","code":"C6","name":"Physical education"}],"locations":[{"id":"f7b82502-954d-4497-ae14-42603622c6d8","name":"Pate's Grammar School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"226e9ff7-92c1-43ad-ab01-ed9a173ac0d7","code":"1ZB","name":"Odyssey Learning Alliance"},"accreditedBody":{"id":"e6c26d28-03d4-443c-9b65-5db7e183966c","code":"G48","name":"Gloucestershire Initial Teacher Education Partnership (GITEP)"},"profPost":"BO","degreeGrade":"0","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"financialSupport":"For the most up to date advice, visit Get Into Teaching (Funding your training). You may be eligible for a  loan while you study – note that you’ll have to apply for undergraduate student finance.\r\n\r\nGITEP does operate a hardship fund for trainees experiencing financial difficulties. They are supported by Gloucestershire Association of Secondary Headteachers Ltd, a charity dedicated to supporting teacher training and professional development in Gloucestershire schools. The trustees of GASH Ltd, who are all secondary headteachers, are aware that the decrease in bursaries means that some trainees will find training difficult financially and have increased the amount available to our hardship fund. Any awards made do not have to be repaid. The fund is limited and discretionary and we cannot guarantee that an award will be made. Applications can be made at any point in the programme.\r\n","aboutCourse":"Our programme mirrors GITEP’s 3 phases:\r\n\r\n1.\tExplore\r\nExplore covers induction and parent placement 1. Three weeks of taught GITEP professional studies in September are followed by three weeks of school induction, exploring the application of education theory in the context of the parent school. After October half-term, assessed teaching time gradually increases, to 9-11 hours a week by Christmas. In addition, trainees continue to explore aspects of subject pedagogy with their subject leaders and mentors. The PGCE assignment focuses on special educational needs and disabilities. Trainees will explore the differing needs of pupils and how teachers adapt their practice to include them in learning.\r\n\r\n2.\tEmbed\r\nEmbed covers the twin placement, taking place between Christmas and Easter. This gives trainees the opportunity to embed their practice in a different school context, a contrasting one as far as possible. Trainees will be encouraged to try new approaches and to be more creative as they look to embed their learning from Explore. Assessed teaching time increases to 11-13 hours a week. The PGCE assignment focuses on short to medium term planning, giving trainees the opportunity to reflect on their subject learning and embed this in their planning.\r\n\r\n3.\tEnhance\r\nEnhance covers parent placement 2, from Easter to June. Trainees return to a familiar environment with the opportunity to really progress and enhance their practice. The placement aims to give a better understanding of the big picture, with longer term planning and use of a variety of assessment techniques. Assessed teaching time increases to 13-15 hours a week. The PGCE assignment will focus on researching an area of interest within the subject curriculum, enhancing trainees understanding of subject pedagogy.\r\n\r\nSubject pathway\r\nSubject sessions take place weekly with the subject leader and other trainees in your subject. These sessions focus on exploring current issues in your subject, developing practical teaching strategies and subject expertise for teaching.\r\n\r\nOdyssey Professional Studies\r\nTrainees attend 'Odyssey Professional Studies' with all Odyssey trainees.  These sessions revisit concepts introduced in GITEP professional studies and provide some opportunities for unique and beneficial cross phase working with primary colleagues. \r\n\r\nAssessment\r\nTrainees complete the above three assignments, supported by school-based training managers and subject leaders.  The programme leads to a PGCE awarded by the University of Bristol, with 60 Master’s level credits. No training takes place at the University - subject tutors from the University will visit the GITEP sessions.   \r\n\r\n\r\n","interviewProcess":"All interviews are held in Alliance schools. Your interview will have 3 parts.\r\n\r\nPart 1: General Interview\r\n\r\nThis will be a panel interview, made up of staff from partner schools and a representative from GITEP.  We will look to explore with you your reasons for wanting to teach.\r\n\r\nPart 2: Subject Knowledge Interview\r\n\r\nThis will be an interview with a subject specialist and will explore where your current subject knowledge strengths and weaknesses lie. \r\n\r\nPart 3: Lesson \r\n\r\nWe will ask you to prepare (in advance) a short lesson to deliver to a group of students. \r\n\r\n","howSchoolPlacementsWork":"All trainees will undertake placements in 2 schools following a ‘parent/twin/parent’ structure. Trainees are placed in a “parent” school from October to December, a contrasting “twin” school from January to March and return to the “parent” school from April to June. Placements are 9-10 weeks in length.\r\n\r\nEach school has a training manager, responsible for overseeing all the trainees within the school, and trainees are allocated a mentor, a subject specialist who will see them most days and meet with them individually once a week to review their training and plan next steps.\r\n\r\nWorking alongside GITEP, our partner schools are:\r\n- Pate's Grammar School, Cheltenham\r\n- Sir Thomas Rich's Grammar School, Gloucester\r\n- Tewkesbury School, Tewkesbury\r\n- Barnwood Park School, Gloucester\r\n\r\nPlacements are arranged in discussion with trainees, depending on grammar/comprehensive preference, home location etc. We cannot guarantee any particular school placement, however we are always keen to work with trainees to find the right school for them. All trainees must undertake at least one placement in a comprehensive school - it isn't possible to qualify as a teacher in the UK by completing 2 grammar school placements.\r\n","personalQualities":"We know that outstanding teachers come from many different backgrounds and have a range of prior experiences. We welcome applications from trainees from all walks of life and recognise the different qualities and skills that they can potentially bring to the profession. Passion, resilience and a willingness to reflect and learn as a professional are however key. ","otherRequirements":"All trainees will be subject to an enhanced DBS check prior to the start of the course. Trainees with less prior experience in school may also be required to undertake a short period of work experience. Subject Knowledge Enhancement may be offered if appropriate. ","status":1,"createdAt":"2021-07-06T10:56:34.602Z","updatedAt":"2021-10-04T10:39:10.990Z","canSponsorStudentVisa":"no","cycle":"2024"}
