{"id":"afe4fdca-efe5-4e9e-b0d8-1904cf6b683d","name":"Primary","code":"3B2P","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"a249066a-28d3-49eb-9580-f381fe999a50","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"734e77d9-fc98-430c-b475-7264dd34be81","code":"2JZ","name":"South of Tyne Primary Alliance"},"accreditedBody":{"id":"926804ac-be7a-4f0a-97f9-a26a5f5f032a","code":"S84","name":"University of Sunderland"},"degreeGrade":"1","english":"1","maths":"1","science":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"South of Tyne Primary Alliance offers tuition fee courses to students dedicated to a future in primary teaching. \r\n\r\nYou will gain experience of all three key stages over the course of the academic year, with a focus on either KS1 or KS2 in your host class. You will track the children in the host class across the whole school year, gaining an overview of individual pupil progress and unrivalled experience of planning and assessment. The School Direct route allows students to immerse themselves in the whole life of the school and become a genuine member of the team. The alternate placement in the spring term gives experience of a different key stage, school environment and culture in one of our cluster schools. \r\n\r\nYou will be taught through lectures, tutorials, project and group work with an average of 15 university days during the year; the University will provide support with education assignments and practice based research.  Your work-based learning will be in your host and alternative school. \r\n\r\nOur alliance will provide a high quality bespoke training programme delivered by excellent and experienced teachers from across our schools. This will address what we see as the key priorities for teaching and learning with a school focussed approach. Trainees will also receive individualised support from their host school mentor and other experienced members of the school team. \r\n\r\nYou will have a school mentor and university tutor who will assess your written and project work and your teaching practice. \r\n","interviewProcess":"The interviews will take place on the site of the lead school (George Washington Primary School) with a panel of representatives from the cluster. The interview will consist some short tasks, which may vary, and an interview.\r\n\r\nApplicants will be required to bring any relevant certificates of qualifications, DBS documents and skills test information with them. \r\n","howSchoolPlacementsWork":"Trainees will be placed in one of our schools for the autumn and summer terms. In the spring term, students will be placed in a partner school for a placement in an alternate key stage and school environment. ","personalQualities":"","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:47:02.519Z","updatedAt":"2021-11-04T13:12:40.742Z","canSponsorStudentVisa":"yes","cycle":"2024"}
