{"id":"2c1f36ad-fd4b-4a78-95df-fbb35ba6d7ea","name":"Music","code":"H555","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"24311bef-8673-41fb-933c-53f887fb6976","code":"W3","name":"Music"}],"locations":[{"id":"547b32da-7251-4745-81fb-06fbb3ef72df","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"4b833e5f-01f5-4306-aed0-cdf0c8db9fa3","code":"2B5","name":"Hillingdon SCITT"},"degreeGrade":"2","additionalDegreeSubjectRequirements":"false","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Please contact Hillingdon SCITT for further information.","courseLength":"OneYear","feesUK":7050,"feeDetails":"£7,050 is the fee for QTS (accredited by Hillingdon SCITT) \r\n\r\n","financialSupport":"The following types of funding available for teacher training.  The type of funding available will depend upon your circumstances.  \r\n\r\n- Tax free Bursary (only available for certain subjects)\r\n- Tuition Fee Loan \r\n- Maintenance Grant\r\n- Additional financial support if you are a parent or have a disability","aboutCourse":"During the initial teacher training year Hillingdon SCITT Trainees will not only learn about pedagogy in general but they will also learn about subject specific pedagogy.  Hillingdon SCITT Trainees will be trained to teach 2 consecutive Secondary Key Stages (KS3 and KS4) in their chosen subject.  Trainees will also experience some KS5.  Simultaneously Trainees will also be given the opportunity to improve and expand their subject knowledge. During the training year, Trainees will also have the opportunity to teach a 2nd subject of their choice.\r\n\r\nAll Trainees will spend 4 days a week in school.  This will comprise of teaching, being observed and receiving feedback, observing and learning from experienced colleagues as well as professional development.  The 5th day will be a Professional Learning day with Hillingdon SCITT, which will be held at Bishop Ramsey CE School (which is where Hillingdon SCITT is based) and will be delivered by highly experienced and skilled practitioners.  As part of their Professional Learning, Trainees will undertake an Action Research Project of their choice (which will be the main task for QTS).  \r\n\r\nTrainees will experience teaching in 2 different Partner Schools.  Trainees will also have the opportunity to observe teaching and learning in other educational settings eg. Special Schools, Pupil Referral Unit and Primary Schools. Whilst on placement, the amount of lessons that a School Direct Fee Funded (unsalaried) trainee will be expected to teach is incremental according to each training phase.  A teaching timetable will be created that is bespoke to teach trainee based upon their prior experience and readiness to teach.  \r\n\r\nThroughout the year, Trainees will have a designated Mentor/Coach supporting them as well as, Phase and Subject Leads from Hillingdon SCITT.  In order to achieve QTS, all Trainees at calendared intervals throughout the year will be assessed against their mastery of Hillingdon SCITT's Professional Learning Curriculum followed by the Teachers' Standards at the end of the course.\r\n\r\n\r\n\r\n","interviewProcess":"In conjunction with the Lead School, Hillingdon SCITT will co-ordinate the recruitment process.\r\n\r\nThe recruitment process will involve between half a day and a full day being spent at one of the Partner Schools, which is likely to be your main placement school for the duration of the training year.  \r\n\r\nThe recruitment day will include:-\r\n\r\n- Teaching a lesson or working with a group of students which will be observed by a qualified teacher (you will be told in advance about the content of the lesson and the age group you will be teaching).\r\n\r\n- A short presentation (applicants will be given the information prior to the interview for this).\r\n\r\n- English and Maths tests.\r\n\r\n- An interview (the panel will consist of representatives from Hillingdon SCITT and the Partner School).\r\n\r\n- There may also be the opportunity to talk to staff and pupils and possibly a tour of the school.\r\n \r\nIt is a rigorous and thorough process, designed to get the best match of applicant to the places available\r\n\r\n","howSchoolPlacementsWork":"During the training year Trainees will teach in 2 different Partner Schools. Trainees will be spend the majority of the year in one main placement school (where they were interviewed).  The 2nd placement is for the duration of 6 weeks, whereby Trainees will be placed in a contrasting school. The majority of our Partner Schools are located in Hillingdon, with others in neighbouring boroughs. \r\n\r\nOur Partner Schools have excellent public transport links including buses and the National Rail network (underground and overground).  Full directions to the schools in the Partnership can be found on their websites. Central London is within easy reach. \r\n","personalQualities":"We are looking for ambitious applicants who are passionate, enthusiastic, committed and have a desire to share that with children and young people of all abilities.","otherRequirements":"Successful applicants will be subject to:-\r\n\r\nTeachers' and Others Prohibited from the Profession check\r\nSection 128 Barring Directions\r\nEhanced Disclosure Barring Service Checks\r\nChildcare Disqualification Declaration Check\r\nHealth Screening\r\nSafeguarding References\r\nInternational Checks","status":1,"createdAt":"2021-07-13T13:27:14.074Z","updatedAt":"2021-09-22T13:32:14.207Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
