{"id":"f3bc2f05-0939-41b1-85ee-6890f3776133","name":"English","code":"3D9X","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3aed1aa8-ae46-4b68-92bb-a6cc20655c59","code":"Q3","name":"English"}],"locations":[{"id":"81b420e4-2107-46df-aaa0-a7304e790b13","name":"Main Site","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"4b833e5f-01f5-4306-aed0-cdf0c8db9fa3","code":"2B5","name":"Hillingdon SCITT"},"profPost":"BO","degreeGrade":"1","additionalDegreeSubjectRequirements":"false","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Please contact Hillingdon SCITT for further information on equivalency tests.","courseLength":"OneYear","feesUK":null,"aboutCourse":"During the initial teacher training year Hillingdon SCITT Trainees will not only learn about pedagogy in general but they will also learn about subject specific pedagogy.  Hillingdon SCITT Trainees will be trained to teach 2 consecutive Secondary Key Stages (KS3 and KS4) in their chosen subject.  Trainees will also experience some KS5.  Simultaneously Trainees will also be given the opportunity to improve and expand their subject knowledge. During the training year, Trainees may have the opportunity to teach a 2nd subject of their choice.\r\n\r\nAll Trainees will spend 4 days a week in school.  This will comprise of observing and learning from experienced colleagues, teaching, being observed and receiving feedback, as well as professional development.  The 5th day will be a Professional Learning day with Hillingdon SCITT, which will be held at Bishop Ramsey CE School (which is where Hillingdon SCITT is based) and will be delivered by highly experienced and skilled practitioners.  As part of their Professional Learning, trainees will undertake an Enquiry Based Research.\r\n\r\nTrainees will experience teaching in 2 different Partner Schools.  Trainees will also have the opportunity to observe teaching and learning in other educational settings eg. Special Schools, Pupil Referral Unit and Primary Schools. Trainees will be expected to teach in incremental according to teach training phase.  A teaching timetable will be created that is bespoke to teach trainee based upon their prior experience and readiness to teach.\r\n\r\nThroughout the year, Trainees will have a designated Mentor/Coach supporting them as well as, Phase and Subject Leads from Hillingdon SCITT.  In order to achieve QTS, all Trainees at calendared intervals throughout the year will be assessed against their mastery of Hillingdon SCITT's Professional Learning Curriculum followed by the Teachers' Standards at the end of the course.\r\n\r\nTrainees who meet requirements of the PGCert for Brunel University will have the opportunity to take this alongside the QTS (QTS is accredited by Hillingdon SCITT).  There will be 3 assignments for this during the training year.\r\n\r\n","interviewProcess":"In conjunction with the Lead School, Hillingdon SCITT will co-ordinate the recruitment process.\r\n\r\nThe recruitment process will involve between half a day and a full day being spent at one of the Partner Schools, which is likely to be the main placement training school for the duration of the training year.  \r\n\r\nThe recruitment day includes:\r\n\r\n- Teaching a lesson or working with a group of students which will be observed by a qualified teacher (applicants will be given the information in advance about the content of the lesson, the duration and the age group that they  will be teaching).\r\n- A short presentation (applicants will be given the information prior to the interview to prepare for the presentation).\r\n- English and Maths tests.\r\n- An Interview (the panel will consist of representatives from Hillingdon SCITT and the Partner School)\r\n- There may also be the opportunity to talk to staff and pupils and possibly a tour of the school. \r\n\r\nIt is a rigorous and thorough process, designed to get the best match of applicant to the places available.\r\n","howSchoolPlacementsWork":"During the training year, Trainees will teach in 2 different Partner Schools. Trainees will spend the majority of the year in the main placement school (where they were interviewed).  The 2nd placement is for the duration of 6 weeks, where Trainees will be placed in a contrasting school.  The majority of our Partner Schools located in Hillingdon with others in neighbouring boroughs.\r\n\r\nOur Partner Schools have excellent public transport links including buses and the National Rail network (underground and overground).  Full directions to the schools in the Partnership can be found on their websites. Central London is within easy reach. \r\n\r\nBrunel University is located in Uxbridge, North-West London.  The nearest underground stations is Uxbridge, from which it is about 15 minutes' walk from the Main Site Campus or a short bus ride.\r\n\r\n\r\n","personalQualities":"Hillingdon SCITT are looking for ambitious applicants who are passionate, enthusiastic, committed and have a desire to share that with children and young people of all abilities.\r\n\r\nThe salaried route is more suitable for applicants who have worked in schools with children.  Therefore, such applicants should be familiar with how teaching and learning takes place within schools.\r\n","otherRequirements":"All successful applicants will be subject to:\r\n\r\n- Teachers and Others Prohibited from the Profession Check\r\n- Section 128 Barring Directions\r\n- Enhanced Disclosure Barring Service Checks \r\n- Childcare Disqualification Declaration Check\r\n- Health Screening\r\n- Safeguarding References\r\n- International Checks\r\n\r\n\r\n","status":1,"createdAt":"2021-07-06T10:50:42.840Z","updatedAt":"2021-09-17T14:53:44.938Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"Applicants will be paid on the Unqualified Teachers Pay Scale, which will be determined by each Partner School.  Applicants are welcome to discuss their salary during the interview.\r\n\r\nThe cost of the PGCert is £2100. \r\n\r\nThe cost of the QTS will be paid by the applicants employing school.\r\n\r\n"}
