{"id":"c8db2059-d587-49df-aff9-ec25cc705193","name":"Primary (with Mathematics)","code":"3822","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"286cf12f-b3e3-41c5-9f33-2ff7807d2df0","code":"03","name":"Primary with mathematics"}],"locations":[{"id":"38320c21-0cee-44ca-8cbd-e970ea51ec04","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"d6961000-f4b7-41cb-9dbd-4da057d9057d","code":"K84","name":"Kingston University"},"profPost":"PG","degreeGrade":"1","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We accept equivalency tests from the following centres. Please note there is a charge for the test - see website for further details.\n\nhttps://www.equivalencytesting.com/\n\nhttps://astarequivalency.co.uk/","courseLength":"OneYear","feesUK":9250,"feesInternational":15000,"aboutCourse":"As a PGCE Primary with Mathematics trainee you will gain expertise in Mathematics pedagogy alongside knowledge and understanding of the wider primary curriculum for pupils age 5-11.  The course will enable you to become an effective, inclusive and evidence formed teacher. It has been re-designed to address the changing nature of teaching and learning in primary schools. The three modules taught provide excellent preparation to gain Qualified Teacher Status (QTS) and achieve a PGCE qualification. \r\n\r\nYou will spend time on a number of placements in school to develop your own practice. The experience in schools is transformative allowing you to develop as a practitioner with support from mentors who themselves are trained to help you develop your own style as a teacher.  \r\n\r\nOne of the key elements of our course that trainees feel defines their experience at Kingston is the excellent support they receive from tutors and school based mentors on placement. We believe that this is a key factor in the success trainees have in gaining their award of QTS and the PGCE as well as finding employment. \r\n\r\nThe course provides professional development to deliver understanding of how theory and practice are closely intertwined using current research. The course produces independent, informed and reflective practitioners. The three PGCE modules studied are:\r\n \r\n1) Professional Studies - this module covers core subjects; English, Maths and Science. It also includes an element called the Creative Practitioner covering the foundation subjects and linked to the two week placement in school entitled 'Creative Practitioner Weeks'. This module also includes assessment of your School Experience. \r\n\r\n2) Reflective Teacher (Masters level) - this module covers the importance of reflection as a teacher and helps you develop your practice in a range of key aspects of teaching from behaviour management to child development and teaching children with special needs. \r\n\r\n3) Policy, Practice and Professionalism (Masters level) - this module examines the role of research and supports your understanding of teaching and learning to develop practice in the classroom. \r\n\r\nThe two Master level modules contribute 60 credits towards a Masters of Research in Education which can be completed at Kingston University. This can be undertaken at a later point in your career as a teacher as a form of continuing professional development. \r\n\r\n","interviewProcess":"If you meet the initial criteria of the course, you will be invited to interview. Currently these are taking place remotely via Microsoft Teams.   Prior to your interview, you will be expected to complete a task which involves recording a 5 minute video and submitting the link to the university 24 hours in advance of your interview. Further details of this exercise will be provided in your invitation.\r\n\r\nThe online interview session can take up to 2 hours and will involve a formal interview with a tutor from our Education team. During your interview, your awareness of current issues in secondary education; passion for teaching your subject and understanding of the National Curriculum will be explored. \r\n\r\nFollowing your formal interview, you will be expected to complete a timed written task. Candidates applying for the maths pathway will also undertake a maths task to assess suitability. ","howSchoolPlacementsWork":"You will spend a minimum of 120 days in school to develop your own practice. These include: \r\n\r\n1) An introductory week in September one week before you start the PGCE course observing classroom practice. The 5 days school experience form part of the 120 days school requirement and you will need to organise this yourself.\r\n\r\n2) Two separate weeks (October & January) in a Professional Development School focusing on phonics, inclusion and assessment. \r\n\r\n3) An eight week block placement in the Autumn term (October to December) where you will be formatively assessed. \r\n\r\n4) A Target Development Week (January) for you to work on the main targets emerging from your first Block Practice \r\n\r\n5) Creative practitioner Weeks (February/March) where you will develop knowledge, skills and understanding in planning and resources for teaching and learning. \r\n\r\n6) A nine week block placement  (March to June) with a final assessment at the end contributing towards the overall award of QTS.  \r\n\r\n","personalQualities":"We actively seek to encourage trainee teachers from a diverse range of backgrounds and ages, who bring with them a wide variety of experiences, which they can draw upon, share with each other and develop further during the year. \r\n\r\nPostgraduate trainee teachers are encouraged to work closely together, sharing good practice and supporting each other during a challenging and exciting year. Our trainees are expected to be enthusiastic, committed, independent and self-motivated and to show a willingness to extend their studies beyond that presented in taught sessions","otherRequirements":"DBS & Medical Check clearance and receipt of outstanding qualification certificates.","status":1,"createdAt":"2021-07-06T10:56:14.140Z","updatedAt":"2021-09-29T13:40:36.321Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
