{"id":"38514931-4dd1-476f-aa56-16861dac4e2a","name":"Economics","code":"A590","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"cd9159fc-869f-4188-8435-3374676d6e92","code":"L1","name":"Economics"}],"locations":[{"id":"03b2fdfe-385b-4951-beea-2a44fc42ba03","name":"Main Site","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"992ef501-0c7a-45de-b5cb-6747af563dcb","code":"1CW","name":"City Excellence in Teaching"},"accreditedBody":{"id":"252d7e03-741e-4453-b6a8-3d361e6c9d1b","code":"E69","name":"e-Qualitas"},"english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","aboutCourse":"Our Economics School Direct Salaried programme is an innovative employment based route that is delivered in the heart of a rejuvenated East London. City Excellence in Teaching (CET) is an immersive experience that is perfect for you if you are looking to learn while you earn. You will work within our partner schools, and become part of a larger community of committed professionals. You will be part of the team. \r\nThe salaried route is a fast track route into teaching. You begin on day one with some of your own classes, and you are mentored by our high calibre subject specialists to develop the craft of teaching through your classroom practice. Throughout the year you take on more classes as your confidence grows. This route is perfect for career changers or those who have been working in schools in other roles. \r\nWe are looking for candidates who are passionate about working in an inner-London context and see the teaching of Economics as significantly contributing to the life chances of young people. \r\nWe work with e-Qualitas who provide subject training days outside of your in school experience, and you are supported through online learning tools. Our salaried trainees love the autonomy they have over their training. \r\nWe offer supplementary training through our ‘Enhanced Professional Studies’ programme. These sessions bring trainees together from across our cluster and builds a network of professionals who have chosen to train to teach in inner London schools. These training sessions ensure that you are prepared to meet the challenges, and make the most of the opportunities, that this unique context brings. \r\nAnother great benefit of this course is that you choose the school that you would like to apply to. We have 7 schools in our cluster and you can research them in advance and then after you submit your application we will ask you which are your top 3. We then send your application to the school that you choose. \r\nWe look forward to you joining our vibrant community of teachers to have a lasting impact on the lives of young people. \r\nFor more information about the partnership with e-Qualitas please visit their website here: https://www.e-qualitas.org.uk/\r\nTo find out more about our offer please go to our website: www.cityexcellenceinteaching.co.uk\r\n","interviewProcess":"Stage1: Your application form is received by Mulberry School for Girls, as the lead school for the City Excellence in Teaching partnership. If you meet the requirements for entry then our administrator will contact you to tell you which schools have vacancies for the salaried route and to ask you which schools you are interested in. Once you confirm this, the potential ‘employing school’ will consider your application and let you know if you are being invited to stage one of the selection process. This will be held at the ‘employing school’. \r\nThe Stage 1 process includes:\r\n•\tDelivering a teaching sequence\r\n•\tA written task\r\n•\tA panel interview\r\n\r\nAt Stage 1 we are looking to see that you have the potential to be a successful trainee teacher. We want to know why you are interested in teaching in inner London, and what drives your passion for teaching. \r\nIf you are successful in stage one of the selection process you will be recommended to e-qualitas.\r\n\r\nStage 2: e-Qualitas hold stage 2 of the selection process. They will set you pre-training activities to complete and will conduct a school visit, meeting you at your employing school. \r\nExamples of pre-training activities can be found here: https://www.e-qualitas.org.uk/applying-to-train \r\n\r\n","howSchoolPlacementsWork":"As a School Direct Salaried trainee you will begin your training at the start of the academic year. The programme runs for one year and you achieve QTS only at the end of it. e-Qualitas have options for you to study for a PGCE in your NQT year if you would like to. Our schools employ you as a member of teaching staff through this programme and so salaries are set by the employing school. You teach a timetable at the school that is reduced to support you in your in your training. You will complete most of your year in your employing school, becoming very much part of the school. You will be mentored by subject specialists who are practising teachers in the schools as well as by experts from e-Qualitas.\r\nYou will complete a 6 week placement in a contrasting school. There is a lot of diversity within our cluster of schools. One benefit of applying to train to teach through us is that you know that all of your placements will be within a pre-defined local area. This offers you security and means that you can research the schools in advance. You will experience teaching in different settings and this will deepen your understanding of inner-city learning contexts. Our cluster includes primary and secondary schools and so there is an opportunity to teach for a short period in a different phase. \r\n\r\n","personalQualities":"-Ability to engage interest and communicate your own enthusiasm for you subject\r\n-Good subject knowledge and a commitment to professional development if necessary\r\n-Commitment to working with young people in an inner-city context\r\n-Ability to explain ideas clearly and to think on your feet\r\n-Evidence of good interpersonal skills\r\n-Awareness of current educational issues\r\n-Ability to reflect and respond to professional critique\r\n- Good organisation skills\r\n-A desire for social justice and a belief in the power of education to change lives. \r\nOur website provides a snapshot of our offer and what life is like as a CET trainee: www.cityexcellenceinteaching.co.uk \r\n\r\n","otherRequirements":"• Salaried applicants must have work experience. This could be in schools or in industry. The recommendation is 3 years, but this is flexible depending on the type of experience and how relevant it is to the subject you wish to teach. In secondary ‘shortage’ subjects 18 months of work experience is considered.\r\n• All successful applicants will need to complete a DBS check (Disclosure and Barring Service) to vet the background of persons working in schools. \r\n\r\n","status":2,"createdAt":"2021-07-06T10:53:53.203Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"School Direct (salaried) trainees are employed by a school and paid a salary as a teacher. A grant from the DfE contributes to the cost of your employment and covers the training costs. You do not have to pay to train through this route. The salary varies depending on your experience. You will be paid on the unqualified teacher scale, which for inner London starts at £19,893 and extends to £29,088. \r\nSalaries should be discussed with your employing school directly. \r\n"}
