{"id":"b2a5795d-e93d-48d9-a6c8-c77c9cbe040d","name":"Primary","code":"2VRD","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"14df8ec2-fa66-4f13-9846-346847621a8b","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"56e5442b-b4aa-4b0b-b437-f88103606b10","code":"1D7","name":"Teach North East"},"accreditedBody":{"id":"b384b008-59e2-461e-a15f-3551d1165c1e","code":"N77","name":"University of Northumbria at Newcastle"},"profPost":"PG","degreeGrade":"1","english":"1","maths":"1","science":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"financialSupport":"Financial support for trainee teachers has never been better. You could get up to £30,000 tax-free while you train, either as a bursary or prestigious scholarship – or you could earn a salary of up to £25,000 while you train on a School Direct (salaried) course. \r\n\r\nYour eligibility for financial support, and the amount you can expect to receive, will depend on the subject you choose to teach and your degree classification or highest relevant academic qualification.\r\n\r\nFor more information on student finance, course fees and loans, please visit-\r\n\r\n[https://www.gov.uk/student-finance] or\r\n[https://getintoteaching.education.gov.uk/bursaries-and-funding]\r\n","aboutCourse":"The training you receive will take place at both your host school and the University of Northumbria. You will attend some training sessions at the University of Northumbria and will be taught via lectures, seminars, tutorials, project work and group work. Generic training will be at a variety of primary schools that work within our alliance. Work-based learning will be in placement schools where you will be trained in a supportive and aspirational environment.\r\n\r\n You will complete two teaching placements in contrasting school settings and in different age phases. Your host school will be the school where you spend most of the year and where you will undertake most of your teaching commitments. You will also carry out a second placement during the spring term in one of our partner schools dependent on your individual needs.\r\n\r\nIn addition, you will have the opportunity to spend a day in a special school and a day in a secondary school, thus affording all trainee teachers a comprehensive range of training experiences across all ability and age ranges, irrespective of your age phase.\r\n\r\nYou will be assigned a Mentor who will be an experienced member of staff within the age phase you are teaching. You will also have the support of a Professional Tutor who is also an experienced member of the staff at your placement school. Our Mentors and Professional Tutors are fully trained and have experience of mentoring trainee teachers.\r\n\r\nYou will be assessed with written work, some of which contributes towards Master's credits. In addition you will be assessed throughout your teaching practice. All School Direct trainee teachers are assessed against the Teachers’ Standards in order to be recommended for the award of Qualified Teacher Status (QTS). This School Direct (Tuition) Post Graduate Certificate of Education qualification awards you Qualified Teacher Status (QTS), which you need in order to teach in any school in England and Wales.\r\n","interviewProcess":"If successful at the application stage, you will be invited for interview. This will involve a half a day spent at one of our partner schools. The day is a rigorous selection process where you will be required to teach a 30-minute observed lesson. There will also be a series of tasks including group and written ones, designed to show off your strengths. You will be told in advance about the content of the lesson and the age group you will be teaching as well as any other relevant information to enable you to demonstrate your skills and qualities. At this early stage, we are looking for applicants to demonstrate their future potential as teachers.","howSchoolPlacementsWork":"You will complete two teaching placements in contrasting school environments. Your host school will be where you spend most of the year and where you will undertake most of your teaching commitments. You will be in your host school from September through to December. You will then carry out a Second Placement which will be in one of our partner schools dependent on your individual needs assessed in the first term and based on the experiences you have already had from your host placement school. Your second school placement will be from January to Easter. After you have completed your Second School Placement you will return to your host placement school to complete an enhanced placement until the end of June. Across the course of the year there are once weekly training days that take place at Northumbria University, Mortimer Primary or one of our primary partnership schools.","personalQualities":"We are looking for enthusiastic applicants with very good communication skills, determination to succeed, a commitment to working hard and the ability to work with others. Successful applicants are confident and passionate about teaching and also able to contribute to the wider school ethos and community. Training to teach is challenging and rewarding. Developing excellent interpersonal skills will enable trainees to work with groups of young people from diverse backgrounds. We are looking for people who strive to improve and are committed to their own professional development, and  who are proactive, independent and team players willing to act upon advice.","otherRequirements":"All entrants will go through an enhanced Disclosures and Barring Service (DBS) to ascertain that they have no criminal background preventing them from working with children. \r\n\r\nAll successful applicants must submit an Occupational Health form. Entrants are required to satisfy interviewers that they possess the physical and mental agility necessary to meet the strenuous demands of teaching. This does not preclude entrants with disabilities from applying who give every indication of becoming competent and valued members of the teaching profession.   \r\n","status":1,"createdAt":"2021-07-06T10:50:38.700Z","updatedAt":"2021-10-06T11:29:02.986Z","canSponsorStudentVisa":"yes","cycle":"2024"}
