{"id":"4374ba8c-3890-4bf2-bf11-3652062557ec","name":"Modern Languages (French, German and Spanish)","code":"2ZY8","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"e34fd2a3-a32e-44e9-aea1-666badf3ac03","code":"22","name":"Spanish"},{"id":"ce8523ef-9236-4cd9-b260-d826c7a521b3","code":"ML","name":"Modern Languages"},{"id":"fbb00c08-2dbc-4f26-adb3-3b23afba18c1","code":"17","name":"German"},{"id":"9727f674-61ba-4efa-b1f2-21ec7e354442","code":"15","name":"French"}],"locations":[{"id":"b9f4f6ae-4e70-45e3-a2e2-29060fc1f0ec","name":"Wilmington Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"2b2154ae-2be6-465a-b85a-d1a01c3a1528","name":"Leigh Academy Blackheath","isPublished":"N","status":"S","vacancies":"F"},{"id":"0e465277-c82d-4f5e-a1bb-f870dbbcb1ec","name":"The Leigh Academy","isPublished":"N","status":"S","vacancies":"F"},{"id":"dab0ebf6-ee04-49ac-8423-148f4d7269ab","name":"The Leigh UTC","isPublished":"N","status":"S","vacancies":"F"},{"id":"f3c22084-9695-4cc0-ab95-edbce18b241f","name":"Strood Academy","isPublished":"N","status":"S","vacancies":"F"},{"id":"0f4fb0b6-2e10-42d1-bab0-3b2fed1dd00d","name":"The Halley Academy","isPublished":"N","status":"S","vacancies":"F"},{"id":"4c2c6dcf-7f0b-42b7-926e-d3fbedede7d9","name":"Stationers' Crown Woods Academy","isPublished":"N","status":"S","vacancies":"F"},{"id":"5c64cb6f-cc1f-498f-9c9a-ce6a56756e05","name":"The Hundred of Hoo Academy (Secondary Phase)","isPublished":"Y","status":"R","vacancies":"F"},{"id":"43edd3f0-9e60-4177-99e2-79502ee81132","name":"Longfield Academy","isPublished":"N","status":"S","vacancies":"F"}],"trainingProvider":{"id":"cdd7b762-efe3-4663-b9f1-f7289982f311","code":"24Q","name":"The Leigh Academy"},"accreditedBody":{"id":"757d0dca-c7a9-43c8-8c3b-96c0a81539b6","code":"K30","name":"Kent and Medway Training"},"degreeGrade":"9","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We accept Level 2 in English and Maths only.\n\nLevel 2 in Literacy and Numeracy are not accepted.","courseLength":"OneYear","feesUK":7100,"feesInternational":7100,"feeDetails":"The fee of £7,100 is the cost for all trainees leading to Qualified Teacher Status (QTS) only. This fee is payable by all non-salaried trainees but payable by the home school for salaried trainees.\r\n\r\nFor those wishing to 'top up' their qualification to the full Professional Graduate Certificate in Education (PGCE) a further £1,950 (subject to change)  will be payable to the University of Leeds Beckett who are our PGCE accredited body. This fee is payable by both salaried and non-salaried trainees.","financialSupport":"Find out about any financial support in terms of tax-free bursaries, tuition-fee loans or maintenance loans at the Get Into Teaching Website:\r\n[Get Into Teaching] (https://getintoteaching.education.gov.uk/funding-my-teacher-training)","aboutCourse":"The course begins on the first day of your home school's INSET training with the rest of the teaching staff (typically in the last week of August), integrating you into the staff body, and will continue until the middle of June. This is so you can begin working in July in those schools that offer an early start. You will also have a six-week placement in a contrasting school to help to broaden your experience.\r\n\r\nYou will be in schools four days a week where you will be involved in observations, teaching, staff training, parents’ evenings, school meetings, extra-curricular clubs: all the facets of a teacher’s school life. On Thursdays, you will have your pedagogical training with KMT that provides a mixture of specific Subject Studies, looking at aspects of teaching your specialism, and the more general Professional Studies sessions, which have a holistic approach to educational practices. \r\n\r\nYou will be supported by a network of established professionals, including a Subject Mentor in your school, usually a subject specialist, your Professional Tutor, your KMT Lead Mentor and Hub Director as well as the other teachers and trainees in your school. You will have a weekly mentor meeting to allow you to discuss any issues and organise support you may need.\r\n\r\nTo begin the year, you will observe lessons, developing into leading small parts of a lesson or working with small groups, and building until you are teaching 60% of a full timetable. You will be supernumerary, meaning there will always be a qualified teacher in the room with you. You will focus on teaching KS3 and KS4 but may also get the opportunity to teach some KS5. You will be formally observed once a week in order to receive feedback and make progress.\r\n\r\nThroughout the year, you chart your development and record your skills through a Progress Tracker and Reflective Practice Assignments. At the late stage of your traning, you are being assessed against the [Teachers' Standards] (https://www.gov.uk/government/publications/teachers-standards). \r\n\r\nFor those wishing to obtain the Professional Graduate Certificate in Education (PGCE) as well as QTS, you can top up your qualification by completing additional assignments if you decide to complete the Evidence Informed Practice offered through distance learning with Leeds Beckett University (at an additional cost).\r\n\r\nThere are a number of LAT networking events to provide you with more support including a graduation event at the end of the year.","interviewProcess":"A structured interview forms a core part of every recruitment process. Non-salaried trainees will be required to give a presentation to the interview panel following instructions that will be provided within the interview invitation, based on a hypothetical lesson. For salaried trainees an interview involving planning and teaching a lesson to a class will be required as part of the suitability assessment criteria.\r\n\r\nA training provision checklist will be provided to candidates prior to the interview for them to read through. A short period of time will be allocated at the start of the interview to allow the candidates to ask any questions they may have in relation to the training provision offered by Kent and Medway Training (KMT).\r\n\r\nSuccessful interviews have a clear structure which helps keep the panel objective and focused throughout. However, this must allow flexibility and the necessary freedom for skilled interviewers to use probing, supplementary and additional questions as required to ascertain the candidate's resilience and dedication to teaching.\r\n\r\nAn interview format should cover:\r\n• initial meeting between the candidate and the Hub Director to discuss the training provision;\r\n• an introductory opening when the interview panel joins;\r\n• a schedule of questions which are asked by panel members;\r\n• space for candidates to raise any issues or ask their own questions;\r\n• the close of the interview, explanation of what will happen next;\r\n• Maths and English proficiencies will be checked.\r\n\r\nIf the candidate is successful at interview, a conditional offer will be made.","howSchoolPlacementsWork":"You will have a ‘Home’ school which is where you will spend the majority of your training year, between September and January, and Easter and June. You will be learning how to teach your subject by slowly building up to teaching full lessons and then building up your number of lessons. You will be supported by  a mixture of expert teachers.\r\n\r\nYou will also have a six-week placement in a contrasting school. For example, from a non-selective to a Grammar School or a single-sex school to a mixed school. This will usually take place between February and Easter.","personalQualities":"If you answer 'yes' to the following statements, you have the soft-skills that we are seeking; \r\n* I am seeking a career that promotes creative thinking\r\n* I enjoy working with children/young adults and have a passion to improve their lives\r\n* I am patient with a calm demeanour \r\n* I can multi-task when in a distracting environment\r\n* I am open-minded and adaptable \r\n* I strive to find solutions when faced with a problem\r\n* I am a confident public speaker \r\n* I have a genuine passion for my subject\r\n* I have excellent time management and organisational skills\r\n","otherRequirements":"Leigh Academies Trust is committed to safeguarding children and successful applicants will be subject to an Enhanced DBS check.  Our commitment to safeguarding is underpinned by robust selection processes and pre-employment checks which are in place across the Trust.","status":1,"createdAt":"2021-07-06T10:57:26.450Z","updatedAt":"2021-09-15T10:31:15.388Z","canSponsorStudentVisa":"no","cycle":"2024"}
