{"id":"2092dc88-fa5a-49a9-ada9-10252ba856c5","name":"Primary","code":"2P6Q","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"c63bdfa1-890f-4a41-abc7-d162ffb9f937","name":"Sherburn Hungate Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"baf6fb5f-8d44-4040-9e35-f42f473fd4f1","name":"Appleton Roebuck Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"851d6f5c-a9dd-47b8-b368-3a6bae831903","name":"Monk Fryston Church of England Primary","isPublished":"Y","status":"R","vacancies":"F"},{"id":"31e3b01f-2c8a-46ef-bdc4-0e9ba6269d34","name":"Kellington Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"d19d994f-34f3-48c1-9de8-0f85b5e8dd3c","name":"Athelstan Community Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"b3d01962-9d80-4ef6-ae2a-4b6c04095495","name":"South Milford Primary","isPublished":"Y","status":"R","vacancies":"F"},{"id":"f1fae98b-fa0f-4456-af42-58fbdb6c1154","name":"University of Hull","isPublished":"Y","status":"R","vacancies":"F"},{"id":"4f47016e-6a57-4247-ac5a-ba2bf8e3f6cb","name":"St Mary's Catholic Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"7814dbbc-6430-44e0-a28d-16f70e5f7d8c","name":"Carlton in Snaith Community Primary School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"dff68315-f882-43de-9781-40b458d43b52","code":"26D","name":"STAR Alliance"},"accreditedBody":{"id":"0bc933b8-dad9-4149-8bb2-fd2041d567c2","code":"H72","name":"The University of Hull"},"profPost":"PG","degreeGrade":"1","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"Candidiates will need to complete equivalency tests approved by the University of Hull","courseLength":"OneYear","feesUK":9250,"feesInternational":12800,"feeDetails":"Please contact the Professional Education Team on 01482 465974/466933 for information on Fees for 2018/19\r\n\r\nIf you are an International student from a non-EU country you will be charged the standard overseas student fee.\r\n\r\nTraining bursaries are available for some subjects for all UK and EU postgraduate teacher trainees. For information visit the following website for information.\r\n\r\n[http://www.education.gov.uk/get-into-teaching/funding/postgraduate-funding] (http://www.education.gov.uk/get-into-teaching/funding/postgraduate-funding)","aboutCourse":"This one-year course is designed to prepare you for teaching children in the 5 to 11 age range.\r\n\r\nMost of the programme is spent on two block school placements supported by academic input from the University. We aim to advise you of your specific school placements in July 2021, all our placement schools will be in or around Sherburn-in-Elmet, Tadcaster & Selby.\r\n\r\nOur programme prepares you to confidently and effectively teach across the primary curriculum using a variety of strategies which can be applied in different types of schools, taking account of the stages of children's development. \r\n\r\n You’ll graduate with a PGCE & Qualified Teacher Status (QTS). \r\n\r\nYou’ll be given a foundation in the full range of subjects that make up the primary school curriculum, with particular emphasis on the core subjects – English, Mathematics and Science.\r\n\r\nYour studies consist of five key areas:\r\n\r\nEnglish – looking at the various strategies which can be applied in different types of schools, with some weekly English sessions taking place in local schools\r\n\r\nMathematics – build the confidence of your own mathematical ability as well as gain the knowledge and skills to teach mathematics effectively\r\n\r\nScience – develop your own knowledge and understanding of science, as well as the pedagogical skills best suited to facilitating children’s effective learning of science in the classroom\r\n\r\nFoundation subjects – art, design and technology, geography, history, information and communication technology, music, physical education and religious education\r\n\r\nProfessional studies – Develop an understanding of a wide range of general issues related to the profession, including safeguarding, child development, curriculum planning and assessment, teachers’ legal responsibilities, behaviour management and record planning\r\n\r\nTheory Assessment is based on a series of coursework assignments at Masters level. There are two subject-focused assignments, one for English and one for mathematics, and the third piece of work is related to themes presented in the professional studies course. \r\n\r\nAs well as University academic assignments assessment takes place in your placement schools to support the award of QTS.  Your teaching ability will be assessed against achievement of the Teachers' Standards and will be  based on performance as a teacher in the classroom.\r\n","interviewProcess":"OUR STANDARD ASSESSMENT PROCESS IS DETAILED BELOW. HOWEVER, DEPENDING ON  THE COVID PANDEMIC SHORTLISTED APPLICANTS MAY BE INVITED TO AN ABBREVIATED ASSESSMENT VIA VIDEO CONFERENCE.\r\n\r\nSuccessful applicants should be prepared to spend the equivalent of a full day at one of the Alliance schools. The purpose of this is twofold:\r\n\r\n1.      Applicants are made aware on the nature and demands of the course. Each receives an outline of the current course, as well as a talk about the nature and demands of the course. Candidates also have the opportunity to ask questions of the tutors and school representatives of the partnership who are attending.\r\n\r\n2.      Applicants are given the opportunity to present themselves as having the potential to become good teachers.\r\n\r\n\r\nThe assessment  will begin with a general introduction to the School Direct course, followed by an opportunity to ask questions. \r\n\r\nAs well as having the opportunity to visit classrooms, the rest of the day comprises three formal activities:\r\n\r\n* A group task where candidates will be asked to lead a session with a small group of children. Specific details of the task will be given in the invite to interview.\r\n\r\n* An interview with School Council representatives\r\n\r\n* An interview panel with Headteachers/Senior Leaders of Alliance schools and Hull University.\r\n\r\nWe are a small Alliance which prides itself on providing high quality training experience so we will only offer a small number of places each year and therefore look for high quality candidates.\r\n","howSchoolPlacementsWork":"Trainees work in two different schools during the year; a main placement (MP) in Autumn & Summer term, and a contrasting placement (CP) in Spring. We aim to introduce you to both your placement schools in July 2022 - giving you plenty of time to plan ahead. \r\n\r\nBy working in partnership with about 20 primary schools in the STAR Alliance as well as other local schools, we offer experience in schools of different sizes and types.  We try to take account of personal circumstances when organising placements, but the prime objective is  providing a range of experiences, equipping you to teach competently in any type of school. \r\n\r\nFor each placement, you have a University School Direct tutor offering support and guidance, as well as a school mentor, to monitor and assist  your development on a day-to-day basis.  School Direct tutors and mentors work together closely to ensure the best possible outcomes for all trainees.\r\n\r\nAutumn Term:\r\nStarts with a short induction period at your MP, followed by  a block of taught provision at university. Thereafter, you are in your MP complementing your initial university-based sessions by providing opportunities to work with children and enabling you to meet with experienced teachers to explore a wide range of key issues. Gradually increasing responsibility for teaching groups or whole classes until the final few weeks of term which are 100% school based when you will teach the full class for at least 1 lesson a day,  \r\n\r\nSpring Term\r\nYou will undertake a CP in with another age group of pupils. Your whole-class teaching load grows to 50% encompassing  all primary curriculum subjects, with an emphasis on English and mathematics.  In the latter weeks, you return to university for a block period of further workshops, lectures and tutorials.\r\n\r\nSummer Term\r\nBack in your original MP, continuing to teach whole classes across a range of subjects, but with an  increased teaching workload of 70-75%.\r\n\r\nOne final day at university to discuss your ECT Profile with  personal supervisors, providing  targets to take into  first year of teaching as an Early Career Teacher (ECT).\r\n\r\n","personalQualities":"As an Alliance we look for the very best of candidates.\r\n\r\nWe look for a good reference and a strong commitment to primary education: \r\n\r\n- An ability to motivate and inspire children of all abilities\r\n\r\n- Energy and enthusiasm\r\n\r\n- Effective interaction with children\r\n\r\n- An ability to work under pressure\r\n\r\n- Perseverance and flexibility\r\n\r\n- Oral and written communication skills\r\n\r\n- The ability to work co-operatively\r\n\r\n- An awareness of current educational issues\r\n\r\n- A broad subject-knowledge base\r\n\r\n- Reflection, self-evaluation and a willingness to learn\r\n\r\n- Awareness of what being a primary teacher entail.\r\n\r\n\r\n","otherRequirements":"It is preferential for candidates to have some experience of working or volunteering  in primary schools, ranging  from the equivalent of a couple of weeks spent getting to know about primary school life, to employment as a child support or teaching assistant. Ideally you will provide evidence of experience in contrasting educational environments.\r\n\r\nYou will be subject to the relevant Disclosure and Barring Service checks. \r\n\r\nYou will need to demonstrate 'physical and mental fitness' to teach and  provide evidence in both respects. At present, this means you need to complete a self-disclosure form if offered a place on the programme.","status":1,"createdAt":"2021-07-12T13:48:30.103Z","updatedAt":"2021-10-18T09:44:41.763Z","canSponsorStudentVisa":"yes","cycle":"2024"}
