{"id":"f4c4a74e-e384-479b-99c9-53d9c917f767","name":"Primary","code":"2PKJ","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"c39273eb-e9e1-4029-a703-faad91608c52","name":"Bearwood Primary and Nursery School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"b724da7f-5d12-48f6-822d-5cd573883cd7","name":"Shirley Junior School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"8cc60f29-cc6c-41f0-89d7-9f72780a250b","name":"Orchard Junior School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"ce2ca0ed-7c75-4075-8012-1cb058d43e99","name":"Weston Park Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"d73a986a-0abc-4cab-b340-a73c937cc866","name":"Southampton Hospital School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"7a18ec8e-c392-40e2-947d-020282320093","name":"Harefield Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"2779753b-5c6d-4879-84d8-594b689ec9e3","name":"Glenfield Infant School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"63b980c1-9913-467e-9572-6658ea9b38d2","name":"Livingstone Road Junior School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"da8233d0-e0fe-4bc1-99d9-19b6083cb6ac","name":"Fernhurst Junior School","isPublished":"N","status":"S","vacancies":"F"},{"id":"a59b60da-f046-4f80-82f0-2b8f06540dfd","name":"Livingstone Road Infant School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"b396fa83-0eb4-4475-a4dc-116f497547cf","name":"Cadland Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"a1c327c9-6fa0-4bd1-ab50-deae34f7a1fd","name":"Townhill Infant School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"7a07fbef-2b18-497e-9318-2851399054ce","name":"Sholing Infant School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"629d3bd9-4cb1-45f5-88ed-bd1ae3cc7836","name":"Beechwood Junior School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"f266223b-d7d0-4f2c-8abb-826fafad2165","name":"Bishop Aldhelm's CE Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"f506c117-2c40-4b08-b78c-81c1bbac06a6","name":"Wordsworth Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"3da65916-4999-4e53-8c00-d164974e474d","name":"Thornhill Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"3e26da45-509f-44a6-89e3-1b8ed4c5a0b4","name":"Sholing Junior School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"6040105c-1a32-4b6c-b5e5-bfa1ecad5cf1","name":"Talbot Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"69b7a6d7-a677-47bc-b8ce-673b815e2107","name":"Hollybrook Infant School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"6df3c758-24c1-4a6d-be04-a9cb13e5e921","name":"Ludlow Infant Academy","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"2f568a3c-413d-4daa-b8b2-b120e3886a4c","code":"26U","name":"Hamwic SCITT"},"profPost":"BO","degreeGrade":"0","english":"1","maths":"1","science":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"To start primary or secondary initial teacher training, you will need to have a degree or equivalent qualification. Ideally, you will have a 2:1 or higher classification but if your degree outcome is a 2:2, please get in contact so that we can discuss your application further.\n\nYou will also need:\n\nEnglish GCSE grade 4 (C) or above\nMaths GCSE grade 4 (C) or above\nScience GCSE grade 4 (C) or above if you want to teach in primary education\nIf you do not have the required GCSEs or you have overseas qualifications, you will need to show that you have an equivalent level of education. We will ask you to arrange to take and pay for an equivalency test prior to making you a confirmed offer.","courseLength":"OneYear","feesUK":9000,"aboutCourse":"Hamwic SCITT (School Centred Initial Teacher Training) is part of Hamwic Education Trust, one of the largest multi-academy trusts in the South of England. This means you will have all the support you need.\r\n\r\nWe are committed to providing you with the opportunity to train in a range of school contexts. We have partnership schools across five local authorities – Portsmouth, Hampshire, Southampton, Poole and Dorset.\r\n\r\nPrimary QTS with PGCE + 60 masters credits with Bath Spa University (5-11 age range)\r\n\r\nCourse length: 1 year (full-time)\r\nCourse starts: September\r\n\r\nOur course brings together a wealth of expertise from all of our partner schools, complemented by experienced teacher educators. You will join a true learning community where the staff and students alike are interested in reflecting and researching the pedagogies of teaching and learning, whilst always striving for excellence.\r\n\r\nOur Primary QTS with PGCE allows you to train inside the classroom alongside experienced teaching professionals in one of our Partnership Schools. It offers a practical school-centred teacher training programme, which is delivered in tandem with academic theory..\r\n\r\nAlongside this practical school-centred training you will learn academic theory, provided by Bath Spa University.\r\n\r\nHamwic SCITT and the quality of our training will help support you throughout your teaching career and there are progression opportunities in Hamwic Trust schools.\r\n\r\nOur partnership schools are committed to supporting you to become a skilled, versatile primary teacher who places young people at the heart of all you do.","interviewProcess":"All successful applicants are invited to attend an interview prior to an offer being made.\r\n\r\nInterviews take place throughout the year and are held at different Partnership Schools, attended by senior leaders from those schools.\r\n\r\nThe interview is a four-part process that takes roughly half a day. There are a range of activities that interviewees need to undertake including a presentation, formal interview, working with children and a written activity.\r\n\r\nAfter a successful interview, Hamwic SCITT may make you an offer to study with us.","howSchoolPlacementsWork":"Right from the start, our trainee teachers are in the classroom learning the profession and gaining real teaching experience while being guided by dedicated teaching mentors. Your development is also supported by SCITT tutors, who are often senior leaders or head teachers in the school. They champion your growth and refine your teaching skills to help ensure a strong start to your teaching career.\r\n\r\nOur comprehensive training programme covers all the professional skills and theory that trainee teachers need in order to deliver high-quality teaching. You gain experience of working in your preferred age range and in an alternate key stage, and in at least two constrasting schools. In addition, there are enrichment activities including spending time in a variety of settings such as secondary and early years, and special schools to provide a genuine breadth of experience.\r\n\r\nTrainees are in school Monday to Thursday and then on Friday, you have a centre-based training session which focuses on academic theory, curriculum and national priorities.\r\n\r\nAs you build your teaching experience, knowledge and skillset, you steadily increase your teaching time. By the end of your final placement, you are teaching 80% of the timetable.\r\n\r\nTrainees are placed in two different schools. Hamwic SCITT has a number of Partnership Schools situated in and around Hampshire and Dorset. You cannot pick which school you want to be in, but we try to place you in a school you can commute to easily.\r\n\r\nYou start your training in your preferred age group and then in the second term move to the alternate key stage. In the third term you return to your first placement.","personalQualities":"We are looking for trainees who  want to make a real difference to children's lives and understand the crucial role education plays in transforming future life chances.  \r\n\r\n","otherRequirements":"All trainees will be asked to complete a range of safer recruitment checks prior to beginning the programme. We are only able to make you a conditional offer once all of these checks are completed.\r\nAfter you have submitted your application, you may be contacted to provide copies of your supporting documents. These could be your degree certificate and evidence of your GCSE qualifications or equivalent.","status":1,"createdAt":"2021-07-06T10:54:48.906Z","updatedAt":"2021-09-17T13:07:01.956Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
