{"id":"5a22202d-56bc-42e8-914f-8df380ed236c","name":"Primary","code":"35SQ","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"4_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"4ae4f108-c6a4-49bc-8a1a-df151520c85c","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"2ce8b3b9-fd20-471d-9de4-c60f691b124b","code":"2F8","name":"Salford Alliance of Learning Schools"},"accreditedBody":{"id":"9d03acb4-95ce-41e1-8458-0b4bec147b6b","code":"M20","name":"The University of Manchester"},"profPost":"PG","degreeGrade":"0","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Salford Alliance of Learning Schools are an alliance of ten schools that offer a comprehensive training package for all of our trainees.  The lead school being Moorside Community Primary School.\r\n\r\nThe course offers:\r\n* Intensive support from experienced teachers and school mentors.\r\n\r\n* The chance to train in at least two of our good, diverse schools within our alliance.\r\n\r\n* 131 days spent on placement, observing, planning and teaching.\r\n\r\n* The chance to become part of a team from the day you begin your teacher training journey.\r\n\r\n* A well planned programme of foundation and professional studies learning.  The alliance delivers 18 days of training by experienced teachers within the alliance.\r\n\r\n* Attending Manchester University in line with the expectations as specified on their website.\r\n\r\nThroughout the year you will be very well supported by mentors and key staff within each school you are placed.  We are committed to developing the next generation of outstanding teachers.  You will spend the majority of your time within schools either at specific training days led by the school’s specialist leaders or in the classroom gaining ‘hands on’ experience.\r\n\r\nThe schools within our alliance and the needs of our pupils are diverse, but we are united in one common theme:\r\n\r\nA belief that we can make a difference.\r\n\r\nIf you believe that you can make a difference, then join us to be the change.\r\n","interviewProcess":"The interview process will consist of three parts:\r\n\r\n•\tA teaching task\r\n•\tA presentation\r\n•\tA formal interview\r\n\r\nTeaching Task:\r\nYou will be asked to source a book of your choice, to read to a group of Pupils.  Your group will consist of six children and after you have read your chosen story to them, you will be expected to deliver a guided discussion about the text.\r\n\r\nPresentation:\r\nPrior to the interview, you are required to plan a short presentation for the interview panel.   This will be an assessed part of the interview.  The presentation should last no more than 5 minutes and audio-visual aids will not be available. \r\nPresentation title:\r\n‘What are the skills and attributes of an effective teacher?’\r\nReflect on your recent experience in school and your own experience as a pupil in order to gather information for your presentation.  \r\nIn your presentation, you may wish to consider some of the following:\r\n•               Why certain teacher(s) stand out as ‘effective’\r\n•               Lesson organisation and classroom environment\r\n•               Communication skills\r\n•               Effective teaching and learning strategies \r\n•               How the individual needs of all pupils were met\r\n•               How a positive ethos and working relationships were established\r\n•               How will this influence you as a new teacher?\r\n\r\nFormal Interview:\r\nYour interview will last approximately 30 minutes.  You will be interviewed by a panel of 2/3 Head Teachers from within the alliance.\r\n","howSchoolPlacementsWork":"Each school within our alliance has its own set of unique and diverse qualities that are shared within the alliance whichever school the trainees are based in for their placements.\r\n\r\nAs well as attending the ten different schools within our alliance for structured training days each trainee will spend quality time within the classroom and this will be in at least two of our alliance schools over the year.  The two main placements will provide each School Direct candidate with a range of teaching experience ranging from Nursery to Year 6.\r\n\r\nWith our School Direct programme, trainees will begin their journey at the lead school of the alliance on the first day of term in September for an induction day.  This will mean that they immediately feel part of the group of schools that will guide them on their teacher training journey.  This will also give the students a chance to meet the other students that are also taking part in the Salford Alliance of Learning Schools School Direct programme.  Trainees can be placed in any two of the schools within the alliance and will always have a key mentor at the schools that they are based.\r\n","personalQualities":"Salford Alliance of Learning Schools are looking for passionate, well-motivated candidates who are looking to inspire a new generation of children in our community through their exceptional teaching.  We are looking for candidates who are personable, friendly, have a strong work ethic, have a positive outlook and can communicate well and show confidence within a classroom environment.","otherRequirements":"Offers will be subject to a successful interview, and are conditional of DBS (a Disclosure and Barring Service check).","status":1,"createdAt":"2021-07-06T10:47:33.798Z","updatedAt":"2021-09-22T15:26:04.797Z","canSponsorStudentVisa":"yes","cycle":"2024"}
