{"id":"01c763f8-31d5-42c3-935d-666917311247","name":"Primary 5 -11","code":"AW13","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"700687f3-ad15-4cdf-a572-1f802cf37f84","name":"Boarshaw Primary","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"4750085b-4a49-4ffa-8a40-e9c2082d2011","code":"2LJ","name":"Boarshaw Community Primary School"},"accreditedBody":{"id":"812b70c4-7fc4-46fc-975b-3e4d00f77dc4","code":"M40","name":"The Manchester Metropolitan University"},"profPost":"PG","degreeGrade":"1","english":"1","maths":"1","science":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feesInternational":9250,"aboutCourse":"The main training placement for this particular post will be at one of the PiraMidd Partner schools in Middleton, Manchester. We are part of Rochdale MBC.\r\nThe placement of at least 28 weeks, split into different phases, will begin with observations in your main placement school and across our diverse group of schools. The course will be front loaded with a lot of the theory you will need to be successful in the classroom delivered in the first term. You will then be given the opportunity to apply this knowledge in the classroom with small groups and whole classes.\r\nYou will be assessed at key points throughout the year. Your teaching will be observed and you will gather evidence from a range of different sources to show how you are meeting the Teacher Standards.\r\nThroughout your training from September to July you will have a personalised programme of support from a Subject Mentor and a Professional Mentor. Their role is to facilitate your development as a teacher and build on your strengths, expertise and subject-knowledge. You will be encouraged to continually reflect upon your practice, identifying your strengths and implementing strategies to improve your practice further.\r\nIn addition, you will meet periodically with your subject tutor and will be enrolled on the MMU PGCE. Training with PiraMidd also affords the opportunity to experience working in a Nursery School and the opportunity to have an extended placement in a special school. ","interviewProcess":"We are looking for talented graduates who have the enthusiasm, passion and resilience that being an outstanding teacher requires. Teacher training is a challenging programme and we are looking for the commitment that will ensure that trainees complete the year successfully and go on to have outstanding careers.\r\nExcellent subject knowledge is expected, along with the ability to communicate this effectively to people of all ages and abilities. We understand that some applicants will have less experience but some time in schools, either working or observing would be beneficial.\r\nAbove all, we are looking for applicants who have a genuine enthusiasm for working with young people, along with the drive to become an outstanding teacher.\r\nAll applicants who demonstrate that they meet the eligibility criteria will be considered.\r\nThe PiraMidd ITT Recruitment Board will shortlist and invite successful applicants for interview. The interview may include:\r\na small group activity lead by you, a pre prepared presentation, a chance to meet with pupils, literacy/numeracy tasks followed by a formal interview during which you will the opportunity to ask questions about our course. ","howSchoolPlacementsWork":"The main training placement for this particular post will be at one of the PiraMidd Schools.\r\nThe placement of at least 28 weeks, split into different phases, will begin with observations and very soon, you will be given the increasing responsibility for teaching groups of learners, whilst also gaining understanding of a teacher's pastoral responsibilities.\r\nYour second placement of approximately seven weeks, will give you the opportunity to develop your teaching in a contrasting school within the Partnership. Here you will develop the skills from your host placement school and adapt them to the needs of different groups of learners in a different environment.\r\nYou will then return to your host school where it will enable you to consolidate any of the Teacher Standards which you need to develop further. As part of our offer, there is an opportunity to undertake a placement in a Special School. ","personalQualities":"We are looking for inspirational graduates who have the ambition to become the school leaders of the future. We want aspirational trainees who will embrace the  opportunities we offer and be committed to personal  development and life-long learning. Teacher training is a challenging programme and we are looking for the commitment and resilience needed to ensure that trainees complete the year successfully.\r\nExcellent subject knowledge is expected as is the ability to communicate effectively. \r\nWe understand that some applicants will have less experience but some time in schools, either working or observing would be beneficial.\r\n","otherRequirements":"All successful applicants will undertake a DBS check and a Health Check which determines ‘fitness to teach.'","status":1,"createdAt":"2021-07-06T10:49:47.080Z","updatedAt":"2021-10-12T10:56:33.004Z","canSponsorStudentVisa":"yes","cycle":"2024"}
