{"id":"e05b7c50-5b5c-4810-9b94-e2f9a84e0d08","name":"Primary","code":"AK25","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"other","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"344c6870-d7f2-40e4-b8a5-934fbdbf764c","name":"Two Mile Ash ITT Partnership","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"fd33ecd3-914a-4497-8dee-183a82bf2db9","code":"2AF","name":"Peter Pan Training Partnership"},"accreditedBody":{"id":"6e6c8aa3-8d77-4c7d-af3c-4c7912b1cc2a","code":"T89","name":"Two Mile Ash ITT Partnership"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We do not offer equivalency tests ourselves, but do accept from a number of providers. \nPlease note if you are applying for an Apprenticeship route, equivalency tests are not accepted, you must study for functional skills tests instead.  Apprenticeship routes are available through Two Mile Ash ITT Partnership.","courseLength":"OneYear","feesUK":9250,"feesInternational":9250,"financialSupport":"You may be eligible for a loan while you study.\r\n\r\nFind out about financial support if you’re from outside the UK.","aboutCourse":"THIS IS OUR GENERAL PRIMARY (5-11) PGCE PROGRAMME\r\n\r\nFOR EARLY YEARS PGCE (3-7) PLEASE SEE COURSE  AK28\r\n\r\nYou will spend time in school every week, which allows application of theoretical learning to your classroom practice. Training is front-loaded to the Autumn term, which means more time in school during the Summer term, to prepare you for being a fully-fledged NQT. Whilst in school, you will observe successful teachers; teach children in small groups up to whole classes; plan and deliver learning to children (with coaching and mentoring from your expert School Based Trainer) and join in with school-led training opportunities.\r\n\r\nWe assess your skills as teachers by judging your impact on the outcomes for the children you are teaching. You will present information for assessment in written formats, portfolios, presentations and tutorial discussions. All assessments are continuous throughout the year through individual tasks and group projects.\r\n\r\nCore Training takes place through our accredited provider, Two Mile Ash ITT at their dedicated training centre and provides inspirational, hands-on training from safeguarding to subject knowledge; behaviour management to building resilience; time management to stress management, and much more.  Training days provide an opportunity for the cohort to share experiences, while learning from our expert trainers. These sessions provide you with ‘headspace’ and an opportunity to reflect on teaching as well as learning new skills and pedagogies to take back to school.\r\n\r\nFor the PGCE element of our programme, you will work towards 60 Master-level credits awarded by Birmingham City University.  All BCU lectures and seminars are delivered in Milton Keynes by experienced BCU academic staff.  The combination of higher level academic study with the hands-on, practical nature of our school-led programme gives you the perfect balance of theory and practice, making for well-rounded, informed and inspirational teachers. The PGCE requires three written assignments, which are assessed and moderated by the team at BCU.\r\n\r\nPlease note this is a School Direct tuition fee programme.  If you have the requisite experience and come with the financial backing of a school, then you can consider the Postgraduate Teaching Apprenticeship programme, which is available through Two Mile Ash ITT Partnership.\r\n\r\n\r\n","interviewProcess":"Our interview process has been adapted currently to ensure safe practice and will initially be conducted online. When invited to interview, full details will be shared at that point, about the adaptations that we have made.\r\n\r\nPlease don’t worry about the interviews – we want to working with you to understand your motivations for teaching and are looking to see if you have the potential to train to teach – you don’t already have to be able to teach! The teaching activity evidences how you engage and interact with children and this gives us an idea of your potential to train. Things can sometimes go wrong with interview or the teaching activity with the children, again don’t worry, because you will be given an opportunity to reflect on things that you would do differently another time.\r\n\r\nRemember, learning to teach is a journey and you can be really successful from whatever starting point you have, whether you are a Teaching Assistant who has been in school for many years or someone with very little classroom experience. Our interview process is designed to explore that with you.\r\n","howSchoolPlacementsWork":"All our Partnership schools are selected on the basis of their effectiveness and expertise. The Partnership thrives because of the active role that schools take in the design and delivery of the programme and because of their commitment to training teachers in their schools.\r\n\r\nYou can train for either Early Years (age 3-7) or General Primary (age 5-11). You will be immersed in the school from the outset, meaning that you 'live and breathe' real-life teaching and become a valued member of the school team. You will spend most of the year in your ‘home school’, with a 6 week placement in an alternative school and alternative key stage, as well as a short time in a special school and/or a nursery school. Your School-Based Trainer will mentor you during the year, which means your programme is bespoke to you, resulting in you being the best teacher you can be!\r\n\r\n","personalQualities":"The most important personal quality for teaching is wanting to create opportunities for young people to learn new skills and develop their understanding of the world. Successful teachers co-operate, collaborate and work on their own initiative. The ability to make good, professional relationships with children is paramount to being a successful teacher and we value the individuality of our trainees. It is important that you have thought about training to teach and found out what the role of a primary teacher involves. You may have visited or worked in schools, this is not a requirement although it is helpful.","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:47:34.298Z","updatedAt":"2021-07-28T08:52:28.449Z","canSponsorStudentVisa":"no","cycle":"2024","applicationsOpenDateOther":"2021-10-30T00:00:00.000Z"}
