{"id":"5167297c-6026-4e70-bf5a-dbad40239545","name":"Primary","code":"2QNW","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"59df3682-abfb-4051-90eb-16e13f850b78","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"47e901b7-dceb-4e52-a94b-5447e5ac5e61","code":"27E","name":"Stafford Primary Schools’ Teaching Partnership"},"accreditedBody":{"id":"0a682589-92ed-447b-b564-6958b3b02b41","code":"S72","name":"Staffordshire University"},"degreeGrade":"1","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Welcome to Stafford Primary Schools’ Teaching Partnership.  Our School Direct programme is delivered in partnership with Staffordshire University who is our ITT (Initial Teacher Training) provider. Our programme is a carefully thought out blend of classroom experience, university led training and school led training.\r\nAs a trainee within the Stafford Primary Schools’ Teaching Partnership, you will be provided with a professional mentor who will support you within every aspect of your learning journey.  In addition to this, you will be able to access the support of a link mentor from another school who will arrange training and networking opportunities.  The schools within the Stafford partnership have strong links and work closely alongside each other to support associate trainees to develop strong subject knowledge and pedagogy. \r\nAs a trainee within this partnership, you will be provided with the knowledge, understanding and skills to become an effective classroom teacher who inspires the children within their class to develop a love of learning and be the best they can be. \r\nAlongside classroom practice, you will be assessed via written assignments.\r\n","interviewProcess":"Following an initial screening to ensure your application meets our entry requirements, applications will be considered by the course leader. Successful applicants at this stage will be offered an interview consisting of a series of questions relating to teaching and learning and an analysis of a short, filmed  teaching input.  \r\n","howSchoolPlacementsWork":"There will be 2 placements in contrasting schools.   Each placement will last at least 60 days. One placement will be in KS1 and one will be in KS2.\r\nWe select placements from within our partner schools, with whom we work closely and have strong links.\r\nAssociate Teachers have a phased introduction to teaching that will reflect your personal needs. Initially you will observe the regular teacher, help with group work and then move towards sharing classes with the teacher before eventually taking classes yourself. As well as teaching, you will be required to contribute generally to the life of the school.","personalQualities":"We are looking for associate teachers who have a passion for teaching at the primary phase and who are committed to providing the best possible learning experiences for children. Enthusiasm for working as part of a team is an extremely helpful quality as this will lead to the best possible school-based experiences. We expect our associate teachers to be reflective so that they can learn from their own experiences, as well as the professionals who support them throughout their PGCE learning. High level communication skills are also essential.","otherRequirements":"Successful applicants will also be required to:\r\nComplete a medical questionnaire, which will be assessed by an Occupational Therapist\r\nProvide an Enhanced Disclosure Certificate from the Disclosure and Barring Service (application can be obtained through the University)\r\n","status":1,"createdAt":"2021-07-06T10:50:52.876Z","updatedAt":"2021-11-08T13:00:42.523Z","canSponsorStudentVisa":"yes","cycle":"2024"}
