{"id":"a2ed3d03-a757-4ece-bbc2-dd9b34d71a09","name":"Religious Education","code":"2JJ6","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"724b5d16-28dd-4431-bc17-ea4be4daedc4","code":"V6","name":"Religious education"}],"locations":[{"id":"5909693a-0db1-4e79-9e14-dbf81d11fb67","name":"Hereford Sixth Form College","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"bf7c5b93-5368-4baa-9514-cb500cccc68c","code":"22V","name":"Hereteach Alliance"},"accreditedBody":{"id":"6019b3ce-f2f6-4b0e-b2a9-5813d74c4d54","code":"W80","name":"University of Worcester"},"profPost":"PG","degreeGrade":"1","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feesInternational":13700,"feeDetails":"Every course has day-to-day costs for essential books, stationery, printing and photocopying.\r\n\r\nTravel costs for placements vary depending on the location of schools and your mode of transport, sometimes these may be reclaimed depending on your individual circumstances.\r\n\r\nWe organise occasional visits to increase subject knowledge. Travel costs are at your own expense but we do encourage car sharing. In addition there is sometimes a fee but this is not normally more than £20 in total.\r\n\r\nIn addition, we encourage you to join subject specific associations. The cost is typically between £25 to £50 for which you benefit from their support, guidance and resources.\r\n\r\n","aboutCourse":"Structure of the Course\r\nThe structure of the course is one which combines both pedagogical knowledge with classroom experience to develop trainees throughout the year. The course has subject specific sessions at the university spread throughout the year, combined with school experience based in 2 school placements.\r\nThe course combines both academic based assignments and practical teaching experience. The teaching placements are in 2 schools spread over the academic year.\r\nThe assignments range from professional studies to subject specific and students are able to submit at Masters Level.\r\nAssessment\r\nThe assessment of the course is through written academic assignments, and the completion of two successful Teaching Placements. \r\nThe course operates under the Postgraduate Regulatory Framework which sets out the full regulations for passing modules, grading of modules, retrieving failed modules, progression from one academic level to the next, requirements for awards, and how the award is classified.\r\nAll student teachers are initially registered for the Professional Graduate Certificate in Education (PGCE). This is a course of 120 credits at level 6. In December student teachers may apply to be registered on the Post-Graduate Certificate in Education (PGCE (M)) where up to 60 M-level credits can be gained from subsequent work. Thus the PGCE (M) will result in 60 credits at level 6 and 60 at level 7\r\nAssignment A: Developing Learning and Teaching (3000 words equivalent) You will produce a high quality and creative resource that shows a systematic understanding of some of the key aspects of teaching and learning in your subject.\r\nAssignment B: Evidence Informed Teaching (3000 words equivalent) The assignment is in 2 parts:\r\nPart 1 is a critical literature review of current research relating directly to the key theme you have selected; Part 2 is a presentation that seeks to use an evidence informed approach to evaluate the potential impact that the literature review will have on learning and teaching in your classroom.\r\nRecommendation for QTS.  A completed professional portfolio will provide the evidence for this module. The portfolio is in three sections:\r\n•\tPebblePad – the repository for key compliance documentation \r\n•\tWeekly Reviews – reflections on the impact teaching is having on learning, and Transition plans – periodic target setting and review of progress\r\n•\tViva voce – a summative assessment of the Teachers’ Standards \r\nIt is necessary to pass all assessments.\r\n","interviewProcess":"Applicants will be required to attend two interviews: one with Hereteach Alliance and one with the University of Worcester.\r\nThe Hereteach Alliance interview will be conducted at one of our partner schools and will involve a 30 minute teaching episode, full details of which will be given in advance.\r\nCOVID 19: during the current circumstances interviews are being held jointly online.","howSchoolPlacementsWork":"School Placements\r\nYou will have two Placements throughout the year.\r\nYour main school will be your first placement covering the autumn and summer term with a second placement in the middle covering the spring term. We have 15 partner schools; the majority are Secondary Schools teaching 11-16 but we also have Sixth Form and Special Schools. \r\n\r\nProfessional Studies\r\nThe school element will also consist of a programme of professional studies and subject studies across the partnership, and will be integrated into the University Professional studies programme. These will be overseen by professional mentors who will have the overall responsibility for the management of the provision, ensuring that student teachers have full access to the appropriate age and ability range. Subject mentors are responsible for providing a programme which will involve individual and collaborative teaching and weekly mentor support.\r\n\r\nYour timetable for the course will start with University based work and then progress to school based work.\r\n\r\nThroughout both placements trainees will have both subject and professional studies sessions in the university.\r\n\r\nYour timetable within the school settings will be incremental.\r\n\r\nPlacement 1: Starting with collaborative work and observation and with 25% teaching to 50% by the end of the placement combining both collaborative and solo teaching.\r\n\r\nPlacement 2: Incremental teaching from collaborative to solo teaching with maximum of 50% solo teaching through to the end of placement 2.\r\n\r\nThe course will provide you with the opportunity to work alongside teachers and colleagues who can offer examples of good and outstanding practice, advice and support during training. There will also be the opportunity to develop the knowledge, understanding and skills to become a very effective teacher.\r\n\r\n\r\n","personalQualities":"We are looking for trainees who are: \r\n\r\n* skilled and inspirational subject specialists\r\n* confident and reflective practitioners\r\n* effective communicators who can work in partnership\r\n* informed intellectuals who promote a love of learning\r\n* resilient professionals able to demonstrate high standards of personal conduct\r\n\r\nSchool experience is desirable, but not essential prior to an interview. At interview we will discuss relevant prior school experience or opportunities you have had to work with school-aged children. At this point that we will discuss with you whether additional school experience would support you in deciding that teaching is right for you.\r\n\r\n","otherRequirements":"Health and Physical Capacity to Teach:\r\nThe DfE requires all trainees to satisfactorily complete a medical questionnaire to demonstrate their fitness to teach. People with disabilities or chronic illnesses may have the capacity to teach, just as those without disabilities or medical conditions may be unsuitable to teach. \r\n\r\nDBS:\r\nAll entrants to ITT programmes will be subject to appropriate pre-selection checks, including disclosure and Barring Service (DBS), criminal records checks and children's barred list information.\r\n","status":1,"createdAt":"2021-07-06T10:52:13.274Z","updatedAt":"2021-09-16T11:40:23.182Z","canSponsorStudentVisa":"yes","cycle":"2024"}
