{"id":"08f77315-eb0f-4995-9c54-4331b63713ac","name":"Lifelong Learning (Pre-Service)","code":"R227","qualification":"pgde","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","subjectLevel":"further_education","isSend":"no","subjects":[{"id":"9de4b2d2-5739-4c34-92d2-9b4384760298","code":"41","name":"Further education"}],"locations":[{"id":"c9fb7e5b-164f-4f17-b0a1-5db32c9818a0","name":"Northern College","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"791f82c8-19fd-4339-9c7b-301dee8067ce","code":"H60","name":"University of Huddersfield"},"profPost":"PG","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"Degree is to be related to your specialist area.","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":16000,"feeDetails":"You can apply for a tuition fee loan as part of your application to Student Finance England for loans and grants. Student Finance England will pay your fees direct to the University.\r\n\r\nYou don’t have to pay the loan back while you study. It will only be repayable when you have left the course and earn over £25,000 a year.\r\n\r\nWhen you enrol we will ask you who will be paying for your fees and whether you have requested a loan. If you have not taken the loan, we will send you an invoice for the fees, which will require payment in full during the relevant academic year.\r\n\r\nIf you are an international student coming to study at the University of Huddersfield, please visit the International Fees and Finance (https://www.hud.ac.uk/international/tuition-fees/) pages for full details of tuition fees and support available.","aboutCourse":"If you’re looking to progress into a career teaching in the Lifelong Learning Sector, including sixth form and further education colleges, adult education and a wide range of other training and educational settings, then this course could be ideal for you. We welcome applicants with industrial skills and/or relevant academic qualifications and a passion for teaching and training others.\r\n\r\nUpon successful completion of this course, you’ll be eligible to proceed, following a process of professional formation through the Society for Education and Training to gain Qualified Teacher Learning and Skills (QTLS) status. This is the full professional status for teachers in the Lifelong Learning Sector. \r\n\r\nThe course gives you the opportunity to concentrate on your own subject area, in addition to your subject specialism you may be required to embed core subjects including English, Maths, Digital Literacies and SEND into your teaching and Learning.\r\n\r\nThe focus of this course is on practical teaching. You’ll have the opportunity to gain experience of learning and teaching alongside other professionals with support from tutors and work-based mentors. You’ll be supported to develop the necessary skills to become an effective teacher.\r\n\r\nYou’ll be taught through a wide range of teaching and learning methods and you’ll have a personal tutor who’ll be assigned to you throughout your studies to support your ongoing development. There’s a wide range of assessment activity including the creation of resources to support learning, seminars, lectures and presentations.\r\n\r\nA significant amount of your learning takes place whilst on placement within our partnership institutions. You’ll have the opportunity to benefit from being able to observe experienced teachers, gain practical hands-on experience and to be mentored to help you develop into a successful and effective teacher.\r\n\r\nYou’ll also have access to our extensive professional and academic network, which feeds directly into course design and delivery, and to excellent facilities and specialist equipment.\r\n\r\nPlease note: \r\nThis course is available at Northern College (taught jointly with students on the CertEd qualification) and is also available through the Education and Training Consortium (http://consortium.hud.ac.uk/centres/).","interviewProcess":"You will be shortlisted for interview based on your application. You’ll normally be interviewed alongside a small group of other applicants, by specialist tutors from the programme. \r\n\r\nAfter a briefing about the course, you’ll be required to complete a series of tasks to assess your suitability to teach. These activities may include group work, a short presentation and a written task. \r\n\r\nAdjustments can be made to the interview process to ensure equality of opportunity.","howSchoolPlacementsWork":"You’ll learn the practical skills of teaching through a placement in an appropriate educational institution.\r\n\r\nPrevious trainees have been placed in a range of institutions including colleges, work-based learning providers and in offender and community learning settings. You’ll complete at least 100 hours of teaching in total on placement.\r\n\r\nYour placements could be based in areas some distance from your point of study, so please be aware of potential associated travelling costs.","personalQualities":"We need to know that you have the potential to complete the course successfully and gain Qualified Teacher Learning and Skills (QTLS) status, following a process of professional formation through the Society for Education and Training (https://set.et-foundation.co.uk/home).  \r\n\r\nYou’ll be required to demonstrate your commitment to teaching in the Lifelong Learning Sector both in your application and during your interview.  \r\n\r\nWe’re committed to promoting equality of opportunity for all regardless of age, gender, ethnicity, disability and sexual orientation.  We aim to ensure that course participants are representative of the diverse society in which we live.","otherRequirements":"In addition you must also:\r\n\r\n* Provide Disclosure and Barring Service (DBS) check and health clearances.\r\n* Provide two satisfactory references.\r\n* Complete a satisfactory interview.","status":1,"createdAt":"2021-07-06T10:47:39.904Z","updatedAt":"2021-10-01T11:08:19.713Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
