{"id":"d518ae42-79e1-49f7-b6bd-1ea262da87ed","name":"Primary","code":"X105","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"3_to_7","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"600450b6-af28-4b48-8765-202ae6b378e7","name":"University of Huddersfield","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"791f82c8-19fd-4339-9c7b-301dee8067ce","code":"H60","name":"University of Huddersfield"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":16000,"feeDetails":"You can apply for a tuition fee loan as part of your application to Student Finance England for loans and grants. Student Finance England will pay your fees direct to the University.\r\n\r\nYou don’t have to pay the loan back while you study. It will only be repayable when you have left the course and earn over £25,000 a year.\r\n\r\nWhen you enrol we will ask you who will be paying for your fees and whether you have requested a loan. If you have not taken the loan, we will send you an invoice for the fees, which will require payment in full during the relevant academic year.\r\n\r\nIf you are an international student coming to study at the University of Huddersfield, please visit the International Fees and Finance (https://www.hud.ac.uk/international/tuition-fees/) pages for full details of tuition fees and support available.","aboutCourse":"If you’re striving to become a primary school teacher, then this course will help you on your way. The course focuses on developing the skills you need to teach children from ages three to eleven years and upon successful completion we’ll recommend Qualified Teacher Status (QTS).\r\n \r\nWhy Primary and Early Years Education?\r\n•\tThe course content is designed to support you to achieve the full breadth of the Teachers’ Standards by the end of your training, through a combination of university-based and school-based training. You’ll have the opportunity to gain comprehensive knowledge of the core subjects (English, Mathematics and Science), the seven areas of learning in the Early Years Foundation Stage and the full breadth of the National Curriculum.\r\n•\tWe know there’s no substitute for learning how to teach in the classroom environment, so we give you lots of opportunity to gain practical experience across our partnership schools, starting from your first term. In fact, you’ll undertake a range of longer and shorter enrichment placements every year. Your placements will be organised by our dedicated placements team alongside your academic tutors to ensure you get the experience you need. As part of your placements, you’ll be able to observe experienced teachers, gain practical, hands-on experience of classroom teaching and benefit from one-to-one mentoring. It’s all designed to help you develop your skills and achieve your potential as an inspiring primary school teacher.\r\n•\tWhile you’re studying at Huddersfield, you’ll be able to access our extensive professional and academic network, not to mention our excellent facilities and specialist equipment, including our mock Early Years and Primary classrooms designed to help you prepare for the real world of classroom teaching.\r\n","interviewProcess":"You will be shortlisted for interview based on your application. The following selection procedures are designed to assess your suitability to train to teach:\r\n\r\n* You will have an interview with a member of the course team\r\n* You will be asked to prepare and lead an activity with a small group of children in one of our partnership schools\r\n* Complete tasks designed to evaluate your fundamental English and Mathematics skills","howSchoolPlacementsWork":"A key element of your studies and learning takes place whilst you’re on placement. In Years 1 and 2, on average, trainees undertake a compulsory block teaching placement of between 6-8 weeks duration and also undertake shorter enrichment placements (also compulsory) of between 1-4 weeks per placement. The aim of these shorter placements is to focus on topics including special educational needs, behaviour management, English and mathematics. In the final Year, trainees undertake a compulsory block placement of between 12 – 13 weeks duration. In recent years students have undertaken placements in special schools, pupil referral units and in settings for children with communication needs.\r\n \r\nYour placements could be based in areas some distance from your point of study, so please be aware of potential associated travelling costs.\r\n","personalQualities":"You must demonstrate the ability to communicate effectively, and that you have the intellectual and academic capabilities to meet the required Teachers' Standards by the end of the programme.","otherRequirements":"* Offers subject to satisfactory Disclosure and Barring Service enhanced disclosure check and trainees must not previously have been barred from teaching or working with children. We also ask you to complete a health declaration to ensure that you have the health and physical capacity to teach. \r\n* You should provide two references. Where applicants have current or recent experience working with children or young people, one of the referees should be a member of staff who can comment on your potential to train to teach.\r\n* If your first language is not English, you will need IELTS 7.0.","status":1,"createdAt":"2021-07-06T10:47:39.982Z","updatedAt":"2021-10-01T11:10:43.065Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
