{"id":"5e77a2d5-5182-4f03-b511-530a62b71226","name":"Biology with Science","code":"X572","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"322cfc19-d51d-45db-91e3-bd7b4738470f","code":"C1","name":"Biology"},{"id":"ed329bbc-6bb1-481f-98f7-8815f8c4fd68","code":"F0","name":"Science"}],"locations":[{"id":"8fcc2682-df04-4ce1-9439-be5cd50e9e12","name":"Burnt Mill Academy","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"cfef1481-d5dd-443d-940a-719504468240","code":"2GY","name":"Burnt Mill Academy"},"accreditedBody":{"id":"2e1ce675-b5df-42ab-bb63-1e0435ef5722","code":"E28","name":"University of East London"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feeDetails":"DfE bursaries available for eligible candidates","aboutCourse":"Schools Direct courses are school based ITT routes. \r\nUnsalaried trainees get inducted into their 'home' schools in July and August and begin lectures at UEL in September. \r\nThe training calendar generally consists of 3 weeks at UEL in September before placements start in the 'home' schools. ITTs spend 1 day a week at UEL (education and subject based lectures, teaching and tutorials) and 4 days a week in schools 'on the job' training. \r\nReading / study weeks are built into the calendar during half terms to accommodate trainees working towards the PGCE option. UEL days are typically front loaded in Term 1 to ensure trainees are up to date early in their training.\r\nSecond placement opportunities are calendared in Term 2 in blocks to ensure trainees are immersed into school life in their contrasting school placement - they do not attend UEL during this time. \r\nTerm 2 ends with a week at UEL - for tutorial opportunities with a focus on PGCE assignments and evidence gathering linked to the Teacher Standards. \r\nIn Term 3 trainee timetables increase in their 'home' school so UEL days are again reduced. Alternative education placement visits are organised by the Teaching School to ensure trainees have been exposed to a variety of educational settings including visits to Special Schools/ Units, Alternative Provisions and Independent Schools. \r\n\r\nAlongside the training at UEL, the BMAT ITT programme runs regularly to ensure trainees are up to date with everyday pedagogy,  MAT policies and procedures and subject networks. There is a layered system of support from the classroom to MAT level which ensures our trainees are supported and developed every step of the way. \r\n","interviewProcess":"We encourage prospective candidates to come meet us and tour our schools during the application process. \r\n\r\nPlease keep up to date about our Teacher Training Open Events on our website [bmat-trust.org](http://www.bmat-trust.org/577/teaching-school-2) and on Twitter @BMATTeach  \r\n\r\nYou will be formally invited to interview directly by the Teaching School Team at least 1 week in advance.\r\n\r\nThe interview process consists of three parts (approximately 1.5hour duration): \r\n* Basic Skills Assessment - a short test (20 minutes) to assess Literacy and Numeracy levels \r\n* Teaching a Lesson - you will be asked to plan and deliver a 30 minute lesson to a class of learners. You will be guided on the topic, content and class details in advance of the lesson. The lesson will be observed by two members of the Teaching School Team / Senior Leadership. \r\n* Formal interview - the interview will be conducted by two members of the Teaching School Team / Senior Leadership Team\r\n\r\nYou will receive Interview feedback within 2 working days and if successful your recommendation to teacher training will be passed to the University to assess your subject knowledge before starting the enrolment process. ","howSchoolPlacementsWork":"A successful applicant will train in any of BMAT's partnership schools, depending on the schools' recruitment priority. Allocation of places will reflect proximity, preference and a balance of places across the partner schools. BMAT schools are geographically based from London Stansted Airport to London City Airport - travel distance between each school is no more than 30 miles, the majority of schools are within easy reach of the lead school Burnt Mill Academy. \r\n\r\nAl trainees are based in a 'home' school and will go on a 2nd placement to an alternative / contrasting school placement for 4-6 weeks during the training programme. \r\n\r\nOur BMAT partner schools provide 5 different placement opportunities at EYFS and Key Stage 1/2, 6 opportunities to train in Key Stage 3/4 and 3 school placement options at Key Stage 5. \r\n\r\nPrimary trainees will teach across Key Stage 1 and 2 (age 5-11) but will also gain experience in EYFS and Key Stage 3.\r\nSecondary trainees will teach across Key Stage 3 and 4 (age 11-16) but will also gain experience in Key Stages 2 and 5.\r\n\r\nA full list of our schools can be seen here [bmat-trust.org](http://www.bmat-trust.org/280/our-schools-1)\r\n\r\nWe also work outside of our Academy Trust network, reaching into schools in West Essex, East London and Hertfordshire for placement opportunities","personalQualities":"We are looking for candidates who will committee to our vision and values. \r\nBMAT is committed to the following:\r\n* ‘No limits’ attitude towards children\r\nWe believe that no child should be limited by where they’ve come from; that every child within the BMAT family deserves the chance to move on from where they are now to somewhere better. \r\n\r\n* Letting our teachers truly teach\r\nWe believe in letting our teachers do what they’re best at – teach. \r\n\r\n* Local schools with local personalities\r\nWe are not in the business of making every school in BMAT look like each other.","otherRequirements":"All offers are subject to satisfactory results from necessary pre-employment checks\r\n\r\nPlease contact us directly \r\n[bmat-trust.org](http://www.bmat-trust.org/577/teaching-school-2)","status":1,"createdAt":"2021-07-06T10:50:29.093Z","updatedAt":"2021-10-10T16:32:38.594Z","canSponsorStudentVisa":"yes","cycle":"2024"}
