{"id":"8116e796-3c65-4a88-a400-7827188f87a2","name":"Primary","code":"242S","qualification":"pgce_with_qts","startDate":"2023-07-31T23:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"65a83f21-d738-4027-9a1b-495748258915","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"e084fb2e-fa2d-4c4c-8d6a-93aa32265e5a","code":"1ME","name":"Wirral Schools Collaboration (Pensby)"},"accreditedBody":{"id":"ec34b77c-cba3-4598-93be-23f0471adff1","code":"L51","name":"Liverpool John Moores University"},"profPost":"PG","degreeGrade":"1","english":"1","maths":"1","science":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"When considering equivalency tests, we seek advice from Liverpool John Moores University on what is acceptable, Candidates are expected to fund the costs of any equivalency test.","courseLength":"OneYear","feesUK":9250,"feesInternational":14000,"feeDetails":"The fees for the course are set by Liverpool John Moores University. ","aboutCourse":"The School Direct course usually begins with an Induction week which takes place at Liverpool John Moores University during August.\r\nThe school based training takes place within our Collaboration Schools that all have a proven track record of high achievement in all areas. \r\nThe training programme will prepare you to teach across the primary curriculum and covers all areas of the curriculum and associated school processes. Together, the Collaboration and the University will deliver exciting, engaging, meaningful training that will help you develop the professional knowledge and skills to become an effective primary classroom practitioner. \r\nEach trainee is assigned a mentor from within their 'home' school who will guide them through the training programme. \r\nYou will be in your 'home' school from day one and this will enable you to experience school throughout the academic year. You will be regarded as a member of the teaching team and will attend staff meetings and development days. Being in a school setting means that you can experience the whole spectrum of tasks and processes within a school, such as taking a school assembly, organising class trips, working with other specialist staff etc. Most importantly it will enable you to fully understand how we safeguard our children and prepare them for the next stage of their education. \r\nThe LJMU taught programme focuses predominantly on developing your subject knowledge and subject pedagogy. Sessions are led by subject experts and are designed to equip students with the knowledge, understanding and skills needed to become confident teachers. In addition, lead lectures and seminars develop student teachers’ confidence in a range of relevant issues; classroom and behaviour management; meeting individual needs and inclusion; planning and assessment etc. There is a strong emphasis on social justice issues in education and on mental health and well-being. Sessions are largely workshop-based and participatory so that theoretical, research-informed teaching is explicitly linked to its practical implications for the classroom.\r\nThe course, in partnership with Liverpool John Moores University (LJMU), offers a Post Graduate Certificate with Qualified Teaching Status with 60 credits at masters level. \r\nThe workload of the course requires good organisational skills. Working with your school mentor and supported by the university staff, will enable you to tackle and achieve what you need to do. We want our trainees to succeed, so together we form a strong team to work towards that goal. ","interviewProcess":"The interview process takes place over one school day.\r\nYou will be asked to attend one of the schools in the Collaboration for the morning. On arrival you will be briefed by a senior member of the staff team on expectations and be asked to show your qualifications and identification. You will spend the morning in a class, where you will interact with children and the staff. At break time you will have other opportunities to meet staff. At some point in the morning, you will be asked to work with a small group of children in a directed task. \r\nIn the afternoon you will be asked to attend a Collaboration school (usually Pensby Primary School, which is the lead school). You will be greeted by a senior member of staff who will welcome you and go through the afternoon events. There will be an opportunity to talk to any current School Direct candidates training in the school. You will write a reflection on your experiences that morning. The final stage is an interview. This lasts about 25 minutes and there is an opportunity for you to ask questions. The panel usually consists of 2 members of staff from one of the Collaboration schools, who are very experienced with the School Direct training programme and interview process. The afternoon process is usually complete by 3.30pm. \r\nWe aim to inform you of the outcome of the day later that afternoon. Feedback is always offered to help support you. \r\n\r\n","howSchoolPlacementsWork":"The schools in our Collaboration have a long and established working relationship. There are 12+ schools currently in the Collaboration, mainly situated in the Deeside area of Wirral, but we have Collaboration schools in other areas of Wirral too. \r\nWe work together in a variety of ways and this joint working and collaboration brings benefits to our staff, pupils, families and of course our trainees. \r\nAll the schools offer Early Years, Key stage 1 and Key Stage 2 departments. Some of our schools have Nursery provision. This means the age ranges you may teach are 4 to 11 or 3 to 11. \r\nThe course offers 2 school placements. The main placement, which starts in the autumn term, will be in your 'home' school. In the first half of the spring term, you will move to another Collaboration school for your second placement, before returning to your home school to complete the school year. \r\nIn the autumn term, you spend one day a week at Liverpool John Moores University for training. The remaining four days are spent in your 'home' school. In the spring term, you still attend training at the University but this decreases and more full weeks are spent in school. In the summer term you are spending most weeks in the school setting. \r\nSchool based training also happens throughout the year. This will take place in the Collaboration schools and gives you an opportunity to experience many of the schools within our group across Wirral. ","personalQualities":"All schools need people who are dedicated to the children. Our staff must be passionate and enthusiastic about teaching. We want candidates to be eager, who are keen to learn and who can reflect and plan. You must have excellent organisational skills, be punctual and willing to give your own time to the school and it's pupils.You must be able to reflect on your own practice, accept guidance and accept constructive criticism. Above all you need to be able to guide and drive your own learning, use your initiative and be proactive. \r\n\r\n","otherRequirements":"All the schools in our Collaboration are rigorous and determined to safeguard our children.\r\nYou will undergo an enhanced DBS check. You will be subject to and be expected to adhere to our schools safeguarding procedures at all times, including the staff code of conduct. \r\nThe safety and well being of the children is paramount. ","status":1,"createdAt":"2021-07-06T10:55:55.781Z","updatedAt":"2021-09-21T13:07:48.033Z","canSponsorStudentVisa":"yes","cycle":"2024"}
