{"id":"10c24688-a8e7-4812-8600-8159e1cb9809","name":"Psychology","code":"V335","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"14_to_19","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"1878e739-30bb-4de9-841e-42dacfb1fa0c","code":"C8","name":"Psychology"}],"locations":[{"id":"6c5aaeda-7577-4dd2-87c7-a86c50b90534","name":"GLF Schools' Teacher Training (Central)","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"2d2c0819-58bc-455d-bc95-4e967bbc0774","code":"2B4","name":"GLF Schools’ Teacher Training"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"If you do not have an English or Maths GCSE at grade C/Level 4 or above (or Science for primary teacher training), you can still apply for teacher training, but we will require you to pass an equivalency test before we confirm any offer that we make.\n\nFurther information on the providers that we recommend can be found our our website: (https://www.glfscitt.org/65/equivalency-tests)\n\nAny overseas qualifications should be verified with ENIC for equivalency BEFORE an application is submitted - (www.enic.org.uk)\n\nIf your secondary qualification and your degree were studied abroad in a non-English speaking country and you do not have an English GCSE as you studied it as a second language, you will need to sit the IELTS Academic test - our minimum requirement is for an overall score of 7.0 with a minimum of 6.5 for Reading and 6.0 for Writing. \n\nIf you undertook secondary education in a non-English speaking country but took your degree in the UK and you finished it in the last three years, we do not require you to sit the IELTS. Please note that the IELTS test is only valid for 2 years.","courseLength":"OneYear","feesUK":8000,"feeDetails":"If you opt to take the PGCE uplift, our course fees are capped at £9,250 (£8,000 SCITT tuition fee plus £1,250 PGCE fee) for fee-funded (provider led) trainees.   \r\n\r\nMost trainees will be eligible to apply for a tuition fee loan to cover the course costs but eligibility should be checked with the Student Loans Company.  Please refer to this website for further information: (https://www.gov.uk/student-finance/who-qualifies)\r\n\r\nBursaries or scholarships are available for secondary fee funded trainees in certain subjects only.  Please refer to our website for further information: (https://www.glfscitt.org/)\r\n","financialSupport":"We offer flexible payment schemes for trainees who opt to self-fund their course fees, however all fees must be paid in full before QTS can be awarded.","aboutCourse":"You will be assigned to a host school in which you will complete the majority of your training, on a 2-1-2 basis (2 days in school - 1 day dedicated to professional studies - 2 days in school).  In the spring term, you will complete a second placement of six weeks in another partnership school to ensure that you experience contrasting educational settings / phases, which will greatly enhance your learning experience, subject to Government guidelines.  \r\n\r\nOur teacher training curriculum is designed to ensure that you will meet all eight National Teachers' Standards and Part 2 by the end of the training year in order to receive Qualified Teacher Status (QTS). During the course of the year, your teaching commitments will gradually increase from co-delivery of a lesson to full responsibility whilst you are developing a body of evidence to support your progress against the curriculum.  A range of evidence is sought, at each assessment point, to ensure that you are working at the required standard to obtain QTS status by the end of the programme.\r\n\r\nYou will receive weekly professional studies training, delivered by a member of the SCITT Leadership Team and/or specialists from our partnership schools as well as nationally recognised experts; these sessions are carefully mapped against the strands of our curriculum and to your practice in school and are designed to support you in developing your teaching skills over time.  As a team we regularly review and update our programme to ensure that it meets the needs of all our trainee teachers.\r\n  \r\nTrainees can either opt for the ‘QTS only’ route or choose to enhance their training year by selecting to study for a PGCE which is delivered in partnership with St Mary’s University.  This post graduate course provides trainees with the option of further academic study resulting in an internationally recognised teaching qualification.  The PGCE modules are delivered as part of the Professional Studies sessions programme.  Further information can be found on our website (www.glfscitt.org)\r\n\r\nThe SCITT programme provides opportunities to develop a range of effective teaching strategies for learners with Special Educational Needs and Disabilities. In your practice you will work closely with children who have a variety of different needs and will be guided by expert colleagues, such as the Special Educational Needs Coordinator in school, to help you to adapt your teaching and ensure the best possible outcomes for all learners.\r\n\r\n\r\n","interviewProcess":"Once references have been completed, applications are automatically sent through to our team. Once we have received your details we will check that you meet the qualification eligibility criteria and that you demonstrate the drive for and commitment to teaching that we are looking for in your personal statement. \r\n\r\nIf successful, you will be invited for an online interview which will consist of:\r\n* a formal interview, with members of the SCITT Leadership Team \r\n* a lesson planning exercise \r\n* a teaching activity or review of a teaching activity\r\n* a written exercise \r\n* activities to test literacy and numeracy\r\n* a subject knowledge test, GCSE level (secondary only)\r\n\r\nAll teacher training applicants will be assessed for their suitability to train to teach. Candidates will be expected to demonstrate their commitment to a future teaching career, sound subject knowledge and the ability to interact with young people in and out of a classroom environment. \r\n\r\nWe are also looking for strong literacy and numeracy skills, high standards of written English, a willingness to contribute to wider school life as well as personal qualities including: confidence, flexibility, resilience, ability to work in a group and under pressure, self-reflection, time management skills, good organisational and administrative skills and a knowledge of the teaching profession/the demands of a teacher.\r\n\r\nSuccessful candidates will be given a conditional offer which will be subject to Safeguarding and health checks and evidence of qualifications. Detailed verbal feedback is provided to all interviewees following this process.\r\n\r\n","howSchoolPlacementsWork":"In the majority of subjects, our Secondary programme focuses on the teaching of children aged 11-16, which includes experience at both Key Stage 3 and Key Stage 4. Your training will be tailored to prepare you to teach both key stages across your chosen subject specialism.\r\n\r\nSuccessful candidates will be allocated a host school - this is dependent on location, transport access, and the needs of schools within the candidate’s home area and will be discussed once an offer is made.  We do our best to accommodate the personal and family circumstances of trainees when arranging placements and encourage a visit or video call with the host school to ensure that the suggested placement is mutually agreeable.  \r\n\r\nThe majority of your time will be spent in the host school and you will be expected to observe the normal teaching staff hours.  This will include meetings before and after the school day.  \r\n\r\nWe will also organise a 6 week placement (subject to government guidelines), usually after February half term, to ensure that you have experience of teaching in a contrasting educational/phase setting. This not only supports you to develop your skills against our curriculum, but also acts as a fantastic confidence builder. Following this placement you will feel prepared to teach in any setting and you will be able to make an informed choice about the school/phase you would like to apply to for your first Early Career Teaching position. \r\n\r\nWe are very fortunate to have a large and diverse partnership of schools with whom we have worked for many years. They share our ethos and passion for developing the full potential of their trainees and fully understand how to maximise the impact of your professional studies sessions through your practice in schools.\r\n\r\n","personalQualities":"Candidates will be expected to demonstrate their commitment to a future teaching career, strong subject knowledge and the ability to interact with young people in and out of a classroom environment. We are also looking for strong literacy and numeracy skills, high standards of written English, a willingness to contribute to wider school life as well as personal qualities including: confidence, flexibility, resilience, ability to work in a group and under pressure, self-reflection and time management skills, good organisational and administrative skills and a knowledge of the teaching profession/the demands of a teacher.","otherRequirements":"GLF Schools' Teacher Training, and all partnership schools, are committed to safeguarding and promoting the welfare of children and young people and expects all staff and volunteers to share this commitment. Members of the selection panel are Safer Recruitment trained and we require all successful applicants to undertake an enhanced DBS and Barred List check. \r\n \r\nWe will have due regard to The Equality Act 2010 and Special Educational Needs and Disability Act 2001.  All decisions relating to recruitment and selection are based on objective criteria related to the requirements of the programme and the need to recruit high quality teachers. ","status":1,"createdAt":"2021-07-06T10:53:35.868Z","updatedAt":"2021-10-01T15:08:03.403Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
