{"id":"f9f6c617-6208-4655-b64d-40e4b0428966","name":"Primary","code":"X100","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"3694ef45-f3cf-4a93-99b3-8cb7b64af823","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"f92545e7-be5f-4a2b-a9af-21271b8d985e","code":"P75","name":"Poole SCITT"},"profPost":"PG","degreeGrade":"1","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"Poole SCITT only accepts GCSEs, iGCSEs or equivalency tests from\nthe company 'Equivalency Testing' (https://www.equivalencytesting.com)","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Poole SCITT offers you a one year course leading to a Post Graduate Certificate of Education (PGCE) with Qualified Teacher Status (QTS) validated by Kingston University in Surrey. The course carries 60 Credits towards a Masters Degree. \r\nThe course is largely school based, with approximately 24 weeks on school placements and 14 weeks on the taught course either at the Ad Astra Infant School base or in the other partnership schools (listed on the Poole SCITT website). Many of the taught course sessions involve working with children enabling you to successfully link theory and practice.\r\n\r\nTutors, classroom teachers and other educational professionals, experienced in teacher training will run courses, seminars and workshops specially designed to introduce you to the needs of children and the primary curriculum. There will be ample opportunity for peer group discussion and evaluation of your school-based work. \r\n\r\nYou will experience extensive teaching placements in different local primary schools during your training and will be supervised in each school by a trained mentor. \r\n\r\nA Course Director, with expert knowledge and experience of teacher education will oversee and co-ordinate your training during the course under the direction of the SCITT Management Board. The Management Board is made up of representatives of the partnership, including head teachers, mentors and trainees. \r\n\r\nThe course is an 'all-through general primary course' and will train you to teach children from 5-11 years in Key Stage 1 and Key Stage 2. \r\n\r\nAll trainees are required to undertake training in both Key Stages and substantial school experience will be provided in both. \r\nThere may be opportunities to develop specialisms in other areas such as Early Years and SEN. \r\n\r\nYour progress will be monitored and assessed through regular formal and informal monitoring of teaching competence, leading to profile reviews and professional assignments, which will link education/subject theory with your work in the classroom. \r\n\r\nAfter graduating, you will obtain Qualified Teacher Status (QTS) and a\r\nPostgraduate Certificate of Education (PGCE) with 'M' Credits validated by Kingston University in Surrey.\r\n\r\nOver the last three academic years, Poole SCITT 99% of trainees have obtained jobs immediately after graduating, most of these in the local area.\r\n\r\n","interviewProcess":"Applicants are selected from applications through the DfE application site (www.gov.uk/apply-for-teacher-training)\r\nYou should write a full personal statement giving reasons for wanting to teach. You should cite any experience of working with children (although strongly recommended, this is not an essential requirement for application). \r\n\r\nCareful consideration should be made as to referees. These might be from a University tutor, depending on time lapsed since the degree was taken, and from a school or employment contact. \r\n\r\nAt least one of your references should be from someone who can comment upon your working with children. \r\n\r\nPlease visit the Poole SCITT website for more information on referee choice. \r\n\r\nApplicants should possess the minimum qualification requirements or be working towards them with a view to them being in place by the time that the course begins. \r\nPlease make it clear on applications if you are working towards GCSE or degree qualifications and when results will be known. \r\n\r\nThe interview is your chance to demonstrate your potential to become a successful teacher. Successful candidates will be invited to attend an interview session with Literacy and Numeracy testing, group and individual interviews. The interview is also your chance to find out more about the course.\r\nMore specific details about the interview process will be provided to candidates by email if successful in application, so please provide a valid and regularly monitored email address on application forms.\r\n\r\n\r\n","howSchoolPlacementsWork":"Poole SCITT currently partners with around 30 Primary in the Poole, Bournemouth and Dorset area.\r\nParticipating schools have been selected on their record for providing a quality teaching and learning environment, their strength of commitment to professional development and their previous experience of working with trainees in initial teacher training. \r\nThe schools have been strongly involved in the writing and development of the course and are also involved in the selection of the trainees, their mentoring and assessment.\r\n\r\nAll trainees are required to undertake assessed training in both Key Stages 1 and 2 and substantial school experience will be provided in both. \r\nStudents undertake at least one Block Practice in Key Stage 1 and one in Key Stage 2 during the course.  Each Block Practice consists of 11 weeks. Additionally there will be 2 placement weeks in two different schools which will be non-assessed. There may be opportunities to develop specialisms in other areas such as Early Years and SEN during the second part of Block Practice 2. \r\n\r\nYou will be placed in schools that best help you to develop your professional practice. This could be across any of the schools in our partnership. Please see the Poole SCITT website for a list of these schools. Travelling time for students will be taken into account but this is not always possible.\r\n\r\nYour main in-school experience will progress from observing and working alongside your class teacher to taking full responsibility, firstly for groups and later, for the whole class. \r\n\r\nTrainees will be assigned a trained mentor within the school who will be responsible for supporting and guiding professional development and ensuring that everyone has the opportunities they need within the school. \r\n\r\n\r\n","personalQualities":"We're looking for enthusiastic, hardworking, well organised students who are ready for a challenging but rewarding year.\r\n\r\nCan you inspire and motivate children?\r\nCan you articulate clear and appropriate reasons for wanting to teach?\r\nAre you interested in the process of education and learning, for your pupils and for yourself?\r\nAre you keen to be part of a team, as a trainee and in a Primary school?\r\n\r\nWe are looking for candidates who have the passion and  potential to make the most of a course which ultimately equips them to become an excellent teacher and a credit to the profession.\r\n\r\n","otherRequirements":"All offers made will be subject to Criminal Records Checks, prohibition from teaching checks and medical clearance and where necessary, satisfactory completion of degrees and other minimum qualification requirements. \r\n\r\n\r\n","status":1,"createdAt":"2021-07-06T10:48:24.708Z","updatedAt":"2021-07-28T10:35:40.547Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
