{"id":"b42b24e6-71d3-4eef-b3ac-255294632cdc","name":"Primary","code":"T847","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_7","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"e36c62ca-85f3-40fb-b68b-eb5805335859","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"6e358997-e4af-4e06-99a0-ae79eb34916f","code":"2CP","name":"SAND Training & Outreach"},"accreditedBody":{"id":"9aa67012-b776-4027-89f4-5531efb3a9d2","code":"G50","name":"The University of Gloucestershire"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"10 months (1st September-30th June)","feesUK":9250,"feeDetails":"Please refer to The University of Gloucestershire for fees.","aboutCourse":"This course is based in the 3-7 age range.\r\n\r\nTrainees will have a 10 month placement at one of our partner schools and will benefit from a contrasting experience undertaking a short-term placement at a second Gloucestershire school. Trainees are able to access both Primary Mainstream and SEN placements according to preference.\r\n\r\nIn addition to classroom practice, Trainees will attend a series of tailored training sessions, in order to develop teaching skills, subject knowledge and good practice. These sessions are facilitated by our expert practitioners, who will support trainees in achieving high quality professional practice. Our training programme is reviewed annually and developed to ensure that Trainees are fully equipped to embark on their future career. Our 2020-21 programme includes the following modules:\r\n- Behaviour for Learning and Learning Styles\r\n- Working as Part of a Team\r\n- Child Development and Neuroscience\r\n- Supporting Positive Behaviour\r\n- Speech, Language and Communication Development\r\n- Writing, Reading and Children's Literature\r\n- Maths\r\n- EYFS\r\n- Science\r\n- History, Geography and Theme Base Approach\r\n- Resilience, Wellbeing and Mental Health\r\n- Dealing with Difficult Conversations\r\n- PSHE/ RSHE (including PiNK)\r\n- Schemas\r\n- Creativity\r\n- Computing\r\n- RE\r\n- PE\r\n - CVs, Job Applications and Interviews\r\n- Introduction to Autism\r\n- Pathological Demand Avoidance\r\n- Attachment Theory\r\n - Foetal Alcohol Syndrome\r\n- Down Syndrome, DiGeorge Syndrome and Fragile X Syndrome\r\n- Restorative Practice\r\n- English as an Additional Language\r\n- EHCPs, MyPlan, MyPlan+\r\n\r\nIn addition to visiting partner schools and attending programme modules, Trainees will attend sessions run by The University of Gloucestershire. Trainees are assigned a mentor at their placement school and are also supported by the ITT Training Manager throughout the programme.\r\n\r\nAssessment is achieved through production of a professional portfolio, which will be used to build evidence of how the standards for the award of qualified teacher status (QTS) are being met. Evidence will include observations of Trainee teaching and written assignments, which should demonstrate a clear understanding of professional practice, phase and subject area. The expectation of time spent leading a class will increase in each successive term of the programme as Trainees develop in their skills and confidence, leading up to 80%.","interviewProcess":"Shortlisted applicants will be invited to attend an interview. \r\n\r\nIn response to guidelines schools are currently operating within due do Coronavirus (COVID-19), interviews may be conducted online.\r\n\r\n As part of this interview you will:\r\n- deliver a presentation on a topic which you will be notified of and have opportunity to prepare for in advance\r\n- have a formal interview with a panel of interviewers\r\n","howSchoolPlacementsWork":"Trainees will be offered placements in one of our placement schools as part of their training programme. Recent placement schools are:\r\nThe Milestone School\r\nBettridge School\r\nConey Hill Community Primary School\r\nAbbeymead Primary School\r\nInnsworth Junior School\r\nInnsworth Infant School\r\nFinlay Community School\r\nBattledown Centre for Children and Families\r\nParton Manor Junior School\r\nParton Manor Infant School\r\nGlebe Infants’ School\r\nPicklenash Junior School\r\nSt Paul’s Church of England Primary School\r\nElmbridge Primary School\r\nCooper’s Edge Primary School\r\nKingsholm Church of England Primary School\r\nHarewood Junior School\r\n\r\nPlacements schools are reviewed annually, and where possible selected in conjunction with the Trainee. Trainees are expected to spend most of their time in their placement school, with the exception of attending Training Programme days and visits to other schools. During the programme Trainees need to undertake assessed placements in both Early Years and KS1 - to ensure a range of experience these placements must take place in different schools.","personalQualities":"You should:\r\n- have a positive, solutions-based approach\r\n- demonstrate commitment to your own professional development and to achieving high standards in teaching and learning\r\n- be committed to ensuring the best possible outcomes for all pupils","otherRequirements":"Your application should include examples of experience you have of working with young people – for example as a classroom assistant, youth worker, or as a volunteer in a school. \r\nIf you have not had previous experience of working with young people, you should be able to demonstrate how skills you have developed in other contexts would transfer to teaching and have a positive impact on pupil outcomes.","status":1,"createdAt":"2021-07-06T10:48:58.319Z","updatedAt":"2021-09-03T13:22:30.828Z","canSponsorStudentVisa":"no","cycle":"2024"}
