{"id":"bb2522cc-285f-494a-a98c-97040fafe929","name":"Modern Languages","code":"2YRJ","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"4608e5e3-2a1a-48a1-8236-56c7af5a139d","code":"24","name":"Modern languages (other)"},{"id":"ce8523ef-9236-4cd9-b260-d826c7a521b3","code":"ML","name":"Modern Languages"}],"locations":[{"id":"69c0f433-9092-4526-9f3f-ee1291d5f54c","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"fa7eed0d-9142-4126-9689-ca18621f7f4c","code":"2BH","name":"SUPA SOUTHAMPTON"},"accreditedBody":{"id":"2b84ae64-ebca-4e4d-88b1-13effff3a411","code":"S27","name":"University of Southampton"},"profPost":"BO","degreeGrade":"1","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":19850,"financialSupport":"Trainee teachers are eligible for financial support through government bursaries and subject scholarships. The amount payable is dependent on your degree classification. For more information visit https://getintoteaching.education.gov.uk/funding-and-salary/overview","aboutCourse":"‘If you talk to a man in a language he understands, that goes to his head. If you talk to him in his language , that goes to his heart’  Nelson Mandela.  Do you have a passion for languages? Does the prospect of widening the horizons of young people excite you? Do you want to equip the next generation of global citizens with a second language? Share your love of the foreign culture and language by learning to teach French, German or Spanish. Through high-quality teaching sessions, micro-teaching in a school prior to teaching practice, collaborative workshops and supportive school placements, the Southampton PGCE MFL course will equip you to become an inspirational and effective language teacher of young people aged 11-16. Make a real difference to the communication skills of the next generation! The PGCE Secondary Modern Languages course at Southampton will equip you with the necessary skills and knowledge to teach Modern Languages across the secondary age range, including opportunities to acquire teaching strategies for 16-19 teaching. The course seeks to equip you to teach French, German or Spanish as a means of communication to pupils of a range of ages and abilities, within the framework of the National Curriculum. Opportunities exist to teach a second language. The PGCE MFL course at Southampton offers a very varied programme focussing mainly on MFL teaching and learning at KS3 and 4 but also featuring MFL at KS5. The course is described by the External Examiner as ‘a responsive and innovative programme which challenges and supports students to become outstanding teachers of MFL.   Sessions are practical and active participation is definitely encouraged!  Trainees look at cross-curricular opportunities and learn how to use tools such as Drama and Film, to add another dimension to their teaching repertoire. The emphasis at Southampton is on support and collaboration. MFL trainees share good practice in workshops throughout the year and create their own blogs / Google docs etc. to facilitate collaboration. You are encouraged to organise lessons which make use of both published materials and your own individual creativity. Sessions will focus principally on the four essential skills of language learning Listening, Speaking, Reading and Writing. The university-based sessions also consist of practical workshops, where you can develop your own language skills, as well as learn the pedagogical knowledge needed to teach.  http://www.education.soton.ac.uk/courses/routes_into_teacher_training/index.php?link=course_details.php&id=6\r\n  https://www.southampton.ac.uk/education/about/staff/mjs3.page?#contact \r\nhttp://www.education.soton.ac.uk/courses/routes_into_teacher_training/index.php?link=course_details.php&id=6  \r\n","interviewProcess":"Once you have applied to SUPA Southampton you will be invited for interview at one of the schools in the Alliance.  The interview process will involve three key elements:\r\n1). An interview with a panel containing at least one senior member of staff from the school and a member of staff from the University of Southampton.\r\n2). A basic written task to check literacy levels. This task will not require you to carry out any preparation and is a normal task that a teacher might need to carry out in their working day.\r\n3). A  student based activity - a brief task with a small group of students. Further details will be provided to you in advance of your interview so that you have time to prepare. We understand that you are not yet trained as a teacher and so this task is simply to assess your potential and your ability to relate to our students.\r\n","howSchoolPlacementsWork":"School placements will make up the bulk of your training year as they play a vital role in providing you with the skills and experience needed to be a successful teacher. However, we fully understand that standing in front of a class for the first time can be a very daunting experience for some. For this reason, we will provide you with all the training and support you need so that you feel fully prepared when the time comes.\r\nThe training year is broken down as follows:\r\nTerm 1 – Initial Training and First Placement School\r\nYou will spend the first week in September following an induction programme in your Home School. This gives you the opportunity to gain an understanding of the systems and functions of your Home School, meet key staff and observe some lessons so when you return you are familiar with procedures and routines. You will then attend approximately two weeks training in the university. Once this initial training is complete the rest of the term is spent in your first placement school while still attending the university training days. The first placement is selected from the whole of the  University partnership to give the best possible contrast, not just the alliance. However, we will always endeavour to keep your daily commute to a minimum.\r\n Terms 2 and 3 – The Home School\r\nIn January, you will move onto your second teaching placement in your Home School. You will remain there until June whilst you complete a personalised programme of teaching practice and professional training.  During this time, you will return to the University for regular training days and will also be given the opportunity to visit a primary school and experience a 6th form setting as well.\r\n","personalQualities":"We are looking for trainee teachers who are passionate and enthusiastic about their subject and have a desire to share this with young people.\r\nSkills\r\nYou will need to demonstrate dedication, tenacity and creativity and be an excellent communicator. \r\nYou should hold a strong knowledge of your specialist subject and be able to communicate your knowledge in a clear and inspiring way. \r\n","otherRequirements":"Before starting on the PGCE programme you will be required:\r\n- To complete a form describing your state of health which will be checked against the DfE Fitness to Teach regulations \r\n- To provide an Enhanced Disclosure from the Disclosure and Barring Service (DBS) to confirm that there are no criminal offences on your record which would bar you from teaching. \r\nIt would also be a great advantage if you have had some recent experience in a school or working with children either in a school environment or elsewhere.\r\n\r\n","status":1,"createdAt":"2021-07-12T13:49:20.671Z","updatedAt":"2021-10-04T18:38:53.279Z","canSponsorStudentVisa":"yes","cycle":"2024"}
