{"id":"74b133d7-a1a9-4f8c-accf-b8904944a623","name":"Primary","code":"E191","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"cfb5f939-114c-484a-8157-f78920ce59a0","name":"St Andrew's CE Primary School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"699b8c23-4d5a-400b-a189-86898da33a21","code":"2DD","name":"St. Andrew’s Teaching Alliance"},"accreditedBody":{"id":"66d7a620-e321-4149-9b28-fa5502ce365c","code":"O66","name":"Oxford Brookes University"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"A candidate who does not hold a GCSE at the required grade can either retake a GCSE if time permits, or take\nan equivalency test. At present, we can only accept this from https://www.equivalencytesting.com/.","courseLength":"OneYear","feesUK":7250,"feesInternational":7250,"feeDetails":"Sponsorship: We are offering sponsored places to strong candidates. This means your QTS fees would be covered by the placement school.\r\n\r\nAll trainees are required to pay £1,500 for PGCE fees - this is not covered in the sponsorship.\r\n\r\nNon-sponsored trainees: £7,250 QTS fees plus £1,500 PGCE fees.","financialSupport":"You may be eligible for a loan while you study.\r\n\r\nFind out about financial support if you’re from outside the UK.","aboutCourse":"This course has two key elements that drive its success; practical experience and personalised support:\r\n\r\nSchool based training:\r\n\r\nTrainees are centred in a school environment, each being assigned a main school placement, a classroom base and an experienced School Based Trainer (SBT) who will support their development throughout the year. \r\n\r\nThis programme  facilitates the depth of understanding necessary for personalised support. Tutorials every one to two weeks with the course manager.\r\n\r\nTheory:\r\n\r\nIt is delivered by a range of subject specialists and provides a comprehensive programme that closely links to the Teacher Standards in Initial Teacher Education, and other important issues such as Safeguarding, E-Safety and Emotional Well-Being. The sessions enable trainees to develop a deeper understanding of key issues and pedagogical thinking by encouraging them to critically reflect on research in relation to their own classroom practice.\r\n\r\n","interviewProcess":"The interview process is undertaken at the lead school and comprises of a number of different elements; typically this would include a taught session to a group of children, a short written task and an interview that includes a verbal presentation. You will also be able to ask questions.\r\n\r\nFor those who are successful at interview, a conditional place on the course will be offered. The conditions will vary for each applicant, but may include, successfully gaining outstanding qualifications, a criminal record check (DBS) and an occupational health assessment. To reflect individual circumstances, further conditions may be discussed at interview.","howSchoolPlacementsWork":"Typically, trainees spend the majority of their training in their main school. Matching trainees with the right schools is critically important to us and we do all we can to accommodate personal wishes; for example, proximity to home, consideration of public transport, extended experience of a different key stage or a placement in a school outside of our regular geographical partnership. Through individual discussions, travel time and individual circumstances are always taken into consideration before an offer of placement is agreed.\r\n\r\nAn indication of what each Teaching Practice comprises of is illustrated below:\r\n\r\nTP1 First Teaching Practice – Autumn\r\n\r\nTrainees work from existing school medium term planning and along with support from their SBT begin delivering lessons in accordance with their personalised targets. By the end of the Autumn term the expectation is that their teaching commitment should be approximately 40% of the week.\r\n\r\nTP2 Second Teaching Practice – Spring\r\n\r\nThis practice takes place in a different school and different key stage and lasts for six weeks. The first week is largely observation based and working with groups. The second week will involve solo teaching, building upwards to 50% teaching from Week 3 onwards and 60% in the final week. Trainees will plan full lessons, drawing from medium term planning in the school.\r\n\r\nTP 3 Final Teaching Practice – Summer\r\n\r\nThis is the final assessment period. At this stage, it is expected that trainees demonstrate that they can fully plan an appropriate sequence of work across the full range of curriculum areas. They must demonstrate that they can sustain a satisfactory teaching standard over an 80 - 90% teaching timetable. They should prepare teaching resources, mark work and fulfil the main requirements of a classroom teacher to demonstrate their abilities in readiness for entry as a qualified teacher into the profession.","personalQualities":"SATA is looking for talented hardworking individuals who demonstrate enthusiasm and commitment to work with young children across the Primary Phase.","otherRequirements":"Identification, through the selection process, as exhibiting the potential to be a Good or Outstanding teacher by the end of the programme.","status":1,"createdAt":"2021-07-06T10:51:07.718Z","updatedAt":"2021-09-25T11:43:51.665Z","canSponsorStudentVisa":"yes","cycle":"2024"}
