{"id":"84e902fd-d7f1-4e18-8c85-89290fcf2eb3","name":"Biology","code":"3C28","qualification":"qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"322cfc19-d51d-45db-91e3-bd7b4738470f","code":"C1","name":"Biology"}],"locations":[{"id":"b11ab0f4-7a6d-47cd-aa48-0582fa18182d","name":"The Holy Cross School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"9dd13fde-6d4c-4725-824d-ceff8ab189a9","code":"1MO","name":"The Holy Cross School"},"accreditedBody":{"id":"252d7e03-741e-4453-b6a8-3d361e6c9d1b","code":"E69","name":"e-Qualitas"},"degreeGrade":"0","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","aboutCourse":"You are based in The Holy Cross School during your training, with a placement of about 6 weeks in a contrasting school.\r\nYou will work with a teacher mentor in school and a visiting tutor from EQualitas to help and support your training.\r\nYou will follow a course that leads to QTS. The course content is organised into six modules, the first three of which may be worked on concurrently.\r\nTraining Module 1A: Lesson planning. How to plan lessons well, including choosing the most appropriate teaching and learning strategies.\r\n\r\nTraining Module 1B: Behaviour. How to manage pupils during lessons, and motivating them towards learning.\r\n\r\nTraining Module 1C: Assessment. How to assess pupils' learning in each subject, and use assessment information when planning and teaching lessons.\r\n\r\nTraining Module 2: Meeting needs of different groups of pupils. How to ensure that all groups of pupils do as well as possible eg those who speak English as an additional language, high attaining pupils, those with special educational needs.\r\n\r\nTraining Module 3: The wider context of teaching and learning in schools today. Barriers to learning i.e. why some pupils do not do as well as they should, and how teachers can make a difference to this.\r\n\r\nTraining Module 4: Subject teaching. Bringing everything together, how to teach really effectively. This builds on all the earlier training in how to teach effectively, and involves an in-depth study of an aspect of subject teaching.\r\n\r\nThere are two formal assignments: an essay exploring aspects of meeting the needs of different groups of pupils (linked to Training Module 2), and a subject-related essay (linked to Training Module 4).\r\n\r\n\r\nYour progress towards meeting the Teachers' Standards is assessed formally at four points: when you start, after 10 working weeks, 20 working weeks and at the end of the training period. These assessments are carried out jointly by trainees, school staff and eQ tutors. Your formal assignments are marked by eQ tutors.\r\n","interviewProcess":"Initial Selection - Applications are considered by the school, and selected for interview on the basis of the information within the application. We pay particular attention to qualifications, the personal statement, and the references.\r\nInterview - Applicants who are invited to interview must take the following: their qualifications certificates; identity documents (photo ID eg a passport, and evidence of residence eg a mobile phone bill or bank/savings statement). Overseas applicants must provide evidence of their eligibility to live and study in the UK. The interview will take up to a day, and include teaching a lesson or part of a lesson. After the interview, an offer is made or you are given feedback on why you were unsuccessful. If you accept the conditional offer, you will complete at least two weeks of in-school experience in preparation for the training (eQ provides pre-training activities), during which time an eQ tutor visits you at the school to work out the individualised plan for your training. The place is confirmed once you have met all the conditions of offer.\r\n\r\n","howSchoolPlacementsWork":"You would be placed at Holy Cross for the bulk of your training and complete a second placement in a local school. The second placement schools are chosen in negotiation with the trainee, taking into account travel distances and childcare arrangements if applicable, they have to be in a contrasting school so this will either be a mixed school or a boys school.\r\n\r\nYou will be teaching predominantly 11-16 students but there will be an opportunity to observe and teach 17-18 students for outstanding trainees","personalQualities":"\r\nWe are looking for applicants who have the potential to become outstanding teachers, and who are able to work independently on their studies while training in a school context. These personal attributes include:\r\n1. Subject knowledge \r\n2. Motivation to become the best teacher possible \r\n3. Ability to analyse and learn from experience, and to act on feedback. \r\n4. Creativity and imagination.\r\n5. Capacity for hard work \r\n5. Perseverance \r\n6. Good organisational skills \r\n7. Empathy and a liking for young people.\r\n8. Ambition to make a difference by becoming an inspirational teacher.\r\n\r\n","otherRequirements":"\r\n If your degree is not in the subject you are applying to teach, you need to explain how you have degree-level expertise in the subject. \r\n\r\nIf you do not meet the GCSE requirement, you can do an equivalence test. eQ recognises the tests offered by Equivalency Testing (<a href=http://www.equivalencytesting.co.uk>www.equivalencytesting.co.uk</a>).\r\nWe do not accept adult literacy and adult numeracy as equivalent to GCSE, nor do we accept GCSE English Literature instead of GCSE English.\r\nOther qualifications and experience - Successful applicants should have some in-school experience eg from school visits and voluntary work.","status":1,"createdAt":"2021-07-06T10:47:04.415Z","updatedAt":"2021-07-12T06:55:23.776Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"Fees\r\nThe school will pay your fees\r\n\r\nSalary  This is a salaried position (U/Q1)\r\n"}
