{"id":"15aa2d83-5b60-44ec-9da6-1dadcf302a42","name":"Primary","code":"A598","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"0ba00dab-82cc-44d2-a53a-6b3ee5b84fd1","name":"Trinity Church of England/Methodist School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"49e00352-5fec-4469-8b7b-ce6585d52c81","code":"3F1","name":"Forward First School Direct"},"accreditedBody":{"id":"d8c030de-91f2-420d-9ff7-4286c7f913fa","code":"E42","name":"Edge Hill University"},"profPost":"PG","degreeGrade":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"If you are applying and don’t have the GCSEs  required for entry, one of Edge Hill University's equivalency test programmes may be for you.\n\nThe equivalency tests offer you the opportunity to demonstrate that you satisfy our entry requirements for GCSE English Language and Mathematics at Grade C or Grade 4 or above.\n\nEdge Hill offer tutor-led revision courses or standalone tests for applicants who feel they do not need tuition.\n\nAll tutor-led revision courses are delivered online, prior to sitting an exam on campus. You can choose to sit the standalone tests either on campus or at Holy Cross College & University Centre on selected dates throughout the year.\n\nFor more details visit [Edge Hill's website](https://www.edgehill.ac.uk/study/equivalency/).","courseLength":"OneYear","feesUK":9250,"feeDetails":"Subject to eligibility, UK students can apply for a Tuition Fee Loan from the Government to cover the full cost of tuition fees. UK students enrolling on the programme may also be eligible to apply for additional funding to help with living costs.\r\n\r\nFor more details visit [edgehill.ac.uk/study/fees-and-funding](https://www.edgehill.ac.uk/study/fees-and-funding/)\r\n\r\nFinancial support information for international students can be found at [edgehill.ac.uk/international/fees](https://www.edgehill.ac.uk/international/fees-and-scholarships)","financialSupport":"Edge Hill University offers a range of scholarships with a competitive application process for prospective full-time PGCE students. These scholarships aren’t linked to academic success and celebrate determination, talent and achievement beyond your coursework, for instance in creativity, enterprise, ICT, performance, sport or volunteering. \r\n\r\nTo find out more about scholarships, to assess your eligibility, and to meet some of our dedicated scholarship winners, visit [edgehill.ac.uk/scholarships](https://www.edgehill.ac.uk/scholarships)","aboutCourse":"Our PGCE with QTS programmes combine professional ‘on the job’ training in our network of schools, with your Masters level academic study taking place at Edge Hill University.\r\n\r\nThe PGCE programmes will provide you with high-quality initial teacher education experience. They will prepare you to teach across the 3-7 age range in the Early Years Foundation Stage and Key Stage 1, or the 5-11 age range in Key Stages 1 and 2. Spending a significant amount of time working across our network of schools, you will be supported in meeting the Teachers’ Standards, gaining the professional skills, knowledge, understanding and attitudes necessary for a successful two-year induction as an early career teacher.\r\n\r\nBy enrolling with Forward First, you will be entering into an exciting, life-long partnership with the next generation of great, creative and passionate primary teachers. We will offer you guidance, support and training that is tailored to what you need in the ever-changing teaching landscape. Bespoke support will be provided by teams of professionals who are approachable, reliable and forward thinking in their approach to teaching and learning.\r\n\r\n","interviewProcess":"","howSchoolPlacementsWork":"Our programme is centred around hands on experience of working in school. A First Aid qualification is an essential life skill. It helps people remain safer by appreciating risk. Therefore, as a part of the course Forward First Trainees will become fully qualified paediatric and mental health first aid practitioners. Also, all of our trainees will have the opportunity to work alongside a fully qualified Forest School Practitioner as well as gaining first-hand experience in our dedicated SEND unit.\r\n\r\nAs a Forward First Trainee, you  will benefit from a diverse knowledge pool from nine local schools with excellent professional development opportunities and time to explore and expand your knowledge base, whilst developing other areas of the curriculum.  With the job market being extremely competitive, the array of experiences and teaching time will boost your confidence, engender good leadership skills and help you stand out.","personalQualities":"When you apply, you need to demonstrate to us that you have: \r\n\r\n* A genuine commitment to, and an understanding of, primary education. You will need to demonstrate the personal attributes, values and motivation you feel are required to join the teaching profession \r\n\r\n* In addition, you must have suitable presentational qualities, including a good standard of written English.\r\n","otherRequirements":"If you accept a formal offer you will be required to meet the Department for Education’s standards for physical and mental fitness to teach and clearance to work with children.  \r\n\r\nFurther information, including a Declaration of Health questionnaire and details of how to apply for a Disclosure and Barring Service (DBS) Enhanced Disclosure will be sent to you after you have firmly accepted an offer.","status":1,"createdAt":"2021-10-05T08:31:52.446Z","updatedAt":"2021-10-05T08:59:55.975Z","canSponsorStudentVisa":"yes","cycle":"2024"}
