{"id":"137cd0a8-563c-4ebb-83a2-d4470fb16a35","name":"Physics","code":"3C85","qualification":"pgde_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"bf97cd0a-224c-43d3-a021-84143df13e8d","code":"F3","name":"Physics"}],"locations":[{"id":"4c0b96fc-67cc-4a83-997a-d68484691d7f","name":"Main Site","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"3c613eb7-ccea-4af6-aa86-db5e1fa3f9e3","code":"1VK","name":"Lordswood Girls’ School and Sixth Form Centre"},"accreditedBody":{"id":"c357e0fa-802e-471b-818a-d0cd1434f9cd","code":"B32","name":"University of Birmingham"},"profPost":"PG","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Students on the secondary School Direct programme undertake the Postgraduate Diploma in Education with Qualified Teacher Status (QTS) which will provide 120 credits contributing to Master's level. \r\n\r\nThe course combines school based learning with lectures, seminars, workshops, tutorials and practical sessions at the University of Birmingham. Study at the University is largely within the School of Education’s dedicated building which includes specialist facilities, student study areas and online learning support.","interviewProcess":"Application forms are considered by the University of Birmingham, Lordswood Girls' School and the partner school offering the placement. \r\n\r\nAll successful applicants are invited to attend an interview which normally takes place in the placement school. Applicants that demonstrate professionalism, commitment, a realistic understanding of the pressures of the course and the profession, an awareness of the school in which they are intending to train, creativity, organisational skills and a clear recognition of the need to synthesise practical and academic learning through refection are most likely to succeed.","howSchoolPlacementsWork":"During the programme you will complete two secondary school placements. The main placement school is chosen through your UCAS application and the second school placement is negotiated on an individual basis with our partner schools to offer a contrasting and complementary experience.    \r\n\r\nDuring your secondary school placements you will experience teaching students across the 11-18 age range. ","personalQualities":"Successful applicants will be those that: \r\n\r\n* Have a clear and reflective understanding of what good teaching involves.\r\n* Understand that the training year is demanding in time and effort.\r\n* Are committed to the education of all children, whatever their educational need and background. \r\n* Can work in teams with a range of other professionals.\r\n* Are well organised and able to plan.\r\n* Are able to reflect on their own experiences and apply learning to future actions. \r\n* Have a commitment to their own career development.\r\n","otherRequirements":"Ideally you will have secondary school experience in the UK and will have spent time within the subject you are applying to teach.\r\n\r\nComplete relevant checks to ensure you have the health and physical capacity to teach.\r\n\r\nAgree to abide by the University of Birmingham Code of Professional Conduct and Fitness to Practise. \r\n\r\nAn enhanced disclosure certificate from the Disclosure and Barring Service will also be required before commencing the programme.","status":2,"createdAt":"2021-07-06T10:57:00.808Z","canSponsorStudentVisa":"yes","cycle":"2024"}
