{"id":"69c28a50-9205-40b1-bdf0-ded7c08f9d73","name":"Mathematics","code":"27V7","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"72345aa7-096c-488f-8649-085b8178cadb","code":"G1","name":"Mathematics"}],"locations":[{"id":"4c0b96fc-67cc-4a83-997a-d68484691d7f","name":"Main Site","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"3c613eb7-ccea-4af6-aa86-db5e1fa3f9e3","code":"1VK","name":"Lordswood Girls’ School and Sixth Form Centre"},"accreditedBody":{"id":"4da5abb2-b287-451e-8d75-c5b79e11c2bb","code":"W75","name":"University of Wolverhampton"},"profPost":"PG","english":"2","maths":"2","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9000,"aboutCourse":"The School Direct course follows the university PGCE programme and teaching is shared between the university and placement school. As a School Direct student you will spend 120 days training in school and approximately 50 days training at the university's Walsall Campus. \r\n\r\nWhilst you are training in school you will be assigned two mentors, a senior mentor and a subject mentor who will support and monitor your progress. Regular meetings with your mentors will provide feedback and help you to set targets. CPD sessions tailored to your needs as a trainee teacher will be delivered throughout the year in addition to staff meetings, whole school CPD sessions and INSET days. ","interviewProcess":"The University of Wolverhampton will short-list applications based upon the course entry requirements. Successful applicants will be invited to attend a school assessment at Lordswood Girls' School and an interview at the university.\r\n\r\nDuring the university interview you will be expected to answer questions supporting your application and complete a subject knowledge audit. All original certificates for GCSE, degree qualifications and results of professional skills tests, if completed, will be required at interview. You will also need to bring proof of identity in the form of a passport or photo driving licence.\r\n","howSchoolPlacementsWork":"During the programme you will complete two placements at a secondary school and a third shorter primary school placement. \r\n\r\nDuring your secondary school placements you will experience teaching students across the 11-18 age range. \r\n\r\nPlacement schools are selected through negotiation with successful candidates and our partner schools offering training placements.","personalQualities":"Applicants should demonstrate that they can:\r\n\r\n* Communicate effectively with adults and young people.\r\n\r\n* Reflect on any recent experience they have of teaching and their own learning.\r\n\r\n* Articulate their perceived professional learning needs.","otherRequirements":"Ideally you will have secondary school experience in the UK and will have spent time within the subject you are applying to teach.\r\n\r\nAll candidates called to interview will be required to complete a medical fitness declaration.\r\n\r\nAn enhanced disclosure certificate from the Disclosure and Barring Service will also be required before commencing the programme.","status":2,"createdAt":"2021-07-12T13:49:39.659Z","canSponsorStudentVisa":"yes","cycle":"2024"}
