{"id":"04890fca-4915-4153-9f09-0cce37a5323e","name":"History","code":"2G7P","qualification":"pgce_with_qts","startDate":"2022-09-01T09:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"5a3609a0-5bbb-4377-b919-5d89932ab622","code":"V1","name":"History"}],"locations":[{"id":"844337b1-30b6-4bd1-9719-c47881dfee30","name":"Wealden Partnership - Lead School","isPublished":"true","status":"running","vacancies":"full_time"}],"trainingProvider":{"id":"9f06154d-1fed-4ea4-bdce-0c0d8528e463","code":"1Z2","name":"Wealden Partnership"},"accreditedBody":{"id":"4d4cceab-1516-4a6c-a9ab-5de0e32e1fe1","code":"S90","name":"University of Sussex"},"profPost":"PG","degreeGrade":"1","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Sussex University require candidates to source and undertake GCSE Equivalency tests at their own expense. We can accept equivalency test passes from 'A Star' and 'Equivalency testing.com'.","courseLength":"OneYear","feesUK":9250,"financialSupport":"Up-to-date information about financial support can be found [here] (https://getintoteaching.education.gov.uk/funding-your-training)","aboutCourse":"The training will be delivered both at the university and by staff at the partnership schools.\r\n\r\nOur School Direct course is offered as a 1 year full-time programme. Successful candidates will be awarded Qualified Teacher Status (QTS) and a PGCE of 90 Masters Level Credits allowing  progress onto the University of Sussex Part-time Masters in Education for Early career Teachers. \r\n\r\nOur course provides carefully structured, professional learning opportunities which enable trainees to critically and effectively progress in planning, teaching and assessing. Together, university teacher educators and excellent classroom practitioners share their enthusiasm and professional knowledge to give you opportunities to focus on how to best creatively engage, enthuse and develop your students across Key Stage 3, Key Stage 4 and Key Stage 5 age ranges.\r\n\r\nThe Sussex course brings together education theory and practice encouraging you to critically reflect on approaches to learning and teaching. Excellent teachers from our partnership schools are seconded to the tutor team in most subjects and contribute additional currency to teaching and trainee support.   \r\n\r\nYou will attend a full-time three week induction course on the university Campus during September to prepare you for starting your school placement with us towards the end of the month.\r\n\r\nFull-time candidates spend Monday to Thursday each week training in one of our partnership schools and attending the University Campus on Fridays for lectures, workshops and seminars with our team of experienced subject tutors. \r\n\r\nOver the year you will be placed in two different schools and required to pass both placements. Additional assessments are via a Masters level essay submitted in late February and an innovative Viva style Masters level exit interview at the end of the course.\r\n\r\nFurther information on the course can be found [here](http://www.sussex.ac.uk/education/ite/schooldirect) and [here] (http://www.sussex.ac.uk/education/ite/pgceandschooldirectsecondary/history). ","interviewProcess":"Applicants who meet the entry requirements will be invited to a Sussex selection event either face to face or online via Zoom. Following a successful interview, the partnership will then invite the candidate for a school interview.\r\n\r\nThe selection event:\r\n\r\nBefore: \r\n* Listen to a video talk giving further information about the Sussex course\r\n* Complete paperwork including our 'Suitability for Teaching Declaration'. \r\n\r\nOn the day:\r\n* An individual online interview or face to face with a Sussex tutor and an experienced  teacher.\r\n* Deliver a short pre-prepared classroom type teaching task or presentation to the panel. \r\n* Show a form of photo ID on camera or in person for checking\r\n* An opportunity to ask any questions you may have.\r\n\r\nAfter: \r\n* If we offer you a place and you decide to accept we will need to see your original Undergraduate Degree certificate, and GCSE Maths and English certificates \r\n\r\nHeathfield Community College is the lead school in the partnership and will be co-ordinating the partnership's interview process. Interviews may take place online or face-to-face and will include the delivery of a presentation about a teaching activity you have previously undertaken, a short written task related to a current educational issue and the formal interview. Subject staff and at least one Professional Tutor will be involved in the interviews.\r\n\r\nShowing  an awareness of the curriculum and school life is part of the selection process so if possible candidates may wish to spend time in an appropriate school setting beforehand.\r\n","howSchoolPlacementsWork":"You will undertake two periods of Professional Practice in two contrasting schools over the academic year September to June, training to teach in Key Stage 3 (11-14), Key Stage 4 (14-16) and Key Stage 5 (16-18).\r\n\r\nPlacement 1: End of September to February half term. Trainees benefit from a serial placement where the working week is divided between four days in school and a day of reflection and training at the University on Fridays. This ensures a weekly focus on theory and pedagogy as well as practice.\r\n\r\nPlacement 2: February Half term to Easter in a contrasting school or college with a return to your original placement school until May half term to complete the course. There are fewer University days to give you experience of working a 5 day school week. \r\n\r\nWe are also proud to offer an innovative optional training strand in Special Educational Needs and Disability (SEND) which includes enhanced training opportunities and a bespoke Placement 2 in a local partnership special school. This strand would suit any trainee interested in working in a SEND environment.","personalQualities":"* A passion for the subject you wish to teach and interest and involvement beyond your degree\r\n* A strong knowledge and understanding of the subject you are applying to teach, and a sound awareness of how the subject is taught within UK secondary schools\r\n* Effective communication and organisational skills\r\n* Awareness of current educational developments and issues\r\n* Experience with young people and commitment to developing individuals\r\n* The ability to evaluate practice and address your weaknesses\r\n* Initiative, flexibility and responsiveness to change\r\n* A sense of responsibility and ability to work in a team.\r\n\r\n","otherRequirements":"We would expect you to have some experience of working with young people in this age group. It is an advantage to have undertaken some recent classroom observation in your subject area. \r\n\r\nYou must not be excluded from working with children, as a result of a criminal record or other reason. The Disclosure and Barring Service provides access to records held nationwide through its disclosure service. All trainees must obtain successful DBS clearance before starting an Initial Teacher Education programme.\r\n\r\nAll trainees must be screened for mental and physical fitness to teach by the University's Occupational Health Department before admission.","status":1,"createdAt":"2021-10-01T14:41:14.846Z","updatedAt":"2021-10-01T14:42:09.127Z"}