{"id":"8a211d25-fabe-4a46-a368-21b78b74bdd3","name":"Modern Languages","code":"2RKH","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"ce8523ef-9236-4cd9-b260-d826c7a521b3","code":"ML","name":"Modern Languages"},{"id":"4608e5e3-2a1a-48a1-8236-56c7af5a139d","code":"24","name":"Modern languages (other)"}],"locations":[{"id":"844337b1-30b6-4bd1-9719-c47881dfee30","name":"Wealden Partnership - Lead School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"9f06154d-1fed-4ea4-bdce-0c0d8528e463","code":"1Z2","name":"Wealden Partnership"},"accreditedBody":{"id":"4d4cceab-1516-4a6c-a9ab-5de0e32e1fe1","code":"S90","name":"University of Sussex"},"profPost":"PG","degreeGrade":"1","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Sussex University require candidates to source and undertake GCSE Equivalency tests at their own expense. We can accept equivalency test passes from 'A Star' and 'Equivalency testing.com'.","courseLength":"OneYear","feesUK":9250,"financialSupport":"Up-to-date information about financial support can be found [here] (https://getintoteaching.education.gov.uk/funding-your-training)","aboutCourse":"The training will be delivered both at the university and by staff at the partnership schools.\r\n\r\nOur training is supported by the University of Sussex which has a long and successful tradition in teacher education in partnership with local schools. Candidates on a School Direct Tuition Fee or Salaried place with University of Sussex will be automatically registered on the Sussex PGCE which offers up to 90 Master credits and enables progression onto a part-time MEd in the NQT year and beyond if you wish and is equivalent to half a Masters degree. \r\n\r\nYou will receive the same high quality level of training and support from the University of Sussex as would a traditional Sussex PGCE candidate in addition to the many benefits of undertaking a school–based model of training with our strong partnership of schools.\r\n\r\nUniversity of Sussex tutors work with us to provide high quality inputs on how to teach and assess in a variety of secondary subjects. The University also provides a comprehensive programme of professional studies which complements the school-based training offered across our partnership. \r\n\r\nThis training features a mix of lectures, workshops, tutorials and school visits led by University of Sussex education faculty, excellent teachers from partnership schools and other educational experts. These sessions also allow you to share your experiences with other trainee teachers and reflect upon the learning and teaching you engage with in schools during the week. \r\n \r\nEvery trainee is expected to complete academic assignments at Masters level which are designed to develop knowledge and understanding, encourage reflection and assess progress against the Teachers’ Standards. The University works in partnership with the school to organise a final assessment and make a recommendation for Qualified Teacher Status (QTS). A university subject specialist tutor will be assigned to support you whilst on the programme and you will be eligible to access a range of support services provided by the University. \r\n\r\nYou will spend the majority of the year in your main placement school. We then arrange for you to undertake a shorter ‘contrasting’ placement in another school during the year. For secondary the shorter placement takes place for 6 weeks after February half term. \r\n\r\nFurther information on the course can be found [here](http://www.sussex.ac.uk/education/ite/schooldirect). ","interviewProcess":"If we are interested in pursuing your application we will pass your details to the University of Sussex and you will be interviewed by the University in the first instance before being interviewed by the partnership. \r\n\r\nHeathfield Community College is the lead school in the partnership and will be co-ordinating the interview process. Interviews may take place online or face-to-face. This will involve approximately 2-3 hours spent at one of the partnership schools and will include the delivery of a presentation about a teaching activity you have previously undertaken, a short written task related to a current educational issue and the opportunity to talk to some staff and pupils as well as the formal interview. \r\n\r\nSubject staff and at least one Professional Tutor will be involved in the interviews.\r\n","howSchoolPlacementsWork":"You will complete your main teaching placements in one of our schools and your contrasting placement in a different partnership school. \r\n\r\nAll four schools are able to provide access to post-16 learners and the opportunity to experience 6th form teaching in a successful and supportive environment.\r\n\r\nWe are keen to ensure that placement schools work for both the trainee and schools. Therefore are happy to discuss placement school preferences during the interview process. ","personalQualities":"We are looking for well-qualified, committed and enthusiastic trainee teachers who are passionate about languages and keen to share this passion with young people of all abilities in the secondary age range.\r\n\r\n","otherRequirements":"We would expect you to have some experience of working with young people in this age group, possibly in a sports club or similar. \r\n\r\nIt is an advantage to have done some recent classroom observation in your subject area before you come to interview.","status":1,"createdAt":"2021-07-06T10:50:47.884Z","updatedAt":"2021-09-24T15:31:18.421Z","canSponsorStudentVisa":"yes","cycle":"2024"}
