{"id":"334dab93-b016-45e7-939a-469b6a2e6553","name":"Modern Languages (Spanish with French)","code":"RX44","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"9727f674-61ba-4efa-b1f2-21ec7e354442","code":"15","name":"French"},{"id":"ce8523ef-9236-4cd9-b260-d826c7a521b3","code":"ML","name":"Modern Languages"},{"id":"e34fd2a3-a32e-44e9-aea1-666badf3ac03","code":"22","name":"Spanish"}],"locations":[{"id":"c9ee5046-3f49-4804-991b-e99bbe8b2247","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"3e6c62a3-5d34-4a91-9c23-01c7409fd909","code":"L34","name":"University of Leicester"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We accept equivalency tests from EquivalencyTesting.com or Birmingham City University.","courseLength":"OneYear","feesUK":9250,"feesInternational":16850,"feeDetails":"PGCE students can apply for loans from Student Finance England and may be entitled to a [tax-free bursary] - (https://getintoteaching.education.gov.uk/funding-my-teacher-training/bursaries-and-scholarships-for-teacher-training)\r\n\r\nPlease note that International students will not be eligible for bursaries offered by the Department for Education. For more information, please visit the [Get into Teaching website] - (https://getintoteaching.education.gov.uk/funding-my-teacher-training/bursaries-and-scholarships-for-teacher-training)\r\n\r\n","financialSupport":"The University of Leicester offer a range of scholarships and funding. Please visit our [website to find out more]: (https://le.ac.uk/study/postgraduates/fees-funding/scholarships-discounts)","aboutCourse":"PGCE Modern Languages at Leicester is offered in the following combinations:\r\n\r\n* French\r\n\r\n* French with German\r\n\r\n* French with Spanish\r\n\r\n* Spanish with French\r\n\r\nThe main purpose of the programme is to enable you to be a confident, competent and reflective teacher of Modern Languages, capable of making a full contribution to the effectiveness of a modern languages department in a British secondary school\r\n\r\nPGCE Secondary Modern Languages offers you the opportunity to:\r\n\r\n* Reflect on the purposes of learners of another language; \r\n\r\n* Examine theories of foreign/second language acquisition; \r\n\r\n* Form your own coherent style of teaching; \r\n\r\n* Critically evaluate the National Curriculum and current thinking; \r\n\r\n* Evaluate materials and techniques for teaching and testing; \r\n\r\n* Create and use your own teaching materials; \r\n\r\n* Take account of the needs of different learners; \r\n\r\n* Investigate various methodologies; and \r\n\r\n* Observe a range of practices \r\n\r\nThe Modern Languages subject specialism will cover a variety of areas including:\r\n\r\n* The history of foreign language teaching; \r\n\r\n* Communicative Language Teaching; \r\n\r\n* GCSE Specifications; \r\n\r\n* Teaching Speaking and Listening\r\n\r\n* Teaching Reading and Writing\r\n\r\n* ICT and language teaching\r\n\r\n* Creativity in language teaching\r\n\r\n* Lesson planning and classroom management\r\n\r\nContinuous assessment is used throughout the course and there are no examinations.\r\n\r\nApplicants for all language combinations should preferably have an upper second honours degree but applicants with 2:2 degrees may also be considered. The degree should be in languages you wish to teach. With the exception of Spanish with French, it is an expectation that you are able to offer French to classes at all levels in secondary school/college (11-18). \r\n\r\nStudents with joint or combined honours degrees in which French is a major subject are also welcome to apply, for example, graduates in French and Law, French and Classical Studies, European Studies, French and Business Studies. In addition, we welcome applications from native speakers with honours degrees or equivalent.  As a guideline, your main language should have comprised at least 50% of the degree course or equivalent.\r\n\r\nIn exceptional circumstances we accept applicants whose degree does not meet these general guidelines, looking at each individual case on its merits. You may therefore wish to make out a case for the relevance of your degree on your application form. \r\n","interviewProcess":"Candidates who pass the screening stage of the recruitment process will be invited to attend an interview at the University of Leicester. If you are a school direct applicant you will also be invited to an interview at the lead school. The interview at the University of Leicester will typically last a full day and will include a tour of the School of Education. \r\n\r\nYou will be introduced to a written subject task that you will complete on the day. The interview is not a daunting process but rather a discussion about your suitability and preparation for going into teaching. During the interview, you will explore any additional preparation needed to help put you in the best possible position to engage successfully with the course from the start.\r\n\r\nWhere Subject Knowledge Enhancement (SKE) courses are available for the subject this will be discussed with you at interview. If it is considered essential for you to complete a SKE then it will be made a condition of any offer of a place.\r\n","howSchoolPlacementsWork":"You will undertake two secondary teaching placements in our Partnership Schools. Leicester is ideally placed to offer the opportunity to work in both inner city and rural environments, with pupils from a wide range of ethnic backgrounds. We try to place students in contrasting schools to ensure you have a rich and varied experience in your initial training year and that you have the opportunity to teach across the 11-18 age range.\r\n\r\nThe placements are referred to as 'Phase A' and 'Phase B' placements.\r\n\r\nPhase A\r\n\r\nIn planning your placements, your subject tutor will try to balance the distance you are asked to travel with your individual needs and our knowledge of our wide range of school partners. \r\n\r\nAfter induction you will spend 8 weeks in your Phase A placement school.  You will build on existing experience and develop new skills with support from the school's Coordinator for Initial Teacher Education and a subject mentor who will oversee your professional development during the placement and liaise closely with your university tutor who will also support you.  During this placement you will be expected to fulfil a 50% timetable.   \r\n\r\nPhase B\r\n\r\nDuring your second placement you will spend about 14 weeks in a different school, also supported by a mentor, ITE Coordinator and university tutor.  During this placement you will be expected to fulfil a 66% timetable.  \r\n\r\nAll students will also undertake a week in a primary school following their Phase A placement to support their understanding of the broader context of education and to support writing of one of the PGCE assignments.","personalQualities":"Applicants are required to demonstrate at interview both accuracy and fluency in the use of their languages, as well as genuine enthusiasm for their teaching. \r\n\r\nWe would encourage applicants to spend some time observing, possibly supporting, learners and teachers in secondary modern language classrooms in the UK to become familiar with current developments.\r\n\r\nThe PGCE is a challenging course, and we are looking for applicants with a wide range of skills, knowledge, experiences and an aptitude for teaching.  These skills include the ability to form relationships, good communication, commitment to learning and teaching and reflective qualities. \r\n\r\n","otherRequirements":"Admission to the course is subject to a satisfactory medical report. The University will provide more information about this should you be offered a place.\r\n\r\nAll offers are subject to a satisfactory enhanced DBS disclosure. We will provide instructions regarding the DBS application process once you have accepted an offer of a place on the course.\r\n\r\n\r\n","status":1,"createdAt":"2021-07-06T10:56:36.344Z","updatedAt":"2021-10-05T07:51:51.495Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
