{"id":"354161a3-4586-47f2-8434-9e180d651840","name":"History","code":"28M2","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"5a3609a0-5bbb-4377-b919-5d89932ab622","code":"V1","name":"History"}],"locations":[{"id":"c9ee5046-3f49-4804-991b-e99bbe8b2247","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"3e6c62a3-5d34-4a91-9c23-01c7409fd909","code":"L34","name":"University of Leicester"},"profPost":"BO","degreeGrade":"0","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We accept equivalency tests from EquivalencyTesting.com or Birmingham City University.","courseLength":"OneYear","feesUK":9250,"feesInternational":16850,"feeDetails":"PGCE students can apply for loans from Student Finance England and may be entitled to a [tax-free bursary] - (https://getintoteaching.education.gov.uk/funding-my-teacher-training/bursaries-and-scholarships-for-teacher-training)\r\n\r\nPlease note that International students will not be eligible for bursaries offered by the Department for Education. For more information, please visit the [Get into Teaching website] - (https://getintoteaching.education.gov.uk/funding-my-teacher-training/bursaries-and-scholarships-for-teacher-training)\r\n\r\n","financialSupport":"The University of Leicester offer a range of scholarships and funding. Please visit our [website to find out more]: (https://le.ac.uk/study/postgraduates/fees-funding/scholarships-discounts)","aboutCourse":"History student teachers within the History, Geography, RE and Social Sciences subject specialisms are taught as a PGCE Humanities group. You will have specialist inputs on your chosen subject and also gain experience of issues in planning and teaching cross-curricular work within the Humanities. Your two school placements are in your specialist subjects.\r\n\r\nWe are committed to History being taught as a lively, thought provoking subject.\r\n\r\nPGCE Secondary History aims to:\r\n\r\n* Model good practice for your work with pupils, with an emphasis on active, student-centred learning; \r\n\r\n* Help you develop varied, imaginative strategies for use in the classroom\r\ndemonstrate how artefacts, original documents and photographs, drama, role play and re-enactment, oral and local history and fieldwork can be used to enhance pupils’ learning;\r\n\r\n* Develop your capacity to reflect on the nature of the key concepts of History in order to be able to teach them well; \r\n\r\n* Provide you with opportunities to develop collaboratively with other History specialist trainees\r\n\r\n* Develop your understanding of your professional role as one which contributes within a department and whole school communities. \r\n\r\nThe course for History will help you to understand various frameworks for teaching the subject. Alongside regulatory frameworks and curriculum requirements the course helps you to understand the relationship of the school subject to Schools and Society, school history’s clear links with History as an Academic Discipline and to wider issues such as Historical Identity and communities.\r\n\r\nContinuous assessment is used throughout the course and there are no examinations\r\n\r\nApplications are welcome from students with good/very good qualifications in their History qualifications at GCSE and AS/A level (or equivalent) and at honours degree level. Those students with joint or combined honours degrees in which History is a major subject are also welcome to apply. \r\n\r\nStudents with degrees in a range of academic backgrounds including Classical Studies, Law, International Relations and Government and Politics may also be considered, although post-graduate study in History would be desirable in these circumstances.  \r\n\r\nIn all cases applicants are required to have an A level History qualification and should be able to demonstrate a genuine interest in and enthusiasm for History at interview. \r\n","interviewProcess":"Candidates who pass the screening stage of the recruitment process will be invited to attend an interview at the University of Leicester. If you are a school direct applicant you will also be invited to an interview at the lead school. The interview at the University of Leicester will typically last a full day and will include a tour of the School of Education. \r\n\r\nYou will be introduced to a written subject task that you will complete on the day. The interview is not a daunting process but rather a discussion about your suitability and preparation for going into teaching. During the interview, you will explore any additional preparation needed to help put you in the best possible position to engage successfully with the course from the start.\r\n\r\nWhere Subject Knowledge Enhancement (SKE) courses are available for the subject this will be discussed with you at interview. If it is considered essential for you to complete a SKE then it will be made a condition of any offer of a place.\r\n","howSchoolPlacementsWork":"You will undertake two secondary teaching placements in our Partnership Schools. Leicester is ideally placed to offer the opportunity to work in both inner city and rural environments, with pupils from a wide range of ethnic backgrounds. We try to place students in contrasting schools to ensure you have a rich and varied experience in your initial training year and that you have the opportunity to teach across the 11-18 age range.\r\n\r\nThe placements are referred to as 'Phase A' and 'Phase B' placements.\r\n\r\nPhase A\r\n  \r\nIn planning your placements, your subject tutor will try to balance the distance you are asked to travel with your individual needs and our knowledge of our wide range of school partners. \r\n\r\nAfter induction you will spend 8 weeks in your Phase A placement school.  You will build on existing experience and develop new skills with support from the school's Coordinator for Initial Teacher Education and a subject mentor who will oversee your professional development during the placement and liaise closely with your university tutor who will also support you.  During this placement you will be expected to fulfil a 50% timetable.   \r\n\r\nPhase B\r\n\r\nDuring your second placement you will spend about 14 weeks in a different school, also supported by a mentor, ITE Coordinator and university tutor.  During this placement you will be expected to fulfil a 66% timetable.  \r\n\r\nAll students will also undertake a week in a primary school following their Phase A placement to support their understanding of the broader context of education and to support writing of one of the PGCE assignments.","personalQualities":"You should be able to demonstrate genuine interest and enthusiasm for History at interview. \r\n\r\nApplicants without History as a major subject are expected to undertake essential background reading before the course starts.  \r\n\r\nWe expect all prospective students to have spent some days observing, possibly assisting, learners and teachers in History/Humanities classrooms to familiarise themselves with current developments.\r\n\r\n\r\nThe PGCE is a challenging course, and we are looking for applicants with a wide range of skills, knowledge, experiences and an aptitude for teaching.  These skills include the ability to form relationships, good communication, commitment to learning and teaching and reflective qualities. \r\n\r\n \r\n","otherRequirements":"Admission to the course is subject to a satisfactory medical report. The University will provide more information about this should you be offered a place.\r\n\r\nAll offers are subject to a satisfactory enhanced DBS disclosure. We will provide instructions regarding the DBS application process once you have accepted an offer of a place on the course.\r\n\r\n \r\n","status":1,"createdAt":"2021-07-06T10:56:35.808Z","updatedAt":"2021-10-05T07:42:13.220Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
