{"id":"a4cd374f-9411-48e7-9efc-a1a7f0450993","name":"Chemistry","code":"F2X1","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"912d4fb4-761b-42e9-8dc6-e968b791ea4e","code":"F1","name":"Chemistry"}],"locations":[{"id":"c9ee5046-3f49-4804-991b-e99bbe8b2247","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"3e6c62a3-5d34-4a91-9c23-01c7409fd909","code":"L34","name":"University of Leicester"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We accept equivalency tests from EquivalencyTesting.com or Birmingham City University.","courseLength":"OneYear","feesUK":9250,"feesInternational":16850,"feeDetails":"PGCE students can apply for loans from Student Finance England and may be entitled to a [tax-free bursary] - (https://getintoteaching.education.gov.uk/funding-my-teacher-training/bursaries-and-scholarships-for-teacher-training)\r\n\r\nPlease note that International students will not be eligible for bursaries offered by the Department for Education. For more information, please visit the [Get into Teaching website] - (https://getintoteaching.education.gov.uk/funding-my-teacher-training/bursaries-and-scholarships-for-teacher-training)\r\n\r\n","financialSupport":"The University of Leicester offer a range of scholarships and funding. Please visit our [website to find out more]: (https://le.ac.uk/study/postgraduates/fees-funding/scholarships-discounts)","aboutCourse":"The PGCE Secondary Science programme aims to:\r\n\r\n* develop your understanding of the role of Science teachers both within the department and in their wider professional responsibilities;\r\n* introduce you to current theories and practice in Science teaching;\r\n* help develop your academic and critical thinking skills to support effective Science teaching and learning for all your students;\r\n* help you set high expectations for yourself and your students; and\r\n* help you to understand what contribution Science education can make to the wider education of young people.\r\n\r\nThe Science course supports the core PGCE Teacher Development Course, through:\r\n\r\n* Specialist sessions to develop your curriculum subject knowledge;\r\n* Exploring effective teaching and learning in Science classrooms;\r\n* Consideration of the role of practical work and your responsibility for safe classroom practice;\r\n* Developing reflective practice to support your planning, delivery and evaluation of lessons; and\r\n* Developing an understanding of recent curriculum change.\r\n\r\nField coursework in October supports team building for collaborative work, helps develop subject knowledge across the sciences and a practical understanding of learning outside the classroom.\r\n\r\nIn addition to your specialist subject sessions and core science sessions, you will be allocated to a mixed team of specialists from all science disciplines in order to develop pedagogy related to science teaching. \r\n\r\nMixed teams and whole science sessions will include focus on:\r\n\r\n* The science curriculum\r\n* Lesson planning\r\n* Behaviour for learning and classroom management\r\n* Assessment\r\n* Literacy and numeracy in science\r\n* Differentiation and inclusion\r\n* Earth science\r\n* ICT in science, including data logging\r\n* Teaching controversial issues in Science\r\n* The Nature of Science\r\n* Science outside the classroom\r\n* Safety issues and risk assessment\r\n* Classroom practice related to learning theories\r\n* Demonstrations and practicals\r\n\r\nContinuous assessment is used throughout the course and there are no examinations.\r\n\r\nApplications are welcome from students with good qualifications in their science qualifications at GCSE and AS/A level Chemistry (or equivalent) and at honours degree level. Those candidates with a Biochemistry degree might wish to consider whether our Biology or Chemistry specialism might be most appropriate. \r\n\r\nApplicants will be required to teach across all three sciences to GCSE so some subject knowledge development work is expected before the course begins.","interviewProcess":"Candidates who pass the screening stage of the recruitment process will be invited to attend an interview at the University of Leicester. If you are a school direct applicant you will also be invited to an interview at the lead school. The interview at the University of Leicester will typically last a full day and will include a tour of the School of Education. \r\n\r\nYou will be introduced to a written subject task that you will complete on the day. The interview is not a daunting process but rather a discussion about your suitability and preparation for going into teaching. During the interview, you will explore any additional preparation needed to help put you in the best possible position to engage successfully with the course from the start.\r\n\r\nWhere Subject Knowledge Enhancement (SKE) courses are available for the subject this will be discussed with you at interview. If it is considered essential for you to complete a SKE then it will be made a condition of any offer of a place.\r\n","howSchoolPlacementsWork":"You will undertake two secondary teaching placements in our Partnership Schools. Leicester is ideally placed to offer the opportunity to work in both inner city and rural environments, with pupils from a wide range of ethnic backgrounds. We try to place students in contrasting schools to ensure you have a rich and varied experience in your initial training year and that you have the opportunity to teach across the 11-18 age range.\r\n\r\nThe placements are referred to as 'Phase A' and 'Phase B' placements.\r\n\r\nPhase A\r\n\r\nIn planning your placements, your subject tutor will try to balance the distance you are asked to travel with your individual needs and our knowledge of our wide range of school partners. \r\n\r\nAfter induction you will spend 8 weeks in your Phase A placement school.  You will build on existing experience and develop new skills with support from the school's Coordinator for Initial Teacher Education and a subject mentor who will oversee your professional development during the placement and liaise closely with your university tutor who will also support you.  During this placement you will be expected to fulfil a 50% timetable.   \r\n\r\nPhase B\r\n\r\nDuring your second placement you will spend about 14 weeks in a different school, also supported by a mentor, ITE Coordinator and university tutor.  During this placement you will be expected to fulfil a 66% timetable.  \r\n\r\nAll students will also undertake a week in a primary school following their Phase A placement to support their understanding of the broader context of education and to support writing of one of the PGCE assignments.","personalQualities":"We are interested in candidates showing enthusiasm for their subject in a variety of ways, for example, by their reading, leisure pursuits, attendance at local/national Science events. \r\n\r\nWe also expect a reasonable level of awareness of major recent and current issues in education and developments in science. \r\n\r\nThe PGCE is a challenging course, and we are looking for applicants with a wide range of skills, knowledge, experiences and an aptitude for teaching.  These skills include the ability to form relationships, good communication, commitment to learning and teaching and reflective qualities.\r\n","otherRequirements":"Admission to the course is subject to a satisfactory medical report. The University will provide more information about this should you be offered a place.\r\n\r\nAll offers are subject to a satisfactory enhanced DBS disclosure. We will provide instructions regarding the DBS application process once you have accepted an offer of a place on the course.\r\n","status":1,"createdAt":"2021-07-06T10:56:35.969Z","updatedAt":"2021-10-05T07:39:07.399Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
