{"id":"af0296cb-7d81-4103-a369-2abde610287d","name":"Mathematics","code":"F525","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"72345aa7-096c-488f-8649-085b8178cadb","code":"G1","name":"Mathematics"}],"locations":[{"id":"c9ee5046-3f49-4804-991b-e99bbe8b2247","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"3e6c62a3-5d34-4a91-9c23-01c7409fd909","code":"L34","name":"University of Leicester"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We accept equivalency tests from EquivalencyTesting.com or Birmingham City University.","courseLength":"OneYear","feesUK":9250,"feesInternational":16850,"feeDetails":"PGCE students can apply for loans from Student Finance England and may be entitled to a [tax-free bursary] - (https://getintoteaching.education.gov.uk/funding-my-teacher-training/bursaries-and-scholarships-for-teacher-training)\r\n\r\nPlease note that International students will not be eligible for bursaries offered by the Department for Education. For more information, please visit the [Get into Teaching website] - (https://getintoteaching.education.gov.uk/funding-my-teacher-training/bursaries-and-scholarships-for-teacher-training)\r\n\r\n","financialSupport":"The University of Leicester offer a range of scholarships and funding. Please visit our [website to find out more]: (https://le.ac.uk/study/postgraduates/fees-funding/scholarships-discounts)","aboutCourse":"Mathematics encompasses the study of number, algebra, ratio, proportion and rates of change, geometry and measures, probability and statistics.  At Leicester we strive to ensure you become an effective practitioner of mathematics education with the ability to excite and engage pupils.\r\n\r\nYou will learn from some of the best practitioners in the field and learn how to become an effective practitioner.  The programme will cover all areas of the National Curriculum for Mathematics, and will also address national testing, extra curricular learning opportunities and your own professional development.\r\n\r\nThere are tax-free bursaries available for eligible students.  The Institute of Mathematics and its Applications is also offering Teacher Training Scholarships to Mathematics graduates. For more information, please visit the Get into Teaching website.\r\n\r\nPCGE Secondary Mathematics 11-16 aims to:\r\n\r\n* Broaden and deepen your knowledge and understanding of mathematics for teaching purposes; \r\n* Develop your understanding and insight into the ways in which mathematics is learned and potential difficulties; \r\n* Provide an informed and critical view of National Curriculum requirements;\r\n* Provide an overview of the requirements for teaching posy 16 Mathematics; \r\n* Provide up-to-date knowledge and experience of curriculum materials, developments in assessment and examinations, and the potential of technology;  \r\n* Provide a broad range of teaching and learning methods to cater for a full range of pupils; and\r\n* Develop your skills in planning, communication, assessment, recording and evaluation\r\n\r\nThe mathematics subject specialism will cover a variety of areas including:\r\n* The mathematics curriculum; \r\n* Lesson planning; \r\n* Subject knowledge: approaches to teaching and learning, including common misconceptions; \r\n* Teaching mathematics using technology; \r\n* Assessment of and for learning; \r\n* Theories of learning and teaching; \r\n* Communicating mathematically; \r\n* Differentiating to enable all pupils to reach their potential; \r\n* Teaching approaches to support problem solving; and \r\n* Maths outside the classroom.\r\n\r\nContinuous assessment is used throughout the course and there are no examinations.\r\n\r\nThose applicants with joint or combined honours degrees in which Mathematics is a major subject are also welcome to apply. \r\n\r\nApplicants with degrees in a range of academic backgrounds including engineering, economics and physics have previously made successful applications.\r\n\r\nApplicants without mathematics as a substantial part of their degree may, in some circumstances, be able to undertake a Subject Knowledge Enhancement course in lieu of the honours level mathematics.\r\n\r\n","interviewProcess":"Candidates who pass the screening stage of the recruitment process will be invited to attend an interview at the University of Leicester. If you are a school direct applicant you will also be invited to an interview at the lead school. The interview at the University of Leicester will typically last a full day and will include a tour of the School of Education. \r\n\r\nYou will be introduced to a written subject task that you will complete on the day. The interview is not a daunting process but rather a discussion about your suitability and preparation for going into teaching. During the interview, you will explore any additional preparation needed to help put you in the best possible position to engage successfully with the course from the start.\r\n\r\nWhere Subject Knowledge Enhancement (SKE) courses are available for the subject this will be discussed with you at interview. If it is considered essential for you to complete a SKE then it will be made a condition of any offer of a place.\r\n","howSchoolPlacementsWork":"You will undertake two secondary teaching placements in our Partnership Schools. Leicester is ideally placed to offer the opportunity to work in both inner city and rural environments, with pupils from a wide range of ethnic backgrounds. We try to place students in contrasting schools to ensure you have a rich and varied experience in your initial training year and that you have the opportunity to teach across the 11-16 age range.\r\nThe placements are referred to as 'Phase A' and 'Phase B' placements.\r\n\r\nPhase A\r\n\r\nIn planning your placements, your subject tutor will try to balance the distance you are asked to travel with your individual needs and our knowledge of our wide range of school partners. \r\n\r\nAfter induction you will spend 8 weeks in your Phase A placement school.  You will build on existing experience and develop new skills with support from the school's Coordinator for Initial Teacher Education and a subject mentor who will oversee your professional development during the placement and liaise closely with your university tutor who will also support you.  During this placement you will be expected to fulfil a 50% timetable.   \r\n\r\nPhase B\r\n\r\nDuring your second placement you will spend about 14 weeks in a different school, also supported by a mentor, ITE Coordinator and university tutor.  During this placement you will be expected to fulfil a 66% timetable.  \r\n\r\nAll students will also undertake a week in a primary school following their Phase A placement to support their understanding of the broader context of education and to support writing of one of the PGCE assignments.","personalQualities":"In all cases applicants should be able to demonstrate a genuine interest in and enthusiasm for mathematics at interview.\r\n\r\nThe PGCE is a challenging course, and we are looking for applicants with a wide range of skills, knowledge, experiences and an aptitude for teaching. These skills include the ability to form relationships, good communication, commitment to learning and teaching and reflective qualities.","otherRequirements":"Admission to the course is subject to a satisfactory medical report. The University will provide more information about this should you be offered a place.\r\n\r\nAll offers are subject to a satisfactory enhanced DBS disclosure. We will provide instructions regarding the DBS application process once you have accepted an offer of a place on the course.\r\n\r\nEnglish Language Requirements - you must have a GCSE Grade 4 (old grade C) in English Language.\r\n\r\nWe offer an equivalency test in English and/or Mathematics for any successful applicant who does not hold this qualification or an equivalent one.","status":1,"createdAt":"2021-07-06T10:56:36.084Z","updatedAt":"2021-10-05T07:43:54.800Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
