{"id":"6aa60172-8a59-4154-bcd9-0aab4ae90ce6","name":"Primary","code":"2CXT","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"e2b38f57-2b9c-47c2-a912-5a9710f74024","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"8b223ef9-e4d9-4045-b442-47888f1ef66c","code":"1M2","name":"Cornerstone Academy Trust"},"accreditedBody":{"id":"d41a1821-e35b-48eb-bf02-4842872b04a2","code":"E84","name":"University of Exeter"},"profPost":"PG","degreeGrade":"1","english":"1","maths":"1","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":19500,"aboutCourse":"School Direct training at Cornerstone is a year-long school-based experience, leading to a PGCE. The lead school for this programme is Broadclyst Community Primary School (BCPS), an Ofsted-graded outstanding primary school with a significant national and international reputation for innovative use of IT within a broad and balanced curriculum. We work in collaboration with a number of other schools to deliver this programme.\r\n\r\nThe course is accredited at Masters level and offers 30 credits. Join a dynamic team of trainers and recently-qualified teachers who have themselves come through the School Direct programme at the Cornerstone Academy Trust Teaching School. Enjoy working with a unique range of state-of-the-art facilities, equipment and resources that will help you to develop your teaching skills and explore your potential future curriculum leadership specialisms.\r\n\r\nFor each of our courses you will be allocated a base class for your time training at the school. The teacher of that class will be your first point of contact during your training and will be one of the members of staff that will help you plan, observe and support your next steps. Each trainee has a training programme to follow that includes weekly inputs and tasks to develop their skills, including their specialisms. Your specialism could be used in the future to enable you to lead a subject when you have secured a job.\r\n\r\nDuring your year with us, each half term of the programme has a specific focus and these create a progression throughout the year as you go from the initial phase of getting to know the school and the role of the teacher through to being qualified and ready to take on the full responsibility for a class of children and their education.\r\n","interviewProcess":"You will be invited to come for a visit at Broadclyst Primary School, spend some time in a class, speak to a current school direct student and have an interview with the programme lead and CEO. This will include a short presentation from you as to why you would like to train to become a teacher. ","howSchoolPlacementsWork":"\r\nYou will be allocated a base class for your time training at the school. The teacher of that class will be your first point of contact during your training and will be one of the members of staff that will help you plan, observe you teach and give you regular feedback. Each child’s needs are met through good assessment and careful tracking of their progress and as such there will be times when children will work in groups comprised of children from across the year group and key stage. As such you will be working closely with all the staff; teaching and support staff.\r\nYou will also have tasks to achieve during the year and these may well mean that you will have to work with children in classes from across the school and with many of the staff in the school who have specific responsibilities for a specific subject.\r\n\r\nOne of the phases of your training will require you to go to another school to teach. This will be arranged during your first term in school and will take place during the Spring Term.\r\n\r\nFor those following the primary programme, students will be spending a week in Secondary School. This is in the Autumn term and will be a good opportunity to contrast secondary education with primary. During your time at the secondary school you will have some tasks to achieve.\r\nThere will be opportunities for you to observe teaching in other classrooms in the school and depending on your progress through the phases you may be able to visit other schools during the final phases.\r\n","personalQualities":"","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:54:19.408Z","updatedAt":"2021-10-12T15:03:17.600Z","canSponsorStudentVisa":"yes","cycle":"2024"}
