{"id":"1345af29-2e5b-4271-9241-3dc53a4a653b","name":"English","code":"2DTL","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3aed1aa8-ae46-4b68-92bb-a6cc20655c59","code":"Q3","name":"English"}],"locations":[{"id":"950ad0f5-e7ec-4cff-87bc-f71572a065d4","name":"Christ's College","isPublished":"Y","status":"R","vacancies":"F"},{"id":"3fa07ed8-6cf4-444c-9521-8d6a4e9ecc77","name":"Castle View Enterprise Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"c6c468b2-ee2d-427c-b497-13a6f856d047","name":"Emmanuel College","isPublished":"Y","status":"R","vacancies":"F"},{"id":"374d22b7-dd03-44df-a6d6-bbc04de6b9b9","name":"The King's Academy","isPublished":"N","status":"S","vacancies":"F"},{"id":"7d0fccaf-f71f-4eae-a555-dbcdefc2c500","name":"Grace College","isPublished":"Y","status":"R","vacancies":"F"},{"id":"123de83e-8108-41ae-85e8-89bf32c50081","name":"Bede Academy","isPublished":"N","status":"S","vacancies":"F"}],"trainingProvider":{"id":"6ce4dae8-7121-42e7-84ec-efda047b590f","code":"14U","name":"Emmanuel Teacher Training Partnership"},"accreditedBody":{"id":"db2188d3-0047-44ee-92d2-64d1b5e1a939","code":"N21","name":"University of Newcastle Upon Tyne"},"profPost":"BO","degreeGrade":"1","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"This is a one-year full time Initial Teacher Education course leading to the academic award of Postgraduate Certificate of Education (PGCE) and Qualified Teacher Status (QTS). At university, trainees undertake three Masters level modules towards their PGCE: Subject Pedagogy in Practice, Developing Critical Perspectives and Curriculum Development Through Enquiry in Practice. Successful trainees are awarded 60 Masters level credits which they can choose to carry forward to the full Master’s course at a later stage. Our School Direct programme provides a wealth of opportunity for trainees to demonstrate evidence of the Teachers’ Standards required for QTS.\r\n\r\nOur School Direct programme is designed to train teachers in the classroom. Our vision to develop expert teachers and leaders of the future starts with all trainees becoming part of the staff team from the beginning of the academic year. Trainee teachers will learn from experienced colleagues and work closely with the staff in the English department. You will be given experience of KS3, KS4 and KS5. The vast majority of the year is spent in the host school that you apply to and you will be allocated a contrasting placement which will include six weeks of teaching elsewhere. Contrasting placements are key to the development of all trainee teachers in order to develop a broader understanding of different educational settings.","interviewProcess":"Newcastle University’s Admissions Team will conduct an initial eligibility check, to determine whether you meet the eligibility criteria. The school you have applied to will then consider your application and agree whether to invite you to interview. If you are selected for interview, you will be sent information about the interview process, together with guidance on how to prepare. The interview process will take approximately half a day at whichever school you have applied to within the alliance. It is important that you spend some time in the school that you are applying to and you will be given an opportunity to talk to some key staff. You will be required to teach an observed lesson; you will be told in advance about the content and the age group you will be teaching as well as any other relevant information to help you prepare. An interview will be the last part of the day where the professional tutor from the school and an Emmanuel Teacher Training Partnership representative will be present.\r\n","howSchoolPlacementsWork":"You will spend the majority of the year and undertake most of your teaching commitments at your host school. A contrasting placement will be arranged for you with consideration given to your location, transport, childcare, etc. By placing you in a contrasting school you will gain invaluable experience which help you to develop a range of teaching skills. We only use schools that we know will give you the help and support you need during your placement, including a professional tutor and subject mentor. Weekly mentor meetings and at least one formal lesson observation will occur each week during your teaching practices.","personalQualities":"We are looking for trainee teachers who possess a range of personal qualities including:\r\n\r\n* The ability to communicate in English competently, confidently and clearly to a level that facilitates good quality oral and written communication with pupils, parents and colleagues.\r\n* Self-motivation\r\n* Confidence\r\n* Patience\r\n* Compassion\r\n* Enthusiasm\r\n* Resilience\r\n* Initiative\r\n* Team player\r\n* Good organisational skills\r\n* Effective time management\r\n* Passion\r\n* The desire and drive to transform children through education.\r\n","otherRequirements":"You will be required to undergo an enhanced DBS and fitness to teach check to verify your suitability for working with young people. \r\n\r\nWe recommend you spend at least a few recent working days in a UK secondary classroom before applying. This will inform your application and any later performance in the selection process.\r\n\r\nSubject Knowledge Enhancement (SKE) can be organised where necessary and funding arranged to cover costs. You could get a tax-free SKE bursary of £175 per week.","status":1,"createdAt":"2021-07-12T13:48:13.353Z","updatedAt":"2021-09-22T12:45:12.071Z","canSponsorStudentVisa":"yes","cycle":"2024"}
