{"id":"0895da74-28a0-42a2-8d7c-b7080c482ea4","name":"Primary","code":"3B4Z","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"cff6be27-c946-466a-84ce-56f3b92dbe2e","name":"Black Pear Trust Alliance","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"68471e66-c04d-411c-ae0f-cd02f9aa74d3","code":"2HC","name":"Black Pear Trust Alliance"},"accreditedBody":{"id":"6019b3ce-f2f6-4b0e-b2a9-5813d74c4d54","code":"W80","name":"University of Worcester"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":14100,"feeDetails":"\r\n\r\n\r\n","aboutCourse":"Candidates training with the Black Pear Alliance will gain experience in at least two different school settings (located in Worcester, Droitwich, Pershore, Kidderminster and Evesham).  In addition, you will experience teaching across two or more consecutive age ranges selected from the following:  \r\n 3 - 7 pathway:  Ages 3-5 (Foundation stage). Ages 5-7 (School years 1-2)    \r\n\r\n 5 – 11 pathway: Ages 5-7 (School years 1-2). Ages 7-11 (School years 3-6)  \r\n\r\nThe University of Worcester will provide you with a School Experience Tutor and you will have a school based mentor.  The Black Pear Alliance prides itself on providing a broad package of support for trainees and on-going support is also provided by the Black Pear Alliance Lead Mentor (Specialist Leader of Education ).  \r\n\r\n Frequent Black Pear Alliance teaching group sessions (in addition to training at the University of Worcester) provide trainees with expert tuition and support from all schools in the alliance and include topics such as: classroom management, reflective teaching, growth mindset, phonics, working with support staff, SEND, EAL, D&T, and RE. \r\n\r\nWe strongly recommend that you arrange a school visit or come to one of our open days prior to applying for the course. If you would like to  discuss this or find out more about the course, please telephone Hollymount School on 01905 23159 and ask for Mrs Turner or email ITT@blackpeartrust.org\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n ","interviewProcess":"Interviews will be taking place online with the University of Worcester and a representative from the Black Pear  Trust Alliance. In addition, as part of the Black Pear Trust Alliance interview process, you will be asked to come to one of our alliance schools to take part in a classroom based task either prior to or soon after your online interview. \r\n\r\nTrainees are recruited through a rigorous selection process that includes an initial check to ensure that all entry requirements are met. At interview, you may be asked to:\r\n•\tComplete tasks to establish subject knowledge in English and maths\r\n•\tEngage in observed professional discussions on a current educational topic\r\n•\tEngage in discussion with primary lecturers/school partners on a range of education-related questions\r\n•\tYou will be encouraged to discuss current issues in primary and/or early years education, policy and practice\r\nApplicants invited for interview will receive a comprehensive interview pack with detailed information about the day. We want all our applicants to feel prepared and ready for the interview process.\r\n\r\n\r\n","howSchoolPlacementsWork":"There are currently six schools within the Black Pear Alliance, located in Worcester, Droitwich, Kidderminster, Pershore and Evesham.  You may be placed in any of these schools and it is highly recommended that you are able to drive to your placement schools.  \r\n\r\nYou will be placed in one school for first and final school experiences and a different school for your second school experience. \r\n\r\nWhen on placement, it is expected that you will be in school for at least the same hours as your teacher mentor.  The course is demanding and we recommend that you do not undertake  a part-time job alongside the course however, if you require part time work it should be at the weekend. \r\n","personalQualities":"* a genuine passion for teaching \r\n* a knowledge of the national curriculum\r\n* the ability to critically reflect on lessons\r\n* excellent classroom management \r\n* strong and effective communication skills\r\n* resilience and motivation\r\n*a commitment to improve outcomes for all children\r\n\r\n","otherRequirements":"","status":1,"createdAt":"2021-07-12T13:49:28.967Z","updatedAt":"2021-10-04T10:41:30.980Z","canSponsorStudentVisa":"yes","cycle":"2024"}
