{"id":"72fcde7a-6cda-4739-827a-afb5b54ca95b","name":"Mathematics","code":"3CQ3","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"72345aa7-096c-488f-8649-085b8178cadb","code":"G1","name":"Mathematics"}],"locations":[{"id":"0fddcb61-d814-41ad-8d97-fd74a709a040","name":"West Midlands Consortium","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"bffddf6a-937a-439e-9d24-f0c1bd63d290","code":"W53","name":"West Midlands Consortium"},"degreeGrade":"1","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"no","additionalGcseEquivalencies":"You will need to source an equivalency test in English.","courseLength":"OneYear","feesUK":5000,"feeDetails":"Successful applicants, although not employed by their training school, are able to access the DfE bursary for their chosen subject. This is tax-free and paid in 11 monthly instalments directly to the Associate Teacher by West Midlands Consortium.\r\n\r\nThe current fee for the School Direct (Training) programme is £5,000. However, many placement schools pay this directly to West Midlands Consortium on behalf of the Associate Teacher.\r\n","aboutCourse":"The School Direct Training programme offers you a route towards qualifying as a teacher whilst working in one of our Partner schools. Our course is highly effective in nurturing the talents of future generations of outstanding teachers and we have a proven track record of high employment, retention and career progression. We strongly believe in fostering reflective, creative and self-assured practioners who are confident in questioning and rationalising their progress and ability . \r\n\r\nThe School Direct (Training) programme is school-centered and provides an 'on the job' training experience. There are opportunities to observe, and become involved in, the cutting edge practice at one of our partner schools to enhance your teaching and learning and to develop your pedagogical knowledge and understanding. You will benefit, not only from highly experienced course tutors who are at the forefront of educational development, practice and research but also from the specialist support and expertise of practicing teachers and senior leaders.\r\n\r\nThe quality of relationships across our Consortium of schools is outstanding and is developed collaboratively at every stage to ensure that your training is up-to-date and relevant. Effective communication is paramount to the continued success of our partnership, allowing us to map your development needs with the best-placed schools to ensure a tailored programme that is that is designed to suit you. \r\n\r\nWe individualise student learning right from the onset, encouraging Associate Teachers to progress into proficient, effective practioners. You will have access to, and will be supported by, a range of subject experts together with a friendly, approachable team who will both encourage and challenge you to develop into an outstanding teacher. \r\n\r\nAn audit against Teachers’ Standards is completed at the start of the course and is used to help inform our teaching provision and target setting to maximise progression and understanding. Teaching is based on lectures, workshops, skills training and seminars with individual support through one-to-one and group tutorials forming an integral feature of the programme. \r\n\r\nThe School Direct Training programme, which is rooted in the latest research, will enable you to teach your specialist subject across the full secondary age and ability range and will support your development in a range of aspects of your pedagogical development including subject knowledge, teaching and learning skills including assessment for learning, behaviour management, understanding of the National Curriculum and research of relevant literature and educational theories. ","interviewProcess":"After initial selection based on application, successful candidates are invited to an interview where they will participate in a number of activities.  Candidates will be interviewed by either the Director or Chairperson of the Consortium together with a Senior Deputy Head Teacher or experienced subject specialist from the relevant department within the proposed placement school. \r\n\r\nCandidates are able to gain a fuller insight into the nature of the course and the teaching profession during the interview process and a short presentation will give candidates an outline of the School Direct programme, with opportunities to ask questions.  It is usual for applicants to be observed teaching within the relevant department with feedback being shared during the interview process. If appropriate, candidates are also given a short tour of the partner school.\r\n\r\nOne-to-one interviews are then held with each applicant with candidates also asked to deliver a short presentation on a pre-determined topic, relating to the role of their subject in the curriculum and wider life.  \r\n\r\nApplicants need to demonstrate concern and consideration for the welfare and development of young people, be willing to follow WMC and training school procedures and liaise with a range of professionals to support students.  Applicants will understand the responsibility of acting as a role model through demonstrating professional commitment to the conditions of service for a teacher, recognising the full responsibilities involved, and will have an awareness of the current National Curriculum arrangements for the age range that they will be teaching.\r\n","howSchoolPlacementsWork":"The School Direct (Training) programme combines full-time training and study. You will also spend a period of time teaching in a contrasting partnership school. SDT Associate Teachers are supported in their training schools by Subject Mentors, Professional Tutors, Quality Assurance Officers and their Course Leader.\r\n\r\nAs an Associate Teacher, you will be provided with a phased introduction to teaching that will reflect your individual needs. You will spend time observing expert colleagues, supporting with group work, and sharing classes with the teacher before moving towards independently teaching classes yourself. As well as teaching, you will be expected to contribute generally to the wider life of the school through, for example, supporting extra-curricular activities.  \r\n\r\nA short primary school placement is an integral part of the School Direct (Training) programme with Associate Teachers enabled to build experiences across the breadth of National Curriculum at all Key Stages. \r\n\r\nThroughout the year, you will have access to a wide range of learning experiences that will be reflected upon and enhanced within a very supportive and positive environment. All of the above, integrated with your own motivation and desire, will enable you to reach your full potential to become an outstanding subject specialist teacher through participation on the School Direct (Training) programme. \r\nAll Associate Teachers follow a forward-thinking curriculum that focuses on the skills, knowledge and concepts related to effective learning and teaching within the secondary classroom.\r\n\r\nThe School Direct (Training) programme is very intense and you will need to devote an extensive amount of time and effort to developing your teaching knowledge, skills and understanding whilst completing the course. Applicants should be prepared for a very busy but very enjoyable year!\r\n","personalQualities":"Applicants must be able to demonstrate an enthusiasm for working with young people, communicate effectively in written and spoken English and be confident in their use of IT skills.\r\n\r\nApplicants must recognise that studying to gain Qualified Teacher Status (QTS) is demanding and requires commitment beyond the standard working day; they will need to be able to manage their time effectively to maintain an appropriate 'work/life balance'.  \r\n\r\nApplicants must be able to make the best use of their existing subject knowledge, skills and understanding and be able to accept constructive feedback to support their progress and success throughout the course.\r\n","otherRequirements":"It is desirable, although not essential, that applicants have experience of working with young people, preferably within an educational context or through youth organisations. We actively seek to recruit candidates who have the potential to become outstanding practioners. \r\n\r\nEnhanced disclosure from DBS - Applicants will be required to obtain an Enhanced Disclosure from the Disclosure and Barring Service.\r\n\r\n","status":1,"createdAt":"2021-07-06T10:51:55.595Z","updatedAt":"2021-07-08T12:39:41.276Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
