{"id":"7745bbb7-e845-403e-b9f1-c74f9cc86766","name":"Primary (5-11)","code":"3XXJ","qualification":"qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"0fddcb61-d814-41ad-8d97-fd74a709a040","name":"West Midlands Consortium","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"bffddf6a-937a-439e-9d24-f0c1bd63d290","code":"W53","name":"West Midlands Consortium"},"degreeGrade":"9","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"You will need to source equivalency tests in English, Maths and/or Science.","courseLength":"OneYear","feesUK":5000,"feeDetails":"The £5,000 course fee is usually paid by the employing school.","aboutCourse":"This course offers an immersive and inspiring school-centred route into teaching. Associate Teachers (ATs) will be part of a school team from the outset and will receive intensive support from experienced Mentors and their Course Leader. Teaching experiences will prepare ATs for both a Key Stage One and Two focus and opportunities exist to build networks with your fellow ATs. The Primary School Direct (Salaried) Course will prepare ATs for the award of Qualified Teacher Status (QTS) in line with the requirements of the Teachers’ Standards.\r\n\r\nAll ATs follow a forward-thinking curriculum that focuses on the skills, knowledge and understanding related to effective learning, teaching and pedagogical development within the classroom. Teaching is based on lectures, workshops, skills training and seminars with individual support through one-to-one and group tutorials forming an integral feature of the programme.\r\n\r\nWe organise the course to provide ATs with an in-depth understanding of a range of teaching, learning and educational experiences to inform both their training and pedagogical development. You will benefit not only from a highly experienced Course Leader who is at the forefront of developments in education but also from the specialist support and expertise of practising teachers and senior leaders.\r\n\r\nA blend of practical experience and theory gained during the course is assessed in a number of ways.  Teaching knowledge, skills and understanding is monitored through lesson observations, professional learning conversations, reflective journals and progress review meetings together with a number of written reflective assignments that focus on theory into practice and key aspects of pedagogical development. \r\n\r\nAt WMC, the SDS Primary Programme is tailored to your needs – building on your existing strengths and expertise. We place an emphasis on enabling you to develop the independent learning capabilities that will equip you for lifelong learning and future employment as well as academic achievement. A mixture of independent study together with teaching and effective pastoral support enables you to reflect on progress and build up a profile of skills, achievements and experiences which will enable you to flourish and be successful.\r\n\r\nThe majority of ATs trained through this route are employed by their training school after completing the programme as the nature of this route to Qualified Teacher Status is for schools to train  teachers who are committed to the values and ethos of the school and wish to develop their teaching career within the school which invested in their training.\r\n","interviewProcess":"After initial selection based on application, successful candidates are invited to an interview where they will participate in a number of activities.  Candidates will be interviewed by the Director of the Consortium together with experienced Head Teachers from one of our partner schools. \r\n\r\nDuring the interview process, candidates gain a fuller insight into the nature, content and aims of the course and of the teaching profession.  A short presentation will give candidates an outline of the Primary SDS programme with opportunities to ask questions.  Prior to interview, candidates will be given a practical task to prepare designed to give a flavour of the type of teacher they wish to become. \r\n\r\nOne-to-One interviews are held with each applicant during which questions focusing on primary education are explored and discussed.  Candidates will be given verbal feedback at the end of the process and are informed of our decision on the day of interview.\r\n\r\nApplicants need to demonstrate concern and consideration for the welfare and development of the children, be willing to follow WMC and placement school procedures and liaise with a range of professionals to support pupils.  \r\n\r\nApplicants will understand the responsibility of acting as a role model through demonstrating professional commitment to the conditions of service for a teacher, recognising the full responsibilities involved, and will have an awareness of the current National Curriculum arrangements for the age range that they will be teaching together with an understanding of the latest developments in education. \r\n\r\n","howSchoolPlacementsWork":"Associate Teachers will spend most of their time in one placement school where their teaching practice will be supported by a WMC Course Leader and school mentor. Placements will focus on Key Stage 1 and Key Stage 2. The AT is employed as an unqualified teacher by their placement school for the duration of the programme.\r\n\r\nAssociate Teachers are very well-supported during their placements by experienced Mentors within their placement schools and by their Course Leader.  As a trainee teacher, you will experience a phased introduction to teaching that will reflect your individual needs.  You will spend time observing expert colleagues, supporting group work and sharing classes with the teacher before moving towards independent teaching.  As well as teaching, you will be expected to contribute generally to the wider life of the school, becoming an integral part of the school community through, for example, supporting extra-curricular activities. \r\n\r\nPlacement A carries a 50% teaching commitment with the teaching commitment increasing to 60% within Placement B moving towards a full 5 day placement.  Associate Teachers will move towards an 80%, teaching commitment during the summer term which mirrors the commitment and workload of an Early Career Teacher.  \r\n\r\nATs also experience a short placement in Key Stage Three which focuses on effective transition from primary to secondary education together with the opportunity to visit a number of specialised settings, for example, SEMH, a special school, ASD provision and supporting pupils with speech and language challenges, to learn more about inclusion.\r\n\r\nThe majority of ATs trained through this route are employed by the training school after completing the programme. The nature of this route to Qualified Teacher Status is for schools to train  teachers who are committed to the values and ethos of the school and wish to develop their teaching career within the school which invested in their training.\r\n\r\nThe SDS programme is very intensive and you will need to devote an extensive amount of time and effort to developing your teaching knowledge, skills and understanding whilst completing the course.  Applicants should be prepared for a very busy but tremendously enjoyable year!\r\n\r\n","personalQualities":"Applicants must be able to demonstrate an enthusiasm for working with young people, communicate effectively in written and spoken English and be confident in their use of IT skills.\r\n\r\nApplicants must recognise that studying to gain Qualified Teacher Status (QTS) is demanding and requires commitment beyond the standard working day; they will need to be able to manage their time effectively to maintain an appropriate 'work/life balance'.  \r\n\r\nApplicants must be able to make the best use of their existing subject knowledge, skills and understanding and be able to accept constructive feedback to support their progress and success throughout the course\r\n","otherRequirements":"It is desirable, although not essential, that applicants have experience of working with young people, preferably within an educational context or through youth organisations. \r\n\r\nHowever, we are actively looking for candidates who have the potential to become effective classroom practioners. ","status":1,"createdAt":"2021-07-06T10:51:55.872Z","updatedAt":"2021-07-09T11:27:57.890Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
