{"id":"b080fc64-f788-4e41-b9ae-d1f8255a01dc","name":"Primary","code":"2PPD","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"0fddcb61-d814-41ad-8d97-fd74a709a040","name":"West Midlands Consortium","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"bffddf6a-937a-439e-9d24-f0c1bd63d290","code":"W53","name":"West Midlands Consortium"},"profPost":"BO","degreeGrade":"9","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"You will need to access equivalency tests in English, Maths and/or Science.","courseLength":"OneYear","feesUK":9250,"feeDetails":"Associate Teachers are given the opportunity to attend a residential weekend at Arthog, the cost of which is subsidised.\r\n\r\nThere is also the opportunity to participate in additional training such as adult and pediatric first aid, swimming and gymnastics.  ","aboutCourse":"The Primary course prepares Associate Teachers (ATs) to teach all subjects in the National Curriculum and aims to prepare successful applicants to grow into reflective, creative, proactive practitioners through an on-going analysis of their own progress and development.  All ATs follow a forward-thinking curriculum that focuses on the skills, knowledge and understanding related to effective learning, teaching and pedagogical development within the classroom. Teaching is based on lectures, workshops, skills training and seminars with individual support through one-to-one and group tutorials forming an integral feature of the programme.\r\n\r\nWe organise the course to provide ATs with an in-depth understanding of a range of teaching, learning and educational experiences to inform both their training and pedagogical development. You will benefit not only from a highly experienced Course Leader who is at the forefront of developments in education but also from the specialist support and expertise of practising teachers and senior leaders.\r\n\r\nThe programme follows the three school term year with two teaching placements taking place during the course.  At the beginning of the Autumn Term, an intensive training period takes place to prepare Associate Teachers for their first experiences in school. Placement A consists of three days a week with a teaching commitment increasing to 50%, Placement B increases to four days and, during the final term, you will benefit from spending five days a week in your placement school, teaching 80% of the timetable.\r\n\r\nA blend of practical experience and theory gained during the course is assessed in a number of ways.  Teaching knowledge, skills and understanding is monitored through lesson observations, professional learning conversations, reflective journals and progress review meetings together with a number of written academic assignments that focus on theory into practice and key aspects of pedagogical development. We work closely with Staffordshire University on our Masters Programme. \r\n\r\nThe quality of relationships across the Consortium of schools is outstanding and is developed collaboratively at every stage to ensure that training is at the cutting edge of education.  Effective communication is paramount to the continued success of this partnership, allowing WMC to map development needs with the best-placed partnership schools to ensure a tailored programme that is designed to suit all aspiring teachers.\r\n\r\nWMC has established a fantastic reputation across the West Midlands.  Historically, the majority of ATs have gained teaching posts before the end of their training period with a high percentage placed within partner schools.  \r\n","interviewProcess":"After initial selection based on application, successful candidates are invited to an interview where they will participate in a number of activities.  Candidates will be interviewed by the Director of the Consortium together with experienced Head Teachers from one of our partner schools. \r\n\r\nDuring the interview process, candidates gain a fuller insight into the nature, content and aims of the course and of the teaching profession.  A short presentation will give candidates an outline of the PGCE Primary programme with opportunities to ask questions.  Prior to interview, candidates will be given a practical task to prepare designed to give a flavour of the type of teacher they wish to become. \r\n\r\nOne-to-One interviews are held with each applicant during which questions focusing on primary education are explored and discussed.  Candidates will be given verbal feedback at the end of the process and are informed of our decision on the day of interview.\r\n\r\nApplicants need to demonstrate concern and consideration for the welfare and development of the children, be willing to follow WMC and placement school procedures and liaise with a range of professionals to support pupils.  \r\n\r\nApplicants will understand the responsibility of acting as a role model through demonstrating professional commitment to the conditions of service for a teacher, recognising the full responsibilities involved, and will have an awareness of the current National Curriculum arrangements for the age range that they will be teaching together with an understanding of the latest developments in education. \r\n\r\n","howSchoolPlacementsWork":"WMC has over 30 diverse and contrasting placement schools in and around the West Midlands region which includes placement schools in Staffordshire, Shropshire, and the West Midlands.    The geographical spread of schools means that all Associate Teachers should have a commute to their placement schools of, ideally, no more than 30 minutes driving time.  \r\n\r\nAssociate Teachers will experience teaching within two contrasting primary placements, spending approximately 60 days in each placement.  Placement A carries a 50% teaching commitment, beginning with a 3 day placement, leading to 4 and then a full 5 day teaching placement.   The teaching commitment increases to 60% within Placement B where ATs will start with a 4 day placement before quickly moving to a full 5 day placement.  Associate Teachers will move towards an 80%, teaching commitment over the summer term which mirrors the commitment of an Early Career Teacher.  \r\n\r\nAssociate Teachers are very well-supported during their placements by experienced Mentors within their placement schools and by their Course Leader.  As a trainee teacher, you will experience a phased introduction to teaching that will reflect your individual needs.  You will spend time observing expert colleagues, supporting group work and sharing classes with the teacher before moving towards independent teaching.  As well as teaching, you will be expected to contribute generally to the wider life of the school, becoming an integral part of the school community through, for example, supporting extra-curricular activities. \r\n\r\nThe PGCE programme is very intensive and you will need to devote an extensive amount of time and effort to developing your teaching knowledge, skills and understanding whilst completing the course.  Applicants should be prepared for a very busy but incredibly enjoyable year!\r\n\r\n","personalQualities":"Applicants must be able to demonstrate an enthusiasm for working with young people, communicate effectively in written and spoken English and be confident in their use of IT skills.\r\n\r\nApplicants must recognise that studying to gain Qualified Teacher Status (QTS) is demanding and requires commitment beyond the standard working day; they will need to be able to manage their time effectively to maintain an appropriate 'work/life balance'.  \r\n\r\nApplicants must be able to make the best use of their existing subject knowledge, skills and understanding and be able to accept constructive feedback to support their progress and success throughout the course\r\n","otherRequirements":"It is desirable, although not essential, that applicants have experience of working with young people, preferably within an educational context or through youth organisations. However, we are actively looking for candidates who have the potential to become effective classroom practioners. ","status":1,"createdAt":"2021-07-06T10:51:55.035Z","updatedAt":"2021-07-08T13:45:33.165Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
