{"id":"d542f429-299f-450d-9185-45e3e4dece2d","name":"Physical Education with EBacc","code":"3CC3","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"74d64a54-5e34-4590-b6c7-528dd0cf26fe","code":"C6","name":"Physical education"}],"locations":[{"id":"0fddcb61-d814-41ad-8d97-fd74a709a040","name":"West Midlands Consortium","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"bffddf6a-937a-439e-9d24-f0c1bd63d290","code":"W53","name":"West Midlands Consortium"},"profPost":"BO","degreeGrade":"9","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"You will need to source an equivalency test in English and/or Maths.","courseLength":"OneYear","feesUK":9250,"feeDetails":"Physical Education Associate Teachers will have the opportunity to gain a number of optional National Governing Body awards.  These include: Basketball Level 1, Teachers Trampoline Level 1 & 2, Teachers Gymnastics Award, Level 3 Lowlands Expedition Leadership Award, First Aid at Work Qualification, Royal Life Saving Society Award, and iPads in Physical Education Certificate.","aboutCourse":"The PE with EBacc programme is a route into teaching PE which develops the skills and experience to teach an additional subject: Science, Maths, English, History, Modern Foreign Languages or Geography.  Training will fully equip you for the demands of teaching both subjects including the development of the required subject knowledge and understanding of pedagogical approaches unique to both.  The most exciting thing about this route is the flexibility it provides in the employment market as you can offer schools more than just the ability to teach PE.\r\n\r\nThe course aims to prepare successful applicants to develop into reflective, proactive, creative practitioners through an on-going analysis of their own progress.  All Associate Teachers follow a forward-thinking curriculum that focuses on the skills, knowledge and concepts related to effective learning and teaching and pedagogical development within the secondary classroom. Teaching is based on lectures, workshops, skills training and seminars with individual support through one-to-one and group tutorials forming an integral feature of the programme.\r\n\r\nA blend of practical experience and theory gained during the PE course is assessed in a number of ways.  Teaching knowledge, skills and understanding is monitored through lesson observations, professional learning conversations, reflective journals and progress review meetings together with a number of written academic assignments that focus on theory into practice and key aspects of pedagogical development. We work closely with Staffordshire University on our Masters Programme. \r\n\r\nATs are supported and encouraged to develop ideas in the delivery of the attainment targets in PE across all subject content areas in secondary education.  The course reflects the very latest teaching ideas in PE, responding to the needs and changes both within Consortium schools and within the National Curriculum.  \r\n\r\nCourse content for GCSE, A level, BTEC and leadership courses in PE and Sport are explored. The use of Information and Communication Technology is studied and utilised to enhance the quality of teaching and learning.\r\n\r\nThe quality of relationships across the Consortium of schools is outstanding and is developed collaboratively at every stage to ensure that training is at the cutting edge of education.  Effective communication is paramount to the continued success of this partnership, allowing WMC to map development needs with the best-placed partnership schools to ensure a tailored programme that is designed to suit all aspiring PE teachers.\r\n","interviewProcess":"Applicants need to demonstrate concern and consideration for the welfare and development of young people, be willing to follow WMC and placement school procedures and liaise with a range of professionals to support students.  Applicants will understand the responsibility of acting as a role model, recognising the full responsibilities involved, and will have an awareness of the current National Curriculum arrangements for the age range that they will be teaching.\r\n\r\nAfter initial selection based on application, successful candidates are invited to an interview day where they will participate in a number of activities.  Candidates will be interviewed by the Course Leader along with the Director of the Consortium, a Senior Deputy Head Teacher or a subject specialist. \r\n\r\nCandidates to gain a fuller insight into the nature of the course and the teaching profession.  A short presentation will give candidates an outline of the PGCE PE programme, with opportunities to ask questions.  Prior to interview, candidates will be given a practical task to prepare and then deliver to a group of KS3 students.  This will be observed by the course leader and an experienced subject specialist.\r\n\r\nIndividual interviews are held with each applicant during which feedback relating to the practical session is discussed.  Candidates are also asked to deliver a short presentation on a pre-determined topic, relating to the role of Physical Education in the curriculum.  Candidates are also encouraged to bring a portfolio of evidence to support their application.\r\n","howSchoolPlacementsWork":"WMC has over 30 placement schools in and around the West Midlands region which includes placement schools in Staffordshire, Shropshire, and the West Midlands.  The majority of placement schools have been working with WMC for over 15 years, with many Subject Mentors and PE teachers having progressed through the PGCE course with WMC previously.  The geographical spread of schools means that all Associate Teachers should have a commute to their placement schools, of ideally, no more than 30 minutes driving time.  The majority of schools include the full 11-18 age range, with some including the 11-16 age range without sixth form, or 9-14 years, middle school age.\r\n\r\nAssociate Teachers will experience teaching within two contrasting secondary placements, spending approximately 60 days in each placement.  Placement A carries a 50% teaching commitment, initially beginning with a 3 day placement, leading to 4 and then a full 5 day teaching placement.   The teaching commitment increases to 60% within Placement B where ATs will start with a 4 day placement before quickly moving to a full 5 day placement.  Trainees will move towards an 80%, teaching commitment over the summer term which mirrors the commitment of an Early Career Teacher.  Associate Teachers are well supported during their placements by experienced Mentors within their placement schools and by their Course Leader.  \r\n\r\nAs a trainee teacher, you will experience a phased introduction to teaching that will reflect your individual needs.  You will spend time observing expert colleagues, supporting group work and sharing classes with the teacher before moving towards independent teaching.  As well as teaching, you will be expected to contribute generally to the wider life of the school, becoming an integral part of the school community through, for example, supporting extra-curricular activities. \r\n\r\nThe PE PGCE programme is very intensive and you will need to devote an extensive amount of time and effort to developing your teaching knowledge, skills and understanding whilst completing the course.  Applicants should be prepared for a very busy but incredibly enjoyable year!\r\n","personalQualities":"Applicants must be able to demonstrate an enthusiasm for working with young people, communicate effectively in written and spoken English and be confident in their use of IT skills.\r\n\r\nApplicants must recognise that studying to gain Qualified Teacher Status (QTS) is demanding and requires commitment beyond the standard working day; they will need to be able to manage their time effectively to maintain an appropriate 'work/life balance'.  \r\n\r\nApplicants must be able to make the best use of their existing subject knowledge, skills and understanding and be able to accept constructive feedback to support their progress and success throughout the course.\r\n","otherRequirements":"\r\nIt is desirable, although not essential, that applicants have experience of working with young people, preferably within an educational context or through youth organisations. We actively seek to recruit candidates who have the potential to become outstanding practioners. ","status":1,"createdAt":"2021-07-06T10:51:55.558Z","updatedAt":"2021-07-08T14:12:28.897Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
