{"id":"0b1f9672-89e6-49a8-bf5a-d01c2c7dcbc7","name":"Primary","code":"AR79","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"92af92dd-9720-4194-83d6-be3ec96f14ee","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"23fba24b-1e90-4b68-9558-1814033bde74","code":"2EW","name":"Teach SouthEast"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We accept an equivalency from Equivalency Testing: https://www.equivalencytesting.com/ Candidates will need to book, sit and pass any equivalency exams before the course officially starts on 1st September.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Teach SouthEast are excited to offer a 1-year ITT programme in primary teaching. The programme will consist of:\r\n•\tProfessional studies training covering topics such as lesson planning, behaviour management, assessment, marking and monitoring. \r\n•\tSubject specialist training to enhance your knowledge and teaching of the national curriculum.  \r\n•\tTwo placements within our partnership schools to enable you to embed your training and to further develop your teaching skills.\r\nPredominantly you will be placed in a ’home’ school for approximately 28 weeks. A shorter, 6-week placement will be completed in an ‘away’ school, again, all within our partnership. The rationale for two differing placements is to not only teach across the key stages but also to experience a different educational setting to further enhance your teaching.  \r\nWhilst on placement you will be assigned a highly skilled mentor who will support, develop and challenge your teaching to ensure your experience is of the highest quality. You will have a weekly meeting with your mentor to review progress and set personalised targets, as well as a weekly formal observation to celebrate your achievements and consider your next steps. \r\nIn addition to your placement schools you will also be given the opportunity to visit several educational settings including; a secondary school, a SEND school and a behaviour immersion unit. \r\nTeach SouthEast are committed to laying the foundation for a long and successful career in teaching. In order to support this, not only will you receive high quality curriculum and pedagogy training, but you will also receive 1 – 1 support from a pastoral coach to ensure a smooth and successful training year. \r\nOn completion, all trainees will be awarded Qualified Teacher Status (QTS). In addition to this, we are extremely proud to work alongside University of Sussex who deliver and award a PGCE qualification in conjunction with your QTS for fee-paying trainees.\r\n","interviewProcess":"Once we receive your application through DfE Apply we will make a call to interview within approximately one week. The interview day will usually be held at one of the schools within the partnership within approximately two weeks. The interview day will consist of: \r\n•\tAn exercise on resilience \r\n•\tTeaching an advised topic to a class of approximately 30 students for approximately 25 minutes\r\n•\tAn interview with staff from Teach SouthEast and our partner schools\r\n•      A short 15 minute free-writing exercise on a prescribed topic \r\n\r\n\r\nIf candidates are made a conditional offer after interview, one condition will be to sit an on-line literacy and numeracy skills assessment prior to starting the course to establish if any additional support in these areas is required during the ITT course.\t\r\n\r\n","howSchoolPlacementsWork":"Teach SouthEast is a growing partnership, currently consisting of over 10 primary schools in the SouthEast of England.  Placing trainees is a complex process and we take many factors into consideration when doing so.  These factors include: \r\n•\tEstablishing which schools in the partnership have the capacity to host a trainee \r\n•\tSelecting a mentor who will be the best fit for the trainee\r\n•\tWe will establish at interview where the candidate will be living for the course, if the candidate drives and if they have access to a car or if they will be dependent on public transport\r\n•\tWe do not expect trainees to travel for longer than an hour each way to their placement school.  Trainee journeys to their placement schools are typically between 20 – 40 minutes\r\n•\tWe always do our best to accommodate trainees’ personal circumstances when placing them.\r\nPredominantly you will be placed in a ’home’ school for approximately 28 weeks. A shorter, 6-week placement will be completed in an ‘away’ school, again, all within our partnership. The rationale for two differing placements is to not only to teach across the key stages but also to experience a different educational setting to further enhance your teaching.","personalQualities":"We are looking to recruit talented candidates who have the qualities and attributes suited to a career in teaching and the drive and ambition to make it happen.  These personal qualities include:\r\n\r\n•\tA friendly and approachable nature\r\n•\tGood interpersonal skills\r\n•\tOrganisation and time management\r\n•\tA passion for your subject \r\n•\tAn innate ability to communicate and relate to young people \r\n•\tA positive outlook and resilient nature\r\n•\tA creative and innovative approach\r\n•\tThe ability to reflect on and improve practice\r\n•\tPotential leadership capabilities\r\n•\tA passion and drive for delivering first class education.\r\n","otherRequirements":"All trainees are required to undergo an enhanced DBS check to verify your suitability for working with young people. If you have lived overseas for more than 3 months in the past 10 years, you will need to provide an overseas police check. All trainees will be required to complete a Fitness to Teach on-line health questionnaire to ensure they are well enough for the rigors of the teaching profession. After interview, successful candidates will be sent a link to sit Teach SouthEast’s on-line literacy and numeracy skills tests for teaching.","status":1,"createdAt":"2021-07-06T10:55:12.929Z","updatedAt":"2021-09-23T10:22:37.676Z","fundingType":"fee","canSponsorStudentVisa":"no"}
