{"id":"64151ba4-29cc-4114-b9a8-62ff1181a1d0","name":"Psychology","code":"3XXP","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"TA","fundingType":"apprenticeship","studyMode":"F","ageRange":"14_to_19","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"1878e739-30bb-4de9-841e-42dacfb1fa0c","code":"C8","name":"Psychology"}],"locations":[{"id":"891b2f2a-9116-4a48-b0b7-b0c27cf76dd2","name":"Main Site","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"23fba24b-1e90-4b68-9558-1814033bde74","code":"2EW","name":"Teach SouthEast"},"degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We accept an equivalency from Equivalency Testing: https://www.equivalencytesting.com/ Candidates will need to book, sit and pass any equivalency exams before the course officially starts on 1st September.","courseLength":"OneYear","feesUK":0,"feeDetails":"Teach SouthEast's School Direct Non-Salaried and Core SCITT courses carry tuition fees.  \r\nOur Salaried and Apprenticeship courses do not carry tuition fees and these trainees will earn a salary equivalent to Unqualified Teacher Salary Pay-scale Point 1.\r\n","aboutCourse":"The course offers you a weekly General Professional Studies (GPS) session lasting three and a half hours, which is held at SJB School in Woking. In these sessions you will receive practical strategies and ideas to develop your practice within the classroom. Areas of pedagogy covered within these sessions include: assessment for learning, giving effective feedback, lesson planning, behaviour-management, the ways in which pupils learn and adaptive teaching. All of our training is evidence-informed. Our fee-paying courses are awarded with QTS and PGCE carrying 60 masters credits (awarded in partnership with the University of Sussex). Our salaried and apprenticeship courses lead to QTS only.\r\nAlongside your General Professional Studies, all trainees receive subject specific training, which is led by one of the schools within the partnership. All subject hubs within the partnership have been chosen for their renowned reputation as training centres and outstanding levels of learning and teaching as well as results. Psychology subject studies gives trainees a weekly dedicated session focusing on subject related topics, preparing you to teach Psychology to a high level within the classroom. Areas of training include the methods and approaches through various topic areas representing the core areas of social, cognitive, developmental, biological and individual differences, investigation and report writing skills, planning an effective scheme of work, assisting students to develop analytical and critical thinking skills, differentiation as well as preparing students for examinations. As a Teach SouthEast trainee you would spend the majority of time in your placement school with the weekly day of training delivered by the TeachSouthEast SCITT and their partnership of schools. The PGCE (60 masters credits) is delivered by and accredited by The University of Sussex, whose ITT provision has been graded as outstanding by Ofsted. Trainees have the opportunity to go to The University of Sussex on a number of occasions throughout the year to access keynote lectures and the PGCE element of the course is delivered at one of the two lead schools within the SCITT. \r\n","interviewProcess":"Once we receive your application through DfE Apply we will make a call to interview within approximately one week. The interview day will be held at one of the schools within the partnership within approximately two weeks. The interview day will typically consist of: \r\n\r\n• Teaching an advised topic to a class of approximately 30 students for approximately 25 minutes.\r\n\r\n• A subject knowledge test (for secondary ITT candidates only). This is usually part of a GCSE paper and will last no longer than 30 minutes \r\n\r\n• An exercise on resilience\r\n\r\n• A short 15 minute free-writing exercise on a prescribed topic\r\n\r\n• An interview with staff from Teach SouthEast and our partner schools\r\n\r\nIf candidates are made a conditional offer after interview, one condition will be to sit an on-line literacy and numeracy skills assessment prior to starting the course to establish if any additional support in these areas is required during the ITT course.\r\n\r\n","howSchoolPlacementsWork":"Teach SouthEast is a growing partnership, currently consisting of over 30 schools in the SouthEast of England.  Placing trainees is a complex process and we take many factors into consideration when doing so.  These factors include: \r\n\r\n•\tEstablishing which schools in the partnership have the capacity to host a trainee in a particular subject\r\n\r\n•\tSelecting a mentor who will be the best fit for the trainee\r\n\r\n•\tWe will establish at interview where the candidate will be living for the course, if the candidate drives and if they have access to a car or if they will be dependent on public transport\r\n\r\n•\tWe do not expect trainees to travel for longer than an hour each way to their placement school.  Trainee journeys to their placement schools are typically between 20 – 40 minutes\r\n\r\n•\tWe always do our best to accommodate trainees’ personal circumstances when placing them.\r\n\r\nAll trainees will spend the first term in their Home School.   After Christmas, trainees will be given a contrasting Away School placement for the duration of the Spring term, after which they will return to their Home School.   Salaried and apprenticeship trainees will only have a half term (usually 6 weeks) away placement.  \r\nAll of our Initial Teacher Training courses teach the age range 11-16 with post 16 enhancement so every trainee will get an exposure to teaching Key Stages 3, 4 and 5.  The only exceptions to this are Business Studies, Psychology  and Media Studies which cover ages 14-19 as these subjects are not taught at Key Stage 3 in our partnership of schools.\r\n","personalQualities":"We are looking to recruit talented candidates who have the qualities and attributes suited to a career in teaching and the drive and ambition to make it happen.  These personal qualities include:\r\n\r\n•\tA friendly and approachable nature\r\n•\tGood interpersonal skills\r\n•\tOrganisation and time management\r\n•\tA passion for your subject \r\n•\tAn innate ability to communicate and relate to young people \r\n•\tA positive outlook and resilient nature\r\n•\tA creative and innovative approach\r\n•\tThe ability to reflect on and improve practice\r\n•\tPotential leadership capabilities\r\n•\tA passion and drive for delivering first class education.","otherRequirements":"All trainees are required to undergo an enhanced DBS check to verify your suitability for working with young people. If you have lived overseas for more than 3 months in the past 10 years, you will need to provide an overseas police check. All trainees will be required to complete a Fitness to Teach on-line health questionnaire to ensure they are well enough for the rigors of the teaching profession. After interview, successful candidates will be sent a link to sit Teach SouthEast’s on-line literacy and numeracy skills tests for teaching.","status":0,"createdAt":"2021-07-06T10:53:41.075Z","canSponsorSkilledWorkerVisa":"no"}
