{"id":"83744832-591f-4ce4-95c2-13c0a0a2dd2a","name":"Modern Languages","code":"29F7","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"ce8523ef-9236-4cd9-b260-d826c7a521b3","code":"ML","name":"Modern Languages"},{"id":"4608e5e3-2a1a-48a1-8236-56c7af5a139d","code":"24","name":"Modern languages (other)"}],"locations":[{"id":"9b6d1a66-5ee3-4c58-b606-802dbed2bf31","name":"Manor CE Academy","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"21b7500e-ce80-4b8e-a89d-b3527a39b27c","code":"1DH","name":"Hope Sentamu Learning Trust"},"accreditedBody":{"id":"b011427a-6dff-4a77-9df3-c85a54be605a","code":"Y75","name":"York St John University"},"profPost":"PG","degreeGrade":"1","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":12500,"feeDetails":"There are no other costs for the programme.","financialSupport":"Financial support can be accessed through the [Funding Advice Team](https://www.yorksj.ac.uk/student-services/funding-advice/) at York St John University.  ","aboutCourse":"Hope Sentamu Learning Trust and York St John University work in partnership to deliver high quality teacher education and training which leads to a PGCE qualification with QTS (Qualified Teacher Status).\r\nThe key aim of our school-centred School Direct PGCE programme is to deliver a high quality current and relevant programme of training and education that equips you with the professional knowledge, understanding, skills and attributes that you need to become highly effective teachers (and leaders) with both a strong subject and wider professional identity. The programme combines school experience with taught academic sessions in order to achieve this. To support this, you will follow an ambitious curriculum that is underpinned by the Initial Teacher Training Core Content Framework and York St John Partnership five key themes, that has been designed to integrate theory and practice. \r\n\r\nThe programme delivers contemporary and highly relevant education and training which provides excellent opportunities for you to develop knowledge and understanding of your subject and wider educational issues.  You will be equipped to become an outstanding teacher and leader with strong subject knowledge and a clear professional identity.  You will be supported by experts in both university and schools to ensure that you have opportunities to learn about current classroom practice and develop deep subject pedagogy.  The programme combines school experience with taught sessions on subject knowledge and pedagogy which occur at university and also in partnership schools. Two academic assignments will need to be passed so you meet the programme aims and gain the PGCE award.  These modules will underpin your own rigorous understanding of pedagogy and will provide you with 60 Masters level credits, which you may wish to use towards a full Masters qualification in the future.\r\nThe programme ensures that you fulfil the requirements of the current Teachers’ Standards for the award of QTS. The programme encourages you to engage critically with educational issues to enable you to develop as a reflective practitioner, with the ability to evaluate and adapt your practice to meet the diverse needs of pupils in secondary schools.  This is achieved through a range of learning, teaching and assessment strategies, including active learning and enquiry-based learning, which is considered essential in both modelling effective learning and teaching practice.\r\n\r\n","interviewProcess":"The recruitment process is rigorous and thorough. It is designed to enable Hope Sentamu Learning Trust and York St John University to assess the suitability of candidates for training and to appoint the best candidates for the places available.  \r\n\r\nSelection is based on evidence given throughout the application process and includes:\r\n\r\n*Your personal statement\r\n\r\n*References\r\n\r\n*Detailed breakdown of degree content\r\n\r\n*Details of other academic, professional or vocational qualifications\r\n\r\n*Completion of a practical task at interview\r\n\r\n*Overall performance at interview\r\n\r\nInterview days take place in one of our partnership schools. Typical activities include a short teaching activity and an individual interview with a panel made up of Hope Sentamu Learning Trust staff and university staff.  Candidates may also have an interview with a pupil panel and take part in a group activity and literacy-based task.\r\nPlaces on the programme are limited and recruitment takes place regularly during the year.  If you are successful at interview you will be offered a conditional place.  Once the number of offered places meets the agreed programme numbers, the programme will be closed.  We therefore recommend that you apply as soon as possible to avoid missing out on the programme of your choice.\r\n","howSchoolPlacementsWork":"The Hope Sentamu Learning Trust PGCE School Direct programme is a full-time programme studied within one academic year (September - June) and covers the 11- 16 age phase with 16-19 enhancement.  You will be based within one school for the majority of your training where you will complete two placements.  There is also a 6-week contrasting placement in a different partnership school, either in the autumn or spring term. You are supported on your school placements by a mentor and other school staff who are committed to your education and training.  During these placements you will observe teaching, work collaboratively with experienced staff and gradually increase the percentage of your independent teaching.  Induction is a key part of the programme and each placement as we feel it is important for you to feel welcome in the school community and valued as members of staff from the start. You will attend school meetings such as staff meetings, participate in school training days and other professional development events as appropriate. You are given the opportunity to participate in all aspects of school life and the wider school context.  This helps you to understand your own professional identity and be a fully committed member of a school community. Once qualified and as you become an Early Career Teacher you will have access to university support resources in order to further support you transition from ITE into your first teaching role. ","personalQualities":"We are looking for student teachers who:\r\n\r\nHave a passion for teaching and a love of learning.\r\n\r\nAre committed to ensuring that all pupils can succeed no matter what their background or starting point.\r\n\r\nAre enthusiastic, combined with excellent organisational skills.\r\n\r\nHave the ability to reflect and develop as critical professionals.\r\n\r\nCan express ideas clearly and succinctly.\r\n\r\nHave a high level of resilience and respond well to constructive feedback.\r\n\r\nShow personal initiative and can work well with peers, pupils, tutors, staff and parents alike.\r\n","otherRequirements":"Places are limited and recruitment takes place on a rolling basis. Once the number of students accepted reaches the course limit, courses will be closed. We recommend that you apply as soon as possible to avoid missing out on the course of your choice.","status":1,"createdAt":"2021-07-06T10:52:30.688Z","updatedAt":"2021-09-01T12:23:16.361Z","canSponsorStudentVisa":"yes","cycle":"2024"}
