{"id":"e553e7be-7b78-46ed-a825-813204c6842b","name":"Primary","code":"29F3","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"d7687874-022a-424f-8d9b-eae7347a0fd9","name":"Vale of York Academy","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"21b7500e-ce80-4b8e-a89d-b3527a39b27c","code":"1DH","name":"Hope Sentamu Learning Trust"},"accreditedBody":{"id":"b011427a-6dff-4a77-9df3-c85a54be605a","code":"Y75","name":"York St John University"},"profPost":"PG","english":"1","maths":"1","science":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feeDetails":"Ebor Hope offers the unsalaried route. \r\n\r\nThe tuition fees for the School Direct programme in September 2019 are £9,250 for UK and EU students. Trainees will be charged tuition fees if they are in attendance on 1 October 2019.\r\n\r\nYou will be able to apply for a Tuition Fee Loan from your funding body to cover the cost of your fees. Once you have left York St John and are earning over £25,725 per annum, you will be required to begin repayment of the loan.","financialSupport":"Ebor Hope do not currently offer any financial support however there is a range of support you can access.\r\n\r\nYou can get government support. This includes a Tuition Fee Loan to cover the cost of your fees and a Maintenance Loan that will help towards your living costs, which you only start to pay back once you have left university and are earning over £25,725 per year\r\n\r\nFinancial guidance can also be found on the YSJ website\r\n\r\nhttps://www.yorksj.ac.uk/student-services/funding-advice/funding-my-course/postgraduate-/teacher-training/school-direct/","aboutCourse":"Ebor Hope Teaching Schools Alliance and York St John University work in partnership to deliver high quality teacher education and training which leads to a PGCE qualification with QTS (Qualified Teacher Status).\r\n\r\nOur school-centred (School Direct) PGCE primary programme is a community of learning with partnership at the heart of the programme.  The partnership works together to develop outstanding student teachers who are transformative and creative professionals, highly motivated and committed, autonomous and independent, enquiry-based practitioners and self-reflective practitioners. Historically, a significant number of our trainees secure teaching posts within Ebor Hope and Ebor Academy Trust schools.\r\n\r\nThe programme delivers contemporary and highly relevant education and training which provides excellent opportunities for you to develop knowledge and understanding of primary education and wider educational issues.  You will be equipped to become an outstanding teacher and leader with strong subject knowledge and a clear professional identity.  You will be supported by experts in both university and schools to ensure that you have opportunities to learn about current classroom practice and develop deep subject pedagogy.  The programme combines school experience with taught sessions on subject knowledge and pedagogy which occur at university and also in partnership schools. Two academic assignments will need to be passed so you meet the programme aims and gain the PGCE award.  These modules will underpin your own rigorous understanding of pedagogy and will provide you with 60 Masters level credits, which you may wish to use towards a full Masters qualification in the future.\r\n\r\nThe Ebor Hope Teaching Schools Alliance PGCE School Direct programme is a full time programme studied within one academic year (September - June) and covers either the 3- 7 or 7-11 age phase.  Historically a significant number of our trainees have secured employment within the alliance, and partaking in transition activities within their employment school following completion of the programme into July. \r\n\r\nThe programme ensures that you fulfil the requirements of the current Teachers’ Standards for the award of QTS. The programme encourages you to engage critically with educational issues to enable you to develop as a reflective practitioner, with the ability to evaluate and adapt your practice to meet the diverse needs of pupils in primary schools.  This is achieved through a range of learning, teaching and assessment strategies, including active learning and enquiry-based learning, which is considered essential in both modelling effective learning and teaching practice.\r\n\r\n","interviewProcess":"The recruitment process is rigorous and thorough. It is designed to enable Ebor Hope Teaching Schools Allianceand York St John University to assess the suitability of candidates for training and to appoint the best candidates for the places available.  \r\n\r\nSelection is based on evidence given throughout the application process and includes:\r\n*Your personal statement\r\n*References- if you have had school experience it is advisable to use contact as a reference\r\n*Detailed breakdown of degree content\r\n*Details of other academic, professional or vocational qualifications\r\n*Completion of a practical task at interview\r\n*Overall performance at interview\r\n \r\nInterview days take place in one of our partnership schools. Typical activities include:\r\n*a guided reading session with a small group of children\r\n*a short prepared teaching activity with a small group of children \r\n*written reflection based on your prepared task\r\nSuccessful candidates may then be invited to an interview which usually takes place on the afternoon of the tasks. The interview panel is made up of Ebor Hope Teaching Schools Alliance teaching school and university staff.  \r\n\r\nPlaces on the programme are limited and recruitment takes place regularly during the year.  If you are successful at interview you will be offered a conditional place.  Once the number of offered places meets the agreed programme numbers, the programme will be closed.  We therefore recommend that you apply as soon as possible to avoid missing out on the programme of your choice.\r\n","howSchoolPlacementsWork":"Placement in schools is an integral part of the programme; trainees report it helps them to fully immerse in the school community and become a valued member of staff from the start.  During the year you will be based within one school for the majority of your training where you will complete two placements in your preferred age range of either lower (3-7 years ) or upper (7-11 years) primary.  There is also a 6-week contrasting placement in a different partnership school.  Trainees are placed in a diverse range of schools within York and the surrounding areas.\r\n\r\nDuring each placement you will observe teaching, work collaboratively with experienced staff and gradually increase the percentage of planning teaching and assessment. Trained mentors closely monitor students through weekly appraisals where strengths are identified and developmental points identified. Discussions are constructive and nurture students self reflection on lessons.Targets will be set to help you on your journey into becoming an effective teacher. \r\n\r\nYou will also attend school meetings such as staff meetings, participate in school training days and other professional development events as appropriate. From being in school you are exposed to a broad and diverse  school life and the wider school context.  This helps you to understand your own professional identity and be a fully committed member of a school community.\r\n","personalQualities":"We are looking for trainees with an enthusiasm for becoming a primary teacher who have some recent knowledge and understanding of Early Years and primary education.  Successful trainees are those who combine:\r\n*enthusiasm towards teaching\r\n*organisation to organise self, plan and manage a class\r\n*flexibility\r\n*resilience when faced with a challenge and determination\r\n*good communication skills\r\n*team player\r\n*ability to use initiative \r\n*sense of humour\r\nTeaching is an extremely rewarding profession which requires plenty of flexibility and reflection. Most importantly we want trainees who have a love of learning and can support children on their journey into lifelong learning.","otherRequirements":"","status":2,"createdAt":"2021-07-06T10:52:30.577Z","canSponsorStudentVisa":"yes","cycle":"2024"}
