{"id":"0cc725b3-5b4f-408c-9dcb-da923ccf8675","name":"Primary","code":"3BFS","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"c8635f95-1606-4c0e-89de-6429f484e8b6","name":"North West Learning Partnership Training Centre","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"83c2a9fe-ca61-435e-a3a6-fb843ca2607b","code":"13N","name":"North West Learning Partnership"},"accreditedBody":{"id":"ec34b77c-cba3-4598-93be-23f0471adff1","code":"L51","name":"Liverpool John Moores University"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":null,"aboutCourse":"North West Learning Partnership offer the salaried route into teaching in collaboration with Liverpool John Moores University,(LJMU), and is aimed at applicants with prior experience in a school-setting. Applicants for this employment-based route should apply to NWLP School Direct with the support of a school who is willing to employ them as an unqualified teacher for the duration of the programme which is one academic year. \r\nNorth West Learning Partnership in partnership with LJMU will provide the training. You will gain a Postgraduate Certificate with Masters credits, alongside Qualified Teacher Status. This Salaried training programme is unique as you will benefit from training sessions delivered by outstanding and specialised trainers from our teaching School partnership – Head teachers, Specialist Leaders in Education, experienced consultants and outstanding practitioners who are still involved in teaching. We offer a personalised approach in the training sessions which you access in order to facilitate your individual development. The PGCE  element of the training is assessed through 2 Modules with LJMU. The Award of QTS is integral to one of these academic Modules. You will also complete one essay, in two parts which asks you to reflect on your practice. The PGCE element will be taught by experienced and friendly staff from LJMU and you will join a community of students at campus for University – based sessions in addition to training with the North West Learning Partnership School Direct. \r\nAs a Salaried School Direct trainee you may be expected to teach up to 90% of a teacher timetable and be responsible for the planning, teaching and assessment of your class(es) from early on in the year. Trainees on the salaried programme are selected, recruited and employed directly by schools with our support.\r\nIn order to achieve Qualified Teacher Status, you will demonstrate that you are able to meet all the requirements of the Teachers’ Standards. You will be supported in meeting this target by your Professional Mentor in school. The Strategic Lead of the School Direct programme and LJMU staff are in regular contact with all trainees on placement, undertake co-observations of their teaching and Quality Assure this school-based training.\r\nAs a Teaching School, North West Learning Partnership are committed to ongoing development of all trainees for at least 3 years. Trainees have access, free of charge to training provided by NWLP.\r\n\r\nContact Kathy Carman on [kathy.carman@three-saints.org.uk] prior to making your application. \r\n","interviewProcess":"All applicants who meet the entry requirements will be invited to attend a selection event.\r\n\r\nThe selection process involves participation in a presentation, a written literacy task, a numeracy task and an individual interview with representation from North West Learning Partnership, LJMU and the Head Teacher who has expressed an interest to employ you for one academic year as a non qualified teacher. Details to support preparation for the event are sent to successful applicants along with an invitation to attend. Our selection and interview procedure will also give applicants further information about our programme.\r\n\r\nApplicants will be assessed for their:\r\n\r\n•\tAbility to successfully engage learners and to make learning exciting and meaningful to learners in a range of contexts\r\n•\tCommitment to supporting learners, including in areas of challenging social context\r\n•\tEnthusiasm, energy and resilience and ability to work with others in teams\r\n\r\nInterviews may be conducted on line in response to Coronavirus (COVID-19) guidance, The process on line will still include a presentation, a written literacy task, a numeracy task and an individual interview\r\n","howSchoolPlacementsWork":"Your school-based experience takes place largely in your employing school, supported by well- trained Professional Mentors in school. The Strategic Lead from North West Learning Partnership and a member of LJMU staff is attached to each school and is responsible for visiting regularly in order to support trainees and their mentors. Relationships are very close and constructive.\r\nAll trainees are entitled to weekly review and feedback meetings with their Professional Mentor, to progress meetings with the Strategic Lead and to tutorials with LJMU staff. This “wraparound” care ensures that you are consistently supported from start to finish, both personally and professionally.\r\nIn addition to the time spent in a Home School, you will also undertake an alternative placement of roughly 2 weeks in a contrasting school. This placement will be provided by one of the schools within our Partnership which are all Outstanding or Good.\r\nAdditional experiences are also often provided for instance through visits to Special Schools, Secondary Schools and Foundation Stage . Your final assessment for QTS is conducted at the end of the year.\r\n","personalQualities":"We are looking for individuals with a professional approach who will become positive members of the school community. Candidates should be able to demonstrate a passion for teaching and resilience. The ability to communicate clearly, fluently and accurately in spoken and written Standard English and strong organisational skills are essential. \r\n\r\n A range of interests and skills is desirable.","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:49:26.905Z","updatedAt":"2021-10-01T14:35:30.298Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"You will be paid as an unqualified teacher by your employing school for the duration of your training. This will be calculated using the unqualified teachers’ pay scales. Your employing school will pay the costs of your PGCE training and assessment.  In some instances a contribution towards the PGCE fee is requested from trainees by the employing school."}
