{"id":"477ed161-834b-49a4-9d9a-e626d782ca35","name":"History","code":"X871","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"5a3609a0-5bbb-4377-b919-5d89932ab622","code":"V1","name":"History"}],"locations":[{"id":"f8d7755a-d987-4616-9a31-319bfada1c55","name":"Rainford High School","isPublished":"Y","status":"R"},{"id":"18a159a8-3b34-4822-a91c-dce4b4cfe7ff","name":"Up Holland High School","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"83c2a9fe-ca61-435e-a3a6-fb843ca2607b","code":"13N","name":"North West Learning Partnership"},"accreditedBody":{"id":"ec34b77c-cba3-4598-93be-23f0471adff1","code":"L51","name":"Liverpool John Moores University"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feesInternational":14000,"financialSupport":"For more information visit: \r\n[getintoteaching.education.gov.uk] and [northwestlearningpartnership.co.uk] \r\n","aboutCourse":"Due to the expertise of trainers and staff in our Lead Secondary schools, we are excited to offer our PGCE with QTS in History. Both schools offer unique and dynamic training opportunities for the right aspirational candidates. \r\n•\tOpportunity to teach across Key Stage 3 and Key Stage 4 \r\n•\tTraining with high quality relevant professionals with an outstanding track record for delivering the highest grades for young people at Key Stage 4 and Key Stage 5 as well as delivering exceptional transition. \r\n•\tOpportunity for leadership training and development of strategic curriculum design. \r\n•\tCommitment to develop examination expertise at KS4 and KS5  \r\n•\tOpportunity to take part in curriculum enrichment through visits and events \r\n•\tTeaching opportunity across KS2,3, 4 and 5.  \r\n•\tBecome part of a caring and supportive learning community and contribute to making a difference for the school and the young people \r\n•\tDirect ownership for student progress. \r\n•\tSubject specific and career impacting professional development. \r\n•\tStrong employment opportunities. \r\n\r\n\r\nThe PGCE aspect of your course, awarded with Masters credits, takes place at Liverpool John Moores University. Until January, you will normally spend Fridays (and sometimes the occasional full week) at the university and the other 4 days in school. Later in the year, you will return to the university for additional full training weeks, but the majority of your time will be spent training in our schools. \r\nThe History programme will focus predominantly on developing your subject knowledge and subject pedagogy so that you have the knowledge, understanding and skills needed to become a confident History teacher. In addition, workshops and seminars will develop your confidence in; classroom and behaviour management; meeting individual needs and inclusion; planning and assessment etc. There is a strong emphasis on social justice issues in education and on mental health and well-being. We want you to develop into an inclusive and reflective teacher, with the skills, energy and resilience needed to make a real difference in schools. \r\n\r\nIn order to achieve Qualified Teacher Status (QTS), you will demonstrate that you are able to meet all the requirements of the Teachers’ Standards. This aspect of assessment is largely undertaken by school-based mentors. LJMU staff undertake co-observations of your teaching and Quality Assure the school-based training across the Partnership. \r\nThe PGCE is assessed through 2 Modules, one of these modules uses the evidence you gather to be awarded QTS. \r\n \r\n","interviewProcess":"Shortlisting: All applicants who meet the entry requirements will be invited to attend a selection event. \r\nSelection events: The selection process will involve a presentation, a History classroom task and an interview with school staff and members of our partnership. Details to support preparation for the event are sent to successful applicants along with an invitation to attend. Our selection and interview day will also give applicants further information about our programmes and provide an opportunity to meet our friendly and dedicated team. \r\nApplicants are normally informed of decisions within 24 hours. \r\nApplicants will be assessed for their: \r\n•\tDepth of relevant subject knowledge and their interest and enthusiasm for teaching History\r\n•\tAbility to successfully engage learners and to make learning exciting and meaningful to young people in a range of contexts \r\n•\tCommitment to supporting learners, including in areas of challenging social context \r\n•\tEnthusiasm, energy and resilience and ability to work with others in teams and potential to work successfully at Master’s level \r\nApplicants are asked to bring evidence of GCSEs in English and Mathematics with them to interview, along with degree certificates if they have already graduated. \r\n \r\n\r\n\r\n","howSchoolPlacementsWork":"Your school-based experience takes place largely in your Home School, supported by well- trained mentors, experienced staff with expertise in History. We have found that being in a Home School ensures that you are fully integrated into school life and get to know staff, pupils and your subject mentor extremely well, to the benefit of all involved. A member of LJMU staff is normally attached to each school and is responsible for visiting regularly in order to support all trainees and their mentors. Relationships are very close and constructive. \r\nIn addition to the time spent in a Home School, you will also undertake an alternative placement of roughly 6 weeks in a contrasting school between January and February. This placement has an explicit focus on diversity and inclusion. Additional experiences are also often provided for instance through visits to Special Schools and to Primary Schools. Although the LJMU programmes focus on 11-16 experience, you will also gain experience of post-16 planning and teaching during your school experience. \r\nSchool experience is structured in phases, beginning with an observation phase, so that you can develop appropriate confidence and competence, taking on greater responsibility for planning and teaching as the year progresses. Your final assessment for QTS is conducted at the end of the year, in collaboration with your mentor. \r\nAll trainees are entitled to weekly review and feedback meetings with their mentors and to tutorials with LJMU staff. This ‘wraparound’ care ensures that you are consistently supported from start to finish, both personally and professionally. \r\nA range of mentor training and development events hosted both at LJMU and in schools, ensure that our mentors understand our expectations and commit to offering high quality guidance and support to each trainee. \r\n\r\n","personalQualities":"We are looking for applicants who have a passion for History and wish to share their passion with young people. You should have a genuine belief that education transforms life chances and want to make a positive difference to young people and to their communities. At interview we hope to see your enthusiasm along with evidence of some experiences which have informed your decision to become a teacher. A minimum of 5 days’ work experience in a UK secondary school is helpful prior to commencing the programme. We can help to arrange this for successful applicants.","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:49:27.260Z","updatedAt":"2021-10-01T14:26:20.602Z","canSponsorStudentVisa":"yes","cycle":"2024"}
