{"id":"6f0e7560-3edf-464b-9914-8f282cf876b1","name":"Primary","code":"3688","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"23f64607-d203-41ad-a717-cc697415df47","name":"Main Site","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"9138510b-fbf9-4764-8d56-664aeb05c9f3","code":"2FH","name":"Benfield Primary School"},"accreditedBody":{"id":"4d4cceab-1516-4a6c-a9ab-5de0e32e1fe1","code":"S90","name":"University of Sussex"},"profPost":"BO","english":"2","maths":"2","science":"2","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"This course is in partnership with the University of Sussex. It is an intensive school based programme with four days a week in school and one based in the university.\r\nThis gives trainees the opportunity to be quickly immersed in classroom practice supported by a trained mentor. It also enable trainees to play a full part in the school community. \r\nPlacements are in Reception/KS1  or KS2.\r\nTrainees are given two  school based placements, one from October to Easter and a shorter complementary placement 2.\r\nAssessment is through the award of PGCE/QTS at the university of Sussex. Trainees are also eligible to accrue points towards Masters level qualifications.\r\n\r\nPlease see the University of Sussex course content for further information.\r\n","interviewProcess":"Interviews are conducted in partnership with the university and are always based in school. \r\nThis is so we can see how candidates interact with children through guided activities.","howSchoolPlacementsWork":"During your training, you will have two school placements as detailed above.\r\nHowever, in addition to this, we run a Professional Studies programme which reinforces and complements the University's pedagogical programme. These sessions take place in different schools across our Teaching School Alliance giving trainees the opportunity to complete further learning walks in different schools and settings.\r\nAll our Alliance schools have a Professional Tutor who oversees all trainee teachers and ensures there is quality of provision. All trainees are developed and supported by a trained mentor who is their class teacher.   ","personalQualities":"We welcome applicants from all people who can clearly demonstrate a passion for ensuring all our children achieve their best by engaging, top quality learning.\r\nTeaching is all about children and all adults must demonstrate reslience, enquiry, good time management and organisation and a sense of humour. ","otherRequirements":"","status":2,"createdAt":"2021-07-06T10:53:48.845Z","canSponsorStudentVisa":"yes","cycle":"2024"}
