{"id":"bdaf351e-67bd-4e10-a6fe-39bb24bd0330","name":"Primary","code":"A029","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"B","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"23f64607-d203-41ad-a717-cc697415df47","name":"Main Site","isPublished":"Y","status":"R","vacancies":"B"}],"trainingProvider":{"id":"9138510b-fbf9-4764-8d56-664aeb05c9f3","code":"2FH","name":"Benfield Primary School"},"accreditedBody":{"id":"4d4cceab-1516-4a6c-a9ab-5de0e32e1fe1","code":"S90","name":"University of Sussex"},"profPost":"PG","degreeGrade":"9","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"TwoYears","feesUK":9250,"aboutCourse":"Benfield Primary School is a lead school for the Sussex Coast  School Alliance in Brighton and Hove and East and West Sussex. \r\nWe are a group of 39 schools who are committed to high quality school based experience ensuring our children are provided with the best possible teachers.\r\nInitial teacher training is at the heart of everything we do and we continue to invest in all our teachers through a continuum of professional development.\r\nWe provide a training programme which is school based for 4 days a week with a further one day at the University of Sussex. As professionals, we firmly believe this is an excellent way to become a teacher with intensive, supported practice in the classroom.\r\nTrainees are supported by an experienced mentor who is an excellent practitioner. We expect all our trainees to be an active member of our schools community, fully participating in all aspects of school life. We consider our trainees to be an essential part of our team.\r\nIn addition to classroom practice, all our trainees take part in professional learning led by colleagues across the alliance. This enables trainees to collaborate with other schools in sharing and embedding good practice.\r\nWe have recruited from the majority of our trainees over the past few years and many of these are now developing as teachers and leaders across the Alliance.\r\nWe are a Delivery Partner for the Early Career Framework and for the NPQs for UCL. Our development continues for all colleagues throughout their career.","interviewProcess":"Interviews are conducted in partnership with the university and are  based in school where possible. \r\nThis is so we can see how candidates interact with children through guided activities. School based interviews typically last half a day and include a presentation and child based task alongside an interview with the University and one of our Professional Tutors.\r\nOur interviews are designed to get the best out of our potential future teachers by giving plenty of time for candidates to ask questions and to get a thorough understanding of the programme.\r\nIf the interview is unable to be conducted in a school setting then this will be held virtually with adapted activities.","howSchoolPlacementsWork":"During your training, you will have two school placements in two different schools. These will enable trainees to work and learn in two different key stages and two different settings.\r\nTrainees will be supported by a trained mentor who is the class teacher. Mentors are chosen by schools based on their own excellent classroom practice but also and importantly on their ability to develop others through guidance and support.\r\nHowever, in addition to this, we run a Professional Studies programme which reinforces and complements the University's pedagogical programme. These sessions take place in different schools across our Teaching School Alliance giving trainees the opportunity to complete further learning walks in different schools and settings.\r\nAll our Alliance schools have a Professional Tutor who oversees all trainee teachers and ensures there is quality of provision across the school.  \r\nSchools are selected according to their capacity for trainee teachers. Usually, there is always at least one or more other trainee in schools. This supports all trainees as they are able to network and also learn from each other.\r\nWe consider our placements very carefully and place trainees in schools that are readily accessible from their home. We also take into account the type of school trainees would like to work in and also any other information we gain at interview.","status":1,"createdAt":"2021-10-11T13:00:51.025Z","updatedAt":"2021-10-11T13:07:28.930Z","canSponsorStudentVisa":"yes","cycle":"2024"}
