{"id":"6a36bb28-d5e4-4b36-9f6a-ad36f547b9a8","name":"History","code":"Y224","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"B","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"5a3609a0-5bbb-4377-b919-5d89932ab622","code":"V1","name":"History"}],"locations":[{"id":"ba6b9958-7e27-45b3-89c9-52b92343b1c6","name":"Southend Site","isPublished":"N","status":"S","vacancies":"B"},{"id":"b535db36-68fa-4367-a113-c9bc3c8d6405","name":"Essex and Thames SCITT","isPublished":"Y","status":"R","vacancies":"B"}],"trainingProvider":{"id":"878d1a87-fbcc-4973-87e5-e35868dfa1e8","code":"T25","name":"Essex and Thames SCITT"},"profPost":"PG","degreeGrade":"9","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"Normally 50% of the degree should be relevant to the subject taught, if not an A level and SKE course may be required.","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Details of how to obtain evidence of equivalency or sit equivalency tests may be found below:\n\n[Equivalency Testing Brentwood](https://www.equivalencytesting.com/)\n\n[A Star Equivalency Islington](https://astarequivalency.co.uk/)","courseLength":"TwoYears","feesUK":9250,"feeDetails":"Course fees are set at £9,250 per year full time or £11,250 part time.  Part time fees will be charged at £6,750 in year 1 and £4,500 in year 2.  Fees are £3,000 per term for those on an accelerated programme.  \r\n\r\nAt Essex and Thames SCITT we understand that you are concerned about how your fees are spent. It’s a big investment and you have every right to know what you’re investing in. Providing you with the very highest quality teacher training is what we are totally committed to doing.\r\n","aboutCourse":"During the programme you will spend at least 120 days in schools and around 40 days in out of school training. Our training is designed by a highly qualified team of senior teachers and leading academics and is primarily based in school.  \r\n\r\nTraining at the Centres\r\n\r\nThe training days include sessions in Subject Studies, SEND and inclusion, children’s mental health, behaviour and voice.  Our training takes place in our training centres and in some of the very best secondary schools in Southend. The programme also gives you access to all Anglia Ruskin University’s facilities.\r\n\r\n“NQTs...demonstrate strong subject knowledge and great enthusiasm for their subject, which lead to very confident performances in the classroom.” Ofsted\r\n\r\nTraining in School\r\n\r\nEvidence shows that the best learning comes from training alongside the highest quality teachers, and with us, you benefit from a significant amount of real school experience as you work alongside the best teachers in our area.  During the year you will have practical classroom experience in at least two differing schools. \r\n\r\nSpecialisms\r\n\r\nWe offer free additional training in Special Educational Needs and Disability and Leadership.  All trainees are offered the opportunity to gain a sports coaching qualification during the year.\r\n\r\nAssessment\r\n\r\nThroughout the programme you will be regularly assessed by both school mentors and your SCITT-based tutors\r\n\r\nAcademic work\r\n\r\nYou also have the opportunity to study for a PGCE by submitting one written assignment, one written research project and a written assignment with presentation. \r\n\r\nSupport\r\n\r\nYou will be assigned your own tutor, who will meet with you regularly, a subject tutor and a school mentor whose role it is to train and support you in school. You will also have access to an extended support network of experienced teachers and mentors throughout your course.\r\n\r\n‘The partnership (has) a well-deserved reputation for training...that local schools are keen to employ’  Ofsted \r\n \r\nBy the end of the year you will:\r\n* Have an excellent understanding of the National Curriculum along with the requirements for assessment and relevant examination specifications\r\n\r\n* Be able to plan and prepare for lessons and set students’ learning objectives with confidence\r\n\r\n* Have strong classroom management skills\r\n\r\n* Know how to address personalise learning to ensure that all pupils are included and can achieve their potential","interviewProcess":"Applications must be clearly written and provide evidence of a strong desire to be a teacher, a passion for your subject and an interest in pupil’s learning.  \r\n\r\nSuccessful applicants will be called for interview once your application is received from UCAS.  If you have applied and have not heard back from us just give our office a ring (01268 570215) so that we can check on the progress of your application.  \r\n\r\nThe interview process is divided into two parts: the formal SCITT interview and a school-based interview.\r\n\r\nPart 1:\r\nThe interview will be held remotely.  You will be asked to give a short presentation and will have a formal interview.   You will also be asked to observe an experienced teacher and write about what you have seen.  The process gives applicants a chance to demonstrate all the necessary qualities and skills needed to be a successful teacher.  \r\n\r\nIt is important that you come to interviews fully prepared so that we are able to assess your suitability to train.\r\n\r\nSuccessful applicants at part 1 will be notified within 2 working days and offered a school-based interview.\r\n\r\nPart Two:\r\nYou will have a short interview with a subject specialist from one of our schools and may be asked to:\r\nDeliver a 30 minute lesson in your chosen subject. \r\n","howSchoolPlacementsWork":"We pride ourselves on being the preferred teacher training provider for the majority of secondary schools in Southend. The breadth of the partnership ensures that we are able to offer a diverse range of training opportunities, learning from  leading edge practitioners and experts.  Most of our schools are located near public transport and within easy reach for non-drivers.  You can see our current list of schools on our website http://etpscitt.co.uk\r\n\r\nPlacements\r\nWe do our very best to match you with a school as near to where you live as possible.  We take your personal circumstances into account and aim to ensure that no trainee has to travel for more than an hour to reach their schools.  You will train in at least 2 schools.   We aim to ensure that you are offered experience in a range of settings.\r\n\r\n\r\n\r\nWhat will you do in school?\r\nWorking alongside experienced teachers, you will be supported to take on a slowly increasing teaching role.  You will build up from observing to co-teaching and working with small groups to teaching whole classes by the end of the final term.   A school-based mentor and your subject tutor will provide high quality mentoring and pastoral support throughout your placements.  \r\n \r\n“School-based training is the key feature leading to trainees’ success. NQTs reported that they were well supported with regular and protected time with their mentors.”  Ofsted \r\n\r\nBeyond the programme\r\nWe are thrilled and proud to say that a staggering 100% of our trainees looking for jobs are recruited into teaching posts at the end of their training.  Our school-based support extends into the NQT year with social events, a comprehensive NQT training programme and access to 1:1 support from SCITT staff as required.\r\n","personalQualities":"* The ability to communicate clearly in written and spoken English\r\n* A demonstrable passion for your chosen subject\r\n* Keen to become an outstanding teacher\r\n* Have strong knowledge and understanding of the subject you wish to teach\r\n* Creative and imaginative\r\n* Keen to open the minds of young people to achieve their fullest potential\r\n* Able to work collaboratively\r\n* Prepared to innovate and take risks\r\n* Prepared to learn from research\r\n* Prepared to work hard to develop your skills  and your understanding of how pupils learn\r\n* Committed to providing a positive nurturing learning environment\r\n","otherRequirements":"* Once you have accepted your offer you will be subject to appropriate pre-selection checks. This will include obtaining and considering Disclosure and Barring Service (DBS) criminal records checks and children’s barred list information.\r\n\r\n* All candidates are required to make a fitness to teach declaration to Occupational Health.\r\n","status":1,"createdAt":"2021-07-06T10:51:36.950Z","updatedAt":"2021-08-16T13:33:30.825Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
