{"id":"39d30c88-3193-4cf8-b360-f54bc685ec13","name":"Biology","code":"33M4","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"322cfc19-d51d-45db-91e3-bd7b4738470f","code":"C1","name":"Biology"}],"locations":[{"id":"55cbd6a9-2586-494a-8fec-bd0f1b8cbc33","name":"Brambles Primary Academy","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"b0223445-3531-47a6-81b0-839f90b8335b","code":"2EX","name":"Huddersfield Horizon SCITT"},"profPost":"PG","degreeGrade":"9","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"We will consider a Biology related degree and we will review the degree requirements and coverage to ascertain suitability.","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"no","additionalGcseEquivalencies":"We will accept assessments through the Equivalency Test Centre and any costs will be paid by the applicant.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"\r\n\r\nOur training courses are curriculum and progress focused so that our trainees are taught the subject knowledge, understanding and they have the ability to feel confident and competent as an excellent practitioner. \r\nOur trainees are based in a school four days a week and will attend the Training Centre one day a week. Here they are given the theoretical understanding and the strategies in which to immerse themselves gradually but confidently in the school based experience. As a Secondary trainee our trainees are given additional subject days in which they are taught the specific curriculum and pedagogy of their subject area. These sessions are tailored to cater for the specific demands of the subject but equally the areas which need to be developed as part of the trainee’s subject knowledge and application.\r\nTrainees will be in one main host school, September to July, with an additional placement in October 2 half term and a week’s Special Education Needs placement. A great strength of our provision is that we can adapt the programme to meet the needs and the areas of development for each trainee. Through the formative review points  and the tut visits, we track the trainee’s progress against the curriculum and then adapt the school experience and indeed the training based on the INDIVIDUAL trainee’s needs. Our Training programme is bespoke to each individual.\r\nTrainees are assessed against the Teachers’ Standards at the end of the programme. Over the course of the year, trainees will build a bank of evidence against the curriculum in-order to support the judgement made by the Partnership at the end of the programme. In addition, as part of the PGCE element of the programme (led by Sheffield Hallam tutors but delivered at the Centre) there are two assignments to be completed throughout the course of the year:\r\n1.\tReflecting on Pedagogical Approaches (5000 words)\r\n2.\tExploring Professional Development through Collaborative Enquiry (5000 words)\r\nTrainees will be supported fully through the online and centre based resource system, including the support network of mentor and tutor.\r\n","interviewProcess":"Once we receive your application we will assess it against the shortlisting criteria. If the application meets the criteria then we will invite you to an assessment at either the Centre or one of our Partnership schools.\r\n\r\nThe assessment usually takes half a day (depending upon the number of interviewees on the day) and will involve:\r\n1. A Teaching and Learning activity involving students. The focus of the activity (usually a small teaching task) will be given to you in advance so that you can prepare\r\n2. A Teaching and Learning activity given to you on the day. This may involve a joint planning session with a group of applicants\r\n3. A pre-planned presentation\r\n4. A formal interview (focusing upon your understanding of the curriculum, assessment, behaviour management; safeguarding etc...)\r\n5. A subject knowledge assessment given to you on the day\r\n\r\n\r\nThe purpose of the assessment activities above is to assess:\r\n\r\n*Your engagement with young people\r\n*Your passion for your subject/teaching and learning\r\n*Your current understanding of teaching and learning and the workings of a school\r\n*Your level of resilience\r\nYour subject knowledge \r\n\r\nFrom the assessment we then make a decision on whether we are to offer you a conditional place and if so, what support we need to offer in advance of you starting the programme.\r\n","howSchoolPlacementsWork":"As a Partnership which works extremely closely, we know our schools. By knowing our schools, our departments and our mentors extremely well and through our robust assessment procedure we can very easily match our confirmed applicants to our partnership schools. It is extremely important to us that our trainees have a work life balance and so when placing our trainees in our schools we take into account the geographical distance and relevant needs so that the travel time does not inflict upon the demands of our trainee teachers. We ensure that our trainee teachers have an enriching experience and so we draw upon the diverse range of schools within our partnership to ensure that the trainee's experience impacts upon their curriculum knowledge and progress.\r\nOur Primary  programme covers the age range of 5-11 and our Secondary programme covers the age range of 11-16. \r\nAs a trainee you will be in a main host school from September until July and we feel this placement is incredibly important in building the incredibly important relationships with our children. With this year long placement (apart from half a term in a contrasting setting and for Primary a different phase) you will have the opportunity to be a member of staff within the school, to build the all important relationships and to see how a school cycle works.\r\n\r\nIn addition, you will have experience in pre and post phase settings and we pride ourselves on our additional SEND placement. We feel it is incredibly important that as a practitioner you have the full knowledge and understanding of students with special educational needs and our SEND experience (including placements in Pupil Referral Units) allow you to have a real insight into the SEND provision and meeting the needs of all children. \r\n\r\nYour training will involve four days in a school and then a day's training at our fantastic training centre. Here we will all come together to learn, develop, support and....laugh.\r\n\r\n","personalQualities":"Qualifications and subject knowledge are incredibly important, however equally, so are the essential personal qualities to capture a child's interest and to make a real difference to their lives. We are looking for the \"Magic Weavers\" through: \r\nA secure use of Standard English\r\nA passion for teaching and learning\r\nA thirst for the individual subject/phase\r\nEvidence of resilience\r\nAn ability to engage learners\r\nA desire to impact upon the children in your care","otherRequirements":"\r\n*An Enhanced DBS (Provider to check on acceptance of the conditional offer)\r\n*Prohibition Order Check (Provider to check on acceptance of the conditional offer)\r\n*Prohibition to teach in another country of the European Economic Area (EEA) Check (Provider to check on acceptance of the conditional offer)\r\n*Fitness to Teach Check (Provider to check on acceptance of the conditional offer)\r\n*Overseas Check (Provider to check on acceptance of the conditional offer)\r\n","status":1,"createdAt":"2021-07-06T10:47:53.341Z","updatedAt":"2021-09-08T12:48:54.754Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
