{"id":"6af9f512-6de2-45c9-bf78-9c5e8b5a4ca7","name":"Primary","code":"25PS","qualification":"qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"3_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"a0c72cb2-1873-4072-ade1-9a98f3468bd4","name":"Main Site","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"e67a5141-efc9-4f5d-b1ff-77514229e2bc","code":"174","name":"Coldfall Primary School"},"accreditedBody":{"id":"9188f17a-79c4-43a9-b459-4952815b739a","code":"M80","name":"Middlesex University"},"english":"2","maths":"2","science":"2","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","aboutCourse":"Most of the time will be spent working alongside an experienced class teacher at your allocated school. You will be expected to attend all staff meetings and development days and to engage fully in school life.\r\n\r\nThis is a demanding course, not only will you need to complete university assignments you will also need to plan and prepare for teaching every day. It is expected that you will be in school from 8am until 5.30pm every day.\r\n\r\nThe Primary School Direct model for training is predominantly subject based and includes national priorities in primary education. Trainees attend on alternate Wednesdays throughout the year at Middlesex University, Hendon Campus.\r\n\r\nThe subject training is complemented with professional enrichment which is undertaken by trainees as ‘mini research’ in school.  University tutors visit the trainee and mentor throughout the training year to provide support and to ensure a consistently high quality training experience.\r\n\r\nAll trainees who successfully complete the programme will be awarded Qualified Teacher Status.\r\n\r\nFollowing successful completion of the assignments trainees will be awarded the Post Graduate Certificate in Work Based Learning Studies, in addition to QTS.  This qualification provides 60 credits towards an MA in Education","interviewProcess":"If your application form is shortlisted, you will be invited to a formal interview at the Lead Teaching School (Coldfall).  If you are successful, we will place you in one of our partner schools to commence your Initial Teacher Training year. ","howSchoolPlacementsWork":"The majority of your training year will be spent in school, working alongside a mentor.  Part of the course requirements are that you attend university based training once a week, and additional training sessions at the lead school.","personalQualities":"Teaching is a vocational career, therefore you need to be 100% committed to the children in your care; passionate about educating children; willing to go the extra mile for the children and the team of people you work with; have good subject knowledge, and have a sense of humour. \r\n","otherRequirements":"The below checks will be  made once an offer to train has been made:\r\nSuitability for teaching checks\r\nBarred list checks\r\nFull DBS ","status":2,"createdAt":"2021-07-06T10:57:13.571Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"If you train via the salaried route, you will be paid on the unqualified teachers scale 1."}
