{"id":"28bab1e6-3d33-42ca-9c6a-a5068a13e135","name":"Biology","code":"32XS","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"322cfc19-d51d-45db-91e3-bd7b4738470f","code":"C1","name":"Biology"}],"locations":[{"id":"40949570-fad9-4a6d-852a-8d2aa54593a1","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"62d5803b-89ca-4e21-bb6f-5c74944c56ad","code":"B25","name":"Birmingham City University"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Details of acceptable and unacceptable equivalencies are available on the course page on our website. We also offer our own in-house equivalency tests for applicants holding an offer for one of our courses.\n\n[Find out more on our website]\n(https://www.bcu.ac.uk/education-and-social-work/initial-teacher-training/gcse-equivalency-test)","courseLength":"OneYear","feesUK":9250,"aboutCourse":"With so many important careers in healthcare and science dependent on people with skills and knowledge in this area, your ability to get your students excited about biology is vital.\r\n\r\nThis course will give you the skills and understanding needed to successfully meet the needs of children in the classroom. You will explore, test and develop the links between science and biology in education theory and its practice.\r\n\r\nThe University workshops and seminars facilitate a space for learners to conduct this, which is then supported by school placements.\r\n\r\nThis relationship, between theory and practice, alongside a variety of contrasting school experiences, ensures that you are offered a well-rounded teacher education. We believe that we are training biology teachers to work in any school setting so this course provides you with the opportunities to understand the urban context and experience working with children from a wide range of social, economic and cultural backgrounds.\r\n\r\nYour course will feature a range of modules and the opportunity to get plenty of hands-on practice in local schools with support from colleagues in the school partnership and experienced University tutors. So while the PGCE is an academic qualification, the emphasis is very much on practical experience, with around two thirds of the course spent in school.\r\n\r\nThe course is taught by experienced practitioners, all of whom have been exceptional teachers and senior managers within schools.\r\n\r\nAll aspects of the PGCE, including your school experience placement of 120 days, will be linked closely to the BCU Core Curriculum Framework.\r\n\r\n[Learn more about this course on our website]\r\n(https://www.bcu.ac.uk/education-and-social-work/courses/pgce-secondary-science-biology-2022-23)","interviewProcess":"You will be required to attend one online interview via Microsoft Teams. Interviews include:\r\n* exploration of curriculum knowledge\r\n\r\n* discussions about relevant experiences\r\n\r\n* a presentation or small teaching exercise \r\n\r\n* written task\r\n\r\nWe also look for: \r\n* good communication skills\r\n\r\n* potential / suitability to be a good teacher\r\n\r\n* robustness to cope with the demands of the course","howSchoolPlacementsWork":"You will spend two-thirds of your time – at least 120 days – working in schools on block placements gaining valuable real-life experience in schools. The 120 days will be split over a minimum of two placements in science departments. You will gain direct teaching experience and work with experienced practitioners in the classroom. School placements are predominantly in West Midlands secondary schools. You will be assigned a trained mentor and/or a tutor while on placement, who will support and guide your work, as well as provide training and feedback.","personalQualities":"Add anything relevant that relates back to your chosen course and shows how your skills will contribute towards your learning. What extra-curricular activities have you taken part in? What awards have you won? What employment or voluntary experience do you have that has helped you develop transferable skills?","otherRequirements":"Applicants must meet the Department for Education’s Initial Teacher Training criteria, which means being medically fit and successfully completing an enhanced disclosure via the Disclosure and Barring Service (DBS) and satisfying any other safeguarding checks required for this course.\r\n\r\nWhile not essential, you may wish to gain some school experience before attending interview.\r\n","status":1,"createdAt":"2021-07-06T10:52:49.515Z","updatedAt":"2021-09-13T12:06:25.040Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
