{"id":"808b1f16-bcb4-4f0e-bdd1-f86dd8209fcd","name":"Primary with Mathematics","code":"3387","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"286cf12f-b3e3-41c5-9f33-2ff7807d2df0","code":"03","name":"Primary with mathematics"}],"locations":[{"id":"40949570-fad9-4a6d-852a-8d2aa54593a1","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"62d5803b-89ca-4e21-bb6f-5c74944c56ad","code":"B25","name":"Birmingham City University"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"Details of acceptable and unacceptable equivalencies are available on the course page on our website. We also offer our own in-house equivalency tests for applicants holding an offer for one of our courses.\n\n[Find out more on our website]\n(https://www.bcu.ac.uk/education-and-social-work/initial-teacher-training/gcse-equivalency-test)","courseLength":"OneYear","feesUK":9250,"aboutCourse":"This course gives you the opportunity to gain a flying start to your teaching career by gaining Qualified Teacher Status (QTS) but rather than specialising in the Early Years or general Primary phases, you will be able to highlight your expertise in mathematics with five to 11 year olds. This will be linked closely to the BCU Core Curriculum Framework.\r\n\r\nWhile the PGCE is an academic qualification, the emphasis is very much on practical experience, with around two thirds (120 days) of the course spent in school. While on the course you would have school based training in Key Stage 1 and Key Stage 2.\r\n\r\nSchool based training will include schools recognised for their strengths in mathematics, allowing you to immerse yourself in this specialist area. In addition, you will choose mathematics as your area of leadership to explore at a deeper level when you are completing academic work for your Professional Studies and Leadership module with a view to you leading the subject in the future. \r\n\r\nYou will learn to teach across the whole range of subjects in the primary National Curriculum, with a strong focus on core subjects.\r\nThe course is taught by experienced practitioners, all of whom have been exceptional teachers and senior managers within schools.\r\n\r\nAll aspects of the PGCE, including your school experience placement of 120 days, will be linked closely to the BCU Core Curriculum Framework.\r\n\r\n[Find out more on our website]\r\n(https://www.bcu.ac.uk/courses/pgce-primary-education-specialism-mathematics-2022-23)\r\n\r\n","interviewProcess":"Interview process\r\n\r\nYou will be required to attend one on line interview. Interviews include:\r\n*\texploration of curriculum knowledge during the 1 to 1 interview \r\n\r\n*\tdiscussions about relevant experiences with your interviewer. \r\n\r\n*\ta discussion on an education related topic that you have prepared.  \r\n\r\n*\ta reflective written task. \r\n\r\nWe also look for: \r\n*\tgood communication skills\r\n\r\n*\tpotential / suitability to be a good teacher\r\n\r\n*\trobustness to cope with the demands of the course\r\n","howSchoolPlacementsWork":"You will spend at least 120 days – working in two schools on block placement gaining valuable breadth of real-life experience. You will gain direct teaching experience and work with experienced teachers in the classroom. \r\n\r\nSchool placements are predominantly in West Midlands primary schools. You will be assigned a trained mentor/ class teacher and a university tutor while on placement, who will support and guide your work, as well as provide training and feedback.","personalQualities":"","otherRequirements":"Applicants must meet the Department for Education’s Initial Teacher Training criteria, which means being medically fit, successfully completing an enhanced disclosure via the Disclosure and Barring Service (DBS) and satisfying any other safeguarding checks required for this course.\r\n\r\nWhile not essential, you may wish to gain some school experience before attending interview.\r\n\r\nIf you are a graduate and wish to train as a teacher but your degree did not provide enough subject specific content for you to gain automatic entry, you may be required to complete a Subject Knowledge Enhancement (SKE) course in Primary Mathematics.","status":1,"createdAt":"2021-07-06T10:52:49.577Z","updatedAt":"2021-09-09T13:31:04.485Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
