{"id":"8fc5cfe0-59a2-4ee3-8cf0-5ce85f249def","name":"Physical education with Biology","code":"F853","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"74d64a54-5e34-4590-b6c7-528dd0cf26fe","code":"C6","name":"Physical education"},{"id":"322cfc19-d51d-45db-91e3-bd7b4738470f","code":"C1","name":"Biology"}],"locations":[{"id":"40949570-fad9-4a6d-852a-8d2aa54593a1","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"62d5803b-89ca-4e21-bb6f-5c74944c56ad","code":"B25","name":"Birmingham City University"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Details of acceptable and unacceptable equivalencies are available on the course page on our website. We also offer our own in-house equivalency tests for applicants holding an offer for one of our courses.\n\n[Find out more on our website]\n(https://www.bcu.ac.uk/education-and-social-work/initial-teacher-training/gcse-equivalency-test)","courseLength":"OneYear","feesUK":9250,"aboutCourse":"If these are subjects that you are knowledgeable and passionate about, our Secondary PE with Biology PGCE will allow you to become a highly-skilled graduate teacher with in-depth knowledge and understanding of teaching and learning, enabling you to demonstrate the highest levels of professional practice.\r\n\r\nYou will be trained to become a confident and reflective practitioner and will be able to teach contemporary methods and practices. You will learn techniques to inspire students with physical education, make it enjoyable for all, and ensure they’re equipped with the skills and understanding they’ll need for a positive approach to physical activity in the future. You will also explore, test, and develop the links between science and biology in education theory and its practice.\r\n\r\nCurriculum workshops are a key element of your course. Dedicated teachers, PE, and Science lecturers deliver these in our specialist education classrooms and lecture theatres. This relationship, between theory and practice, alongside a variety of contrasting school experiences, ensures that you are offered a well-rounded teacher education. \r\n\r\nWe believe that we are training PE with Biology teachers to work in any school setting so this course provides you with the opportunities to understand the urban context and experience working with children from a wide range of social, economic, and cultural backgrounds.\r\n\r\nThe course is taught by experienced practitioners, all of whom have been exceptional teachers and senior managers within schools.\r\n\r\nAll aspects of the PGCE including your school experience will be assessed through our Core ITE Curriculum.\r\n\r\n[Further information about this course can be found on our website.]\r\n(https://www.bcu.ac.uk/education-and-social-work/courses/pgce-secondary-pe-with-biology-2022-23)","interviewProcess":"You will be required to attend one online interview via Microsoft Teams. Interviews include:\r\n* exploration of curriculum knowledge\r\n\r\n* discussions about relevant experiences\r\n\r\n* a presentation or small teaching exercise \r\n\r\n* written task\r\n\r\nWe also look for: \r\n* good communication skills\r\n\r\n* potential/suitability to be a good teacher\r\n\r\n* robustness to cope with the demands of the course\r\n","howSchoolPlacementsWork":"You will spend two-thirds of your time – at least 120 days – working in schools on block placements gaining valuable real-life experience in schools. You will gain direct teaching experience and work with experienced practitioners in the classroom. School placements are predominantly in West Midlands secondary schools. You will be assigned a trained mentor and/or a tutor while on placement, who will support and guide your work, as well as provide training and feedback.","personalQualities":"","otherRequirements":"Applicants must meet the Department for Education’s Initial Teacher Training criteria, which means being medically fit, successfully completing an enhanced disclosure via the Disclosure and Barring Service (DBS) and satisfying all other safeguarding checks required for this course.\r\n\r\nWhile not essential, you may wish to gain some school experience before attending interview.","status":1,"createdAt":"2021-07-06T10:52:50.086Z","updatedAt":"2021-09-13T12:56:10.977Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
