{"id":"93f5b0fc-8a21-478f-953a-9ca978c84a15","name":"PCET (with specialism in Maths and Numeracy)","code":"2V84","qualification":"pgce","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","subjectLevel":"further_education","isSend":"no","subjects":[{"id":"9de4b2d2-5739-4c34-92d2-9b4384760298","code":"41","name":"Further education"}],"locations":[{"id":"40949570-fad9-4a6d-852a-8d2aa54593a1","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"62d5803b-89ca-4e21-bb6f-5c74944c56ad","code":"B25","name":"Birmingham City University"},"profPost":"PG","degreeGrade":"1","english":"9","maths":"9","science":"9","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"no","additionalGcseEquivalencies":"Details of acceptable and unacceptable equivalencies are available on the course page on our website. We also offer our own in-house equivalency tests for applicants holding an offer for one of our courses.\n\n[Find out more on our website]\n(https://www.bcu.ac.uk/education-and-social-work/initial-teacher-training/gcse-equivalency-test)","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Our PGCE PCET will allow you to gain a nationally recognised teaching qualification in post-compulsory education and training (PCET). You’ll benefit from our strong partnerships with organisations and colleges outside of the University as well as workshops and the superb support offered by tutors and mentors.\r\n\r\nYou can train to teach any subject that is taught at post-compulsory level. To do this we match your degree subject (in any subject area) to one of the PCET specialisms that we offer:\r\n\r\n* Arts, Media and Performance\r\n\r\n* English, Literacy and English for Speakers of Other Languages (ESOL)\r\n\r\n* Humanities and Social Sciences\r\n\r\n* Mathematics and Numeracy\r\n\r\n* Science and Technology\r\n\r\nThe means you could have a degree in any subject to apply for this course and we will place you in one of the umbrella categories above. For example, if you have a degree in Health and Social Care you’ll fit into Science and Technology, or with a degree in Construction you might fit into Science or Mathematics.\r\n\r\nIf you’re unsure how your degree fits into one of the categories, please contact the course director, Stuart Mitchell via email on Stuart.Mitchell@bcu.ac.uk who will be able to help guide you.\r\n\r\nYou’ll study a wide range of modules alongside completing at least 150 hours of teaching in your main subject area. Your coursework, assignments and teaching practice will continually be assessed as you progress through the programme.\r\n\r\n\r\n[Further details about this course are available on our website]\r\n(https://www.bcu.ac.uk/courses/pgce-post-compulsory-education-training-2022-23)\r\n","interviewProcess":"You will be required to attend one online interview via Microsoft Teams. Interviews include:\r\n* exploration of curriculum knowledge\r\n\r\n* discussions about relevant experiences\r\n\r\n* a presentation or small teaching exercise \r\n\r\n* written task\r\n\r\nWe also look for: \r\n* good communication skills\r\n\r\n* potential / suitability to be a good teacher\r\n\r\n* robustness to cope with the demands of the course\r\n\r\nPlease note, we are currently conducting interviews online via Microsoft Teams, further details on how/when will be communicated in due course.","howSchoolPlacementsWork":"Placements form a part of all our courses, giving you the opportunity to get hands on experience and apply and grow your skills in appropriate settings, ensuring you’re ready for employment when you graduate.\r\n\r\nYou will spend three days each week, between November and May, on placement and you will be supported by your tutor/mentor. Your placement might be within a local school teaching 14-plus students, a local sixth-form teaching post-16 learners or teaching adults in an offender learning department within a prison.\r\n","personalQualities":"Add anything relevant that relates back to your chosen course and shows how your skills will contribute towards your learning. What extra-curricular activities have you taken part in? What awards have you won? What employment or voluntary experience do you have that has helped you develop transferable skills?","otherRequirements":"Applicants must meet the Department for Education’s Initial Teacher Training criteria, which means being medically fit, successfully completing an enhanced disclosure via the Disclosure and Barring Service (DBS) and satisfying any other safeguarding checks required for this course.\r\n\r\nWhile not essential, you may wish to gain some experience in an educational setting before attending interview.\r\n\r\nIf you are a graduate and wish to train as a post-compulsory mathematics teacher but your degree did not provide enough subject-specific content for you to gain automatic entry, you may be required to complete a Subject Knowledge Enhancement (SKE) course.","status":1,"createdAt":"2021-07-06T10:52:49.423Z","updatedAt":"2021-09-13T11:43:33.462Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
