{"id":"ae01ec6d-dff0-4795-86b2-54851b5ec1b5","name":"Music","code":"3CGM","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"24311bef-8673-41fb-933c-53f887fb6976","code":"W3","name":"Music"}],"locations":[{"id":"40949570-fad9-4a6d-852a-8d2aa54593a1","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"62d5803b-89ca-4e21-bb6f-5c74944c56ad","code":"B25","name":"Birmingham City University"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Details of acceptable and unacceptable equivalencies are available on the course page on our website. We also offer our own in-house equivalency tests for applicants holding an offer for one of our courses.\n\n[Find out more on our website]\n(https://www.bcu.ac.uk/education-and-social-work/initial-teacher-training/gcse-equivalency-test)","courseLength":"OneYear","feesUK":9250,"aboutCourse":"You’ll explore the skills and knowledge that music as an art form offers at secondary education level; and train to become a confident, dynamic and creative teacher with the ability to make music accessible to all. You’ll discover how pupils learn and explore ways in which you can plan musical activities that will ensure they progress and develop their musicality.\r\n\r\nExploring an inclusive and rich approach towards music, you’ll prioritise active music making to promote musical thinking and learn how to inspire and enthuse your pupils by taking them on an exciting and stimulating musical journey.\r\n\r\nTechniques used link many different forms of music and music making. These can be used to help pupils to become more self-confident, informed and culturally aware.\r\n\r\nThis course has strong links with local musical organisations such as Birmingham Music Service, the largest Music Service in the country. The course provides the opportunity to experience music education from a variety of perspectives, including organisations that form part of the Birmingham Hub for Music Education like Birmingham Contemporary Music Group (BCMG) and mac Birmingham.\r\n\r\nA key feature of the course is how we promote technology enhanced learning both in terms of developing beginning teachers and also how music technology can support teaching and learning in schools.\r\n\r\nOur PGCE Secondary Music also allows you to choose to take an instrumental route and focus more of your training in this way.\r\n\r\nAll aspects of the PGCE including your school experience will be assessed through our Core ITE Curriculum.\r\n\r\n[Further information about this course can be found on our website.]\r\n(https://www.bcu.ac.uk/education-and-social-work/courses/pgce-secondary-music-2022-23)","interviewProcess":"You will be required to attend one online interview via Microsoft Teams. Interviews include:\r\n* exploration of curriculum knowledge\r\n\r\n* discussions about relevant experiences\r\n\r\n* a presentation or small teaching exercise \r\n\r\n* written task\r\n\r\nWe also look for: \r\n* good communication skills\r\n\r\n* potential / suitability to be a good teacher\r\n\r\n* robustness to cope with the demands of the course\r\n\r\n","howSchoolPlacementsWork":"You will spend two-thirds of your time – at least 120 days – working in schools on block placements gaining valuable real-life experience in schools. You will gain direct teaching experience and work with experienced practitioners in the classroom. School placements are predominantly in West Midlands secondary schools. You will be assigned a trained mentor and/or a tutor while on placement, who will support and guide your work, as well as provide training and feedback. Students\r\non the instrumental pathway will spend part of their placement time teaching with Birmingham Music Service.","personalQualities":"Add anything relevant that relates back to your chosen course and shows how your skills will contribute towards your learning. What extra-curricular activities have you taken part in? What awards have you won? What employment or voluntary experience do you have that has helped you develop transferable skills?","otherRequirements":"Applicants must meet the Department for Education’s Initial Teacher Training criteria, which means being medically fit and successfully completing an enhanced disclosure via the Disclosure and Barring Service (DBS) and satisfying any other safeguarding checks required for this course.\r\n\r\nWhile not essential, you may wish to gain some school experience before attending interview.\r\n","status":1,"createdAt":"2021-07-06T10:52:49.858Z","updatedAt":"2021-09-13T12:45:13.788Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
