{"id":"b6bc9381-e5aa-4063-9929-1e5b1ec4a82c","name":"Mathematics","code":"3CGN","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"72345aa7-096c-488f-8649-085b8178cadb","code":"G1","name":"Mathematics"}],"locations":[{"id":"40949570-fad9-4a6d-852a-8d2aa54593a1","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"62d5803b-89ca-4e21-bb6f-5c74944c56ad","code":"B25","name":"Birmingham City University"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"no","additionalGcseEquivalencies":"Details of acceptable and unacceptable equivalencies are available on the course page on our website. We also offer our own in-house equivalency tests for applicants holding an offer for one of our courses.\n\n[Find out more on our website]\n(https://www.bcu.ac.uk/education-and-social-work/initial-teacher-training/gcse-equivalency-test)","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Training to be a teacher of mathematics allows you to have a career which supports pupils to master skills that are vital to their success, not just during their education, but for life. If this is a subject you’re knowledgeable and passionate about, our Secondary Mathematics PGCE will allow you to become a highly skilled graduate teacher with an in-depth knowledge and understanding of teaching and learning, enabling you to demonstrate the highest levels of professional practice.\r\n\r\nYou will be trained to become a confident and reflective practitioner, and will be able to teach contemporary methods and practices. You’ll learn techniques to inspire students around maths, making it enjoyable and ensuring they’re equipped with skills they’ll need for the future.\r\n\r\nYou’ll teach across a range of ages and abilities on a daily basis so we’ll train you to be handle changing effortlessly between number patterns and sequences to calculus, depending on who you’re teaching.\r\n\r\nThis is an intensive and demanding course, which offers superb preparation for anyone who is committed to educating young people. Central to the curriculum is the study of education, pedagogy and professional practice from both generic and subject-specific perspectives, which is delivered using a combination of workshops, lectures, seminar groups and individual study.\r\n\r\nAll aspects of the PGCE including your school experience will be assessed through our Core ITE Curriculum.\r\n\r\n[Further information about this course is available on our website]\r\n(https://www.bcu.ac.uk/education-and-social-work/courses/pgce-secondary-mathematics-2022-23)\r\n","interviewProcess":"You will be required to attend one online interview via Microsoft Teams. Interviews include:\r\n* exploration of curriculum knowledge\r\n\r\n* discussions about relevant experiences\r\n\r\n* a presentation or small teaching exercise \r\n\r\n* written task\r\n\r\nWe also look for: \r\n* good communication skills\r\n\r\n* potential / suitability to be a good teacher\r\n\r\n* robustness to cope with the demands of the course\r\n","howSchoolPlacementsWork":"You will spend two-thirds of your time – at least 120 days – working in schools on block placements gaining valuable real-life experience in schools. You will gain direct teaching experience and work with experienced practitioners in the classroom. School placements are predominantly in West Midlands secondary schools. You will be assigned a trained mentor and/or a tutor while on placement, who will support and guide your work, as well as provide training and feedback.","personalQualities":"","otherRequirements":"Applicants must meet the Department for Education’s Initial Teacher Training criteria, which means being medically fit, successfully completing an enhanced disclosure via the Disclosure and Barring Service (DBS) and satisfying any other safeguarding checks required by this course.\r\n\r\nWhile not essential, you may wish to gain some school experience before attending interview.\r\n\r\nIf you are a graduate and wish to train as a teacher but your degree did not provide enough subject specific content for you to gain automatic entry, you may be required to complete a Subject Knowledge Enhancement (SKE) course.","status":1,"createdAt":"2021-07-06T10:52:49.888Z","updatedAt":"2021-09-13T12:32:11.167Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
