{"id":"f613f146-d970-4df9-bd2a-55721733ab45","name":"Primary (5-11)","code":"338B","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"40949570-fad9-4a6d-852a-8d2aa54593a1","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"62d5803b-89ca-4e21-bb6f-5c74944c56ad","code":"B25","name":"Birmingham City University"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"Details of acceptable and unacceptable equivalencies are available on the course page on our website. We also offer our own in-house equivalency tests for applicants holding an offer for one of our courses.\n\n[Find out more on our website]\n(https://www.bcu.ac.uk/education-and-social-work/initial-teacher-training/gcse-equivalency-test)","courseLength":"OneYear","feesUK":9250,"aboutCourse":"This course will give you the skills and understanding needed to successfully meet the needs of children in the classroom. Though you have chosen the 5-11 route you will be qualified to teach across the primary age range and so extending your employment opportunities in the future.\r\n\r\nThe setting of this course also provides you with the opportunities to understand the urban context and experience working with children from a wide range of social, economic and cultural backgrounds. While the PGCE is an academic qualification, the emphasis is very much on practical experience, with around two thirds (120 days) of the course spent in school. While on the course you would have school based training in Key Stage 1 and Key Stage 2.\r\n\r\nYou’ll also learn by attending workshops, group discussions and blended learning.  However this course is practical and very hands-on in its approach. This will be linked closely to the BCU Core Curriculum Framework.\r\n\r\nAll trainees will learn to teach across the whole range of subjects in the primary National Curriculum, with a strong focus on English and mathematics.\r\n\r\nWithin the professional studies and leadership module you will be able to focus on a National curriculum subject with a view to subject leadership in the future. \r\n\r\nAll aspects of the PGCE, including your school experience placement of 120 days, will be linked closely to the BCU Core Curriculum Framework.\r\n\r\n[Find out more on our website]\r\n(https://www.bcu.ac.uk/courses/pgce-primary-and-early-years-education-2022-23)","interviewProcess":"You will be required to attend one on line interview. Interviews include:\r\n\r\n* exploration of curriculum knowledge during the 1 to 1 interview \r\n* discussions about relevant experiences with your interviewer. \r\n* a discussion on an education related topic that you have prepared.  \r\n* a reflective written task. \r\n\r\nWe also look for: \r\n* good communication skills\r\n* potential / suitability to be a good teacher\r\n* robustness to cope with the demands of the course\r\n","howSchoolPlacementsWork":"You will spend at least 120 days – working in two schools on block placement gaining valuable breadth of real-life experience. You will gain direct teaching experience and work with experienced teachers in the classroom. \r\n\r\nSchool placements are predominantly in West Midlands primary schools. You will be assigned a trained mentor/ class teacher and a university tutor while on placement, who will support and guide your work, as well as provide training and feedback.","personalQualities":"","otherRequirements":"Applicants must meet the Department for Education’s Initial Teacher Training criteria, which means being medically fit, successfully completing an enhanced disclosure via the Disclosure and Barring Service (DBS) and satisfying any other safeguarding check required for your course.\r\n\r\nWhile not essential, you may wish to gain some school experience before attending interview.","status":1,"createdAt":"2021-07-06T10:52:49.608Z","updatedAt":"2021-09-09T13:06:34.979Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
