{"id":"66d47d58-1459-4809-a52a-344ebe28ca0b","name":"Geography","code":"25CB","qualification":"qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3f47e67b-7fa5-4947-a5a0-74d528cd2a87","code":"F8","name":"Geography"}],"locations":[{"id":"73b3a943-7f3a-4c77-a60b-3ec56a70e268","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"531c6ba0-83c9-4dda-9fff-7646886b19b1","code":"1O2","name":"St Joseph’s College SCITT (School Direct)"},"accreditedBody":{"id":"b7eed63e-bb08-4445-bb7a-a3ea2eae9a58","code":"1WJ","name":"St Joseph’s College SCITT"},"degreeGrade":"1","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Please contact us to discuss which GCSE equivalent qualifications/ tests we will accept.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"The programme covers the 11-16 age range, however we are also able to offer all trainees an additional post-16 enhancement through St Joseph's College Sixth Form, and primary experience.\r\n\r\nOur ethos is one of providing care and support for 'the whole person'. The programme enables its Graduate Trainees to flourish with the help of a bespoke training plan. Training opportunities to support your individual training plan are identified within your lead or ‘placement’ school and you will have the opportunity to learn from outstanding teachers and school leaders. In addition, your in-school training is complemented by a weekly programme of subject knowledge development and wider professional development sessions. These are delivered centrally at St Joseph's College by outstanding practitioners from our partner schools as well as invited experts. These sessions include specific training around child protection, behaviour management, SEND, EAL, literacy, preventing bullying, assessment and key aspects of effective pedagogy. \r\n\r\nAssessment is continuous and evidence- based against the Teachers’ Standards but there is no requirement for the completion of additional assignments. This allows trainees to focus on developing the craft of the classroom. Your day-to-day support comes from your subject mentor in school and wider professional support from the lead school’s Professional Mentor. You have 2 formal assessment points, where a Quality Assurance Lead visits to agree the quality of your evidence against the Teachers’ Standards, your teaching, your reflections on your own progress and of the targets set for your self-improvement. This is supported by in-school half termly reviews with your mentors.\r\n\r\nAs a provider we pride ourselves on our flexible and supportive approach. You will work to an individual training plan tailored to your developmental needs but also building on any existing strengths and experience. You will be immersed in the life of your lead school from the first day of the new academic year and will therefore benefit from a high level of experience within and beyond the class room, experiencing and gradually assuming ‘the life of a teacher’. In the spirit of ‘gradualism’ your teaching timetable builds up, once you have observed best practice and begun leading parts of lessons, to 50% in term 1, 70% in term 2 and 80% in term 3. Thus you experience much of the curriculum and are able to trial and evaluate different approaches to teaching in order to flourish into the best teacher ‘you’ can be.\r\n","interviewProcess":"We assess your potential to train to teach and, because our course is school-based and therefore provides an ‘immersive’ experience of school life,  your journey into teaching starts with us at interview.\r\n\r\nHere we conduct assessment activities involving students and staff, but we do not ask you to teach a lesson-you’re not a teacher yet! There are 3 parts to the interview which involve a presentation, a pupil panel and a formal interview.  All relate to the Teachers’ Standards, the subject you wish to train to teach in, your ability to present, listen and respond to others, and bring out your appreciation of the role of a teacher, the curriculum, how you might help students to make progress and issues that affect our classrooms every day.\r\n\r\nInterview panels contain representatives from lead schools and SCITT leaders who are suitably trained, and we moderate all candidate responses, giving feedback where requested.\r\n\r\nWe love spotting potential teachers who can impact positively on the life chances of young people, so please come and join our noble profession!\r\n","howSchoolPlacementsWork":"A trainee will be assigned to one of our partner schools as the 'lead school' and this is where the majority of their in-school training will take place. This placement commences on the first day of the academic year. \r\n\r\nIn the spring term trainees will undertake a 'second school experience' in a contrasting school within the locality of not less than 30 days for half a term. A shorter primary school placement of one week takes place in the autumn term, and sixth form enhancement training is available.\r\n\r\nOur secondary schools in the partnership include Birches Head Academy,  \r\nCheadle Academy, Excel Academy, St John Fisher Catholic College, St Joseph's College, St Margaret Ward Catholic Academy, St Thomas More Catholic Academy, The Co-operative Academy of Stoke-on-Trent, The Discovery Academy, The Kings CE (A) School and Thistley Hough Academy. \r\n\r\nThese schools are all readily accessible and located within the city of Stoke-on-Trent and the surrounding areas. \r\n","personalQualities":"We are looking for ambitious trainee teachers who are passionate and enthusiastic about their subject and who can demonstrate a real aptitude for teaching. \r\n\r\nIt is advantageous if applicants have either paid or voluntary experience of working with the relevant age group of young people, and those with relevant industrial or commercial experience are very welcome to apply.\r\n \r\n","otherRequirements":"We ensure that all trainees have been subject to appropriate pre-selection checks:\r\n\r\nAn enhanced  DBS disclosure check and a prohibition check (UK and European Economic Area (EEA)) will be carried out before commencing the programme.   \r\n\r\n\r\n\r\nSuccessful applicants will be asked to complete a medical form prior to commencing the programme assessing 'fitness to train to teach'","status":1,"createdAt":"2021-07-06T10:52:51.176Z","updatedAt":"2021-10-04T12:59:55.964Z","canSponsorStudentVisa":"no","cycle":"2024"}
