{"id":"0f113abd-b7d6-4c66-9570-56a766a48720","name":"Primary (3-7)","code":"2MJP","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_7","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"1d788251-20d6-4a83-8c00-32aace472f8f","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"cb2e85e6-bae1-4ef5-999e-bea30afe98f8","code":"14W","name":"Leicester and Leicestershire SCITT School Direct OLP TSA"},"accreditedBody":{"id":"6cbdc52f-08fc-47e9-b2ee-831ac14e2d98","code":"L35","name":"Leicester & Leicestershire SCITT"},"profPost":"PG","degreeGrade":"9","english":"1","maths":"1","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feeDetails":"Unsalaried","aboutCourse":"This unsalaried [Ofsted](https://files.api.ofsted.gov.uk/v1/file/2535240) Outstanding School Direct course, leading to QTS and a PGCE, specialises in teaching Foundation Stage and KS1 pupils. Training sessions take place alongside other [Early Primary SCITT](https://leics-scitt.co.uk/our-courses/) and SD trainees in bespoke training rooms within schools.   Sessions are dynamic and engaging. Each of the 30-35 trainees quickly become known as unique individuals so SCITT trainers and management can mould training and select placements to fit each individual’s needs, working exactly as skilled teachers do with their pupils.  This is a key strength of our programme, making the training personalised so that trainees are challenged and supported at every step in becoming the best teacher they can be.     \r\n\r\nThe SCITT trainers are all leading experts in their fields, charismatic and passionate about making a difference in children’s lives. They include excellent practitioners from partner schools and consultants who will ensure trainees will swiftly establish an understanding of early learning and developmental progression and how these are fundamental in teaching in the early years. \r\n\r\nCentral training includes days spent working with exceptional teachers and pupils, in supportive partnership schools, so all trainees are exposed to best practice in teaching creatively and effectively. We want future pupils to love learning and our future teachers to love teaching!  \r\n\r\nGood subject knowledge underpins effective teaching, and the quality and depth of our central training is a key reason why so many of our teachers have risen rapidly to senior management roles in schools.  Headteachers, SCITT trained teachers and trainees are unanimous in stating that the course structure is the ideal blend of theory and practice. We offer 60 full days of central training, more than the majority of current ITT programmes.  \r\n\r\nWithin the course, all trainees have regular opportunities to work alongside pupils in an outstanding special school and a number choose to opt for a final teaching placement in a special school as a result. \r\n\r\nAn integral part of the courses is a full University of Leicester PGCE, with  Masters Level credits.  Trainees complete the equivalent of two 5000 word assignments within this PGCE award,  receiving additional training at the University and are recognised as students of the University. This includes access to the library, sports and learning support facilities. \r\n\r\n Click [HERE](https://leics-scitt.co.uk/our-courses/) for more information about the course design and timetables. \r\n","interviewProcess":"The SCITT and School Direct partner alliances, will use a two stage interview process for candidates called to interview, normally held on two separate days. It may be possible to hold both interviews on the same day for candidates who need to travel further or candidates who will find attending interview for two half days particularly difficult.   \r\n\r\nAs part of our selection process all candidates will be asked to complete written audits in English and mathematics.  The written audits assess whether each candidate’s personal subject knowledge in English and mathematics is sufficient to form a secure base to underpin high quality teaching of these subjects in the primary school. \r\n\r\n [Audit Information and Preparation Advice](https://leics-scitt.co.uk/entry-requirements/our-interview-process/) \r\n\r\nThe interview process will also take place in our partner schools and will involve a combination of tasks including:  \r\n\r\n* a presentation, connected to current educational issues;  \r\n\r\n* a task working with a small group of early primary or primary pupils;  \r\n\r\n* a formal interview;  \r\n\r\n* a reading task.  \r\n\r\nEach part of the selection procedure will be graded to agreed criteria. The interview questions will be largely based on elements that will contribute to the Teachers’ Standards. Equal opportunities procedures will be followed to ensure that the selection procedures are open, fair and assessments are to agreed criteria.\r\n","howSchoolPlacementsWork":"The SCITT partnership knows trainees can only reach their potential if given exceptional support in placements. Teaching is about relationships; and the relationship between a trainee and their class teacher on placement is vitally important.  The trust and loyalty of headteachers and teachers in our partner schools, built up over the last 15 years, is a key strength of our training. 7 of the Top 10 Primary Schools in Leicestershire (including the TOP 3) are part of the SCITT partnership, offering SCITT student placements and employing SCITT NQTs. [The Real Schools Guide 2018](https://leics-scitt.co.uk/wp-content/uploads/2019/09/TOP-ten-schools-2019.pdf)  \r\n  \r\nThe consistently high quality of support on 3 different school placements, from dedicated and enthusiastic teachers, underpins our success, making us one of the very top teacher training providers in the country [The Good Teacher Training Guide](https://www.buckingham.ac.uk/wp-content/uploads/2017/04/GTTG17fin.pdf).  This maximises opportunities for each trainee to learn from best practice in different settings.  Our trainees complete training confident across the EYFS and Key Stage 1 and are fully prepared to work in a wide variety of schools, ready to serve diverse pupil populations.   \r\n  \r\nAs a trainee on the Launde SD programme, you will a be part of the [Oadby Learning Partnership]( http://www.olpteachingschool.org/) At least one of your placements will therefore be in a OLP partnership school in the Oadby, Thurnby or Houghton area of Leicestershire.  Placements are carefully matched to trainee’s development needs and SCITT management also take into account issues such as childcare and public transport links, where relevant for individual trainees.    \r\n  \r\nThe autumn placement sees trainees experience  foundation stage and for an 8 week block.  In spring terms, you’ll have a KS1 placement in a different school.  For your final placement, you will be in either EYFS or KS1 in a third school.  Placements always begin with a week-long introduction visit to get to know the children and school.    \r\n  \r\nOfsted (2016) reported that “Placement schools are very carefully allocated to provide trainees with teaching experiences across the whole 5-11 age range in a variety of settings. This is an outstanding feature of the training.”  \r\n","personalQualities":"We are looking for talented, creative individuals, with a passion for teaching across a wide range of subjects within the primary curriculum. Good communication skills are at the heart of effective teaching and all applicants are expected to demonstrate excellent interpersonal and communication skills.  \r\n\r\nTeachers in schools know that teaching demands stamina and perseverance. We look for applicants with the resilience and determination required to cope with the demands of teaching.  \r\n\r\nWe aim to recruit a range of good role models representative of the local population, particularly from minority ethnic communities and men. We also encourage LSAs and career changers. \r\n","otherRequirements":"A commitment to undertake teacher training is a major step. As such it is important applicants make this commitment based on a first hand understanding of the pressures and rewards of working in a British primary school in the twenty first century. Applicants are strongly encouraged to have a minimum of one week’s relevant and recent experience in a primary school. We feel this is advantageous to demonstrate your understanding of teaching and learning in your interview.    \r\n\r\nApplicants will need to pass health and DBS police checks and have the physical and mental fitness to teach.\r\n","status":1,"createdAt":"2021-07-06T10:47:33.990Z","updatedAt":"2021-10-01T12:56:43.076Z","canSponsorStudentVisa":"no","cycle":"2024"}
