{"id":"57568582-807e-4707-9176-6f3ee657e3a5","name":"Primary (5-11)","code":"28DR","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"1d788251-20d6-4a83-8c00-32aace472f8f","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"cb2e85e6-bae1-4ef5-999e-bea30afe98f8","code":"14W","name":"Leicester and Leicestershire SCITT School Direct OLP TSA"},"accreditedBody":{"id":"6cbdc52f-08fc-47e9-b2ee-831ac14e2d98","code":"L35","name":"Leicester & Leicestershire SCITT"},"profPost":"PG","degreeGrade":"9","english":"1","maths":"1","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feeDetails":"Unsalaried","aboutCourse":"On this unsalaried [OFSTED](https://files.api.ofsted.gov.uk/v1/file/2535240) Outstanding School Direct course, you will be part of a cohort of 30-35 trainees, all specialising in teaching KS1 and KS2 pupils. Training sessions for the cohort take place in schools, in bespoke training rooms.  Sessions are dynamic and engaging and each trainee will quickly become known as a unique individual so SCITT trainers and management can mould training and select placements to fit each individual’s needs, working exactly as skilled teachers do with their pupils.  This is a key strength of our programmes, making the training personalised so that every trainee is both challenged and supported at every step of their journey to becoming the teacher they want to be.     \r\n\r\nThe SCITT trainers are all leading experts in their fields, charismatic and passionate about making a difference in children’s lives. They include excellent practitioners from partner schools and consultants working to raise standards within primary schools within the region.  \r\n\r\nCentral training includes days spent working with exceptional teachers and their pupils, in exceptional partnership schools, so all trainees are exposed to best practice in teaching the curriculum creatively and effectively. We want future pupils to love learning and our future teachers to love teaching!  \r\n\r\nThis programme offers more contact hours in central training (60 full days) than the majority of current ITT programmes.  Good subject knowledge underpins effective teaching, and the quality and depth of our central training is a key reason why so many of our teachers have risen rapidly to senior management roles in schools.  Headteachers, SCITT trained teachers and trainees are unanimous is stating that the course structure is an ideal balance of theory and practice.  \r\n\r\nWithin the course all trainees have regular opportunities to work alongside pupils in an outstanding special school and some choose to opt for a final teaching placement in a special school as a result. \r\n\r\nAn integral part of the courses is a full University of Leicester PGCE, with Masters Level credits.  Trainees are asked to complete the equivalent of two 5000 word assignments within this internationally recognised PGCE award.  Trainees receive some training at the University and are recognised as students of the University, with access to the library, sports and learning support facilities.\r\n\r\n Click [HERE](https://leics-scitt.co.uk/our-courses/) for more information about the course design and timetables. Sign up on our [website](https://leics-scitt.co.uk/) for a free information event or call us on 0116 2543187 or admin@leics-scitt.co.uk for further information.\r\n","interviewProcess":"The SCITT and School Direct partner alliances, will use a two stage interview process for candidates called to interview, normally held on two separate days. It may be possible to hold both interviews on the same day for candidates who need to travel further or candidates who will find attending interview for two half days particularly difficult.   \r\n\r\nAs part of our selection process all candidates will be asked to complete written audits in English and mathematics.  The written audits assess whether each candidate’s personal subject knowledge in English and mathematics is sufficient to form a secure base to underpin high quality teaching of these subjects in the primary school. \r\n\r\n [Audit Information and Preparation Advice](https://leics-scitt.co.uk/entry-requirements/our-interview-process/) \r\n\r\nThe interview process will also take place in our partner schools and will involve a combination of tasks including:  \r\n\r\n* a presentation, connected to current educational issues;  \r\n\r\n* a task working with a small group of early primary or primary pupils;  \r\n\r\n* a formal interview;  \r\n\r\n* a reading task.  \r\n\r\nEach part of the selection procedure will be graded to agreed criteria. The interview questions will be largely based on elements that will contribute to the Teachers’ Standards. Equal opportunities procedures will be followed to ensure that the selection procedures are open, fair and assessments are to agreed criteria.\r\n","howSchoolPlacementsWork":"The OLP School Direct and SCITT partnership know trainees can only reach their potential if given exceptional support in placements. Teaching is about relationships; and the relationship between a trainee and their class teacher on placement is vitally important.  The trust and loyalty of headteachers and teachers in our partner schools, built up over the last 15 years, is a key strength of our training. All of the top 4 Primary Schools in Leicestershire are part of the SCITT partnership, offering SCITT student placements and employing SCITT NQTs. [The Real Schools Guide 2019](https://leics-scitt.co.uk/wp-content/uploads/2019/09/TOP-ten-schools-2019.pdf)  \r\n\r\nThe consistently high quality of support on 3 contrasting school placements, from dedicated and enthusiastic teachers, underpins our success, making us one of the very top teacher training providers in the country (The Good Teacher Training Guides)(https://www.buckingham.ac.uk/wp-content/uploads/2017/04/GTTG17fin.pdf).  This maximises opportunities for each trainee to learn from best practice in different settings.   \r\n\r\nAs a trainee on The Launde SD programme, you will a be part of the [Oadby Learning Partnership]( http://www.olpteachingschool.org/) At least one of your placements will therefore be in a OLP partnership school in the Oadby, Houghton and Thurnby area of Leicestershire.  Placements are carefully matched to each individual trainee’s development needs and SCITT management also take into account the fact that trainees may be using public transport to reach placement schools.  Trainees with children are always thought about carefully so as to best support them as they juggle teaching demands with their own childcare arrangements. \r\n\r\nTrainees spend:  8 weeks in a placement school in autumn term; 7 weeks on placement term a different school/age phase in spring term; 10 weeks on placement in summer in a third school. The teaching load is phased in from 40% of the timetable at the end of the autumn placement to 80% of the time table in the final weeks of summer term.  \r\n\r\n[Ofsted](https://reports.ofsted.gov.uk/provider/41/70163)reported that “Placement schools are very carefully allocated to provide trainees with teaching experiences across the whole 5-11 age range in a variety of settings. This is an outstanding feature of the training.”\r\n","personalQualities":"We are looking for talented, creative individuals, with a passion for teaching across a wide range of subjects within the primary curriculum. Good communication skills are at the heart of effective teaching and all applicants are expected to demonstrate excellent interpersonal and communication skills.  \r\n\r\nTeachers in schools know that teaching demands stamina and perseverance. We look for applicants with the resilience and determination required to cope with the demands of teaching.  \r\n\r\nWe aim to recruit a range of good role models representative of the local population, particularly from minority ethnic communities and men. We also encourage LSAs and career changers\r\n","otherRequirements":"A commitment to undertake teacher training is a major step. As such it is important applicants make this commitment based on a first hand understanding of the pressures and rewards of working in a British primary school in the twenty first century. Applicants are strongly encouraged to have a minimum of one week’s relevant and recent experience in a primary school. We feel this is advantageous to demonstrate your understanding of teaching and learning in your interview.    \r\n\r\nApplicants will need to pass health and DBS police checks and have the physical and mental fitness to teach.\r\n","status":1,"createdAt":"2021-07-06T10:47:33.957Z","updatedAt":"2021-10-01T12:57:12.903Z","canSponsorStudentVisa":"no","cycle":"2024"}
