{"id":"3796f314-8c73-49d2-937f-1448999803a1","name":"Primary","code":"365S","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"b23461b2-1d19-4df7-a5b1-38c6c40f513d","name":"Kendal Primary Partnership Schools","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"3873d791-19ad-427c-b04a-7d7d3188af7f","code":"2FE","name":"Kendal Primary Partnership"},"accreditedBody":{"id":"9be9f611-2d36-431a-9109-7fcbbfc88fc8","code":"C99","name":"University of Cumbria"},"profPost":"BO","degreeGrade":"9","english":"1","maths":"1","science":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"From the first week of our course, you will be in school.  The majority of your training will be in educational settings, working with the age group you have selected to train in.  \r\n\r\nThere will be at least sixty training days during the year where you will learn the craft of teaching through a range of group sessions, observations, role play, tutorials, self-directed study, research and presentations. These training days will be in schools in South Cumbria so that you can learn from the best practitioners and experience a wide range of settings. \r\n\r\nIn order to extend your training, there will be immersion days and weeks within different schools, including large primaries with over 400 children on roll and smaller ones with less than 50.  This will enable you to experience a wide range of teaching and learning approaches. \r\n\r\nThe first few weeks of the course will have a more theoretical input and opportunities to observe lessons.  This will be followed by regular weekly training days linked to the craft of teaching as well as whole school issues, such as behaviour management and assessment for learning.  As a Primary trainee teacher, you are required to teach every curriculum subjects.  There will be sessions throughout the year that provide opportunities to learn about the pedagogy of teaching all core and foundation areas. \r\n\r\nAcademic assignments will be at Masters level, which requires reading, research and reflection on your own learning and experiences within the training year.  \r\n\r\nThere will be six modules which integrate theory and practical application within the classroom.\r\n\r\n* Building Professional Understanding - understanding the importance of the interplay between theory and practice. \r\n* Enhancing Professional Practice - develop understanding of how to evaluate, critique and develop professional practice.\r\n* Being a Teacher - develop skills, knowledge and understanding of the wider role of the teacher.\r\n* Learning Teaching and Subject Pedagogy - develop understanding in core areas of teaching: curriculum design, assessment, planning, managing classroom behaviour for learning and evaluation.\r\n* Subject Knowledge and Pedagogy Enrichment - enhance subject/area knowledge and pedagogy relevant to chosen pathway.\r\n* The Cumbria Teacher of Reading - teaching children to read with a focus on Systematic Synthetic Phonics.\r\n\r\nThroughout the year you will be supported by mentors and staff within our partner schools in addition to your Personal Tutor (Primary Programme Lead - PPL) and a University tutor (University Programme Lead - UPL).\r\n","interviewProcess":"The Interview process will be based at one of our partner schools and involve two local Headteachers and our Primary Progamme Lead.  \r\n\r\nThere will be a number of activities during the interview, including:\r\n* A mini teaching activity with 6 children of mixed ability (20 minutes)\r\n* An academic activity  \r\n* Individual interview (25 minutes)\r\n* Sharing any relevant school experience (recommendation)\r\n* Outline of our programme\r\n* Opportunity to ask any questions\r\n\r\nThe Interview process takes no more than half a day.\r\n\r\nAll applicants will be given a decision on the day.  \r\n\r\nSuccessful applicants will be offered a conditional place as there are conditions that must be met prior to starting the course. All ITT trainees must have Disclosure and Barring (DBS) clearance, a medical health check and all the required qualifications before the course starts in September.","howSchoolPlacementsWork":"During the year, you will have three assessed placements in school. These must take place in at least two different settings and in two phases to give you a range of deep learning experiences and to meet the requirements for QTS.\r\n\r\nAutumn Term - Beginning Placement  (6 weeks) \r\nSpring Term - Developing Placement  (6 weeks)\r\nSummer Term - Extending Placement (10 weeks)\r\n\r\nAll the schools we use for placements are in South Cumbria with a few in Lancashire.  The majority are in Kendal.  Placements are carefully selected to match students' individual needs and travel limitations as closely as possible.  \r\n","personalQualities":"A Kendal Primary Partnership student is someone who has the potential to inspire young people and be an excellent teacher of the future. \r\n\r\nSome of the attributes we will be looking for are: \r\n\r\n* An enthusiastic and approachable person \r\n* Good interpersonal and communication skills \r\n* Someone who enjoys working with  young children\r\n* A passion for education and an interest in teaching all subjects \r\n* Good organisation and time management skills \r\n* A role model for young people \r\n* Creativity \r\n* Ability to reflect and improve \r\n* Hard working \r\n* Potential for leadership in the future \r\n","otherRequirements":"All ITT trainees must have Disclosure and Barring (DBS) clearance, a medical health check and all the required qualifications before the course starts in September.","status":1,"createdAt":"2021-07-06T10:52:48.962Z","updatedAt":"2021-09-29T20:40:57.007Z","canSponsorStudentVisa":"yes","cycle":"2024"}
