{"id":"8151d1cb-7593-4fd0-9fb8-558ef40314b8","name":"Primary","code":"2SCX","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"7f2b529c-7bf3-43eb-a24a-f9cbd72b412a","name":"Overton CE Primary School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"28a7c3bb-e1fc-406e-bff7-b398d882cfbb","code":"28R","name":"Aspire Teaching Alliance"},"accreditedBody":{"id":"3700fb02-7007-40c8-9127-b070e146d6cb","code":"W76","name":"University of Winchester"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"Please contact aspire@overton.hants.sch.uk should you need to undertake an equivalency test.  There are University approved providers that you need to use.","courseLength":"OneYear","feesUK":9250,"feeDetails":"The tuition fees for September 2021 entry were £9,250 for UK, EU and Islands (Channel Islands and Isle of Man) students, however the tuition fees are yet to be confirmed for 2022 entry.  Please contact us for further information. \r\n","aboutCourse":"Aspire develops and nurtures reflective, creative and confident classroom teachers. \r\n\r\nThe course prepares you to teach across the age ranges 5-11 and is structured around a combination of taught modules from the University and placement modules based in schools or educational settings.\r\n\r\nThis course offers a brilliant option if you want to train and learn ‘on the job’.  You will spend four days each week in your host school learning alongside an experienced class teacher.  The fifth day is dedicated to high-quality professional training that immerses you in the theory and practice of primary teaching.  Over the year, the majority of these training days take place at Overton CE Primary  or one of the Alliance’s partner schools.  Approximately thirteen training days across the year are delivered by the University of Winchester where trainees have full access to the University resources, support, tutors and online learning platform.\r\n\r\nYou will undertake studies in all elements of primary education; extend your knowledge of learning and teaching, of the breadth and scope of the curriculum and the professional skills associated with high-quality teaching. You will then apply these areas of understanding and skill to classroom practice throughout the year in two placement schools.\r\n\r\nThe three assignments to be completed over the course of the year are directly related to your teaching practice and the weekly professional training days.  \r\n\r\nOur mentors are experienced teachers, who undertake rigorous professional development to ensure they can fully support, coach and mentor.  By the end of the programme, you will be expected to have demonstrated a thorough understanding of the Teaching Standards. \r\nIn addition to a main placement in a host school, you will undertake a second school experience in a different Aspire partner school for 6 weeks.\r\n\r\nOur vision and passion is to provide you with an enriched experience within our Alliance. This combined with an outstanding University provider will nurture you to become a successful 21st-century teacher.  \r\n\r\nUpon successful completion of the course, you will be awarded a PGCE with recommendations for the award of Qualified Teacher Status (QTS).\r\n\r\n\"Learning on the job and seeing teachers in action...having the opportunities to try and try again. Taking risks in our teaching and having supportive class mentors who feedback straight away with new strategies and assurance.\" School Direct Trainee. \r\n","interviewProcess":"If you already meet or are expected to meet our entry requirements, and have demonstrated your passion and commitment to teaching in your application, you will be invited to attend an interview. The interview is your chance to demonstrate your potential to become a successful teacher. \r\n\r\nThe interview process consists of:\r\n\r\n* an English and Mathematics task to determine your competency in fundamental skills;\r\n\r\n* an observation of you taking a short session with a small group of children (where possible);\r\n \r\n* an individual interview with Head teachers from partnership schools, the Teacher Training Coordinator and a representative from the University; and\r\n\r\n* a short presentation on becoming a teacher.\r\n\r\nInformation about the format of the day will be sent to you via email in advance of the interview date. The interview is also your chance to find out more about the School Direct route into teaching, the Alliance and the University.  \r\n","howSchoolPlacementsWork":"If you are successful in securing a place on the course, you will then be allocated a main host school.  \r\n\r\nAspire currently has approximately twenty partner schools in the Basingstoke and Deane borough.  They are a mixture of all-through primary, infant and junior schools.  The majority of the schools are in Basingstoke itself along with schools to the north in Tadley (approximately eight miles from central Basingstoke). Overton CE Primary (lead school) is nine miles from Basingstoke.  \r\n\r\nIn selecting host schools, careful consideration is given to your home address and likely journey times in addition to any prior experience you have of particular year groups/ages in schools.  \r\n\r\nYou will also be assigned to a particular class where you will complete the majority of your training.  Your class will either be in Key Stage 1 (infant: ages 5-7) or Key Stage 2 (junior: ages 7-11).  \r\n\r\nEach school takes responsibility for tailoring the training to meet your needs. You will be released from your school one day a week for your professional training. \r\n\r\nYour teacher mentor will complete weekly observations of your teaching and provide developmental feedback, targets and support.  You will also be observed and supported throughout the year by the teacher training coordinator and your university tutor.  \r\n\r\nYou will also undertake a second school experience of 6 weeks after Christmas in another partner school which will be in a different age range to your main placement (5-7 or 7-11).\r\n\r\nThe course is full time from the beginning of September until the end of June.  \r\n","personalQualities":"We will look for evidence of a commitment to the teaching profession, an understanding of professional requirements, and an awareness of current educational issues in an application. \r\n\r\nPrior experience in a school is not essential, however prospective students may find experience in a school useful for obtaining insights into the primary education classroom. Experience in a school or similar setting may also provide reassurance to prospective students that teaching is the right choice for their career. \r\n\r\nWe are looking for trainee teachers who are passionate about making a difference and who can show initiative and resilience when working under pressure.  ","otherRequirements":"If you accept an offer of a place you will be required to complete a Disclosure and Barring Service (DBS) criminal records check and Prohibition Order check. \r\n\r\nIf you have spent time overseas in the last 5 years you may also be required to obtain criminal records checks from each of the countries you visited. \r\n\r\nYou will also be required to complete an occupational health check to confirm that you are fit to teach. \r\n\r\nThe University of Winchester will send you more information about when and how you need to complete each of these checks if you accept our offer. ","status":1,"createdAt":"2021-07-06T10:52:13.542Z","updatedAt":"2021-09-29T10:15:11.046Z","canSponsorStudentVisa":"yes","cycle":"2024"}
