{"id":"558a2bf3-267b-4f65-b06b-40421ea958ad","name":"Primary","code":"2PMG","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"b44b1509-e263-436b-b674-272ea8a022cb","name":"Brunswick Park","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"4952ad6b-6b34-435d-9ea3-7a3239507f45","code":"267","name":"Brunswick Park Alliance"},"accreditedBody":{"id":"9188f17a-79c4-43a9-b459-4952815b739a","code":"M80","name":"Middlesex University"},"degreeGrade":"9","english":"1","maths":"1","science":"2","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"no","courseLength":"OneYear","aboutCourse":"Brunswick Park Primary & Nursery School, alongside Middlesex University, offers the salaried school direct route in to teaching. With a number of years experience, we provide in house training tailored to meet the specific needs of all trainees. Trainees will undertake a graduated increase of teaching over their 4 days in school enabling them to put their theory in to practice. Wednesdays will predominantly be University based, but can be used for other professional development opportunities such as study time or observation of good practice. During the course of the training year, the teaching experience will be split across Brunswick Park and a contrasting setting. Throughout the process each trainee will have a qualified mentor from the school as well as a link tutor from Middlesex. Our success rate with trainees and with their subsequent employment and growth within the profession is testament to the support and guidance we provide throughout the year. Inspections both locally and through OFSTED also comment favourably on our high calibre of continuous professional development and subsequent high quality practice.","interviewProcess":"Candidates will be interviewed by members of the leadership team and will undertake a series of tasks throughout the interview process. To ensure suitability, candidates will be asked to complete Year 6 grammar and maths papers as well as participate in a group presentation and lead an activity with a group of children. There will also be a formal interview to complete the process. Prior to interview, it would be preferable if candidates had already successfully passed the appropriate skills tests.","howSchoolPlacementsWork":"The main school placement will be at Brunswick Park School, unless agreed otherwise. All partner schools are within reasonable travel distance, with the main partner school - Church Hill - walking distance. Candidates may choose to teach within Early Years Foundation Stage (3-5), Key Stage 1 (5-7) or Key Stage 2 (7-11). During the second placement, trainees would have to undertake experience in an adjacent Key Stage.","personalQualities":"We are looking for vibrant, hard working graduates to join our strong team. They must demonstrate sound knowledge and understanding of the profession as well as show a passion for teaching and making a difference. We also look for candidates with specific skills in areas such as music, sport and drama.","otherRequirements":"Whilst experience in school is desirable, we appreciate that some candidates will have had more opportunities than others. In this instance, we actively encourage candidates to come in to school (where practical) prior to commencement of the course. This may be through volunteering or even paid work where viable.","status":1,"createdAt":"2021-07-06T10:51:40.301Z","updatedAt":"2021-09-28T15:30:35.347Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"Trainees will be paid on point 1 of the unqualified teacher scale. There are no fees payable to the school."}
