{"id":"d048abac-f2d2-4935-a303-081adb1d248d","name":"Primary","code":"2C9X","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"B","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"c1d36831-e5f7-46fc-85b1-05e22ea0b85d","name":"Middlefield Primary Academy - Main Site","isPublished":"Y","status":"R","vacancies":"B"}],"trainingProvider":{"id":"170e7510-6d0f-4467-b225-f20f950022e3","code":"1C2","name":"Middlefield Primary Academy"},"accreditedBody":{"id":"af388cc3-644a-4fd3-bd71-55503b74fc21","code":"B22","name":"University of Bedfordshire"},"profPost":"BO","degreeGrade":"1","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"If you do not have the above GCSEs, we will accept certain approved equivalent examinations but please check with Admissions before embarking on a course of study.\nEquivalencies that we can accept are the following:\n* Equivalency Testing Company: (www.equivalencytesting.com)\n* Edge Hill University: (https://www.edgehill.ac.uk/study/equivalency/)\n* Educate Teacher Training: (https://www.educate-group.co.uk/teacher-training/ongoing-career-support/)\n\nEquivalencies that we cannot accept\n* Adult Numeracy and Literacy\n* Key Skills\n* Functional Skills\n* Units within an Access course (post 2014)","courseLength":"TwoYears","feesUK":9250,"feeDetails":"For the part time route, course fees are split equally over the two years of training.","aboutCourse":"Course content\r\n\r\nThe School Direct training route provides trainees with a balance of training and work experience which includes 'on the job' school experience, formal training, coaching & mentoring and academic study. Trainees attend lectures and seminars at the University of Bedford, one day a week, with the rest of the time spent in one of our DLPT schools or partnership schools. The training course covers the age range from five to eleven years, and operates either as a full or part time course.  \r\n\r\n*Full time: over one school academic year. \r\n\r\n*Part time: over two school academic years.\r\n\r\nYou will have a base school where you will carry out the majority of your placement. A contrasting placement in a second setting is undertaken during the Spring term. This will provide a broader view of educational issues and experiences. On the part time course, you spend the whole academic year in one school and then transfer to a contrasting school in the second year.\r\n\r\nYou will be assigned a school-based mentor. They will meet with you on a weekly basis to provide guidance and support. Starting on a zero % teaching timetable, with the support of your mentor this will gradually increase over the academic year until you are eventually teaching around 80% of a full timetable independently. Teaching time on the part time course increases in a similar way over the two year period.\r\n\r\nUpon successful completion of the course, all trainees will have achieved Qualified Teacher Status (QTS), a Postgraduate Certificate in Education (PGCE) and credits towards a Masters degree.\r\n","interviewProcess":"How we select our trainees.\r\n\r\nThe Course Coordinator will check all applications to see if the applicants meet the entry criteria. Those who are shortlisted will be invited for interview both with the Lead school and the university. This will involve taking part in a range of activities and a formal interview to assess a candidate's suitability for teaching. Successful candidates will be informed of the outcome within seven days of the interview date.\r\n","howSchoolPlacementsWork":"All of our placement schools are part of the Diamond Learning Partnership Trust. The schools are in the St Neots, Fenland and Royston areas. When placing trainees, we consider the distance they will need to travel from home to school, as well as matching them to a school that will suit their individual need. Our schools are: Middlefield Primary Academy, The Round House Primary Academy, Winhills Primary Academy, Great Staughton Primary Academy,  Kimbolton Primary Academy, Braybrook Primary Academy, Roman Way Academy, Glebelands Primary Academy, Gorefield Primary Academy, Thomas Eaton Primary Academy, Murrow Primary Academy, King James Academy Royston and Leverington Primary Academy.\r\n\r\nFull time trainees have two placements during the year, each placement being in a different key stage. The base school is where trainees undertake their placement in the Autumn and Summer Terms, they will then be placed in a contrasting school during the Spring Term. This ensures trainees are provided with a broad view and experience of primary education and have the opportunity to teach in both Key Stage 1 and Key Stage 2. \r\n\r\nTrainees spend four days a week in school so they can be immersed into school life right from the start. They become a member of the teaching team, taking part in all staff meetings and whole school staff development, with the opportunity to also get involved in after school extra-curricular activities and school events.\r\n\r\nPart time trainees also have two contrasting placements,namely one placement per school academic year. They spend two days a week in school. \r\n\r\nAll trainees have a mentor who is based in their placement school - this is usually the class teacher. Our mentors a fully trained and receive annual update training. They are experienced teachers and support their trainee to develop the knowledge and skills necessary to become confident classroom practitioners.","personalQualities":"We want to train the most ambitious, enthusiastic and committed graduates who aspire to make a difference to the life chances and education of children and have a rewarding and challenging career. \r\n\r\nApplicants should have:\r\n\r\n* excellent communication and organisational skills\r\n* commitment to working hard\r\n* ability to establish good working relationships within a professional team\r\n* confidence and ability to engage positively with children\r\n* commitment to excellence in teaching\r\n* flexibility \r\n* an interest in and understanding of the holistic and learning needs of primary aged children\r\n* some knowledge of current educational issues\r\n","otherRequirements":"Subject to satisfactory Disclosure and Barring Service check.\r\nIt is requirement that you gain satisfactory DBS Clearance before commencing this course. For more information, please see (www.gov.uk/disclosure-barring-service-check/overview) ","status":1,"createdAt":"2021-07-06T10:47:44.782Z","updatedAt":"2021-08-12T15:28:25.405Z","canSponsorStudentVisa":"yes","cycle":"2024"}
