{"id":"163df7bf-1edf-4ce6-8280-14f230967a8e","name":"Primary","code":"35PP","qualification":"qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"186ac84d-89f1-4139-8782-0c0c65f5c4f9","name":"Abbots Green Academy","isPublished":"N","status":"N","vacancies":"F"},{"id":"cbfb1f78-cc3c-47a0-aaf3-9e3c78d6a2c8","name":"Trumpington Park Primary School","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"d2946b21-4ba9-4188-aa25-bd6e0379cb55","code":"1LK","name":"CTSN - Cambridge Teaching Schools Network"},"accreditedBody":{"id":"16075b74-df88-4bcc-b3ce-6e42f63261d5","code":"1WO","name":"The Cambridge Teaching Schools Network, CTSN SCITT"},"degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","aboutCourse":"As a school based provider of initial teacher training, CTSN SCITT is very much grounded in the life of its local schools.  All the tutors on the course are experienced teachers, able to guide trainees into a thorough understanding of all aspects of the primary curriculum and appropriate pedagogy, informed by both research and the tutors’ own practice.  During the course, trainees will spend one day (usually Thursdays) in Core Training, and the remaining 4 days a week in school.  Whilst in school, trainees carry out specific teaching tasks, which will increase throughout the year, but also have plenty of time to get involved in other training activities: observing expert teachers; working with children in smaller groups; one-to-one tutoring; time for assessment and planning; reading, writing and research into effective learning and teaching.  Every trainee has a mentor (usually the class teacher) with whom teaching and other tasks are planned and evaluated at weekly mentor meetings; these meetings are the hub of the school based training.  In addition, each trainee is assigned to one of the senior tutor team who visit the trainee in school and support their learning throughout the year.  This provides a strong support network for the trainee throughout the course.  Trainees will have a choice of attending core training in either Cambridge or Bury St Edmunds.  The course will lead to the award of both QTS and PGCE (Anglia Ruskin University).  For further details please follow the link to [CTSNSCITT](https://ctsnscitt.info).","interviewProcess":"At interview you will usually be asked to teach a Key Stage One or Key Stage Two class for 15 minutes - you will be advised of the year group prior to interview.  In addition there will be a short written task and an interview with a SCITT Senior Tutor, together with a senior teacher from one of our partnership schools.  The employing school (i.e. the one that will pay your salary) may also want to interview you; this could be arranged on the same interview day or, if necessary, on an alternative date.","howSchoolPlacementsWork":"We have excellent relationships with a wide range of good and outstanding schools, across the Eastern region, which gives us considerable flexibility in placing trainees in local schools, within reach from their home.  Full time salaried trainees spend most of the time at their employing school, except for a short placement, in the first half of the Spring term, when you are placed at a contrasting school.  One key difference with the salaried training routes is that salaried trainees will have the professional  responsibility for teaching classes, for up to two days each week.  This means that there is considerably more independent teaching for salaried trainees, right from the very beginning of the course.  ","personalQualities":"As a school based ITT provider, CTSN SCITT works very closely with its partnership schools, and the vast majority of our trainees get jobs working in these local schools.  We are looking for creative, proactive, positive applicants who share our commitment that children in our local schools should have the best possible teachers, and a desire and determination to make this commitment a reality.","otherRequirements":"Before applying, you will need to have liaised with a school who is willing to employ you for the duration of the course. The provider does not find the school for you. You will be employed as an unqualified teacher; the rate of pay will depend on the school's or academy's pay scale. ","status":0,"createdAt":"2021-07-06T10:47:22.467Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"Throughout this full time training course,  you are employed by a school, for the ten months of the course.  You, as the candidate, need to find a school who is willing to employ you - this is not the responsibility of the provider. You will need to be employed as an unqualified teacher; the rates of pay will be determined by the school's or academy's pay scale for unqualified teachers, which may vary between different schools and academies.  "}
