{"id":"3d626d12-17e5-4ace-b5a8-a4e463abece5","name":"Computing","code":"2YWT","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"P","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"e6be6a9c-8696-4b88-8fbd-1ba1bef1b6fc","code":"11","name":"Computing"}],"locations":[{"id":"0faff2ff-7366-430c-bcb0-477b2b6d4007","name":"Bottisham Village College","isPublished":"Y","status":"R","vacancies":"P"},{"id":"8db1986b-39c4-4672-816f-893eb7ac2362","name":"King Edward VI School","isPublished":"Y","status":"R","vacancies":"P"}],"trainingProvider":{"id":"d2946b21-4ba9-4188-aa25-bd6e0379cb55","code":"1LK","name":"CTSN - Cambridge Teaching Schools Network"},"accreditedBody":{"id":"16075b74-df88-4bcc-b3ce-6e42f63261d5","code":"1WO","name":"The Cambridge Teaching Schools Network, CTSN SCITT"},"degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"You would need a minimum of a 2.2 Honours Degree (or overseas equivalent confirmed by ENIC UK). Usually, at least 50% of your degree should be directly relevant to the subject you wish to teach. However, applicants who have a degree in a non-related subject but have significant work experience relevant to the subject they wish to teach may also be considered.","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"TwoYears","aboutCourse":"As a school based provider of initial teacher training, the CTSN SCITT is very much grounded in the life of its local schools.  The tutors on the course are experienced, practising teachers and, from the beginning of the course, in Year 1, trainees will spend 1.5 days a week in school and attend Core Training on Fridays, either in Cambridge or Bury St Edmunds.  Whilst in school, trainees will have some teaching, including some contracted teacing as an unqualified teacher, but also have some time to get involved in other training activities: observing expert teachers; working with students in smaller groups, or in one-to-one tutoring; time for assessment & planning; reading, writing & research into effective learning and teaching.  Every trainee will have a dedicated subject specialist mentor, with whom training is planned and evaluated at fornightly mentor meetings; these meetings are the hub of the school based training.  Most of the Core Training on Fridays will look at issues in learning & teaching common to all trainees, but there are also regular subject afternoons to look at more subject specific pedagogy. In Year 2, part time trainees spend 2.5 days in school, with more occasional Central Training (as they will have completed most of this part of the course in Year 1).  In addition, each trainee will be assigned to one of the senior tutor team, who will act as a personal tutor throughout the course.  This course leads to the award of Qualified Teacher Status (QTS).  For further details please follow the link to [CTSN SCITT](https://ctsnscitt.info). ","interviewProcess":"At interview you will usually be asked to teach a small group of students, most probably in Key Stage 3.  In addition there will be a short written task and an interview with a SCITT Senior Tutor, together with a senior teacher from one of our partnership schools.  The employing school (i.e. the one that will pay your salary) might also need to interview you; this could be arranged on the same interview day or, if necessary, on an alternative date.","howSchoolPlacementsWork":"We have excellent relationships with a wide range of good and outstanding schools, across the Eastern region, which gives us considerable flexibility in placing trainees in local schools, within reach from the their home.  Part time salaried trainees spend most of their time at their employing school, except for the Summer term in the first year, when you will be placed at a contrasting school.  One key difference with the salaried training routes is that salaried trainees will have the professional  responsibility for teaching classes, for up to one day each week.  This means that there is considerably more independent teaching for salaried trainees, right from the very beginning of the course.  Applicants who are not ready for this level of independent teaching responsibility might consider a non-salaried training route, for which there might be a tax free bursary available.","personalQualities":"As a school based ITT provider, CTSN SCITT works very closely with its partnership schools, and the vast majority of our trainees get jobs working in these local schools.  We are looking for creative, proactive, positive applicants who share our commitment that students in our local schools should have the best possible teachers, and a desire and determination to make this commitment a reality.","otherRequirements":"Before applying, you will need to have liaised with a school who is willing to employ you for the duration of the course. The provider maybe able to help you to find a school for you. Please do not apply before you have a placement school organised.  You will be employed as an unqualified teacher; the rate of pay will depend on the school's or academy's pay scale. ","status":1,"createdAt":"2021-07-06T10:47:22.432Z","updatedAt":"2021-09-27T14:04:48.042Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"Salaried teacher trainees are employed by a school on the Unqualified Teacher scale, usually UQ1.  (It is worth bearing in mind that, depending on the subject, trainees might be better off on a non-salaried course; many subjects attract a generous tax free bursary from the DfE.)"}
