{"id":"086a9fbb-e0a8-4435-a561-2551432a5259","name":"Design and Technology (Product Design)","code":"3BM3","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"118fabd7-86d0-4a40-9e9a-e5c302abe59b","code":"DT","name":"Design and technology"}],"locations":[{"id":"1780adaf-b94c-4b7e-8474-9b4d685caf9f","name":"CVEA Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"f99870ea-ca70-489d-9e0e-7bd85506e122","code":"2FS","name":"Castle View Enterprise Teaching Alliance"},"accreditedBody":{"id":"926804ac-be7a-4f0a-97f9-a26a5f5f032a","code":"S84","name":"University of Sunderland"},"profPost":"PG","degreeGrade":"1","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"The Design and Technology - Product Design course is a secondary tuition course.  This means that you will pay a tuition fee for your course. \r\n\r\nThe training you receive will take place within school and the University of Sunderland. You will start the academic year at your school placement.  You will usually spend one full day a week at the University of Sunderland, plus induction days and review weeks.  You will be at the University for approximately 15 full days during the training year.  You will be taught via lectures, seminars, tutorials, project work and group work.  The University will provide you with your education assignments and evidence-based research.  You will have the support of a University Mentor throughout your training year.\r\n\r\nWork-based learning will be based in your school. You will have a subject mentor and a generic mentor at your school placement.  Training sessions will be provided by your host school.  You will have weekly mentor meetings to support your development as a teacher.  Your mentor will also observe your lessons on a weekly basis and support your reflective practice. \r\n\r\nAssessments will be a mix of written assignments, case studies and one to one assessments of your teaching practice.  \r\n\r\nOur School Direct programme requires you to complete a teaching placement in two of the schools within our alliance.  You will complete the majority of your teaching practice in your lead school. You will also complete a shorter teaching practice (normally five weeks) in one of our partner schools.  There will be the opportunity for trainees to visit other schools in the alliance for additional training opportunities including lesson observations and post-16 teaching experience.\r\n\r\nThis School Direct (Tuition) Post Graduate Certificate of Education degree awards you Qualified Teacher Status (QTS), which you need to teach in any state-maintained school in England and Wales.\r\n","interviewProcess":"You will be invited into the Academy.  The process usually takes half a day during which you will:\r\n\r\n* have a tour of the Academy;\r\n* deliver a teaching episode to a KS3 class; \r\n* have the opportunity to discuss the programme with both Academy  staff, staff from your placement school and staff from the University of Sunderland;\r\n* have the opportunity to meet the subject and generic mentors;\r\n* complete a short written task;\r\n* have an interview with the School Direct lead and a member of University staff.\r\n\r\nAs part of the application process, you must also have:\r\n\r\n* An enhanced Disclosure and Barring Service (DBS) check.  This will be completed with the University of Sunderland once you have been offered and accepted a place on the course.\r\n * A completed medical pro forma (based on DFEE Circular 8/92).\r\n\r\n\r\n\r\n","howSchoolPlacementsWork":"Our School Direct programme requires you to complete a teaching placement in two of the schools within our alliance.  You will complete the majority of your teaching practice in your lead school. You will also complete a shorter teaching practice (normally five weeks) in one of our partner schools.  \r\n\r\nOur partner schools are:\r\n\r\n* Belmont Community College\r\n* Durham School\r\n* King James I Academy\r\n* King’s Priory\r\n* Oxclose Community Academy\r\n* St Wilfrid’s RC College\r\n* Villa Real\r\n\r\nYour school will be selected according to the requirements / requests of each alliance school for placements.  You will be advised as part of the application process as to which schools have vacancies in your subject. \r\n\r\nAll schools within the alliance contribute to our School Direct training programme; hosting training days in their areas of expertise.  As a result trainees will have the opportunity to visit a range of schools in our alliance.  \r\n\r\n All trainees will have the opportunity to teach Key Stage 5 at either their host school or on their shorter placement. \r\n","personalQualities":"","otherRequirements":"You must also have:\r\n\r\n* An enhanced Disclosure and Barring Service (DBS) check.  This will be completed with the University of Sunderland once you have been offered and accepted a place on the course.\r\n * A completed medical pro forma (based on DFEE Circular 8/92).\r\n \r\n","status":1,"createdAt":"2021-07-06T10:51:37.519Z","updatedAt":"2021-09-17T07:44:16.387Z","canSponsorStudentVisa":"yes","cycle":"2024"}
