{"id":"297b7b2f-5105-49df-8f9a-2ba00ae70dff","name":"English","code":"3B7X","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3aed1aa8-ae46-4b68-92bb-a6cc20655c59","code":"Q3","name":"English"}],"locations":[{"id":"a216bda9-e9ac-4a4d-b9c0-bb9bd7ddfdb0","name":"Park Community School","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"757e03b3-1fcf-4808-97fc-4c9d62ec1553","code":"2K2","name":"Park Community School"},"accreditedBody":{"id":"3a04d0d3-7c91-44a9-b61c-1b57ba5611cb","code":"S56","name":"The Solent SCITT"},"profPost":"BO","english":"3","maths":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9000,"feesInternational":9000,"feeDetails":"Fees for The Solent SCITT programme to obtain Qualified Teacher Status and a PGCE qualification are £9000 or Qualified Teacher Status only is £8000.","financialSupport":"We offer guidance on the payment of bursaries and help with any financial queries you might have.","aboutCourse":"English is an expressive art form, which can change people.  Your passion and enthusiasm for English could show pupils the power of effective speaking, listening and writing for different audiences and purposes.\r\n\r\nFollowing a four-day induction in the final week of August, you are part of the school team from day one, beginning your main school placement in September in line with the academic year. \r\n\r\nA shorter six-week placement in January enables you to sample a different school setting before returning to your main school. Our practical ‘hands on’ training means you will spend  a substantial amount of time in school.\r\n\r\nWhilst most training days take place at Park Community School, school placements will be at a variety of partnership schools. We carefully match candidates to a suitable partnership school.\r\n\r\nAn experienced school mentor will be assigned to provide support and guide your teaching development. Subject specific sessions to enhance your knowledge are run by Subject Experts and take place for half a day fortnightly.\r\n\r\nSubject Experts are current outstanding practitioners who will tailor a programme around your needs and provide up to date advice on subject specific teaching and learning.  \r\n\r\nAlongside Qualified Teacher Status (QTS) there is the option to add a PGCE qualification validated by the University of Portsmouth. This would involve two sessions at the University with the rest of the content delivered in school. \r\n\r\nAssessment will take place in the following ways:\r\n* Lesson Observations\r\n* Evidence in your Teachers' Standards Portfolio\r\n* Professional conduct throughout the course\r\n* Reports completed by your mentor for each school experience\r\n* Effective completion of TL PD and Subject training\r\n* If applicable - Assignments to meet PGCE requirements\r\n\r\nYou can expect a challenging but enjoyable year in which you will learn a lot, meet new people and develop as a person and professional. \r\n\r\nWell-being is important to us so we organise a variety of activities and provide expert advice on managing stress, workload and effective use of time.\r\n","interviewProcess":"The interview will be with two members of the SCITT team and/or subject specialists. We aim to interview within 7 working days if possible and will email out a detailed overview of the interview process.\r\n\r\nThe interview comprises of:\r\n\r\n* A microteach of up to 5 minutes in an area of the subject you have chosen to teach\r\n* A formal interview\r\n* A GCSE examination paper of the subject you have chosen to teach to demonstrate subject knowledge\r\n* Completion of a professional task to demonstrate an understanding of school life and the responsibilities of a teacher\r\n\r\nCandidates are asked to bring original GCSE and Degree Certificates with them for the interview along with three forms of ID.\r\n","howSchoolPlacementsWork":"We offer a unique combination of five school experiences, including Key Stage 2, 5 and Special School experiences, as part of our varied programme.\r\n\r\nAspiring teachers begin with a main secondary school placement in September and are part of the school staff from the start of the year which is hugely advantageous.   \r\n\r\nA second six-week placement in a contrasting school takes place in January before returning to the main school placement until the course ends in late June. \r\n\r\nPrimary, Sixth Form and Special School visits are incorporated within the programme enabling a chance to look at different Education sectors.\r\n\r\nWhen arranging school placements, we consider the travel distance for candidates and use our experience to find a best-fit option.\r\n\r\nOur partnership schools are committed to teacher training and all have employed previous trainees on successful completion of the course.\r\n","personalQualities":"We are looking for people with enthusiasm and a passion for teaching and making a difference to young people.","otherRequirements":"You must undertake an Enhanced Disclosure and Barring Service check (DBS) and an Occupational Health Assessment to assess fitness for teaching.\r\n","status":2,"createdAt":"2021-07-06T10:51:39.860Z","cycle":"2024"}
