{"id":"0e12f8af-9f89-4a5c-8aa4-2572d7f42281","name":"Primary","code":"2FLK","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"0e04ab7a-bece-4c13-a6d0-de7476422b5e","name":"Portsmouth","isPublished":"Y","status":"R","vacancies":"F"},{"id":"b4374b62-9e64-472e-ab59-4a924f3f00c6","name":"Basingstoke","isPublished":"Y","status":"R","vacancies":"F"},{"id":"f16dbdb7-c3d3-425b-94e2-e0f7d62cb9fb","name":"Reading","isPublished":"Y","status":"R","vacancies":"F"},{"id":"250476ac-3d40-4e97-a653-d635b9328f13","name":"Poole","isPublished":"Y","status":"R","vacancies":"F"},{"id":"2f6fc189-d1dd-48dc-8735-320cdec560dc","name":"Wokingham","isPublished":"Y","status":"R","vacancies":"F"},{"id":"10b8a695-01b9-4680-b451-05c87d76da1b","name":"Southampton","isPublished":"Y","status":"R","vacancies":"F"},{"id":"aaedb8b3-ab8d-45ee-817b-800601716c8b","name":"Maidenhead","isPublished":"Y","status":"R","vacancies":"F"},{"id":"29077950-1bbc-45fd-99d8-2b3277b15257","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"},{"id":"f2ab83b7-911c-4dd9-96da-a63f5d3f9df7","name":"Bournemouth","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"54859abb-2285-491c-a563-017dedbe4679","code":"1N4","name":"CTSA"},"accreditedBody":{"id":"c6cc9d00-9dc5-4e23-959d-d2be40dd4aed","code":"P85","name":"Primary Catholic Partnership SCITT (PCP SCITT)"},"degreeGrade":"2","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We accept equivalency tests and our recommended provider is \n(https://www.equivalencytesting.com/)","courseLength":"OneYear","feesUK":null,"aboutCourse":"Salaried Primary\r\n\r\nUCAS Provider number : 1N4    [The CTSA]( https://www.thectsa.org)\r\n\r\nUCAS Course Code: 2FLK\r\n\r\nEligibility:\r\nThis course is for those who have a school who is willing to pay their salary and training fees.\r\n\r\nExpectations: \r\nYou are expected to be able to take on a class of 30 for 70% of the week from day 1.\r\n\r\nCourse Content:\r\nYou will follow a school based course that leads to Qualified Teacher Status (QTS), working with experienced teachers guided by a mentor throughout.\r\n\r\nThe course content is individually tailored to ensure the whole Primary subject spectrum is covered. You will initially carry out lesson observations and participate in team teaching sessions leading to opportunities for independent teaching.\r\n\r\nSupport on a 1-1 basis will be provided through an in school mentor who you will work with daily as well as in house training sessions delivered by experienced school staff.\r\n\r\nYour study is supported by visits from your PCP tutor to your placement school. You will also receive training, through training events nearest to your host school run by both the CTSA in Aldershot and the PCP in Southampton.\r\n\r\nWe have an online portal that it’s packed full of information and resources that you can access anytime. This means that you can fulfill your personal development needs within your own time, and have access to teaching tools whenever you need them.\r\n\r\nYour experience will be complimented by two placement blocks in different schools within the alliance, one Key stage 1 and the other in Key stage 2  as well as other tailored and structured visits.\r\n\r\nWe treat all of our students as individuals and can tailor your training to meet your requirements. We always aim to place you in schools that will meet your personal and professional needs. Being a small organisation means we see you as individuals and aim to support you throughout your year.\r\n\r\nYou do not need to be Catholic to train with us. We welcome everyone.\r\n\r\nCourse Entry requirements:\r\nYour need to have a school that is sponsoring you for this route, willing to pay your salary and training costs.\r\n\r\nYou must have achieved a standard equivalent grade C in the GCSE examinations in English, Mathematics and a Science subject. If you do not meet the GCSE requirement, you can do an equivalence test.\r\n\r\nWe recognise the tests offered by Equivalence Testing. \r\n\r\n\r\n\r\n","interviewProcess":"You will need to attend one interview with our course coordinator and provider director. \r\n\r\nThis will be held at a hub school close to where you are based or online. \r\n\r\nAfter the interview you will be expected to take three tests on\r\n\r\n* Maths\r\n* English \r\n* Spelling\r\n\r\nThese tests are diagnostic not pass or fail.\r\n\r\nWhat are we looking for?\r\nWe are looking for applicants who have the potential to become outstanding teachers, who are able to think and work independently on their studies who would enjoy and benefit from training in a school.\r\nYour personal qualities should include:\r\n\r\n* A high level of personal motivation to want to become an outstanding teachers;\r\n* Willingness to learn from experience and to receive and act on feedback\r\n* An analytical mind to better understand and overcome challenges;\r\n* A creative and imaginative outlook to apply different ways of teaching ;\r\n* Good organisational skills; and\r\n* A good understanding an liking of young people\r\n* Experience of teaching\r\n","howSchoolPlacementsWork":"We work with over 30 schools, both Catholic and non Catholic throughout Hampshire, Surrey, Berkshire and Dorset. \r\n\r\nWe have Hub schools based in Aldershot, Basingstoke, Bournemouth, Isle of Wight, Portsmouth, Reading and Southampton\r\n\r\nWe always aim to place a student in a school that will meet their personal and professional needs. With so many schools available covering such a vast geographic area we invariably achieve this.\r\n\r\nWe have in the past been approached by potential students who already have a working relationship with a particular school and we have liaised with that school to ensure their placement is at that school.\r\n\r\nAs this is a Primary course you will be teaching children from 4-11. You will experience teaching both Key stage 1 children who are aged 4-7 and Key Stage 2 children who are aged 7-11.\r\n\r\nYou will undertake 6 week placement at an alternative school to give you a view of how other schools run. We will support you and arrange that placement for you and ensure that you don’t have too far to travel.\r\n","personalQualities":"Your personal qualities should include:\r\n* A high level of personal motivation to want to become an outstanding teachers;\r\n* Willingness to learn from experience and to receive and act on feedback\r\n* An analytical mind to better understand and overcome challenges;\r\n* A creative and imaginative outlook to apply different ways of teaching ;\r\n* Good organisational skills; and\r\n*A good understanding an liking of young people\r\n","otherRequirements":"As this is a salaried position you will need teaching experience  as an unqualified teacher with the expectation being that your have enough experience to teach a full class of 30 on your own for 70% of the week.\r\n\r\nYou need to have a school sponsoring you to apply for this course, willing to pay your salary and training costs.","status":1,"createdAt":"2021-07-12T13:49:26.439Z","updatedAt":"2021-09-24T12:51:13.459Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"Salary will vary based upon the school that you will be based at, but you will be on the Unqualified Teacher pay scale.\r\n\r\nYou do not need to pay for this course."}
