{"id":"81ea93e7-3160-4852-99a9-2033a0c7ac05","name":"Primary","code":"3BY4","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"TA","fundingType":"apprenticeship","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"b4374b62-9e64-472e-ab59-4a924f3f00c6","name":"Basingstoke","isPublished":"N","status":"N","vacancies":"F"},{"id":"aaedb8b3-ab8d-45ee-817b-800601716c8b","name":"Maidenhead","isPublished":"N","status":"N","vacancies":"F"},{"id":"f2ab83b7-911c-4dd9-96da-a63f5d3f9df7","name":"Bournemouth","isPublished":"N","status":"N","vacancies":"F"},{"id":"29077950-1bbc-45fd-99d8-2b3277b15257","name":"Main Site","isPublished":"N","status":"N","vacancies":"F"},{"id":"f16dbdb7-c3d3-425b-94e2-e0f7d62cb9fb","name":"Reading","isPublished":"N","status":"N","vacancies":"F"},{"id":"10b8a695-01b9-4680-b451-05c87d76da1b","name":"Southampton","isPublished":"N","status":"N","vacancies":"F"},{"id":"0e04ab7a-bece-4c13-a6d0-de7476422b5e","name":"Portsmouth","isPublished":"N","status":"N","vacancies":"F"},{"id":"250476ac-3d40-4e97-a653-d635b9328f13","name":"Poole","isPublished":"N","status":"N","vacancies":"F"},{"id":"2f6fc189-d1dd-48dc-8735-320cdec560dc","name":"Wokingham","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"54859abb-2285-491c-a563-017dedbe4679","code":"1N4","name":"CTSA"},"accreditedBody":{"id":"c6cc9d00-9dc5-4e23-959d-d2be40dd4aed","code":"P85","name":"Primary Catholic Partnership SCITT (PCP SCITT)"},"english":"3","maths":"3","science":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"4 school terms","feesUK":null,"aboutCourse":"The Primary Catholic Partnership has provided teacher training for twenty years. It has a strong reputation for high quality training that enables trainees to enter the professional confidently, feeling thoroughly prepared and ready to enjoy a successful teaching career.\r\n\r\nYou will follow a school based course leading to the award of Qualified Teacher Status (QTS) within a postgraduate teaching apprenticeship. You will be working with experienced teachers guided by a school mentor and a link tutor throughout, with robust quality assurance.\r\n\r\nThe course content is tailored to ensure the whole Primary subject spectrum is covered and to ensure the best possible training according to individual experience and development needs. \r\n\r\nSupport on a 1-1 basis will be provided through an in-school mentor, who you will work with daily, as well as a link tutor from PCP, encompassing the full backing of an organisation specialising in teacher training for two decades and with a strong track record of success. The PCP will provide bespoke training whilst the school will provide in-house training sessions delivered by experienced school staff.\r\n\r\nYour study will be supported by visits from your PCP tutor to your placement school. You will also receive professional and personal development through training events at the PCP in Southampton for up to 20 days a year.\r\n\r\nAs well as spending five of your six half-terms in your main placement school, your experience will be complemented by a second placement in the Spring Term in a contrasting school and different Key Stage, providing more learning opportunities.\r\n\r\nBeing a smaller provider with a wealth of experience means we see you as individuals and support and nurture you accordingly throughout your year. We tailor our training to meet your requirements and to help you to be the best you can be in your training year.\r\n\r\nYou do not need to be Catholic to train with us. We welcome everyone.\r\n\r\n","interviewProcess":"Selection normally takes place at the PCP training centre on a single day. You will usually attend with other applicants.\r\n\r\nThe day will begin with an introduction from the PCP. You will be given the chance to ask questions about initial teacher training and the training routes offered by the partnership. Our aim will be to help you confirm that you are choosing the most suitable course. During the selection day, you will be asked to give a five minute presentation and be observed undertaking a short teaching task in a partnership school. \r\n\r\nYou will also take part in a personal interview with two members of the Partnership Board, one of whom is normally a head teacher. You will have the opportunity to ask individual questions and highlight any specific needs you may have.\r\n\r\nYour entry qualifications will be checked during the day and there will be formative assessment tasks in English and Mathematics. These will enable us to assess your level of subject knowledge for teaching and begin your personal development plan. If you are accepted on to the course, we may offer you the opportunity to attend a free subject booster day run by one of our specialist tutors before you begin the programme.\r\n\r\nAfter selection day, the PCP will be happy to provide feedback on your performance in specific areas of our tests. \r\n","howSchoolPlacementsWork":"As you will be the employee of a school, you will be based primarily at that school for your main placement.\r\n\r\nYour second placement of approximately half a term will be in the Spring Term at a contrasting school in a different Key Stage from your main placement.\r\n\r\nWe have Hub schools based in Aldershot, Basingstoke, Bournemouth, Isle of Wight, Portsmouth, Southampton and Reading where placement may be possible. We also work with schools outside of these areas and with whom your main placement school may already have an established relationship.\r\n\r\nIn any placement, it is always our aim to meet your personal and professional needs. The choice of so many schools across such a large geographic area enables us to achieve this by placing you carefully.\r\nAs this is a Primary course, you will be teaching children from 5-11. You will experience teaching Key Stage 1 children who are aged 5-7 and Key Stage 2 children who are aged 7-11.\r\n\r\nThe six week placement at an alternative school will give you a view of how other schools run. \r\n","personalQualities":"Applicants who have the potential to become outstanding teachers, who are able to think and work independently and who would enjoy and benefit from training in a school.\r\n\r\nYour personal qualities should include:\r\n* A high level of personal motivation to want to become an outstanding teacher; \r\n* Willingness to learn from experience and to receive and act on feedback; \r\n* An analytical mind to better understand and overcome challenges; \r\n* A creative and imaginative outlook to apply different ways of teaching ; \r\n* Good organisational skills; \r\n* A good understanding and liking of young people.\r\n","otherRequirements":null,"status":2,"createdAt":"2021-07-06T10:55:38.749Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024"}
