{"id":"b78a3b66-60cb-4788-9afd-dc259b711879","name":"Physical Education","code":"2ZND","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"74d64a54-5e34-4590-b6c7-528dd0cf26fe","code":"C6","name":"Physical education"}],"locations":[{"id":"393d2b87-908c-4d59-98a4-49df25ce6b72","name":"Main Site","isPublished":"Y","status":"S"}],"trainingProvider":{"id":"0d17beaf-8499-4efa-ad9f-74909acb947f","code":"1JJ","name":"West Yorkshire Teaching Alliance"},"accreditedBody":{"id":"791f82c8-19fd-4339-9c7b-301dee8067ce","code":"H60","name":"University of Huddersfield"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Please complete a test with (https://www.equivalencytesting.com/) before applying.","courseLength":"OneYear","feesUK":9250,"feeDetails":"Our tuition fees are determined by the University of Huddersfield.  Find out more about financial support available to PGCE students on the [UCAS website](https://www.ucas.com/postgraduate/teacher-training/train-teach-england/postgraduate-teacher-training-england).\r\n\r\nYou don’t have to pay the loan back while you study.  It will only be repayable when you have left the course and earn over £25,000 a year.\r\n\r\nYou apply for the tuition fee loan as part of your application to Student Finance England for loans and grants.  [Student Finance England](https://www.gov.uk/student-finance) will pay your fees direct to the University.\r\n\r\nWhen you enrol the university will ask you who will be paying for your fees and whether you have requested a loan.  If you have not taken a loan, they will send you an invoice for the fees, which will require payment in full during the relevant academic year.\r\n\r\nIf you are an international student coming to study with us, please visit the [International Fees and Finance pages](https://www.hud.ac.uk/international/tuition-fees/) for full details of tuition fees and support available.\r\n\r\nShould you need any further advice, please get in touch.\r\n\r\n\r\n","financialSupport":"We try, where possible to take geography and personal circumstances into account when organising school placements.  Trainees are expected to travel and may be required to travel up to 60 minutes (public transport) from their residence.\r\n\r\nPlease be aware of potential associated travelling costs.  \r\n\r\nWe do not routinely reimburse travel costs however applications for contributions can be made to our Hardship Fund.  Each application will be considered on its own merits.","aboutCourse":"This is a one year postgraduate certificate in education (PGCE) with qualified teacher status (QTS), preparing you to teach the 11-16 age range.\r\n\r\nThe course has two main themes:\r\n\r\n1. Initial Professional Development\r\n\r\nWe help develop your own thinking, teaching skills and subject curriculum knowledge with themes including:\r\n\r\n* how young people learn\r\n* behaviour management\r\n* assessment\r\n* creative and innovative teaching methods\r\n* designing learning\r\n* inclusion\r\n* current professional issues in secondary schools\r\n* researching educational theories\r\n* developing your own educational philosophy\r\n\r\n\r\n2. Physical Education Specialist Subject Pedagogy\r\n\r\nWe will develop your teaching and understanding of:\r\n\r\n* the Physical Education curriculum\r\n* progression in Physical Education\r\n* planning and curriculum development in Physical Education\r\n* examination requirements and inclusion issues in Physical Education\r\n\r\nYou will spend about two thirds of your time in school and one third in university.\r\n\r\nIn school\r\nIn school you will benefit from:\r\n\r\n* observing experienced teachers in your own and different subjects\r\n* practical hands-on experience with a range of ages and abilities\r\n* supportive mentoring\r\n* experience of being a form tutor, wider school activities and life outside the classroom! \r\n* access to any in-school training and development programmes  \r\n\r\nIn university\r\nTeaching is through a blend of workshops, tutorials, lectures (some with guest speakers) and group work with fellow trainee teachers, all of which takes place in friendly and supportive groups designed to give you the confidence to succeed.\r\n\r\nDuring the PGCE you will study two Masters level modules (60 credits) and have the opportunity to continue your studies during your NQT year to complete the Masters degree.\r\n\r\nWith WYTA\r\n\r\nAt WYTA we like to add further value to your course and your teaching experience.  In addition to your time in school and university we also provide our own training sessions, spread throughout the year.  This is provided by classroom teachers and leaders who are specialists in their areas of expertise.  \r\n\r\nOur sessions offer you an opportunity to take time out, to reflect on your learning so far and to identify what you would still like support with.  We keep our programme flexible in order that we can best meet your ongoing needs throughout the year.\r\n\r\nAt all stages you will be supported by mentors from WYTA, school and university, ensuring you are fully supported to help you develop into an outstanding and successful teacher.","interviewProcess":"We work closely with the University of Huddersfield to review our entry requirements and ensure applications meet our criteria.  If your application is successful, you will be invited to interview.\r\n\r\nInterviews take place 'remotely' or in our partner schools and our interview panel comprises representatives from the West Yorkshire Teaching Alliance, our partner schools and often a representative from the university.\r\n\r\nThe interview process may include:\r\n\r\n* A 15-20 minute teaching task, teaching a concept from your subject area usually to Key Stage 3 pupils\r\n* A formal interview\r\n* A subject knowledge task*\r\n* A written literacy task *\r\n* A short Maths and English audit *\r\n\r\n* *These tasks are designed to help us evaluate your skills and assess what support we may need to provide, should you be offered a place on our course.  You may be required to complete some of these tasks online prior to the interview day.  Further details will be provided when invited to interview.\r\n\r\nAll of our interview tasks assess your suitability to train to teach and are included in order to reassure us that you have the capacity to meet the Teachers' Standards.\r\n\r\nOur interview process is a rigorous one, designed to ensure we attract high quality candidates who understand the resilience required to complete this intensive one-year course.  \r\n\r\nCandidates will be informed within the 40 day deadline as to whether their application has been successful or not.\r\n","howSchoolPlacementsWork":"School placements are a vital part of your training year, helping you to develop your teaching practice.  At WYTA we are fortunate to have over 12 secondary and middle schools in our partnership who have a long and strong history of training teachers and who are keen to support our trainees.  \r\n\r\nWhen allocating placement schools we always try to take into account your circumstances and area of residence whilst balancing our duty to provide you with the most appropriate school to best meet your training needs.  Most of our schools are based in Kirklees and placements are usually within this area.  \r\n\r\nAs part of your time in school it is important that you are able to gain an understanding of progression in learning across all key stages so you will also spend a short amount of time in primary (Key Stage 2) and sixth form (Key Stage 5).\r\n \r\nIn order to meet the course requirements, you will need to spend a minimum of 120 days in school although in reality our trainees tend to be in school for more than this.  The exact number of days often differs for each trainee, depending on their own circumstances.  You will have at least:\r\n\r\n* 2 main block placements (approximately 22 weeks in total)\r\n","personalQualities":"We have high expectations of our trainees. We are looking for:\r\n\r\n* A strong commitment to teaching and learning\r\n* Enthusiasm and a genuine desire to inspire young people\r\n* A commitment to helping every child make the most of their talents\r\n* Excellent communication and inter-personal skills\r\n* Resilience and the willingness to receive and act on advice\r\n* Professionalism and a realistic understanding of a teacher's role \r\n* A willingness to work hard and go the 'extra mile'\r\n* The ability to manage time effectively\r\n* Evidence of self-motivation in personal learning\r\n* Patience and empathy\r\n\r\n","otherRequirements":"You will need:\r\n* To communicate effectively in standard English\r\n* The intellectual and academic potential to meet the required Teachers’ Standards\r\n* Two references   (If about to graduate/graduated within the last three years, one referee should be a university/college lecturer who can comment on your academic ability)\r\n* A satisfactory Disclosure and Barring Service enhanced disclosure check\r\n* No previous barring from teaching or working with children  \r\n* A health declaration to ensure you have the health and physical capacity to teach\r\n* We strongly advise you have school experience to ensure teaching is right for you\r\n\r\n","status":3,"createdAt":"2021-07-06T10:52:24.664Z","updatedAt":"2021-09-28T08:06:48.728Z","canSponsorStudentVisa":"no","cycle":"2024"}
