{"id":"aea5dfb8-79b2-4e5f-828e-e25094d90fa1","name":"Chemistry","code":"2CML","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"B","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"912d4fb4-761b-42e9-8dc6-e968b791ea4e","code":"F1","name":"Chemistry"}],"locations":[{"id":"de751a64-b116-4b20-9471-31854fbf05d5","name":"Main Site","isPublished":"Y","status":"R","vacancies":"B"}],"trainingProvider":{"id":"fd2ef0c0-5f82-4bc2-ad7b-b4aac5f6c2e7","code":"14B","name":"Balcarras School"},"accreditedBody":{"id":"e6c26d28-03d4-443c-9b65-5db7e183966c","code":"G48","name":"Gloucestershire Initial Teacher Education Partnership (GITEP)"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"TwoYears","feesUK":9250,"aboutCourse":"As a trainee teacher you will be taught about the best ways to teach your subject including the specific pedagogy of your subject and how to plan a lesson in order to meet your objectives so that the pupils make progress. You will also be taught the wider professional aspects of being a teacher such as; safeguarding of pupils, tutoring, behaviour management, SEND, how to make the most of your teaching assistant, how to use data to check the progress of your pupils, marking for progress and about applying for jobs.\r\nOnce the placement starts you will be in school Monday to Friday but every Thursday afternoon will be spent at the subject pathway session. This is where you will spend with your subject leader and the other trainees learning to teach the same subject. You may need to travel to another school for this session as subject leaders are all teachers within the county and the sessions may be held at their school.\r\nThe assessment for the course is via a few different aspects. There are 3 written assignment that are completed over the year. The first has to be done by the beginning of January, the second by the end of March and the third by mid-June. The first assignment focuses on SEND, the second on curriculum practice and the last one on curriculum research for your subject. You will be given plenty of advice and guidance to ensure you can complete them for the deadlines. Your teaching will also be assessed by you subject mentor and training manager as they come in to observe your lessons. You will also need to complete a teaching file, which will demonstrate the progress that you and you classes have made.\r\nThe teaching load does increase over the year in the different placements, please see the information on how placements work. In parent 1 you are expected to teach 9-11 hours per week, in the twin this increases to 11-13 hours per week and in parent 2 the teaching expected is 13-15 hours per week. Initially in parent 1 placement you might be team teaching with the class teacher or starting with smaller activities but then you would be moving on to plan and deliver the entire lesson. You will be guided through this process and given the support necessary to ensure  success at each stage of this process.","interviewProcess":"The interview process at Balcarras is:\r\n* Meet our head teacher, Mr Dominic Burke,  on arrival\r\n* You will be given a tour of the school by pupils\r\n*You are expected to teach a 15 minute lesson on a particular aspect of your subject – which you would be given at least a week before the interview – this would be observed by one of our 3 training managers and someone from the relevant department    \r\n* One interview–with a training manager, the head of the relevant department and the course leader for School Direct in order to ascertain your commitment and motivation to want to teach\r\n* There are a number of written tasks; a short literacy and numeracy test and a task to check your subject knowledge.\r\n\r\nThis is a rigorous process but we want to choose the best candidates to train at Balcarras. We want prospective teachers who are enthusiastic and passionate about their subject, committed to a career in teaching and ready to face the challenges of the training year.\r\nThere will of course be opportunity to ask questions regarding the course during the interview process.\r\n","howSchoolPlacementsWork":"The training year is split into 3 placements; parent 1 , twin and parent 2. For school direct trainees at Balcarras they will spend the parent 1 and parent 2 placement at Balcarras. The twin placement will be at a different school. The twin placement is organised and determined by GITEP, as they will oversee where all the trainees are placed in Gloucestershire. To enable the placement we do take into account where the trainee lives, whether they drive and any other commitments and constraints they have for example having childcare or elderly parents. The average distance a trainee will have to travel from home to school would be about 30 minutes.\r\nThe parent placement starts in the first week of term as the term starts for the school and finishes in mid-December. The twin placement is about 9 weeks from early January until mid-March and then parent 2 placement starts after about one week’s break and finishes before the end of June. Before and between placements there will be professional studies where the entire cohort of trainees meets together for further central training.\r\nYou would be teaching an 11-18 age range. This means in each placement you would have a range of year group and abilities of pupils. \r\n","personalQualities":"There is no profile of \"the perfect teacher\". However, our trainees do share enthusiasm for their subjects, a genuine interest in how children learn and a commitment to doing their best for every child.\r\nIt is a training year and there will be times when things don't go according to plan. We want trainees who are happy to take risks, seek feedback and reflect constantly on their practice and how it could improve.\r\n","otherRequirements":"All applicants will require an enhanced DBS (Disclosure and Barring Service) certificate before commencing training.\r\nTime in schools is not a requirement of the programme and should not hold up your application. It is, however, useful and we may be able to help organise this.","status":1,"createdAt":"2021-07-06T10:51:29.329Z","updatedAt":"2021-07-08T10:02:03.830Z","canSponsorStudentVisa":"no","cycle":"2024"}
