{"id":"02a18eac-ebc0-42e5-9754-c1c953c1f433","name":"Art and Design","code":"2JK5","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"d461a678-3335-4ca2-9616-1dc479d31a49","code":"W1","name":"Art and design"}],"locations":[{"id":"2f138002-7d98-4641-8876-ed81510f71e2","name":"The Mirfield Free Grammar & Sixth Form","isPublished":"Y","status":"R","vacancies":"F"},{"id":"6249aae7-053f-49ad-b28e-11b68c959e77","name":"Upper Batley High School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"7b8c0faa-6cf8-4e8e-a876-2519ba83aacc","name":"Horbury Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"8cb490c5-1dec-43ee-92fc-9f40229b8679","name":"Leeds Beckett University","isPublished":"Y","status":"R","vacancies":"F"},{"id":"17db3698-952f-41ca-a978-0c2a430824bf","name":"Main Site - Batley Girls High School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"4cb64208-66d6-406c-970a-3c8d36051f13","name":"Kettlethorpe High School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"8fdb4c6d-b0a5-4370-870e-b5a9845e4a72","code":"13R","name":"The Yorkshire Rose Teaching Partnership"},"accreditedBody":{"id":"154509e2-743e-4f0b-9d99-396393aa57ff","code":"L27","name":"Leeds Beckett University"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feeDetails":"The Yorkshire Rose Teaching Partnership and Leeds Beckett University postgraduate Initial Teacher Training (ITT) tuition fees are currently £9,250. Tuition fees may rise with inflation in future years. \r\n\r\nYou will not have to pay these fees upfront. Eligible UK students can apply for a tuition fee loan to cover the cost of tuition fees from the government.\r\n\r\nUK students on non-salaried places, studying full-time, can apply for a package of maintenance funding from the government to help with general living costs and additional funding if you have children and/or a disability.   \r\n\r\nUK students can apply and find out more information at (www.gov.uk/studentfinance). This website also has a calculator which gives you an estimate of what you will receive.\r\n\r\nIf you are an EU or overseas student then find out more information about the changed situation on this link \r\nhttps://getintoteaching.education.gov.uk/explore-my-options/overseas-graduates\r\n","aboutCourse":"You’ll spend a mixture of your first six weeks at Leeds Beckett University and your first placement school. You will also have weekly support from The Yorkshire Rose Teaching Partnership staff. This section of the course involves taking part in seminars and workshops that prepare you for your school-based training by focusing on two main elements: \r\n\r\nApplied Professional Studies  - subject knowledge and pedagogy \r\nIn these sessions,  Leeds Beckett University subject teacher experts will give you a good understanding of what it means to teach Art. You’ll study the school curriculum, and understand how other expert teachers have taught it successfully. You’ll also learn how to plan sequences of learning that address your pupils’ needs so that you can develop your practice and have a positive impact on their learning.\r\n \r\nApplied Professional Studies - generic teaching skills and issues\r\nYou’ll learn research-informed techniques and strategies to tackle issues that you will face in your training placements. These strategies will help develop your understanding of teaching and learning, the secondary curriculum and educational policy.\r\n\r\nAfter six weeks you will be based full time in a school until the end of the first term.\r\n\r\nDuring your second placement, you will be based in a new school from January to June, teaching more lessons and ensuring that you’re teaching classes from both Key Stage 3 and Key Stage 4, as well as the chance to observe and sometimes teach at Key Stage 5. ","interviewProcess":"You will be notified through UCAS Track if you’ve been invited to an Interview Day. The Yorkshire Rose Teaching Partnership will also contact you directly to arrange the School Direct PGCE interview. You’ll receive an email from us that explains everything you need to know about your interview. This includes the date, time and the location, as well as what to prepare beforehand and what will happen on the day, so it’s really important to read this email very carefully. You will expected to plan and remotely 'teach' a full 50 minute lesson that links into the Art and Design curriculum. You will also have the opportunity to remotely meet current Yorkshire Rose Teaching Partnership School Direct PGCE trainees. \r\n","howSchoolPlacementsWork":"The Yorkshire Rose Teaching Partnership will source your placements, taking into account your passions, preferences and personal circumstances. You will be supported by key Yorkshire Rose Teaching Partnership staff, who will work with you to ensure you’re ready to go into school.\r\n\r\nAfter you’ve completed your first six weeks of  training, you’ll start your first  placement full time . This will give you the chance to put into practice what you’ve learnt in a collaborative working environment. You’ll work closely with your school-based subject mentor.\r\n\r\nIn January, you’ll complete a second placement in a different school. This will help you deepen your knowledge of how students learn, and extend your practice in helping that learning, in a new context. This long placement - split across stages two and three, from January until June - gives you the chance to develop your practice in a school and with pupils\r\n you will get to know really well. This offers an opportunity to make a positive impact on progress in that school. You’ll become a more independent practitioner. Having extended experience in the same placement means you’ll be able to develop your practice well, and show that you’re having a positive impact on your pupils. At the end of this placement you’ll present evidence on this impact, which will inform your final grade.\r\n\r\nThroughout your placements, you’ll have the support of a school-based mentor. These mentors are trained by The Yorkshire Rose Teaching Partnership and Leeds Beckett University to support you as you complete your training and assess your progress against the Teachers’ Standards. You’ll also have a other key staff who will visit you at school. They will provide quality assurance for your training and offer any support and advice you may need.","personalQualities":"Our determination is to match the right trainee to the right school, and we consider temperamental and attitudinal aspects as even more important than qualifications. You will need to be  comfortable working in a team or independently, have a high degree of emotional intelligence, the ability to empathise and a genuine understanding of secondary education.  You will care about equality and diversity and be unafraid to use the cliché that you want to make a difference.  We are looking for committed, resilient, reflective practitioners, able to learn from their own experiences and the experiences of others.","otherRequirements":"All successful trainees will be subject to an Enhanced DBS check. ","status":1,"createdAt":"2021-07-06T10:49:24.835Z","updatedAt":"2021-09-29T07:29:02.370Z","canSponsorStudentVisa":"yes","cycle":"2024"}
