{"id":"4e509775-07f5-4412-9fe3-f5cf7140bbfb","name":"Primary","code":"25LR","qualification":"qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"TA","fundingType":"apprenticeship","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"17db3698-952f-41ca-a978-0c2a430824bf","name":"Main Site - Batley Girls High School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"8fdb4c6d-b0a5-4370-870e-b5a9845e4a72","code":"13R","name":"The Yorkshire Rose Teaching Partnership"},"accreditedBody":{"id":"e5b8e187-ccc1-4253-9dd0-376d6abf7e66","code":"2EY","name":"Exceed SCITT"},"degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"One year and 1 day (starting 1st July 2021)","feesUK":null,"aboutCourse":"The Yorkshire Rose Teaching Partnership do not offer salaried training places but instead offer this new ITT route in partnership with the Exceed SCITT. It is open to graduates who are currently employed within a primary school setting and where the school will be willing to fund the training place as well as pay your wage. This is a requirement for applying for this type of ITT route – you cannot apply without this financial arrangement in place. Please do not apply for this route unless you are currently employed in a primary school. You will gain QTS but not the full PGCE qualification unless you wish to take that an an optional module at your own cost (Masters credits). \r\n\r\nBenefits\r\nEarn while you learn\r\nGain necessary skills in primary education (5 -11)\r\nGain hands-on experience and learn skills that schools want, helping shape your future career\r\nMix of on and off-the-job training\r\nLasts for a minimum of a year\r\nNo upper age limit\r\nNo training fees as these are met by your current school","interviewProcess":"You will be notified through UCAS Track if you’ve been invited to an Interview Day.  The Yorkshire Rose Teaching Partnership in conjunction with EXCEED SCITT will also contact you directly to arrange the interview – this will be done in conjunction with your current primary school. You’ll receive an email from us that explains everything you need to know about your interview. This includes the date and time, as well as what to prepare beforehand and what will happen on the day, so it’s really important to read this email very carefully. ","howSchoolPlacementsWork":"You will be employed by a primary school to teach over the course of the year. There is a mixture of SCITT led training, school based training and teaching from day 1. This will give you the chance to put into practice what you’ve learnt in a collaborative working environment. You’ll work closely with your school-based subject mentor and the EXCEED team.\r\n\r\nIn January, you’ll complete a second seven week placement in a different school. This is arranged in partnership with your main employment school. This will help you deepen your knowledge of how primary pupils learn, and extend your practice in helping that learning, in a new context. This alternative key stage placement gives you the chance to develop your practice in a contrasting school. This offers an opportunity to make a positive impact on progress in another school. You will then return to your main school  as a more independent practitioner.  Having extended experience in the same placement means you’ll be able to develop your practice well, and show that you’re having a positive impact on your pupils. At the end of this placement you’ll present evidence on this impact, which will inform your final grade. \r\n\r\nOnce QTS has been gained in June you will continue to be employed by the primary school and have a full teaching timetable. The Level 6 Apprenticeship qualification will be gained in July 2022 - approximately a year and a day after you started the course. \r\n\r\nThroughout your placements, you’ll have the support of a school-based mentor. These mentors are trained by the Exceed SCITT to support you as you complete your training and assess your progress against the Teachers’ Standards. The Director of The Yorkshire Rose Teaching Partnership is also the EXCEED Lead Mentor for this route. You’ll also have other key staff who will visit you at school. They will provide quality assurance for your training and offer any support and advice you may need.\r\n","personalQualities":"We consider temperamental and attitudinal aspects as even more important than qualifications. You will need to be  comfortable working in a team or independently, have a high degree of emotional intelligence, the ability to empathise and a genuine understanding of primary education.  You will care about equality and diversity and be unafraid to use the cliché that you want to make a difference.  We are looking for committed, resilient, reflective practitioners, able to learn from their own experiences and the experiences of others.\r\n","otherRequirements":"All successful trainees will be subject to an Enhanced DBS check. \r\n\r\nPlease do not apply for this route unless you are currently employed in a primary school.","status":1,"createdAt":"2021-07-06T10:49:24.732Z","updatedAt":"2021-10-04T09:31:50.753Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024"}
