{"id":"e025549e-fbb1-42de-954b-622efd46fd44","name":"Religious Education","code":"28LG","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"724b5d16-28dd-4431-bc17-ea4be4daedc4","code":"V6","name":"Religious education"}],"locations":[{"id":"6249aae7-053f-49ad-b28e-11b68c959e77","name":"Upper Batley High School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"5ee7652f-f2ff-410d-b297-dedf49c4893d","name":"Leeds Trinity University","isPublished":"Y","status":"R","vacancies":"F"},{"id":"2f138002-7d98-4641-8876-ed81510f71e2","name":"The Mirfield Free Grammar & Sixth Form","isPublished":"Y","status":"R","vacancies":"F"},{"id":"7b8c0faa-6cf8-4e8e-a876-2519ba83aacc","name":"Horbury Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"6b348648-8c7d-4224-b82d-f9ebece12c20","name":"Ossett Academy and Sixth Form College","isPublished":"Y","status":"R","vacancies":"F"},{"id":"17db3698-952f-41ca-a978-0c2a430824bf","name":"Main Site - Batley Girls High School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"8fdb4c6d-b0a5-4370-870e-b5a9845e4a72","code":"13R","name":"The Yorkshire Rose Teaching Partnership"},"accreditedBody":{"id":"19a3446e-382d-4c14-83bb-a76563cef3c1","code":"L24","name":"Leeds Trinity University"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feeDetails":"The Yorkshire Rose Teaching Partnership and Leeds Trinity University postgraduate Initial Teacher Training (ITT) tuition fees are currently £9,250. Tuition fees may rise with inflation in future years. \r\n\r\nYou will not have to pay these fees upfront. Eligible UK students can apply for a tuition fee loan to cover the cost of tuition fees from the government.\r\n\r\nUK students on non-salaried places, studying full-time, can apply for a package of maintenance funding from the government to help with general living costs and additional funding if you have children and/or a disability.   \r\n\r\nUK students can apply and find out more information at (www.gov.uk/studentfinance). This website also has a calculator which gives you an estimate of what you will receive.\r\n\r\nIf you are an EU or overseas student then find out more information about the changed situation on this link \r\nhttps://getintoteaching.education.gov.uk/explore-my-options/overseas-graduates","aboutCourse":"Stage one – Introduction to teaching\r\nYou’ll spend a mixture of your first five weeks at Batley Girls' High School, Leeds Trinity University, and  several days in your placement school. This section of the course involves taking part in seminars and workshops that prepare you for your school-based training by focusing on two main elements:\r\n\r\n Professional Educational Studies (PES based at Batley Girls' High School on Wednesdays)\r\nYou’ll learn research-informed techniques and strategies to tackle issues that you will face in your training placements. These strategies will help develop your understanding of teaching and learning, the secondary curriculum and educational policy.\r\n\r\nSubject knowledge and applied pedagogy\r\nIn these sessions,  Leeds Trinity University subject teacher experts will give you a good understanding of what it means to teach Religious Education. You’ll study the school curriculum, and understand how other expert teachers have taught it successfully. You’ll also learn how to plan sequences of learning that address your pupils’ needs so that you can develop your practice and have a positive impact on their learning.\r\n\r\nAfter you’ve completed your first five weeks, you’ll start your first placement which will last until the end of term. \r\n\r\nStage Two / Three  – Developing your knowledge \r\nYour University-based training will comprise of the same elements as Stage One, but you’ll focus on building on the knowledge you’ve already developed to prepare for your next school-based training block. You’ll spend one week at university.\r\n\r\nBefore your second placement starts in January, you’ll  spend time in school  to observe and familiarise yourself with the routine and teaching practice. During your second placement from January until June, you’ll  teach more lessons, ensuring that you’re teaching classes from both Key Stage 3 and Key Stage 4. If possible you may have the opportunity to teach some Key Stage 5 lessons as well. ","interviewProcess":"You will be notified through UCAS Track if you’ve been invited to an Interview Day. The Yorkshire Rose Teaching Partnership will also contact you directly to arrange the School Direct PGCE interview. You’ll receive an email from us that explains everything you need to know about your interview. This includes the date, time and the location, as well as what to prepare beforehand and what will happen on the day, so it’s really important to read this email very carefully. You will expected to plan and 'teach' a full 50 minute lesson that links into the Religious Education  curriculum. You will also have the opportunity to remotely meet current Yorkshire Rose Teaching Partnership School Direct PGCE trainees. \r\n","howSchoolPlacementsWork":"The Yorkshire Rose Teaching Partnership will source your placements, taking into account your passions, preferences and personal circumstances. You will be supported by key Yorkshire Rose Teaching Partnership staff, who will work with you to ensure you’re ready to go into school.\r\n\r\nAfter you’ve completed your first five weeks of  training, you’ll start your first eight-week placement. This will give you the chance to put into practice what you’ve learnt in a collaborative working environment. You’ll work closely with your school-based subject mentor.\r\n\r\nIn January, you’ll complete a second placement in a different school. This will help you deepen your knowledge of how students learn, and extend your practice in helping that learning, in a new context. This long placement - split across stages two and three, from January until June - gives you the chance to develop your practice in a school and with pupils you will get to know really well. This offers an opportunity to make a positive impact on progress in that school.\r\n\r\nDuring your second placement, you’ll spend at least ten weeks in a new school teaching more lessons, ensuring that you’re teaching classes from Key Stages 3 and 4. You’ll become a more independent practitioner.\r\n\r\nYou’ll stay in the same school for a further ten weeks, teaching more classes from Key Stages 3 and 4, and have the chance to observe and teach at Key Stage 5. Having extended experience in the same placement means you’ll be able to develop your practice well, and show that you’re having a positive impact on your pupils. At the end of this placement you’ll present evidence on this impact, which will inform your final grade.\r\n\r\nThroughout your placements, you’ll have the support of a school-based mentor. These mentors are trained by The Yorkshire Rose Teaching Partnership and Leeds Trinity University to support you as you complete your training and assess your progress against the Teachers’ standards. You’ll also have other key staff who will visit you at school. They will provide quality assurance for your training and offer any support and advice you may need.\r\n","personalQualities":"Our determination is to match the right trainee to the right school, and we consider temperamental and attitudinal aspects as even more important than qualifications. You will need to be  comfortable working in a team or independently, have a high degree of emotional intelligence, the ability to empathise and a genuine understanding of secondary education.  You will care about equality and diversity and be unafraid to use the cliché that you want to make a difference.  We are looking for committed, resilient, reflective practitioners, able to learn from their own experiences and the experiences of others.","otherRequirements":"All successful trainees will be subject to an Enhanced DBS check. ","status":1,"createdAt":"2021-07-06T10:49:24.797Z","updatedAt":"2021-09-29T07:38:35.133Z","canSponsorStudentVisa":"yes","cycle":"2024"}
