{"id":"1f19ef19-45c4-4453-bb0c-8c492d0d469e","name":"Primary","code":"G578","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"71d76013-739b-4a4e-9dd5-aceb1b0f2852","name":"Chipstead Valley Primary School","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"106d33a1-8d87-440f-b156-69dc935d693a","code":"1O1","name":"PACE Academy Trust"},"accreditedBody":{"id":"33037eab-f75d-4350-b1e2-967c41e9d4c6","code":"R48","name":"Roehampton University"},"profPost":"PG","english":"2","maths":"2","science":"2","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","aboutCourse":"Schools Direct training will be delivered by Specialist Leaders of Education and Senior Leaders from our alliance schools and this will be enhanced by training and support sessions provided by Roehampton University on a selection of days throughout the year. Please note: you will be in your allocated base school from September to July, coming out for one placement in another school during the Autumn term. You will not be based at the university, but instead viewed as a member of the school community.\r\n\r\nOur mentors are outstanding teachers and are also required to undertake training to develop their mentoring skills. This includes coaching, effective classroom observation and feedback skills. The level of guidance and advice that trainees receive is of an exceptionally high standard and we pride ourselves in the successful relationships we foster with each student.\r\n\r\nIn addition to this, you will be part of a strong team of students who will meet regularly to train, share experiences and build on good teaching practice adding a support network accessible throughout the year.\r\n\r\nDuring the course of your training, you will gain experience working within different settings and with children of differing abilities. This will ensure that you receive a broad understanding of the range of teaching required to suit the differing needs, ability and socio-economic backgrounds of the pupils.","interviewProcess":"We are fully aware that the majority of our applicants may never have stepped foot in front of a class, so we aim to make the interview process as relaxing for everyone involved as possible.\r\nThe interview process involves approximately 3 head teachers from our alliance schools, alongside the alliance Teaching School Director.\r\nWe also offer a tour of our lead school, as although you may not necessarily be based there if successful, we work very closely as an alliance of schools and offer many similarities in our delivery of the curriculum, sharing similar values within our school communities.\r\n","howSchoolPlacementsWork":"As stated, you will be given a base school once accepted onto the programme. This is usually confirmed with you in the June prior to you starting in the September. You will be a member of the school team for the full school academic year - September to July. Within this time, you will have 1 additional placement in another of our alliance schools in the Autumn term. You will also have to opportunity to visit other schools and provisions for days within the year.","personalQualities":"We are looking for trainees who have a genuine interest in young people and how they learn best and who demonstrate passion for wanting to help them achieve.\r\nCandidates should be enthusiastic about their subject, have effective communication skills and an ability to understand, speak and write clearly in standard English. You should be creative, open to new ideas, be able to share best practice and to able to review personal progress. Above all we are looking for ambitious and motivated trainee teachers who have a real desire to work with young people of all abilities. ","otherRequirements":"Applicants should be able to provide evidence of skills and attributes they have developed from another job or profession, over approximately a 2 year or more period of time.\r\nApplicants who can demonstrate some recent and meaningful experience working with young people, will have a much better idea about what makes an effective teacher and a less effective one. This doesn't need to be paid work but any kind of helping activity, classroom observation or learning support.\r\nYou will also need a DBS check, carried out by your base school at the start of the programme.","status":2,"createdAt":"2021-07-06T10:48:28.730Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"Salary will be calculated using the Unqualified Teachers Pay Scale (Outer London Weighting). It will be UQ2 on the scale.\r\n\r\n"}
