{"id":"50bacbf4-f70e-456a-b822-763377922291","name":"History","code":"2HJJ","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"5a3609a0-5bbb-4377-b919-5d89932ab622","code":"V1","name":"History"}],"locations":[{"id":"dd863c5c-6fbf-4cf6-9c13-294708140caa","name":"Main Site - Whitburn Church of England Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"19058343-b0fc-48bc-b421-af5e44efad07","name":"Newcastle High School for Girls","isPublished":"Y","status":"R","vacancies":"F"},{"id":"16d562ac-13b7-499a-bef0-bd6f1225e579","name":"Venerable Bede Church of England Academy","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"39f84488-b175-4d2d-b886-bbef6c190ac1","code":"23F","name":"Whitburn Church of England Academy"},"accreditedBody":{"id":"99d7311e-6bc7-4ef3-a36b-72a3ff429155","code":"D87","name":"Durham SCITT"},"profPost":"PG","degreeGrade":"9","english":"2","maths":"2","acceptPendingGcse":"no","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"If required, candidates must complete at their own expense.","courseLength":"OneYear","feesUK":9250,"feeDetails":"The fees for our school direct programme are £9,250\r\nThere are a range of subject specific bursaries and funding, which may be available to help cover training fees and living costs.\r\n(https://getintoteaching.education.gov.uk/funding-and-salary)\r\n","aboutCourse":"The course is full time and runs from September until the beginning of July. Your Professional Tutor and Subject Mentor in your first placement school will provide a week-by-week guide, which will be followed throughout the year.\r\n\r\nYou will have the opportunity to train with one of the best performing departments at Whitburn. Candidates with wider Humanities backgrounds will also get the opportunity to teach in other subject areas and at A Level as this will increase your employability. \r\n\r\nThe course is made up of General Professional Study sessions, the Subject Specialism Programme and PGCE modules. It will also involve two teaching placements; the first runs from the beginning of September until the final week of December. The second placement runs from the middle of January until Easter. Following that, trainees return to their first placement school for the final term. There will also be enhancement programme which has been put together to provide trainees a range of experiences. By completing the visits, the trainees will gain a better understanding of a range of educational settings.\r\n\r\nAll trainees must demonstrate that they can fully meet each of the Standards for Qualified Teacher Status by the end of the course. Trainees will be continually assessed through lesson observations and placement reports whilst on teaching placements, and through a series of three short assignments. Detailed portfolios of evidence are submitted three times during the year to demonstrate how trainees are meeting the Standards for Qualified Teacher Status. Following the first two submissions, trainees receive feedback on their progress. \r\n\r\nThe PGCE is accredited by University of Sunderland and is assessed through two written assignments. The two PGCE training modules will be held at The Work Place in Newton Aycliffe. \r\n\r\nIf a trainee does not meet the Standards for Qualified Teacher Status, but has passed the two PGCE modules, the credits can still be used towards a MA programme. \r\n\r\n","interviewProcess":"The first thing we look at is your application form and your references to decide whether we should invite you for interview. It is, therefore, important to include all the relevant information on the form to help us make this decision.\r\nIf you are invited to interview and have a disability, please let us know in advance if there are any special arrangements that should be made for the interview process, for example large print copies of documentation, additional time for reading or wheelchair access to the interview rooms.\r\nOn your interview, you will have a series of tasks that replicate the typical activities of a trainee and assess your suitability to train. One of these tasks is to deliver a mini lesson to Key Stage 3 students. You will be sent information about a 25-minute min and will need to plan and deliver the lesson whilst being observed by experienced teachers. You will also have a creative task and be interviewed by a staff and pupil panel. These will assess your motivations for wanting to teach in your chosen subject area and your suitability to work with young people. There will also be an opportunity for you to ask questions about the course. All those called for interview will be provided with detailed feedback.   \r\nYou will be sent information about a subject specific teaching task together with information about the subject and year group. \r\n","howSchoolPlacementsWork":"Placement schools are selected not only based in relation to a trainee's home location, but also on our judgments of how a trainee would fit into their subject department within each school. Whilst we try to keep, travelling to a minimum this is dependent on the location of a trainee’s home address and small travel bursaries are available for those trainees not in receipt of a DfE training bursary. \r\n\r\n\r\nWe ensure that all trainees have the opportunity to experience teaching up to and including A level / post 16 courses. Our placement schools all share the same vision and expectations for their students and whilst trainees will experience the differences between settings, our quality assurance processes ensure that trainees get the same high quality support in each placement.\r\n\r\n\r\nPlacement A runs from September to January and Again from March to July. Placement B runs from mid-January to March.\r\n\r\nWhitburn Church of England Academy  – South Tyneside\r\n(https://www.whitburncofeacademy.org/)\r\n\r\nNewcastle High School For Girls – Newcastle\r\n(https://newcastlehigh.gdst.net/)\r\n\r\nSt Hild’s Church of England Secondary School  – Hartlepool\r\n(http://www.sthilds.org.uk/)\r\n\r\nVenerable Bede  Church of England Academy – Sunderland\r\n(http://www.whitburncofeacademy.org/)\r\n\r\n\r\n","personalQualities":"You will be required to submit a written personal statement, explaining why you would like to be a teacher and what you would bring to the profession. PBTSA are happy to offer help and support with writing personal statements. Contact colleen.miller@pbtsa.co.uk. If you would access this service.\r\nSkills & qualities:\r\n* Organised\r\n* Resilient\r\n*Willing to reflect and learn\r\n*Committed to improving the life chances for young people\r\n","otherRequirements":"The Disclosure and Barring Service (DBS) provides employers and other authorised organisations with details of an individual's convictions, cautions, police reprimands and warnings held on the Police National Computer.  \r\nSuitable overseas conviction assessment (if applicable)\r\nVerification of identity, qualifications, medical fitness\r\nBefore being accepted onto the course, trainee teachers must satisfy the DfE requirements with regards to fitness to teach. You will be asked to complete a confidential self-certified Health questionnaire, and if appropriate, an Occupational Health Advisor may request to see you for a more formal medical examination. \r\nEvidence of a satisfactory attendance record in previous employment or training\r\n","status":1,"createdAt":"2021-07-06T10:55:39.249Z","updatedAt":"2021-09-04T15:10:04.808Z","canSponsorStudentVisa":"no","cycle":"2024"}
