{"id":"baff06bf-2e7a-4041-b4e0-822119fb8dc5","name":"Design and Technology","code":"H522","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"118fabd7-86d0-4a40-9e9a-e5c302abe59b","code":"DT","name":"Design and technology"}],"locations":[{"id":"98b6a9d6-b824-46e8-a571-df01b7c91506","name":"Altrincham Grammar School for Girls (Secondary)","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"cb360fcd-0c3a-4fc2-a4df-521e9475cd1c","code":"G65","name":"Bright Futures SCITT"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"9","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":9250,"aboutCourse":"This course is designed to enable you to become a successful teacher of design and technology. \r\n\r\nOver 150 days of the course will be spent in schools working alongside highly professional and well qualified colleagues. Specific subject knowledge training will enable you to build up a strong knowledge of the design and technology curriculum for Key stage 3 and 4. \r\n\r\nTimetables are designed to be progressive increasing in complexity over the training year. However, trainees are supported at all times to ensure a balance between challenge and support is met.\r\n\r\nAll trainees gain experience of both key stage 2 (upper primary) and Key stage 5 (post 16).\r\n\r\nProgress is monitored by subject mentors and SCITT moderation will take place throughout the year. Trainees reflect on progress on a weekly basis, culminating in termly written reports produced jointly with mentors. \r\n\r\nThroughout the course, trainees engage with professional development  training, this training takes an evidence-informed approach to teaching and learning.  Whilst the majority of training takes place at Altrincham Grammar School for Girls, some training will take place in partner schools across Greater Manchester and Lancashire.\r\n\r\nApplicants enrolled on the PGCE programme are expected to complete four written assignments leading to 60 M level credits. \r\n\r\n“The high quality face-to-face training, assignments and placements combine to give trainees a firm basis on which to develop their skills and knowledge” Ofsted 2017\r\n\r\n“Employers of trainees comment very favourably on the significant improvements in trainees’ expertise and knowledge, brought about by their training” Ofsted 2017\r\n","interviewProcess":"Following an application that meets our criteria, the SCITT will arrange  an interview. Interviews  could be in person within a partner setting, or via an on-line platform. \r\n\r\nThe interview:  you will asked to prepare and or complete: \r\n\r\n* A short lesson planning activity, which you will talk through/ teach lasting  around 15 minutes\r\n* An formal interview with staff from the SCITT\r\n* A written communication task\r\n\r\nYou might also be asked to complete a subject knowledge audit. \r\n","howSchoolPlacementsWork":"This course leads to qualified teacher status- QTS (11-16 years). \r\n\r\nAll secondary placements are arranged through an A-B-A model. This means that the trainee will be placed at their 'home' school for the winter term. An alternative placement runs from January to  Easter. Following Easter, the trainee will return to their 'home' school until the end of the programme. \r\n\r\nPlacement schools are chosen considering a number of factors, including trainee prior experience, training needs and location.  \r\n\r\nSCITT professional  development training is timetabled and often held on a Friday.  \r\n\r\n\r\n","personalQualities":"* A passion for the subject you wish to teach\r\n* The potential to train to teach\r\n* Excellent subject knowledge\r\n* Resilience\r\n* Enthusiasm\r\n\r\nApplicants must produce a well written and clear personal statement that sets out how they meet the course requirements. The personal statement is part of the application process.\r\n","otherRequirements":"All applicants must undergo a suitability to teach check: this includes a disclosure and barring service check and a fitness to teach check.\r\n\r\nSome applicants may be required to complete a subject knowledge enhancement course.\r\n\r\n[Full admissions policy]( http://allianceforlearning.co.uk/scitt/policies/)\r\n","status":1,"createdAt":"2021-07-06T10:48:14.268Z","updatedAt":"2021-09-16T13:55:01.119Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
