{"id":"c29c7448-8f5d-42fa-b85c-299547c098db","name":"Psychology","code":"N592","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"14_to_19","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"1878e739-30bb-4de9-841e-42dacfb1fa0c","code":"C8","name":"Psychology"}],"locations":[{"id":"98b6a9d6-b824-46e8-a571-df01b7c91506","name":"Altrincham Grammar School for Girls (Secondary)","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"cb360fcd-0c3a-4fc2-a4df-521e9475cd1c","code":"G65","name":"Bright Futures SCITT"},"english":"3","maths":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":6250,"aboutCourse":"This course is designed to enable you to become a successful teacher of psychology. The SCITT offers trainees the opportunity to work with outstanding teachers and experienced practitioners from day one of the course. \r\n\r\nOver 150 days of the course will be spent in schools working alongside highly professional and well qualified colleagues. Specific subject knowledge training and audits will enable you to build up a strong knowledge of the psychology curriculum for Key stage 5,  please note  you will also be required to teach a second subject at Key Stage  4. \r\n\r\nTrainee timetables are designed to increase in size and complexity over the training year, but trainees are supported at all times to ensure a balance between challenge and support is met.\r\n\r\nThis course is ideal for someone with experience of teaching psychology,  the majority of training will take place in their home school with day release to a school to cover the key stage 4 element of the programme. \r\n\r\nTrainees are assessed through their mentor and by SCITT.\r\n\r\nTrainees reflect on a weekly basis, culminating in termly written reports produced jointly with mentors. This process is summarised through a moderation interview at the end of the course. \r\n\r\nThroughout the course trainees receive face to face training in pedagogy and subject knowledge. This training is delivered by current practitioners and takes an evidence-informed approach to teaching and learning, enabling trainees to adapt their own learning for the context of their placement schools. \r\n\r\nWhilst the majority of training takes place at Altrincham Grammar School for Girls, some training will take place in partner schools across Greater Manchester and Lancashire.\r\n\r\n","interviewProcess":"Following an application that meets our criteria, the SCITT will arrange an interview, this will  included the following elements:\r\n* A short pupil-based activity where we ask you to prepare and talk through \r\n a mini teach for around 15 minutes\r\n* An interview with staff from the SCITT \r\n* A written communication task\r\n\r\nPlease note due to COVID this interview will be held via an on-line platform. \r\n","howSchoolPlacementsWork":"This course leads to qualified teacher status (14-19 years). This psychology candidate will be place at their home school and undertake a day release pattern to cover the Key Stage 4 element of the programme. \r\n\r\nFace to face training takes place on Fridays. Whilst the majority of training takes place at Altrincham Grammar School for Girls, some training will take place in partner schools across Greater Manchester and Lancashire.\r\n","personalQualities":"\r\n* A passion for the subject you wish to teach\r\n* The potential to train to teach\r\n* Excellent subject knowledge\r\n* Resilience\r\n* Enthusiasm\r\n\r\nApplicants must produce a well written and clear personal statement that sets out how they meet the course requirements. The personal statement is part of the application process.\r\n","otherRequirements":"All applicants must undergo a suitability to teach check: this includes a disclosure and barring service check and a fitness to teach check.\r\n\r\nSome applicants may be required to complete a subject knowledge enhancement course.\r\n","status":2,"createdAt":"2021-07-06T10:48:14.318Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
