{"id":"10ef05b9-9ee9-44ba-a28c-6a6202ed544e","name":"Modern Languages (Spanish)","code":"2BZW","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"ce8523ef-9236-4cd9-b260-d826c7a521b3","code":"ML","name":"Modern Languages"},{"id":"e34fd2a3-a32e-44e9-aea1-666badf3ac03","code":"22","name":"Spanish"}],"locations":[{"id":"17d3a249-b458-4a1d-8ba9-3f50b29bc1b5","name":"Dixons Teaching Institute","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"821a4820-4847-4f70-9872-2e630476bb30","code":"1EP","name":"Dixons Academies Trust"},"accreditedBody":{"id":"19a3446e-382d-4c14-83bb-a76563cef3c1","code":"L24","name":"Leeds Trinity University"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We only accept GCSEs, overseas qualifications that are considered equivalent by UK ENIC (Overseas qualifications checking agency) and tests done through equiv.com, Birmingham City University and A Star Equivalency | GCSE Equivalency Tests & Courses. No other tests will be accepted.","courseLength":"OneYear","feesUK":9250,"feesInternational":12500,"aboutCourse":"(Ages 14 - 16)\r\nYou will experience an innovative and high quality programme based on current educational research and you will be supported in understanding how to cope with challenges so you thrive as an early career teacher. We will also support you with developing your subject knowledge through a bespoke programme and Dixons Teaching Institute Subject Seminars. You will experience coaching that helps you to make faster progress and experience impactful and evidence informed daily training whilst on placement.  From the start of the course, you will work with students and be fully immersed in the life of a school.\r\n\r\nThroughout the year, you will be assessed against the Teachers’ Standards through lesson planning, lesson observations, assignments and reflections on students’ learning. At the end of the year, you will achieve a PGCE (Post Graduate Certificate of Education) and QTS (Qualified Teacher Status). You will also be able to work towards getting a  Master’s degree. \r\n\r\nWe pride ourselves on the tremendous support we offer our trainees. You will be supported by our talented Dixons teachers and leaders- your mentor, host teachers, ITT Lead and the Dixons Teaching Institute team. We also offer fantastic employment opportunities and the majority of our trainees last year secured jobs within our Trust. Several of our Dixons Teacher Training alumni are now successful middle leaders. Finally, by training with us, you will begin a journey of continuous professional development and be supported at every step of your career. \r\n\r\n\r\n\r\n\r\n\r\n \r\n\r\n\r\n","interviewProcess":"If shortlisted, you will be asked to: \r\n\r\n* Plan and talk through a 20 minute lesson \r\n* Undertake a subject knowledge test (the assessments are designed to initially assess your subject knowledge and your written communication) \r\n* Deliver a short presentation on a given topic as part of your formal interview\r\n\r\nDuring the interview, the panel will consider your:\r\n\r\n* Commitment to making a difference in areas where it matters the most\r\n* Passion for teaching and love of your subject \r\n* Ability to communicate effectively\r\n* Capacity to establish effective relationships inside and outside the classroom\r\n* Suitability to train to teach and to meet the Teachers’ Standards by the end of training\r\n* Ability to reflect on feedback and act on it to improve\r\n* Resilience and determination \r\n\r\n","howSchoolPlacementsWork":"Trainees will teach in two different and contrasting Dixons academies during the School Direct programme. Placements will be selected to meet the personal needs of individual trainees. Trainees will also have the opportunity to experience the other Dixons academies to enable them to fully immerse themselves in our unique Dixons culture.\r\n\r\nIf there is any impact on school placements as a result of Covid 19, we will inform you before the course starts.\r\n","personalQualities":"We are looking for people who are committed to transforming the lives of children.  You must have a strong belief in the potential of every child, regardless of background, and have a passion for teaching and your subject.  You must also be willing to learn, receptive to feedback, resilient and have good interpersonal skills.  \r\n\r\nIn return, we offer a highly professional environment and you will be trained by experienced and highly effective teachers and leaders.  You will receive high quality training in great schools so you are supported to become the best teacher you can be.","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:51:42.157Z","updatedAt":"2021-09-30T11:19:53.499Z","canSponsorStudentVisa":"yes","cycle":"2024"}
