{"id":"1bd3df4d-5fdc-42e1-93d3-3d17db482b26","name":"Primary","code":"G922","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"17d3a249-b458-4a1d-8ba9-3f50b29bc1b5","name":"Dixons Teaching Institute","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"821a4820-4847-4f70-9872-2e630476bb30","code":"1EP","name":"Dixons Academies Trust"},"accreditedBody":{"id":"58e814cb-bf42-4d3d-9486-b3ea827fd9e2","code":"259","name":"Bradford Birth to 19 SCITT"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"If you are offered a place on our course, we will arrange any required tests on your behalf with our preferred provider. The equivalency test includes a support package to help prepare for passing the final assessment. There is a fee of approximately £150 per equivalency.","courseLength":"OneYear","feesUK":9250,"feesInternational":12500,"aboutCourse":"Age phase 5-11: this course will provide you with Qualified Teacher Status (QTS) and the option to study for a PGCE.  Working closely with Bradford specialist staff in placement schools, you will gain the knowledge, skills and understanding needed to be a newly qualified teacher.\r\n\r\nThe course is designed to help you fulfil a wider teaching role (including that of pastoral care) within your chosen educational context.  Throughout the course, we place particular emphasis on providing equal opportunities for all students working in a diverse, multi-ethnic community.\r\n\r\nA strength of the course is the way in which theory and practice are related as a result of extensive time spent working with children in at least two placements in Dixons primary schools.  At least 120 days are school-based with support provided by experienced school mentors and expert host teachers.\r\n\r\nThe course builds upon the subject knowledge and independent study skills which, as a graduate, you will have already acquired.  Our school-based sessions are also concerned with the professional skills which all teachers need.  Course tutors work closely with ITT leads, mentors and teachers in our schools to provide you with advice and support for the progressive development of your teaching expertise.\r\n\r\nA large proportion of your teaching and training will be in our academies, delivered by highly effective and successful teachers and leaders.  School-based sessions consist of lectures, seminars, deliberate practice and observations of teaching in school.  This is very much a practical course where you learn by doing.\r\n\r\nAssessment is carried out across both placements against the Teaching Standards.  Based largely in your home school, you will have one other main assessed school placement.  You will also have the opportunity to get experience of a secondary school, alternative provision or special school.  \r\n","interviewProcess":"All our trainees who are shortlisted for interview will be invited into one of our schools.  If you are asked for interview, we will provide more details about the tasks you will be asked to complete.\r\n\r\nAll our interviews have the same elements:\r\n\r\n* A classroom based exercise where you will be observed interacting with pupils.\r\n* Written tasks which are designed to assess your written communication skills and your capacity to access higher level study.\r\n* Face to face interview with a panel of School Leaders.\r\n\r\nIf you are successful at interview stage, you will be made an offer of a training place subject to satisfactory enhanced DBS clearance.  For more information, see the guidance online at:\r\n\r\nhttps:///www.gov.uk/disclosure-barring-service-check\r\n","howSchoolPlacementsWork":"We carefully consider school placements for all of our trainees.  We match strengths as well as support needs for pupils.  All trainees will be placed in two contrasting primary schools to ensure they experience the cultural diversity the city offers.\r\n\r\nYour training week initially involves some days a week in school and some days working on understanding pedagogy.  Both will help you to learn the skills to make you a highly effective teacher.  During your training year, you will visit a range of schools in both nursery, primary and secondary sectors.  We operate an A B A model for our students, where trainees start in their host school in either Key Stage 1, Key Stage 2 or the Foundation Stage, then complete a 6 week contrasting placement in the opposite Key Stage or phase, returning to their host school to complete the training year. \r\n\r\nIf there is any impact on school placements as a result of Covid 19, we will inform you before the course starts.\r\n\r\n\r\nYou will work alongside highly experienced and effective teachers and mentors, who will provide expert advice and support.  You will be introduced to your new role in stages.  You will begin with observation and work with individual pupils and then with small groups.  This will eventually lead to you teaching a full class.","personalQualities":"We are looking for excellent graduates who have enthusiasm, commitment and can offer inspiration to the young people in Bradford.  Applicants should be able to work well as part of a team of highly professional staff in a successful environment.  We want trainees to have a rapport with children, a passion for teaching their subject, and to have the ambition to become excellent teachers.  Trainees need to be resilient, receptive to feedback, and be ready to work hard in a challenging but wonderfully rewarding profession.","otherRequirements":"If you are successful at interview stage,  you will be made an offer of a training place subject to satisfactory enhanced DBS clearance.","status":1,"createdAt":"2021-07-06T10:51:42.496Z","updatedAt":"2021-09-30T11:01:34.274Z","canSponsorStudentVisa":"no","cycle":"2024"}
