{"id":"49729bde-0c5c-43f8-b5a6-82c69c392566","name":"Design and Technology","code":"2QY5","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"118fabd7-86d0-4a40-9e9a-e5c302abe59b","code":"DT","name":"Design and technology"}],"locations":[{"id":"c8b03a1a-e12a-46e9-b8fb-6572600458f7","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"13c3b4cb-af2a-4b12-bcd6-d6d862a863a1","code":"B28","name":"BEC Teacher Training"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Applicants without the relevant GCSEs or recognised equivalent will need to take an equivalency test before applying. We accept tests from (www.equivalencytesting.co.uk)  and (www.astarequivalency.co.uk)","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Our inspiring training programme consists of several different complementary strands. \r\n\r\nYou'll learn about educational theory in your weekly seminars held at our training base in Wickford, Essex and neighbouring schools. In these sessions you'll engage with the latest research about how students learn , how to help them overcome disadvantage, and how to motivate and engage them. You'll also cover practical aspects of teaching such as using ICT, managing your workload and voice care. You'll learn too about your legal responsibilities in relation to safeguarding young people.\r\n\r\nYou'll also have a weekly seminar led by one of our specialist Design and Technology mentors. Working with these expert teachers you'll find out what students are expected to learn in Design and Technology, how to use different methodologies and technologies to inspire students, how to organise effective demonstrations and practical work and how to ensure safety in the DT classroom.\r\n\r\nYou'll spend 80% of your time working in school, gaining hands-on experience and putting your knowledge of theory into practice with the support of a specialist mentor. You'll start by watching expert teachers and gradually build up your skills and confidence. Once you start teaching, your lessons will be observed and you'll have opportunities to discuss how the lesson went. Your weekly meeting with your mentor will be an opportunity to highlight your achievements and plan your next steps. You'll find you soon feel part of the team in school.\r\n\r\nYou'll also read widely, submit written tasks on set topics and prepare oral presentations on aspects of education that interest you. We make sure that these assignments are evenly spread throughout the course and our weekly newsletter reminds you of deadlines.  We operate an ‘open door’ policy so you can discuss any issues or worries.\r\n\r\nYou also have the opportunity to study for a Post Graduate Certificate in Education (PGCE) supported by lectures at our Wickford base. You submit two 5000 word assignments, one on Special Educational Needs and one on your own research. Validated by University of Suffolk the PGCE is worth 60 Master's credits.\r\n\r\nDuring the course we'll use observations of your teaching, your assignments and reflections to continuously assess your progress. There is a formal review at the end of each term, with the final assessment and recommendation for Qualified Teacher Status taking place in the third term.\r\n\r\n\r\n","interviewProcess":"Once you have submitted your application, we'll arrange an interview for you in one of our partner schools, or online if necessary. You will be interviewed by a member of the BEC Teacher Training team and a member of school staff.  \r\n\r\nOn the interview day, you will be asked to:\r\n\r\n◆deliver a 10 minute lesson on an aspect of Design and Technology which is either misunderstood by pupils or difficult to teach;\r\n◆complete a written task in response to a question we give you on the day\r\n◆undertake a formal interview lasting around 30 minutes \r\n\r\nIf you are successful, we'll contact you by the end of the next working day to let you know. Then we'll send you a formal offer letter which may give some conditions you'll have to meet before taking up your place, such as passing your degree or completing an online Subject Knowledge Enhancement course to make sure your academic knowledge is fully appropriate. Before joining the course you will also need to pass:\r\n\r\n◆a Health and Physical Capacity to Teach assessment\r\n◆an enhanced DBS check to confirm your suitability to work with children\r\n\r\nWe'll also organise a meeting with a Course Director to follow up on your interview and discuss  your individual development plan.  We'll send you some pre-reading to do, and we'll book you in for our pre-course orientation in July when you can meet your tutors and other trainees.\r\n","howSchoolPlacementsWork":"You’ll spend the majority of your time on the course gaining practical hands on experience in school, fully involved in day to day school life and supported by a mentor who is an experienced teacher. We work closely with a wide range of excellent schools, including faith schools, grammar schools and comprehensive schools, but all sharing a passionate commitment to training the next generation of teachers and with an exceptional, experienced and caring team ready to work with us and support you. \r\n \r\nWe aim to place you in a school that is a reasonable traveling distance from your home and to find you a mentor with whom you can build a strong professional relationship.  We know our school mentors very well, often they have trained with us, and we try to match you with a mentor who will bring out the best in you. As you become more confident, we’ll arrange a second school placement for you. This placement, which is six weeks long, enables you to experience a different type of school. We’ll also arrange visits to other types of educational environment such as special schools and alternative education settings.\r\n\r\nIn school, you’ll be working primarily with students aged 11-16. You’ll start by observing your mentor and other teachers in the classroom and discussing the techniques that they use. When you and your mentor think you’re ready, you’ll plan to deliver parts of the lesson following your mentor’s advice and guidance and then  gradually build up to confidently delivering all the lessons for your classes. At the same time, you’ll be involved in the wider life of the school; you’ll be attached to a form group for experience of pastoral care and you’ll be encouraged to participate in some extra-curricular activities. You'll meet formally with your mentor once a week to review your progress and plan your next steps. \r\n\r\nAlthough you cannot choose what schools you will train in, if you have a preference, let us know and we will be pleased to discuss it with the Headteacher.\r\n\r\n","personalQualities":"Teaching is a fascinating and complex job. You'll need to be versatile and have a broad skill set. We are looking for trainees with a wide range of personal qualities including, but not limited to:\r\n\r\n◆a genuine enthusiasm for teaching\r\n◆strong subject knowledge \r\n◆effective communication skills\r\n◆an ability to develop positive working relationships with children \r\n◆positivity and resilience\r\n◆imagination and creativity\r\n◆good organisation skills\r\n◆energy, focus and determination\r\n◆team-working skills\r\n◆a reflective approach and willingness to act on advice\r\n◆adaptability and initiative\r\n◆openness and willingness to learn\r\n\r\n","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:56:54.786Z","updatedAt":"2021-10-01T10:52:18.901Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
