{"id":"13f58969-dcd5-48b4-a7c3-55f4e0fe51fe","name":"Primary","code":"3C9H","qualification":"pgce_with_qts","startDate":"2023-07-31T23:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"8476a0b4-69b6-4102-ab38-6fcdc748f496","name":"Ashlawn School","isPublished":"N","status":"N","vacancies":"F"},{"id":"ba5c3860-5ef8-447c-8adf-5d30acd2cd4c","name":"Hillmorton Primary School","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"63c6808b-9b6b-4508-a2b9-cf9a1ce6cb05","code":"1XO","name":"Transforming Lives Educational Trust Initial Teacher Training (TLET ITT)"},"accreditedBody":{"id":"ef09ce50-ccfc-4346-a0ce-43e840153dab","code":"W20","name":"The University of Warwick"},"profPost":"BO","english":"2","maths":"2","science":"2","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","aboutCourse":"This salaried route means you are employed by your host school and will earn a salary while you train. The host school will pay your QTS fees, but you are responsible for the cost of the PGCE.\r\nTo apply for the salaried route it is recommended you have at least 3 years full time work experience.\r\n\r\nAs a salaried member of staff you will have you own lessons and may be asked to take on additional duties and tutor groups. After Christmas you will move to a second placement for 6 weeks as a contrasting experience, then after half term return to your host school for the remainder of the year.\r\n\r\nYou will:\r\n•\thave a school-based key stage mentor, a professional mentor and a university teaching fellow for support\r\n•\tsupport from colleagues to help formulate your individual style of teaching\r\n•\tbe provided with a teaching timetable within ITT requirements\r\n•\tplan and evaluate taught lessons with the support of your mentor\r\n•\tbe formally observed and discuss in a follow-up meeting (once per week)\r\n•\tcreate a portfolio of evidence during the year to evidence you have met the teaching standards for QTS\r\n•\tattend university day once a week and several alliance days across the year\r\n•\tbe required to submit assignments, spread across the year, which will be assessed at Masters Level for your PGCE\r\n\r\nPlease see the Warwick University website for the most up to date course information as the Core and School Direct routes are virtually identical.\r\n(https://warwick.ac.uk/fac/soc/cte/start-teaching/primary/) or please feel free to call Mrs. Dixon on 01788 573425 between 9am and 3pm Mon - Fri to discuss your routes, options, and what's involved.\r\n\r\n","interviewProcess":"Interviews will be conducted by the Head of Teaching School in the partner primary school where you wish to be hosted for your main placement. \r\nYou will complete a written assessment (1 hour) then you will participate in a lesson, we will ask you to prepare a 10min maths or English activity (details and key stage given prior to interview), followed by an interview with the Head of Teaching School and a senior member of staff from the host school.\r\n\r\n\r\n\r\n","howSchoolPlacementsWork":"You will be hosted by a base school for the majority of the year, with a contrasting placement in the spring term. We arrange for you to visit the school and staff before the interview to ensure you are both happy, it is a difficult training year and a good fit is essential to your happiness and success. You're required to attend lectures at university 1 day a week and alliance days throughout the year.\r\nYou will be supported by a class mentor, professional mentor, the teaching school and a teaching fellow from the university.\r\n\r\n\r\n","personalQualities":"We require:\r\n*a desire to teach, motivate and enthuse young people\r\n*interest in and commitment to the education of children \r\n*a flexible approach to learning and teaching\r\n*good oral and written communication skills\r\n*a readiness to listen and share\r\n* a love of your subject\r\n","otherRequirements":"Previous experience of working with young people strengthens an application","status":2,"createdAt":"2021-07-06T10:49:48.267Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"Salaried trainees receive a salary from the school (on the Unqualified Teacher Scale) which is a minimum of £18,169. \r\nBursaries, scholarships and financial support from Student Finance England isn’t available for this course because it comes with a salary.\r\n"}
