{"id":"487057cd-83ee-4dc4-b5b1-e2a0d9400916","name":"Primary","code":"3C9G","qualification":"pgce_with_qts","startDate":"2023-07-31T23:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"ba5c3860-5ef8-447c-8adf-5d30acd2cd4c","name":"Hillmorton Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"8476a0b4-69b6-4102-ab38-6fcdc748f496","name":"Ashlawn School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"63c6808b-9b6b-4508-a2b9-cf9a1ce6cb05","code":"1XO","name":"Transforming Lives Educational Trust Initial Teacher Training (TLET ITT)"},"accreditedBody":{"id":"ef09ce50-ccfc-4346-a0ce-43e840153dab","code":"W20","name":"The University of Warwick"},"profPost":"BO","degreeGrade":"1","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"You require a standard equivalent to a grade C/ level 4 in GCSE English, mathematics and science. \nYour qualifications must be completed before the commencement of your training place.\nEquivalency tests are accepted at the university’s discretion.\nNARIC equivalency certificates are required for any degree or school qualifications gained outside the United Kingdom.","courseLength":"OneYear","feesUK":9250,"feeDetails":"£9250","financialSupport":"You may be eligible for financial support while you study, please check the government website.","aboutCourse":"This non-salaried route means you will be working alongside experienced colleagues in school 4 days a week plus one day in university. During the autumn term, you will build up the number of hours you are observing lessons and begin to take over some parts of lessons. After Christmas you will move to a second placement for spring term as a contrasting experience, then after Easter return to your host school for the remainder of the year where you will continue to increase your teaching hours.\r\n\r\nYou will:\r\n*have a school-based class mentor, a professional mentor and a university teaching fellow for support\r\n*observe other lessons with colleagues to help formulate your individual style of teaching\r\n*be provided with a teaching timetable within ITT requirements\r\n*plan and evaluate taught lessons with the support of your mentor\r\n*be formally observed and discuss in a follow-up meeting (once per week)\r\n*create a portfolio of evidence during the year building up to meet the teaching standards for QTS\r\n*attend university day once a week and several alliance days across the year\r\n*be required to submit assignments, spread across the year, which will be assessed at Masters Level for your PGCE\r\n\r\nPlease see the Warwick University website for the most up to date course information as the Core and School Direct routes are virtually identical. (https://warwick.ac.uk/fac/soc/cte/start-teaching/secondary/) or email greenwaya@tlet.org.uk to discuss your options, and what is involved.\r\n\r\n","interviewProcess":"Interviews will be conducted by TLET’s Schools Educational Improvement either at Ashlawn School or in a partner school, depending on where you wish to be hosted for your main placement. \r\nYou will complete a written assessment (1 hour) then you will participate in a lower school (KS3) lesson in your subject, we will ask you to prepare a 10min starter activity (details given prior to interview), followed by an interview.\r\n\r\n\r\n","howSchoolPlacementsWork":"You will be hosted by a base school for the majority of the year, with a contrasting placement between Christmas and Easter. You're required to attend lectures at university 1 day a week and will also experience one week in a primary school during the autumn term.\r\nYou will be supported by a class mentor, professional mentor, the teaching school and a teaching fellow from the university.\r\n","personalQualities":"We require:\r\n*a desire to teach, motivate and enthuse young people\r\n*interest in and commitment to the education of children \r\n*a flexible approach to learning and teaching\r\n*good oral and written communication skills\r\n*a readiness to listen and share\r\n* a love of your subject\r\n","otherRequirements":"Previous experience of working with young people strengthens an application.","status":1,"createdAt":"2021-07-06T10:49:48.232Z","updatedAt":"2021-10-04T13:52:57.602Z","canSponsorStudentVisa":"yes","cycle":"2024"}
