{"id":"54a6664d-a00a-4b20-8136-f49528ba69da","name":"History","code":"3264","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"5a3609a0-5bbb-4377-b919-5d89932ab622","code":"V1","name":"History"}],"locations":[{"id":"8476a0b4-69b6-4102-ab38-6fcdc748f496","name":"Ashlawn School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"63c6808b-9b6b-4508-a2b9-cf9a1ce6cb05","code":"1XO","name":"Transforming Lives Educational Trust Initial Teacher Training (TLET ITT)"},"accreditedBody":{"id":"3e6c62a3-5d34-4a91-9c23-01c7409fd909","code":"L34","name":"University of Leicester"},"profPost":"BO","degreeGrade":"0","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"You should be a graduate, with an honours degree grade 2:1 or above or equivalent qualification. It is preferred your degree is in the subject you wish to train to teach, if not, a strong A level grade B/ level 5 is needed. \nYour qualifications must be completed before the commencement of your training place.\nNARIC equivalency certificates are required for any degree or school qualifications gained outside the United Kingdom.","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"You require a standard equivalent to a grade C/ level 4 in GCSE English and mathematics. \nYour qualifications must be completed before the commencement of your training place.\nEquivalency tests are accepted at the university’s discretion.\nNARIC equivalency certificates are required for any degree or school qualifications gained outside the United Kingdom.","courseLength":"OneYear","feesUK":9250,"financialSupport":"You may be eligible for financial support while you study, including bursaries, scholarships and loans please check the government website.","aboutCourse":"This non-salaried route means you will be working alongside experienced colleagues in school 5 days a week after a few full time weeks at university, during the autumn term you will build up the number of hours you are observing lessons and begin to take over some parts of lessons. After Christmas you will have another few weeks full time in university then move to a second placement as a contrasting experience where you will continue to increase your teaching hours.\r\n\r\nYou will:\r\n•\thave a school-based subject mentor, a professional mentor and a university teaching fellow for support\r\n•\tobserve other lessons with colleagues to help formulate your individual style of teaching\r\n•\tbe provided with a teaching timetable within ITT requirements\r\n•\tplan and evaluate taught lessons with the support of your mentor\r\n•\tbe formally observed and discuss in a follow-up meeting (once per week)\r\n•\tcreate a portfolio of evidence during the year to evidence you have met the teaching standards for QTS by the end of the course.\r\n•\tattend university day once a week and several alliance days across the year\r\n•\tbe required to submit assignments, spread across the year, which will be assessed at Masters Level for your PGCE\r\n\r\nPlease see the University of Leicester website for course information (https://le.ac.uk/courses/school-direct-secondary-education-pgce/2022) or please email greenwaya@tlet.org.uk to discuss your routes, options, and what's involved.\r\n","interviewProcess":"Interviews will initially be conducted by the TLET’s Schools Educational Improvement Officer at Ashlawn School, you will participate in a lower school (KS3) lesson in your subject, we will ask you to prepare a 10min starter activity (details given prior to interview), followed by an interview with the TLET’s Schools Educational Improvement Officer, if you are successful you will go on to a full day interview at Leicester University.","howSchoolPlacementsWork":"You will have two contrasting placements, one before Christmas and 1 after. You're required to attend lectures at university full time for a few weeks at the beginning of each placement and will also experience one week in a primary school during the course.\r\nYou will be supported by a subject mentor, professional mentor, the teaching school and a teaching fellow from the university.\r\n","personalQualities":"We require:\r\n*a desire to teach, motivate and enthuse young people\r\n*interest in and commitment to the education of children \r\n*a flexible approach to learning and teaching\r\n*good oral and written communication skills\r\n*a readiness to listen and share\r\n* a love of your subject\r\n","otherRequirements":"Previous experience of working with young people strengthens an application","status":1,"createdAt":"2021-07-06T10:49:47.639Z","updatedAt":"2021-10-07T11:22:10.649Z","canSponsorStudentVisa":"yes","cycle":"2024"}
