{"id":"90759571-ff86-4ff1-b49e-5b66b6e4c931","name":"Design and Technology","code":"325J","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"118fabd7-86d0-4a40-9e9a-e5c302abe59b","code":"DT","name":"Design and technology"}],"locations":[{"id":"8476a0b4-69b6-4102-ab38-6fcdc748f496","name":"Ashlawn School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"63c6808b-9b6b-4508-a2b9-cf9a1ce6cb05","code":"1XO","name":"Transforming Lives Educational Trust Initial Teacher Training (TLET ITT)"},"accreditedBody":{"id":"62d5803b-89ca-4e21-bb6f-5c74944c56ad","code":"B25","name":"Birmingham City University"},"profPost":"BO","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"You should be a graduate, with an honours degree grade 2:2 or above or equivalent qualification. It is preferred your degree is in the subject you wish to train to teach, if not, a strong A level grade B/ level 5 is needed. Your qualifications must be completed before the commencement of your training place.\nNARIC equivalency certificates are required for any degree qualifications gained outside the United Kingdom.","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"You require a standard equivalent to a grade C/ level 4 in GCSE English and mathematics. \nYour qualifications must be completed before the commencement of your training place.\nEquivalency tests are accepted at the university’s discretion.\nNARIC equivalency certificates are required for any school qualifications gained outside the United Kingdom.","courseLength":"OneYear","feesUK":9250,"feeDetails":"£9250","financialSupport":"You may be eligible for financial support while you study, please check the government website.","aboutCourse":"This non-salaried route means you will be working alongside experienced colleagues in school 4 days a week plus one day in university. During the autumn term, after a few full time weeks at university you will build up the number of hours you are observing lessons and begin to take over some parts of lessons. After February half term, you will have half a term you will then move to a second placement until Easter as a contrasting experience where you will continue to increase your teaching hours before returning to your base school after Easter for the remainder of the summer term.\r\n\r\nYou will:\r\n*have a school-based subject mentor, a professional mentor and a university teaching fellow for support\r\n*observe other lessons with colleagues to help formulate your individual style of teaching\r\n*be provided with a teaching timetable within ITT requirements\r\n*plan and evaluate taught lessons with the support of your mentor\r\n*be formally observed and discuss in a follow-up meeting (once per week)\r\n*create a portfolio of evidence during the year building up to meet the teaching standards for QTS\r\n*attend university day once a week and several alliance days across the year\r\n*be required to submit assignments, spread across the year, which will be assessed at Masters Level for your PGCE\r\n\r\nPlease see the BCU website for course information (https://www.bcu.ac.uk/education-and-social-work/initial-teacher-training/school-direct) or email greenwaya@tlet.org.uk to discuss your options, and what is involved.\r\n\r\n","interviewProcess":"Interviews will be conducted by TLET’s Schools Educational Improvement Officer and a course/subject leader from BCU either at Ashlawn School or in a partner school, depending on where you wish to be hosted for your main placement. \r\nYou will complete a few written activities (1 hour) then you will participate in a lower school (KS3) lesson in your subject, we will ask you to prepare a 10min starter activity (details given prior to interview), followed by an interview.\r\n","howSchoolPlacementsWork":"You will have two placements, a host school for the majority of the year and a contrasting placement for the half term between February and Easter. You are required to attend lectures at university full time for a few weeks at the beginning of the course and 1 day a week during the rest of the year and will experience one week in a primary school during the course.\r\nYou will be supported by a subject mentor, professional mentor, Transforming Lives Educational Trust Initial Teacher Training dept. and a teaching fellow from the university.","personalQualities":"We require:\r\n*a desire to teach, motivate and enthuse young people\r\n*interest in and commitment to the education of children \r\n*a flexible approach to learning and teaching\r\n*good oral and written communication skills\r\n*a readiness to listen and share\r\n* a love of your subject\r\n","otherRequirements":"Previous experience of working with young people strengthens an application","status":1,"createdAt":"2021-07-06T10:49:47.486Z","updatedAt":"2021-10-04T13:44:19.497Z","canSponsorStudentVisa":"yes","cycle":"2024"}
