{"id":"f978c6f4-8f2c-4db3-9333-ad4198f3665e","name":"History","code":"329V","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"5a3609a0-5bbb-4377-b919-5d89932ab622","code":"V1","name":"History"}],"locations":[{"id":"c4000985-ef25-48a2-8e97-07540c98be8c","name":"Main Site","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"334b16f6-a923-4db8-8f96-f174ad2696a6","code":"214","name":"Harrow First"},"accreditedBody":{"id":"feecdec5-259c-45e3-b1cf-4e391936ee90","code":"H36","name":"University of Hertfordshire"},"degreeGrade":"0","english":"2","maths":"2","acceptPendingGcse":"no","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"no","additionalGcseEquivalencies":"IELTS Only","courseLength":"OneYear","feesUK":null,"aboutCourse":"Harrow First in collaboration with the University of Hertfordshire offer a salaried School Direct training programme for a limited number of top graduates who wish to teach. Trainees spend four days in school and one day at the University of Hertfordshire each week during term time.\r\n\r\nAll courses are run in Harrow and allow teachers to develop their leadership skills whilst training to teach.  Harrow First is a challenging programme which will take a fresh approach to training teachers via the School Direct (salaried route).  Successful applicants will undergo training during July and August with a view to teaching from 10 hours per week in a school from September, supported in the classroom by a Higher Level Teaching Assistant (HLTA).  Training will continue through the year, both in school and at the University of Hertfordshire.  The course leads to the award of Qualified Teacher Status (QTS) plus 30 MA credits.  There will be opportunities to complete further MA modules in subsequent years in order to achieve the MA in Education.  \r\n\r\nThere are three assessment point throughout the year and trainees are assessed through a combination of lesson observations and an evidence bundle include lesson plans and evaluations. Trainees will benefit from a variety of support: from the University of Hertfordshire, from their mentor in school, from the Higher Level Teaching Assistant, from a Professional Mentor in school and from a Specialist Leader in Education who will ensure the coherence of the course.  Colleagues in all these roles are well trained and experienced.  We are committed to training creative, innovative and reflective practitioners who see themselves as future leaders.  ","interviewProcess":"Once your application is submitted shortlisted candidates will be invited for interview at one of the schools in the alliance. The interview process will involve four parts and will include the following: \r\n\r\n* Interview\r\n* Lesson Observation – the topic will be provided prior to interview\r\n* Literacy task\r\n* Document check\r\n\r\nThe interview process will include the opportunity to talk to staff and pupils and is a rigorous and thorough process, designed to allow you to demonstrate a range of qualities and competences.  We seek to get the best match of applicant to the limited places available.  \r\n\r\n","howSchoolPlacementsWork":"You main placement school will be one of the schools located in North-West London with good transport links to Central London. You will be teaching either 11 – 16 or 11 – 18 depending on the subject and placement. All trainees will have one main placement school where they will complete the majority of their training. They will train at a second school for a short six week placement in the Spring Term.","personalQualities":"We are looking for ambitious trainee teachers who are passionate and enthusiastic about learning and have a desire to share this with children and young people of all abilities. This will be demonstrated by meaningful experience of working with children and young people. This does not need to be paid work but might be helping with a sports team, drama group or youth club.  During the last two years we expect you to have carried out at least five days classroom experience, or you may have worked in a school.  ","otherRequirements":"We particularly welcome applicants who have worked with young people in a variety of settings.  We expect you to have spent at least five days shadowing in a school or schools; and to have observed lessons in a secondary school before your interview.  You will be required to provide written evidence of this if invited for an interview.  Three years’ work experience (PhD study is acceptable) is required to meet the eligibility requirements of the School Direct (salaried) programme.  ","status":1,"createdAt":"2021-07-06T10:48:43.027Z","updatedAt":"2021-09-08T12:41:12.548Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"This is a salaried programme and all training fees and costs are covered by the Canons Park Teaching School Alliance. We pay on the unqualified teachers’ pay scales (for Outer London). There are no other fees or costs for the trainees."}
