{"id":"51df99e6-3790-4890-aad3-110764d677b3","name":"Primary","code":"3C3Y","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"ad3364b9-cc71-4759-9afa-990dc758b321","name":"Burnside Academy","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"be65f25b-9dac-4884-81dc-25b139351319","code":"2JG","name":"Inspire Multi Academy Trust Teaching Alliance"},"accreditedBody":{"id":"926804ac-be7a-4f0a-97f9-a26a5f5f032a","code":"S84","name":"University of Sunderland"},"profPost":"PG","degreeGrade":"0","english":"1","maths":"1","science":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feesInternational":10750,"aboutCourse":"Our School Direct Programme involves spending four days a week in one of our settings and one day a week at the University of Sunderland.\r\n\r\nOn the School Direct route your work-based learning is based in the school. You will have a School Mentor and a University Tutor who will assess your written work and your teaching practice. You will also have support from a University Mentor.\r\n\r\nDuring your time in University, assessments will be a mix of written assignments, case studies and one to one assessments of your teaching practice. You will be taught via lectures, seminars, tutorials, project work and group work. You will be in University for an average of 15 days during the full training year; the University will provide support with your education assignments and practice based research. \r\n\r\nOur programme is tuition based.  If you choose the  tuition route you will pay a tuition fee for your course and you will be eligible to apply for the many generous, tax-free government scholarships on offer.\r\n","interviewProcess":"School Direct interviews include staff from both the school and university. We will require you to demonstrate your understanding of teaching via a brief presentation. You may be asked to read a story to children, teach a short lesson to a class, or be interviewed by young people on the School Council.\r\n","howSchoolPlacementsWork":"You will be based in one of the following five schools for the vast majority of your placement:\r\n\r\n* Burnside Academy\r\n* Fatfield Academy\r\n* Plains Farm Academy\r\n* New Penshaw Academy \r\n* Farringdon Academy\r\n\r\nYou will have two placements during our School Direct Programme and both will be based in one of our Trust schools but we will ensure they give you two contrasting placements which will deepen your knowledge and understanding of teaching and learning.","personalQualities":"We are looking for candidates who are enthusiastic about working with young children and who have the determination, resilience and commitment to become outstanding teachers.\r\n\r\n\r\nYou should be passionate about teaching and want to motivate, challenge and inspire all children to achieve their personal best.  You should have effective communication and interpersonal skills.\r\n\r\nYou must be able to establish and develop outstanding relationships with children and staff.\r\n\r\n","otherRequirements":"*  An enhanced Disclosure and barring Service (DBS) check\r\n\r\n*  A completed medical pro forma (based on DFEE Circular 8/92)\r\n\r\n","status":1,"createdAt":"2021-07-06T10:56:56.128Z","updatedAt":"2021-10-04T11:20:27.433Z","canSponsorStudentVisa":"yes","cycle":"2024"}
