{"id":"6f8a925c-98e1-46a3-af68-b57b0806890f","name":"Primary (3-7)","code":"X121","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"3_to_7","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"9bd8a4d1-b42a-4fdf-8dfd-d6d1b88a2635","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"a4afc8f8-2c1b-48c0-91f3-351640495498","code":"W14","name":"Wandsworth Primary Schools Consortium"},"profPost":"PG","degreeGrade":"2","english":"2","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We do not offer equivalency tests and expect that applicants make their own arrangements with a suitable provider, e.g. [A Star Equivalency] (https://astarequivalency.co.uk/) or [Equivalency Testing] (https://www.equivalencytesting.com/).","courseLength":"OneYear","feesUK":9250,"feesInternational":9250,"feeDetails":"TUITION FEES: Invoicing for Self-Funding Trainees\r\n\r\nInvoice 1: 2nd August\r\nDue Date: 1st September\r\nAmount Due:  £6000\r\n\r\nInvoice 2: 1st December \r\nDue Date: January 1st \r\nAmount Due:  £3250\r\n\r\n\r\nTUITION FEES: Liability Periods\r\nTypically, all students complete the full PGCE programme. However, if for any reason you have to withdraw from the programme our liability periods are set out below (based on dates for the 2021-22 period): \r\n\r\nPeriod 1\r\nWithdrawals on or before 1 October \r\n100% refund\r\n0% liability \r\n\r\nPeriod 2\r\nWithdrawals between 2 October 2021 to 4 January 2022 inclusive\r\n75% refund\r\n25% liability\r\n\r\nPeriod 3\r\nWithdrawals between 5 January 2022 to 26 April 2022 inclusive\r\n50% refund\r\n50% liability\r\n\r\nPeriod 4\r\nWithdrawals after 26 April 2021\r\n0% refund\r\n100% liability\r\n","financialSupport":"You may also be eligible for a [loan while you study](https://getintoteaching.education.gov.uk/funding-my-teacher-training/tuition-fee-and-maintenance-loans) – note that you’ll have to apply for [undergraduate student finance.](https://www.gov.uk/student-finance)\r\n\r\nFind out about financial support if you’re from [outside the UK.](https://getintoteaching.education.gov.uk/explore-my-options/overseas-graduates)","aboutCourse":"Wandsworth SCITT offers you a one year course leading to a Primary Post Graduate Certificate of Education (PGCE) with Qualified Teacher Status (QTS) validated by Kingston University. The course carries 60 Credits towards a Masters Degree.\r\n\r\nWithin the framework of the PGCE programme you can select either a General Primary (5-11) or Early Years (3-7) Pathway. \r\n\r\nTrainees selecting the Early Years pathway are required to undertake school placements in both the Early Years and Key Stage 1. All trainees will undertake centre-based training which address pedagogy and curriculum across the 3-11 age phase and will have additional sessions in the specialist age-phase. Early Years trainees will visit a range of Wandsworth Foundation Stage settings. This will include school-based training at each of the three Wandsworth Nursery Schools (Somerset, Eastwood and Balham).  All trainees will be qualified to teach across the primary phase as Newly Qualified Teachers (NQTs).\r\n\r\nThe course is largely school-based, with approximately 24 weeks in school and 14 weeks on the taught course either at the St Mary’s RC Primary School base or in the other partnership schools (listed on Wandsworth SCITT website). \r\n\r\n\r\nTutors, classroom teachers and other educational professionals lead the taught course sessions. There will be regular opportunities for peer discussion, project work and evaluation of your school-based work.\r\nYou will experience teaching placements in two local primary schools during your training and will be supervised in each school by a trained mentor. In addition, you will have an initial two week observation placement at the start of the course.\r\n\r\nA Course Director, with expert knowledge and experience of teacher education, and a specialist in SEN and Early Years education, will oversee and co-ordinate your training during the course under the direction of the Consortium Management Board. The Consortium Management Board is made up of representatives of the partnership, including head teachers, a lead Link Tutor and Quality Assurance Officer.\r\n\r\nYour progress will be monitored and assessed through regular formal and informal monitoring of teaching competence. The final assessment in June will be made against the framework of the [Teachers’ Standards](https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/665522/Teachers_standard_information.pdf), \r\n\r\nThe number of trainees obtaining jobs immediately after graduating, continues to remain higher than average when compared with other providers. \r\n","interviewProcess":"Please apply through [DfE Apply] (https://www.gov.uk/apply-for-teacher-training).\r\n\r\nYou should write a full personal statement which expresses clearly why you want to teach and the experiences which demonstrate your readiness for the training programme. Experience of working with children is not an essential requirement but is highly recommended as it helps you make a well-informed decision about your desire to teach.\r\n\r\nSeek out references from two referees. One academic reference and one work-based reference from your most recent employer will complement your application well. Please note that your application will not be finalised and available to us or other providers until your referees upload their reference to UCAS.\r\n\r\nApplicants should possess the minimum qualification requirements or be working towards them with a view to them being in place by the time that the course begins. Please make it clear on applications if you are working towards required qualifications and when results will be known.\r\n\r\nSuccessful candidates will be invited to attend a half day interview session with Literacy and Numeracy testing and group and individual interviews / tasks. The interviews will take place at the SCITT base at St Mary’s RC Primary School. There will also be an opportunity to work with children in the classroom of one of our partner schools. This will take place either on the same day as your interview or within five days of that date. \r\n\r\nMore specific details about the  interview will be provided to candidates by email if successful in application.\r\n","howSchoolPlacementsWork":"Wandsworth SCITT currently partners with over 20 primary schools in the London Borough of Wandsworth. \r\nPartnership schools have been selected based on their capacity to provide a high quality teaching and learning environment, their commitment to professional development and their previous experience of working with trainees in initial teacher training. They are actively engaged in development of the course and the selection of trainees, their mentoring and assessment.\r\nTrainees on the General Primary pathway undertake one block practice in Key Stage 1 and one in Key Stage 2 during the course. Trainees on the Early Years pathway undertake one block practice in the EYFS and one in Key Stage 1. \r\n\r\nThe first block practice is approximately 7 weeks and takes place in the ‘alternate’ Key Stage. The second and third blocks total approximately 13 weeks and constitute your ‘specialist’ Key Stage.  Additionally there will be a non-assessed 2 week placement at the start of the programme. \r\n\r\nWe will place you in schools that help you to develop your professional practice and you must be prepared to be undertaking your training in any of our partnership schools across Wandsworth. Please see the WandsworthSCITT website for a list of these schools. We will take into account the needs of working parents when organising placements where possible.  \r\nYour main in-school experience will progress from observing and working alongside your class teacher to taking full responsibility, firstly for groups and later, for the whole class.\r\n\r\nTrainees will be assigned a trained mentor within the school who will be responsible for supporting and guiding professional development and ensuring that everyone has the opportunities they need within the school.\r\n","personalQualities":"We are looking for enthusiastic, hardworking, well-organised students who are ready for a challenging but rewarding year.\r\n\r\nYou need to be: \r\n\r\n* Committed to improving the lives of  children and families;\r\n* Passionate about teaching and learning;\r\n* Reflective and committed to your professional development;\r\n* Empathetic, supportive and and effective and building relationships; and\r\n*Organised, flexible, and solution-focused.\r\n\r\nYou need to have: \r\n\r\n* Knowledge of UK education system, the National Curriculum and an awareness of current educational issues;\r\n* Excellent communication skills; and\r\n* Secure numeracy and literacy skills. \r\n","otherRequirements":"All offers made will be subject to:\r\n\r\n* the candidate demonstrating they possess fundamental English and Maths skills\r\n* receipt of a satisfactory enhanced Disclosure and Barring Service (DBS) check\r\n* two satisfactory references to include the candidate’s current or most recent employer (if applicable)\r\n\r\nFor all candidates: please note we require sight of original GCSE, A level and degree certificates at interview. For those who have studied overseas we also require sight of any original NARIC documentation pertaining to these qualifications.\r\n\r\n","status":1,"createdAt":"2021-07-06T10:57:05.005Z","updatedAt":"2021-10-07T14:56:53.503Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
