{"id":"2ec4cc6f-3a9c-4ca8-b0ba-0b17ba937499","name":"History","code":"2LYN","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"5a3609a0-5bbb-4377-b919-5d89932ab622","code":"V1","name":"History"}],"locations":[{"id":"ad7e7e4d-7b8d-4d4d-82be-89e0599ce492","name":"Various placement schools available Nottingham (shire) and Derby (shire)","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"0325ceb1-cdd1-4ee3-ac60-c006483cede7","code":"12W","name":"Bluecoat Academy"},"accreditedBody":{"id":"e7ca18a3-f1b7-4efd-82be-88a3c6a272d5","code":"1YH","name":"Bluecoat SCITT Alliance Nottingham"},"profPost":"BO","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"We will consider a 3rd class degree","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Candidates are expected to cover the cost of taking and studying for an approved equivalency test.","courseLength":"OneYear","feesUK":9250,"feeDetails":"Fees are paid pro rata across the three terms:\r\n\r\nOctober 25%\r\nFebruary 25%\r\nMay 50%\r\n\r\nThere are no other costs.\r\n\r\nWe will ask you to confirm your method of payment, and agree to maintain repayments by completing a tuition fee payment agreement.  \r\nAll trainees will be invoiced for payments at each of the instalment periods.\r\n","aboutCourse":"Our school based training means you will be based in one of our partner schools on placement Monday – Thursday, and treated by the school as a member of staff. On Friday trainees come together for a day’s training of pedagogy and subject knowledge, following a comprehensive programme across the year.  The PGCE delivered by Sheffield Hallam University takes place on four Fridays across the year at the SCITT Training Centre (Nottingham).  In the Spring term you will spend 6 weeks at another school, as the training must include teaching in two schools.   Trainees' progress is reviewed throughout the year in order to meet the Teaching Standards for award of QTS.  There are two PGCE assignments in January and May.\r\n\r\nThe course has been carefully structured to guide you through your transformation from a skilled practitioner to a confident teacher within a practical learning environment. Your choice to begin this course was just the beginning of your journey to learn and understand how to capture the observations and curiosity of young, aspiring children.\r\n\r\nYou will understand the National Curriculum and relevant Key Stages. \r\n\r\nThe course aims to:\r\n\r\n* Fulfil and support the general aims of the Bluecoat SCITT Alliance Nottingham curriculum\r\n\r\n* Develop competencies specific to the phase and subject which you are teaching\r\n\r\n* Ensure that trainees are competent professionals and effective teachers\r\n\r\n* Encourage an enthusiasm for education\r\n\r\n* Encourage trainees to challenge pupils and to meet their individual needs through personalisation.\r\n\r\nA Subject /Phase Lead. They will help you with specific subject issues and lead the Sessions on Friday.\r\n\r\nYou will have a professional subject mentor on each placement with an hour’s 1:1 mentoring session every week. \r\n\r\nYou will also be assigned a \"buddy\"; someone who has been through our programme or similar route.\r\n\r\nYou will also work with colleagues throughout your school, in learning support and the Senior Leadership Team who will be pro-active in helping you.\r\n\r\n\"What a fantastic year! The SCITT course is well structured and progressively introduces trainees to the demands of the profession in preparation for a successful career in teaching. I was unquestionably supported during the year by course leaders, mentors and friends.\" \r\n\r\n“I enjoy coming together for our training day , where we can share our experiences from our placement schools, and take away excellent advice and information that we take back into the classroom.\"","interviewProcess":"We are passionate about providing quality educational experiences for the young people in our care and, as such, we are looking for passionate and inspirational trainees and will be evaluating this in your interview. We are looking for an understanding of school-based training; an awareness of current educational issues; a realistic and positive view of schools and schooling; clear reasons for wanting to teach; commitment to teaching pupils of all levels of ability; maturity and self-confidence; and an appropriate level of subject knowledge. \r\n\r\nThe structure of the interview will normally include the following:\r\n\r\n* a short engagement activity & presentation based on subject knowledge\r\n* a formal interview \r\n* a numeracy and literacy activity \r\n….as well as the opportunity to ask any questions.\r\n\r\nInterviews will take place either online via zoom or face to face.  \r\n\r\nCandidates will be informed in detail about the requirements for their interview.\r\n\r\nIf you are successful at this interview you will be offered a conditional place.\r\n\r\nBluecoat SCITT Alliance is committed to safeguarding and promoting the welfare of children and young people.  Throughout the day, staff involved in the interviews and activities will be assessing applicants, their suitability to work with children, experience, qualifications (and subject knowledge) and potential to become a trainee teacher.","howSchoolPlacementsWork":"Bluecoat SCITT Alliance works with a range of different partner schools across Nottingham, selected carefully to ensure trainees have a high quality experience.  Collaboration and partnership is the foundation of school-based training.  In hosting trainees, partner schools shall ensure that trainees have access to a range of experiences, allowing them to fulfil the requirements of all of the Teachers’ Standards applicable to the phase being taught, and will be invited to participate in programme planning and improvements to the programme as part of the self-evaluation process.\r\nTrainees are asked at interview if they have a preference of placement school, taking into account any personal circumstances and ability to travel.\r\nTraining takes place across the full academic year, September to July.  Trainees will be in their placement school from the first day of term (having been suitably inducted and orientated by their mentor/school staff), and will undertake a second school placement in the spring for 6 weeks.\r\nThe trainees increase their teaching commitment throughout the year. \r\nThey will roughly follow the programme below:\r\nWeeks 1 - 2 \tObserving lessons\r\nAutumn Term\tWorking up to teaching 6 hours a week\r\nSpring Term\tWorking up to teaching 10 hours a week\r\nSummer Term\tWorking up to teaching 15 hours a week\r\nTrainees would be expected to plan and mark for the lessons they are teaching, as well as attending relevant parents evening and extra-curricular sessions. Trainees are not to be left unattended whilst teaching and should receive feedback on each of their teaching episodes\r\n\r\nYour timetable will be drawn up by your mentor to facilitate your stepped professional development against the SCITT curriculum\r\n\r\n*Cover the appropriate lessons in the schedule over a Monday to Thursday period.\r\n\r\n*Opportunities to observe expert colleagues across the school.\r\n\r\n*Provide appropriate developmental opportunities across the Key Stages/age phases of your training to develop your teaching skills, knowledge and understanding and to support your further professional development\r\n\r\n*Opportunity to plan and deliver learning sequences\r\n\r\n*Progress from collaborative to independent teaching as confidence grows\r\n\r\n*Dedicated 1 hour mentor meeting, review progress and set targets\r\n","personalQualities":"A desire to teach and work with young people. \r\n\r\nAll teachers need to be able to communicate well. \r\n\r\nA commitment to work hard.  Our teachers and partnership schools will work hard in supporting you, and you must demonstrate equal commitment.\r\n\r\nTeaching is about working with others - we encourage you to work collaboratively, both with other trainees and with teachers. \r\n\r\nYou need to be open to new ideas, willing to review your own progress and reflect on the new situations in which you will find yourself. You will need to be organised and independent.\r\n","otherRequirements":"Admission to the course is subject to a satisfactory medical report, as you are required to meet the standards for 'Fitness to Teach'. \r\n\r\nAll applicants must undertake an Enhanced Disclosure from the DBS. You will be required to disclose previous offences as part of the checks. \r\n\r\nBluecoat SCITT Alliance is committed to safeguarding and promoting the welfare of children and young people. All staff, and everyone involved in the Bluecoat SCITT Alliance Nottingham trainee placements shares this commitment, and are therefore expected to behave in such a way that supports this commitment.","status":1,"createdAt":"2021-07-06T10:47:04.117Z","updatedAt":"2021-08-13T14:44:03.859Z","canSponsorStudentVisa":"no","cycle":"2024"}
