{"id":"6f32ced4-0b3d-4aa4-b2bf-dc418d5d4071","name":"English","code":"2F3L","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3aed1aa8-ae46-4b68-92bb-a6cc20655c59","code":"Q3","name":"English"}],"locations":[{"id":"ad7e7e4d-7b8d-4d4d-82be-89e0599ce492","name":"Various placement schools available Nottingham (shire) and Derby (shire)","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"0325ceb1-cdd1-4ee3-ac60-c006483cede7","code":"12W","name":"Bluecoat Academy"},"accreditedBody":{"id":"e7ca18a3-f1b7-4efd-82be-88a3c6a272d5","code":"1YH","name":"Bluecoat SCITT Alliance Nottingham"},"degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"We will consider a 3rd class degree","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Candidates are expected to cover the cost of an equivalency test (including the cost of any support/tutorials etc), and should check the provider's accepted organisations before taking a test","courseLength":"OneYear","feesUK":null,"aboutCourse":"Our school based training means you will be based in one of our partner schools on a main placement Monday – Thursday, and employed by the school as a member of staff. On Friday trainees come together for a day’s training of pedagogy and subject knowledge, following a comprehensive curriculum across the year.  The PGCE delivered by Sheffield Hallam University will also take place on four Fridays across the year at the SCITT Training Centre (Nottingham).  In the Spring term you will spend 3 weeks at another school, as the training must include you teaching in two schools.   Your progress will be reviewed throughout the year to meet the Teaching Standards and award of QTS on completion.  \r\n\r\nThe PGCE is optional in this route.\r\n\r\nThe course has been carefully structured to guide you through your transformation from a skilled practitioner to a confident teacher within a practical learning environment. Your choice to begin this course was just the beginning of your journey to learn and understand how to capture the observations and curiosity of young, aspiring children.\r\n\r\nYou will understand the National Curriculum and relevant Key Stages. \r\n\r\nThe course aims to:\r\n\r\n* Fulfil and support the general aims of the Bluecoat SCITT Alliance Nottingham Programme as set out in the submitted scheme\r\n\r\n* Develop competencies specific to the phase and subject which you are teaching\r\n\r\n* Ensure that trainees are competent professionals and effective teachers\r\n\r\n* Encourage an enthusiasm for education\r\n\r\n* Encourage trainees to challenge pupils and to meet their individual needs through personalisation.\r\n\r\nYou will be assigned a Subject Lead/Phase Lead. They will help you with specific subject issues and lead the Sessions. \r\n\r\nYou will have your own Mentor on each placement. This is an experienced teacher in your subject. They will give you an hour’s 1:1 mentoring session every week. They will also be the first person you should ask when you need help.\r\n\r\nIn addition to others in the department, you will also work with colleagues in the SCITT, throughout the school, in learning support and the Senior Leadership Team who will be pro-active in helping you. One of the advantages of choosing school based training is that you spend a significant amount of time in schools which have been selected because they want to train new entrants to the profession to become outstanding practitioners. \r\n\r\n\r\n\r\n\r\n","interviewProcess":"If you are offered an interview this will be at one of the alliance schools for the phase range.  The  interview usually takes ½ a day.   We are looking for an understanding of school based training, an awareness of current educational issues, a realistic and positive view of schools and schooling, clear reasons for wanting to teach, commitment to teaching pupils of all levels of ability, maturity and self-confidence, and an appropriate level of subject knowledge. You can expect to undertake the following tasks, \r\n\r\nThe interview process will include two stages;\r\n\r\n* a short engagement activity & presentation\r\n* an interview (small panel)\r\n* a short literacy and numeracy activity\r\n\r\n….as well as the opportunity to ask any questions.\r\n\r\nIf you are successful at stage 1, you will follow up with an in school \"teaching\" assessment with a class of pupils.\r\n\r\nIf you are successful at this interview you will be offered a conditional place.\r\n\r\nBluecoat SCITT Alliance is committed to safeguarding and promoting the welfare of children and young people.  Throughout the day staff involved in the interviews and activities will be assessing applicants, their suitability to work with children, experience, qualifications (and subject knowledge) and potential to become a trainee teacher.\r\n","howSchoolPlacementsWork":"\r\nYou will apply through UCAS and are enrolled on to the SCITT programme but are contracted to and paid through a school who is offering a training place through this route. \r\n\r\nThe placement school is responsible for you in all aspects of contractual employment and must issue a contract of employment.  \r\n\r\nYou  will be in school for four days per week with Fridays spent undertaking training provided by Bluecoat SCITT Alliance Training. \r\n\r\nAll applications must be submitted through UCAS.  \r\n\r\nYou will start teaching from the beginning of the year.  Your timetable will increase across the three terms:  \r\n\r\nTERM 1\t        7 Lessons\r\nTERM 2\t10 Lessons\r\nTERM 3\t14 Lessons\r\n\r\nIt is important that this teaching should be distributed across the two key stages for which training is undertaken, starting with KS 3 in Term 1, building to include KS4 in terms 2 & 3.\r\n\r\nYou will have a mentor who plays a vital part in supporting you by providing a weekly mentor meeting, and members of the SCITT team will observe you in class and support you on a regular basis.\r\n\r\nYour progress is reviewed regularly; each half term, and a report at the end of each term.  \r\n\r\nYou are required to present a range of evidence in the form of Extended Learning Tasks in order to demonstrate your full achievement of the Teachers’ Standards. \r\n","personalQualities":"A desire to teach and work with young people. \r\n\r\nAll teachers need to be able to communicate well. \r\n\r\nA commitment to work hard.  Our teachers and partnership schools will work hard in supporting you, and you must demonstrate equal commitment.\r\n\r\nTeaching is about working with others, we encourage you to work collaboratively, both with other trainees and with teachers. \r\n\r\nYou need to be open to new ideas, willing to review your own progress and reflect on the new situations in which you will find yourself. You will need to be organised and independent. ","otherRequirements":"Admission to the course is subject to a satisfactory medical report, as you are required to meet the standards for 'Fitness to Teach'. \r\n\r\nAll applicants must undertake an Enhanced Disclosure from the DBS. You will be required to disclose previous offences as part of the checks. \r\n\r\n\r\nBluecoat SCITT Alliance is committed to safeguarding and promoting the welfare of children and young people. All staff, and everyone involved in the Bluecoat SCITT Alliance Nottingham trainee placements shares this commitment, and are therefore expected to behave in such a way that supports this commitment.\r\n","status":1,"createdAt":"2021-07-06T10:47:04.038Z","updatedAt":"2021-08-17T14:47:16.932Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"SCITT Salaried trainees apply through UCAS and are enrolled on to the SCITT programme but are contracted to and paid through a school. \r\n\r\nThe placement school is responsible for the trainee in all aspects of contractual employment and must issue a contract of employment.  \r\n\r\nTrainees are paid at point one of the unqualified teacher scale.  Schools should issue a 0.8 contract for 12 months (1 September – 31 August)\r\n\r\nPGCE option:  Salaried trainees are given the option of undertaking a PGCE (with 60 Masters level credits) validated by Sheffield Hallam University. Trainees will have to cover the cost of the PGCE fees themselves (currently £1545 split across 3 Terms, 25%, 25%, 50%)."}
