{"id":"fc726ab1-f98c-4474-a49f-6914daf6fdba","name":"Primary","code":"C978","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_7","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"0e8bf005-dda8-47ba-aad8-cf0d37754461","name":"Furness Academy (Secondary)","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"28684649-3407-4004-9cb2-4aca8757498a","code":"2KS","name":"South Cumbria School Direct"},"accreditedBody":{"id":"d14be96c-fe6c-4962-a0b9-6717cf4f9d5b","code":"R23","name":"Ripley ITT"},"profPost":"PG","english":"3","maths":"3","science":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"Academic Year (Sept 21 - Jul 22)","feesUK":9000,"feeDetails":"£9,000 PGCE and QTS","aboutCourse":"Early Years (Lower Primary 3-7 yrs) \r\n\r\nWe are working in partnership with Ripley TSA SCITT and Leeds Beckett University to offer a School Direct Programme which offers a superb route into our rich and rewarding profession. If you study with us, you will be working towards a PGCE course at Masters Level which will lead to qualified teacher status (QTS).\r\n\r\nYou will train in a range of ‘good’ and ‘outstanding’ schools in the Barrow and Furness area who are very experienced at delivering high quality teacher training and have a range of contrasting contexts. You will learn from and work alongside excellent teachers and experienced staff in over 22 schools comprising early years and primary. \r\n\r\nOur programme begins early September and from the outset you will have 2 days per week of School Embedded Learning (when not on assessed placement) in one of our partner schools.  A valuable opportunity to learn from being in a classroom environment and to make connections between your experience and your taught module content. The remainder of the week comprises of Pedagogy and Practice (P&P) training sessions, hosted and delivered by Headteachers, Specialist Leaders of Education (SLEs) and other outstanding classroom practitioners who currently teach in our partner schools.  The P&P sessions will be held in several of our school venues according to the best expertise available for each topic.        \r\n\r\nYou will have training and experience in important primary education topics, including phonics and early reading, assessment, special needs and inclusion, working with support staff and leadership. There are many different subjects taught in primary education and you will audit your subject knowledge for the topics you will need to teach at KS1 and KS2. Some of the P&P sessions will focus specifically on these subjects\r\n\r\nLeeds Beckett University provide the PGCE for our programme and this is all online. The modules perfectly compliment the training we deliver and you will gain 60 Master's level credits (https://courses.leedsbeckett.ac.uk/PGCE_distancelearning/)\r\n\r\nYou study three modules in total, all learning will integrate theory and practical application.\r\n\r\nAs you will be studying a PGCE, you will have academic assignments at Masters level which require you to read, research and reflect on your learning and experiences within the training year.\r\n\r\nAssessment of trainees for QTS is provided by Ripley TSA SCITT who have been highly praised by Ofsted for their approach to trainee workload and for keeping requirements concise yet effective.  ","interviewProcess":"Applicants who meet the entry requirements will be invited to interview. \r\nInterviews normally take place in one of our primary schools and involve teaching short lesson to a small group of pupils.\r\nDue to coronavirus we are offering interviews via Zoom. You will be asked to submit a lesson plan beforehand and we will ask you about your ideas in the interview. The interview is followed by a subject task and a short task around functional English which are completed under time limits and returned to us via email.\r\n\r\nWe are looking for the potential to be an excellent trainee, someone who is ready to start training in a school setting from early September. We are also looking for potential employees in our schools.\r\n\r\nThe admissions panel are all Safer Recruitment trained and we are committed to safeguarding children\r\n","howSchoolPlacementsWork":"You will complete three school placements which take place within two or three of our twenty-two partner schools in the Barrow and Furness area. The first placement will begin in September, an excellent time to see how rules and routines are established at the start of the academic year. You will start with focused lesson observations before you begin to plan and teach parts of lessons. After a few weeks you will be planning and delivering whole lessons, building up to approximately 50% by the end of your beginning placement.  \r\n\r\nThe second and third placements will be in different schools which will give you a contrasting experience and broaden your professional development. Again, you will gradually increase your teaching timetable and will be teaching up to 70% by the end of your extending placement in July.  \r\n\r\nYou will have three assessed placement blocks:\r\n\r\n- Beginning Placement 4 weeks in the autumn term\r\n- Developing Placement 5 weeks in the new year/ winter term\r\n- Extending Placement 9 weeks in the spring & summer term\r\n\r\nThese will occur in at least two different schools and in 2 different key stages to meet the requirements of gaining QTS. \r\n\r\nYou will have 2 days per week of School Embedded Learning (when not on assessed placement) you will be in school but not teaching. A valuable opportunity to learn from being in a classroom environment and to make connections between your experience and your taught module content.\r\n\r\nPlacements are selected for you on the basis of high quality mentoring, individual training needs, the opportunity to experience the full primary age range, contrasting schools and reasonable commuting distance. We have 22 partner schools in the Barrow and Furness area in which you can carry out your placements.\r\n\r\nYour first two placements (beginning & developing) will take place in an EYFS and KS1 setting, for your third placement (extending) we will try and accommodate your preference for either EYFS or KS1.   \r\n\r\nThere may also be opportunities to spend some time in other partner schools and settings as training needs arise.","personalQualities":"We are looking for people who are keen to learn in a school setting and this model suits trainees who are able to learn as they go along and incorporate their own experience into this learning process. Successful applicants will have an understanding of the professionalism and resilience needed to become a teacher and to be reflective learners. A real commitment to a career in teaching, passionate and enthusiastic with an interest in teaching all subjects and a positive attitude towards children are essential qualities.","otherRequirements":"Applicants who are successful at interview will need the following before they can start the programme:\r\n- DBS and barred list check\r\n- Medical check\r\n\r\nWe welcome applicants of all ages, from university graduation to mature career changers. It is important that you have a good awareness of what the role of a teacher involves so that you can be sure it is the right career choice for you.\r\n","status":2,"createdAt":"2021-07-06T10:50:07.901Z","canSponsorStudentVisa":"no","cycle":"2024"}
