{"id":"ff9244aa-13a2-45ad-87e4-419ef4ef8e2e","name":"Chemistry","code":"3BVW","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"912d4fb4-761b-42e9-8dc6-e968b791ea4e","code":"F1","name":"Chemistry"}],"locations":[{"id":"0e8bf005-dda8-47ba-aad8-cf0d37754461","name":"Furness Academy (Secondary)","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"28684649-3407-4004-9cb2-4aca8757498a","code":"2KS","name":"South Cumbria School Direct"},"accreditedBody":{"id":"d14be96c-fe6c-4962-a0b9-6717cf4f9d5b","code":"R23","name":"Ripley ITT"},"profPost":"PG","degreeGrade":"9","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feeDetails":"£9250 PGCE and QTS\r\n£7000 QTS only\r\n","aboutCourse":"Our Teach Direct Programme begins early in September and involves teaching practice in school each week from Monday to Thursday, with Friday as a conference day. The Friday conferences will be hosted and delivered by outstanding classroom practitioners who currently teach in our partner schools. Curriculum conferences will be held in several of our school venues according to the best expertise available for each topic.\r\n\r\nIn addition, there will be subject development days during the year where trainees will focus on teaching Chemistry specifically. These will be delivered by a Lead Subject Mentor for Chemistry, a Specialist Leader of Education who has been appointed due to their successful track record in subject leadership. The days incorporate learning walks and lesson experience alongside input from the Lead Subject Mentor and directed tasks for you to consolidate your learning.\r\n\r\nYou will audit your subject knowledge for the topics you will need to teach at KS3 and 4. Lead Subject Mentors will guide you towards great resources for this and you will be encouraged to join a professional subject association. A shared drive enables you to share resources with each other and school mentors. We can also organise additional training courses and access to resources at no cost to you.\r\n\r\nLeeds Beckett provide the PGCE for our SCITT and this is all online. The modules perfectly compliment the training we deliver and you will gain 60 Master’s level credits\r\n(https://courses.leedsbeckett.ac.uk/PGCE_distancelearning/)\r\n\r\nAssessment of trainees for QTS is based on all of the following:\r\n- Regular observations of lessons with feedback and target setting\r\n- Progress towards meeting the Teacher Standards at Key Assessment Points\r\n- Assessment of a Best Evidence Portfolio at the end of the programme. \r\n\r\n","interviewProcess":"Applicants who meet the entry requirements will be invited to interview. Interviews normally take place at Furness Academy, Barrow in Furness  and candidates are asked to teach a short lesson to a small group of pupils.\r\n\r\nDue to coronavirus we are likely to offer interviews via Microsoft Teams. You will be asked to submit a lesson plan beforehand and we will ask you about your ideas in the interview.\r\n\r\nThe interview is followed by a subject task and a short task around\r\nfunctional English and Mathematical skills which are completed under time limits.\r\n\r\nWe are looking for the potential to be an excellent trainee, someone who is ready to start training in a school setting from early September. We are also looking for potential employees in our schools.","howSchoolPlacementsWork":"You will complete placements in two partner schools. The first placement will begin early in September, an excellent time to see how rules and routines are established at the start of the academic year. You will start with focused lesson observations across the whole school before you join your subject department and begin to plan teach parts of lessons. After a few weeks you will be planning and delivering whole lessons, building up to approximately 7 hours per week by Christmas. \r\n\r\nThe second placement begins after Christmas in a different school which will give you a contrasting experience and broaden your professional development. Again, you will gradually increase your teaching timetable and for the last few weeks will be full time in school, teaching up to 12 hours per week at that point.\r\nPlacements are selected for you on the basis of high quality mentoring, strong subject departments, contrasting schools and reasonable commuting distance. We work with a wide range of schools located throughout South Cumbria and North Lancashire.\r\n\r\nOn both placements you will teach the full 11-16 age range in your subject. \r\nThere may also be opportunities to spend some time in other partner schools and settings as training needs arise. There will be additional opportunities to experience primary education and sixth form education on the programme. \r\n","personalQualities":"We are looking for people who are ready to go straight into school and this model suits trainees who are able to learn as they go along and incorporate their own experience into this learning process. Successful applicants will have an understanding of the professionalism and resilience needed to become a teacher and to be reflective learners. A real commitment to a career in teaching, a love of their subject and positive attitude towards young people are essential qualities.","otherRequirements":"All applicants who are successful at interview will need the following before they can start:\r\n\r\n-\tDBS and barred list check\r\n-\tMedical check\r\n\r\nIt is important that you have a good awareness of what the role of a teacher involves so that you can be sure it is the right career choice for you. We offer school experience for people at all stages of this career decision, including after interview, in order to support you with this.\r\nWe welcome applicants of all ages, from university graduation to mature career changers.\r\n\r\n","status":1,"createdAt":"2021-07-06T10:50:07.748Z","updatedAt":"2021-10-01T14:13:30.464Z","canSponsorStudentVisa":"no","cycle":"2024"}
