{"id":"3adcddfc-075f-48fd-9698-78d554c7f538","name":"Music","code":"2W8D","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"24311bef-8673-41fb-933c-53f887fb6976","code":"W3","name":"Music"}],"locations":[{"id":"89d386d9-357d-44d4-980f-21c5664b18a0","name":"Sacred Heart High School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"917facc1-82bb-4a00-a765-a1522edcb916","code":"2BA","name":"Sacred Heart Newcastle SCITT"},"profPost":"PG","degreeGrade":"1","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feesInternational":10000,"aboutCourse":"Overview:\r\n\r\nThis course will provide you with over 40 days of professional training together with 30 weeks of in-school work experience. Your time will be split across two contrasting school experiences.\r\n\r\nHow you'll be assessed:\r\n\r\nYou will be assessed both inside the classroom as a practitioner and from associated written tasks such as reflective journals and mentor records.\r\n\r\nWorkload:\r\n\r\nYou will attend school as if an employee, typically 8.30 to 4.30pm each day. You will submit two evidence files to demonstrate that you have met the Teachers' Standards at the end of the course (June).\r\n\r\nLocation: \r\n\r\nTraining is at Sacred Heart Catholic High School, other schools in the area provide additional inputs and you will also need to travel to your allotted host and second school placement over the course of the year. In addition, as part of your ePGCE you will attend 10 days at Newcastle University campus.","interviewProcess":"Typically an interview will be at Sacred Heart SCITT for Secondary and Primary applicants. Although on occasion you may be asked to attend an interview at one of our partner schools. \r\n\r\nYou will be interviewed by a senior member of the SCITT team, together with a senior leader from the Primary or Secondary phase (as appropriate).\r\n\r\nInterviews always include: \r\nA panel interview\r\nPreparing a lesson or activity in advance\r\nA written task\r\nAn interaction task with students\r\n","howSchoolPlacementsWork":"September to December - you will be placed in your 'host' school. This will be either Sacred Heart or one of our partner school within the SCITT with a proven track record of developing high quality ITTs. Our partner schools are located in Newcastle, Gateshead and the nearby towns within Durham and Northumberland. Our partnership has over 30 schools.\r\n\r\nJanuary to March - You will move to a contrasting 'second school placement'. \r\n\r\nReturning to your host school for the remainder of the year.\r\n\r\nPRIMARY: You will teach students in the age range of 5-11\r\nSECONDARY: You will teach students in the age range of 11-16 (unless following a 14-19 curriculum subject)","personalQualities":"We are looking for individuals who have a genuine passion for teaching. In particular we are keen to meet people who can demonstrate a track record in academic excellence and high quality communication skills. \r\n\r\nTeaching is a high challenge - high reward profession, and as such, successful candidates must have the drive and ambition to go the extra mile.","otherRequirements":"You will need to complete:\r\n\r\nLiteracy & Numeracy Tests (Mandatory) \r\nCriminal Records Check (CRB)\r\nProduce all academic certificates if successful (GCSE, A level & Degree)\r\nSubject Knowledge Enhancement (SKE) if applicable\r\n\r\n","status":1,"createdAt":"2021-07-06T10:52:25.765Z","updatedAt":"2021-07-20T09:56:09.537Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
