{"id":"2649306e-4cfe-45aa-ace3-ea51a91a1c37","name":"History","code":"24SJ","qualification":"pgce_with_qts","startDate":"2024-07-31T23:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"5a3609a0-5bbb-4377-b919-5d89932ab622","code":"V1","name":"History"}],"locations":[{"id":"e963033d-00e9-476d-afeb-3e3ff4f71063","name":"United Teaching Essex","isPublished":"N","status":"N","vacancies":"F"},{"id":"c3fa2db6-0b11-4457-8a52-4b8b61344c41","name":"Paddington Academy","isPublished":"N","status":"N","vacancies":"F"},{"id":"b71ca4aa-d461-4112-83cd-54fc2c584475","name":"United Teaching Oxfordshire","isPublished":"N","status":"N","vacancies":"F"},{"id":"7a255d4f-b90d-48c1-b1c6-45f6c6046980","name":"United Teaching Kent","isPublished":"N","status":"N","vacancies":"F"},{"id":"1eb92800-7bf7-4c8e-9e49-b166e5ad7142","name":"United Teaching London - Secondary","isPublished":"N","status":"N","vacancies":"F"},{"id":"5e99747a-284b-4195-9434-f145be22ebbe","name":"United Teaching Hampshire","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"5d642eeb-33f4-42fc-941a-5319b0e3dd55","code":"1A9","name":"United Teaching National SCITT"},"profPost":"BO","english":"2","maths":"2","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":null,"aboutCourse":"Trainee development is overseen by our outstanding lead school, Paddington Academy in London, with regional training hubs across England from Carlisle to Bournemouth.\r\n\r\nBefore undertaking the course, you will be required to attend our Summer Institute which will be held between the 5th – 9th July 2021. The Summer Institute is an intensive programme designed to prepare you to hit the ground running in September.  Sessions will be a mixture of online sessions and face-to-face contact with the United Teaching team, depending on government guidance.\r\n\r\nWhat do our trainees and graduates say about our programme? \r\n\r\n[Watch this video](https://www.youtube.com/watch?v=gOu0nwTsAnQ) to see one trainee’s journey with United Teaching\r\n\r\n“In my view there is no better preparation for a career in teaching than that provided by United Teaching.” – Mark\r\n\r\n“In my past career I was bored. With United Teaching I learn something new every day, am pushed, am supported and for the first time ever I don’t dread Mondays!” – Eliza\r\n\r\n“My professional and subject mentors have made me feel that they are both committed to my success and to improving my teaching practice. The level of support and training I’ve received has been outstanding. I feel fully at home at my school and appreciate all the opportunities I’ve been given to contribute to curriculum discussion.” – Emma\r\n","interviewProcess":"If you are shortlisted, you will be invited to attend the first stage of our assessment process, which will be a Skype interview including a teaching task to a panel of two members of the United Teaching team.\r\n\r\nIf you are successful, you will be shortlisted for the second stage of assessment. This will be an interview with the headteacher or senior leader of your chosen placement school.\r\n\r\nYour offer will be conditional on you: \r\n\r\n* Gaining the degree qualification\r\n* Having GCSE Maths and English (and Science for primary education)\r\n* Having clear identity and DBS checks","howSchoolPlacementsWork":"When you apply to us, you have the option to express a preference in where you would like to be placed if successful. As a national SCITT, we place trainees in a large number of schools across England.\r\n\r\nDuring the assessment process, we will ask you about your flexibility in choice of location. \r\n\r\nWe endeavour to place you in your first choice of school. If this is not possible we will seek alternatives that work for you. \r\n\r\nWe always seek to ensure minimum travel times for trainees between home and school. \r\n\r\nOnce you have secured an offer for your main placement school, you are guaranteed a minimum of 120 days school based experience there. In addition, you will also partake in a 4 week second school placement. \r\n\r\nWe offer primary (5-11) and secondary training courses (11-16).","personalQualities":"Teaching is more than just a career – it is a vocation which leaves a tremendous legacy.  It is a unique opportunity to be unashamedly passionate about your favourite subject, to develop and encourage aspirations in children and to lead with creativity and enthusiasm every step of the way.  \r\n\r\nTeaching changes lives.   \r\n\r\nWe are looking for someone that:\r\n\r\n* never stops learning  \r\n* actively seeks feedback  \r\n* is never too proud to ask for help \r\n* has high expectations of themselves and their students \r\n* wants to be part of a school community \r\n* is an effective and compassionate communicator\r\n","otherRequirements":"* Clear identity and DBS checks \r\n* A high level of numeracy and literacy ","status":2,"createdAt":"2021-07-06T10:56:06.263Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"Unqualified Teacher Pay Scale - Point 1 "}
