{"id":"40b2c00f-d2bf-4364-aadb-e9085a2bae5b","name":"Primary","code":"AE45","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"P","ageRange":"3_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"87c8b4e5-341e-471d-98ee-c9e07663790a","name":"Main Site","isPublished":"Y","status":"R","vacancies":"P"}],"trainingProvider":{"id":"9648ada6-05fa-4f95-8370-81ec02b3be7f","code":"S25","name":"The Shire Foundation"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"Candidates should use a third party for this.  We are able to suggest suitable organisations.","courseLength":"TwoYears","feesUK":10000,"feeDetails":"Course fees are payable as £5,000 per academic year.","aboutCourse":"This is a two year, part time Post Graduate Certificate in Education course (PGCE), validated by the University of Buckingham. Training covers the primary age range 3-11. On meeting all of the Teachers' Standards you will be awarded Qualified Teacher Status (QTS). On successful completion of the academic course work you will be awarded 60 credits at Masters level. \r\n\r\nWe also offer the opportunity to follow a specialism option in mathematics, music, PE or science. \r\n\r\nTrainees will attend the course for 3 days a week (Monday - Wednesday), across the 2 years.  Trainees  will complete  a total of 24 weeks of training within a school setting, undertaking teaching practices in two consecutive age phases and also school-based training. \r\n\r\nIn year 1 trainees will undertake a mixture of centre-based and school based training.  This will include a formally assessed placement within their preferred age phase. Centre-based training focuses on  the core and foundation curriculum areas and professional studies. This training is based largely at Hillborough Junior School in Luton. Sessions also take place in other settings, including partnership schools and a special school. In addition you will have the opportunity to focus on the areas of special educational needs and developing early reading through directed placements. All centre-based training takes place during the school day (9:15am - 4pm).\r\n\r\nYear 2 will focus predominantly on school-based training, with two formally assessed teaching practices taking place.  There will be some tutorials at the Shire base.  Trainees will also complete their academic assignments within this year.  You will be expected to attend school for the normal hours expected of a teacher, to allow you to meet with staff, attend relevant training and meetings, assess learning and prepare for lessons.  This will vary across placement schools but is likely to be at least 8:15am - 4:30pm.\r\n\r\nCentre-based tutors and the training managers are on-hand to offer guidance and support. Our Learning Platform provides a channel of communication as well as a range of support materials. Being based at our lead school allows trainees opportunities to work with teachers and pupils as an integral part of their centre-based training. \r\n\r\nShire has always been a school-centred provider, managed by head teachers, with training provided by outstanding current primary practitioners. This ensures that training is up-to-date and is relevant to current practice within schools. \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n","interviewProcess":"The interview day takes place at The Shire Foundation and comprises of: \r\n\r\n1.  Planning and delivering a short teaching session with a group of children;\r\nYou will be assessed on your ability to engage the children; manage behaviour and make effective use of resources to enable learning to take place. \r\n\r\n2. Written report; \r\nFollowing this taught session you will be asked to write a short reflective report on the learning that has taken place. There will be a 30 minute time limit for this task. You will also be graded on your standard of written English. \r\n\r\n3. Presentation; \r\nAfter you will be asked to make a presentation to the interview panel and other candidates, on a current educational issue.  It must be no longer than 10 minutes in length. PowerPoint facilities will be available. \r\n\r\n4. Interview; \r\nAfter the presentation there will be the formal interview with 2 panel members in which you will be asked a series of questions relating to your suitability for the PGCE route. You will be assessed on the quality and relevance of your responses to the questions. \r\n\r\n5. Subject Knowledge Tests; \r\nYou will also complete a written task focussing on your fundamental English skills.  An online assessment in fundamental mathematics will be completed prior to interview.\r\n\r\n","howSchoolPlacementsWork":"The Shire Foundation takes responsibility for organising placements for trainees on this route.  We work predominantly with schools located within Luton, but are willing to work with other schools within a 30 mile radius of our lead school.\r\n\r\nTrainees complete assessed teaching practices within 2 schools and within 2 consecutive age phases.  These can be selected from EYFS (nursery school or a reception class), KS1, Lower Key Stage 2 (Years 3 and 4) or Upper Key Stage 2 (Years 5 and 6).  Trainees also complete a Taster Week in another age phase and also a 4-day placement within a special school setting.\r\n\r\nYou will complete a 25 day teaching practice in your base school during Year 1, and six weeks in both chosen age phases in Year 2.  Further visits to your schools will also be completed throughout the 2 years, allowing you to observe good practice, work with groups/individuals and prepare for your teaching practices.\r\n\r\nThe course is personalised to take account of any previous experience in school, but in general the expectation is that in Year 1 you will start  by teaching groups of children, building up to 50% whole class teaching in the final weeks of Year 1.  In Year 2, you will build up to 50% of the lessons in the consecutive age phase.  In the final teaching practice, you will build your teaching up to 80% of the timetable.\r\n\r\nYou will be allocated a mentor within your teaching practice schools, who will oversee your training and development over the course of each training year.  They will meet with you for at least an hour on a weekly basis, as well as observing your teaching, in collaboration with other members of the school staff. At the end of the course you will be assessed against the Teachers' Standards through the submission of an evidence portfolio and a final assessment interview will take place at the end of Year 2.\r\n\r\nShire will nominate a Quality Assurance Tutor who will support and monitor your progress.  They will spend a day  visiting you within your teaching practice schools.\r\n\r\n\r\n\r\n\r\n","personalQualities":"Command of the English language\r\nTrainees must demonstrate an ability to communicate clearly and grammatically in spoken and written English.\r\nA strong desire to impact positively on the learning of pupils within a nursery or primary school setting.","otherRequirements":"Assessments of fundamental English and mathematics will be undertaken at interview.  Prior to the award of QTS,  shortfalls must be addressed by the trainee.\r\n\r\nPrior experience in school is not required.  However, where candidates have been able to gain experience in schools, Shire might find references from these schools  a helpful part of our R&S process.\r\n\r\nDisclosure and Barring Service/Medical\r\nWe are committed to safeguarding the welfare of children. All applicants who are offered a training place will be required to undertake a Disclosure and Barring Check and a medical check prior to the start of their practice in schools.","status":1,"createdAt":"2021-07-06T10:51:10.071Z","updatedAt":"2021-09-20T11:35:25.668Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
