{"id":"06706fdd-716e-4005-ad44-e734f96c2b7e","name":"Primary","code":"X100","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"6724aa44-b4d2-4dfc-9ac3-fe9621227ff7","name":"St Mary's University, Twickenham, London","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"ef172d85-20e4-4aa2-96d0-9e3ae81f526d","code":"S64","name":"St Mary’s University, Twickenham"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"You will need to have two out of the three highlighted GCSE in place at application.\n\nOne of the three highlighted GCSEs can be missing/pending at application but must be confirmed at the appropriate level before the course starts.","courseLength":"OneYear","feesUK":9250,"feesInternational":12950,"feeDetails":"\r\n\r\nHome/EU Tuition Fee of £9250 is subject to change based on approved  Fee changes.\r\n For further details - please visit the University website pages on Fees and Student Finance:\r\n\r\n(https://www.stmarys.ac.uk/student-finance/postgraduate/tuition-fees.aspx)\r\n","financialSupport":"St. Mary's University Alumni are able to receive a 10% discount on the PGCE Tuition fee:\r\n\r\n(https://www.stmarys.ac.uk/student-finance/postgraduate/alumni-discount.aspx)\r\n\r\nInternational students may be able to apply for a St. Mary's University International Scholarship: (https://www.stmarys.ac.uk/international/why/scholarships.aspx)","aboutCourse":"St. Mary's University has been graded by Ofsted to be \"Outstanding\" for  Primary and Secondary Initial Teacher Education programmes (February 2019). Our PGCE Primary programme offers  excellent academic and pastoral care for trainees which is reflected in high programme completion rates and levels of students' achievement. A highly successful partnership has been established between the St. Mary's University Institute of Education and a range of partner schools to provide initial teacher education, leading to Qualified Teacher status (QTS) in the primary phase. The enthusiasm, expertise and professionalism of all  staff in support of these outcomes, including the development of students' capacity to reflect on and analyse their own practice, is widely recognised.\r\n\r\nOur course tutors are all skilful, qualified teachers themselves, with many years of successful teaching experience in the state sector and higher education.\r\n\r\nSuccessful completion of the Primary PGCE programme will result in the award of a Post Graduate Certificate of Education  with 60 Masters Credits and Qualified Teacher Status.\r\n\r\nThe opportunity to study for the Catholic Certificate in Religious Studies (CCRS) is also available.\r\n\r\nThe programme structure incorporates a balance of learning experiences in University and schools. You will develop discrete subject knowledge, understanding and skills across the full range of core subjects, PE, RE and computing, alongside foundation subjects. Professional Studies underpin the pedagogy and practice of being a teacher, including themes of managing behaviour for learning, SEND, lesson planning for progression and working with children in challenging circumstances.\r\n\r\nModules for Masters support your development across all areas. \r\n\r\nThe PGCE Primary course demands engagement, commitment, participation and self-motivated study. Strong academic support is readily available from course tutors.\r\n\r\nThe course runs over three school terms from early September to early July, with University campus and online sessions five days a week and school -centred learning in partnership placements. The typical day at University starts at 9am and finishes at 4pm or 6pm.\r\n\r\nAn optional additional 30 Masters credits can be undertaken through our Masters Summer School prior to starting your NQT year.\r\n\r\nWe have a very successful Newly Qualified Teacher (NQT) employment record after the course, with over two thirds of our student teachers beginning their teaching career in one of the two schools in which they trained and many gaining their first job in one of our partner schools.\r\n\r\nIn 2018,  98% of primary PGCE trainees secured a teaching post on completion of the programme.\r\n","interviewProcess":"Once we are confident you have met the course entry requirements, we carefully examine your personal statement. This is your opportunity to convince us that you have seriously thought through your journey into teaching in terms of motivation and a genuine understanding of what being a teacher really means. You will almost certainly find it helpful to refer to prior learning and classroom observation experiences and reflect on  what you saw, heard or experienced. It is also your opportunity to connect your prior academic and/or work experiences to the skills and attitudes required for teaching. We want to clearly hear from you some thoughtful consideration of why you believe you will make a great teacher. Do this successfully and we will invite you for interview.\r\n\r\nAt the  interview, we want to get to know you and for you to get to know us and the PGCE Primary course at St. Mary's University.\r\n\r\nInterviews will be online for 2021 programmes.\r\n\r\nPrior to your interview, you will have the opportunity to hear a presentation from the Programme Director  explaining the structure of the course, school placements, the Enhancement Development placement, Masters Modules and assessments. You will also have the opportunity to have a virtual tour of the campus and view the excellent facilities that St. Mary's University offers its students and trainee teachers.\r\n\r\nWe look forward to meeting you and supporting you to become an Outstanding teacher for primary school children. \r\n\r\nCome & meet us at a monthly online Open Events! https://www.stmarys.ac.uk/open-events/upcoming.aspx\r\n","howSchoolPlacementsWork":"You will complete  assessed school placements during the PGCE Primary programme in order to meet the Teachers' Standards. School placements are arranged by the Institute of Education Partnership team and the schools selected are based on your home/residential address.  \r\n\r\nDuring your placements, you will be guided from working with small groups of pupils alongside a class teacher towards taking responsibility for whole class teaching.\r\n\r\nAn experienced teacher acts as mentor during the school placement and contributes to your overall assessment as a new teacher.\r\n\r\nAt St Mary's University, we have the strongest commitment to student teacher support, regularly visiting student teachers in school  over the duration of the course. We see tutors retaining contact with student teachers while they are school-based, away from University as a major factor in our support success. The consistent support available for students is, we think, outstanding.\r\n\r\nIn addition, we offer our PGCE Primary trainees an \"Enhancement Development Placement\" - our trainees choose and arrange this classroom placement. It can be far away or \"just around the corner\" - you get to choose! You will be able to focus on the targets identified at the end of your first assessed placement and develop the  skills and knowledge to meet them with confidence.\r\n\r\nSt. Mary's University is in partnership with over 700 schools - many of our trainees go on to become NQT's in these partner schools.","personalQualities":"During the interview and selection process, you will take part in  an ONLINE interview and discussion  that will allow you to evidence that you have thought carefully about your motives for becoming a teacher and can demonstrate that you have some emerging capability to reflect on what being a teacher means. The interview will be recorded in line with GDPR compliance.\r\n\r\nWe are looking for candidates who can demonstrate a genuine passion for teaching, working with and supporting children and an understanding of the resilience needed for  teaching.\r\n","otherRequirements":"School observation\r\n\r\nAt St Mary's University, we would like all applicants to have made a fully informed decision about considering joining the teaching profession. As part of that decision making process, spending some time in school(s) observing what teachers do and beginning to give some consideration to how they manage learning, can be really insightful and informative. If this is difficult to arrange, review the resources on: [https://www.thenational.academy/]\r\n\r\nDBS & Fitness to Teach Checks:\r\n\r\nSuccessful completion of a physical and mental Fitness to Teach and a satisfactory Disclosure and Barring Service (DBS) check are also required for teacher training.\r\n","status":1,"createdAt":"2021-07-06T10:53:49.044Z","updatedAt":"2021-09-07T09:19:22.703Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
