{"id":"47d1039a-84f9-402b-bfe9-c75288f85959","name":"Primary - Glyndwr University","code":"3D75","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"73a2b271-9e44-4031-b36a-18ba8eee58d8","name":"Glyndwr University","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"ef172d85-20e4-4aa2-96d0-9e3ae81f526d","code":"S64","name":"St Mary’s University, Twickenham"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"Grade 4 (C) or above in English, maths and science, or equivalent qualification\n\nCandidates with pending GCSEs will be considered Equivalency tests will be accepted in English, maths or science.\n\nYou will need to have two out of the three highlighted GCSE in place at application.\n\nOne of the three highlighted GCSEs can be missing/pending at application but must be confirmed at the appropriate level before the course starts.","courseLength":"OneYear","feesUK":9250,"feeDetails":"https://www.stmarys.ac.uk/postgraduate-courses-london/pgce-primary/wrexham-glyndwr/primary-pgce-wrexham-glyndwr.aspx\r\n\r\n","aboutCourse":"\r\nThe St. Mary's University PGCE Primary programme  leading to Qualified Teacher status (QTS) in the primary phase is available at Glyndwr University,Wrexham. \r\n\r\nGlyndwr University, Wrexham hosts St. Mary's University PGCE Primary students in Wrexham, with school placements in England.\r\n\r\n\r\nSt. Mary's University, Twickenham has been graded by Ofsted to be \"Outstanding\" for Primary and Secondary Initial Teacher Education programmes (February 2019). The  PGCE Primary programme offers excellent academic and pastoral care for trainees which is reflected in high programme completion rates and levels of students' achievement. A highly successful partnership has been established between the St. Mary's University Institute of Education and Glyndwr University, Wrexham. \r\n. ","interviewProcess":"Once we are confident you have met the course entry requirements, we carefully examine your personal statement. This is your opportunity to convince us that you have seriously thought through your journey into teaching in terms of motivation and a genuine understanding of what being a teacher really means. You will almost certainly find it helpful to refer to prior learning and classroom observation experiences and reflect on the implication of what you saw, heard or experienced. It is also your opportunity to connect your prior academic and/or work experiences to the skills and attitudes required for teaching. We want to clearly hear from you some thoughtful consideration of why you believe you will make a great teacher. If you can do this, we will invite you for interview.\r\n\r\nAt the interview- we want to get to know you and for you to get to know us and the St. Mary's University PGCE Primary course at Glyndwr University, Wrexham.\r\n\r\nFor details of the interview process - please contact the PGCE Primary team at Glyndwr University, Wrexham.","howSchoolPlacementsWork":"You will complete assessed school placements during the PGCE Primary programme. School placements are arranged by Glyndwr University. \r\n\r\nDuring your placements, you will guided from working with small groups of pupils alongside a class teacher towards taking responsibility for whole class teaching.\r\n\r\nAn experienced teacher acts as mentor during the school placement and contributes to your overall assessment as a new teacher.\r\n\r\nWrexham Glyndŵr University are partners with over 160 schools in England and Wales that support our training programme. During your placements, you will be guided from working with small groups of pupils alongside a class teacher towards taking responsibility for whole class teaching.\r\n\r\nThe Enhancement Development placement of your choice - could be in a SEND setting, Secondary, Welsh medium, or early years setting in England or Wales. This is a self-assessed placement and is measured against the targets set by you and your Academic Tutor from your first school experience. This is an opportunity to work in schools or educational settings to further enhance your skills in a variety of ways and incorporate one or more of the Teachers' Standards.","personalQualities":"During the interview and selection process, you will take part in an ONLINE interview and discussion  that will allow you to evidence that you have thought carefully about your motives for becoming a teacher and can demonstrate that you have some emerging capability to reflect on what being a teacher means. The interview will be recorded in line with GDPR compliance.\r\nWe are looking for candidates who can demonstrate a genuine passion for teaching, working with and supporting children and an understanding of the resilience needed for  teaching.","otherRequirements":"School observation experience\r\n\r\nAt Glyndwr University, we would like all applicants to have made a fully informed decision regarding joining the teaching profession. As part of that decision making process, spending some time in school, observing what teachers do can be really insightful and informative. Reviewing  teaching and learning resources will also be helpful: https://www.thenational.academy\r\n\r\nAssessed school placements on the Glyndwr course will take place in England and Wales.\r\n\r\n\r\nDBS & Fitness to Teach Checks:\r\n\r\nSuccessful completion of a physical and mental Fitness to Teach and a satisfactory Disclosure and Barring Service (DBS) check are also required for teacher training.\r\n \r\n\r\n\r\n\r\n\r\n","status":1,"createdAt":"2021-07-06T10:53:48.984Z","updatedAt":"2021-09-27T09:06:25.959Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
