{"id":"a2bbc760-18cd-48be-aa8f-aadd200f5111","name":"English","code":"3CQK","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3aed1aa8-ae46-4b68-92bb-a6cc20655c59","code":"Q3","name":"English"}],"locations":[{"id":"6724aa44-b4d2-4dfc-9ac3-fe9621227ff7","name":"St Mary's University, Twickenham, London","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"ef172d85-20e4-4aa2-96d0-9e3ae81f526d","code":"S64","name":"St Mary’s University, Twickenham"},"profPost":"BO","degreeGrade":"1","english":"1","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Please check the university website for details on our own GCSE equivalence and recognised alternatives - https://www.stmarys.ac.uk/application-process/pgce/home/gcse-equivalents.aspx","courseLength":"OneYear","feesUK":9250,"feesInternational":13500,"feeDetails":"The 'Home' tuition fee of £9250 is an expectation subject to change based on approved fee changes.\r\n\r\nThe previous designation of 'Home and EU' has been changed by the government. The present understanding is that 'Home and Irish' students have access to the 'Home' fee. Some EU citizens with a permanent right to remain in the UK may also have access to 'Home' fees.\r\n\r\nFor further details - please check the government website for teacher training funding. You can also find information on the University website pages on Fees and Student Finance: (https://www.stmarys.ac.uk/student-finance/postgraduate/tuition-fees.aspx)","financialSupport":"St. Mary's University Alumni can receive a discount on the PGCE Tuition fee: (https://www.stmarys.ac.uk/student-finance/postgraduate/alumni-discount.aspx)\r\n\r\nInternational students may be able to apply for a St. Mary's University International Scholarship: (https://www.stmarys.ac.uk/international/why/scholarships.aspx)","aboutCourse":"St. Mary's University has been graded \"Outstanding\" by OFSTED\r\n\r\nCome and meet us. The university runs 'Getting into Teaching' open events every month, where you can often chat with the subject tutor. Book a place via https://www.stmarys.ac.uk/open-events/pgce.aspx\r\n \r\nSome course details are below, and further information is available via\r\nhttps://www.stmarys.ac.uk/postgraduate-courses-london/pgce-secondary-english/ \r\n\r\nWe wish to recruit well-qualified graduates who are enthusiastic about teaching English to secondary school pupils. We are looking for applicants who can embrace creativity and innovation in their teaching whilst also seeking to meet the diverse needs of a range of children.   \r\n\r\nTeaching English is a wonderful profession where you are able to facilitate the development of a range of communication skills and the course will support you to develop literacy in all children, foster a passion for reading and facilitate critical analysis. You should be receptive to learning via collaborative working as much emphasis in your training on experiential learning and sharing of good practice. \r\n\r\nThe course is planned and delivered by course tutors with a strong teaching and academic background.  Additional sessions are also delivered by specialist practitioners.  \r\n\r\nThe course prepares you to teach English at key stages 3 and 4 in contrasting schools, with opportunities for you to explore provision at key stage 5 and key stage 2. The university tutor and link tutors work closely with you and your mentor whilst you are on school placement offering a dual model of support. \r\n\r\nAssessment is completed through formative and summative assignments in university, and through an assessment profile on school placement which measures your progression against the Teachers’ Standards. In addition you will complete a portfolio of evidence to exemplify your best practice and which complements the assessment profile. \r\n\r\nWe have an online 8 week Subject Knowledge Enhancement course for applicants who need to deepen their own understanding of English before starting on the PGCE course. We would advise you to apply early if you might be in this position. \r\n\r\nIn general terms and throughout the course, your progress is monitored and supported by both University and Partnership school staff who have developed successful working relationships with previous cohorts. \r\n\r\n\r\n\r\n","interviewProcess":"Once we are confident you have met the course entry requirements, we carefully examine your personal statement. This is your opportunity to convince us that you have seriously thought through your journey into teaching in terms of motivation and a genuine understanding of what being a teacher really means.\r\n \r\nYou will almost certainly find it helpful to refer to any prior learning and classroom experiences and reflect on the implication of what you saw, heard or experienced.\r\n\r\nWithin your statement, it is often helpful to connect your prior academic and/or work experiences to the skills and attitudes required for teaching.\r\n\r\nYour interview will be conducted on-line. We will want to get to know you a little better and for you to get to know us. The process is likely to include\r\n\r\n - you give a short presentation (details will arrive with your invite to interview)\r\n\r\n - an assessment of your subject knowledge\r\n\r\n - an assessment of your competency in English\r\n\r\n In advance of you interview you will be sent links to short informative videos that explain the structure and other key factors of the programme.\r\n\r\nIn making an application to St. Mary’s, applicants provide their consent for the interview to be recorded.\r\n\r\nWe look forward to meeting you and supporting you to become an outstanding teacher of children.\r\n\r\nSt Mary's is graded 'Outstanding' by OFSTED","howSchoolPlacementsWork":"St. Mary's University is in partnership with over 150 schools - many of our trainees go on to become NQT's in these partner schools.\r\n\r\nYou will gain experience in TWO different school settings through the course. You will be school-based for a minimum of 120 days.\r\n**** These government expectations are temporarily suspended ****\r\n\r\nWe take into account your personal accommodation postcode when looking at placements. Students with declared disabilities will have these taken into account when allocating school placements.\r\n\r\nAcross your training you will have experience of working in Key Stage 3 and 4. There is usually the opportunity to experience post 16.\r\n\r\nAn experienced teacher acts as mentor during the school placement and contributes to your overall assessment as a new teacher.\r\n\r\nWe have the strongest commitment to student teacher support, regularly visiting student teachers in school over the duration of the course to quality assure the placements.\r\n\r\nWe see tutors retaining contact with student teachers while they are school-based, away from University as a major factor in our support success. The consistent support available for students has been recognised by Ofsted in 2011 and again in 2019 as outstanding.","personalQualities":"During the interview and selection process, you will have a number of opportunities for you to evidence that you have thought carefully about your motives for becoming a teacher and can demonstrate that you have some emerging capability to reflect on what being a teacher means.\r\n\r\nWe are looking for candidates who can demonstrate a genuine passion for teaching, working with and supporting children and an understanding of the resilience needed for teaching.\r\n","otherRequirements":"School observation - Ideally, we would like all applicants to have made a fully informed decision about considering joining the teaching profession. As part of that decision making process, spending some time in school(s) observing what teachers do and beginning to give some consideration to how they manage learning, can be really insightful and informative.\r\n\r\nDBS check - Successful completion of a physical and mental fitness to teach and a Satisfactory Disclosure and Barring Service (DBS) check are also required for teacher training.","status":1,"createdAt":"2021-07-12T13:49:07.035Z","updatedAt":"2021-10-06T12:00:50.054Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
