{"id":"d26087fe-456a-403d-a152-406a6471fd4b","name":"Physics","code":"F3X1","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"bf97cd0a-224c-43d3-a021-84143df13e8d","code":"F3","name":"Physics"}],"locations":[{"id":"6724aa44-b4d2-4dfc-9ac3-fe9621227ff7","name":"St Mary's University, Twickenham, London","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"ef172d85-20e4-4aa2-96d0-9e3ae81f526d","code":"S64","name":"St Mary’s University, Twickenham"},"profPost":"BO","degreeGrade":"2","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"no","additionalGcseEquivalencies":"Please check the university website for details on our own GCSE equivalence and recognised alternatives - https://www.stmarys.ac.uk/application-process/pgce/home/gcse-equivalents.aspx","courseLength":"OneYear","feesUK":9250,"feesInternational":13500,"feeDetails":"The 'Home' tuition fee of £9250 is an expectation subject to change based on approved fee changes.\r\n\r\nThe previous designation of 'Home and EU' has been changed by the government. The present understanding is that 'Home and Irish' students have access to the 'Home' fee. Some EU citizens with a permanent right to remain in the UK may also have access to 'Home' fees.\r\n\r\nFor further details - please check the government website for teacher training funding. You can also find information on the University website pages on Fees and Student Finance: (https://www.stmarys.ac.uk/student-finance/postgraduate/tuition-fees.aspx)","financialSupport":"St. Mary's University Alumni are able to receive a discount on the PGCE Tuition fee:\r\n\r\n(https://www.stmarys.ac.uk/student-finance/postgraduate/alumni-discount.aspx)\r\n\r\nInternational students may be able to apply for a St. Mary's University International Scholarship: (https://www.stmarys.ac.uk/international/why/scholarships.aspx)","aboutCourse":"St. Mary's University has been graded \"Outstanding\" by OFSTED\r\n\r\nCome and meet us. The university runs 'Getting into Teaching' open events every month, where you can often chat with the subject tutor. Book a place via https://www.stmarys.ac.uk/open-events/pgce.aspx\r\n \r\nSome course details are below, and further information is available via https://www.stmarys.ac.uk/postgraduate-courses-london/pgce-secondary-science/\r\n\r\nDuring this course we will prepare you to teach Science with Physics using a blend of University based sessions and placements in local partnership schools.\r\n\r\nEach aspect of your training will allow you to develop a deep understanding of the issues related to teaching science and your particular science discipline.\r\n\r\nUniversity-based sessions are held in both classroom and a laboratory setting which offer ample opportunity to develop your knowledge, skills and understanding with the content knowledge itself and its pedagogy.\r\n\r\nPartnership School based training allows you the opportunity to work with experienced classroom teachers who will act as mentors to develop your classroom practice.\r\n\r\nWhile at University, and when in Partnership School sessions, you will attend lectures, seminars, workshops and tutorials in addition to accessing a wide range of on-line resources.\r\n\r\nThroughout the course there is a focus on a range of pedagogical issues which are necessary to become a successful teacher. These include:\r\n\r\n- examples of required practical activities at KS4  (including health and safety);\r\n\r\n- planning and preparing a science lesson;\r\n\r\n-inclusion of all learners (SEND);\r\n\r\n- assessment for learning activities (AfL);\r\n\r\n- managing behaviour for learning within the classroom and laboratory.\r\n\r\nIn most schools there is a need to for all science teachers to teach all three science subject areas up to the age of 14 (KS3) and in some schools this is an expectation up to the age of 16 (GCSE). We cover aspects of all three science areas throughout the course to enhance your suitability for employment in a range of science departments.\r\n\r\nYour progress is monitored and supported by both University and Partnership school staff who have developed successful working relationships with previous cohorts.","interviewProcess":"Once we are confident you have met the course entry requirements, we carefully examine your personal statement. This is your opportunity to convince us that you have seriously thought through your journey into teaching in terms of motivation and a genuine understanding of what being a teacher really means.\r\n \r\nYou will almost certainly find it helpful to refer to any prior learning and classroom experiences and reflect on the implication of what you saw, heard or experienced.\r\n\r\nWithin your statement, it is often helpful to connect your prior academic and/or work experiences to the skills and attitudes required for teaching.\r\n\r\nYour interview will be conducted on-line. We will want to get to know you a little better and for you to get to know us. The process is likely to include\r\n\r\n - you give a short presentation (details will arrive with your invite to interview)\r\n\r\n - an assessment of your subject knowledge\r\n\r\n - an assessment of your competency in English\r\n\r\n In advance of your interview you will be sent links to short informative videos that explain the structure and other key factors of the programme.\r\n\r\nIn making an application to St. Mary’s, applicants provide their consent for the interview to be recorded.\r\n\r\nWe look forward to meeting you and supporting you to become an outstanding teacher of children.\r\n\r\nSt Mary's is graded 'Outstanding' by OFSTED","howSchoolPlacementsWork":"St. Mary's University is in partnership with over 150 schools - many of our trainees go on to become NQT's in these partner schools.\r\n\r\nYou will gain experience in TWO different school settings through the course. You will be school-based for a minimum of 120 days.\r\n**** These government expectations are temporarily suspended ****\r\n\r\nWe take into account your personal accommodation postcode when looking at placements. Students with declared disabilities will have these taken into account when allocating school placements.\r\n\r\nAcross your training you will have experience of working in Key Stage 3 and 4. There is usually the opportunity to experience post 16.\r\n\r\nAn experienced teacher acts as mentor during the school placement and contributes to your overall assessment as a new teacher.\r\n\r\nWe have the strongest commitment to student teacher support, regularly visiting student teachers in school over the duration of the course to quality assure the placements.\r\n\r\nWe see tutors retaining contact with student teachers while they are school-based, away from University as a major factor in our support success. The consistent support available for students has been recognised by Ofsted in 2011 and again in 2019 as outstanding.","personalQualities":"During the interview and selection process, you will have a number of opportunities for you to evidence that you have thought carefully about your motives for becoming a teacher and can demonstrate that you have some emerging capability to reflect on what being a teacher means.\r\n\r\nWe are looking for candidates who can demonstrate a genuine passion for teaching, working with and supporting children and an understanding of the resilience needed for teaching.","otherRequirements":"School observation - Ideally, we would like all applicants to have made a fully informed decision about considering joining the teaching profession. As part of that decision making process, spending some time in school(s) observing what teachers do and beginning to give some consideration to how they manage learning, can be really insightful and informative.\r\n\r\nDBS check - Successful completion of a physical and mental fitness to teach and a Satisfactory Disclosure and Barring Service (DBS) check are also required for teacher training.\r\n","status":1,"createdAt":"2021-07-12T13:49:07.198Z","updatedAt":"2021-10-06T12:00:31.240Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
