{"id":"935511d4-5e3e-46b9-a00e-05d1e80c89c6","name":"Primary","code":"39N9","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"d8d2b9de-e798-48e5-8a0b-713da627bc60","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"e631f80d-3818-4d9e-9788-994cdb44f0e5","code":"2J5","name":"North Staffordshire School Direct"},"accreditedBody":{"id":"0a682589-92ed-447b-b564-6958b3b02b41","code":"S72","name":"Staffordshire University"},"profPost":"PG","degreeGrade":"9","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"This course will run alongside the PGCE at Staffordshire University. Our distinctive feature from the core provision is that you will always be placed within our locality. With North Staffordshire School Direct we very much operate on a \"grow your own\" basis, meaning that we are a medium sized alliance with a group of closely linked headteachers who look to our own School Direct provision when employing.  We also have links to many other schools in the locality and feel that we are personal as a smaller course and really get to know our students. Employability rate is high within our provision.\r\n\r\nYou will be assessed on the course based upon your teaching. You can only pass this course by your teaching being assessed as \"good\" or better. This is obviously why you are interested in being a teacher and this is what the heart of the course is about- being a good teacher! You will also be assessed on how to provide assessment for children through learning how to collect evidence for children's work and at times in writing essays related to the skill of teaching and learning.","interviewProcess":"Should you be selected for interview, you will be interviewed at Staffordshire University. This will be a face to face interview with usually two interviewers about your thoughts on teaching and what brings you to the profession. You will also be asked to complete a short piece of writing and to comment on a lesson by video which you will be shown on the day, giving your views on how the lesson was conducted successfully.\r\n\r\nFollowing successful completion of this, you will be invited into one of our partner schools to share a book with a group of children. This is not an assessment but will give you an insight into our course.","howSchoolPlacementsWork":"You will have to placements- one in Key Stage 1 (age 5-7) and one in Key Stage 2 (age 7-11). Each placement will be in a different school. You will also be asked to spend a couple of days in Early Years at the start of the course so that you begin to understand the children's starting point as well as a couple of days in a secondary school observing so that you can see what we are aiming for, for the pupils. Your placements will be more or less equal in time spent and you will have a mentor in each school as well as a university based mentor. We aim for candidates to only travel around half an hour to placement but do so say this can at times be slightly higher.\r\n\r\nOur placement schools are all handpicked as schools that we have strong relationships with so that there is easy communication between us all.","personalQualities":"We simply ask for a motivated and enthusiastic individual who has a passion for teaching. ","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:46:39.505Z","updatedAt":"2021-09-23T09:27:28.995Z","canSponsorStudentVisa":"yes","cycle":"2024"}
