{"id":"ae53fbb3-f2d6-426d-90f5-274272f78d9d","name":"Primary","code":"2XZ2","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"B","ageRange":"3_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"0e362ad3-bb35-4f3d-b773-1ade08f1724b","name":"Whitmore Primary School and Nursery","isPublished":"Y","status":"R","vacancies":"B"},{"id":"662af350-422f-4cc4-9f7d-ead140eab744","name":"Felmore Primary","isPublished":"Y","status":"R","vacancies":"B"},{"id":"6bd0ac2f-8304-43c6-9795-33ef71fc00fc","name":"St Mary's Church of England Primary School","isPublished":"Y","status":"R","vacancies":"B"},{"id":"4f574aa4-da25-46da-8be1-0a03fa11c386","name":"Cherry Tree Primary School","isPublished":"Y","status":"R","vacancies":"B"},{"id":"fe9b0a6c-b9c9-4611-9cfa-6688b5196159","name":"The Willows Primary School","isPublished":"Y","status":"R","vacancies":"B"},{"id":"5a3d35b0-230a-4083-9220-5d7cfb765a52","name":"Crays Hill Primary School","isPublished":"Y","status":"R","vacancies":"B"},{"id":"ba20e2a1-fafb-4952-9271-f368788dfea9","name":"Merrylands Primary School","isPublished":"Y","status":"R","vacancies":"B"},{"id":"9c6a512b-bd53-4a01-b3d1-bc4bbc177d5c","name":"Fairhouse Community Primary School","isPublished":"Y","status":"R","vacancies":"B"}],"trainingProvider":{"id":"58d08f2a-6e45-4f0c-be28-91c5a99fb04b","code":"2D6","name":"Merrylands Teacher Training Partnership"},"accreditedBody":{"id":"00782614-9301-40e4-8832-9a74cc1bbb07","code":"E75","name":"Essex Teacher Training"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We advise applicants to use one of the two equivalency testing providers listed below.\n\n[Astarteachers.co.uk] (https://www.astarteachers.co.uk/gcse-equivalencies-assistance/)\n\nOR\n\n[Equivalencytesting.com] (https://www.equivalencytesting.com/)","courseLength":"OneYear","feesUK":9150,"feeDetails":"Fees for full time 1 year programme are £9150.\r\n\r\nFees for part-time 2 year programme are £6000 per year.","financialSupport":"MTTP applicants may have the potential to be offered the opportunity of a Tax Free Bursary.  The bursary for this year is £10,000 which consists of 10 monthly payments of £1,000.\r\n\r\nAs well as the potential of a tax free bursary, MTTP  may also offer a 'Golden Handcuff' which includes a 1st July 2022 start date along with an enhanced starting salary depending on experience. You would be expected to stay at the school that has employed you for a minimum of two years.\r\n\r\n","aboutCourse":"Our school-based training programme can be followed either full time  over 1 year or part-time over two years.  Trainees will achieve QTS and be enrolled on a PGCE Programme with the Anglia Ruskin University. \r\n\r\nTraining is majority school-based with some centre-based training. Training is a blend of face to face and online and occurs at various locations across Essex so we take into account your home address to try to keep travelling time to a minimum. \r\n\r\nOur programmes offer you:\r\n* A high percentage of time spent in a school experienced in training trainees\r\n* A high quality professional studies programme\r\n* Personalised support\r\n* Recognition of your previous experience\r\n* A good understanding of, and preparation for, the teaching profession\r\n\r\nOur training gives you:\r\n* Termly visits from your personal external tutor/subject tutor\r\n* Induction before you start\r\n* A professional studies programme which includes training on National Curriculum subjects, behaviour management, inclusion, assessment and SEND (Please note trainees on the Schools Direct routes will undertake some of this training with their host schools)\r\n* Opportunities to meet regularly with other trainees\r\n* Opportunities to observe and work alongside experienced teachers, gradually taking more responsibility for group and class teaching\r\n* Teaching experience across a specified age range: 3-7 or 5-11 years\r\n* Teaching experience in at least two schools\r\n* A comprehensive course handbook outlining all course requirements (online resource)\r\n\r\nIf you wish to train on the part-time School direct programme, this is typically for 3 days a week over the course of 2 years.  The programme is very similar to the one year programme in terms of support and delivery, the only difference being that you will be in school 2 days per week and attend training on 1 day a week.  The majority of centre-based training will take place in Year 1 and you will be enrolled on the PGCE programme in Year 2.\r\n","interviewProcess":"You will be invited to an interview in the lead school or one of our partner schools. This interview could include: an activity with pupils, for example, teaching part of a lesson, or taking a group activity; a pupil panel interview; a written task and a formal interview with a small panel of representatives from the school and wider School Direct partnership. If successful, you will be given a conditional offer of a place to train.","howSchoolPlacementsWork":"Trainees will complete training in two different schools during the course of the year. Typically, trainees spend the autumn term in their host school and then go to a second placement school during the first part of the spring term and then return to their host school for the remainder of the year. Trainees are in school 4 days a week and attend training on the 5th day if on the full time programme and 2 days a week and attend training on the 3rd day if part-time.\r\n\r\nWe endeavour to keep travelling time to a minimum so we will take into account your home address when allocating a school.\r\n\r\nThe programme covers the primary age ranges 3 - 7 or 5 - 11 and you will be teaching within one of these age ranges.\r\n","personalQualities":"MTTP is looking for high quality graduates with a passion for learning who are committed to transforming the lives of you people through education\r\n. We also look for the following attributes within our chosen graduates:\r\n\r\n* Growth Mindset thinking\r\n* Ambition and aspiration for our children\r\n* Reflective and enquiring minds","otherRequirements":"Satisfactory recruitment checks including enhanced DBS, children’s barred list, prohibition order check and reference check.","status":1,"createdAt":"2021-07-06T10:49:52.700Z","updatedAt":"2021-10-08T16:38:07.393Z","canSponsorStudentVisa":"no","cycle":"2024"}
