{"id":"98afb764-bd69-4361-aff8-15fb5a7301d6","name":"Modern Languages (Spanish)","code":"Z056","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"e34fd2a3-a32e-44e9-aea1-666badf3ac03","code":"22","name":"Spanish"},{"id":"ce8523ef-9236-4cd9-b260-d826c7a521b3","code":"ML","name":"Modern Languages"}],"locations":[{"id":"1a6951ba-8802-44ff-afea-0e8d6cc4fe2e","name":"Northgate High School","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"277e47ad-3043-413c-b8bf-6cc6e4d242e5","code":"3C4","name":"Northgate High School"},"accreditedBody":{"id":"b8bcaeed-f311-4867-a1e3-c0fde20809d6","code":"E14","name":"University of East Anglia"},"profPost":"PG","degreeGrade":"1","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"38 weeks","feesUK":9250,"feesInternational":22400,"feeDetails":"For any additional course costs at the University of East Anglia please [visit our website](https://www.uea.ac.uk/about/legalstatements/finance-and-fees/additional-course-fees)","financialSupport":"Find out more about the Financial Support available within our [course pages](https://www.uea.ac.uk/course/postgraduate/pgce-secondary-modern-foreign-languages)","aboutCourse":"Our 38-week, full-time PGCE Secondary Modern Foreign Languages programme will equip you with the skills, experience and knowledge you need to teach Modern Foreign Languages to pupils aged between 11 and 16, with 6th form enhancement. \r\n\r\nOn this course you will develop a range of skills to enthuse pupils and support them in achieving their linguistic potential, and learn about the importance of developing cultural understanding and the impact this can have in shaping young people’s worldviews. \r\n\r\nUpon successful completion of your PGCE, you will graduate with Qualified Teacher Status (QTS) and 90 Master’s credits.\r\n\r\n[Find out more about this course](https://www.uea.ac.uk/course/postgraduate/pgce-secondary-modern-foreign-languages)\r\n\r\n[Sign up for one of our information sessions](https://www.uea.ac.uk/about/school-of-education-and-lifelong-learning/initial-teacher-education/events-and-experience) \r\n","interviewProcess":"Interviews are part of the formal selection process. You will need to present yourself well, come prepared, and dress smartly. Your interview day will include:\r\n\r\n* An introductory talk\r\n* An individual interview\r\n* A written task\r\n* An assessment of your language specialism \r\n\r\nYou may also be asked to complete other relevant tasks such as:\r\n\r\n* Giving a presentation\r\n* A group interview\r\n* Literacy, numeracy and subject knowledge questions\r\n","howSchoolPlacementsWork":"At UEA, the taught programme is the same for university-led and School Direct routes and you will spend the same amount of time in school whichever option you choose. On both routes, school experience takes place in partnership schools across the region. \r\n\r\nOn the School Direct route, you will already know the cluster of schools in which you might have one of your placements when you are offered a place on the course. This does not necessarily mean your placement will be with the lead school and we strongly encourage you to speak to the admissions team regarding the cluster of schools you are considering applying for, as there might be variations. \r\n\r\nDuring the two extensive placements in our partnership schools, you will gain a broad range of practical teaching experience. You will learn to put ideas and theory into practice.\r\n","personalQualities":"Trainees are selected on the basis of their application form, references and an interview. You are encouraged to prepare thoroughly.\r\n\r\nApplication forms should demonstrate strengths in subject and curriculum knowledge, your enthusiasm and commitment to a career in teaching, and the age range for which you have applied.\r\n","otherRequirements":"Prior to submitting your application, we recommend you gain some observational experience in a classroom environment if possible. This will help you gain an up-to-date understanding of how classrooms are managed and how teaching and learning takes place.\r\n\r\nApplicants must also obtain:\r\n* An Enhanced Criminal Records check from the [Disclosure and Barring Service](https://www.gov.uk/government/organisations/disclosure-and-barring-service) \r\n* A satisfactory Health Check. All PGCE trainee teachers must meet the Secretary of State's requirements for physical and mental fitness to teach.\r\n\r\nAll trainee teachers must have the health and physical capacity to teach and not put children and young people at risk of harm.\r\n\r\n","status":0,"createdAt":"2021-07-06T10:56:18.635Z","canSponsorStudentVisa":"yes","cycle":"2024"}
