{"id":"a36fd5ce-5364-41cb-bd17-8a0371526f7d","name":"Primary","code":"4R06","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"TA","fundingType":"apprenticeship","studyMode":"F","ageRange":"3_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"trainingProvider":{"id":"6fc9f92c-10dc-4967-854d-d379d4f0a39a","code":"12K","name":"Diverse Association for Professional Learning (formerly TVTSA)"},"accreditedBody":{"id":"aa023df3-b71e-4249-b9c4-41fca8bd135e","code":"D39","name":"University of Derby"},"english":"3","maths":"3","science":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","aboutCourse":"This course leads to QTS a PGCE and Masters Credits and an apprenticeship.\r\n\r\nThe main placement for this primary experience will be within a special needs primary school setting.\r\n\r\nYou will be trained in a highly supportive, creative, inspirational environment where you will develop the knowledge, understanding and skills needed to deliver high quality teaching and learning. TVTSA schools are committed to Initial Teacher Training and have formed a steering group with partner schools to quality assure and develop the course. The in school mentors are supportive and are able to tailor the course to best suit your development. We pride ourselves in offering a personal service from an experienced dedicated team.\r\n\r\nTrainees work a full academic year in their host school, starting on the school’s first day of term which is usually at the start of September, right through to the end of term which is usually the third week in July, with the following exceptions:\r\n-\tEnrollment will take place at the University of Derby during the first or second week\r\n-\tOne day a week will be reserved for training, this is on a wednesday and alternates between the university of Derby and bespoke training from TVTSA.\r\n-\tTVTSA organise a second placement which will be decided using the candidates post code and ensuring a diverse experience. This is generally within a TVTSA school running from the week before Christmas through to February half term. \r\n\r\nTVTSA also ensure all trainees make use of any remaining wednesdays that are not scheduled for training, this is to be used by the trainee for:\r\n-\tAttending a “wider context programme” which is delivered by  experts within our schools with sessions varying from behaviour management to marking and assessment.\r\n-\tAttending alternative setting experiences organised by TVTSA at a special school, a behaviour referral unit and an English as an additional language environment.\r\n-\tCompleting research and gathering evidence to complete the PGCE assignments\r\n-\tNetworking with the rest of the TVTSA trainees.\r\n","interviewProcess":"Although this course is ran in partnership with TVTSA and Derby University, you will have one interview.\r\n\r\nThis take place at the school/academy that you have chosen to train in on UCAS. It is normally run within two hours and gives candidates a good opportunity to familiarise themselves with the school and the members of staff you.\r\n-\tPupil Panel\r\n-\tTeach a 20min lesson\r\n-\tFormal interview \r\n-       Written assessment by an article review\r\n-       Maths and English short test\r\n\r\nThis primary course's main placement will be within a special educational needs school\r\n","howSchoolPlacementsWork":"Trainees work a full academic year in there host school, starting on the school’s first day of term which is usually at the start of September, right through to the end of term which is usually the third week in July, with the following exceptions\r\n\r\n-\tEnrollment week in September at University of Derby\r\n-\tOne day a week will be training either at the University of Derby or within Local TVTSA schools, this is Wednesdays\r\n-\tTVTSA organise a second placement which will be done using the candidates post code and ensuring a diverse experience. This is generally within a TVTSA school running from the week before Christmas through to February half term. \r\n\r\nTVTSA also guarantee all trainees make use of additional Wednesdays off timetable, this is to be used by the trainee for: \r\n-\tAttending a “wider context programme” which is delivered by the experts within our schools with sessions ranging from behaviour management to marking and assessment.\r\n-\tAttending alternative setting experiences organised by TVTSA at a special school, a behaviour referral unit and an English as an additional language environment.\r\n-\tCompleting research and gathering evidence to complete the PGCE assignments\r\n-\tNetworking with the rest of the TVTSA trainees.\r\n\r\nCandidates select there school using the campus code on UCAS.\r\nTrainees will be in an primary special educational needs setting\r\n","personalQualities":"We are looking for candidates who are enthusiastic and passionate about their subject area or key stage, people who want the very best for our pupils.\r\n\r\nSuccessful candidates will be hardworking, driven and motivated as well as being dedicated to safeguarding and the welfare of our pupils. They need to be committed to helping our students progress to the best of their ability and must fully embrace the ethos of the schools they work in.\r\n","otherRequirements":"Candidates that can discuss experience of working with young people, or supporting, coaching adults in the workplace, sporting environment or clubs would have an advantage. As would candidates who can show the qualities they have and how these could be transferred into the work place.\r\n\r\nAs this course's main placement school will be within a special educational needs setting, we are looking for candidates that have some experience in that field or a can show a passion for working with children with additional needs","status":2,"createdAt":"2021-07-06T10:54:46.814Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024"}
