{"id":"d2bc1e61-fe3b-4831-985d-860883136738","name":"Business Studies","code":"37NW","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"de6477b2-6027-48e6-b9f7-3206774705c2","code":"08","name":"Business studies"}],"locations":[{"id":"1e1b540b-de44-4692-90e9-7d859d64551c","name":"Main Site","isPublished":"N","status":"S","vacancies":"F"},{"id":"f4d40fd6-4040-44f0-834c-09fa5056446b","name":"East Leake Academy","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"6fc9f92c-10dc-4967-854d-d379d4f0a39a","code":"12K","name":"Diverse Association for Professional Learning (formerly TVTSA)"},"accreditedBody":{"id":"d2b7d074-fac9-42c5-a0d3-d5471b35f7d9","code":"N91","name":"Nottingham Trent University"},"profPost":"BO","degreeGrade":"9","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feeDetails":"The fee for UK and EU students is £9250.00 which is the standard rate for postgraduate courses.\r\n\r\nTrainees are entitled to the same financial support as trainees on other postgraduate teacher training courses\r\n\r\nThose from the UK and the EU are eligible for student loans to cover tuition fees and maintenance.\r\n\r\nBursaries are available from the National College for Teaching and Leadership in priority subject areas, this is dependent on your degree level and the subject you wish to teach and the information can be found from the DfE.\r\n\r\nScholarships are available from a number of sources.","aboutCourse":"You will be trained in a highly supportive, creative, inspirational environment where you will develop the knowledge, understanding and skills needed to deliver high quality teaching and learning.  We pride ourselves in offering a personal service from an experienced and dedicated team.\r\n\r\nTrainees work a full academic year in their host school, and are part of the school community from the start - from the first day of term to the last.\r\n\r\nAll of our trainees have Wednesday afternoon off timetable to: \r\n\r\n* Attend a 'wider context programme' which is delivered by  experts within our schools with sessions varying from behaviour management to marking and assessment.\r\n\r\n* Take part in alternative setting experiences at a SEND school, an alternative provision and a local school with a high percentage of EAL pupils (English as an additional language).\r\n\r\n* To complete research and gather evidence to complete the PGCE assignments.\r\n\r\n* To network with other Association trainees.\r\n\r\nThis course leads to QTS, PGCE and Masters Credits.","interviewProcess":"As this course is run in partnership between Diverse Association and Nottingham Trent University, two interviews are required.\r\n\r\nThe university interview will establish the extent at which you are likely to meet the academic requirements of the programme, your commitment and passion for your chosen subject or phase, and the aptitude you have for teaching.\r\n\r\nThe Diverse Association interview will take place at the school you have chosen to train in, and involves the three activities below:\r\n\r\n* Pupil Panel\r\n* Teach a twenty minute lesson\r\n* Formal interview\r\n\r\nBoth parties discuss the outcome of the interview before a place is offered.","howSchoolPlacementsWork":"* This course is school led and the majority of the training year\r\nwill be in your chosen school.\r\n\r\n* One day a week will be spent at Nottingham Trent University, for a maximum of twenty eight days. \r\n\r\n* You will have a six week second placement based on your development needs in the early part of the spring term. \r\n\r\n\r\n","personalQualities":"* You want to make a real difference and your enthusiasm is clear.  \r\n\r\n* You can articulate how you have influenced or positively impacted the lives of others.  \r\n\r\n* You know why you want to teach and can demonstrate your teaching skills. \r\n\r\n* You understand the challenges ahead in your journey to become a teacher.  \r\n\r\n* You know how to grow and learn from making mistakes. \r\n\r\n* You want to be part of the school community and understand the importance of this. \r\n","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:54:46.144Z","updatedAt":"2021-09-30T09:40:29.841Z","canSponsorStudentVisa":"yes","cycle":"2024"}
