{"id":"d75fc953-b3d4-4e1a-8669-7f52c76922a8","name":"Primary with SEND","code":"AT12","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"yes","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"trainingProvider":{"id":"6fc9f92c-10dc-4967-854d-d379d4f0a39a","code":"12K","name":"Diverse Association for Professional Learning (formerly TVTSA)"},"accreditedBody":{"id":"aa023df3-b71e-4249-b9c4-41fca8bd135e","code":"D39","name":"University of Derby"},"profPost":"PG","english":"3","maths":"3","science":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feeDetails":"The fee for UK and EU students is £9250.00 which is the standard rate for postgraduate courses.\r\n\r\nTrainees are entitled to the same financial support as trainees on other postgraduate teacher training courses\r\n\r\nThose from the UK and the EU are eligible for student loans to cover tuition fees and maintenance.\r\n\r\nBursaries are available from the National College for Teaching and Leadership in priority subject areas, this is dependent on your degree level and the subject you wish to teach and the information can be found from the DfE.\r\n\r\nScholarships are available from a number of sources.\r\n","aboutCourse":"This course leads to QTS a PGCE and Masters Credits.\r\n\r\nThe main placement for this course is in an SEND Academy\r\n\r\nYou will be trained in a highly supportive, creative, inspirational environment where you will develop the knowledge, understanding and skills needed to deliver high quality teaching and learning. TVTSA schools are committed to Initial Teacher Training and have formed a steering group with partner schools to quality assure and develop the course. The in school mentors are supportive and are able to tailor the course to best suit your development. We pride ourselves in offering a personal service from an experienced dedicated team.\r\n\r\nTrainees work a full academic year in a SEND school, starting on the school’s first day of term which is usually at the start of September, right through to the end of term which is usually the third week in July, \r\n\r\n-\tEnrolment will take place at the University of Derby during the first or second academic week\r\n\r\n-\tOne day a week will be reserved for training, this is on a Wednesday and alternates between the university of Derby and bespoke training from TVTSA.\r\n\r\n-\tTVTSA organise a second placement which will be decided using the candidates term time postcode and will take place in a mainstream Academy. This is generally within a TVTSA school, for six weeks, in the early Spring Term.","interviewProcess":"Although this course is run in partnership between TVTSA and \r\nUniversity of Derby, you will just have one interview, organised by\r\nTVTSA.\r\n\r\nThis takes place at the SEND Academy** that you have chosen to train\r\nin, which will give you a good opportunity to familiarise yourself\r\nwith the school, members of staff and the pupils. The interview\r\nwill be with TVTSA and a member of leadership from the SEND Academy\r\nand will consist of:\r\n\r\n-\tA Pupil Panel\r\n-\tTeaching a 20 minute lesson\r\n-\tFormal interview \r\n-       English and Maths Assessments\r\n-       Reviewing an Educational Article\r\n\r\nInterviews are arranged quickly after receiving applications.\r\n\r\n**Currently due to Covid-19, all interviews are taking place on a virtual platform until further notice. This may change during the course of the academic year 2020/21. You will be informed when your application is received as to how you will be interviewed.","howSchoolPlacementsWork":"This course is school led and the majority of the training year will be in your chosen school, with one day per week at University. The structure of the year is referred to above.","personalQualities":"We are looking for candidates who are enthusiastic and passionate about their subject area or key stage, people who want the very best for our pupils. Candidates must be aware of the needs of children in an SEND environment.\r\n\r\nSuccessful candidates will be hardworking, driven and motivated as well as being dedicated to safeguarding and the welfare of our pupils. They need to be committed to helping our students progress to the best of their ability and must fully embrace the ethos of the schools they work in.\r\n","otherRequirements":"Candidates should be able to discuss experience of working with children or coaching/training adults.\r\n\r\nCandidates should be able to illustrate how their current skills can be transferred to a classroom setting.\r\n\r\nCandidates for this course must be able to discuss experience they have had with children with special educational needs and any impact that this has had on the person/people involved.","status":2,"createdAt":"2021-07-06T10:54:46.886Z","canSponsorStudentVisa":"yes","cycle":"2024"}
