{"id":"e626ac38-6059-4bbe-bb4b-68caf62b1e0d","name":"Physical Education","code":"37QK","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"74d64a54-5e34-4590-b6c7-528dd0cf26fe","code":"C6","name":"Physical education"}],"locations":[{"id":"f4d40fd6-4040-44f0-834c-09fa5056446b","name":"East Leake Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"6e0d7efc-9aac-4e89-84d8-367c3266d4e7","name":"Walton Academy","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"6fc9f92c-10dc-4967-854d-d379d4f0a39a","code":"12K","name":"Diverse Association for Professional Learning (formerly TVTSA)"},"accreditedBody":{"id":"816ef4e7-51c7-4211-828f-dbf6bb48bb6d","code":"L79","name":"Loughborough University"},"profPost":"BO","degreeGrade":"0","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feeDetails":"The fee for UK and EU students is £9250.00 which is the standard rate for postgraduate courses.\r\n\r\nTrainees are entitled to the same financial support as trainees on other postgraduate teacher training courses\r\n\r\nThose from the UK and the EU are eligible for student loans to cover tuition fees and maintenance.\r\n\r\nBursaries are available from the National College for Teaching and Leadership in priority subject areas, this is dependent on your degree level and the subject you wish to teach and the information can be found from the DfE.\r\n\r\nScholarships are available from a number of sources\r\n","aboutCourse":"You will be trained in a highly supportive, creative, inspirational environment where you will develop the knowledge, understanding and skills needed to deliver high quality teaching and learning.  We pride ourselves in offering a personal service from an experienced and dedicated team.\r\n\r\nThis course leads to QTS, PGCE and Masters Credits.","interviewProcess":"As this course is run in partnership between Diverse Association and Loughborough University, two interviews are required.\r\n\r\nThe university interview will establish the extent at which you are likely to meet the academic requirements of the programme, your commitment and passion for your chosen subject or phase, and the aptitude you have for teaching.\r\n\r\nThe Diverse Association interview will take place at the school you have chosen to train in, and involves the three activities below:\r\n\r\n* Pupil Panel\r\n* Teach a twenty minute lesson\r\n* Formal interview\r\n\r\nBoth parties discuss the outcome of the interview before a place is offered.","howSchoolPlacementsWork":"Trainees have two placements of 13 weeks in two Diverse Academy Schools, one of the will be East Leake Academy which is 15mins away from Loughborough University, and the other will be at Walton Academy in Grantham.\r\n\r\n","personalQualities":"We are looking for candidates who are enthusiastic and passionate about their subject area or key stage, people who want the very best for our pupils.\r\n\r\nSuccessful candidates will be hardworking, driven and motivated as well as being dedicated to safeguarding and the welfare of our pupils. They need to be committed to helping our students progress to the best of their ability and must fully embrace the ethos of the schools they work in.\r\n","otherRequirements":"Candidates that can discuss experience of working with young people, or supporting, coaching adults in the workplace, sporting environment or clubs would have an advantage. As would candidates who can show the qualities they have and how these could be transferred into the work place.","status":1,"createdAt":"2021-07-06T10:54:46.539Z","updatedAt":"2021-09-30T20:02:04.393Z","canSponsorStudentVisa":"no","cycle":"2024"}
