{"id":"31afd63e-5ea4-40c3-9481-a6bb18c2b972","name":"Physics","code":"G688","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"bf97cd0a-224c-43d3-a021-84143df13e8d","code":"F3","name":"Physics"}],"locations":[{"id":"e9a17409-8736-4977-8965-c0acf34561ad","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"222a5fbc-f990-4836-bddb-69c8ff0e41dc","code":"29P","name":"St Bernard’s School Direct Training"},"accreditedBody":{"id":"43920484-d42a-42ca-8071-74b1ff5e81cc","code":"S97","name":"The Sheffield SCITT"},"degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We do not offer equivalency tests ourselves but there are 3rd party providers who do e.g. equivalencytesting.com and A Star Equivalency.\n\nThere are up front costs associated with these courses which you will need to fund. As the test centres could be a distance from where you live there could also be travel costs. In addition you may need to book the test in advance. So make sure you give yourself plenty of time to pass the test before our course starts in September.","courseLength":"OneYear","feesUK":7850,"feeDetails":"The course fees for 2021/2022 are as follows:\r\n\r\nStudent type\tFees to pay\r\nUK students\t£7,850\r\nEU students\t£7,850\r\n\r\nThere are Student Loans available to pay the fees.\r\n\r\nIf you decide to pay privately then the payment schedule is:\r\n\r\nTerm 1 : £2,000\r\nTerm 2 : £2,000\r\nTerm 3 : £3,850\r\nWith each amount being due on the first day of each term.\r\n\r\nYou will have to pay the cost of the Enhanced Criminal Record Check in advance of starting the course.\r\n\r\nAt the time of writing this overview, the government have not yet provided confirmation on the funding of Subject Knowledge Enhancement (SKE) courses. We will update in due course.\r\n","financialSupport":"We are not able to offer any monetary financial support to trainees.  However, The Sheffield SCITT admin department will support you with: \r\n\r\n* The Student Finance Application process. \r\n\r\n* Information as to whether you are eligible for a government funded Train to Teach Bursary. \r\n\r\n* Any national scholarships that may be available for the subject you are training to teach.\r\n\r\n* Membership to the Westfield Foresight Health plan to assist you with the cost of dental, ophthalmic and other treatments.\r\n","aboutCourse":"St Bernard's School Direct Training is based on a successful partnership working with both Primary and Secondary Schools in Rotherham. We offer high quality School Direct training for both Secondary and Primary through The Sheffield SCITT.\r\n\r\n1.\tThis School Direct course lasts one year and results in qualified teacher status (QTS) without PGCE. This means ITTs will not be expected to work towards Master credits and will spend more time within placement schools. This option can sometimes be preferable as attention is 100% focused on the practical training. The QTS provides full qualification to teach in England.  Please get in touch if you have questions about this. \r\n\r\n2.\tYou’ll train in at least two good schools, getting the chance to learn ‘on the job’ alongside current teachers. \r\n\r\n3.\tYou’ll be part of a team from the very start, receiving intensive support from experienced teachers and personal one to one mentors, meaning you won’t be teaching classes unsupported until the school thinks you’re ready. \r\n\r\n4.\tThe principles of academic rigour on School Direct are the same as on university-led courses, too. The focus on teaching mastery and the Science behind learning using evidence based research is prominent throughout all training sessions. \r\n\r\n5. You’re also equally eligible for a training bursary or scholarship and can apply for the same financial support, such as student loans. You can find details of these here-https://getintoteaching.education.gov.uk/funding-and-salary/overview\r\n\r\n6.\tYou will have a programme of high quality continuous professional development in both the core pedagogy of teaching, and subject specific content of your chosen area of the curriculum (secondary\r\n","interviewProcess":"Shortlisting is undertaken on a fair and consistent basis, ensuring all applicants are considered against the minimum defined criteria within current DfE regulations. (Please refer to the DfE website). \r\n\r\nFollowing a successful application to St. Bernard's School Direct Training, you will receive an invitation to interview. The interview process includes:  \r\n\r\n* The delivery of a teaching task (delivered to either the interview panel or a small group of students, details will be communicated prior to interview.) \r\n\r\n* A reflection task based on the above teaching activity.  \r\n\r\n* A literacy and numeracy skills audit. \r\n\r\n* An interview with a panel that includes the St Bernard's ITT Coordinator, as well as a subject specialist within the subject applied for. (The panel information will be communicated prior to interview). \r\n\r\nThe above may be undertaken on site at St Bernard's Catholic High School, or remotely through a Google Meeting. This is subject to local, and St Bernard's, lockdown measures.  \r\n\r\nAdditionally the interview should be used by the applicant to address any concerns or questions about the training process. Following the interview, applicants will be informed in writing about their offer. If unsuccessful, specific and constructive targets will be clearly outlined to support with future applications. This communication will take place within 1 working week after the interview.\r\n","howSchoolPlacementsWork":"Each trainee undertakes three placements: Autumn (TP1 - 15 weeks), Spring (TP2 - approx 10-12 weeks) and Summer (TP3 - 15 weeks). \r\n\r\nTP1 and TP3 are spent in the \"host\" school which will support and deliver the majority of the SCITT training programme. For secondary trainees this could be within St. Bernard's RC High School or one of our secondary partner schools within Rotherham. For primary trainees this will be within within one of our Primary Catholic partner schools. TP1 involves observations of teaching practice, weekly training sessions (compulsory hub training which takes place at St Bernard's High School) with a gradual and supportive move towards teaching classes within one key stage (secondary) or one year group (primary). TP3 includes an increased teaching timetable and experience within a different year group/key stage. \r\n\r\nTP2 will be spent in an alternative school that can provide a contrasting environment to the host school. Trainees will learn about their TP2 placement within their first term and will be given the opportunity to meet their TP2 mentors, tour the school and ask questions before the placement commences. Usually during this placement, the trainee will teach a contrasting key stage or year group to TP1 to support a broader understanding of the curriculum. During this placement, however, weekly hub training sessions will continue to take place at St  Bernard's High School and attendance is compulsory. \r\n\r\nPlacements within school are carefully selected and monitored by St Bernard's High School to ensure a consistent teacher training provision is experienced by all ITTs. Partner schools are based within Rotherham, Sheffield and Doncaster therefore the trainee must accept the possibility of travel. However, genuine and personal circumstances will always be considered and accommodated where possible.\r\n","personalQualities":"We are looking for the next generation of outstanding teachers and future school leaders. You must be passionate about children and education but also care about our schools, the communities we serve and the special ethos each school.  \r\n\r\nIt is preferred if you have experience of working with young people - ideally some of this will be school based. However, as long as you are able to demonstrate you can engage, communicate and inspire your people, you are welcome to apply\r\n","otherRequirements":"You will need to pass an Enhanced Criminal Record Check. Ideally you will have some experience working with children in a school or another organisation e.g. nursery, playgroups, scouts etc.\r\n\r\nAs we are not allowed to hold a licence to sponsor visa applications you will need to be a UK citizen. Citizen’s of the European Economic Area or Switzerland will need to check their residency status at the time of application. You will be asked to provide official confirmation of your residency status on application.\r\n","status":1,"createdAt":"2021-07-06T10:56:57.935Z","updatedAt":"2021-10-04T09:46:23.424Z","canSponsorStudentVisa":"no","cycle":"2024"}
