{"id":"344b7d24-ca2c-4598-98ec-d9fca72defa7","name":"Primary","code":"2XM7","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"89d3cf8d-5c0f-4658-8540-407e3eee9968","name":"Our Lady and St. Joseph's Wath","isPublished":"Y","status":"R","vacancies":"F"},{"id":"abebfd10-129a-469d-922d-36e13f402d03","name":"St. Gerard's Catholic Primary School, Thrybergh","isPublished":"Y","status":"R","vacancies":"F"},{"id":"ec678895-1837-4a66-8569-2fd4869684ea","name":"St. Bede's Catholic Primary School. Kimberworth","isPublished":"Y","status":"R","vacancies":"F"},{"id":"20e57a18-5d44-4677-9eb7-7c5c087fe0d1","name":"St. Mary's Catholic Primary School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"222a5fbc-f990-4836-bddb-69c8ff0e41dc","code":"29P","name":"St Bernard’s School Direct Training"},"accreditedBody":{"id":"43920484-d42a-42ca-8071-74b1ff5e81cc","code":"S97","name":"The Sheffield SCITT"},"profPost":"BO","degreeGrade":"1","english":"1","maths":"1","science":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We do not offer equivalency tests ourselves but there are 3rd party providers who do e.g. equivalencytesting.com and A Star Equivalency.\n\nThere are up front costs associated with these courses which you will need to fund. As the test centres could be a distance from where you live there could also be travel costs. In addition you may need to book the test in advance. So make sure you give yourself plenty of time to pass the test before our course starts in September.","courseLength":"OneYear","feesUK":9250,"feesInternational":9250,"feeDetails":"\r\nThe course fees for 2021/2022 are as follows:\r\n\r\nStudent type\tFees to pay\r\nUK students\t£9,250\r\nEU students\t£9,250\r\n\r\nThere are Student Loans available to pay the fees.\r\n\r\nIf you decide to pay privately then the payment schedule is:\r\n\r\nTerm 1 : £2,625\r\nTerm 2 : £2,625\r\nTerm 3 : £4,000\r\nWith each amount being due on the first day of each term.\r\n\r\nYou will have to pay the cost of the Enhanced Criminal Record Check in advance of starting the course.\r\n\r\n\r\n","financialSupport":"We are not able to offer any monetary financial support to trainees.  However, The Sheffield SCITT admin department will support you with: \r\n\r\n* The Student Finance Application process. \r\n\r\n* Information as to whether you are eligible for a government funded Train to Teach Bursary. \r\n\r\n* Any national scholarships that may be available for the subject you are training to teach.\r\n\r\n* Membership to the Westfield Foresight Health plan to assist you with the cost of dental, ophthalmic and other treatments.  \r\n","aboutCourse":"St Bernards School Direct Training works in collaboration with The Sheffield SCITT. We are committed to providing quality first teacher training. We continually develop and review our programme of study to make it current and relevant so you receive the best 'on the job' training possible. \r\n\r\nThis course will entail 4 days in school. During time in school you will be guided by an experienced mentor. One day per week you will join other teacher trainees at The SCITT's Primary Hub Training which is a core feature to the course.  Here, you will receive high quality training on all aspects of the Teacher Standards including: teacher presence, behaviour management, planning and teaching effective lessons, and how to really stretch and challenge students. \r\n\r\nThere are three formally assessed teaching practices throughout the year. You will begin, and spend the majority of the year, in your ‘Home School’ and there will be the opportunity to complete one teaching practice in a contrasting primary school, in an alternate Key Stage. \r\nOur PGCE is delivered through the University of Hull. You will spend approximately 3 days over the year with your tutors from the University of Hull. \r\n\r\nWhilst you are able to state a preference for the year group you will like to be based within, it must be noted that training will be experienced across both Key 1 and Key Stage 2 so that you gain an insight and develop skills across a broad training programme. \r\n","interviewProcess":"Shortlisting is undertaken on a fair and consistent basis, ensuring all applicants are considered against the minimum defined criteria within current DfE regulations. (Please refer to the DfE website). \r\n\r\nFollowing a successful application to St Bernard's School Direct Training, you will receive an invitation to interview. The interview process includes:  \r\n\r\n* The delivery of part of a lesson (year group and content will be communicated prior) within the Primary school setting. This will be one of our Catholic Primary Schools. \r\n\r\n* A teacher reflection activity. \r\n\r\n* An interview with a panel that includes the a St Bernards Senior representative along with a Primary specialist. (Panel information will be communicated prior). \r\n\r\n* We also ask you to sit mock numeracy and literacy papers to help us identify if you will need support before you start your ITT course. \r\n\r\nAdditionally the interview should be used by the applicant to address any concerns or questions about the training process. Following the interview, applicants will be informed in writing about their offer. If unsuccessful, specific and constructive targets will be clearly outlined to support with future applications. This communication will take place within 1 working week after the interview","howSchoolPlacementsWork":"You will spend most of the training year in your 'Home School' which may be the school you were interviewed at, or one of our partner schools.  You can express a preference for your Home School based on location, preference for the type of school or a personal connection to a community you want to serve but we cannot guarantee to meet everyone's preference.\r\n\r\nThere is also a short alternative placement in a contrasting partner school in the middle of the training year and a brief experience in the phase (primary or secondary) you are not training to teach in. It would be sensible for trainees to base themselves within commutable distance of their Home School so these are finalised with you before the Summer holidays prior to your September start. \r\n\r\nWe make every attempt to make sure the alternative placement school is in an accessible location but it may involve a few weeks of travelling further to get that all important contrasting experience in the right school for you.\r\n","personalQualities":"We are looking for the next generation of outstanding teachers and future school leaders. You must be passionate about children and education but also care about our schools, the communities we serve and the special ethos each school.  \r\n\r\nIt is preferred if you have experience of working with young people - ideally some of this will be school based. However, as long as you are able to demonstrate you can engage, communicate and inspire your people, you are welcome to apply.\r\n","otherRequirements":"You will need to pass an Enhanced Criminal Record Check. Ideally you will have some experience working with children in a school or another organisation e.g. nursery, playgroups, scouts etc.\r\n\r\nAs we are not allowed to hold a licence to sponsor visa applications you will need to be a UK citizen. Citizen’s of the European Economic Area or Switzerland will need to check their residency status at the time of application. You will be asked to provide official confirmation of your residency status on application.\r\n","status":1,"createdAt":"2021-07-06T10:56:57.338Z","updatedAt":"2021-10-04T09:46:44.047Z","canSponsorStudentVisa":"no","cycle":"2024"}
