{"id":"5118deaa-4ac1-4e3b-a6ff-3df91fa09357","name":"Modern Languages","code":"G677","qualification":"qts","startDate":"2022-09-01T09:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"118fabd7-86d0-4a40-9e9a-e5c302abe59b","code":"DT","name":"Design and technology"},{"id":"e34fd2a3-a32e-44e9-aea1-666badf3ac03","code":"22","name":"Spanish"},{"id":"9727f674-61ba-4efa-b1f2-21ec7e354442","code":"15","name":"French"}],"locations":[{"id":"e9a17409-8736-4977-8965-c0acf34561ad","name":"Main Site","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"ab4a0a42-bcae-47d2-b27b-ca6f5f5d442e","name":"Ferryhill Business and Enterprise College","isPublished":"true","status":"running","vacancies":"full_time"}],"trainingProvider":{"id":"222a5fbc-f990-4836-bddb-69c8ff0e41dc","code":"29P","name":"St Bernard’s School Direct Training"},"accreditedBody":{"id":"43920484-d42a-42ca-8071-74b1ff5e81cc","code":"S97","name":"The Sheffield SCITT"},"degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We do not offer equivalency tests ourselves but there are 3rd party providers who do e.g. equivalencytesting.com and A Star Equivalency.\n\nThere are up front costs associated with these courses which you will need to fund. As the test centres could be a distance from where you live there could also be travel costs. In addition you may need to book the test in advance. So make sure you give yourself plenty of time to pass the test before our course starts in September.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"The course is full time and runs from September until the beginning of July. The course is made up of General Professional Studies sessions, the Subject Specialism Programme and PGCE modules. There will also be an Enhancement Programme which has been put together to give trainees a range of experiences. By completing the visits, you will gain a better understanding of a range of educational settings.\r\n\r\nAll trainees must demonstrate that they can fully meet each of the Standards for Qualified Teacher Status by the end of the course. Trainees will be continually assessed through lesson observations and placement reports whilst on teaching placements, and through a series of 3 short assignments. Detailed portfolios of evidence are submitted 3 times during the year to demonstrate how trainees are meeting the Standards for Qualified Teacher Status. Following the first 2 submissions, trainees receive feedback on their progress.\r\n\r\nThe PGCE is accredited by University of Sunderland and assessed through 2 written assignments. The 2 PGCE training modules will be held at The Work Place in Newton Aycliffe.\r\n\r\nIf a trainee does not meet the Standards for Qualified Teacher Status, but has passed the 2 PGCE modules, the credits can still be used towards a MA programme.\r\n ","interviewProcess":"The first thing we look at is your application form and your references to decide whether or not we should invite you for interview. It is, therefore, important to include all the relevant information on the form to help us make this decision.\r\n\r\nIf you are invited to interview and have a disability, please let the Durham SCITT Course Administrator know in advance if there are any special arrangements that should be made for the interview process, for example large print copies of documentation, additional time for reading or wheelchair access to the interview rooms.\r\n\r\nYou will be sent information about a 15 minute subject specific teaching task. The activity should be devised to be appropriate for a group of Year 10 (14 - 15) students. The interview panel will then ask you several questions to establish your motivation for wanting to teach in your chosen subject area and some administration questions. There will also be an opportunity for you to ask questions about the course. During the interview process there will be a literacy and numeracy activity to complete. \r\n\r\nThe formal interview panel will be made up of a subject specialist and one of the Durham SCITT Directors. \r\n","howSchoolPlacementsWork":"The main placement will be in your School Direct school but you will also do a second placement in one of the other secondary partnership schools. On each placement you will be allocated a Mentor who will support and guide you through the school based training.","personalQualities":"","otherRequirements":"Health Check \r\n\r\nBefore being accepted onto the course, all trainee teachers must satisfy the DfE requirements with regards to fitness to teach. You will be asked to complete a confidential self certified Health questionnaire, and if appropriate, an Occupational Health Advisor may request to see you for a more formal medical examination.\r\n\r\nDisclosure and Barring Service (DBS) Check \r\n\r\nThe Disclosure and Barring Service (DBS) provides employers and other authorised organisations with details of an individual's convictions, cautions, police reprimands and warnings held on the Police National Computer. \r\n","status":1,"createdAt":"2021-07-06T10:53:16.860Z","updatedAt":"2021-07-13T12:49:46.379Z"}