{"id":"077e8391-cd9d-4d34-a0b8-57ef6de25131","name":"Mathematics","code":"2YQG","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"72345aa7-096c-488f-8649-085b8178cadb","code":"G1","name":"Mathematics"}],"locations":[{"id":"18ca5dfc-4374-4917-8039-ff02f138d59e","name":"Oakmoor School","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"88c3031f-2daf-486e-9131-f82d080ad9a7","code":"2DH","name":"University of Chichester Academy Trust School Direct Partnership"},"accreditedBody":{"id":"3f5b1139-3651-4ee5-845c-54cd9e999b08","code":"C58","name":"University of Chichester"},"profPost":"PG","english":"3","maths":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"The University of Chichester Academy Trust’s School Direct programme aims to develop professional, reflective and effective teachers by encouraging such qualities as creativity, commitment, enthusiasm and intellectual liveliness. The programme leads to the award of a Postgraduate Certificate in Education (PGCE Masters level) with QTS and spreads across the entire academic year.\r\n\r\nYou will receive a regular training programme delivered within a Trust academy by practising teachers with proven, current knowledge and expertise in each subject. You will also attend training at The University of Chichester (the current programme includes 25 days) and there may also be opportunities to visit partner schools outside of the Trust.  Your training time is divided between professional studies and subject study. You will study the relevant national frameworks for your age phase and subject area and develop your understanding of subject specific pedagogy. The programme is designed to equip you to promote the creation of a culture for learning through your role as a teacher, meeting the needs of all children. Furthermore, you develop your understanding of the place of the teacher in a whole school context and in relation to your further career development.\r\n\r\nAssessment is a shared responsibility.  University tutors and school mentors collaborate to ensure that your school-based experience and written assignments are assessed at agreed points in the Programme.  School based experience is assessed against the Teachers’ Standards using information from a range of sources.\r\n\r\nYou will complete three assignments (one each term) the successful completion of which leads to a PGCE with 60 Masters Level credits. Preparation for these assignments is supported by university tutors.\r\nIn addition to resources within our academies all trainees have full access to the University of Chichester Learning Resource Centres including electronic access to a range of books and journals.\r\n\r\nWhere are we?\r\nAll secondary based training courses are based at Oakmoor School, Budds Lane, Bordon, Hampshire, GU35 0JB\r\nhttp://www.oakmoor.hants.sch.uk\r\n\r\nThe University of Chichester has two campuses. The majority of School Direct university- based training is on the Bognor Regis Campus. Physical Education training is on the Bishop Otter Campus in Chichester.   [How to find us] (https://www.chi.ac.uk/about-us/how-find-us)\r\n","interviewProcess":"Shortlisted applicants will be invited to an interview day at one of the Trust’s academies. This day will include:\r\n\r\n-\tan introduction to the Trust’s programme and an opportunity to ask questions\r\n-\ta formal interview with colleagues from the University and Trust academies\r\n-\tdiscussion around subject knowledge\r\n-\ta teaching activity (applicants are notified of the requirements in advance)\r\n-\ta check of original certificates \r\n-\tcompletion of a written task\r\n\r\nReferences: It is your responsibility to ensure that your referees are aware of their role, as well as making sure they follow UCAS’ instructions for providing on-line references.\r\n\r\nThe activities during the day are designed to provide you with opportunities to demonstrate the personal qualities noted later along with:\r\n- Enthusiasm for your subject\r\n- A commitment to developing creative pedagogical approaches\r\n-  An awareness of the role of the teacher \r\n- An ability to communicate effectively with a range of audiences\r\n- An ability to work collaboratively \r\n- A knowledge of current educational issues","howSchoolPlacementsWork":"All trainees completing secondary-based courses will be placed at Oakmoor School for the lead school placement\r\n\r\nThe second school placement will be provided at another local secondary school ","personalQualities":"- A love of learning \r\n- Enthusiasm for their subject \r\n- A genuine commitment and desire to have a positive impact upon the lives of children and young people \r\n- An openness to develop as a professional and willingness to act upon advice \r\n- Resilience \r\n- A commitment to developing creative pedagogical approaches \r\n- An understanding of how theory and practice can support each other \r\n- An awareness of the role of the teacher \r\n- An ability to communicate effectively with a range of audiences \r\n- An ability to work collaboratively \r\n- A knowledge of current educational issues \r\n","otherRequirements":"- Photographic proof of identity - driving licence; passport\r\n- All applicants must provide original degree and GCSE certificates before commencing training ","status":2,"createdAt":"2021-07-06T10:48:32.950Z","canSponsorStudentVisa":"yes","cycle":"2024"}
