{"id":"1232ac79-db3f-40e3-8cdb-bf9382b21704","name":"History","code":"3CPR","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"5a3609a0-5bbb-4377-b919-5d89932ab622","code":"V1","name":"History"}],"locations":[{"id":"6b86a984-1cda-4dcf-a212-fc04f7c54d8c","name":"Prospect School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"7837ffe1-7082-45f4-84dc-b87444d3e012","name":"Theale Green School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"1f571570-52c6-4f02-8661-b2e1ffb7ec84","name":"The Hurst Community College","isPublished":"Y","status":"R","vacancies":"F"},{"id":"05408487-bb1c-484d-b76c-f955c5f2e547","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"6022309e-cb78-44f4-bdf2-bdc48483608e","code":"26Q","name":"Two Counties"},"accreditedBody":{"id":"6439adcc-af64-4d3d-a1da-de045755db06","code":"R12","name":"The University of Reading"},"profPost":"PG","degreeGrade":"0","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"You must have successfully completed the equivalency test by the time you start your course.  Failure to do so will mean you are not eligible to begin your training year.  All costs of taking an equivalency test need to be met by the applicant.","courseLength":"OneYear","feesUK":9250,"feeDetails":"\r\nThe course fees cover the cost of your tuition. This course may require additional payments for trips and extra resources. \r\n\r\n\r\n","financialSupport":"The University of Reading offers £1000 off tuition fees to University of Reading graduates.","aboutCourse":"This Post Graduate Certificate Education (PGCE) Secondary Biology course leads to the award of Qualified Teacher Status (QTS), qualifying you to teach the 11-18 age group in secondary schools in England and Wales.  You will be supported, taught and guided by an experienced school mentor as well as academics, allowing you to benefit from the breadth of their expertise and understanding of education. \r\nThere will be plenty of opportunities, throughout your course, for you to apply your developing skills in real settings. In schools, you will be involved in:\r\n \r\n* observation of other teachers \r\n* planning and teaching parts of lessons/small groups \r\n* planning and teaching lessons and sequences of lessons \r\n* reflecting on and evaluating your teaching \r\n* receiving feedback on your teaching \r\n* gaining experience of the range of responsibilities of classroom teachers \r\n\r\nAt the University of Reading Institute of Education, you will be guided by experienced staff to discover many modes of delivery including active learning opportunities in purpose-built science laboratories where interactive and discussion-based techniques will encourage you to engage, reflect and challenge. You will develop your skills throughout the programme so that you are fully prepared to share your love of learning and knowledge about science with the children you will teach. Sessions may include: \r\n\r\n* participating in workshop style sessions with your peers \r\n* attending presentations by subject experts \r\n* working on tasks in groups \r\n* having individual tutorials \r\n* visits to schools or other education settings \r\n* visits to theatres, museums, galleries or sites of educational interest \r\n* writing assignments on aspects of subject teaching and Professional Studies\r\n\r\nThese learning activities will help you to develop a toolkit of knowledge and skills, ensuring you are well prepared to tackle challenges and opportunities throughout your training and your career. \r\n\r\nYou will be given assignments that are designed to help you plan your teaching effectively and imaginatively and to evaluate your skills, particularly in terms of the quality of learning achieved by pupils. There are also three assessment opportunities that monitor your progress against the Teaching Standards.  These reports will highlight your strengths and help identify the areas that need further development.\r\n","interviewProcess":"The selection process has the following stages:\r\n\r\n* Short listing for interview \r\n* Interview day at the partnership school selected as the main placement school\r\n* Attendance to the University Induction and Needs Assessment day for checking of the eligibility criteria\r\n \r\nThe interview day will include:\r\n\r\n*  Discussion of a pre-interview task\r\n* Opportunity for classroom observation and interaction with pupils \r\n   (Covid 19 permitting)\r\n* A formal interview involving the school mentor and ITT coordinator\r\n* A written task\r\n* A short presentation\r\n","howSchoolPlacementsWork":"Our seven schools are located in or close to Reading giving you the benefits of a vibrant town with the convenience of excellent transport connections. \r\nOn this course you are required to carry out three placements in two different age groups to ensure you receive a broad range of experiences.  You will also have the opportunity to observe teaching in a primary school.\r\nThe majority of your training will be in the main placement school; this school is selected by you in your application and discussed in the interview. The second school placement (5/6 weeks) will be selected on geographical considerations to minimise the commute to school, but also on ensuring you have a range of experience. You will also have the opportunity to gain experience in a different educational setting at the end of the course. These placements will help you to develop the skills and knowledge to build your confidence in the classroom and gain practical teaching experience. They also provide you with the opportunity to connect with potential employers and build your professional network.\r\n","personalQualities":"We are looking to recruit talented candidates who have the qualities and attributes suited to a career in teaching and the drive and ambition to make it happen.\r\nThe main personal qualities we are looking for are:\r\n \r\n * Has organisation and time management skills​​\r\n * Is passionate about their subject​​\r\n * Has a positive outlook​​\r\n * Has a creative and innovative approach​​\r\n * Is a highly reflective practitioner​​ with good inter-personal skills\r\n * Someone who is resilient and can take the highs and lows!​​\r\n * Is highly motivated​ and willing to play a part in wider school life.​\r\n","otherRequirements":"If you accept an offer with us you will also be required to successfully complete Occupational Health and Disclosure Barring Service (DBS) Enhanced Disclosure checks.  These checks are required to ensure you meet the Department for Education’s requirements for physical and mental fitness to teach, as well as assessing your suitability for working with children.\r\n\r\nYou will need to demonstrate sufficient understanding of and insight into the role of the teacher, and the processes involved in learning and teaching. In order to show such understanding and insight it may be beneficial to undertake a visit to a maintained secondary school. \r\n\r\n","status":1,"createdAt":"2021-07-06T10:48:37.388Z","updatedAt":"2021-07-19T10:46:14.056Z","canSponsorStudentVisa":"yes","cycle":"2024"}
