{"id":"f6bce1b3-2c8f-4f71-a763-f1e887d7635c","name":"Religious Education","code":"3883","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"724b5d16-28dd-4431-bc17-ea4be4daedc4","code":"V6","name":"Religious education"}],"locations":[{"id":"0f0dafb5-d734-4173-91dc-8d02d5680dd1","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"1748c4f3-e6ca-411e-a01f-798f1fc99daa","code":"2H4","name":"Bridgewater High School"},"accreditedBody":{"id":"0e64ff81-c28a-46fa-96fd-0fa735e9c357","code":"M70","name":"Endeavour Learning SCITT"},"profPost":"BO","degreeGrade":"1","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"The course consists of 35 weeks of school centred training from the beginning of September to the end of June in two contrasting schools. Four days a week will be spent in classrooms under the guidance of a Curriculum Mentor who will support and train you at all times to be a highly effective teacher.  They will model exemplary practice in planning teaching and assessment to prepare you to be the best teacher you can be. Our programme will also allocate you an Academic Mentor in school and you will meet with them regularly throughout the year to develop your subject knowledge. In addition, a Professional Mentor in School will ensure you are supported at all times and will oversee the programme . Finally you will have a  University Mentor to support your PGCert studies.\r\n\r\nAll pupils complete an RS qualification and many choose it as an option subject. In addition, we can provide a Secondary block placement at Sir Thomas Boteler (Church of England) High School who are part of out TCAT family of schools.\r\n\r\nYou will be assessed through observations with your school mentors and feedback will be through timetabled weekly meetings with your Curriculum Mentor and Academic Mentor and at the end of the year you will be awarded Qualified Teacher Status (QTS). \r\n\r\nYou will also study for a PGCert (post Graduate Certificate) completing two practical  assignments under the guidance of Liverpool John Moores University. You will attend LJMU for one Induction Day and then complete five days of further PGCert studies. \r\n\r\nPSHE (which becomes compulsory in school in September 2020) has always  been an integral part of our programme and all our students complete a professional qualification to become an accredited teacher of PSHE. It is a school subject through which pupils develop the knowledge, skills and attributes to manage their lives, now and in the future. This helps the pupils to stay healthy, safe and prepare them for life in modern Britain. Our schools already provide the training and support to prepare teachers of the future for this important role and our students already take an active role in PSHE delivery across KS3 and KS4, delivering lessons to their linked forms. Last year, all our ITT students became accredited teachers of PSHE.\r\n\r\n","interviewProcess":"If your application is successful, you will be invited for interview. There will be a short unseen written task to review your grammar, spelling and punctuation and your ability to articulate your points clearly. \r\n\r\nWe will also ask you to deliver a twenty minutes session to a class of Year 7 pupils on a pre-prepared topic related to the subject you wish to teach. \r\nWe give you plenty of time to prepare and the support of the class teacher to help you deliver to the best of your ability. Our applicants relish the opportunity to be in front of a class, often for the first time, as it is a chance to reinforce and feel confident in their career choice. \r\n\r\nThis will be observed by some members of the interview panel and will establish your confidence, enthusiasm and communication skills. We will be looking at your personal, interpersonal  and communication skills throughout the interview process.\r\n\r\nFinally, there will be a formal interview which will draw on the tasks performed during your time spent with us. This will be an opportunity for us to talk further  and to discuss your subject knowledge, reflection on any experience you have had in a secondary school, your knowledge of current secondary education issues and your commitment to a career in teaching. ","howSchoolPlacementsWork":"During your training, you will complete  placements at two contrasting  secondary schools. These placements will be within TCAT schools, all of which are within a five mile radius in Warrington. This means you can concentrate on your teaching and training rather that spending time commuting to work. These schools are selected to suit your particular training needs and interests to give you the best possible support for your learning.\r\n\r\nFour days a week are spent training in classrooms under the guidance of your mentors. On Fridays, throughout the year, the trainee cohort meet together to learn the pedagogy of teaching from experienced current practitioners. Students appreciate the chance to come together as a cohort once a week to exchange ideas and discuss their week together.\r\n\r\nA classroom teaching timetable will be devised for you by your Curriculum Mentor and you will gradually take over the teaching of your classes at a pace that suits you. By the end of the first placement you will be teaching 50% of a full timetable over 4 days and this will gradually increase in placement 2. You will also observe other expert practitioners both in your department and across other subject areas,\r\n\r\n\r\nTCAT prides itself on its inclusivity. Most of our Secondary schools have a Designated Provision and students can gain experience of working within these specialised units as well as working with these children in a mainstream setting.\r\n\r\nAt the end of your first school placement, if you have  successfully  met all teaching standards, there will  be an opportunity to request  a third placement at Priestley Sixth Form College which will allow you to include an extended  period working with KS5  students\r\n\r\nThis is a bespoke course. You will gain experience of our TCAT Primary Schools, our Designated Provisions and Priestley Sixth Form College and gain an insight into EAL during your two weeks of enrichment visits to TCAT schools. In addition, we will provide opportunities for you to extend your experience into specialised educational settings including Special Schools and Alternative Provisions. ","personalQualities":"We are looking for high calibre students with a passion for teaching. You must have excellent communication skills and the ability to engage with young people. You must be flexible, independent,  resilient and have the ability to show initiative.","otherRequirements":"Before starting their training, all trainees will be required to undergo an enhanced criminal record check (DBS) and an on-line health check. All candidates will also have to produce GCSE, A level and Degree certificates in support of their application.\r\n\r\nThe Department for Education no longer requires students to sit the Professional Skills Tests in English and Maths before starting an ITT course. We will make an assessment of fundamental English and Mathematics knowledge and skills during our selection process.","status":1,"createdAt":"2021-07-06T10:49:54.308Z","updatedAt":"2021-10-01T13:22:26.984Z","canSponsorStudentVisa":"no","cycle":"2024"}
