{"id":"cab6816c-f011-454e-b7f1-ed345c0e335f","name":"Primary","code":"32VP","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"eb62b111-a72b-4243-af93-0730a8246a67","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"c76d7988-1268-427c-ab85-b44a3041a0cf","code":"2BF","name":"Ventrus Training school"},"accreditedBody":{"id":"be897ea1-5b41-4b40-8eaf-877a15ad688b","code":"S31","name":"Somerset SCITT Consortium"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"financialSupport":"For information on Government loans and training bursaries, please visit the Student Finance England and Get into Teaching websites.\r\n","aboutCourse":"Our schools direct route offers school experience from day 1. Gain an in-depth understanding of how young children aged 5–11 think, develop and learn. We offer two contrasting placement schools during the programme where you will combine practical, real-world learning with the study of children’s communication, thinking and relationships. Supported by our inspirational staff, you will satisfy the standards for qualified teacher status and start your journey to becoming an outstanding primary school teacher.\r\n\r\nThe placements in school are enriched with specific face to face training days at Somerset SCITT \r\nTrainees will study the following topic areas:\r\n•\tPedagogy and Professional Practice.\r\n•\tMaths\r\n•\tEnglish\r\n•\tScience\r\n•\tSubject Specialist Research\r\n•\tGlobal Dimensions\r\n•\tFoundation Studies\r\nAs well as the above we offer the following conference themes:\r\n•\tLearning without Limits\r\n•\tPsychologies/EAL\r\n•\tBehaviour\r\n•\tTeaching cross curricular English with a global dimension.\r\n\r\nThis makes our course a blend of focused 'in school experience' and time away from the classroom to complete specific study areas; thus giving students time and space to reflect, share and learn form each others experiences in a variety of school settings.\r\nVentrus also offer study days to support crucial assessment periods. \r\n","interviewProcess":"\r\nIf an applicant is successfully shortlisted they will be invited to attend a virtual interview which comprises of 3 components:\r\n•\tPresentation\r\n•\tFormal Interview with members of the ITT team\r\n•\tBook Activity - pre set task\r\n\r\nWe work hard to make sure our interview process is accessible to all potential students.\r\n\r\nWe believe strongly that the interview process is 'two way' and we aim to provide our potential students with direct opportunities to interview us as a provider and organisation so that they are able to make informed decisions about whether we offer the what they are seeking. \r\nWe appreciate that the section of the right training provider is a crucial and important decision.\r\n","howSchoolPlacementsWork":"The programme will allow you to spend time in two main placements both different in their context.\r\n\r\nThe two placements will be focused on different Key Stage experiences and will be in different schools in the partnership\r\n\r\nPrimary trainees have specialist input from our EYS to KS2 colleagues.\r\n","personalQualities":"We are looking for students with the potential to become excellent teachers through drive, passion and the ability to be critically reflective.\r\n\r\nStudents who are excited and motivated by primary age children and have a clear interest in primary education is a must!\r\n\r\nLife experience is welcomed alongside successful academic achievement.","otherRequirements":"Other requirements\r\nAdditional mandatory requirements are:\r\n•\tDBS Check\r\n•\tHealth check\r\n•\tProof of Identification\r\n\r\n","status":1,"createdAt":"2021-07-06T10:47:53.758Z","updatedAt":"2021-09-30T10:29:17.320Z","canSponsorStudentVisa":"no","cycle":"2024"}
