{"id":"41256dc0-059e-4416-b11b-8f6d8c3d7b9f","name":"Primary (age 3-7)","code":"D561","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_7","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"234555b5-4402-4514-a0e0-3579ba47d178","name":"Aspire Academy Trust","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"460d78af-537e-485f-af2a-74eee012dde6","code":"2HB","name":"Aspire Academy Trust"},"accreditedBody":{"id":"0f3abdaf-7b36-422e-a700-046f8a641c60","code":"C79","name":"Cornwall School Centred Initial Teacher Training. (Cornwall SCITT)"},"profPost":"PG","degreeGrade":"1","english":"2","maths":"2","science":"2","acceptPendingGcse":"no","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"Equivalency tests can be arranged through our partners, Cornwall SCITT, who will be able to supply up to date details of charges and requirements. \n\nIt is preferable that tests are at least booked at the point of application - any offers made will be on condition of passing these within a reasonable time-frame.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"The course follows the Primary School Direct (Tuition Fee) route, encompassing the early years with children in Reception and Key Stage 1. Trainees complete a set of termly tasks, written assignments and a portfolio of evidence to demonstrate meeting the Teaching Standards. Upon successful completion of the course, Qualified Teacher Status is awarded, with a PGCE validated by Bath Spa. Trainees will be qualified to teach any age across the primary phase. \r\n\r\nTraining with Aspire Academy Trust begins in September at the start of the academic year, running right through to July at the end of the summer term. The structure of the course comprises 30 weeks spent in at least two Aspire academies, along with 11 weeks of centre-based training with Cornwall SCITT at their training centre at Heartlands, near Redruth.\r\n\r\nTime in school or at the centre are in full week blocks spread throughout the year; this means when trainees are in school, they experience the full school week, rather than missing the same day every week for centre training.\r\n\r\nThe centre training covers a range of themes including specific early years content, the curriculum, methods of teaching and learning, planning and resourcing. This is delivered by a number of specialists including some of Aspire’s own Specialist Leaders of Education, who deliver elements such as Maths and ICT. There may also be opportunity to observe demo lessons in our academies and other specialist settings. Some of the centre-based sessions will take place in key training settings such as outdoor education centres, including a short residential trip to Bristol and London.\r\n\r\nThe majority (around 75%) of the course time is spent in school where trainees are welcomed by experienced Aspire class teachers, leaders and practitioners to support them. Trainees complete a range of tasks, lead group work and undertake teaching practice. This intensive, hands-on approach develops key skills needed for classroom management and working in the school environment. High-quality feedback, support and advice is given to trainees by their class teacher, leading to continuous development of their teaching practice. Course tutors will also observe teaching practice throughout the year.\r\n\r\nTrainees have dedicated weekly 2-hour high-quality mentoring sessions in school with their Aspire school-based trainer (class teacher), alongside access to a mentor/tutor through Cornwall SCITT. We believe trainees can reach their full potential with the best mentoring support, so we train and support our Aspire mentors, too.","interviewProcess":"Interview activities may include the following:\r\n\r\n* Applicants will be asked to plan and prepare a short activity for a small group of children prior to interview.\r\n\r\n* Applicants will be observed working with a small group of children, following a brief supplied in advance of the day. We will be looking to see that thought has been given to structure and content, and how candidates communicate and build relationships. But we’re not looking for the finished article at this point!\r\n\r\n* A written task where the standard of English and handwriting are assessed.\r\n\r\n* A formal interview where we will look to see what motivates applicants to pursue a teaching career, and what they know about current issues in the sector.\r\n\r\nIt is really important that application forms are completed correctly and in full, following the application guidelines so that we can assess whether the standard for interview is met. For example, if academic study was completed within the last 5 years, one of the referees must be an academic tutor.\r\n\r\nThe work history section of the application must be comprehensive, detailing all work history, including all employed or voluntary school roles, as well as other work from your whole adult life - not just the most recent years. All gaps in between roles must be accounted for.\r\n\r\nIncomplete or incorrect applications will delay shortlisting, or may mean that an application is not shortlisted at all - so attention to detail is key.","howSchoolPlacementsWork":"Aspire Academy Trust has 29 schools of varying sizes across Cornwall and we are continuing to grow. All school placements are in our Aspire academies.\r\n\r\nStudents on this Primary (age 3-7) course will spend the first term in Reception, followed by the second term in Key Stage 1, before returning to Reception in the final term. We endeavour for trainees to be placed in the same school in Autumn and Summer on this course so that trainees can see the changes in the children's development during the Reception year. Returning to the same school also ensures that time is not lost settling into another new school and getting to grips with new colleagues and processes for a third time in the year.\r\n\r\nTime for centre-based training with Cornwall SCITT is slotted in around placement time with full week blocks during the year.\r\n\r\nWe consider the availability and capacity of our academies to ensure that trainees are given the best support and opportunities; we want to ensure the placement schools and trainees are the right fit for each other.\r\n\r\nWe consider the travel distance between a trainee’s home address and school, to keep travel time to under 30 minutes where possible. We also consider whether trainees have a prior connection to a school, such as through previous employment, voluntary roles or through family attending or working in the setting. We will usually look to place a trainee in a setting with no prior connections to ensure that they are given a fresh and new beginning for their training.\r\n\r\nA major benefit of being in a Trust is the opportunity to network and link with colleagues in other schools in our MAT; we encourage our trainees to utilise these networks.\r\n\r\nTrainees will be supported by their class teacher (school-based trainer) throughout their placement, as well as wider colleagues including the Head of School. Weekly mentoring and shared PPA time will also allow trainees to access complete support from their class teacher. Tutor support will also be available from Cornwall SCITT to ensure there is always somebody to help!","personalQualities":"We are looking for trainees who have the potential to be fantastic teachers, who are passionate about teaching, learning and giving all children the best education experience. We are looking for creativity, enthusiasm and energy to spark children’s interest to achieve their full potential.\r\n\r\nWe’d like to see trainees who are flexible, adaptable and willing to respond to mentoring feedback to develop practice and rise to the challenge.\r\n\r\nWe’d also love to hear about your experience with children and how you can be resourceful, build relationships with others (both colleagues and children) and what skills you can bring to teaching. ","otherRequirements":"All trainees will be required to undertake an enhanced DBS.\r\n\r\nWe strongly recommend that you have undertaken employment or relevant work experience to demonstrate your skills, knowledge and practice, sharing this with us in your application and interview.\r\n\r\nWe’d also be really interested to hear about any other experience, qualifications or training that you think would be relevant in your application to train to teach.","status":1,"createdAt":"2021-07-06T10:54:39.726Z","updatedAt":"2021-07-30T11:11:35.781Z","canSponsorStudentVisa":"no","cycle":"2024"}
