{"id":"fc049583-77ff-44f1-978e-73912858ad41","name":"Primary","code":"2S94","qualification":"qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"trainingProvider":{"id":"16207dcb-70fa-4ce1-9932-1afbe2e72d1b","code":"149","name":"The Federation of St. Elphege’s Catholic Schools"},"accreditedBody":{"id":"252d7e03-741e-4453-b6a8-3d361e6c9d1b","code":"E69","name":"e-Qualitas"},"english":"1","maths":"1","science":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":null,"aboutCourse":"This course offers the candidate in-school training over the course of one academic year. The candidate is able to train with children of different ages and can choose a Key Stage 1 or Key Stage 2 training programme. \r\nThe course consists of weekly observations by a school based mentor (SBM) and observations by an e-Qualitas representative a few times a term. \r\nThe candidate will need to build a portfolio of evidence to meet the Teaching Standards throughout the year. The candidate will have the opportunity to train for a period of time in a different school setting and a different Key Stage.\r\n\r\nIdentify the age range you think you would like to focus on during the training\r\nThe options are:\r\n•\tAges 3 to 7 ie Nursery and Reception (Early Years) and Years 1 and 2 (Key Stage 1)\r\n•\tAges 5 to 9 ie Years 1 to 4 inclusive (Key Stage 1 and lower Key Stage 2)\r\n•\tAges 7 to 11 ie Years 3 to 6 inclusive (Key Stage 2)\r\n\r\nVisiting primary schools will give you an insight into the teacher’s role, and help you decide whether you are more suited to teaching the younger or the older pupils. A good choice is the middle age range ie Years 1 to 4 inclusive, as you have to know about Early Years and about upper Key Stage 2 although during your training you concentrate on teaching Key Stage 1 and lower Key Stage 2. \r\n\r\n","interviewProcess":"You are asked to plan and teach a half hour lesson with a story focus in a class.  As part of this, you will be asked to provide a lesson plan for the session and copies of resources you will use for the children’s activities.\r\n\r\nWritten exercises:\r\n•\tGrammar activity\r\n•\tMathematics activity\r\n•\tWriting activity\r\n\r\nInterview:\r\n•\tApproximately 45 minutes interview\r\n\r\nPortfolio of evidence\r\nYou will be asked to bring with you to the interview a small portfolio of evidence to reflect upon your practice in school.  When collating this, you should think about a range of activities you will have completed with children to show your skills as a potential teacher.\r\n","howSchoolPlacementsWork":"The candidate will be placed at one of our schools in the alliance. They will spend the first half term working in a class with their school based mentor before moving to another year group for the second half term. \r\nFrom January to February half term, the candidate will have the opportunity to gain experience in a different school in the alliance.\r\nThe candidate will then return back to the host school and continue their experience in a different year group than one they have previously worked in. Finally, the candidate will return back to the original class they began their school based training in to consolidate learning for the final term.","personalQualities":null,"otherRequirements":null,"status":2,"createdAt":"2021-07-06T10:55:40.956Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"Outer London Unqualified 1: £21,582"}
