{"id":"fc1eb50e-3a39-49f4-b55b-b03780ff263e","name":"Primary","code":"2XDN","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"efc3d74a-ff2e-4d45-8c0f-67fe59dbb110","name":"Emmaus Teaching School Alliance","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"16207dcb-70fa-4ce1-9932-1afbe2e72d1b","code":"149","name":"The Federation of St. Elphege’s Catholic Schools"},"accreditedBody":{"id":"ef172d85-20e4-4aa2-96d0-9e3ae81f526d","code":"S64","name":"St Mary’s University, Twickenham"},"profPost":"PG","degreeGrade":"1","english":"1","maths":"1","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"You will need to use a third party equivalency provider and pay for this service yourself.","courseLength":"OneYear","feesUK":9250,"feesInternational":9250,"aboutCourse":"If you are looking for a teacher training course in which you spend most of your time in-school while you study, this course may be for you. \r\nSt. Elphege's RC Infants' School has been a teaching school since March 2014 and is the lead school for Emmaus Teaching School Alliance (ETSA). The school is working in partnership with St Mary's University Twickenham (our accredited teacher training provider) and the following schools: \r\n\r\nSt Elphege's RC Junior School \r\nRegina Coeli Catholic Primary School \r\nStanley Park Infants' School \r\nOur Lady Queen of Heaven RC School \r\nSt Cecilia's Catholic Primary School \r\nThe Avenue Primary Academy\r\n\r\nSt Mary's offer training in both Key Stage 1 (KS1) and Key Stage 2 (KS2) however not in the Early Years (EYs).\r\n","interviewProcess":"Initial selection\r\n\r\nApplications are considered by the school, and selected for interview on the basis of the information within the application. Application forms will be scrutinised for the correct use of grammar, spelling and punctuation and we pay particular attention to qualifications, the personal statement, and the references. \r\n\r\nInterview\r\n\r\nFor all our primary programmes partnered with St Mary's, there is a two stage interview process. All shortlisted candidates are required to attend an initial university interview first and if you pass this successfully (which is common) then you would proceed to a school interview (normally within a day or two). \r\nIf shortlisted for interview, we will upload the first interview date to UCAS and shortly afterwards we will email you to confirm both interview dates and to provide further details regarding the school interview. The university would contact you separately about arrangements for the initial university interview. \r\n\r\nThe interview email will ask you to confirm your attendance at the interview and will supply the relevant email addresses for this reply. \r\nThe university interview would include some time for the university registry team to verify various identification documents and qualification certificates. You may be required to undertake group tasks with other candidates. The university will confirm details of their process to you directly. \r\nThe school interview is likely to include a tour of the school; literacy/numeracy tests; a classroom exercise and panel interview. \r\n","howSchoolPlacementsWork":"This course uses a balance of theory and practice therefore time will be shared between blocks at university and blocks in school. Your training will be predominantly based in your host school.\r\nYour host school will be St Elphege's Infant or Junior school during your training. To find more information about the schools, please visit the website: www.emmaustsa.org.uk. \r\nSt Mary's University is situated in Strawberry Hill, Twickenham in South West London. Founded in 1850, it is generally acknowledged to be the oldest Roman Catholic college in the UK. In 2015, St Mary's celebrated 165 years in Education. With just under 4,000 students training to teach on primary and secondary courses, they are now London's second largest teacher training course provider and in 2011, St Mary's was deemed to be 'outstanding' by OfSTED during inspection. \r\nCourse tutors at St Mary's are all skillful teachers themselves, with many years of experience in schools and higher education.","personalQualities":"During the interview and selection process, you will take part in  an ONLINE interview and discussion  that will allow you to evidence that you have thought carefully about your motives for becoming a teacher and can demonstrate that you have some emerging capability to reflect on what being a teacher means. The interview will be recorded in line with GDPR compliance.\r\n","otherRequirements":"At least basic Information and Communications Technology skills, with a commitment to developing these both for personal and pedagogical use\r\nOpenness to advice, guidance and positive professional criticism as part of development; Personal professionalism, including diligence, organisation, smartness of dress, punctuality and a commitment to full attendance \r\nGood health, physical and mental, with ability and strategies to cope with stress often generated by the demands of the course and of the teaching profession\r\nCommitment to equal opportunities and sensitivity to the variety of communities represented in our partner schools\r\nA willingness to work with pupils beyond the school day.\r\n","status":1,"createdAt":"2021-07-06T10:55:41.014Z","updatedAt":"2021-09-08T16:14:18.034Z","canSponsorStudentVisa":"yes","cycle":"2024"}
