{"id":"27bec7de-671b-491b-a7a0-253b1ca1f784","name":"Drama","code":"K354","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"TA","fundingType":"apprenticeship","studyMode":"B","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"69052223-ca45-4781-a8d3-cb92447a6d78","code":"13","name":"Drama"}],"locations":[{"id":"ad904f68-86ce-4ce0-892f-1283e0be65c5","name":"Main Site","isPublished":"Y","status":"R","vacancies":"B"},{"id":"58623769-6885-49bf-a04d-97ed45d3474b","name":"Priory Group","isPublished":"Y","status":"R","vacancies":"B"}],"trainingProvider":{"id":"50aa4750-b887-49bc-9bf4-b67a55e18288","code":"2LC","name":"National Online Teacher Training"},"accreditedBody":{"id":"79af57c6-053f-4e75-995a-2eae20fe2ed1","code":"2B2","name":"Yorkshire and Humber Teacher Training"},"degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"Applicants are required to have a degree in a performance/drama related subject. Alternatively those with a background of working with children for performances will be considered.","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Ideally applicants will complete their GCSE equivalency tests prior to application. Please contact us for a list of approved test providers.","courseLength":"TwoYears","aboutCourse":"This is an Apprenticeship course for candidates employed by the Priory Group.  Applicants need to be employed by the Priory Group prior to application.\r\n\r\nMore time spent in the classroom \r\nWith elements of the course delivered online there is no need for you to attend centre or university-led lectures. This means you can be based full time in your placement school to benefit from immersion in the school environment from the very start of your training. \r\n\r\nTeacher Training Enhancement Programme (TTEP) \r\nThe TTEP suite of online resources takes you through the Professional Studies 1 and Subject Studies that you need at the start of your teacher training. Professional Studies 2 builds on this to extend and improve your teaching. This is supported by our pedagogy sessions that are aligned with the Teachers’ Standards to provide coherent examples of best practice. \r\n\r\nAccess to your dedicated online support package \r\nThis is a suite of online facilities that allows trainees’ progress on the ITT to be tracked. This includes tools for lesson observations, mentor meetings, evidence tracking, and checkpoint assessments against the Teachers’ Standards.\r\n\r\nSchool-based mentor support \r\nYou will have a dedicated school-based mentor who will help you to integrate into the school and offer support and advice during the training year. \r\nDedicated support via NOTT tutor \r\nYour dedicated NOTT tutor will support you through your training and will work with you and your mentor to help you gain QTS. ","interviewProcess":"At NOTT we believe that our children deserve the very best teachers and therefore our selection process is rigorous.  It consists of four elements:\r\n\r\n- interview\r\n-taught session\r\n-subject knowledge test\r\n-educational knowledge test\r\n\r\nThese four elements combine to allow us to assess your potential to train to teach with NOTT.  The interview allows us to get to know you as a person, your interests and rationale for applying.  The taught session enables you to show you natural flair and how you interact with children.  The subject knowledge test is used to identify areas for work before you start, and the educational test shows us that you have an interest in current educational practice and school life.\r\n","howSchoolPlacementsWork":"Initial Teacher Training is a professional course and we therefore discuss placement requests with our applicants.  We aim to balance the requirements of the school, and it ethos, with the personality of you as a trainee.  We also try to minimize travel time, as it is not the best use of that scarce resource!  As we are a large partnership, both with number and geographically, we can meet most requests.\r\n\r\nOur schools are either 11-16 or 11-18.  You will be timetabled for classes across the 11-16 range, with additional post 16 experience if available in that school.  If it is not, you will gain that experience in your second placement or enhancement week.","personalQualities":"We are looking for the best teachers for our children, so we want you to have a real desire to see them succeed.  It is important that you are enthusiast about your subject - you will be teaching it for the foreseeable future, so you need to enjoy it!  Finally, you need to be proactive, ready to put yourself out there to make a difference.","otherRequirements":"All applicants will be subject to and enhanced DBS check and a fitness to teach questionnaire carried out by occupational health.\r\n\r\nThis is an Apprenticeship course. Applicants need to be employed in a school and have prior approval from their employing headteacher.","status":1,"createdAt":"2021-07-06T10:53:43.670Z","updatedAt":"2021-09-30T12:30:02.390Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024"}
