{"id":"80fed79c-bc30-4072-bf72-11600aaf6f55","name":"Geography","code":"H613","qualification":"qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"TA","fundingType":"apprenticeship","studyMode":"B","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3f47e67b-7fa5-4947-a5a0-74d528cd2a87","code":"F8","name":"Geography"}],"locations":[{"id":"58623769-6885-49bf-a04d-97ed45d3474b","name":"Priory Group","isPublished":"Y","status":"R","vacancies":"B"},{"id":"ad904f68-86ce-4ce0-892f-1283e0be65c5","name":"Main Site","isPublished":"Y","status":"R","vacancies":"B"}],"trainingProvider":{"id":"50aa4750-b887-49bc-9bf4-b67a55e18288","code":"2LC","name":"National Online Teacher Training"},"accreditedBody":{"id":"79af57c6-053f-4e75-995a-2eae20fe2ed1","code":"2B2","name":"Yorkshire and Humber Teacher Training"},"degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"Applicants are required to have a degree in Geography or a closely related subject. Alternatively we will consider applicants who have an A Level in Geography with grade C or above.","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Applicants are required to complete their GCSE equivalency tests prior to application. Please contact us for a list of approved test providers.","courseLength":"TwoYears","aboutCourse":"This is an apprenticeship course. Applicants for this course must have the prior approval of their employing headteacher before applying. This means you must be employed in a school before you apply.\r\n\r\nMore time spent in the classroom \r\nWith elements of the course delivered online there is no need for you to attend centre or university-led lectures. This means you can be based full time in your placement school to benefit from immersion in the school environment from the very start of your training. \r\n\r\nTeacher Training Enhancement Programme (TTEP) \r\nThe TTEP suite of online resources takes you through the Professional Studies 1 and Subject Studies that you need at the start of your teacher training. Professional Studies 2 builds on this to extend and improve your teaching. This is supported by our pedagogy sessions that are aligned with the Teachers’ Standards to provide coherent examples of best practice. \r\n\r\nAccess to your dedicated online support package \r\nThis is a suite of online facilities that allows trainees’ progress on the ITT to be tracked. This includes tools for lesson observations, mentor meetings, evidence tracking, and checkpoint assessments against the Teachers’ Standards.\r\n\r\nSchool-based mentor support \r\nYou will have a dedicated school-based mentor who will help you to integrate into the school and offer support and advice during the training year. \r\nDedicated support via NOTT tutor \r\nYour dedicated NOTT tutor will support you through your training and will work with you and your mentor to help you gain QTS. ","interviewProcess":"At NOTT we believe that our children deserve the very best teachers and therefore our selection process is rigorous.  It consists of four elements:\r\n\r\n- interview\r\n- taught session or lesson planning task\r\n- subject knowledge test\r\n- grammar & arithmetic test\r\n\r\nThese four elements combine to allow us to assess your potential to train to teach with NOTT.  The interview allows us to get to know you as a person, your interests and rationale for applying.  The taught session or lesson planning task enables you to show you natural flair and how you interact with children.  The subject knowledge test is used to identify areas for work before you start, and the grammar and arithmetic tests ensure that all trainees have sound skills in these essential areas.\r\n","howSchoolPlacementsWork":"You will be completing your main placement at your employing school. However, it is important to note that you will also be required to complete a contrasting placement at another school. If your main placement is at a special school your contrasting placement will need to be in a mainstream school. You cannot gain QTS without a contrasting placement and salaried apprentices are not exempt from this.","personalQualities":"We are looking for the best teachers for our children, so we want you to have a real desire to see them succeed.  It is important that you are enthusiast about your subject - you will be teaching it for the foreseeable future, so you need to enjoy it!  Finally, you need to be proactive, ready to put yourself out there to make a difference.","otherRequirements":"All applicants will be subject to and enhanced DBS check and a fitness to teach questionnaire carried out by occupational health.\r\n\r\nThis is an Apprenticeship course. Applicants need to be employed in a school and have prior approval from their employing headteacher.","status":1,"createdAt":"2021-07-06T10:53:43.533Z","updatedAt":"2021-09-30T12:41:52.642Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024"}
