{"id":"397b2d5c-5fa9-4121-ac0b-1f9715758600","name":"Chemistry","code":"2QDV","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"912d4fb4-761b-42e9-8dc6-e968b791ea4e","code":"F1","name":"Chemistry"}],"locations":[{"id":"5cf062c2-1bec-4772-8357-ce7a3deea83d","name":"George Stephenson High School","isPublished":"N","status":"S","vacancies":"F"},{"id":"a3b36a7e-21a3-4c5a-a5be-95fcac4380ec","name":"The King Edward VI High School Partnership","isPublished":"Y","status":"R","vacancies":"F"},{"id":"7ce31e6b-6d6c-4d33-b73b-a7a02406b513","name":"Prudhoe Community High School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"ccd4d47c-4306-461e-8509-f20453012f17","name":"Ponteland High School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"09175428-814d-451e-9f84-3c08b89bc8a1","code":"19E","name":"The Three Rivers Teaching School Hub"},"accreditedBody":{"id":"db2188d3-0047-44ee-92d2-64d1b5e1a939","code":"N21","name":"University of Newcastle Upon Tyne"},"profPost":"BO","degreeGrade":"0","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feesInternational":9250,"feeDetails":"Payable to the University.","financialSupport":"Support is available to assist you with your training.\r\n\r\nFor up to date information regarding grants, loans and bursaries please visit the Get Into Teaching website.","aboutCourse":"School Direct is a way for passionate and enthusiastic people to train to become teachers. You will be trained in a highly professional and supportive environment and will develop the skills, knowledge and expertise that will enable you to plan and deliver engaging learning experiences for pupils of all abilities and dispositions.\r\n\r\nTrainees are based in schools from the first day of term and spend the majority of their time in a school environment in order to learn hands on.\r\n\r\nYou will receive training from both Newcastle university and across our network of schools on areas such as lesson planning, behaviour for learning, assessment and progress, giving you a wider perspective on aspects of pedagogy and beyond. You will also receive subject specific training through specific subject days at the University, as well as the knowledge of the department from your school\r\n\r\nAs part of this course you will gain qualified teacher status, and work with Newcastle university to achieve a PGCE with 60 Masters credits. You are assessed during your two formal placements (short placement 4-6 weeks, long placement 10-12 weeks) by weekly observations. You will write three assignments for the university over the course of the year based on academic research and your own practice. You will also be assessed against your training towards the teacher standards via reflective evaluations of your lessons.\r\n\r\nThroughout all of this you will receive support both in school, from your subject mentor and professional tutor, and from the university from a subject link and a progress tutor.","interviewProcess":"As you have chosen a specific school which you would like to train within our network you will be interviewed at that school.  On the interview panel will be  a member of the Three Rivers Teaching School Hub, the subject leader and possible a member of the senior leadership team.\r\n\r\nIf the school place you have applied to gets filled, you may be asked to attend an interview at another school instead.\r\n\r\nThe interview process will consist of planning and teaching a 20 minute lesson, an individual interview and in some cases a subject knowledge test.\r\n\r\nMathematics and English skills tests are no longer required. \r\nAssessments of English and Mathematics knowledge will be made at interview","howSchoolPlacementsWork":"We are in partnership with schools across Northumberland, North Tyneside and Newcastle. If you are successful you will be assigned to the school which you have applied (or an alternative as discussed at interview if this place is full). This is known as your host school and you will spend the majority of your training year at this school.\r\n\r\nAs part of the course you will also go on a short placement for 8 - 12 weeks, which could be at any school in our wider partnership, which could be Northumberland, North Tyneside and Newcastle . We will take in account your travel arrangements when placing you, however you are required to train in two contrasting schools so some travel will be required.\r\n\r\nAcross the year you will teach ages 11 - 16 across key stages 3 and 4 with sixth form enhancement.","personalQualities":"Evidence of an interest and enthusiasm for teaching young people.\r\n\r\nStrong specialist knowledge of the subject you wish to teach.\r\n\r\nSchool experience is essential if you are interested in becoming a teacher. Before you apply for teacher training, it is advisable to gain as much experience in the classroom as possible. Spending time in a classroom is the ideal way to strengthen your application. School experience gives you the chance to watch lessons and see for yourself what it’s really like to be a teacher – and allows you to draw on your own examples in your application and interview.\r\n\r\n\r\n","otherRequirements":"You will be required to undergo a Disclosure and Barring Service (DBS) check to verify your suitability for working with children and young people.\r\n\r\nExperience within a school in the last 2 years is favourable.","status":1,"createdAt":"2021-07-12T13:48:59.672Z","updatedAt":"2021-10-01T08:52:37.310Z","canSponsorStudentVisa":"yes","cycle":"2024"}
