{"id":"702728de-132b-4af3-829a-0ed2f70eb05c","name":"Primary","code":"29HC","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"20d94cdc-309b-46e1-8062-1a8ff451230b","name":"Morpeth Primary Partnership","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"09175428-814d-451e-9f84-3c08b89bc8a1","code":"19E","name":"The Three Rivers Teaching School Hub"},"accreditedBody":{"id":"b384b008-59e2-461e-a15f-3551d1165c1e","code":"N77","name":"University of Northumbria at Newcastle"},"profPost":"BO","degreeGrade":"0","english":"1","maths":"1","science":"2","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feeDetails":"Payable to the University.","financialSupport":"Support is available to assist you with your training.\r\n\r\nFor up to date information regarding grants, loans and bursaries please visit the Get Into Teaching website.","aboutCourse":"Our Primary School Direct programme is a way for passionate and enthusiastic people to train to become teachers. You will be trained in a highly professional and supportive environment and will develop the skills, knowledge and expertise that will enable you to plan and deliver engaging learning experiences for pupils of all abilities and dispositions.\r\nTrainees are based in schools from the first day of term and spend the majority of their time in a school environment in order to learn “hands on”.\r\nYou will receive training from both Northumbria University and our partnership of schools in areas such as lesson planning, behaviour for learning, assessment and progress, giving you a wider perspective on aspects of pedagogy. You will also receive subject specific training in English, Maths and some foundation subjects, facilitated by our team of Specialist Leaders of Education (LSEs).\r\nAs part of this course you will gain qualified teacher status, and work with Northumbria University to achieve a PGCE with 60 Masters credits. You will complete three assignments for the university over the course of the year based on academic research and your own practice.\r\nYour teaching will be assessed during your two formal placements (a short placement of 5 weeks and a long placement of 10 weeks) by weekly observations. You will compile an Individual Learning and Development Portfolio (ILDP), which will contain the evidence which demonstrates that you have achieved the Teachers Standards.\r\nThroughout the year you will receive support both in school, from your subject mentor and lead school mentor, and at university from your academic tutor.\r\n","interviewProcess":"Candidates will be interviewed centrally by a panel consisting of the Lead School Mentor and headteachers from partner schools. Successful candidates will then be matched to one of our partner schools.\r\nThe interview process will consist of planning and teaching a 20 minute lesson, a short presentation, and an individual interview.\r\n\r\nEnglish and Mathematics skills tests are no longer required. \r\nAssessments of English and Mathematics knowledge will be made at interview.\r\n","howSchoolPlacementsWork":"We are in partnership with schools in Northumberland. If you are successful you will be assigned to one of our partner schools. This is known as your host school and you will spend the majority of your training year at this school.\r\nAs part of the course you will also complete a short placement for 6 -8 weeks, which will be at another school in our partnership. We will take into account your travel arrangements or other circumstances when placing you, however you are required to train in two contrasting schools so some travel may be required.\r\nAcross the year you will teach in both Key Stage 1 and Key Stage 2.\r\n \r\n","personalQualities":"Successful candidates will demonstrate:\r\n·         Evidence of an interest and enthusiasm for working with younger learners.\r\n·         Enthusiasm, passion and stamina\r\n·         Good communication skills.\r\n·         Resilience\r\n·         Good organisation\r\n·         Ability to work in a team\r\n·         Ability to self-reflect, listen to advice and improve\r\nIt is advisable to gain as much experience in the classroom as possible to strengthen your application. School experience gives you the chance to watch lessons and see what it is really like to be a teacher allowing you to draw on your own examples in your application and interview.","otherRequirements":"You will be required to undergo a Disclosure and Barring Service (DBS) check to verify your suitability for working with children and young people.\r\n","status":1,"createdAt":"2021-07-06T10:52:59.609Z","updatedAt":"2021-10-01T09:39:26.692Z","canSponsorStudentVisa":"yes","cycle":"2024"}
