{"id":"6cb98f87-737c-43e2-9d64-8188ab6b88ad","name":"Religious Education","code":"2V49","qualification":"qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"724b5d16-28dd-4431-bc17-ea4be4daedc4","code":"V6","name":"Religious education"}],"locations":[{"id":"41a4d46a-2f9f-46f9-9e4e-70d4bd3ee423","name":"Archbishop Tenisons C of E HIgh School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"75c8ec96-153d-4f8c-ba5a-e26f573d4f9e","name":"The Quest Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"fdfbb3ab-242f-4283-b92c-a66fd4a8bafc","name":"Warlingham High School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"da7df873-6263-4787-bd58-2fa80a9ebeac","name":"All Secondary schools","isPublished":"Y","status":"R","vacancies":"F"},{"id":"5269be6c-eb8b-48b0-b5eb-9a1f86f6cb92","name":"Riddlesdown Collegiate","isPublished":"Y","status":"R","vacancies":"F"},{"id":"77a5712a-8262-435b-be3f-d9e66177624b","name":"Thomas More Catholic School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"529ba7a4-f3e8-42cc-b235-e420ac1deb59","code":"1J1","name":"South East Learning Alliance"},"accreditedBody":{"id":"252d7e03-741e-4453-b6a8-3d361e6c9d1b","code":"E69","name":"e-Qualitas"},"degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"* Hold an undergraduate degree conferred by a UK higher education institution or an equivalent qualification (2:2 degree classification or better). Applicants will be expected to have an approved first-class or upper-second degree in Religious Studies or affiliated subjects with a strong theological or philosophical dimension, such as philosophy or anthropology.\n\n* Have achieved at least a grade C in both Mathematics and English Language GCSEs (or approved equivalents). \n\n* Applicants are expected to have significant work experience in an educational setting, prior to submitting an application to qualify for the salaried route.","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","aboutCourse":"The School Direct package offered by the South East Learning Alliance is one that allows prospective teachers to gain an opportunity to train in a dynamic educational setting located across nine highly different, but successful schools. The Alliance comprises of four comprehensive secondary schools and five primary schools, all of whom are working in partnership to help produce high quality and well-trained teachers of the future. The South East Learning Alliance is very proud of the bespoke and personal training opportunities we offer our students, which we believe is paramount to successfully completing your teacher-training. \r\n\r\n* Applicants who opt to train through the Salaried School Direct route, will have a timetable of classes from the outset of their training year, which is complimented by the online tutorials and distance-learning modules e-Qualitas delivers\r\n\r\n* In addition to a subject-specific Mentor within your host-school; the partner University also offers a learning-Mentor to support you in the completion of the written assignments you will undertake across the year, which focusses on the theoretical approaches to pedagogy and effective classroom practice \r\n\r\n* You will train across two diverse placement schools, ensuring you have the confidence to teach in any educational setting\r\n\r\n* In addition to the written assignments; trainees will also be assessed on their classroom practice; their ability to meet the National Teaching Standards; their interactions with students and ability to plan and deliver high quality lessons","interviewProcess":"At interview applicants will be given the opportunity to visit one of our Alliance schools. This provides an excellent opportunity to meet a variety of colleagues; tour the facilities and to gain a greater understanding of the opportunities on offer as a result of choosing to train with the South East Learning Alliance. It also affords an opportunity for applicants to better understand the ethos and culture of the school you may be working in partnership with.\r\n\r\nYou will be expected to prepare for a formal interview panel; plan and deliver a 30-50 minute lesson; complete a subject-knowledge task and undertake a written communication task. The interview panel will consist of a subject-specialist from the host school; a representative from the South East Learning Alliance and often a University representative.  \r\n\r\nWhilst the interview process is both rigorous and robust - we have experienced great success with this practice; ensuring the right candidates progress onto the right courses - leading to excellent rates of retention.","howSchoolPlacementsWork":"With our School Direct programme, you get practical, hands-on experience in two contrasting placement schools. The majority of your training will take place in your host school, where you will be fully supported by a subject specific Mentor and become a fully established member of the staffing body. This is in addition to benefiting from the wealth of expertise and experience our partner Universities offer our students, which fully compliments the training received in school. \r\n\r\nYou will also benefit from training in an alternative placement school for at least 5 weeks; where the South East Learning Alliance takes great time and care placing the trainees; ensuring the alternative setting fully supports the individual needs of each student, whilst still offering a diverse experience. All of our trainees will have an opportunity to teach across the age range. \r\n\r\nThe hands-on practice gained by completing a School Direct programme is complimented with the theoretical and academic rigour of our affiliated Universities. We offer full-time School Direct courses, which run from September – July and each course results in QTS (e-Qualitas). ","personalQualities":"* A sense of humour \r\n* Genuine concern for others & a clear moral purpose\r\n* Resilient and determined \r\n* Integrity, trusted, honest and open \r\n* Accessible and approachable \r\n* Intellectual versatility \r\n* Ability to show initiative\r\n* Adaptable & a team-player \r\n* A willingness to participate in extra-curricular activities and evening events such as concerts, awards evening, extra-curricular clubs \r\n* A positive attitude  \r\n","otherRequirements":"* If you do not currently hold a GCSE grade C or above in Mathematics and English Language, please note that we accept the equivalency tests in both Mathematics and English offered by Equivalency Testing. Please contact them directly via their website [http://www.equivalencytesting.com]\r\n\r\n* Provide the details of two referees. If candidates have studied within the last 5 years; an academic reference must be provided. The other reference should be a school or employer's reference. \r\n\r\n\r\n","status":1,"createdAt":"2021-07-06T10:49:27.651Z","updatedAt":"2021-10-01T04:31:00.414Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"Salary negotiable. \r\nThe salary will be awarded using the Unqualified Teachers Pay Scale; the details of which can be found here: [https://getintoteaching.education.gov.uk/funding-and-salary/teacher-salaries]\r\nThe final salary decision will be based upon experience, location of the host-school, qualifications and subject-specialism. "}
