{"id":"8a39f86f-466a-4baf-832e-dd08fee0fab3","name":"Classics","code":"2VMG","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"0238281a-b738-45a5-88bb-b426a2a562e1","code":"Q8","name":"Classics"},{"id":"fa7ee0d3-4cd4-475a-9280-f6b63b0dc466","code":"A0","name":"Latin"}],"locations":[{"id":"5269be6c-eb8b-48b0-b5eb-9a1f86f6cb92","name":"Riddlesdown Collegiate","isPublished":"Y","status":"R","vacancies":"F"},{"id":"da7df873-6263-4787-bd58-2fa80a9ebeac","name":"All Secondary schools","isPublished":"N","status":"S","vacancies":"F"},{"id":"41a4d46a-2f9f-46f9-9e4e-70d4bd3ee423","name":"Archbishop Tenisons C of E HIgh School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"529ba7a4-f3e8-42cc-b235-e420ac1deb59","code":"1J1","name":"South East Learning Alliance"},"accreditedBody":{"id":"36425fae-da68-4e79-89de-8b41ea733c37","code":"K60","name":"King’s College London (University of London)"},"profPost":"BO","degreeGrade":"0","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"* A Bachelor's degree with at least 2:1 honours (or overseas equivalent), preferably in classics, classical civilisation or ancient history.\nYour level of Latin will need to be at least AS level grade A (or the equivalent) and this will be assessed at interview through a translation exercise.\n* GCSE English and Maths - all applicants must possess a grade C/Grade 4 in GCSE English and Maths. \n* Applicants that do not possess a grade C in both subjects must take and pass an equivalency test prior to commencing the course.","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feesInternational":19320,"feeDetails":"Students undertaking certain programmes and courses may be required to pay an additional fee to cover part or all the cost of special equipment, consumables or facilities over and above the tuition fee. Where applicable these mandatory course costs include field trips, travel costs and attendance at performances. We encourage you to check with the relevant course pages when you choose your programme of study so that you are aware of any extra costs you will incur.","financialSupport":"This course is eligible for the Government’s teacher training bursary scheme. For information regarding government training bursaries please visit: [www.education.gov.uk/get-into-teaching/funding/postgraduate-funding] or contact the King’s Admissions Team.\r\nPlease note training bursaries are only available to students who have been classified as Home/EU for fee purposes.\r\n","aboutCourse":"The School Direct package offered by the South East Learning Alliance is one that allows prospective teachers to gain an opportunity to train in a dynamic educational setting located across ten highly different, but successful schools. The Alliance comprises of four comprehensive secondary schools and six primary schools, all of whom are working in partnership to help produce high quality and well-trained teachers of the future. The South East Learning Alliance is very proud of the bespoke and personal training opportunities we offer our students, which we believe is paramount to successfully completing your teacher-training. \r\n\r\n* Trainees spend approximately 80% of their training in schools; across two diverse placements - ensuring our teachers graduate with the confidence to teach in any educational setting\r\n\r\n* The remaining 20% is spent at University; embarking on an academically rigorous study of pedagogy and education, which is assessed through the completion of three written assignments\r\n\r\n* In addition to the written assignments; trainees will also be assessed on their classroom practice; their ability to meet the Teaching Standards; their interactions with students and ability to plan and deliver high quality lessons\r\n\r\nThe in-school training students receive is complimented by our partner University, where the learning is subject-specific and helps to fully prepare you for delivery of the National Curriculum. Further details about the individual subject courses and programme of study can be found here: [https://www.kcl.ac.uk/study/postgraduate/taught-courses/pgce-latin-with-classics.aspx]\r\n","interviewProcess":"At interview applicants will be given the opportunity to visit one of our Alliance schools. This provides an excellent opportunity to meet a variety of colleagues; tour the facilities and to gain a greater understanding of the opportunities on offer as a result of choosing to train with the South East Learning Alliance. It also affords an opportunity for applicants to better understand the ethos and culture of the school you may be working in partnership with.\r\n\r\nYou will be expected to prepare for a formal interview panel; plan and deliver a 30-50 minute lesson; complete a subject-knowledge task and undertake a written communication task. The interview panel will consist of a subject-specialist from the host school; a representative from the South East Learning Alliance and often a University representative.  \r\n\r\nWhilst the interview process is both rigorous and robust - we have experienced great success with this practice; ensuring the right candidates progress onto the right courses - leading to excellent rates of retention.","howSchoolPlacementsWork":"With our School Direct programme, you get practical, hands-on experience in two contrasting placement schools. The majority of your training will take place in your host school, where you will be fully supported by a subject specific Mentor and become a fully established member of the staffing body. This is in addition to benefiting from the wealth of expertise and experience our partner Universities offer our students, which fully compliments the training received in school. \r\n\r\nYou will also benefit from training in an alternative placement school for at least 5 weeks; where the South East Learning Alliance takes great time and care placing the trainees; ensuring the alternative setting fully supports the individual needs of each student, whilst still offering a diverse experience. All of our trainees will have an opportunity to teach across the age range. \r\n\r\nThe hands-on practice gained by completing a School Direct programme is complimented with the theoretical and academic rigour of our affiliated Universities. We offer full-time School Direct courses, which run from September – June and each course results in QTS (e-Qualitas), with many also awarding a PGCE and Master’s-level credits as well (Kings).","personalQualities":"* A sense of humour \r\n* Genuine concern for others & a clear moral purpose\r\n* Resilient and determined \r\n* Be able to clearly express yourself with a good standard of spelling and grammar\r\n* Integrity, trusted, honest and open \r\n* Approachable \r\n* Intellectual versatility \r\n* Ability to show initiative\r\n* Adaptable & a team-player \r\n* A willingness to participate in extra-curricular activities and evening events such as concerts, awards evening, extra-curricular clubs \r\n* A positive attitude  \r\n","otherRequirements":"* You should demonstrate awareness of what good teaching entails (or why some teaching you experienced was bad)\r\n* Previous experience of teaching or voluntary work in a school is desirable. To strengthen your application, it would be beneficial to spend at least one day observing your subject being taught in a UK state secondary school and refer to the experience in your application.\r\n","status":1,"createdAt":"2021-07-06T10:49:28.431Z","updatedAt":"2021-10-01T04:32:40.600Z","canSponsorStudentVisa":"no","cycle":"2024"}
