{"id":"3d075833-0cf2-4189-8983-5aea161491c2","name":"Primary","code":"25QJ","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"0ee687b5-d41f-4276-8cc0-9e0065600691","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"da22fdaa-acc6-495d-9923-ea4cad2f0e74","code":"1SP","name":"Middlesbrough Schools’ Teaching Alliance"},"accreditedBody":{"id":"b011427a-6dff-4a77-9df3-c85a54be605a","code":"Y75","name":"York St John University"},"profPost":"BO","degreeGrade":"1","english":"2","maths":"2","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"Candidates will be required to use an equivalency testing service for which there will be a charge.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Pallister Park Primary School leads an alliance of primary schools providing a PGCE Primary School Direct full time course run in partnership with York St John University. It covers the 3 – 11 age range. Trainees can choose to focus on either the 3 – 7 or 7 – 11 age range. \r\n\r\nThe training programme consists of school experience in two schools combined with taught sessions of subject knowledge, pedagogy and academic assignments at the university and partnership schools. You receive a comprehensive induction prior to commencing the course. \r\n\r\nPlacements involve opportunities to observe teaching, to work collaboratively, and to progressively increase the percentage of independent teaching.  We feel it is important for you to feel welcome in the school community and valued as members of staff from the start of your training. You will also attend school meetings e.g. staff meetings, participate in school training days and other professional development events as appropriate. You are given the opportunity to participate in all aspects of school life and the wider school context.\r\n\r\nThere is strong support provided by school staff, mentors and university staff.  Pallister Park and the university work together to ensure that student teachers become creative educators in a supportive and encouraging environment.\r\n\r\nThe key aim of the PGCE primary programme is to deliver a high quality, current and relevant programme of training that equips you with the professional knowledge, understanding, skills and attributes that you need to become outstanding teachers and leaders in primary schools.\r\n\r\nAssessments are varied and include assignments, portfolios and presentations within and alongside school experience.  These are designed so that you can demonstrate the appropriate skills required of a 21st century primary teacher. \r\n\r\nThe progressive nature of school experience and immersion into the life of the school ,which is a distinctive part of the School Direct approach, will enable you to progress effectively by building upon your developing skills.  The time in school will ensure you receive the required 120 days of school-based training on primary postgraduate courses of one year’s duration.\r\n\r\nThe programme leads to the award of a PGCE with a recommendation for Qualified Teacher Status. Successful completion of the professional development modules also count as 60 credits towards a Masters degree.\r\n","interviewProcess":"Pallister Park Primary School is the designated lead school and will co-ordinate and participate in the recruitment process with York St John University. Applications will be shortlisted and the selection process takes place in schools with the involvement of school and university staff.\r\n\r\nThe recruitment process is rigorous and thorough. It is designed to enable Pallister Park and York St John University to assess each candidate's suitability for training and to appoint the best candidates for the places available.  \r\n\r\nSelection is based on evidence given throughout the application process. These include,for example, the  personal statement, references, detailed breakdown of degree content, details of other academic, professional or vocational qualifications and evidence of prior experience and achievements.\r\n\r\nAt interview candidates will be required to engage with pupils in delivering a teaching task and undertake other tasks which assess your suitability to join the School Direct programme.  This will also include a formal interview to further explore the candidate's subject knowledge, knowledge of primary education and suitability for training. This may alter during Covid and we have made arrangements for interviews to be on line if necessary\r\n\r\n\r\nSelection is based on evidence given throughout the application process including the time spent in school and in formal interview \r\n\r\nAt the end of the interview process participating staff will collectively consider each candidate's suitability for a place on the course. We aim to tell candidates their outcome on the day of the interview.\r\n","howSchoolPlacementsWork":"We take great care in matching successful School Direct applicants to their host school. In 2022/23 we anticipate 25 primary schools will engage in the programme along with many other schools who may offer diversity placements for short periods. It is important to us that your host school, as well as your consolidation placement in a second school in the spring term, meet your professional learning needs as well as those of the schools engaged. \r\n\r\nAll our placement schools are experienced in working with colleagues training to be teachers. You will have the opportunity to work alongside highly effective practitioners in the classroom whilst being guided and supported by school based and University mentors.\r\n\r\nYou will gain full information about your placements in our Keeping in Touch (KIT) programme prior to the course starting and through our on-going communications with you as your course progresses.\r\n\r\nSchool experience will closely complement taught elements of the programme, ensuring that student teachers are able to deepen their pedagogical knowledge. Student teachers will have opportunities within their school-based practice to observe young people in classes and will be encouraged to reflect upon their observations and related tasks within their own studies.\r\n\r\nPallister Park, Green Lane and University-based staff work closely together to support you in developing your professional practice and provide excellent opportunities for you to engage with professional issues related to both the primary curriculum and wider educational issues.  \r\n\r\nA strength of the school-centred programme is that it draws upon the expertise of school-based practitioners in highly effective schools to support you in developing your subject knowledge and pedagogical skills.\r\n\r\nWe want you to feel 'professional' from the first moment you meet with your placement schools. This supportive theme permeates all we do in making you feel a valued member of the school community.\r\n\r\nOur belief is that our unique offer is based on the fact that we see School Direct as a 'family thing' where you will join with other trainees, your tutors and mentors in making the very best of each opportunity afforded to you on your placements.","personalQualities":"\r\nWe are looking for trainee teachers with passion, commitment and drive. You must have the academic rigour and at times a highly practical and pragmatic approach that sees you 'roll up your sleeves' and pitch in with our learning communities. \r\nWe will need to see this evidenced before we consider offering you a place at both application and interview stages. And even more so we will need to see it in 'bucket loads' throughout your training programme as our children, and the professional staff you work with, simply deserve the best future generation of teachers we can find. \r\n\r\n","otherRequirements":"\r\nApplicants must satisfy the Univeristy that they have the intellectual capability for the demands of teaching, that they are physically and mentally fit for teaching and that there is no evidence of a criminal background that should prevent them from working with children or young people. All successful applicants will need to satisfy the University that they meet these criteria through an enhanced DBS check and the submission of a medical health questionnaire to the YSJU Medical Service, who may then require additional reports/examinations to determine fitness to undertake the programme.\r\n","status":1,"createdAt":"2021-07-06T10:53:25.348Z","updatedAt":"2021-10-11T11:18:21.919Z","canSponsorStudentVisa":"yes","cycle":"2024"}
