{"id":"1b50e443-d9c2-4a99-9ab8-9da7292942d1","name":"Drama","code":"AW63","qualification":"pgce_with_qts","startDate":"2022-07-31T23:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"69052223-ca45-4781-a8d3-cb92447a6d78","code":"13","name":"Drama"},{"id":"e6be6a9c-8696-4b88-8fbd-1ba1bef1b6fc","code":"11","name":"Computing"}],"locations":[{"id":"ead9cccc-4da2-4474-a1ec-bd11784d8687","name":"Main Site","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"f133165e-ee8b-49e2-8ec6-5c578ed3cbe1","name":"Highfields Secondary School","isPublished":"false","status":"new","vacancies":"full_time"}],"trainingProvider":{"id":"35c8e5db-962f-4791-aa46-58d58b9d53c9","code":"195","name":"Loughborough Learning Alliance"},"accreditedBody":{"id":"aa023df3-b71e-4249-b9c4-41fca8bd135e","code":"D39","name":"University of Derby"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feeDetails":"https://www.ucas.com/ucas/teacher-training/finance-and-support-trainee-teachers","aboutCourse":"This course is offered through the School Direct Tuition route in partnership with the University of Wolverhampton. Successful completion of this route will lead to recommendation for the award of Qualified Teacher Status (QTS), along with 40 credits at Master’s level that can be used towards our Masters degree in education.\r\n\r\nThis year long, full-time course will train you to teach secondary school pupils aged 11-18. (120 days in school; 50 days approx at university)\r\n\r\nThe course structure includes a block placement in the Autumn Term, with university based professional development days each week. This is followed by  a second placement in a partner school in the Spring Term, which includes 1 week in a partner primary school.\r\n\r\nDuring your training you will spend the majority of your time in your placement school, during which time you will be required to teach across two different key stages.\r\n\r\nStudent teachers will be assessed throughout the year by a university based tutor alongside the school based professional tutor and subject mentor (School based tutor).\r\nThis will be through formal professional development and learning activities, school based core written tasks and lesson observations.Student teachers will meet weekly with their school based tutor and engage in a programme of school based training alongside the university training.\r\nA record of professional development will be completed across the year as a formative and summative record of a student teacher's progress towards the Teachers' Standards.\r\n \r\n\r\n","interviewProcess":"Following the application to UCAS, the University of Wolverhampton will complete the initial eligibility checks. If the applicant is successful, they will be invited to an interview/ assessment day which will be jointly led by the University of Wolverhampton and colleagues from the ConnectEd School Direct Secondary Partnership. \r\n\r\nThe interview/assessment day will  comprise a formal presentation, a literacy and numeracy task, a subject knowledge activity to assess subject proficiency with a group of young people, followed by a formal interview.\r\n\r\nCandidates will be informed of the outcome of the interview via the UCAS portal.","howSchoolPlacementsWork":"Student teachers will complete a total of 2 school placements across the year. The main block placement will take place in  Highfields Secondary School with the second placement in Aldersley High School.\r\n\r\nThe schools are situated within 5 miles of each other to the north and south of Wolverhampton.\r\n\r\nThe primary placement week will take place in a local partnership school.","personalQualities":"The interviewers will be looking for you to demonstrate a range of qualities which will include:\r\n*A love of their subject and motivation to enthuse others\r\n*A commitment, and understanding of secondary education and the role of the teacher\r\n*A positive attitude towards  working with children and young people\r\n*Ability to self-evaluate, to problem solve and to show resilience\r\n*Ability to build relationships quickly, to value others and to get the best out of them\r\n*Good general knowledge and clear, accurate spoken and written English\r\n*A desire to make a difference to Wolverhampton children's futures","otherRequirements":"","status":2,"createdAt":"2021-07-06T10:55:57.680Z","updatedAt":null}