{"id":"47dc457f-e22f-4530-87c6-8517320ce4c3","name":"Chemistry","code":"AW60","qualification":"pgce_with_qts","startDate":"2024-07-31T23:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"912d4fb4-761b-42e9-8dc6-e968b791ea4e","code":"F1","name":"Chemistry"}],"locations":[{"id":"ead9cccc-4da2-4474-a1ec-bd11784d8687","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"35c8e5db-962f-4791-aa46-58d58b9d53c9","code":"195","name":"Loughborough Learning Alliance"},"accreditedBody":{"id":"aa023df3-b71e-4249-b9c4-41fca8bd135e","code":"D39","name":"University of Derby"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feeDetails":"Studying for a postgraduate degree is a good investment in your future, but you need to carefully consider how you’re going to pay for your course and your living costs.\r\n\r\nMost students will be able to apply for loans and depending on where you live and your circumstances, bursaries and scholarships might also be available.\r\n\r\nThe University of Derby postgraduate degrees are competitively priced and all the essential equipment and activities are included.\r\n\r\nThe fees are slightly different depending on whether you normally live in the UK/EU or outside of the EU.","financialSupport":"To pay for your tuition fees and living costs, you may be able to take out a student loan. These loans don’t usually need to be paid back until you have graduated and are earning a good salary.\r\n\r\nSometimes, bursaries and scholarships are also available - it depends on your circumstances and which country you usually live in. These don’t need to be paid back.\r\n\r\nPlease visit our website for more information [www.derby.ac.uk] or call our helpline on 01332 592000","aboutCourse":"•\tNorth Charnwood Learning Partnership (NCLP) is a well-established partnership of secondary schools based in Loughborough and the surrounding area.\r\n\r\n•\tAshmount School is the lead school for the School Direct programme and there are eight Secondary Schools in the partnership – Limehurst Academy, Castle Donington College, Charnwood College, Humphrey Perkins, Iveshead School, Maplewell Hall School, Rawlins Academy and Woodbrook Vale.\r\nIn addition, we have built strong links with specialist departments in schools outside of our partnership.\r\n\r\n•\tSchool Direct is an innovative training programme open to enthusiastic, high quality graduates or professionals who want to be part of a school team from day one whilst working alongside outstanding practitioners.\r\n\r\n•\tYou may be eligible for a bursary of up to £30,000 to support you while you train, depending on your degree classification and the course you’re applying for.\r\n\r\n•\tWe are passionate about teacher training and at the centre of our programme is a commitment to providing the best possible education for our pupils.  \r\n","interviewProcess":"If you are successful, you will be invited to interview at Ashmount School in Loughborough.\r\n\r\nYou will be interviewed by the Teaching School Manager and another Senior Leader (i.e. Headteacher from a Member School).\r\n\r\nThere will be some activities to complete on the day but we will advise you what we would like you to prepare prior to your interview.","howSchoolPlacementsWork":"•\tTraining lasts for one academic year starting at the end of August.\r\n\r\n•\tWe organise 2 Secondary school placements to give you a range of experience over the year across Key Stage 3 - Key Stage 5.\r\n\r\n•\tYou will be based for 4 days per week in your placement school, and the other day is spent at either Ashmount School or the University of Derby undertaking core training.\r\n\r\n•\tKey training is led by experienced and specialist leaders, including University staff, Headteachers, SLEs and successful teachers.\r\n\r\n•\tYou will also spend 2 days in a SEND placement and 1 week in a Primary School.","personalQualities":"If you have the motivation, commitment, resilience and ability to inspire a love of learning, then this is the course for you.","otherRequirements":"A Disclosure and Barring Service (DBS) check is required at the point of accepting a place at the University. ","status":1,"createdAt":"2021-07-06T10:51:53.736Z","updatedAt":"2021-09-10T13:22:47.543Z","canSponsorStudentVisa":"yes","cycle":"2024"}
