{"id":"50c75d79-dd3a-4420-98e2-a29b378db30c","name":"Primary (5-11)","code":"2CL3","qualification":"pgce_with_qts","startDate":"2024-07-31T23:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"yes","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"ead9cccc-4da2-4474-a1ec-bd11784d8687","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"35c8e5db-962f-4791-aa46-58d58b9d53c9","code":"195","name":"Loughborough Learning Alliance"},"accreditedBody":{"id":"aa023df3-b71e-4249-b9c4-41fca8bd135e","code":"D39","name":"University of Derby"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feeDetails":"Studying for a postgraduate degree is a good investment in your future, but you need to carefully consider how you’re going to pay for your course and your living costs.\r\n\r\nMost students will be able to apply for loans and depending on where you live and your circumstances, bursaries and scholarships might also be available.\r\n\r\nThe University of Derby postgraduate degrees are competitively priced and all the essential equipment and activities are included.\r\n\r\nThe fees are slightly different depending on whether you normally live in the UK/EU or outside of the EU.","financialSupport":"To pay for your tuition fees and living costs, you may be able to take out a student loan. These loans don’t usually need to be paid back until you have graduated and are earning a good salary.\r\n\r\nSometimes, bursaries and scholarships are also available - it depends on your circumstances and which country you usually live in. These don’t need to be paid back.\r\n\r\nPlease visit our website for more information [www.derby.ac.uk] or call our helpline on 01332 592000","aboutCourse":"* Our inspirational School Direct Programme, led by Ashmount School in Loughborough, is built on a long history of successful school based Initial Teacher Training.\r\n\r\n* We work alongside the University of Derby to enable trainees to achieve Qualified Teacher Status (QTS) and a Postgraduate Certificate in Education (PGCE) with 60 Credits towards a Master's Degree too.\r\n\r\n* We have an excellent track record of our trainees achieving \"Outstanding\" or \"Good\" in their final assessments.\r\n\r\n* We help you to prepare for and secure your first teaching role and many of the schools we work with are keen to employ our trainees.\r\n\r\n* You'll be part of the teaching team in your placement school from day one, learning from experienced colleagues and putting your new skills into practice straight away.\r\n\r\n* We will support you every step of the way, with your own personal mentor and academic support from our partner University of Derby.","interviewProcess":"If you are successful, you will be invited to interview at Ashmount School in Loughborough.\r\n\r\nYou will be interviewed by the Teaching School Manager and another Senior Leader (i.e. Headteacher from a Member School).\r\n\r\nDuring the day, you will be asked to lead a sample lesson to your peers, which you will have been given information on, prior to the day.\r\n\r\nYou will also be required to complete Mental Maths and English tests along with written tests.","howSchoolPlacementsWork":"* We have approximately 25 member schools that we send trainees to, as well as a number of other local schools that we work closely with.\r\n\r\n* You can choose from three different pathways to specialise in: 3-7, 5-11 or SEND.\r\n\r\n* During the year, you will spend the Autumn and Summer Terms at your Main Placement school in one Key Stage and then the Spring Term will be spent in a contrasting Key Stage.\r\n\r\n* You will be based for 4 days per week in your placement school, and the other day is spent at either Ashmount School or the University of Derby undertaking core training.\r\n\r\n* We organise your placements for you and where possible, we try not to make you travel too far from home.\r\n\r\n* Key training is led by experienced and specialist leaders, including University staff, Headteachers, SLEs and successful teachers.\r\n\r\n* There is also the opportunity to complete Enhancement Placements in other types of schools.","personalQualities":"If you have the motivation, commitment, resilience and ability to inspire a love of learning, then this is the course for you.","otherRequirements":"* A Disclosure and Barring Service (DBS) check is required at the point of accepting a place at the University. The Disclosure and Barring Service was established when the Criminal Records Bureau (CRB) and Independent Safeguarding Authority (ISA) merged in 2012 and will now provide the criminal records checking service for this course.","status":1,"createdAt":"2021-07-06T10:51:53.223Z","updatedAt":"2021-09-10T14:28:36.539Z","canSponsorStudentVisa":"yes","cycle":"2024"}
