{"id":"9d921835-bc53-444b-a9e2-e038008502d2","name":"Primary","code":"S743","qualification":"pgce_with_qts","startDate":"2024-07-31T23:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"P","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"ead9cccc-4da2-4474-a1ec-bd11784d8687","name":"Main Site","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"35c8e5db-962f-4791-aa46-58d58b9d53c9","code":"195","name":"Loughborough Learning Alliance"},"accreditedBody":{"id":"aa023df3-b71e-4249-b9c4-41fca8bd135e","code":"D39","name":"University of Derby"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"TwoYears","feesUK":9250,"aboutCourse":"* Our inspirational School Direct Programme, led by Ashmount School in Loughborough, is built on a long history of successful school based Initial Teacher Training.\r\n\r\n* We work alongside the University of Derby to enable trainees to achieve Qualified Teacher Status (QTS) and a Postgraduate Certificate in Education (PGCE) with 60 Credits towards a Master's Degree too.\r\n\r\n* Starting in August 2020, we can now offer a Part time route into Teaching.  \r\n\r\n* We have an excellent track record of our trainees achieving \"Outstanding\" or \"Good\" in their final assessments.\r\n\r\n* We help you to prepare for and secure your first teaching role and many of the schools we work with are keen to employ our trainees.\r\n\r\n* You'll be part of the teaching team in your placement school two days a week for two years, learning from experienced colleagues and putting your new skills into practice straight away.\r\n\r\n* We will support you every step of the way, with your own personal mentor and academic support from our partner University of Derby.","interviewProcess":"If you are successful, you will be invited to interview at Ashmount School in Loughborough.\r\n\r\nYou will be interviewed by the Teaching School Manager and another Senior Leader (i.e. Headteacher from a Member School).\r\n","howSchoolPlacementsWork":"* We have approximately 25 member schools that we send trainees to, as well as a number of other local schools that we work closely with.\r\n\r\n* You can choose from three different pathways to specialise in: 3-7, 5-11 or SEND.\r\n\r\n* During the two years, you will spend time in 2 placement schools - gaining experience in both Key Stages.\r\n\r\n* You will be spend time at either Ashmount School or the University of Derby undertaking core training during the two years.\r\n\r\n* We organise your placements for you and where possible, we try not to make you travel too far from home.\r\n\r\n* Key training is led by experienced and specialist leaders, including University staff, Headteachers, SLEs and successful teachers.\r\n\r\n* There is also the opportunity to complete Enhancement Placements in other types of schools.","personalQualities":"If you have the motivation, commitment, resilience and ability to inspire a love of learning, then this is the course for you.","otherRequirements":"* A Disclosure and Barring Service (DBS) check is required at the point of accepting a place at the University. The Disclosure and Barring Service was established when the Criminal Records Bureau (CRB) and Independent Safeguarding Authority (ISA) merged in 2012 and will now provide the criminal records checking service for this course.","status":1,"createdAt":"2021-07-06T10:51:54.013Z","updatedAt":"2021-09-10T14:28:02.084Z","canSponsorStudentVisa":"yes","cycle":"2024"}
