{"id":"e19cdac6-149c-4177-a0c9-10ee495eeb4a","name":"PE (North Charnwood Learning Partnership)","code":"3FQW","qualification":"pgce_with_qts","startDate":"2024-07-31T23:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"74d64a54-5e34-4590-b6c7-528dd0cf26fe","code":"C6","name":"Physical education"}],"locations":[{"id":"ead9cccc-4da2-4474-a1ec-bd11784d8687","name":"Main Site","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"35c8e5db-962f-4791-aa46-58d58b9d53c9","code":"195","name":"Loughborough Learning Alliance"},"accreditedBody":{"id":"816ef4e7-51c7-4211-828f-dbf6bb48bb6d","code":"L79","name":"Loughborough University"},"profPost":"PG","degreeGrade":"1","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feeDetails":"Studying for a postgraduate degree is a good investment in your future, but you need to carefully consider how you’re going to pay for your course and your living costs.\r\n\r\nMost students will be able to apply for loans and depending on where you live and your circumstances, bursaries and scholarships might also be available.\r\n\r\nThe University of Derby postgraduate degrees are competitively priced and all the essential equipment and activities are included.\r\n\r\nThe fees are slightly different depending on whether you normally live in the UK/EU or outside of the EU.","financialSupport":"To pay for your tuition fees and living costs, you may be able to take out a student loan. These loans don’t usually need to be paid back until you have graduated and are earning a good salary.\r\n\r\nSometimes, bursaries and scholarships are also available - it depends on your circumstances and which country you usually live in. These don’t need to be paid back.\r\n\r\nPlease visit our website for more information [www.derby.ac.uk] or call our helpline on 01332 592000","aboutCourse":"• North Charnwood Learning Partnership (NCLP) is a well-established partnership of secondary schools based in Loughborough and the surrounding area.\r\n\r\n• Ashmount School is the lead school for the School Direct programme and there are eight Secondary Schools in the partnership – Limehurst Academy, Castle Donington College, Charnwood College, Humphrey Perkins, Iveshead School, Maplewell Hall School, Rawlins Academy and Woodbrook Vale.\r\nIn addition, we have built strong links with specialist departments in schools outside of our partnership.\r\n\r\n• School Direct is an innovative training programme open to enthusiastic, high quality graduates or professionals who want to be part of a school team from day one whilst working alongside outstanding practitioners.\r\n\r\n• You may be eligible for a bursary of up to £30,000 to support you while you train, depending on your degree classification and the course you’re applying for.\r\n\r\n• We are passionate about teacher training and at the centre of our programme is a commitment to providing the best possible education for our pupils.  \r\n\r\n• North Charnwood Learning Partnership (NCLP) has a 100% pass rate for students on our School Direct PGCE programme. \r\n\r\n• We have a strong track record of training and developing excellent teachers across KS3-5 in diverse teaching practice placements.\r\n\r\n• Our students attend weekly professional development programme (PDP) days, held within NCLP schools and run by outstanding practitioners.\r\n\r\n• We work alongside University of Derby and Loughborough University (Physical Education only) to enable trainees to achieve Qualified Teacher Status (QTS) and a Postgraduate Certificate in Education (PGCE) with 90 Credits towards a Master’s Degree too.\r\n\r\n• We will support you every step of the way, with your own personal mentor and academic support from our partner Universities.","interviewProcess":"• Successful candidates are invited to interview in Loughborough.\r\n\r\n• The school based interview involves a group activity, a student panel, spending time in a lesson, observing and interacting with students, a presentation and an interview. \r\n\r\n• You will also be required to attend a University based interview.\r\n\r\n•  Successful applicants will need to pass the QTS skills tests in Numeracy and Literacy prior to commencing the course.\r\n\r\n• For an informal chat or top find out a bit more, please [contact us ] (jessevans@ashmount.leics.sch.uk) and we will be more than happy to help.","howSchoolPlacementsWork":"• Training lasts for one academic year starting at the end of August.\r\n\r\n• You have allocated weeks that you spend at University.\r\n\r\n• We organise placements in 2 NCLP schools offering KS3-5 experience, with outstanding support from mentors.\r\n\r\n• Phase A teaching practice lasts 7 weeks and you will be required to teach between 8-10 lessons per week.\r\n\r\n• You will be based in a primary school for a 1 week placement.\r\n\r\n• Phase B teaching practice lasts 12 weeks and you will be required to teach between 13-15 lessons per week.\r\n\r\n• Throughout the course, students will meet regularly with other NCLP trainees on our excellent Professional Development Programme.","personalQualities":"Ability to form relationships:\r\n\r\nDeveloping positive relationships with both young people and adults lies at the heart of effective teaching.\r\n\r\nGood communication skills:\r\n\r\nBe able to present appropriately in small and large group situations with both adults and young people, both orally and in written communication.\r\n\r\nCommitment to learning and teaching:\r\n\r\nBe a positive role model who makes young people's learning the first concern. Be able to understand the position of trust which this role places them in.\r\n\r\nReflective qualities:\r\n\r\nBe able to analyse and reflect upon experiences.\r\n\r\nAwareness of contemporary issues in education:\r\n\r\nA commitment to on-going professional development.","otherRequirements":"We are initially looking for evidence across a range of areas, such as:\r\n\r\n•\tExperience (paid or voluntary) in maintained schools or educational-related settings, or in wider working with children or young people\r\n\r\n•\tA personal statement which shows an ability to reflect on this experience\r\n\r\n•\tAn awareness of contemporary issues both generally in education and subject specific\r\n\r\n•\tTwo references that substantiate performance to date and indicate potential (if you are an undergraduate please be advised that one of your referees should be able to comment on your predicted degree class)","status":1,"createdAt":"2021-07-06T10:51:53.319Z","updatedAt":"2021-09-03T10:15:09.309Z","canSponsorStudentVisa":"no","cycle":"2024"}
