{"id":"44ebdd96-7f8a-4b93-8716-eab1430d804c","name":"Primary (5-11) Part time","code":"Q327","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"P","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"eed37737-20f7-4141-82f2-0bdcd8b03097","name":"Keeble Gateway Academy","isPublished":"Y","status":"R"},{"id":"d20ff58c-ab90-4ffc-9a2b-5a9306b38f15","name":"Cawood C of E Primary School","isPublished":"Y","status":"R"},{"id":"5f043cbf-009d-47eb-9f3d-11d93ed10a63","name":"Fairburn Community Primary School","isPublished":"Y","status":"R"},{"id":"3fc94083-3d4f-443d-9c1d-efd567d4d405","name":"Great Ouseburn CP School","isPublished":"Y","status":"R"},{"id":"b9aaef8d-89a0-4054-9651-66d8fcdf67b1","name":"Rothwell Primary School","isPublished":"Y","status":"R"},{"id":"e7908fac-ebb2-4045-a24e-c99d881eda65","name":"Roundhay St John CofE Primary School","isPublished":"Y","status":"R"},{"id":"96411521-2411-40e1-b334-e1e4963a3b50","name":"Sowerby Primary Academy","isPublished":"Y","status":"R"},{"id":"04462a3e-f7fe-4050-b2d6-4b260e9ae9a1","name":"St Peter's Brafferton C of E Primary School","isPublished":"Y","status":"R"},{"id":"49cccb96-10f5-4e9d-8bff-6e8b2b300a77","name":"Staveley Community Primary School","isPublished":"Y","status":"R"},{"id":"115e9145-b8ae-496e-a542-c7c470669528","name":"Thorner Church of England Academy","isPublished":"Y","status":"R"},{"id":"27598c7c-6cb0-4475-8604-c64591c09e3d","name":"Knayton C of E Academy","isPublished":"Y","status":"R"},{"id":"dfd10380-bb33-4ed2-ba4b-fd0d52be9eba","name":"Meadowside Academy, Knaresborough","isPublished":"Y","status":"R"},{"id":"4a85b0dc-9e88-46f9-8533-9726214d6e2a","name":"Topcliffe C of E Academy","isPublished":"Y","status":"R"},{"id":"d9a16273-075d-4cc6-a8f9-bb5768e77327","name":"Knaresborough St John's C of E Primary School","isPublished":"Y","status":"R"},{"id":"13118067-2000-4a99-a4db-44357fde9c99","name":"Kirk Hammerton C of E Primary School","isPublished":"Y","status":"R"},{"id":"6f9d6523-be96-497d-9c90-23b781a82cab","name":"Marton-cum-Grafton C of E Primary School","isPublished":"Y","status":"R"},{"id":"16b49ebb-30e5-40e9-8daf-e37b06333ef7","name":"Aspin Park Academy","isPublished":"Y","status":"R"},{"id":"7d6ac75e-1c1f-4487-802a-eb705566f53c","name":"Carlton Miniott Primary Academy","isPublished":"Y","status":"R"},{"id":"08fba982-452a-41bd-ae29-50025eb373b3","name":"Kirkbymoorside CP School","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"fcbf4523-b2eb-4167-991d-8a75749a76af","code":"269","name":"North Star"},"accreditedBody":{"id":"4b15c2df-7f1b-4210-ba42-b1f14381e87b","code":"2B9","name":"Red Kite Teacher Training"},"profPost":"PG","degreeGrade":"1","english":"1","maths":"1","science":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We accept equivalency tests for science. Please contact us directly to discuss this.","courseLength":"TwoYears","feesUK":11000,"feeDetails":"We are unable to sponsor Tier 2 visas.","financialSupport":"Many Trainees apply for student finance in order to pay their fees with a Tuition Fee Loan and have access to Maintenance Loan. Additional financial support may be available if you’re a parent or have a disability.\r\n \r\nWe offer a monthly payment schedule for those planning to self-finance.\r\n","aboutCourse":"As a primary teacher, you will prepare children for life – academically and emotionally. You’ll encourage them to be curious about the world around them, inspiring a love of learning and empowering them to reach their full potential.\r\n\r\nOur new Part-Time Primary course is a flexible, two-year training programme designed especially for people who are passionate about teacging in this age range but who  may have family commitments or need to work while training.\r\n\r\nAltogether, over the two years, you will have more than 120 days in school for each option, ensuring that by the time you reach the end of the course, you’ll be a comfortable and confident classroom practitioner.\r\n\r\nIn addition to the days in school, you will have eight days of input over the two years with the University of Leeds as part of Red Kite’s exclusive partnership with them. This will be completed through blended online tutorials, remote learning and face-to-face lectures.\r\n\r\nThere are four PGCE academic modules across the two years and you will gain 60 masters credits – two assignments in Year 1 (30 credits) and two assignments in Year 2 (30 credits).\r\n\r\nProfessional learning days are included in the training days, although there may be an occasional requirement to attend an event such as an employment conference with peers across all programmes. There are a number of training venues spread right across the region to make this as convenient as possible.\r\n\r\nOur hybrid approach to learning combines traditional classroom experiences and digital course delivery, ensuring that you:\r\n\r\n•\tCan manage your time to meet course deadlines.\r\n•\tGet the flexibility of online learning with the stability of in-class instruction.\r\n•\tSave time travelling to training venues.\r\n•\tBenefit from a personalised training programme designed to fit around the demands of their everyday life.\r\n\r\nYou will follow a carefully designed plan to support your learning. The course is structured to make sure that you take on classroom responsibility in a systematic manner, building your confidence, pedagogy and subject knowledge.\r\n\r\nA detailed calendar and handbook provide you with all the information that you will need to plan ahead. Over the two years, you will have taught in at least two schools and in two key stages. We recommend that you stay in one school for each year of the programme.\r\n","interviewProcess":"Interviews will be held virtually on Microsoft Teams. Interviews are conducted by representatives from Red Kite Teacher Training and partnership schools.\r\n \r\nPreparation for the interview will include to plan for a pupil activity.\r\n \r\nYou will be given the opportunity to meet current trainees and course leaders.\r\n ","howSchoolPlacementsWork":"We have a big partnership of schools, meaning our trainees have flexibility when it comes to placements. Our trainees can also benefit from the placements our partners can offer, which can vary from rural settings to the buzz of the city.\r\n \r\nWhen allocating main placements, we consider trainee preferences, transport and location. Our dedicated team work hard to organise placements early, giving you as much time as possible to make arrangements.\r\n \r\nAll trainees undertake two main placements across the course duration. The placements will be in contrasting school environments.\r\n \r\nTrainees will also take part in mini placements, which give trainees a unique opportunity to broaden their experience in a range of schools and contexts.","personalQualities":"\r\n* Passionate about making a difference to the lives and development of young people\r\n* Independent, resilient and adaptable\r\n* Friendly and approachable, with the ability to engage young people\r\n* Enthusiastic about their subject and are continuing to develop their subject knowledge\r\n* Creative and imaginative\r\n* Good organisational skills and excellent time management skills\r\n* Reflective and strive to improve their own practice\r\n* High standards of spoken and written English\r\n* Demonstrate a professional attitude\r\n* Have made a considered and informed decision to train to teach\r\n","otherRequirements":"Experience of being in a school and/or working with young people is not essential, however, it will be beneficial during the application process. You can contact us to arrange experience within a school.\r\n \r\nAdmission is dependent upon satisfactory medical examination conducted by our preferred supplier. \r\n \r\nCandidates who are offered a place on the course are required to complete a declaration regarding any criminal convictions. \r\n \r\nCandidates are required to obtain clearance from the Disclosure and Barring Service (DBS) regarding their suitability for work involving children. Successful candidates will have these checks conducted at our expense.\r\n","status":1,"createdAt":"2021-07-06T10:50:18.037Z","updatedAt":"2021-10-04T14:42:24.640Z","canSponsorStudentVisa":"no","cycle":"2024"}
