{"id":"ad54ae88-edac-47db-8967-eda4f9625515","name":"Primary (5-11)","code":"2PD2","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"27598c7c-6cb0-4475-8604-c64591c09e3d","name":"Knayton C of E Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"16b49ebb-30e5-40e9-8daf-e37b06333ef7","name":"Aspin Park Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"dfd10380-bb33-4ed2-ba4b-fd0d52be9eba","name":"Meadowside Academy, Knaresborough","isPublished":"Y","status":"R","vacancies":"F"},{"id":"b9aaef8d-89a0-4054-9651-66d8fcdf67b1","name":"Rothwell Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"7d6ac75e-1c1f-4487-802a-eb705566f53c","name":"Carlton Miniott Primary Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"4a85b0dc-9e88-46f9-8533-9726214d6e2a","name":"Topcliffe C of E Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"115e9145-b8ae-496e-a542-c7c470669528","name":"Thorner Church of England Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"eed37737-20f7-4141-82f2-0bdcd8b03097","name":"Keeble Gateway Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"08fba982-452a-41bd-ae29-50025eb373b3","name":"Kirkbymoorside CP School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"49cccb96-10f5-4e9d-8bff-6e8b2b300a77","name":"Staveley Community Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"04462a3e-f7fe-4050-b2d6-4b260e9ae9a1","name":"St Peter's Brafferton C of E Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"96411521-2411-40e1-b334-e1e4963a3b50","name":"Sowerby Primary Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"13118067-2000-4a99-a4db-44357fde9c99","name":"Kirk Hammerton C of E Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"3fc94083-3d4f-443d-9c1d-efd567d4d405","name":"Great Ouseburn CP School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"d9a16273-075d-4cc6-a8f9-bb5768e77327","name":"Knaresborough St John's C of E Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"d20ff58c-ab90-4ffc-9a2b-5a9306b38f15","name":"Cawood C of E Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"e7908fac-ebb2-4045-a24e-c99d881eda65","name":"Roundhay St John CofE Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"6f9d6523-be96-497d-9c90-23b781a82cab","name":"Marton-cum-Grafton C of E Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"986a996d-1b4d-4a6c-a6ca-465a9b225c8b","name":"Romanby Primary School, Northallerton","isPublished":"Y","status":"R","vacancies":"F"},{"id":"5f043cbf-009d-47eb-9f3d-11d93ed10a63","name":"Fairburn Community Primary School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"fcbf4523-b2eb-4167-991d-8a75749a76af","code":"269","name":"North Star"},"accreditedBody":{"id":"4b15c2df-7f1b-4210-ba42-b1f14381e87b","code":"2B9","name":"Red Kite Teacher Training"},"profPost":"PG","degreeGrade":"1","english":"1","maths":"1","science":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We accept equivalency tests for science. Please contact us directly to discuss this.","courseLength":"OneYear","feesUK":9250,"financialSupport":"Many Trainees apply for student finance in order to pay their fees with a Tuition Fee Loan and have access to Maintenance Loan. Additional financial support may be available if you’re a parent or have a disability.\r\n \r\nWe offer a monthly payment schedule for those planning to self-finance.\r\n","aboutCourse":"As a primary teacher, you will prepare children for life – academically and emotionally. You’ll encourage them to be curious about the world around them, inspiring a love of learning and empowering them to reach their full potential.\r\n\r\nAt Red Kite, we offer two school-based primary routes Primary School Direct and Primary SCITT. Both based in our unrivalled partner schools network that spreads across West and North Yorkshire and both provide you with the experience and confidence to begin teaching as soon as you are qualified.\r\n\r\nThe course is multi-layered, involving:\r\n\r\n•\tRed Kite professional development days\r\n•\tSchool placements\r\n•\tUniversity lectures\r\n•\tTwilight sessions\r\n•\tConferences, tutorials and mini-placements focussed on Barriers to Learning, Special Educational Needs, Adult Mental Health, Behaviour, English as an Additional Language and Employment.\r\n•\tReading, research and reflections\r\n\r\nOur trainee success rate shows it’s a combination that will make you highly employable at the end of the course.\r\n\r\nUnlike a standard university PGCE, you will spend a full 24 weeks on in-school placements, meaning you’ll get to properly immerse yourself in school life with both pupils and colleagues. You’ll also start in school on the first day of term and get to see first hand how teachers interact with eachother and form new relationships.\r\n\r\nYour two in-school placements run alongside university sessions as part of our exclusive partnership with the University of Leeds. You’ll get to spend eight days during your training year working with the prestigious School of Education there, learning from some of the country’s leading educational researchers.\r\n\r\nSubject knowledge is supported by expert colleagues from across the partnership of schools as well as sessions delivered by curriculum hubs within our area. This includes the Computing hub, STEM learning hub, the English hub and the Maths hub.\r\n\r\nYou’ll also enjoy working with many inspirational teachers from across the partnership, showing you how they continuously strive to improve practice in the classroom, and enable progression across the full range of Primary year groups. You’ll also develop inspirational and innovative techniques to enthuse and engage young people.\r\n\r\nOn successful completion you will receive recommendation for Qualified Teacher Status (QTS) from Red Kite Teacher Training and a Postgraduate Certificate of Education (PGCE) from the University of Leeds.\r\n","interviewProcess":"Interviews will be held virtually on Microsoft Teams. Interviews are conducted by representatives from our partnership schools. \r\n \r\nPreparation for the interview will include planning for a pupil activity.\r\n \r\nYou will be given the opportunity to meet current trainees and course leaders. \r\n ","howSchoolPlacementsWork":"We have a big partnership of schools, meaning our trainees have flexibility when it comes to placements. Thanks to our partnership with Red Kite Teacher Training, and our new 'Train Where You Live' concept, our trainees can also benefit from the placements our partners can offer, which can vary from rural settings to the buzz of the city. \r\n \r\nWhen allocating main placements, we consider trainee preferences, transport and location. Our dedicated team work hard to organise placements early, giving you as much time as possible to make arrangements.\r\n \r\nAll trainees undertake two main placements. The first placement runs from the first day of the Autumn Term until December. The second placement, in a contrasting school environment, runs from January until late June. \r\n \r\nTrainees will also take part in mini placements across the year, which give trainees a unique opportunity to broaden their experience in a range of schools and contexts.\r\n","personalQualities":"\r\n* Passionate about making a difference to the lives and development of young people\r\n* Independent, resilient and adaptable\r\n* Friendly and approachable, with the ability to engage young people\r\n* Enthusiastic about their subject and are continuing to develop their subject knowledge\r\n* Creative and imaginative\r\n* Good organisational skills and excellent time management skills\r\n* Reflective and strive to improve their own practice\r\n* High standards of spoken and written English\r\n* Demonstrate a professional attitude\r\n* Have made a considered and informed decision to train to teach\r\n","otherRequirements":"Experience of being in a school and/or working with young people is not essential, however, it will be beneficial during the application process. You can contact us to arrange experience within a school.\r\n \r\nAdmission is dependent upon satisfactory medical examination conducted by our preferred supplier. \r\n \r\nCandidates who are offered a place on the course are required to complete a declaration regarding any criminal convictions. \r\n \r\nCandidates are required to obtain clearance from the Disclosure and Barring Service (DBS) regarding their suitability for work involving children. Successful candidates will have these checks conducted at our expense.\r\n","status":1,"createdAt":"2021-07-06T10:50:17.668Z","updatedAt":"2021-10-04T14:44:47.889Z","canSponsorStudentVisa":"no","cycle":"2024"}
