{"id":"01b7ee93-e042-467a-9a61-210ab0fdc394","name":"Primary (3-7) Early Years","code":"E888","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_7","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"fc57827c-50a3-473b-8a8e-8f0a564318c1","name":"Eatock Primary School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"8a5cc782-40d0-417a-ae85-ff9241a5c64d","code":"2GV","name":"Eatock School Direct"},"accreditedBody":{"id":"d8c030de-91f2-420d-9ff7-4286c7f913fa","code":"E42","name":"Edge Hill University"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"If you are applying and don’t have the GCSEs  required for entry, one of Edge Hill University's equivalency test programmes may be for you.\n\nThe equivalency tests offer you the opportunity to demonstrate that you satisfy our entry requirements for GCSE English Language and Mathematics at Grade C or Grade 4 or above.\n\nEdge Hill offer tutor-led revision courses or standalone tests for applicants who feel they do not need tuition.\n\nAll tutor-led revision courses are delivered online, prior to sitting an exam on campus. You can choose to sit the standalone tests either on campus or at Holy Cross College & University Centre on selected dates throughout the year.\n\nFor more details visit [Edge Hill's website](https://www.edgehill.ac.uk/study/equivalency/).","courseLength":"OneYear","feesUK":9250,"feeDetails":"Subject to eligibility, UK and EU students can apply for a Tuition Fee Loan from the Government to cover the full cost of tuition fees. UK and EU students may also be eligible to apply for additional funding to help with living costs.","financialSupport":"None","aboutCourse":"The Eatock Primary Cluster School Direct programme will be delivered by good and outstanding practitioners in a highly supportive and aspirational environment. The programme is aimed at developing your skills, knowledge and understanding required for teaching within the classrooms of tomorrow. \r\n\r\nThe majority of training will be delivered by the Eatock Cluster School Partners and Edge Hill University. The programme supports trainees to develop innovative and creative approaches to teaching in a supportive environment. Trainees will be provided with classroom based experiences which will enable them to reflect on pedagogy in practice. \r\nEdge Hill University’s teaching and learning experience is of the highest quality, with a curriculum that is inspiring, relevant and informed by the outcomes of up to date research. As part of your School Direct experience, you will have access to state of the art facilities at Edge Hill University’s Ormskirk campus and regular interaction with fellow PGCE trainees.\r\n\r\nWhy join the Eatock Primary Cluster?\r\n\r\nWe offer our Initial Teacher Training (ITT) trainees an outstanding School Direct programme which includes the following: \r\n* School led professional learning.\r\n\r\n*'Outstanding' EYFS provision\r\n\r\n* High quality training provided by Eatock and other primary schools within the Eatock Primary Cluster.\r\n\r\n* A high quality teacher training programme and support from Edge Hill University.\r\n\r\n* Individual support and mentoring by good and outstanding practitioners within their own school. \r\n\r\n* First-hand experience of Learning Outside the Classroom and how to use it to enhance teaching and learning. \r\n\r\n* PCGE Primary Education with QTS Qualification (60 credits) – Working with both Eatock Primary Cluster and Edge Hill University you will work towards your QTS qualification. \r\n","interviewProcess":"Eatock Primary School is the lead school in the partnership and will be coordinating the recruitment process. This will involve a full day within one of our Partner schools and will include:\r\n•\t20 minute observed teaching activity \r\n•\tAn interactive school tour\r\n•\tAn interview\r\n•\tA written task\r\nPrior to your interview day, you will be informed of the content of the activity and the age group you will be teaching. Our Interview team will consist of Senior leaders from the Eatock Primary Cluster schools and Edge Hill University staff.\r\nThe rigorous and thorough process is aimed at recruiting trainees of the highest calibre.\r\n","howSchoolPlacementsWork":"All schools within the Eatock Cluster work closely to ensure that each student experiences what it is like working in a school on a day to day basis. Students are welcomed into classrooms and encouraged to get involved with the life of the school. \r\n\r\nDuring the course you will undertake two long term placements (November - February and April - June). As well as these placements you will attend ten enhancement days at Eatock and in some of our partner schools. \r\n\r\nAll schools within are cluster are based in Wigan and Bolton. \r\n\r\nWe have single and two-form entry schools. \r\n\r\nAll placements will take place in EYFS settings and Primary Schools and will be based in classes from Nursery upwards. ","personalQualities":"* At Eatock we are looking for students who have previous experience of working with nursery or primary aged children. \r\n\r\n* We are looking for students who can demonstrate: commitment, resilience, good communication skills, a commitment to teaching and a desire to be the best classroom practitioner they can be. You must also be well organised and enthusiastic. \r\n\r\n* Students who have an understanding of the EYFS curriculum .","otherRequirements":"* All students will have a Enhanced DBS check before undertaking the course. \r\n\r\n* School Experience (preferable) - A commitment to, and understanding of, EYFS or primary education, normally founded on at least 10 days of experience in EYFS settings or primary classrooms.\r\n\r\n","status":1,"createdAt":"2021-07-06T10:48:00.848Z","updatedAt":"2021-07-22T13:42:58.348Z","canSponsorStudentVisa":"yes","cycle":"2024"}
