{"id":"ed52e7d3-a1a9-42d2-a2ca-e87f5bb94a3f","name":"Primary","code":"34Q3","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"d09eff76-9682-4b60-a378-2e6bb706aa07","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"31e61b7a-48ec-44ac-80d8-519d16b51c63","code":"1RP","name":"Castleman Learning Network"},"accreditedBody":{"id":"ef96e044-b65c-4cc8-b2b4-44aca678aeb0","code":"L19","name":"The Learning Institute South West"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"Equivalency tests are offered through the University of Worcester or through A Star Equivalencies.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Our course enables participants to develop their understanding and experience of teaching through a combination of classroom practice and research.  \r\n\r\nParticipants are based in a local partner school from day one of the school year, spending approximately 4 days a week actively developing their skills in school.  \r\n\r\nTaught sessions are timetabled to compliment work in school and are supported by experienced colleagues.  There are opportunities to work alongside a range of our partner schools.  Our sessions are held at a variety of locations which provide opportunities for study as a well as hands-on experience in schools.\r\n\r\nParticipants are assessed through a combination of evidence gathering and assignments which provide opportunities to combine research, reflection, practice and planning for implementation.  ","interviewProcess":"For our interview process we work hand-in-hand with the Head Teachers from our partner schools.  \r\n\r\nThe process will involve a combination of key elements such as:\r\nInterview, teaching episode, reflection and subject knowledge tasks.","howSchoolPlacementsWork":"Our school placements begin from day 1 of the Autumn Term when participants will join their base placement school.  \r\n\r\nDuring the Spring Term, participants have the opportunity to learn alongside colleagues in their second school placement, which will focus on gaining understanding of their alternative Key Stage.\r\n\r\nIn the Summer Term, participants will return to their base placement school to complete their final classroom experience.\r\n\r\nThroughout the year, participants will be required to complete a selection of short, alternative school placements which will provide opportunities to develop understanding of different age ranges and settings.\r\n","personalQualities":"","otherRequirements":"Satisfactory completion of DBS, Health Check and Prohibitive list checks.","status":1,"createdAt":"2021-07-06T10:51:50.273Z","updatedAt":"2021-10-06T09:05:38.500Z","canSponsorStudentVisa":"no","cycle":"2024"}
