{"id":"c05eeb18-a5bc-41fb-9635-5703227f873d","name":"Primary","code":"3FRH","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"B","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"49183bc1-b4ee-4b1d-b082-ffc09febc787","name":"Thorndown School Primary","isPublished":"Y","status":"R","vacancies":"B"}],"trainingProvider":{"id":"c7f67537-c233-40cb-917a-f1dd0c29475d","code":"2LV","name":"Thorndown Primary School"},"accreditedBody":{"id":"af388cc3-644a-4fd3-bd71-55503b74fc21","code":"B22","name":"University of Bedfordshire"},"profPost":"PF","degreeGrade":"1","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"From the beginning of the academic year, you will be a full member of a school in Huntingdonshire and engage in all areas of school life. From day one you will be observing, working, teaching and learning in a classroom.\r\nYou will be based in your school 4 days a week where you will gradually build up your teaching time, observe examples of best practice, participate in group activities and wider professional development. You will have a dedicated mentor who will meet with you formally once a week to discuss your progress and help you succeed.\r\nOn a Friday, your dedicated to your professional development sessions will be delivered at the University of Bedfordshire Campus in Bedford. \r\n","interviewProcess":"We have a thorough interview process to ensure that we are matching potential trainees to the right schools.\r\nOur interviews involve:\r\ncandidates deliver child activity (teaching) in our school\r\na formal interview a formal interview process at the University of Bedfordshire's, Bedford Campus.\r\nFull details are provided prior to the interview.\r\n","howSchoolPlacementsWork":"We will place you in a school inside our partnership area of Central Bedfordshire and within one hour journey from the Bedford Campus and your term time address.\r\n\r\nWe offer primary training .\r\nAll trainees are allocated a main placement school which they are based in during the Autumn term. During the Spring and Summer term trainees have a second placement school where they develop their skills in an alternative Key Stage.\r\nThroughout your placement, you will have a dedicated mentor who will support you and work closely with our team.\r\nInformation regarding all of our placement schools is available on our website\r\nWe will consider specific requests made by you but may not be able to guarantee your first choice of placement school. Reasonable consideration will be given for travel and personal circumstances but it is not guaranteed.\r\n","personalQualities":"Demand for places on the course is very high, so you must also:\r\nbe able to communicate clearly and in spoken and written English, with a good understanding of correct grammar\r\nachieve clearance from the Disclosure and Barring Service at the start of the course. You must not have previously been excluded from teaching or working with children\r\nmeet all the Department for Education entry requirements for Initial Teacher Education courses including suitability and fitness to teach checks\r\n","otherRequirements":"Work experience in a school is highly desirable but not essential.\r\nThe University of Bedfordshire will complete a Disclosure and Barring Service (DBS) check and a medical check, which is required at the point of accepting a place at the University.\r\n","status":1,"createdAt":"2021-07-06T10:57:25.291Z","updatedAt":"2021-10-05T16:34:08.027Z","canSponsorStudentVisa":"yes","cycle":"2024"}
