{"id":"eb5d0207-bc33-4efc-b2ed-a26b6345b4b2","name":"Primary","code":"39ML","qualification":"pgce_with_qts","startDate":"2024-07-31T23:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"5d8fa9b5-3dca-4c02-9d5f-52fcc2fcf52d","name":"Smith's Wood Primary Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"725c75ff-2fd6-4651-88e9-62bca9edf6ae","name":"Balsall Common Primary","isPublished":"Y","status":"R"},{"id":"572a6d9d-3526-4117-9338-8e29e0e834cd","name":"Main Site","isPublished":"Y","status":"R"},{"id":"c3d6d66c-d836-4e8c-b102-c290a14cd6cb","name":"Stirchley Primary","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"e7be94a0-c2e6-4944-a37f-b6a56e4cfc8d","code":"2KX","name":"Dorridge Alliance"},"accreditedBody":{"id":"ef09ce50-ccfc-4346-a0ce-43e840153dab","code":"W20","name":"The University of Warwick"},"profPost":"BO","degreeGrade":"1","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"Candidates will need an equivalent qualification to a C grade (minimum) in English, maths and science","courseLength":"OneYear","feesUK":9250,"feeDetails":"Trainees will be required to pay University fees- currently £9250, correct September 2021. ","aboutCourse":"We are offering a year long, School-Led (non-salaried School Direct Training) Primary PGCE with QTS that trains you to teach the whole Primary curriculum. In addition, you will be asked to choose a specialism: Special Educational Needs, English, Mathematics or Science. The specialism is a unique opportunity to enhance your knowledge and skills in a key area in Primary Education. You do not need any previous background in your chosen specialism.\r\n\r\nQualifications\r\nYou should be a graduate, with a 2:2 degree or above. You must also possess a standard equivalent to a grade C in the GCSE examinations in English Language, Mathematics and Science . If you have an overseas qualification, we will check this qualification with NARIC. In addition, it is expected that you have, or have undertaken, some school experience and a good understanding of current issues in education. \r\n\r\nThe course\r\nThere are 3 elements to the course, designed to equip you with the knowledge, understanding and practical skills you will need to pursue a successful teaching career:\r\nProfessional Studies- understanding what factors lead to successful learning. Course work will be assessed.\r\nSubject Studies- covers subject knowledge in a wide range of subjects, core (Mathematics, English and Science) and foundation (Arts, Humanities etc). Course work will be assessed.\r\nProfessional Practice- the majority of the course will be spent in schools. You will complete 3 main placements: 2 at a base school and 1 complimentary school. This will give you experience across both Key Stage 1 and 2. 1 day a week will be spent at University. Ability to meet the Teachers' Standards will be assessed.\r\n\r\nUpon completion of the course, you gain 90 credits at master's level. This allows you to fast- track to stage two of a masters degree at The University  of Warwick.\r\n\r\nWhilst on placement, you will be invited to attend Alliance training days. These will supplement your professional and subject studies offered by the University. They will be led by outstanding professionals from our Alliance schools and tailored to support your individual needs.\r\n\r\nTrainees will be required to pay University fees- currently £9250. Bursaries are available. [DfE] (https://getintoteaching.education.gov.uk) for more information.\r\n\r\n\r\n\r\n","interviewProcess":"The Lead School (Dorridge Primary) will be co-ordinating the recruitment process. The interview process will take a half day and will take place in the school that you have applied to train to teach in. Full details of the interview process will be sent to applicants at least a week in advance of the interview date. The interview will include a short teaching activity, or mini-lesson, which lasts approximately 20 minutes. Applicants will be informed about the topic for the teaching activity and the age group/ability of the pupils. You will also be expected to research a contemporary issue in education that interests you and be prepared to write for thirty minutes about it; you will need to outline a range of opinions/arguments and explain your own opinion/response. A short maths assessment will also form part of the interview process. Following this, you will sit a formal interview which will last approximately 30 minutes. This will be led by the Lead Professional Mentor from the Alliance and School Mentor from the school you have applied to.","howSchoolPlacementsWork":"There are 4 schools in the Dorridge Alliance. All unique in our own way, we share a passion to improve outcomes for young people with the child central to all that we do.\r\n3 schools are based in Solihull and one in Birmingham. Pupils who attend come from a range of backgrounds, providing you with a varied experience. You will be working with pupils aged 5-11, offering KS1 and KS2 experience.\r\nYour school based learning will commence early in the Autumn Term  in your Base School before joining your complimentary school in the Spring Term for 5 weeks. You will return to the Base School for the Summer Term and the remainder of your school experience. \r\nYou will spend 4 days a week on placement with the fifth day at University. ","personalQualities":"Applicants should be able to demonstrate their passion for teaching and desire to support pupils in reaching their full potential. You will need to be hard-working, driven, well-organised, resourceful and reflective. A sense of humour and ability to see the bright side is also key. You will be a team player.\r\nPrevious experience of working with children is desirable. ","otherRequirements":"To safeguard our pupils and our staff, an enhanced DBS check will be required as a condition of the course.","status":1,"createdAt":"2021-07-06T10:46:30.601Z","updatedAt":"2021-09-27T14:53:53.059Z","canSponsorStudentVisa":"yes","cycle":"2024"}
