{"id":"12874da0-34a3-466d-a92c-93b752c471a5","name":"Geography","code":"2JSC","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3f47e67b-7fa5-4947-a5a0-74d528cd2a87","code":"F8","name":"Geography"}],"locations":[{"id":"c56a7a63-a570-4ae8-9c73-4c6d2fbc7c06","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"b823d15e-cd99-4395-ae4d-581c5d1215d6","code":"T87","name":"Tudor Grange SCITT"},"profPost":"PG","degreeGrade":"9","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":9250,"aboutCourse":"The Tudor Grange SCITT geography programme blends theory and practice, helping you to confidently develop your understanding and skills. All aspects of pedagogy will be covered, and you will have opportunities to watch outstanding practitioners demonstrating their skills in the classroom. \r\n\r\nEducational theories are taught and practical application in the classroom is explored. The emphasis is on evaluation and reflection throughout to help you consider the relevance of these concepts, enabling you to discover more about the kind of teacher you want to be. \r\n\r\nTeaching geography allows us to educate children and enrich their lives in order to prepare themselves for future success. This focus on cultural capital is something that separates geography from other subjects by making every topic applicable to real-life and allowing students to acknowledge the world around them. The subject studies sessions include a range of individual and group activities, and often follow on from the professional studies sessions. Although there is scope to become more bespoke by concentrating on areas of concern for individual trainees, for example: focusing on “teaching tricky topics” that are identified as part of the subject knowledge audit, which is completed before the course begins. Your geography specific Subject Leader will work with you directly to develop your teaching style and be another avenue of support during your teacher training year.\r\n\r\nThe course content is wide ranging and you will learn about how to plan lessons specific to your subject to help all the young people in your classrooms make progress; how to enable positive behaviour in classrooms; and how to work with parents. \r\n\r\nFeedback will be both formal and informal and always based around helping you to reflect on your own strengths and next steps. Trainees have regular collaborative progress checks and a scheduled weekly mentor meeting whilst on placement, so you can be sure that you will know how you’re doing at all times. The final recommendation for QTS is based around a combination of reports and your classroom practice.\r\n\r\nAs an accredited provider, we work in partnership with Birmingham City University for the PGCE element of the programme and all of the learning here is aimed at developing your pedagogical understanding. It is a complimentary programme, which enhances your classroom practice.\r\n","interviewProcess":"We sift all UCAS applications following a consistent criteria set out in-house, looking at candidate personal qualities, academic achievements and previous relevant experience in schools/working with young people, or vulnerable groups.\r\n\r\nFollowing a successful sift, candidates will be invited to an interview day, which dependant on applicant numbers, may be ran over one or two days. \r\nThe interview process consists of four parts;\r\nA subject knowledge audit – This is not a pass/fail test of your subject knowledge rather an audit of your strengths and areas for improvement. This allows us to understand your baseline and develop strategies for how we can work with you to fill any subject knowledge gaps prior to the course beginning, and to continue to provide bespoke support.\r\nUnseen task - Information on the task is given on the interview day.\r\nPanel interview – Your education philosophy and values, resilience, and knowledge of National Curriculum will all be explored during the panel interview.\r\n20 minute session delivery to a KS3 class – You will be provided with a topic for the session (set by the class teacher) a week in advance to allow you to prepare. During the session we will be looking at how candidates have demonstrated learner progress, their relationships with young people, and their ability to plan.\r\n\r\nWe aim to share outcomes of the interview process on the day, including detailed and meaningful feedback where applicable. All offers made by us are conditional, and will be explained when the offer is made\r\n","howSchoolPlacementsWork":"We strongly believe that the best place for a trainee teacher is in schools, developing your skill set through a cycle of observation, reflection, practise and feedback. Therefore the course is split into 25% Professional Studies sessions and 75% in school placements. Trainees are placed in at least two schools, which are carefully selected in order to provide a range of different experiences, giving you the best chances of developing your practice. For example, you might be placed in a rural school for one of your placements and an urban school for another. This increases your chances of employment and ensures you are a well-rounded practitioner.  \r\n\r\nWhilst on placement, you will be in the role of a teacher, and will therefore be able to take opportunities to learn about how the school day works – thus, you should plan to work full school days, including attending meetings before and after school, as well as preparing for parents’ evenings and after school activities, like awards ceremonies. We are also passionate about protecting our teachers and ensuring work/life balance is achieved. There are specific professional studies sessions related to this. Furthermore, although your timetable will increase so that by the end of the year, your teaching commitment is similar to that of a Newly Qualified Teacher, we gradually build up your timetable, at a rate that is right for you. It is our deep belief that mastering the craft of teaching is more important than arbitrarily increasing the number of lessons that you plan and teach.\r\n\r\nTrainees are assigned a personal subject specific mentor whilst on placement, who will work with you to set achievable targets, to help you to become the very best teacher you can be. You will constantly be working towards the Teachers’ Standards and will be supported and guided by Tudor Grange SCITT throughout the program. \r\n\r\nThe programme is an 11-16 offer, with post 16 enhancement. In reality, this means that when you are confidently mastering KS3 and 4 teaching, we will seek to find opportunities for you at post-16. We find that this helps with employability.","personalQualities":"The Tudor Learning Habits;\r\n- Positive self regulation\r\n- Process not product\r\n- Open to failure and feedback\r\n- Courageous and gritty\r\n\r\nThe Tudor Character Habits;\r\n- Honesty and truthfulness\r\n- Kindness and empathy\r\n- Responsibility and integrity \r\n- Generosity and gratitude ","otherRequirements":"All successful candidates will be subject to;\r\nAn enhanced DBS check, candidates must fund this themselves although Tudor Grange SCITT will make the application.\r\nAn occupational health check.\r\nConfirmation of right to work in the UK.","status":1,"createdAt":"2021-07-06T10:53:28.771Z","updatedAt":"2021-07-19T19:09:28.453Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
