{"id":"a940b0c2-e93d-4dac-84b1-298b49fb9813","name":"Primary","code":"2Q8Z","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"45880a6f-3efc-4120-b498-8ea825260414","name":"Primary Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"b823d15e-cd99-4395-ae4d-581c5d1215d6","code":"T87","name":"Tudor Grange SCITT"},"profPost":"PG","degreeGrade":"9","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":9250,"aboutCourse":"\r\nOur Post Graduate Certificate in Education with Qualified Teacher Status (PGCE with QTS) course contains a core element of Professional Studies supported by a series of Specialist Studies sessions designed to develop your understanding of teaching and learning across the primary age range, and across the subjects of the National Curriculum.  \r\nProfessional study sessions, based at Tudor Grange Academy Solihull and Tudor Grange Primary Academy St James, are facilitated by leading practitioners who have a proven track record of excellence in teaching across Early Years, Key Stage 1 and Key Stage 2.  Engaging and active study sessions provide the theoretical groundwork for outstanding teaching and learning in the Primary Phase.  Topics covered include:\r\n\r\n*  Professional Standards in Teaching\r\n*  How do I Create a Positive Climate for Learning?\r\n*   Behaviour Management\r\n*   How Does Learning Happen?\r\n*   How do I plan and deliver learning?\r\n*   Inclusion\r\n*   Adaptive Teaching\r\n*  Closing the Attainment Gap\r\n*   Assessment for Learning\r\n*   Keeping Children Safe \r\n\r\nSubject Studies are taught by our team of Primary Specialists and aim to contextualise this learning and extend it across the primary age range through an examination of topics including:\r\n\r\n*   Oracy, Communication and Language\r\n*   Early reading and synthetic phonics\r\n*   Reading, Writing and Mathematics (including early mathematics)\r\n*   Primary Science and Computing\r\n*   Humanities \r\n*   Physical Education and outdoor learning opportunities\r\n*   Encouraging creativity and curiosity - exploring the arts in primary school\r\n*   Personal and social development\r\n*   Wider opportunities for learning in the primary phase\r\n\r\nTudor Grange SCITT offers a highly supportive environment led by a nurturing team of professionals who are passionate about offering an exceptional ITE experience.\r\n\r\nOnce accepted onto the course, you will identify your chosen pathway, either:\r\n\r\n*   Early Years & KS 1 \r\n*   KS 1 & KS 2\r\n\r\nAll PGCE with QTS programmes are fee-paying courses, lasting from September to June and lead to the award of PGCE with Qualified Teacher Status (Primary Education).  We partner with Birmingham City University for the PGCE element of the programme with the learning aimed at enhancing your pedagogical understanding. This is a complimentary programme, which enhances your classroom practice. There are no formal written assignments for recommendation of QTS.\r\n","interviewProcess":"We sift all UCAS applications following a consistent criteria set out in-house, looking at candidate personal qualities, academic achievements and previous relevant experience in schools/working with young people.\r\nFollowing a successful sift, candidates will be invited to an interview day, which dependent on applicant numbers, may be run over one or two days. \r\nThe interview process consists of four parts;\r\n\r\n*A subject knowledge audit – This is not a pass/fail test of your subject knowledge rather an audit of your strengths and areas for improvement. This allows us to understand your baseline and develop strategies for how we can work with you to fill any subject knowledge gaps prior to the course beginning, and to continue to provide bespoke support.\r\n*Unseen task - Information on the task is given on the interview day.\r\n*Panel interview – Your education philosophy and values, resilience, and knowledge of National Curriculum will all be explored during the panel interview.\r\n*20 minute session delivery to a Primary class – You will be provided with a topic for the session (set by the class teacher) a week in advance to allow you to prepare. During the session we will be looking at how candidates have demonstrated learner progress, their relationships with young people, and their ability to plan.\r\n\r\n We aim to share outcomes of the interview process on the day, including detailed and meaningful feedback where applicable. All offers made by us are conditional, and will be explained when the offer is made.\r\n","howSchoolPlacementsWork":"Trainees will complete experience in Early Years Foundation Stage and Secondary phases before beginning the programme, and will have experience in at least two primary schools during training. \r\n \r\nPartnership schools are across Solihull, South Warwickshire and Birmingham – including urban and rural, infant, junior, primary, large, small and faith schools.  Trainees are required to complete an extended period in school on placement, with further enhancement days provided to support their professional development. \r\n\r\nThe SCITT course is tailored to meet the needs of schools, producing confident teachers with high levels of practical teaching skills.  Trainees take what they have learned in the training room directly into the primary classroom where they then put it into practice under the supervision and guidance of mentors and fellow colleagues who will provide support, feedback and key guidance to ensure that all trainees make the required progress. Throughout the programme trainees have the opportunity to immerse themselves fully in school life, participating in extra-curricular activities, parent meetings and cross-curricular events.\r\n","personalQualities":"The Tudor Learning Habits;\r\n- Positive self-regulation\r\n- Process not product\r\n- Open to failure and feedback\r\n- Courageous and gritty\r\n\r\nThe Tudor Character Habits;\r\n- Honesty and truthfulness\r\n- Kindness and empathy\r\n- Responsibility and integrity \r\n- Generosity and gratitude\r\n","otherRequirements":"All successful candidates will be subject to;\r\nAn enhanced DBS check, candidates must fund this themselves although Tudor Grange SCITT will make the application.\r\nAn occupational health check.\r\nConfirmation of right to work in the UK.\r\n","status":1,"createdAt":"2021-07-06T10:53:28.848Z","updatedAt":"2021-07-19T19:13:41.635Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
