{"id":"af8a67ff-0a8d-4334-aed3-bc260dd56366","name":"English","code":"3BXQ","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3aed1aa8-ae46-4b68-92bb-a6cc20655c59","code":"Q3","name":"English"}],"locations":[{"id":"7c76c711-492c-4d98-8f84-7585a49d60da","name":"Colne Park High School","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"32b15728-ff86-47d8-916c-aa264708f77f","code":"2FK","name":"Pennine Teaching Alliance"},"accreditedBody":{"id":"9d03acb4-95ce-41e1-8458-0b4bec147b6b","code":"M20","name":"The University of Manchester"},"profPost":"PG","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"10 months","feesUK":9250,"aboutCourse":"This course offers a non-salaried route into qualified teacher status. Secondary English, we will help you to transform your subject knowledge into teaching skills and educational theory into practice. You will then be qualified to deliver the National Curriculum and other related national strategies.  Completion leads to both a postgraduate qualification and recommendation for qualified teacher status (QTS).\r\n\r\nWorking in conjunction with the University of Manchester (Ofsted rated Outstanding 2019) you will attend university-based sessions that will enable you to reflect on teaching methods. These sessions will also incorporate drama, media and information and communication technology.\r\n\r\nYou will spend approximately two-thirds of your time in schools and the rest will be University based. \r\n\r\nWe will support your development as a teacher by providing a quality teaching experience in our partner schools, where you will receive  guidance and support from experienced mentors. \r\n\r\nAs an alliance, we work collaboratively with a range of secondary schools in our local area, which enables us to tailor placements to the individual.  \r\n\r\nThroughout your training year, there will be a bespoke training program that will be delivered by highly effective practitioners from within our alliance. \r\n\r\nPeer lesson observations will enable you to participate actively in your own and your fellow students' development as teachers, with the expectation that you will begin to develop your own teaching style, set targets, take your own initiatives and evaluate your own work in planning, teaching and assessing.\r\n\r\nYou should anticipate that time in university-based learning combined with school-based placements will roughly equate to the time commitment of a full-time job, with additional time required in evenings and weekends for background reading, lesson planning and completing written assignments.\r\n\r\nYour school and University experiences are formally assessed. Both your mentors and tutors will help you to record your achievements and set targets.\r\n\r\nDuring each placement, you will be formally observed teaching and helpful and constructive feedback will be given, and at the end of each school experience, you will receive a report from your mentor. The report will comment on the following areas:\r\n\r\nteaching;\r\nplanning;\r\ndifferentiation and assessment;\r\nlearning environment;\r\nwider professional responsibilities.\r\nThese reports, together with your record of achievement and development, facilitate your progression as a teacher.\r\n\r\nThe written assignments will allow you to gain a maximum of 60 master's-level credits.  Guidance and support to complete these assignments will be available from your University tutors.","interviewProcess":"Following a successful application to UCAS, you will be invited to interview. \r\n\r\nThis process takes place during either a morning or an afternoon and we try to accommodate the needs of the applicant where possible. \r\n\r\nApplicants should expect to partake in a teaching activity, followed by a short presentation to a small interview panel and who will then pose interview style questions. \r\n\r\nThe interview panel will consist of a subject specialist, an alliance mentor and a member of the administrative staff.\r\n","howSchoolPlacementsWork":"Candidates will be placed in two schools throughout the year.  \r\n\r\nWe operate an A-B-A style training course.  This approach ensures students experience different schools, allowing them to return to their initial placement school following their second placement.  This style of placement facilitates self-reflection and pedagogical development.\r\n\r\nPlacement schools are selected based upon the needs of the trainees, the strengths of the differing departments across schools.  We aim to provide a  contrast of school type and approaches to learning. \r\n\r\nAs we work within the Pennine Teaching Alliance and our neighbouring schools, our placements are predominantly in the East Lancashire region. ","personalQualities":"Pennine Teaching Alliance are looking for candidates who:\r\n\r\nAre passionate about making a difference to the lives and development of our young people\r\nHave a positive outlook\r\nAre independent, resilient and adaptable\r\nHave good interpersonal skills, \r\nAre creative and imaginative\r\nAre friendly and approachable, with the ability to engage young people\r\nAre enthusiastic about their subject(s) and are continuing to develop their subject knowledge\r\nHave good organisational skills and excellent time management skills\r\nAre reflective and strive to improve their own practice\r\nDemonstrate a professional attitude\r\nHave made a considered and informed decision to train to teach","otherRequirements":"If your application is successful, we will require you to comply with a confidential health screening check as advised by the Department for Education. \r\n\r\nDisclosure and Barring Service check\r\nIf your application is successful, we will require you to comply with an enhanced check through the Disclosure and Barring Service as advised by the Department for Education.\r\n\r\nYou must also meet the the Pennine Teaching Alliance's suitability requirements for the safeguarding of children.","status":2,"createdAt":"2021-07-06T10:50:17.265Z","canSponsorStudentVisa":"yes","cycle":"2024"}
