{"id":"9742a5a3-c909-42d5-a8be-15d7bbf82bfe","name":"Primary","code":"3B3Z","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_7","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"7b05a13e-c6df-482b-9cb9-6f7a636da67c","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"eceb05bc-a63f-4f29-91d0-1248d7f86e3e","code":"2JQ","name":"Sunderland Nursery Schools"},"accreditedBody":{"id":"926804ac-be7a-4f0a-97f9-a26a5f5f032a","code":"S84","name":"University of Sunderland"},"degreeGrade":"1","english":"1","maths":"1","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We will only accept equivalencies from equivalencytesting.com.\nCost to the candidate.","courseLength":"OneYear","feesUK":9250,"feesInternational":10750,"financialSupport":"Student Finance England deal with all tuition fee and living costs loans.  While most  students are eligible for some type of support, it’s always worth checking what you are specifically eligible for before you apply.\r\n\r\nPlease contact the University of Sunderland Student Financial Guidance Team for more information.  Email: studentfinancialguidance@sunderland.ac.uk  or Tel: 0191 5152933\r\nWebsite: https://sj.sunderland.ac.uk/studentfinancialguidance/\r\n","aboutCourse":"The training programme will have universal elements across all the nursery schools and will include additional elements based on individual specialities such as SEND and Speech, Language and Communication.  A feature of the placement with PIPs is the opportunity to experience the expertise in all 7 Nursery Schools.\r\n\r\nOur training programme will develop high levels of teaching skills and develop your  understanding of the accurate assessment of pupil abilities to ensure the best outcomes for children across the Early Years into the  primary age range.  It will include outstanding  opportunities to develop your knowledge and skills in teaching and learning across all prime and specific areas of learning.\r\n\r\nYour mentors are excellent teachers, undertaking regular and ongoing training programmes to further their own knowledge.  This enables them to share these skills through feedback, coaching and classroom observations.\r\n\r\nTeaching and assessment and university days\r\n\r\nDepending on the route you take, assessments will be a mix of written assignments, case studies and one to one assessments of your teaching practice.  You will be taught via lectures, seminars, tutorials, project work and group work.  You will be in University for an average of 15 days during the full training year; the University will provide support with your education assignments and practice based research.  You can train to be  a Primary teacher on this route.\r\n\r\n\r\nOn the School Direct route your work-based learning will be based in the school.  You will have a School Mentor and a University Tutor who will assess your written work and your teaching practice.  \r\n \r\nBy following the School Direct model of teacher training with us you will become a knowledgeable practitioner across the Early Years and into the primary phase and be very attractive to future employers looking for an outstanding trainee.\r\n\r\nIf you choose the more widely available tuition route you will pay a tuition fee for your course and you will be eligible to apply for the many generous, tax-free government scholarships on offer.\r\n","interviewProcess":"What we are looking for:\r\n\r\n-  Candidates with a love of learning; who aim for young children to \r\n    succeed and thrive in a happy and engaging environment.\r\n-  Trainees who have a passion and drive to work within our age range and \r\n    beyond, dedicated and motivated to teach within the Early Years \r\n    Foundation Stage.  \r\n-  Confident communication skills both verbally and written.\r\n-   Innovation, ideas, creativity and dedication in everyday practice.\r\n-  The ability to work with and positively support a wide range of different\r\n    needs in fully inclusive learning environments.\r\n\r\nHow we select our trainees:\r\nWe check all applications to see if the applicant meets the entry criteria.  All Successful short listed applicants will be invited to an interview.  Interviews start early November, so we recommend that you apply as soon as UCAS opens, in October. Interviews will be at the Lead School or at the candidates preferred school.  The interview process will  include a range of activities, including working with a group of children, to assess their suitability for teaching.  Successful candidates will then receive a formal offer.  \r\n\r\nThe interview will consist of:\r\n\r\n-  Delivering a short session to a group of pupils (no more than 8) \r\n    the candidate will be informed of this task prior to the interview day\r\n\r\n-  A written task to assess the candidates literacy skills\r\n\r\n-  A formal interview by a panel of teachers and representative from the \r\n    University of Sunderland.\r\n","howSchoolPlacementsWork":"You will be placed in one of our host schools for a period of 12 weeks in the first term, split into two six week periods; first six weeks are ‘focused’ periods which are non-assessed and a further 6 weeks will be assessed teaching experience. You will be able to choose a placement in one of 7 nursery schools with the opportunity to spend time across 7 nursery schools.  Each of the Nursery Schools offers the highest quality education experience with an additional specialism.\r\n\r\n-  Hetton Lyons Nursery\r\n-  Houghton Nursery \r\n-  Hylton Redhouse Nursery \r\n-  Mill Hill Nursery \r\n-  Oxclose Nursery \r\n-  Pennywell Early Years Centre\r\n-  Usworth Colliery Nursery\r\n\r\nIn the Spring term, you will be in an alternate Primary School to gain further experience in another setting.  Each of the Nursery Schools has one or two Partner Primaries from which you can choose.  You may select in terms of locality or due to the schools context, such as EAL.\r\n\r\n-  Academy 360\r\n-  George Washington Primary School\r\n-  Hudson Road Primary School\r\n-  Hetton Primary School\r\n-  Marlborough Primary School\r\n-  South Hylton Primary School\r\n-  Southwick Primary School\r\n-  St John Boste RC Primary School\r\n- Cleadon Academy\r\n\r\nFollowing your alternate setting placement, you will return to your host school for Term 3 for six assessed weeks of your final teaching experience.\r\n\r\nThere will be an additional 2 enrichment weeks in June to provide you with further experience.  You will again have the choice of 7 Nursery Schools.\r\n\r\nDuring each of your placements, whether at your host school or alternate setting placement, there will be a number of tasks for you to complete.  You will be supported throughout by your host school mentor and University tutor.\r\n","personalQualities":"We hold strong positive values, respect and inclusion are key to us and our team.\r\n\r\nTherefore we seek:-\r\n-  Candidates with a love of learning; who aim for young children to\r\n    succeed and thrive in a happy and engaging environment.\r\n-  Trainees who have a passion and drive to work within our age range \r\n    and beyond, dedicated and motivated to teach within the EYFS.  \r\n-  Confident communication skills both verbally and written.\r\n-  Innovation, ideas, creativity and dedication in everyday practice.\r\n-  The ability to work with and positively support a  range of \r\n    different needs in fully inclusive learning environments.\r\n\r\n\r\n","otherRequirements":"-  An enhanced Disclosure and barring Service (DBS) check\r\n-  A completed medical pro forma (based on DFEE Circular 8/92)\r\n\r\n","status":1,"createdAt":"2021-07-06T10:56:48.372Z","updatedAt":"2021-10-08T14:16:09.590Z","canSponsorStudentVisa":"yes","cycle":"2024"}
