{"id":"cb82a00d-39d3-46d8-b1b3-76f47ab1728a","name":"Primary","code":"37WQ","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"d457bfe5-94d1-4114-8e4d-f4ddf36c9931","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"eb4feff7-6a8c-4d6c-90a5-ced16950f12a","code":"2EP","name":"Greenbank Primary Liverpool"},"accreditedBody":{"id":"e328aab3-a535-4921-8ded-5e37133c76dd","code":"L46","name":"Liverpool Hope University"},"profPost":"BO","degreeGrade":"0","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"We will be delivering this programme in partnership with our colleagues at Liverpool Hope University. We have vacancies for the academic year 2021 - 2022 to train teachers in the Primary age phase (5-11). \r\n\r\nMany people choose the School Direct route of teacher training, because they gain first-hand experience of teaching over a full academic year. During the year you will gain experience of teaching both Key Stage 1 and Key Stage 2. Initially, for placement one, you will be placed in one of our partner schools and for placement 2 you will return to Greenbank.  All of our partner schools are located less than 20 minutes from Greenbank.  We work collaboratively with our partner schools and conduct quality assurance observations alongside them and our colleagues at LHU throughout the year.  You will also have 'enhancements' were you will gain experience of the Early Years Foundation Stage, SEND and Secondary Education.   \r\n\r\nDuring your year of training you will have an experienced school based mentor who will guide, support and challenge you, to enable you to become an outstanding teacher. In addition to the Initial Professional Development delivered by Liverpool Hope University, we will provide bespoke training in school to meet your professional training needs.\r\nSuccessful completion of this course will lead to the award of:\r\n\r\nPostgraduate Certificate in Education (PGCE) and Qualified Teacher Status (QTS)","interviewProcess":"If you are selected for interview, you will be invited to Greenbank Primary School. The process will consist of a formal interview, an observed activity with a group of children and a skills audit (English and Maths). You will also have the opportunity to tour the school, find out more about the programme and speak to our current School Direct trainees.\r\n\r\nThe arrangements for the day and additional information about the tasks will be sent to you when you receive your interview offer.","howSchoolPlacementsWork":"The course is delivered so that approximately half the training will take place in school and half at Liverpool Hope University. Your university training will give you the theory behind the many aspects of successful teaching which you will then be able to implement during your time in school.\r\n\r\nDuring the course you will have two placements: firstly the 'away' placement at one of our partner schools and then you will return to Greenbank for the second 'home' placement.  In doing this we hope to provide a contrast to your 'home' placement as well as  giving you the opportunity to become part of two school communities, all of which will enhance your experience and future practice.\r\n\r\nThe school you will be placed in will be one of our partner schools.  All of our partner schools are located less than 20 minutes from Greenbank.  We work collaboratively with our partner schools and conduct quality assurance observations alongside them and our colleagues at LHU throughout your year.   During the year you will gain experience of teaching both Key Stage 1 and Key Stage 2.   You will also have 'enhancements' were you will gain experience of the Early Years Foundation Stage, SEND and Secondary Education.   ","personalQualities":"We wish to appoint trainees who have the potential to become outstanding teachers and who possess a strong desire to educate and work with children.\r\n\r\nThe course is demanding and challenging, so we are seeking applicants who can demonstrate a wide range of skills.\r\n\r\nSuccessful applicants will need to be: committed, hardworking, flexible, enthusiastic and reflective.\r\n\r\nIn addition they will need to demonstrate that they have excellent written and interpersonal communication skills.","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:48:26.772Z","updatedAt":"2021-11-08T20:28:57.269Z","canSponsorStudentVisa":"no","cycle":"2024"}
