{"id":"50507a0b-85f0-486b-961a-436e6360717e","name":"Primary (3-7)","code":"3F33","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_7","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"7c0c7c7d-0fc6-4f59-a5ea-c52dad080446","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"d3a557f3-2a2d-4c1b-9956-37db0401d03e","code":"14F","name":"Eleanor Palmer Primary School"},"accreditedBody":{"id":"7f11aaed-7c3e-42c5-af7a-023d33b45fa3","code":"U80","name":"UCL, University College London"},"profPost":"BO","degreeGrade":"1","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"UCL does accept the following in place of GCSEs:-\n• iGCSE in English Language or Maths or Science\n\nUCL does not accept the following in place of GCSEs:-\n• iGCSE for ‘English as a second language’\n• iGCSE or GCSE “applied” or “additional” subjects\n• Functional Skills\n• BTECs\n• Access courses\nThe equivalence of all overseas degrees is verified by UCL according to their requirements. This is in addition to any assessment of equivalence by NARIC.\nApplicants who do not hold the relevant GCSEs will need to demonstrate an equivalent standard by completing tests with either of the following testing organisations:-\n\nhttp://www.equivalencytesting.com\nhttps://astarequivalency.co.uk\nUCL requires **at least grade 5** and does not accept equivalency tests from any other testing organisations.\nPlease note that UCL does consider candidates\n• with pending GCSEs, or\n• who need to take equivalency tests\nAny pending qualifications are included as conditions in the UCL offer letter, to be met before enrolment in August 2022.","courseLength":"OneYear","feesUK":9250,"feeDetails":"Contact UCL's IOE for more information on international fees.","aboutCourse":"You will attend university training days at UCL Institute of Education alongside students recruited directly by the IoE and from other School Direct partnerships. As paet of your PGCE course you will carry out academic assignments leading to the award of 60 masters level credits.\r\n\r\nThe primary PGCE is a highly popular course that develops effective, confident teachers whose classroom practice is informed by an advanced knowledge of educational theory, and who will continue to learn and reflect throughout their careers.\r\n\r\nAs part of the programme you will be assigned a university tutor who will support your development as a teacher through tutorials, visits to school and guidance with assignments.\r\n\r\nSuccessfully completing all aspects of the course will gain you the award of Postgraduate Certificate in Education (PGCE) plus masters level credits as well as the award of QTS (Qualified Teacher Status).\r\n\r\nUCL Institute of Education (IOE) is a global leader in teacher education.  Their programmes are recognised by Ofsted as “outstanding” in very criterion across Primary and Secondary Education.\r\n\r\nAll UCL School Direct students have full access to UCL student support services and facilities.\r\n","interviewProcess":"Eleanor Palmer School is the lead school in our Teaching School Alliance and we will be co-ordinating the recruitment process. We think it's really important that we meet you (and you meet us!) before we short-list. Therefore you should contact Vicky Green  as soon as possible by email vicky@eleanorpalmer.camden.sch.uk or phone 020 7485 2155 for a discussion and to book your place on one of our open days so that we can meet you and show you around our school and discuss the programme with you.\r\n\r\nIf your initial application meets our (and UCL's) academic criteria, you will be invited to attend Eleanor Palmer Primary School for an assessment day which will involve an  assessed group exercise with some of our pupils, some group work with other candidates. If you are successful in these, you will then be asked to remain for  an interview with a panel of interviewers including a senior teacher from one of our partnership schools and possibly a representative of the Institute of Education. As part of this interview you will be asked to prepare a short presentation.\r\n\r\nUCL carries out a second-stage review of all applicants who are referred after school interviews. They do not re-interview Primary PGCE candidates following a successful interview with us.","howSchoolPlacementsWork":"You will be placed in one of our partner schools for the first two terms of your training.  After this autumn / spring experience we identify each individual's strengths and areas for development so that we place you in a partnership school for the summer term which is best suited to meet your targets and which matches your requested Key Stage placement requirements. On this course, you will have one placement in an EYFS setting (Nursery or Reception) and one placement in a Key Stage 1 setting (Year 1 or 2) \r\n\r\nCrucially, our students also get together on Thursdays (each time in a different school from within the partnership) and spend time observing lessons, benefiting from additional training and reflecting on practice. This creates a really strong peer group which students find incredibly supportive and valuable. It also adds an important third dimension to your teacher training experience (in addition to UCL/IOE study and the placements). \r\n\r\nIn short we offer:\r\n\r\n* Access to teaching practices in fantastic schools in an outstanding borough;\r\n* Schools that have strong and long standing links with the UCL's IOE;\r\n* The opportunity to ‘front-load’ the training year with the chance to observe outstanding practice;\r\n* Experience in genuinely comprehensive schools where you would gain exposure to both very challenging pupils and also some exceptionally high achievers;\r\n* School-based tutorials as a group led by experienced members of school leadership teams;\r\n* Learning in schools that share a strong commitment to child centred hands on learning rooted in an exciting topic based approach;\r\n* The chance to train among highly committed, positive  professional staff who love their jobs;\r\n* The opportunity to become part of a school community, gaining understanding of the richness and complexities of primary teaching.\r\n* Strong programme leadership by Eleanor Palmer Deputy Head and former CPP SD Programme Graduate), Rosie Thomson","personalQualities":"As a trainee teacher on our programme, we expect candidates to have:\r\n\r\n* commitment to our approach to learning;\r\n* a desire to approach curriculum planning in a creative and imaginative way;\r\n* very high standards for children and themselves;\r\n* commitment to inclusion;\r\n* genuine interest in educational thinking and debate;\r\n* ability and willingness to continuously reflect, improve and learn from mistakes;\r\n* high interpersonal and communication skills;\r\n* ability to sustain optimism, energy and a positive outlook under pressure and challenge;\r\n* capacity for hard work; and \r\n* a sense of humour!","otherRequirements":"We recommend that you aim to gain some experience in a classroom prior to interview - both to make you a stronger candidate and to confirm your commitment to this career choice.","status":1,"createdAt":"2021-07-12T13:48:21.061Z","updatedAt":"2021-09-23T16:38:47.838Z","canSponsorStudentVisa":"yes","cycle":"2024"}
