{"id":"5b26f0d2-8710-4240-a389-9aa7df9edb84","name":"Primary","code":"2RXP","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"9fca581a-a7f9-4c47-8f80-73f62b5e9fe0","name":"Somers Park School- Main site or Malvern Vale site","isPublished":"Y","status":"R","vacancies":"F"},{"id":"967a0a63-df68-456c-8396-fc9b4ce389d0","name":"Somers Park- Malvern Vale site","isPublished":"N","status":"S","vacancies":"F"}],"trainingProvider":{"id":"141372b1-501f-420a-973d-4a719442f010","code":"28W","name":"Somers Park Primary School"},"accreditedBody":{"id":"6019b3ce-f2f6-4b0e-b2a9-5813d74c4d54","code":"W80","name":"University of Worcester"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"Grade C/level 4 at GCSE in English Language, Mathematics and Science (or equivalent) (for 2022 entry, applicants must have these qualifications by the start of the course). Alternatively, we offer equivalency Test if you don’t have the required GCSE grade to apply for our courses. Trainees who begin courses before providing evidence of the required GCSE standard (or equivalent) will not be eligible for financial incentives, such as bursaries or grants until they achieve the required standard.","courseLength":"OneYear","feesUK":9250,"feesInternational":13300,"feeDetails":"Fees for UK and EU students are subject to change for 20/21\r\nFees for International students are subject to change for 20/21","aboutCourse":"Somers Park is an outstanding school and an excellent place to learn to be an outstanding teacher. We are extremely proud of our hugely successful  PGCE: School Direct Primary ages 5-11 initial teacher training course run in partnership with the University of Worcester and our local school partners. This course is designed to give trainees experience and expertise in the primary age range ( Year 1 to Year 6).\r\n\r\nYou will experience full immersion in day-to-day school life and feel valued as an integral part of our friendly, supportive and highly motivated team. Our flexible and dynamic personalised learning programme offers high quality learning opportunities ensuring a breadth and depth of experiences across all primary subjects with personal and academic support  provided by highly skilled and experienced class teachers, mentors and tutors. Throughout your training you will have regular opportunities to observe and learn from outstanding teaching in a range of contexts.\r\n\r\nOver the training period you will spend 144 days in school and 46 undertaking university based training. School experience is split into three main blocks plus an enhanced placement to provide  a  range of contrasting experiences across the age range.\r\n\r\n","interviewProcess":"","howSchoolPlacementsWork":"The course is designed with periods in University where you will: develop a Masters' level understanding for the complex nature of teaching and learning; be taught by expert University tutors; and come together in peer group subject communities to reflect on your professional development as a trainee teacher. You will be allocated a personal Pedagogy and Professional Practice (PPP) tutor who will oversee your training journey and act as one of the key links in this.\r\nIn each of your two school experience schools you will be supported by a Lead Mentor, as well as your class teacher and University Supervisory Tutor. Your progress will be supported and developed by this key team as part of a three way tripartite model, underpinned by professional dialogue between trainee, School and university. You will receive a personalised training programme at Somers Park and your second placement planned around your own specific needs. Your progress and development will be regularly reviewed  and you will be encouraged to reflect on your progress and plan next step learning opportunities with your class teachers and mentors. Throughout your training your Reflective Portfolio (RP) will enable you to gather evidence of your professional development against the Teaching Standards Parts1 and 2.\r\n","personalQualities":"","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:57:18.042Z","updatedAt":"2021-09-15T09:35:24.164Z","canSponsorStudentVisa":"yes","cycle":"2024"}
