{"id":"0548e8df-a515-4b09-90a4-c590f3736621","name":"Primary","code":"R039","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"TA","fundingType":"apprenticeship","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"402bf849-84d4-47fc-8bd1-8a2c6c421d58","name":"Lessness Heath Primary School","isPublished":"Y","status":"S"},{"id":"ac79e686-98db-4f3f-a8d0-76eb01147b6d","name":"Barnehurst Junior School","isPublished":"Y","status":"S"},{"id":"baecefe4-ee0d-4398-af65-dbad5912e466","name":"Barnehurst Infants","isPublished":"Y","status":"S"},{"id":"92077860-327f-404f-80b6-4c1dd5ddb78b","name":"Westcourt Primary School","isPublished":"Y","status":"S"},{"id":"4f111d48-40e0-4a8a-8984-6b79fb5f0be1","name":"Springhead Park Primary School","isPublished":"Y","status":"S"},{"id":"63e4bad6-de22-44d0-8c15-b6d8d4f0b463","name":"Wainscott Primary School","isPublished":"Y","status":"S"},{"id":"afeabba3-6a67-4868-b8e3-edacc26a12b7","name":"Wayfield Primary School","isPublished":"Y","status":"S"},{"id":"36fbb3ae-329b-4263-b089-03372c7309c8","name":"Mayplace Primary School","isPublished":"Y","status":"S"},{"id":"6fa65260-b234-44c6-8001-d79dadc83dfa","name":"The Academy of Cuxton Schoools","isPublished":"Y","status":"S"}],"trainingProvider":{"id":"c9e18ca5-0918-4d19-b3be-76c64166d9e6","code":"2A3","name":"The Primary First Trust"},"accreditedBody":{"id":"b3681bbc-2e2a-49c3-aa4e-e453a8d0e4a5","code":"G70","name":"University of Greenwich"},"degreeGrade":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","aboutCourse":"Postgraduate Teaching Apprenticeship programmes are a nationally-recognised, work-based route into teaching. It is an alternative to a traditional full-time university course, offering a postgraduate-level qualification, no tuition fees, and the opportunity to earn while you learn.\r\n\r\nYou’ll be employed by The Primary First Trust and based in one of our schools while you learn on the job. \r\n\r\nYou’ll receive a combination of classroom teaching and off-the-job training as you to work towards Qualified Teacher Status (QTS).\r\n\r\nPostgraduate Teaching Apprenticeship programmes combine paid work with on and off-the-job training. The design of the programme has been led by a group of experienced schools and teachers, specifically for apprentices.\r\n\r\nApprentices will split their time between school and university study. You’ll receive practical, school-led training alongside experienced staff, and spend at least 20% of your time off-timetable to learn the pedagogy of teaching.\r\n\r\nIn addition to working towards QTS on successful completion of the course, apprentices will also complete an end point assessment (EPA) after the summer to consolidate learning from initial teacher training.","interviewProcess":"The Primary First Trust  manage  and oversee the application process. \r\n\r\nIn order for your application to be considered you should complete a full application and consider your personal statement as being an important part of this process. If you are shortlisted you will be asked to attend a formal interview.\r\n\r\nThe interview process takes place in one of our schools and includes an interactive activity with a group of children, a written task and a face to face interview. Further detail will be provided in the invitation to interview. \r\n\r\nThe interview panel will include the Education Director from the Trust and school leaders (Head Teachers and Deputy Head Teachers).\r\n\r\nIf successful, you will be invited to school events over the coming year, in order to have a chance to begin to familiarise yourself with the school community you will be joining. ","howSchoolPlacementsWork":"As the Primary First Trust comprises of all Primary Schools, the age ranges that are taught by our student teachers will fall between 3 years and 11 years. \r\n\r\nWhen allocating the home school, the Education Director works with Head Teachers to consider:\r\n\r\n - the location of the school in comparison to the Apprenticeship  Teacher participants' home addresses\r\n - the mode of transport the participant will be using and the possible routes they will take \r\n - any requests that participants have made through the recruitment process, for example, if they have visited the school prior to applying\r\n - any previous links the participants may have with schools ( for example, we have a successful track record of teaching assistants from our schools becoming teachers in the same schools via the Apprenticeship Teacher Route).\r\n\r\nWithin the spring term,  Apprenticeship Teacher participants have the opportunity to complete a four week contrasting placement within one of our Trust schools. Here again, we carefully consider:\r\n\r\n - the location of the school in comparison to the  Apprenticeship Teacher participants home address\r\n - the mode of transport the participant will be using and the possible routes they will take \r\n\r\nIn addition, we also consider whether the contrasting school is truly comparative by: \r\n - size - does it have a different number of forms of entry to the home school?\r\n - community - does the community that the school serves differ from that of the home school?\r\n -specialism - is the broad and balanced curriculum on offer different to that of the home school? \r\n - the key stage experience - can the comparative school offer an experience in a different Key Stage to that of the home school? \r\n - location - is the comparative school in a different Local Authority?\r\n\r\nAs we will have eight  schools to draw from,  we can carefully match participants with the home and comparative placements, whilst providing a comprehensive network of support, which our previous and current participants have reported that they truly value. ","personalQualities":" - A commitment to our First For Primary Education principals of Knowledge, Personal Development and Connectivity. \r\n - A sense of adventure - being, bold, courageous and willing to take risks\r\n - A creative practitioner, who embraces ideas, clear thinking and innovation.\r\n - An ambition for excellence in standards and dedication to their craft, their children and the wider community. \r\n - A practitioner  with good communication skills who recognises the importance of partnerships with parents and carers","otherRequirements":"Any employment offers will be subject to the candidate undergoing all statutory safeguarding checks, including a Disclosure and Barring Service check and an occupational health screening.","status":3,"createdAt":"2021-07-30T13:51:27.806Z","updatedAt":"2021-09-15T11:07:57.878Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024"}
