{"id":"6902a690-0c86-4d61-9e78-a2c518c6039c","name":"Primary","code":"2SC9","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"3_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"6fa65260-b234-44c6-8001-d79dadc83dfa","name":"The Academy of Cuxton Schoools","isPublished":"N","status":"N","vacancies":"F"},{"id":"4f111d48-40e0-4a8a-8984-6b79fb5f0be1","name":"Springhead Park Primary School","isPublished":"N","status":"N","vacancies":"F"},{"id":"63e4bad6-de22-44d0-8c15-b6d8d4f0b463","name":"Wainscott Primary School","isPublished":"N","status":"N","vacancies":"F"},{"id":"afeabba3-6a67-4868-b8e3-edacc26a12b7","name":"Wayfield Primary School","isPublished":"N","status":"N","vacancies":"F"},{"id":"92077860-327f-404f-80b6-4c1dd5ddb78b","name":"Westcourt Primary School","isPublished":"N","status":"N","vacancies":"F"},{"id":"baecefe4-ee0d-4398-af65-dbad5912e466","name":"Barnehurst Infants","isPublished":"N","status":"N","vacancies":"F"},{"id":"402bf849-84d4-47fc-8bd1-8a2c6c421d58","name":"Lessness Heath Primary School","isPublished":"N","status":"N","vacancies":"F"},{"id":"36fbb3ae-329b-4263-b089-03372c7309c8","name":"Mayplace Primary School","isPublished":"N","status":"N","vacancies":"F"},{"id":"ac79e686-98db-4f3f-a8d0-76eb01147b6d","name":"Barnehurst Junior School","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"c9e18ca5-0918-4d19-b3be-76c64166d9e6","code":"2A3","name":"The Primary First Trust"},"accreditedBody":{"id":"b3681bbc-2e2a-49c3-aa4e-e453a8d0e4a5","code":"G70","name":"University of Greenwich"},"english":"1","maths":"1","science":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":null,"aboutCourse":"This course is  non-modular programme and runs for one year; successful completion will lead to the award of Qualified Teacher Status (QTS) only. We are delighted to be working in partnership with the University of Greenwich, who are an excellent Teacher Training provider.  During the year, you will be placed in one of our schools and will  also experience  a comparative teaching  experience within an alternative Key Stage with a four week placement at another of our partner schools.\r\n\r\nOur Bespoke Training Elements include: \r\n\r\n - A comprehensive induction programme, which includes an introduction to the Trust and to your colleagues, followed by a chance to visit each of our schools on  a road trip, with a fact finding focus - a true chance to begin to network with other Schools Direct participants. \r\n\r\n - PFT comparative days - these days are organised and led by the Head Teachers of each school which  feature a masterclass delivered by the school’s experts.\r\n\r\n - PFT student teacher network\r\nTermly meetings with all student teachers from across our schools to share experiences, ideas and support.\r\n\r\n - Accredited individual mentors\r\nAll School Direct mentors have national accreditation (or are in the process of applying) to ensure that their support is of the highest quality\r\n\r\n - Contrasting placement swaps\r\nContrasting placements take place in the class of another PFT School Direct student teacher to enable sharing of expertise and continuity of support.\r\n\r\n - Bespoke and individual opportunities based on our school’s specialisms\r\nOur schools have a wealth of specialist expertise that they you can draw upon to support your development: Special Educational Needs, Early Years education, Forest Schools, Pupil voice, Mental Health awareness, IT excellence and parental engagement are just a few.\r\n\r\n - Quality Assurance checks\r\nPFT senior mentors work together to ensure that individual judgements are moderated for accuracy and our shared standard.","interviewProcess":"The Primary First Trust and the University of Greenwich work together to  manage  and oversee the application process. \r\n\r\nIn order for your application to be considered you should complete a full application and consider your personal statement as being an important part of this process. If you are shortlisted you will be asked to attend a formal interview.\r\n\r\nThe interview process takes place in one of our schools and includes an interactive activity with a group of children, a written task and a face to face interview. Further detail will be provided in the invitation to interview. \r\nThe interview panel will include the Education Directors from the Trust and school leaders ( Head Teachers and Deputy Head Teachers) \r\n\r\nIf successful, you will be invited to school events over the coming year, in order to have a chance to begin to familiarise yourself with the school community you will be joining. ","howSchoolPlacementsWork":"As the Primary First Trust comprises all Primary Schools, the age ranges that are taught by our student teachers will fall between 3 years and 11 years. \r\n\r\nWhen allocating the home school, the Education Directors work with Head Teachers to consider:\r\n\r\n - the location of the school in comparison to the Schools Direct participants' home addresses\r\n - the mode of transport the participant will be using and the possible routes they will take \r\n - any requests that participants have made through the recruitment process, for example, if they have visited the school prior to applying\r\n - any previous links the participants may have with schools ( for example, we have a successful track record of teaching assistants from our schools becoming teachers in the same schools vis the Schools Direct route. )\r\n\r\nWithin the spring term, Schools Direct participants have the opportunity to complete a four week contrasting placement within one of our Trust schools. Here again, we carefully consider:\r\n\r\n - the location of the school in comparison to the Schools Direct participants home address\r\n - the mode of transport the participant will be using and the possible routes they will take \r\n\r\nIn addition, we also consider whether the contrasting school is truly comparative by: \r\n - size - does it have a different number of forms of entry to the home school?\r\n - community- does the community that the school serves differ from that of the home school?\r\n -specialism - is the broad and balanced curriculum on offer different to that of the home school? \r\n - the key stage experience - can the comparative school offer an experience in a different Key Stage to that of the home school? \r\n - location - is the comparative school in a different Local Authority?\r\n\r\nAs we will have eight  schools to draw from,  we can carefully match participants with the home and comparative placements, whilst providing a comprehensive network of support, which our previous and current participants have reported that they truly value. \r\n\r\n\r\n","personalQualities":" - A commitment to our First For Primary Education principals of Knowledge, Personal Development and Connectivity. \r\n - A sense of adventure - being, bold, courageous and willing to take risks\r\n - A creative practitioner, who embraces ideas, clear thinking and innovation.\r\n - An ambition for excellence in standards and dedication to their craft, their children and the wider community. \r\n - A practitioner  with good communication skills who recognises the importance of partnerships with parents and carers","otherRequirements":"Any employment offers will be subject to the candidate undergoing all statutory safeguarding checks, including a Disclosure and Barring Service check and an occupational health screening","status":2,"createdAt":"2021-07-06T10:53:54.992Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"As student teachers who opt for the Schools Direct route are employed for one year as an unqualified teacher, the salary will be calculated,  at a competitive rate, using the unqualified teacher pay scales. \r\n\r\nThere are no fees or costs for this course. "}
