{"id":"dfce734c-783b-4a4d-90ba-c44d0e77903c","name":"Chemistry","code":"2G44","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"912d4fb4-761b-42e9-8dc6-e968b791ea4e","code":"F1","name":"Chemistry"}],"locations":[{"id":"eae629af-b948-4688-acd3-ebe43529e5ce","name":"C&K Teaching School Hub","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"f7203006-bdab-499b-8b56-8db91360b722","code":"1ZG","name":"Calderdale and Kirklees Teaching School Hub"},"accreditedBody":{"id":"791f82c8-19fd-4339-9c7b-301dee8067ce","code":"H60","name":"University of Huddersfield"},"profPost":"BO","degreeGrade":"1","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feeDetails":"This information is for applicants applying to study at the University of Huddersfield in the academic year 2019/20. Please note that your tuition fees for subsequent years may rise in line with inflation (RPI-X).","aboutCourse":"As a Chemistry Initial Trainee Teacher (ITT) you will learn how to plan and teach effective Chemsitry lessons.   Working in the Science  Department  you will  develop a clear understanding of how the subject is delivered  in secondary schools. You will gain valuable experience in Science subjects whilst on the course. \r\n\r\nA significant amount of your learning and training will take place during two block placements. You will also attend subject knowledge days at the University of Huddersfield. You will complete a minimum of 120 days in school. On successful completion of the course you will be awarded the PGCE (with QTS). This comprises of 120 credits, 90 of which are at Masters Level. \r\n\r\nWe always try to contrast the two placement schools as much as possible, providing the trainee with a breadth of experience which will make them employable in the future. \r\n\r\nYou will be placed in your subject department and will receive practical training which will allow you to develop a clear understanding of educational issues and effective classroom techniques. You will be gradually introduced to teaching through observations, training, assessments and marked assignments. Throughout the course you will be supported by teachers, senior leaders and trained mentors.  You will be provided with the opportunity to immerse yourself fully in school life.\r\n\r\nWe believe that a C & K School Direct trainee is provided with a realistic teacher training experience and we have no doubt you will build a network of contacts within the teaching profession.  Many of our former trainees have secured employment within our  schools.\r\n\r\nWe are confident our trainees are very well supported during their training  year.  School leaders have a firm commitment ensuring all of our trainees complete their studies with the essential skills and knowledge to  prepare them for a rewarding career in the teaching profession. \r\n\r\n\"C & K have been fantastic throughout the whole PGCE. The training they provide has been fantastic – delivered by in-post teachers who were very willing to share their knowledge and expertise. \"\r\n\r\n\"With the support from the C & K School Direct, I’ve discovered a real passion for teaching.\"\r\n\r\n\r\n\r\n\r\n","interviewProcess":"Applications are received on our behalf by the University of Huddersfield via DfE APPLY system. We work closely together to ensure all applicants meet the academic requirements of the course.  Shortlisted applicants  will be invited to an interview at one of our schools.  You will be provided with details of the interview once selected. Under normal circumstances,  the interviews comprise of:\r\n\r\n*Mini Teach (15 minutes) with a class of students (Key stage 3)\r\n\r\n*Formal Interview with Teachers & a subject specialist\r\n\r\n*Literacy & Numeracy Tasks\r\n\r\n* PLEASE NOTE\r\nDue to current COVID restrictions interviews may need to be virtual via Microsoft Teams.\r\n","howSchoolPlacementsWork":"You will have two block placements during the training year and training is delivered in our C & K schools by senior leaders, teachers and lecturers from the University of Huddersfield. \r\n\r\nWherever possible we try and consider trainees preferences over schools, but this is not always feasible. We do consider travelling distances, but trainees must demonstrate some flexibility over school placements.\r\nFor secondary training you will cover the age range 11 - 16 and you may be offered the opportunity to gain experience in post 16 education wherever possible.\r\n\r\nAt each placement school you will have a Subject Mentor and a Professional Mentor (usually outside of your subject area) All mentors are experienced members of staff and receive regular specialised training from the University of Huddersfield and C & K School Direct\r\nTrainees have regular opportunities to network with other trainees both in placement schools and across the Trust through training and CPD.\r\n\r\n\"The content covered with C & K and the University has been invaluable, every aspect is considered so you can go into your placement schools armed with the tools required.\"","personalQualities":"You must demonstrate the ability to communicate effectively, and that you have the intellectual and academic capabilities to meet the required Teachers’ Standards by the end of the programme.\r\n\r\nAll GLA Schools have very high expectations of their Trainees. At interview we will be seeking to recruit individuals who are: \r\n\r\n* Committed to delivering high quality teaching and learning\r\n\r\n* Inspiring and self-motivated individuals \r\n\r\n* Individuals who are  passionate about their subject\r\n\r\n* Prepared to work hard to achieve the best outcomes for all students\r\n\r\n* Professional and have a clear commitment to joining the teaching \r\n    profession. \r\n","otherRequirements":"\r\n•\tA satisfactory Disclosure and Barring Service (DBS) and health check. There is a charge (currently £44). You don’t need to do anything before you apply.\r\n\r\n•\tYou should provide two references. If you are about to graduate or have graduated within the past three years, one referee should be a university or college lecturer who can comment on your academic ability.\r\n\r\n","status":1,"createdAt":"2021-07-06T10:47:02.752Z","updatedAt":"2021-09-30T10:50:46.896Z","canSponsorStudentVisa":"no","cycle":"2024"}
