{"id":"254eddea-8e42-4356-ae02-5ff744f53edc","name":"Primary (3-7)","code":"2NZ4","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_7","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"6b93e388-ffd8-49d8-9bd6-2babbadf7b24","name":"Main Site - St Anthony's Catholic Primary School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"60ed0211-3bd3-404b-96d7-a9f719c612c3","code":"1Y9","name":"St Anthony’s Primary Learning Partnership"},"accreditedBody":{"id":"19a3446e-382d-4c14-83bb-a76563cef3c1","code":"L24","name":"Leeds Trinity University"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"If a candidate requires an equivalency test, they can apply to take one in their chosen subject through Leeds Trinity University.  The teaching and testing will take place online utilising the services of an outside agency.  Trainees already possessing an equivalency test in a core subject will be considered subject to Leeds Trinity approval.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"The School Direct course is a thorough and effective way of training 'on the job', with less time spent in University and more time in the actual classroom.  Trainees are able to benefit from this extra time by absorbing more of the excellent teaching practices around them, as well as being accepted as a member of teaching staff in a quicker time.\r\n\r\nSimilar to the traditional University-led Primary PGCE, the School Direct course enables its trainees to gain a QTS or 'qualified teaching status'.  The Primary (3-7) course aims to give participants experience of the full range of ages between 3 and 7 in two contrasting school experiences.  Trainees observe and eventually teach (after a comfortable lead-up) in their different schools.  Trainees also benefit from a Continuing Personal Development day, which shows them how to effectively teach the full range of subjects, which may be new to many following a subject-specific degree.  In addition, academic tutoring will take place twice a week at Trinity University during the first part of the course, where trainees will be taught the academic requirements of the course.    \r\n\r\nAt the end of the course, St Anthony's will help its trainees find employment as Newly Qualified Teachers.  With a wide range of partnership schools both with and without a Catholic focus, we feel confident we can provide assistance with this important first step.  Indeed, in the years since we have been leading our own School Direct programme, all our trainees have found full-time employment in teaching, meaning we currently hold a 100 % employment rate. ","interviewProcess":"If an application is successful the applicant will be invited to attend an individual interview.  A formal invitation will be sent by Leeds Trinity, but St Anthony's will also send details of the interview by email.\r\n\r\nOnce an invitation to individual interview has been received it is recommended that the applicant contact St Anthony's as soon as possible to confirm their availability.  If an applicant is unable to make an interview or has decided not to pursue their application they must also inform the school as soon as possible.\r\n\r\nThe interview will be held at St Anthony's and will take place on a single afternoon or morning.  The interview is divided into two stages.  The first involves a short, 15-minute teaching task delivered to a small group of age-appropriate children.  The task is then assessed, and those who successfully delivered the short lesson will be invited to attend the next part of the interview.\r\n\r\nThe second stage involves applicants attending a panel interview.  The panel will usually consist of two or three members of staff from St Anthony's or one of its partner schools.\r\n\r\nOnce all second stage interviews have been completed, a decision will be made by the panel based on the outcome of both stages.  Where possible, all outcomes will be shared on the day of the interview, either in person or via telephone.\r\n\r\nAll Interview information, including details of the teaching task and group composition, will be sent to applicants in advance.\r\n","howSchoolPlacementsWork":"All our School Direct Trainees are given the opportunity to train in two contrasting schools, which will be chosen with the trainee's personality, experience and location in mind.\r\n\r\nSt Anthony's draws upon the talents and facilities of 14 good to outstanding partner schools, together with several non-partner schools in nearby localities.  Most of our training partnership schools have a strong Catholic ethos, but we do also have schools from the Church of England among our training schools.\r\n\r\nAll schools are situated within the West Yorkshire region, being located in Leeds, Wetherby, and Wakefield.  All trainees should be able to reach their placement school comfortably and in good time, and therefore the trainee's location is taken into consideration before allotting schools.\r\n\r\nFull-time school placements begin in October, but trainees will be in a school two days a week from the course start.  The first stage school, or 'host school' will give the trainee time to observe and gather evidence of effective teaching and classroom management, before allowing them when they feel ready, to teach their first core subject lessons.\r\n\r\nThe second stage placement commences in the first week of January, and allows the trainee to move to a new school, known as the 'home school'.  The home school will also be used for their third placement when the trainee moves to their preferred year group.  During their time at their home school, the trainee will teach more regularly, eventually taking charge of the class for a high proportion of their time in school.  \r\n\r\nDuring school placement, trainees will also receive CPD training in a variety of other schools within our alliance, which will build up their range of subject knowledge.\r\n\r\nAll placements are carefully chosen to suit the trainee and all experience offered will be according to the personal requirements of the trainee.  Our course is a 'bespoke' training scheme with everything tailored to the individual trainee who is at the heart of our School Direct programme.\r\n\r\nIf there is any impact on school placements as a result of Covid 19, we will inform you before the course starts.","personalQualities":"When looking for trainees and staff, we always hope to attract the brightest and the best that the profession has to offer.  \r\n\r\nWe require  well-organised trainees with a passion for teaching, with a drive and determination to achieve their very best.  In addition, our trainees should have the stamina, positive outlook and ambition to carry them through a tough but ultimately rewarding year.  When selecting trainees, we always favour quality over quantity,  and so if you are chosen to train with St Anthony's, you can be assured that you have the potential to become a great teacher.","otherRequirements":"All successful applicants will be subject to the usual checks.  All trainees should be able to produce evidence of all their qualifications.  In addition, all trainees will have to pass a DBS check.  If DBS checks have already been made at another institution, a fresh DBS will usually be required by our Academic partner, Leeds Trinity University.","status":1,"createdAt":"2021-07-06T10:55:29.016Z","updatedAt":"2021-07-08T09:50:58.218Z","canSponsorStudentVisa":"yes","cycle":"2024"}
