{"id":"d332ce93-1c61-4627-b978-0d808f27834c","name":"Primary","code":"394M","qualification":"qts","startDate":"2024-06-30T23:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"TA","fundingType":"apprenticeship","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"aa589e30-1b82-43dd-ba9c-6c4814c17103","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"e3b33884-e0a6-4f9b-bb7d-589228f26db2","code":"278","name":"Exceed Partnership"},"accreditedBody":{"id":"e5b8e187-ccc1-4253-9dd0-376d6abf7e66","code":"2EY","name":"Exceed SCITT"},"degreeGrade":"1","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We ask candidates to use a third party for the equivalency tests and we would recommend they use Equivalency Testing. (https://www.equivalencytesting.com/)","courseLength":"OneYear","feesUK":9250,"aboutCourse":"IMPORTANT: This course is for candidates who are currently employed in school. It is essential that we have an agreement with your employer PRIOR to an application through UCAS. Any applications that do not follow this process will be rejected.\r\n\r\nFor details of our Teaching Apprenticeship, including guidance for both applicants and employers see our website: (https://www.exceedscitt.co.uk)\r\nIf interested get in touch, see details on our website.\r\n\r\nThe Teaching Apprenticeship will lead to the award of Qualified Teacher Status (QTS). You will train in the 5-11 age range, if you prefer to train in the 3-7 age range then please apply to our course code for that age range, G351.  In addition you will complete a Level 6 Teaching Apprenticeship, there is an option to undertake a PGCE qualification should you choose to.\r\n\r\nThis programme offers practical classroom teaching and a salary. You will experience classroom teaching and 20% of your time is allocated to off-the-job training as you work towards Qualified Teacher Status.  \r\nIn the final term you are required to undertake an end-point assessment (EPA) to ensure you’re on track to be an effective newly qualified teacher. \r\nOur unique programme maximises your time in school and classrooms. Our programme design is innovative, with 3 clear strands: The National Curriculum, so that you develop strong subject knowledge and teaching strategies to ensure pupil’s make good progress. Professional Practice, such as inclusion and effective behaviours for learning so that you are confident to meet the needs of all children in your class. Your personal well-being is also important to us so the programme includes mindfulness, positive psychology and developing resilience. \r\nIf you're wanting to train to be a teacher to make a difference to children’s life chances, there is no better place to train.\r\n\r\nWe have a well established Leeds Hub led by Westerton Primary Academy where our Teaching Apprenticeship programme is based.\r\n","interviewProcess":"Once agreements have been made between Exceed SCITT and your employer, including that funding through the levy is in place we would welcome your application.\r\n\r\nMake sure that your application is clear and grammatically accurate. We are looking for your potential as a trainee teacher, not for someone who is already an experienced teacher. In your personal statement you might want to cover the following aspects, which we offer as a guide only.\r\nYour reason for wanting to teach, why primary? Which phase of learning are you most interested in, e.g. EYFS, KS1 or KS2. Your vision for education and your commitment to young people in the community in which you are employed. What was your 'wow moment' when you knew teaching was the career for you? Any other relevant and transferable skills/experiences that can be related to teaching.\r\n\r\nYou will be invited to interview at one of our partnership schools where you will be made very welcome. You will be given a tour of the school and an opportunity to talk to some of our NQTs or current SCITT Teachers/Teaching Apprentices training with us. This way you really can find out about our programme! You will have an opportunity to lead a short teaching episode based upon a children's book and a 30 minute individual interview. This way we really get to know you and you get the opportunity to find out how our partnership supports you to be the best teacher that you can be.  \r\n","howSchoolPlacementsWork":"You are in school all the time. Experienced schools and teachers will lead the design of this Teaching Apprenticeship. You will receive classroom teaching and 20% of your time is allocated to off-the-job training as you work towards Qualified Teacher Status (QTS).  \r\n\r\nIn the final term, you are required to undertake an end-point assessment (EPA) to ensure you’re on track to be an effective Early Career Teacher and achieve your Level 6 Teaching Apprenticeship. \r\n\r\nAll our partners are 100% committed to your training, The Home School (where you do the majority of your training) will be the school your are employed in. You will need to attend a Host School (where you have an opportunity to broaden your experience).  We will look to support you and your employer in seeking out this second school.\r\n\r\nYou will select whether you want to specialise in 3-7 (Foundation Stage /Key Stage 1) or 5-11 (KS1 and 2).  Although you will be trained in 2 different schools, the structure of the programme will enable you to get to know the whole partnership.  This is because your dedicated training days are delivered by expert tutors who are also senior leaders within their own schools. Most of the dedicated training involves you visiting these schools.  Having an opportunity to see practice and meet children in a wide range of schools helps you to reflect on  what is going to have the most impact upon your progress towards QTS.","personalQualities":"Remember that we really try to get to know you as an individual at the interview so that you feel at ease and can evidence the personal qualities that you bring to the programme. It is your personal qualities that will help to make a significant difference to the educational life chances of the pupils in our partnership of schools. ","otherRequirements":"Before starting the programme all applicants must be deemed suitable to train to teach so safeguarding checks will be undertaken. They must also demonstrate they are fit to teach so will need to complete a pre-ITT health questionnaire.","status":1,"createdAt":"2021-07-06T10:51:21.204Z","updatedAt":"2021-09-28T10:07:47.552Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024"}
