{"id":"a53a22c8-18d2-4d7f-a8f7-4093a47f3a99","name":"Primary","code":"29X3","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"bc5f296a-442c-4c7a-a77e-c20eaed661bd","name":"Main Site","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"f652c4be-0c09-4451-9aa3-8cd5b850ca70","code":"1NC","name":"Sola Fide Multi-Academy Trust"},"accreditedBody":{"id":"791f82c8-19fd-4339-9c7b-301dee8067ce","code":"H60","name":"University of Huddersfield"},"profPost":"PG","english":"2","maths":"2","science":"2","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"financialSupport":"You can apply for a tuition fee loan as part of your application to Student Finance England for loans and grants. Student Finance England will pay your fees direct to the University.\r\nYou don’t have to pay the loan back while you study. It will only be repayable when you have left the course and earn over £25,000 a year.\r\nWhen you enrol, we will ask you who will be paying for your fees and whether you have requested a loan. If you have not taken the loan, we will send you an invoice for the fees, which will require payment in full during the relevant academic year.\r\nIf you are an international student coming to study at the University of Huddersfield, please visit the International Fees and Finance (https://www.hud.ac.uk/international/tuition-fees/) pages for full details of tuition fees and support available.\r\n","aboutCourse":"The Sola Fide School Direct programme is a collaborative programme offering 120 days of 'hands-on'  teaching experience in schools, 30 training days led by outstanding primary practitioners in their school settings and a further 30 core days at the University of Huddersfield.  Upon graduating from the programme, you will gain a Postgraduate Certificate in Education (PGCE) with QTS and additional Masters level credits to ensure that you will have the best possible start to your teaching career. \r\n\r\nOur teaching placements are based in schools across our alliance, in a range of differing contexts and are enhanced by additional enrichment placements and training.\r\n\r\nTrainees will have the support of highly trained, school- based professional mentors and a designated contact in our Multi Academy Trust, who will design a highly bespoke programme, tailored to meet trainees’ needs. As well as in-school experience, each trainee will attend core-training days in MAT schools and receive full access to all of the higher educational facilities the university has to offer.\r\n\r\nAssessment is typically through the completion of a range of classroom activities, written assignments, reports, personal subject audits and the development of portfolios of evidence.  There are no formal examinations and the assignments are carefully designed to help you to develop your teaching practice further.  Upon successful completion of the programme we recommend Qualified Teaching Status be awarded by the Department for Education.\r\n\r\n\r\n","interviewProcess":"We love welcoming visitors to our schools and we aim to make our interview process a positive experience for all. We realise that making the right choice of training route and provider is as important to our candidates as it is for us to identify and select the very best potential. \r\n\r\nThe interview process typically includes:\r\n*  An applicants’ briefing (school-tours not currently operating)\r\n*  A class-based assessment; during this counterpart, you will be asked to facilitate a 20 minute activity with a group of children to a given brief.\r\n* A written task; during this activity you will be expected to write a short piece of text to display your written communication skills. \r\n* A maths assessment.\r\n* A panel interview with members of the alliance \r\n\r\nDuring this process you will be interviewed as to your suitability for the position on the School Direct Programme and will be given the opportunity to ask any further questions you may have about the course. \r\n","howSchoolPlacementsWork":"We have a number of long-standing school partnerships locally and we work extremely closely with our partners to ensure that every student has the very best experience possible.\r\n\r\nThe course typically consists of two main placements, in two contrasting settings and age phases, but there are also a number of additional experiences offered, including short placements in specialist SEND settings and those with high-proportions of learners with English as an Additional Language (EAL). \r\n\r\nFor further information about the course structure and  design please email Simon Buxton-Moore at head@stjohns.oldham.sch.uk.","personalQualities":"We are looking for inspirational people who have the ambition to become the school leaders of the future. We want the most committed and aspirational trainees, who will embrace the opportunities we offer and be committed to personal development and life-long learning.\r\n\r\nIn addition to the entry requirements above, we also advise that you spend some time gaining experience in a primary school in Key Stage 1 and 2 to give you a greater insight into your career choice and help you decide whether teaching is right for you. Other areas of relevant experience may also support your application.","otherRequirements":"* You should provide two references. Where applicants have current or recent experience working with children or young people, one of the referees should be a member of staff who can comment on your potential to train to teach.\r\n* Offers will be subject to satisfactory Disclosure and Barring Service enhanced disclosure check and trainees must not previously have been barred from teaching or working with children. \r\n* We also ask you to complete a health declaration to ensure that you have the health and physical capacity to teach. \r\n\r\n\r\n","status":2,"createdAt":"2021-07-06T10:48:26.706Z","canSponsorStudentVisa":"no","cycle":"2024"}
