{"id":"f1f16043-e44f-4c6a-9e63-dfc1714daaae","name":"Primary","code":"2KHS","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"8fda304c-cf07-427c-913d-d375569b78a2","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"10dab36b-7389-41ee-a566-5c6db11b6afb","code":"21F","name":"Maplefields Academy (Mainstream and Special Needs)"},"accreditedBody":{"id":"828d1c59-36a8-4678-9a60-662565ae7172","code":"C03","name":"The Cambridge Partnership"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"The Pilgrim Partnership will accept equivalent GCSE qualifications in English, maths and science by a recognised third party.  As an exam will incur a cost please contact us to make sure the awarding body is acceptable.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Trainees on the School Direct tuition fee route will be in a classroom working with experienced colleagues.  You will also be appointed a mentor with whom you will meet at least once a week.  The mentor and class teacher are often the same person.\r\n\r\nThe course is full time with weekly training sessions and workshops \r\ncovering all aspects of teaching the primary curriculum, which compliments the in-school training experience provided.  The training sessions will be led by expert practitioners who will support you to develop your knowledge, skills and understanding of  teaching and learning effectively in a primary school. \r\n\r\nAs part of the programme trainees working in special schools will have placements in two contrasting educational settings.  Trainees will spend two terms in a special school setting and one term in a mainstream school.  Trainees must be able to demonstrate they can teach across the age range and the National Curriculum in both settings. \r\n\r\nSubject to COVID-19 Government Regulations:-\r\nTrainees following the mainstream programme will have placements in two contrasting educational settings.   As the year progresses they will spend an increasing amount of time in school and by the summer term  will be based at their placement school full time.  Trainees will spend some time in a special school and have focus days to enhance their expertise and understanding of SEND.  \r\n\r\nA programme of continuous formative assessment of trainees'  professional  understanding and subject knowledge (as specified in the Core Content Framework) alongside your ability to teach \r\nculminates in a rigorous summative assessment against the Teachers' Standards for Qualified Teacher Status (QTS) as specified by the Department for Education (DfE).  The Pilgrim Partnership, working with The Cambridge Partnership as the accredited provider, recommends trainees, on successful completion of their training programme for Qualified Teacher Status (QTS).  Trainees will also study for a PGCE alongside QTS.\r\n\r\nTrainees will be required to pay tuition fees and can apply to the Student Loans Company for tuition fee and maintenance loans. \r\n\r\n  \r\n\r\n","interviewProcess":"Candidates who meet the entry requirements will be invited to interview.  \r\n\r\nPlease note:- During the COVID-19 pandemic interviews will take place online using Teams until further notice.\r\n\r\nDependent upon your experience in SEND a visit to the school may be required.\r\n\r\nFurther information will be forwarded to candidates invited to interview to enable them to prepare.\r\n","howSchoolPlacementsWork":"Trainees working in special schools will have placements in two contrasting educational settings.  Trainees will spend two terms in a special school setting and one term in a mainstream school.  \r\n\r\nSubject to COVID-19 Government Regulations:-\r\nTrainees following the mainstream programme will have placements in two contrasting educational settings.  Trainees will spend some time in a special school and have focus days to enhance their expertise and understanding of SEND.  \r\n\r\n\r\nTrainees will be allocated a school taking into account their geographical location and individual needs\r\n","personalQualities":"The Pilgrim Partnership, working with The Cambridge Partnership as the accredited provider, and its partners are looking for ambitious trainee teachers who are passionate and enthusiastic about working with children.  The programme is challenging, and so we are looking for candidates with a wide range of skills, knowledge, experiences and an aptitude for teaching.\r\n","otherRequirements":"* Declaration of any convictions \r\n* An Enhanced DBS Disclosure will be required following an offer of a place\r\n* A satisfactory health questionnaire will be required following an offer of a place\r\n* Satisfactory clearance for registration\r\n","status":1,"createdAt":"2021-07-06T10:49:25.417Z","updatedAt":"2021-11-03T11:01:57.165Z","canSponsorStudentVisa":"no","cycle":"2024"}
