{"id":"6bbb935b-4709-42ca-9822-8118a465423a","name":"Design and Technology","code":"AE02","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"118fabd7-86d0-4a40-9e9a-e5c302abe59b","code":"DT","name":"Design and technology"}],"locations":[{"id":"f3093ee8-14bd-460e-806f-f4b441611a1a","name":"Valley Park School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"0e2b0f11-3ca8-4332-b37c-ccbb093db5a1","code":"1CU","name":"Valley Invicta Teacher Training (VITT)"},"accreditedBody":{"id":"4d4cceab-1516-4a6c-a9ab-5de0e32e1fe1","code":"S90","name":"University of Sussex"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","aboutCourse":"Why apply for this programme?\r\n\r\n•\tDo you have a desire to make a positive impact on a child’s life opportunities?\r\n•\tDo you have the ability to motivate and engage children?\r\n•\tDo you want to acquire a deep understanding of how children?\r\n•\tAre you committed to continuous self-improvement?\r\n\r\nBy studying this employment based programme, you will become a confident, competent and effective teacher with the skills and knowledge to teach within the primary phase. Applicants for this programme will focus on children aged 11-18 years old. \r\n\r\nWe can offer: \r\n- Access to excellent practice in teaching and learning \r\n- Access to a diverse range of school settings \r\n- Excellent support from trained and experienced mentors \r\n","interviewProcess":"Application\r\nAll application forms will be vetted for the following: \r\n1) Applicant meets the academic entry criteria \r\n2) Applicant has written a strong personal statement \r\n3) Applicant has been given a strong reference. This should be an academic reference if the applicant has been in education within the last five years. \r\n\r\nThe Selection Process\r\nValley Invicta Teaching School Alliance and the University of Sussex work together to interview applicants.  In order for your application to be considered you should complete a full application and consider your personal statement as being an important part of this process.  If you are shortlisted you will be asked to complete written tasks and attend a formal interview.\r\n\r\nAll applications will be reviewed and then successful applicants shortlisted.\r\nIf you are shortlisted you will be invited to attend an interview at the school, during the interview you can expect:\r\nA tour of the school\r\nA teaching task\r\nA formal interview\r\nA subject knowledge related task\r\n\r\nYour application will also need to be approved by the relevant University either through the school or during a formal visit to the University. This part of the interview will involve literacy and numeracy tasks to assess your levels.\r\n\r\n\r\n","howSchoolPlacementsWork":"The majority of your training will take place at within the Valley Invicta Teaching School Alliance. The training programme will be personalised to the individual's professional needs but will include training on the following areas: teaching and learning, curriculum, assessment, working with parents and the community. All training is closely aligned to support the trainee achieve the Teachers’ Standards. \r\n\r\nCandidates will have the opportunity to work alongside experienced outstanding teachers. Support and mentorship will be given by senior teachers. \r\n\r\nAlthough candidates will have a base school, there will be lots of opportunities for cross-school training and will include teaching experience within another school in the Trust.  \r\n\r\nOur training is supported by the University of Sussex which has a long and successful tradition in teacher education in partnership with local schools. \r\n\r\nCandidates on a salaried place with University of Sussex will be automatically registered on the Sussex PGCE. This qualification offers up to 90 Master credits and enables progression onto a part-time MEd as an early career teacher and is equivalent to half a Sussex Master’s degree. \r\n\r\nOn the salaried route you will be working in school as an unqualified teacher alongside studying and are likely to have a more extensive teaching timetable from earlier on in the programme than either School Direct (Tuition fee) or Traditional PGCE trainees.  As a salaried trainee you will receive the same high quality level of training and support from the University of Sussex as would a traditional Sussex PGCE candidate, in addition to the many benefits of undertaking a school–based model of training with our strong partnership of schools.\r\n\r\nUniversity of Sussex tutors work with us to provide high quality inputs on how to teach and assess your chosen secondary subject or across the curriculum in primary schools. The University also provides a comprehensive programme of Professional Studies which complements the school-based training offered across our partnership. \r\n\r\nThe course begins in September with an intensive 3 week University Induction course when you will attend both Sussex University and your main school on specified days. ","personalQualities":"We are looking for someone who: \r\n- has good organisational skills \r\n- has excellent time keeping \r\n- is approachable, empathetic and enthusiastic \r\n- has the ability to be decisive, consistent and to set priorities \r\n- is an effective communicator (both orally and in writing) to a variety of audiences \r\n- has the ability to develop good relationships within a team and ability to be a supportive team player \r\n- has a commitment to personal professional development \r\n- has the ability to relate well to all involved in school life, showing sensitivity, consideration but also a sense of humour when needed\r\n","otherRequirements":"Commitment to promote equal opportunities in line with the University of Sussex’s and the relevant Valley Invicta Teaching School Alliance school’s equal opportunity policies. \r\n- Commitment to the Valley Invicta Teaching School Alliance Mission Statement, promoting the aims positively\r\n- A willingness to work throughout the Valley Invicta Teaching School Alliance\r\n- An understanding of Health and Safety issues \r\n- Commitment to safeguarding and promoting the welfare of all children.\r\n","status":1,"createdAt":"2021-07-06T10:50:20.558Z","updatedAt":"2021-09-21T10:32:41.373Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"The salary will be based on the unqualified Teacher pay scale.\r\n\r\nPLEASE NOTE: The VITSA Alliance schools do not support sponsorship of Tier 2 visas."}
