{"id":"a6add9c7-e26f-4165-b8c1-deaeea4d0d3e","name":"Biology","code":"AW92","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"322cfc19-d51d-45db-91e3-bd7b4738470f","code":"C1","name":"Biology"}],"locations":[{"id":"f3093ee8-14bd-460e-806f-f4b441611a1a","name":"Valley Park School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"59254daf-e00d-4229-a209-0c212ec2c3b9","name":"Invicta Grammar School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"0e2b0f11-3ca8-4332-b37c-ccbb093db5a1","code":"1CU","name":"Valley Invicta Teacher Training (VITT)"},"accreditedBody":{"id":"4d4cceab-1516-4a6c-a9ab-5de0e32e1fe1","code":"S90","name":"University of Sussex"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feeDetails":"Please note the above tuition fee is based on a School Direct 1 year training programme for 2019 - 2020.\r\n\r\nPLEASE NOTE: The VITSA Alliance schools do not support sponsorship of Tier 2 visas. ","financialSupport":"The Secondary Tuition Fee PGCE programme is funded by tuition fees paid by the trainee who will be eligible for the standard student support package, including training bursaries, tuition fee loans and scholarships where eligible.  The programme runs for one year. (https://www.sussex.ac.uk/courses/study/school-direct-tuition-and-school-direct-salaried.aspx)","aboutCourse":"Why apply for this programme?\r\n•\tDo you have a desire to make a positive impact on a child’s life opportunities?\r\n•\tDo you have the ability to motivate and engage children?\r\n•\tDo you want to acquire a deep understanding of how children learn?\r\n•\tAre you committed to continuous self-improvement?\r\n\r\nBy studying this employment based programme, you will become a confident, competent and effective teacher with the skills and knowledge to teach within the secondary phase. Applicants for this programme will focus on children aged 11-18 years old. \r\n\r\nWe can offer: \r\n- Access to excellent practice in teaching and learning \r\n- Access to a diverse range of school settings \r\n- Excellent support from trained and experienced mentors \r\n","interviewProcess":"Application\r\n\r\nAll application forms will be vetted for the following: \r\n1) Applicant meets the academic entry criteria \r\n2) Applicant has written a strong personal statement \r\n3) Applicant has been given a strong reference. This should be an academic reference if the applicant has been in education within the last five years. \r\n\r\nThe Selection Process\r\nValley Invicta Teaching School Alliance and the University of Sussex work together to interview applicants.  In order for your application to be considered you should complete a full application and consider your personal statement as being an important part of this process.  If you are shortlisted you will be asked to complete written tasks and attend a formal interview.\r\n\r\nAll applications will be reviewed and then successful applicants shortlisted.\r\n\r\nIf you are shortlisted you will be invited to attend an interview at the school, during the interview you can expect:\r\nA tour of the school\r\nA teaching task\r\nA formal interview\r\nA subject knowledge related task\r\n\r\nYour application will also need to be approved by the relevant University either through the school or during a formal visit to the University. This part of the interview will involve literacy and numeracy tasks to assess your levels.\r\n\r\n\r\n\r\n","howSchoolPlacementsWork":"School Based Training\r\n\r\nThe majority of your training will take place within the Valley Invicta Teaching School Alliance. The training programme will be personalised to the individual's professional needs but will include training on the following areas: teaching and learning, curriculum, assessment, working with parents and the community. All training is closely aligned to support the trainee achieve the Teachers’ Standards. \r\n\r\nCandidates will have the opportunity to work alongside experienced outstanding teachers. Support and mentorship will be given by senior teachers. \r\n\r\nAlthough candidates will have a base school, there will be lots of opportunities for cross-school training and will include teaching experience within another school in the Trust.  \r\n\r\nUniversity\r\nWe are working with the University of Sussex as an accredited teacher training provider. There will be opportunities to have pedagogical and professional training sessions at the University. The University will support the school in the application and interview process. \r\n\r\nAdditionally, the University of Sussex will provide library services, student services, and other support needed, matched to the candidates requirements\r\n\r\nDuration\r\nThe Secondary Tuition Fee QTS programme is funded by tuition fees paid by the trainee who will be eligible for the standard student support package, including training bursaries, tuition fee loans and scholarships where eligible.  The programme runs for one year. \r\nFurther details regarding the University of Sussex's course can be found at: (https://www.sussex.ac.uk/courses/study/school-direct-tuition-and-school-direct-salaried.aspx)\r\n\r\nQualifications awarded\r\nAll our School Direct trainees receive exactly the same support and training from the University as our Core PGCE trainees in addition to a PGCE Qualification.\r\n","personalQualities":"We are looking for someone who: \r\n- has good organisational skills \r\n- has excellent time keeping \r\n- is approachable, empathetic and enthusiastic \r\n- has the ability to be decisive, consistent and to set priorities \r\n- is an effective communicator (both orally and in writing) to a variety of audiences \r\n- has the ability to develop good relationships within a team and ability to be a supportive team player \r\n- has a commitment to personal professional development \r\n- has the ability to relate well to all involved in school life, showing sensitivity, consideration but also a sense of humour when needed \r\n","otherRequirements":"Commitment to promote equal opportunities in line with the University of Sussex’s and the relevant Valley Invicta Teaching School Alliance school’s equal opportunity policies. \r\n- Commitment to the Valley Invicta Teaching School Alliance Mission Statement, promoting the aims positively\r\n- A willingness to work throughout the Valley Invicta Teaching School Alliance\r\n- An understanding of Health and Safety issues \r\n- Commitment to safeguarding and promoting the welfare of all children.\r\n\r\n","status":1,"createdAt":"2021-07-06T10:50:21.895Z","updatedAt":"2021-09-21T10:24:23.597Z","canSponsorStudentVisa":"yes","cycle":"2024"}
