{"id":"9d7eec4c-b283-46f5-b5b9-1d156d3daf28","name":"Primary","code":"2RRB","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"29be76eb-761c-4402-9c89-5cbbf3856628","name":"Two Mile Ash ITT Partnership","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"6e6c8aa3-8d77-4c7d-af3c-4c7912b1cc2a","code":"T89","name":"Two Mile Ash ITT Partnership"},"profPost":"BO","degreeGrade":"9","english":"1","maths":"1","science":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We do not offer equivalency tests ourselves, but do accept from a number of providers. Please note, if you are applying for an Apprenticeship route, equivalency tests are not accepted, you must study for functional skills tests instead.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Our training programme is varied, innovative and inspiring. Through it, our trainees have access to excellent teaching and a variety of experiences in our partner schools. Although we offer different routes to QTS, the core elements of our programmes have been developed over years of experience. Our programmes are highly respected and, as a result of this, in addition to our PGCE routes, we now also offer a BA(Hons) in Primary and Early Years Education with Birmingham City University (see UCAS undergraduate website).  'Trainers and schools model excellent practice and raise trainees' awareness, aspirations and ability to emulate this' Ofsted 2013  \r\n\r\nYou will spend time in school every week, which promotes application of theoretical learning to your classroom practice. Training is front-loaded to the Autumn term, which means more time in school during the Summer term preparing you for being a fully-fledged NQT. Whilst in school, you will observe successful teachers; teach children in small groups up to whole classes; plan and deliver learning to children (with coaching and mentoring from your expert School Based Trainer) and join in with school-led training opportunities.  \r\n\r\nWe assess your skills as teachers by judging your impact on the outcomes for the children you are teaching. You will present information for assessment in written formats, portfolios, presentations and tutorial discussions. All assessments are continuous throughout the year through individual tasks and group projects. \r\n\r\nCore Training takes place at our dedicated training centre and in venues across the area. It provides inspirational, hands-on training from safeguarding to subject knowledge; behaviour management to building resilience; well-being to pedagogy, and much more.  Training days provide an opportunity to share experiences, while learning from our expert trainers. These sessions provide you with ‘headspace’ and an opportunity to reflect on teaching as well as learning new skills and pedagogies to take back to school.   \r\n\r\nFor the PGCE element of our programme, you will work towards 60 Master-level credits awarded by Birmingham City University.  All BCU lectures and seminars are delivered in Milton Keynes by experienced BCU academic staff.  The combination of higher level academic study with the hands-on, practical nature of our school-led programme gives you the perfect balance of theory and practice, making for well-rounded, informed and inspirational teachers. The PGCE requires three written assignments, which are assessed and moderated by the team at BCU. ","interviewProcess":"We enjoy interviewing prospective teachers and discovering with you whether you are suited to teacher training and how our programme would work for you and your learning styles. The interviews are usually conducted by a member of the Initial Teacher Training team and a Head Teacher/Deputy Headteacher from one of our Partnership schools. \r\n\r\nOur interview process was adapted for the 2021 cycle to ensure COVID-safe practice and was conducted virtually. For 2022, our decision about whether to interview remotely or in person will be reconsidered in the light of national and local guidance at the time and when you are invited to interview, full details will be shared at that point.\r\n\r\nPlease don’t worry about the interviews – we want to work with you to understand your motivations for teaching and are looking to see if you have the potential to train to teach – you don’t already have to be able to teach! The interview activities evidences how you engage and interact with children and this gives us an idea of your potential to train. \r\n\r\nRemember, learning to teach is a journey and you can be really successful from whatever starting point you have, whether you are a Teaching Assistant who has been in school for many years or someone with very little classroom experience. Our interview process is designed to explore that with you. ","howSchoolPlacementsWork":"All our Partnership schools are selected on the basis of their effectiveness and expertise. The Partnership thrives because of the active role that schools take in the design and delivery of the programme and because of their commitment to training teachers in their schools. \r\n\r\nOur partnership includes a range of schools including large urban schools; those in areas of social deprivation; village schools and faith schools. 'Outstanding use of the considerable expertise in partnership schools provides trainees and NQTs with consistently high-quality training, for the whole group and at individual level' Ofsted 2013  \r\n\r\nOur schools are mainly in Milton Keynes and its surrounding areas, but we work with some schools in Northants, Beds and Bucks, so if you live in those areas and would like to train more locally to where you live, you can talk to us about this in your interview to see if it is possible. \r\n\r\nYou can train for either Early Years (age 3-7) or General Primary (age 5-11). You will be immersed in the school from the outset, meaning that you 'live and breathe' real-life teaching and become a valued member of the school team. You will spend most of the year in your ‘home school’, with a 6 week placement in an alternative school and alternative key stage, as well as a short time in a special school. Your School-Based Trainer will mentor you during the year, which means your programme is bespoke to you, resulting in you being the best teacher you can be!","personalQualities":"The most important personal quality for teaching is wanting to create opportunities for young people to learn new skills and develop their understanding of the world. Successful teachers co-operate, collaborate and work on their own initiative. The ability to make good, professional relationships with children is paramount to being a successful teacher and we value the individuality of our trainees. It is important that you have thought about training to teach and found out what the role of a primary teacher involves. You may have visited or worked in schools, this is not a requirement although it is helpful.    ","otherRequirements":"You can ONLY apply for tuition-fee PGCE routes through Two Mile Ash ITT Partnership or Postgraduate Teaching Apprenticeship routes (with the financial support of a school).\r\n\r\nShould you be looking for a QTS only route (without the PGCE), you will need to apply for a School Direct route through Two Mile Ash School.","status":1,"createdAt":"2021-07-06T10:51:55.995Z","updatedAt":"2021-09-07T14:55:54.946Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
