{"id":"171a0a17-1b67-499f-acce-4612243e2845","name":"Citizenship (SEND)","code":"M212","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"yes","subjects":[{"id":"7c98ffbf-d90d-46bb-91ea-7817a81848f5","code":"09","name":"Citizenship"}],"locations":[{"id":"6263eadb-d9ea-4ef5-81b8-ec7868a03031","name":"The Rise School, TW13 7EF","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"e5573d32-1684-4472-9e2b-c6743eddce31","code":"2BV","name":"West London Teacher Training Alliance (Secondary)"},"accreditedBody":{"id":"7f11aaed-7c3e-42c5-af7a-023d33b45fa3","code":"U80","name":"UCL, University College London"},"profPost":"PG","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"You will need a minimum of a lower second-class UK Bachelor’s honours degree or an overseas qualification of an equivalent standard in a related subject. \n\nSpecific A-levels may not be required (depending on degree experience) but A levels in one or more of the following are useful: Politics, Law, Sociology, Citizenship Studies, Psychology, History, Geography, Religious Studies, Economics, Business Studies, Anthropology.","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Where appropriate, see our important guidance on:\n\n[Overseas Qualifications](https://www.wltta.org.uk/initial-teacher-training/secondary-courses-for-sept-2022/overseas-qualifications/); and see which equivalency test providers we can accept tests from [GCSE Equivalency tests](https://www.wltta.org.uk/initial-teacher-training/secondary-courses-for-sept-2022/gcse-equivalency-tests/).\n\nWe would normally only accept a candidate with one of the two required GCSEs outstanding (not both).","courseLength":"OneYear","feesUK":9250,"financialSupport":"While not provided directly by WLTTA, please be aware that as a full time student you would be eligible for cheaper travel in London using a student oyster card and in many boroughs, you can get a reduction on your council tax payments.","aboutCourse":"QUALIFICATION \r\n \r\nThis course M212, with a SEN school, leads to [PGCE (M)QTS](https://www.wltta.org.uk/initial-teacher-training/secondary-courses-for-sept-2022/different-qualification-outcomes/)\r\n\r\nSPECIAL FEATURES\r\n\r\nThis course is run by the West London Teacher Training Alliance (WLTTA) in partnership with UCL.  We make prompt shortlisting decisions and will liaise with you quickly if we need additional information.\r\n\r\nWLTTA enables you to choose your host school.  Later, if there is a teaching vacancy and they want to retain you, you can be employed for the following year without the post being advertised.  By becoming a WLTTA trainee, all our schools could employ you this way and we operate a pool.\r\n\r\nOur aim is to produce exceptional teachers who could remain in alliance schools to continue their careers, taking advantage of further professional development, including the accredited Early Career induction programme.\r\n\r\nTHE TRAINING\r\n\r\nYou would enrol at the university and would attend the same university sessions with those who had applied through the university; have full access to university facilities and mentors; and the university still awards your PGCE.  WLTTA selects a second contrasting school for your ‘away’ placement.  \r\n\r\nAs a guide: [typical timetable](https://www.wltta.org.uk/initial-teacher-training/ucl-bus-cit-typical-timetable/)\r\n\r\nThe Citizenship PGCE offers students the opportunity to be trained at the leading edge of citizenship education for the 11–16 age range, becoming one of the next generation of specialist teachers of Citizenship and associated subjects such as Government and Politics, Humanities, Social Sciences, Law and PSHE. \r\n\r\nAt school, through an initial programme of observations, you will become familiar with the workings of the school and department (pupil groups, pastoral systems, staffing, curriculum, resources, facilities, methods of teaching, lesson planning, and assessment).  \r\n\r\nYou will be treated like a member of staff and with your school mentors, you will feel supported as you become ready to teach. Our mentors are excellent experienced teachers who undertake rigorous training to develop their mentoring skills.\r\n\r\nYour university tutor will visit you in both schools on a regular basis and liaise with your school mentor regarding your training and development. Your university tutor will carry out your final assessment in school against the national Teachers’ Standards.  \r\n\r\nYou will learn how to really engage students in Citizenship lessons, how to plan for compelling learning in Citizenship, how to support and challenge students to make optimum progress, how to build strong class boundaries and relationships, how to develop and utilise specialist subject knowledge, and how to plan memorable Active Citizenship projects. ","interviewProcess":"Our schools seek trainees that aspire to work for them. We enable you to select your preferred host school(s) at application and later through a referral process.  We provide information about the schools to help you choose.  \r\n\r\nSTAGE 1: SCHOOL INTERVIEW\r\n\r\nOnce shortlisted, we would invite you to an interview with your chosen school.  In addition to the panel interview, you may be asked to prepare something to teach in the classroom for a short time.  You may also be asked to complete a short literacy/numeracy test.\r\n\r\nInternal Referrals\r\n\r\nIf you are not selected as a preferred candidate by the school, but have demonstrated potential, you can then choose another school of ours if you were interested and eligible for another of our courses.  We hope to fit good candidates with schools that they are happy with and where they can secure an offer.\r\n\r\nSTAGE 2: UNIVERSITY INTERVIEW \r\n\r\nIf you are identified as the preferred candidate from the school interview, we then arrange for you to be invited to the Stage 2 university interview. If you pass this, we will be able to make you an offer.\r\n\r\nAPPLICATIONS\r\n\r\nThe new application process (button at end) is intuitive, but we have made a short guide to how it works: [How application system works](https://www.wltta.org.uk/initial-teacher-training/secondary-courses-for-sept-2022/how-application-system-works/). ","howSchoolPlacementsWork":"CHOOSING YOUR SCHOOL\r\n\r\nWith WLTTA you select the main host school at application and normally there are several to choose from but we are only running this particular course (which specifies a SEN host school) from \r\n\r\n* The Rise School, TW13.\r\n\r\nWe then later arrange your second placement at another contrasting (mainstream) WLTTA school to provide greater depth to your training experience. \r\n\r\nIf you want to see when you would be at the university; when at your main host school; and when the contrasting school - see our typical timetable linked above.\r\n\r\nYou can read a description of The Rise and our other secondary schools in \r\nour overall [WLTTA Secondary School Summary Descriptions](https://www.wltta.org.uk/initial-teacher-training/secondary-courses-for-sept-2022/wltta-secondary-school-summary-descriptions/) and also our [Map of WLTTA Schools](https://www.wltta.org.uk/location-map-with-magnifier/)\r\n\r\nYou can always contact us to ask how many applications (if any) are being considered by different schools at the point that you are about to apply.\r\n\r\nOUR DETAILED WEBSITE, LIVE ONLINE PRESENTATION AND Q&A\r\n\r\nWe recommend that you visit our website [www.wltta.org.uk](https://www.wltta.org.uk/) to properly see all our vacancies.  You can download the course document for any of our courses and see a video about us, with previous trainees being interviewed.  \r\n\r\nIf you want to, you can also sign up there to join our fortnightly 'live' Zoom presentation about getting into teaching and it includes an opportunity for Q&A . The presentation explains all about the different routes into teaching and their separate benefits; how the money works; tips about using the 'Find Postgraduate Teacher Training' portal; applications; offers; etc.  No pressure, you don't have to attend this at all.  It's just there for anyone who is trying to understand it all better.  We get excellent feedback on this year after year.","personalQualities":"We seek trainees with a passion to engage and inspire students to a love of learning, who are:   \r\n\r\n* committed to championing their students;\r\n* open to learning about children’s physical/social/emotional/cognitive needs and how these can affect behaviour;\r\n* in good health with the ability to cope with stress.  Teaching is incredibly rewarding, but it also requires an element of resilience!\r\n* professional/committed to equal opportunities;\r\n* able to communicate well in written/spoken English, with at least basic computer skills and commitment to developing these; and with\r\n\r\nIt helps to have a sense of humour/ability to laugh at yourself!","otherRequirements":"Some previous experience with SEN children would be a distinct advantage.\r\n\r\nA realistic understanding of the role of a teacher and an awareness of some current issues facing the profession is also important.  We have some advice relating to school experience on our website: [WLTTA School Experience tab](https://www.wltta.org.uk/initial-teacher-training/secondary-courses-for-sept-2022/school-experience/)\r\n\r\nOffers are conditional on satisfactory outcome of a Disclosure & Barring Service Enhanced Check and an occupational health check both administered through the university after an offer is accepted. The total cost of these checks is approx. £160. ","status":1,"createdAt":"2021-08-03T10:48:41.978Z","updatedAt":"2021-08-03T10:59:58.359Z","canSponsorStudentVisa":"yes","cycle":"2024"}
