{"id":"175fbc22-cabf-4546-b15e-2702ab58a325","name":"Mathematics","code":"2XW3","qualification":"qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"72345aa7-096c-488f-8649-085b8178cadb","code":"G1","name":"Mathematics"}],"locations":[{"id":"e9842247-066b-4988-9b57-66df7cebcd6a","name":"West London Free School, W6 9LP","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"e5573d32-1684-4472-9e2b-c6743eddce31","code":"2BV","name":"West London Teacher Training Alliance (Secondary)"},"accreditedBody":{"id":"ef172d85-20e4-4aa2-96d0-9e3ae81f526d","code":"S64","name":"St Mary’s University, Twickenham"},"degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"You need a recognised honours degree at 2.2 or above, ideally in Mathematics but otherwise with a significant proportion of Maths such as Economics, Science, Engineering, Computing.  \n\nThose without a Mathematics degree need good grade at A-Level Mathematics and preferably other undergraduate mathematical studies.","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Where appropriate, see our important guidance on:\n\n[Overseas Qualifications](https://www.wltta.org.uk/initial-teacher-training/secondary-courses-for-sept-2022/overseas-qualifications/); and see which equivalency test providers we can accept tests from [GCSE Equivalency tests](https://www.wltta.org.uk/initial-teacher-training/secondary-courses-for-sept-2022/gcse-equivalency-tests/).\n\nWe would normally only accept a candidate with one of the two required GCSEs outstanding (not both).","courseLength":"OneYear","feesUK":null,"aboutCourse":"QUALIFICATION OUTCOME\r\n \r\nThis salaried Mathematics course 2XW3 leads to QTS. Click here for [Further clarity on the significance of different teacher training qualifications](https://www.wltta.org.uk/initial-teacher-training/secondary-courses-for-sept-2022/different-qualification-outcomes/).\r\n\r\nSPECIAL FEATURES\r\n\r\nThis course is run by the West London Teacher Training Alliance (WLTTA) in partnership with St Mary’s University, Twickenham.  We make prompt shortlisting decisions and will liaise with you quickly if we need additional information.\r\n\r\nWLTTA enables you to choose your host school.  Later, if there is a teaching vacancy and they want to retain you, you can be employed for the following year without the post being advertised.  By becoming a WLTTA trainee, all our other schools could employ you this way and we operate a pool.\r\n\r\nOur aim is to produce exceptional teachers who could remain in alliance schools to continue their careers, taking advantage of further professional development, including the accredited Early Career induction programme.\r\n\r\nTHE TRAINING\r\n \r\nYour training will be predominantly based in your host school other than\r\n\r\n* approx. 10 days at the university across the year; and\r\n* your second placement for approx. 6 weeks at another WLTTA school.\r\n  \r\nYou will register with the university and meet with your University Tutor who will begin to work with you on a needs analysis for a Training Plan (TP) in term one. This will be reworked in term two and three between you, your school mentor and university tutor. \r\n\r\nThrough an initial programme of observations, you will become familiar with the workings of the school and department (pupil groups, pastoral systems, staffing, curriculum, resources, facilities, methods of teaching, lesson planning, and assessment).  \r\n\r\nYou will be treated like a member of the teaching staff and with your school mentors, you will feel supported as you become ready to teach. Our mentors are excellent experienced teachers who undertake rigorous training to develop their mentoring skills.  \r\n\r\nThroughout your time in both schools, your university tutor visits you to monitor your progress and discuss your development with you and your school mentors. You will maintain close links with your host school throughout the programme.\r\n\r\nYou will have the opportunity to teach KS3/KS4 and support KS5.  KS3 topics include number and algebra; shape, space and measures, handling data, and problem solving. KS5 explore core mathematics, mechanics and statistics.","interviewProcess":"Our schools seek trainees that aspire to work for them. We enable you to select your preferred host school(s) at application and later through a referral process.  We provide information about the schools to help you choose.  \r\n\r\nINTERVIEW\r\n\r\nShortlisted candidates will attend a school interview.  \r\n\r\nYou will be asked to email WLTTA with scans of your relevant certificates/transcripts if available.  We can still make an offer subject to later verification of qualifications.\r\n\r\nINTERNAL REFERRALS\r\n\r\nIf you do not get an offer after the school interview but have demonstrated potential, we may suggest that you choose another school (perhaps from one of our unsalaried maths courses that attracts a large bursary) and we would recommend your shortlisting.  You would not need to make a fresh application.\r\n\r\nWe hope to fit good candidates with schools that they are happy with and where they can secure an offer.\r\n\r\nThere remains an advantage initially in applying to the course at more than one school, because such applications would be considered in parallel rather than sequentially. If you have a clear first choice, email us and we can try to ensure a sensible order for the interviews.  ","howSchoolPlacementsWork":"CHOOSING YOUR SCHOOL\r\n\r\nWith WLTTA you select the main host school at application and normally there are several to choose from but we are only running this particular course from \r\n\r\n* West London Free School, W6.\r\n\r\nWe then later arrange your second placement (normally in the spring term) at another contrasting WLTTA school to provide greater depth to your training experience. \r\n\r\nYou can read a description of The Rise and our other secondary schools in our overall [WLTTA Secondary School Summary Descriptions](https://www.wltta.org.uk/initial-teacher-training/secondary-courses-for-sept-2022/wltta-secondary-school-summary-descriptions/). Please also refer to our [Map of WLTTA Schools](https://www.wltta.org.uk/location-map-with-magnifier/)\r\n\r\nYou can always contact us to ask how many applications (if any) are being considered by different schools at the point that you are about to apply.  \r\n\r\nOUR DETAILED WEBSITE & LIVE PRESENTATION AND Q&A\r\n\r\nWe recommend that you visit our website [www.wltta.org.uk](https://www.wltta.org.uk/) to properly see all our vacancies - for example, we have two additional maths teacher-training courses (unsalaried with bursary) one at a variety of mainstream schools; the other at a SEN school.  You can download the course information document for any of our courses; and see a video about us, with previous trainees being interviewed.  \r\n\r\nIf you want to, you can also sign up there to join our fortnightly 'live' Zoom presentation about getting into teaching and it includes an opportunity for Q&A. The presentation explains all about the different routes into teaching and their separate benefits; how the money works; tips about using the 'Find Postgraduate Teacher Training' portal; applications; offers; etc.  No pressure, you don't have to attend this at all.  It's just there for anyone who is trying to understand it all better.  We get excellent feedback on this year after year.","personalQualities":"We seek trainees with a passion to engage and inspire students to a love of learning, who are:   \r\n\r\n* committed to championing their students;\r\n* open to learning about children’s physical/social/emotional/cognitive needs and how these can affect behaviour;\r\n* in good health with the ability to cope with stress.  Teaching is incredibly rewarding, but it also requires an element of resilience!\r\n* professional/committed to equal opportunities;\r\n* able to communicate well in written/spoken English, with at least basic computer skills and commitment to developing these; and with\r\n\r\nIt helps to have a sense of humour/ability to laugh at yourself!","otherRequirements":"We require energetic and committed applicants with excellent subject knowledge and ideally previous experience that might enable a faster progression into teaching than on an unsalaried course.\r\n\r\nA realistic understanding of the role of a teacher and an awareness of some current issues facing the profession is also important.  We have some advice relating to school experience on our website: [WLTTA School Experience tab](https://www.wltta.org.uk/initial-teacher-training/secondary-courses-for-sept-2022/school-experience/).\r\n\r\nOffers are conditional on satisfactory outcome of a DBS check (approx. £60) and an occupational health check (approx. £20) both administered through the university after an offer is accepted. ","status":1,"createdAt":"2021-07-06T10:53:47.576Z","updatedAt":"2021-07-29T10:18:09.948Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"The successful candidate in any maintained school will be paid a salary by the employing host school in line with the ‘Non-Qualified Teacher Pay Range 2022-23’, normally at the Point 1 level.  Free Schools can set their own trainee salary levels, but usually follow the pay range.\r\n\r\nThis government pay range is expected to be published in Sept. 2022.  \r\nAs a guide, Point 1 on the Unqualified Teacher Pay Range for 2021-22 is:\r\n\r\n* £23,099 (for a school in Inner London)\r\n\r\nThe tuition fee for this course will be covered by WLTTA.\r\n\r\nTrainees on salaried programmes are not eligible for bursaries or student loans. \r\n\r\nPlease note that we are unable to sponsor anyone who would otherwise not have the right to take up employment in this country. "}
