{"id":"98ccee11-2ef2-43ec-8568-be1f6c50c308","name":"Physics with Mathematics","code":"NH05","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"72345aa7-096c-488f-8649-085b8178cadb","code":"G1","name":"Mathematics"},{"id":"bf97cd0a-224c-43d3-a021-84143df13e8d","code":"F3","name":"Physics"}],"locations":[{"id":"378418ce-cf05-42f6-9e76-7e56046273d3","name":"Fulham Cross Girls' School, SW6 6BP","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"e5573d32-1684-4472-9e2b-c6743eddce31","code":"2BV","name":"West London Teacher Training Alliance (Secondary)"},"accreditedBody":{"id":"7f11aaed-7c3e-42c5-af7a-023d33b45fa3","code":"U80","name":"UCL, University College London"},"profPost":"PG","english":"3","maths":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"financialSupport":"Full details of scholarships, DfE bursaries and Student Finance England loans as referred to above can be found on [Funding My Training - A page on the DfE's ‘Get into Teaching’ website](https://getintoteaching.education.gov.uk/funding-my-teacher-training)\r\n\r\nAs a guide:\r\n\r\n* Bursary eligibility simply depends on your residency status and whether you have a degree of at least a 2.2\r\n\r\n* Depending on your residency status, you can take out a student loan.  You can do this even if you already have an undergraduate loan. Loans for tuition fees are not means tested (whereas loans for maintenance are means tested) but you should confirm this using the link above. \r\n\r\nWhile not provided directly by WLTSA, please be aware that as a full time student you would be eligible for cheaper travel in London using a student oyster card and in many boroughs you can get a reduction on your council tax payments.","aboutCourse":"QUALIFICATION\r\n \r\nThis course NH05 leads to PGCE(M)QTS.  [The significance of different teacher training qualifications](http://www.wltsa.org.uk/initial-teacher-training/secondary-courses/different-qualification-outcomes/).\r\n\r\nSPECIAL FEATURES\r\n\r\nThis course is run by the West London Teaching School Alliance (WLTSA) in partnership with (and accredited by) the UCL (Institute of Education).  We make prompt shortlisting decisions and will liaise with you quickly if we need additional information.\r\n\r\nWLTSA enables you to choose your host school.  Later, if there is a vacancy and they want to retain you, you can be employed the following year without the post being advertised.  By becoming a WLTSA trainee, all our other secondary schools could also employ you this way and we operate a pool.\r\n\r\nOur aim is to produce exceptional teachers who can remain in alliance schools, continuing to further your career with the benefit of our on-going CPD.\r\n\r\nTHE TRAINING\r\n\r\nYou would enrol at the university and attend the [same university sessions](https://www.ucl.ac.uk/ioe/courses/teacher-training/physics-with-mathematics-pgce) with those who had applied directly through the university; have full access to university facilities and mentors; and the university still awards your PGCE.  WLTSA selects a second contrasting school for your ‘away’ placement. \r\n \r\nThe Physics with Mathematics PGCE helps students to develop the professional skills and knowledge they need to teach science and mathematics in the 11-16 age range. UCL are committed to creative and interactive approaches to teaching science to promote student engagement and learning. \r\n\r\nYou would attend a range of lectures and workshops with other secondary teacher trainees, including those relating to teaching and assessing, classroom management, child protection. \r\n\r\nAt school, through an initial programme of observations, you will become familiar with the workings of the school and department (pupil groups, pastoral systems, staffing, curriculum, resources, facilities, methods of teaching, lesson planning, and assessment).  \r\n\r\nYou will be treated like a member of staff.  With your school mentors, you will feel supported as you become ready to teach. Our mentors are excellent experienced teachers who undertake rigorous training to develop their mentoring skills.\r\n\r\nYour university tutor will visit you in school on a regular basis and liaise with your school mentor regarding your training and development. Your university tutor will carry out your final assessment in school against the national Teachers’ Standards.  \r\n\r\nYou will have the opportunity to teach both KS3 and KS4(GCSE) and to experience KS5 .","interviewProcess":"We consider each application as it comes in, individually and we try to ensure that you have at least a week’s notice of the interviews. \r\n\r\nCOVID CHANGES \r\n\r\nThe interview process for this course may change as the year progresses depending on the Covid situation.\r\nPrior to Covid, we had a two-stage process with two face to face interviews, one at the school and another at the university.\r\n\r\nThe school interview included an opportunity for you to join a class to assist or to teach something for a short time.  At the university you would take part in a combination of group and individual interviews with members of the programme team, and might also be asked to undertake written or presentation tasks, depending on your subject. You would have the opportunity to take a self-guided campus tour.\r\n\r\nWe have now moved to a new system where both these interviews are online. This new system will persist certainly throughout the autumn term, and possibly for the remainder of the year.\r\n\r\nONLINE INTERVIEWS\r\n\r\nIf your application is deemed to be sufficiently good we will let you know that you have been shortlisted and the school will contact you with technical arrangements for the first stage online interview. \r\n\r\nYou will need to email scans of your degree and Maths and English qualifications to WLTSA centrally (Alex Dijkhuis) adijkhuis@sacredh.lbhf.sch.uk\r\n\r\nIf successful we will refer you on for the second stage online interview with the university.  The university will contact you with technical arrangements for this.","howSchoolPlacementsWork":"With WLTSA you select the main host school at application and normally there are several to choose from but we are only running this particular course from Fulham Cross Girls’ School SW6.\r\nWe then later arrange your second placement at a contrasting (mainstream) WLTSA school to provide greater depth to your training experience. \r\n\r\nYou can read a description of this school in our overall [WLTSA Secondary School Summary Descriptions](http://www.wltsa.org.uk/initial-teacher-training/secondary-courses/wltsa-secondary-school-summary-descriptions/).    Our [Map of WLTSA Schools](http://www.wltsa.org.uk/map-of-all-wltsa-schools/) may also be helpful.\r\n\r\nPlease be aware that we have other [WLTSA secondary courses](http://www.wltsa.org.uk/initial-teacher-training/secondary-courses/) at other schools including many for both Physics and Mathematics.  You can make three choices overall when you apply.\r\n\r\n THE TECHNICAL BIT!\r\n\r\nYou don’t have to restrict yourself to one school within a course, but each school would count as one application and you get three choices overall in Round 1.  Please also be aware that we have so many partner schools that we have been forced to split artificially on UCAS into three provider names.  See [How to apply & how to choose more than one school on a course.](http://www.wltsa.org.uk/initial-teacher-training/secondary-courses/how-to-apply-how-to-choose-more-than-1-school-on-a-course/)\r\n\r\nIf you apply to more than one of our schools, it’s helpful if you email us confidentially to confirm which is your first choice so that we can try to ensure a sensible order for the interviews.  \r\n\r\nBE STRATEGIC WHEN YOU APPLY\r\n\r\nYou can always contact us to ask how many applications (if any) are being considered by different schools at the point that you are about to apply.  We also keep our website up to date so that you can see which schools have already shortlisted and are interviewing. \r\n\r\nWe commonly interview individually whenever a good application is received. ","personalQualities":"We want you to have passion and enthusiasm.  We need trainees who can engage and inspire students to a love of learning, who are:   \r\n*committed to championing their students;\r\n*open to learn about children’s physical/social/emotional/cognitive needs and how these can affect behaviour;\r\n*in good health with the ability to cope with stress.  Teaching is incredibly rewarding, but it also requires an element of resilience!\r\n*professional and committed to equal opportunities;\r\n*able to communicate well in written/spoken English, with at least basic computer skills and commitment to developing these.\r\n*have a sense of humour and an ability to laugh at yourself.     ","otherRequirements":"A realistic understanding of the role of a teacher and some current issues facing the profession is also important.  We recognise that it may not be possible to spend a couple of days observing relevant lessons in a state secondary school but this observation is not a ‘requirement’ and we recognise that it is unlikely to be possible for anyone while schools are maintaining discrete separation of their pupils in relation to Covid.  [Top tips for getting some observational experience](http://www.wltsa.org.uk/initial-teacher-training/secondary-courses/school-experience/).","status":2,"createdAt":"2021-07-06T10:53:48.552Z","canSponsorStudentVisa":"yes","cycle":"2024"}
