{"id":"bbf236a0-7e72-4778-98bc-6fcd7471a564","name":"English","code":"2XVJ","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3aed1aa8-ae46-4b68-92bb-a6cc20655c59","code":"Q3","name":"English"}],"locations":[{"id":"a0ccc5ab-47c6-4896-b32b-ede98ba622af","name":"Fulham Cross Academy SW6 6SN","isPublished":"Y","status":"R","vacancies":"F"},{"id":"cc53a845-54a9-4577-b33d-dae32bca713c","name":"The Fulham Boys' School, W14 9LY","isPublished":"Y","status":"R","vacancies":"F"},{"id":"6614ae9e-4b0d-4b60-a5d1-f01716091031","name":"Sacred Heart High School, W6 7DG","isPublished":"Y","status":"R"},{"id":"e9842247-066b-4988-9b57-66df7cebcd6a","name":"West London Free School, W6 9LP","isPublished":"Y","status":"R","vacancies":"F"},{"id":"8bb6711c-fe01-48d4-9824-d325dc573f1b","name":"Queens Park Community School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"bb91f869-de71-40a2-a36b-79fe69f6d660","name":"Gumley House Convent School, TW7 6XF","isPublished":"Y","status":"R","vacancies":"F"},{"id":"ac2d0c05-3916-4881-891d-0807f992efcf","name":"Hammersmith Academy W12 9JD","isPublished":"Y","status":"R","vacancies":"F"},{"id":"fc6e5129-4e20-450c-9ac9-9eee8df8bb96","name":"St Richard Reynolds Catholic College, TW1","isPublished":"Y","status":"R","vacancies":"F"},{"id":"4a436c1f-ada9-4322-bb43-241104d351db","name":"St Mark's Roman Catholic School, TW3 3EJ","isPublished":"Y","status":"R","vacancies":"F"},{"id":"5c94d64d-b3ac-4b15-a567-214d92bc50b9","name":"St Benedict's School, W5 2ES","isPublished":"Y","status":"R","vacancies":"F"},{"id":"55e013cb-905b-44a0-83c6-e9014ce03cb5","name":"Chelsea Academy SW10 0AB","isPublished":"Y","status":"R","vacancies":"F"},{"id":"31f79b39-65b2-4fe1-96ad-6259fe671a33","name":"Drayton Manor High School, W7 1EU","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"e5573d32-1684-4472-9e2b-c6743eddce31","code":"2BV","name":"West London Teacher Training Alliance (Secondary)"},"accreditedBody":{"id":"ef172d85-20e4-4aa2-96d0-9e3ae81f526d","code":"S64","name":"St Mary’s University, Twickenham"},"profPost":"BO","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"We would normally require the degree to be 'English' but St Mary’s subject tutors will apply their discretion in terms of assessing your subject knowledge. Where the degree is not purely English, a B at A-Level English is required.","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Where appropriate, see our important guidance on:\n\n[Overseas Qualifications](https://www.wltta.org.uk/initial-teacher-training/secondary-courses-for-sept-2022/overseas-qualifications/); and see which equivalency test providers we can accept tests from [GCSE Equivalency tests](https://www.wltta.org.uk/initial-teacher-training/secondary-courses-for-sept-2022/gcse-equivalency-tests/).\n\nWe would normally only accept a candidate with one of the two required GCSEs outstanding (not both).","courseLength":"OneYear","feesUK":9250,"financialSupport":"As a guide (but you must check this yourself using the links above):\r\n\r\n* Bursary eligibility simply depends on your residency status and whether you have a degree of at least a 2.2.  It is important to read the eligibility carefully. Even if you are a UK citizen, it may be affected if you have lived overseas in the past 3 years.  Those on visas need to see if it says that you can access public funds.  If you have an overseas degree, our university partner would need to see a transcript/score to be satisfied that you meet the 2.2 level.\r\n\r\n* Depending on your residency status, you can take out a student loan.  You can do this even if you already have an undergraduate loan. Loans for tuition fees are not normally means tested and we assume this will continue.  Loans for maintenance are means tested, but you should confirm this all using the link above. \r\n\r\nWhile not provided directly by WLTTA, please be aware that as a full time student you would be eligible for cheaper travel in London using a student oyster card and in many boroughs, you can get a reduction on your council tax payments.","aboutCourse":"QUALIFICATION \r\n \r\nThis course 2XVJ leads to PGCE (M)QTS.  The significance of the qualifications can be found [here.](https://wltta.msoclientsites.co.uk/initial-teacher-training/secondary-courses-for-sept-2022/different-qualification-outcomes/)\r\n\r\nSPECIAL FEATURES\r\n\r\nThis course is run by the West London Teacher Training Alliance (WLTTA) in partnership with St Mary’s University, Twickenham.  We make prompt shortlisting decisions and will liaise with you quickly if we need additional information.\r\n\r\nWLTTA enables you to choose your host school.  Later, if there is a teaching vacancy and they want to retain you, you can be employed for the following year without the post being advertised.  By becoming a WLTTA trainee, all our schools could employ you this way and we operate a pool.\r\n\r\nOur aim is to produce exceptional teachers who could remain in alliance schools to continue their careers, taking advantage of further professional development, including the accredited Early Career induction programme.\r\n\r\nTHE TRAINING\r\n\r\nYou would enrol at the university and:\r\n\r\n* attend all the same university sessions with those who had applied through the university; \r\n\r\n* have full access to university facilities and mentors.\r\n\r\nThe university still awards your PGCE.  WLTTA selects a second contrasting school for your ‘away’ placement.  \r\n\r\nAs a guide: [Typical timetable](https://wltta.msoclientsites.co.uk/initial-teacher-training/st-m-unsal-sec-pgce-typical-timetable/) \r\n\r\nLectures would include teaching, assessing, classroom management and child protection.  Subject seminars are led by your university tutor. \r\n\r\nAt school, through an initial programme of observations, you will become familiar with the workings of the school and department (pupil groups, pastoral systems, staffing, curriculum, resources, facilities, methods of teaching, lesson planning, and assessment).  \r\n\r\nYou will be treated like a member of teaching staff and with your school mentors, you will feel supported as you become ready to teach. Our mentors are excellent experienced teachers who undertake rigorous training to develop their mentoring skills.  \r\n\r\nThroughout your time in both schools, your university tutor visits you to monitor your progress and discuss your development with you and your school mentors.\r\n\r\nKS3 is focused on developing reading/writing/speaking/listening skills. Students read and respond to a range of literature. They are taught to write for a variety of purposes and to develop their skills in effective communication and analysis. Speaking/listening tasks may include a range of drama activities, group debates and speeches. \r\n\r\nAt KS4 you will plan and deliver tasks which enable students to prepare effectively for their GCSE exams in English Language and English Literature. This will include teaching the core texts, developing their interpretative and analytical skills and helping to improve their writing.","interviewProcess":"Our schools seek trainees that aspire to work for them. We enable you to select your preferred host school(s) at application and later through a referral process.  We provide information about the schools to help you choose.  \r\n\r\nSTAGE 1: UNIVERSITY INTERVIEW\r\n\r\nOnce shortlisted, we arrange for you to be invited to an online university interview. You will be asked to upload ID documents and relevant certificates/transcripts if available.  We can still make an offer subject to later verification of qualifications.\r\n\r\nThe university may ask you to prepare a brief presentation on a particular topic and a subject audit questionnaire.  This will help them to establish the breadth of your subject knowledge, which they will discuss with you.  ‘Subject Knowledge Enhancement’ courses are sometimes included as an offer condition.\r\n\r\nSTAGE 2: SCHOOL INTERVIEW \r\n\r\nThe school interview follows 3-4 days later and could lead to an offer.\r\n\r\nINTERNAL REFERRALS\r\nIf you do not get an offer from Stage 2 but have demonstrated potential, you can then choose another school and we would recommend your shortlisting.  The university interview would not be repeated.\r\n\r\nWe hope to fit good candidates with schools that they are happy with and where they can secure an offer.\r\n\r\nThere remains an advantage in applying to the course at more than one school, because such applications would be considered in parallel rather than sequentially. \r\n\r\nAPPLICATIONS\r\n\r\nThe new application process (button at end) is intuitive, but we have made a short guide to how it works: [How application system works](https://wltta.msoclientsites.co.uk/initial-teacher-training/secondary-courses-for-sept-2022/how-application-system-works/). ","howSchoolPlacementsWork":"CHOOSING YOUR SCHOOL\r\n\r\nWith WLTTA, you select the main host school at application.  We then later arrange your second placement at another contrasting WLTTA school to provide greater depth to your training experience. \r\n\r\nIf you want to see when you would be at the university; when at your main host school; and when the contrasting school - see our typical timetable linked above.\r\n\r\nThe schools seeking trainees on this particular course are listed below. \r\n\r\n* Chelsea Academy, SW10\r\n* Drayton Manor High School, W7\r\n* Fulham Cross Academy, SW6\r\n* Gumley House School TW7\r\n* Hammersmith Academy W6\r\n* Queens Park Community School, NW6\r\n* Sacred Heart High School, W6\r\n* St Benedict’s School, W5\r\n* St Marks Catholic School, TW3\r\n* St Richard Reynolds TW1\r\nWest London Free School, W6\r\n\r\nThe characters and location of our schools are varied. To help you decide, please refer to our overall [WLTTA Secondary School Summary Descriptions](https://wltta.msoclientsites.co.uk/initial-teacher-training/secondary-courses-for-sept-2022/wltta-secondary-school-summary-descriptions/) and our and our [Map of WLTTA Schools](https://wltta.msoclientsites.co.uk/schools-location-map-with-magnifier/)\r\n\r\nYou can always contact us to ask how many applications (if any) are being considered by different schools at the point that you are about to apply.\r\n\r\nOUR DETAILED WEBSITE, LIVE ONLINE PRESENTATION AND Q&A\r\n\r\nWe recommend that you visit our website [www.wltta.org.uk](www.wltta.org.uk) to properly see all our vacancies, for example we have a separate English unsalaried course at a SEN school.  You can download the course document for any of our courses and see a video about us, with previous trainees being interviewed.  \r\n\r\nIf you want to, you can also sign up there to join our fortnightly 'live' Zoom presentation about getting into teaching and it includes an opportunity for Q&A . The presentation explains all about the different routes into teaching and their separate benefits; how the money works; tips about using the 'Find Postgraduate Teacher Training' portal; applications; offers; etc.  No pressure, you don't have to attend this at all.  It's just there for anyone who is trying to understand it all better.  We get excellent feedback on this year after year.","personalQualities":"We seek trainees with a passion to engage and inspire students to a love of learning, who are:   \r\n\r\n* committed to championing their students;\r\n* open to learning about children’s physical/social/emotional/cognitive needs and how these can affect behaviour;\r\n* in good health with the ability to cope with stress.  Teaching is incredibly rewarding, but it also requires an element of resilience!\r\n* professional/committed to equal opportunities;\r\n* able to communicate well in written/spoken English, with at least basic computer skills and commitment to developing these; and with\r\n\r\nIt helps to have a sense of humour/ability to laugh at yourself!","otherRequirements":"A realistic understanding of the role of a teacher and an awareness of some current issues facing the profession is also important.  We have some advice relating to school experience on our website: [WLTTA School Experience tab](https://wltta.msoclientsites.co.uk/initial-teacher-training/secondary-courses-for-sept-2022/school-experience/)\r\n\r\nOffers are conditional on satisfactory outcome of a DBS check (approx. £60) and an occupational health check (approx. £20) both administered through the university after an offer is accepted. ","status":1,"createdAt":"2021-07-06T10:53:47.096Z","updatedAt":"2021-07-28T10:35:51.791Z","canSponsorStudentVisa":"yes","cycle":"2024"}
