{"id":"075de3d9-64b1-45b7-af94-795616212ce7","name":"Biology","code":"33FJ","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"322cfc19-d51d-45db-91e3-bd7b4738470f","code":"C1","name":"Biology"}],"locations":[{"id":"ae476200-57cc-48d2-be2d-c053c42b89d3","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"4cc0d82a-c0fc-4661-b1e0-4080bc75b27b","code":"2EV","name":"Yorkshire Wolds Teacher Training"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Get the best start you can to your teaching career with Yorkshire Wolds Teacher Training based at South Hunsley. Our outstanding (Ofsted 2019) programme gives trainees an immersive experience throughout the course. After a week of orientation and specialist training delivered by our Specialist Leaders in Education and external experts, trainees spend four days per week observing, supporting and teaching classes in their host school while being supported and challenged by the best mentors and host teachers available. Our professional studies sessions each Friday are designed to give trainees a deep understanding of the essential elements of classroom practice which underpins their development. \r\nYWTT offers a bespoke training package. Each trainee has a subject mentor who supports them as they grow in the classroom, holding weekly mentor meetings to discuss progress, challenges and further development needs. Mentors support their trainees to set specific enquiry questions based on the feedback on their teaching, focussing reading specifically on their development needs. \r\nEach subject area has a Subject Leader who works with their trainees and mentors to support subject knowledge development. Trainees complete a subject knowledge audit at the course start and then update it throughout the course. The trainees meet for days when the subject leaders deliver tailored sessions specifically aimed at developing individual trainee’s subject knowledge. These may be delivered by external experts (e.g. National STEM Centre) or specialist teachers from within the YWTT Partnership.\r\nEach week our trainees forward a learning journal to their YWTT tutor. Tutorials are held frequently. These celebrate progress and support trainees with the challenges they may face. There are review points during the training year with the final assessment taking place in the summer term. Review points can include a lesson observation by the Subject Leader and presentation of an Evidence Portfolio. Evidence Portfolios consist of a short presentation where the trainee considers the educational theory and research and how it has been used to maximise the progress of the learners in their focus group.\r\nOur trainees have opportunities to work with partner schools to deliver science days, volunteer as trip leaders, and undertake a wide range of other activities to support them in being more than just a teacher of biology.\r\n100% of headteachers who employed YWTT trainees said that they had made an excellent start in their new schools, with Ofsted stating that “NQTs have the knowledge and skills to become exceptional teachers.\r\n\r\n","interviewProcess":"The Director of Yorkshire Wolds Teacher Training and the appropriate Yorkshire Wolds Subject Lead conduct interviews often with a subject mentor from one of our partnership schools. The process will be approximately half a day, giving you the opportunity to meet some students and members of the YWTT team who will answer any questions you might have.","howSchoolPlacementsWork":"Yorkshire Wolds Teacher Training works in partnership with a range of schools across the East Riding of Yorkshire and Hull. Trainees are given the opportunity to place possible placement schools in order of preference, with all of the 2018-19 cohort of trainees being given their first preference school for one of their placements. Trainees have ten secondary and ten primary schools from which to make their preferences. The programme is designed to help trainees develop a deep understanding of the similarities and differences between schools having placements in three different schools; the initial orientation placement which occurs in the second week of the course, followed by a diversity and main placement which are longer in length. The course also includes diversity days at other educational institutions, allowing trainees to broaden their knowledge of the whole education system.  All secondary trainees on programme have the opportunity to experience the 16-18 phase on one of their placements.","personalQualities":"In your application and throughout the selection process, we are looking for people with a genuine passion and enthusiasm for teaching and their subject.  Individuals who wish to inspire the next generation, engender a love for learning and support the children in their care to make excellent progress academically and in other areas. ","otherRequirements":"If your degree is not directly related to the subject you wish to teach, SKE courses are an excellent way to develop your subject knowledge prior to the start of the initial teacher training course.\r\nWe actively encourage career changers to consider a career in teaching, so any other experience especially related to your subject or through working with young people is beneficial. \r\nAdmission is dependent upon satisfactory medical assessment, assessing your capacity to train to teach. \r\nCandidates will be subject to appropriate pre-selection checks, which will include full Disclosure and Barring Service (DBS) checks\r\n","status":1,"createdAt":"2021-07-06T10:47:35.255Z","updatedAt":"2021-07-21T12:05:08.430Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
