{"id":"11d9236e-3a7d-4519-8b66-20b6b06ea9d6","name":"Primary (5-11)","code":"33FS","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"ae476200-57cc-48d2-be2d-c053c42b89d3","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"4cc0d82a-c0fc-4661-b1e0-4080bc75b27b","code":"2EV","name":"Yorkshire Wolds Teacher Training"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Yorkshire Wolds Teacher Training gives you an outstanding start to your teaching career, giving you the opportunity to train in some of the best classrooms in Hull and the East Riding of Yorkshire and gain a PGCE awarded by Sheffield Hallam University. Our innovative programme blends evidence based research and educational theory with immersive practice in the classroom. \r\nThe course starts with a week of specialist training delivered by Specialist Leaders in Education, external experts and excellent teachers, in our bespoke training facilities. From the second week to the end of the course, our trainees spend four days per week in school being supported and challenged by highly trained mentors and host teachers. \r\n‘Mentors across the whole of the partnership are highly skilled and dedicated to the role.’ Ofsted, 2019.\r\nEach Friday, the Professional Studies sessions are designed to give trainees a deep understanding of the essential elements of classroom practice to underpin their development. The programme is designed to respond to the needs of each trainee with bespoke subject sessions led by excellent classroom teachers. The programme also involves a number of Subject Immersion days to support the development of subject specific pedagogy, with these including the opportunity to see the techniques discussed in practice, with expert teachers demonstrating these aspects within their lessons.\r\nPlacements are allocated within our partnership schools who work closely with the Yorkshire Wolds team. On the Primary (5-11) programme, the placements will take place in a Key Stage One and Key Stage Two setting. Our course is designed to be bespoke to each trainee’s need in every aspect of the course.\r\n‘The highly bespoke nature of the course means that each trainee’s needs are fully met.’ Ofsted, 2019\r\nYorkshire Wolds Subject Leads support trainees with the development of subject knowledge throughout the programme. A subject knowledge audit underpins this, delivering bespoke sessions and reviewing progress at regular intervals. All trainees are also assigned a Yorkshire Wolds Tutor who will undertake small group tutorial sessions. These sessions celebrate progress and support trainees with their well-being to support them through any challenges they may face. \r\n100% of headteachers who employed YWTT trainees said that they had made an excellent start in their new schools, with Ofsted stating that “NQTs have the knowledge and skills to become exceptional teachers.\"\r\n","interviewProcess":"The Director of Yorkshire Wolds Teacher Training and the appropriate Yorkshire Wolds Subject Lead conduct interviews often with a subject mentor from one of our partnership schools. The process will be approximately half a day, giving you the opportunity to meet some students and members of the YWTT team who will answer any questions you might have.","howSchoolPlacementsWork":"Yorkshire Wolds Teacher Training works in partnership with a range of schools across the East Riding of Yorkshire and Hull. Trainees are given the opportunity to place possible placement schools in order of preference, with all of the 2018-19 cohort of trainees being given their first preference school for one of their placements. Trainees have ten secondary and ten primary schools from which to make their preferences. The programme is designed to help trainees develop a deep understanding of the similarities and differences between schools having placements in three different schools; the initial orientation placement which occurs in the second week of the course, followed by a diversity and main placement which are longer in length. The course also includes diversity days at other educational institutions, allowing trainees to broaden their knowledge of the whole education system.  All secondary trainees on the  programme have the opportunity to experience the 16-18 phase on one of their placements.","personalQualities":"In your application and throughout the selection process, we are looking for people with a genuine passion and enthusiasm for teaching and their subject.  Individuals who wish to inspire the next generation, engender a love for learning and support the children in their care to make excellent progress academically and in other areas.","otherRequirements":"If your degree is not directly related to the subject you wish to teach, SKE courses are an excellent way to develop your subject knowledge prior to the start of the initial teacher training course.\r\nWe actively encourage career changers to consider a career in teaching, so any other experience especially related to your subject or through working with young people is beneficial. \r\nAdmission is dependent upon satisfactory medical assessment, assessing your capacity to train to teach. \r\nCandidates will be subject to appropriate pre-selection checks, which will include full Disclosure and Barring Service (DBS) checks\r\n","status":1,"createdAt":"2021-07-06T10:47:35.496Z","updatedAt":"2021-07-21T12:38:26.045Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
