{"id":"20392a56-175a-40c2-bd75-f2ed92be3723","name":"English","code":"33FN","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3aed1aa8-ae46-4b68-92bb-a6cc20655c59","code":"Q3","name":"English"}],"locations":[{"id":"ae476200-57cc-48d2-be2d-c053c42b89d3","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"4cc0d82a-c0fc-4661-b1e0-4080bc75b27b","code":"2EV","name":"Yorkshire Wolds Teacher Training"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"If you are passionate about English. If your dream is to become an inspirational secondary school English teacher, then our outstanding Yorkshire Wolds Teacher Training programme is the course for you. Studying English at YWTT gives you a fantastic start to your teaching career, offering you the opportunity to train in some of the best classrooms in Hull and the East Yorkshire and gain a PGCE awarded by Sheffield Hallam University. Our innovative programme blends evidence based research and educational theory with immersive practice in the classroom.\r\nEnglish is a cornerstone of learning and has a unique place in the curriculum as a key subject and a means of acquiring a wealth of essential life skills. English enables pupils to develop key skills, specialist knowledge and concepts in areas relevant to their daily lives. As an English teacher, you will be instrumental in opening up the timeless power of language to your pupils, encouraging them to be analytical, creative and imaginative.\r\nHere at YWTT, we provide a stimulating and supportive environment in which to study all aspects of this core and life changing subject. Our English Subject Lead, delivers effective, bespoke subject sessions throughout your training year. This training and development is rooted in effective class room practice and the latest robust educational research; it is a superb opportunity to explore effective pedagogical approaches and methodologies in English teaching, with a leading subject expert. Furthermore, you will be personally supported by an experienced and specially trained school based English mentor who will help you design and deliver effective, creative and challenging lessons based on substantive subject knowledge. \r\n\r\nOur English course is innovative and intellectually demanding; sessions cover: \r\n\r\nCurrent developments in the teaching of English and its place as a core subject in the National Curriculum\r\n\r\nHow to design and deliver a sequence of well-structured and engaging English lessons underpinned by robust evidence based research.\r\n\r\nHow to teach all aspects of English Language and Literature.\r\n\r\nThe consolidation and extension of your subject knowledge.\r\n\r\nHow to hone and develop your own teaching style through first-hand classroom experience, teaching all different types of learners English across the Key Stages.\r\n\r\nThe development of literacy and oracy within the English Curriculum.\r\n\r\n100% of headteachers who employed YWTT trainees said that they had made an excellent start in their new schools, with Ofsted stating that “NQTs have the knowledge and skills to become exceptional teachers.”\r\n\r\n\r\n\r\n","interviewProcess":"The Director of Yorkshire Wolds Teacher Training and the appropriate Yorkshire Wolds Subject Lead conduct interviews often with a subject mentor from one of our partnership schools. The process will be approximately half a day, giving you the opportunity to meet some students and members of the YWTT team who will answer any questions you might have.","howSchoolPlacementsWork":"Yorkshire Wolds Teacher Training works in partnership with a range of schools across the East Riding of Yorkshire and Hull. Trainees are given the opportunity to place possible placement schools in order of preference, with all of the 2018-19 cohort of trainees being given their first preference school for one of their placements. Trainees have ten secondary and ten primary schools from which to make their preferences. The programme is designed to help trainees develop a deep understanding of the similarities and differences between schools having placements in three different schools; the initial orientation placement which occurs in the second week of the course, followed by a diversity and main placement which are longer in length. The course also includes diversity days at other educational institutions, allowing trainees to broaden their knowledge of the whole education system.  All secondary trainees on the programme have the opportunity to experience the 16-18 phase on one of their placements.","personalQualities":"In your application and throughout the selection process, we are looking for people with a genuine passion and enthusiasm for teaching and their subject.  Individuals who wish to inspire the next generation, engender a love for learning and support the children in their care to make excellent progress academically and in other areas.","otherRequirements":"If your degree is not directly related to the subject you wish to teach, SKE courses are an excellent way to develop your subject knowledge prior to the start of the initial teacher training course.\r\nWe actively encourage career changers to consider a career in teaching, so any other experience especially related to your subject or through working with young people is beneficial. \r\nAdmission is dependent upon satisfactory medical assessment, assessing your capacity to train to teach. \r\nCandidates will be subject to appropriate pre-selection checks, which will include full Disclosure and Barring Service (DBS) checks\r\n","status":1,"createdAt":"2021-07-06T10:47:35.393Z","updatedAt":"2021-07-21T12:23:42.295Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
