{"id":"7c8a8f1d-0652-4c1b-a3ee-43671c946f30","name":"Modern Languages (Spanish)","code":"37GW","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"ce8523ef-9236-4cd9-b260-d826c7a521b3","code":"ML","name":"Modern Languages"},{"id":"e34fd2a3-a32e-44e9-aea1-666badf3ac03","code":"22","name":"Spanish"}],"locations":[{"id":"ae476200-57cc-48d2-be2d-c053c42b89d3","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"4cc0d82a-c0fc-4661-b1e0-4080bc75b27b","code":"2EV","name":"Yorkshire Wolds Teacher Training"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Yorkshire Wolds Teacher Training gives you a fantastic start to your teaching career, providing you with the opportunity to train in some of the best classrooms in Hull and the East Riding and gain a PGCE awarded by Sheffield Hallam University. \r\nOur innovative programme blends evidence based research and educational theory with immersive practice in the classroom from the start of the course. Following an intensive Orientation week at the start of the course, trainees spend four days per week in school, supported and challenged by the best mentors and host teachers in their chosen subject area. Trainees undertake two diverse placements throughout their training to ensure that they maximise their experiences within two complementary school contexts.\r\nProfessional studies sessions are designed to give trainees a deep understanding of the essential elements of classroom practice which will underpin their development. Weekly enquiry planning sessions give trainees time to work on their enquiry questions, utilising the resources and staff expertise available at the training base. The programme is designed to respond to the needs of each individual trainee with bespoke subject sessions led by a range of excellent classroom teachers.\r\nSubject immersion days ensure that trainees are fully supported to develop their subject specific pedagogy, with taught sessions planned and delivered by a subject lead focusing on specific aspects of teaching. A subject knowledge audit underpins this, with trainees regularly updating it based on their experiences and guided by their mentor and subject lead. This allows us to be able to devise a bespoke course based on your individual needs, which evolves as you develop. \r\nIn MFL, the course focuses on pedagogy relating to development of our four skills (listening, speaking, reading and writing) and gaining an excellent understanding of the curriculum content at KS3 and KS4 and how this links back to any work done in KS2 and links forward to KS5 courses. It also focuses on the balance between using languages for communication and the role grammar plays in ensuring that our pupils can develop into future linguists, with an excellent grasp of how the language actually works. All of our MFL trainees to date have been graded as outstanding at the end of their course.\r\n100% of headteachers who employed YWTT trainees said that they had made an excellent start in their new schools, with Ofsted stating that “NQTs have the knowledge and skills to become exceptional teachers.\"","interviewProcess":"The Director of Yorkshire Wolds Teacher Training and the appropriate Yorkshire Wolds Subject Lead conduct interviews often with a subject mentor from one of our partnership schools. The process will be approximately half a day, giving you the opportunity to meet some students and members of the YWTT team who will answer any questions you might have.","howSchoolPlacementsWork":"Yorkshire Wolds Teacher Training works in partnership with a range of schools across the East Riding of Yorkshire and Hull. Trainees are given the opportunity to place possible placement schools in order of preference, with all of the 2018-19 cohort of trainees being given their first preference school for one of their placements. Trainees have ten secondary and ten primary schools from which to make their preferences. The programme is designed to help trainees develop a deep understanding of the similarities and differences between schools having placements in three different schools; the initial orientation placement which occurs in the second week of the course, followed by a diversity and main placement which are longer in length. The course also includes diversity days at other educational institutions, allowing trainees to broaden their knowledge of the whole education system.  All secondary trainees on programme have the opportunity to experience the 16-18 phase on one of their placements.","personalQualities":"In your application and throughout the selection process, we are looking for people with a genuine passion and enthusiasm for teaching and their subject.  Individuals who wish to inspire the next generation, engender a love for learning and support the children in their care to make excellent progress academically and in other areas.","otherRequirements":"If your degree is not directly related to the subject you wish to teach, SKE courses are an excellent way to develop your subject knowledge prior to the start of the initial teacher training course.\r\nWe actively encourage career changers to consider a career in teaching, so any other experience especially related to your subject or through working with young people is beneficial. \r\nAdmission is dependent upon satisfactory medical assessment, assessing your capacity to train to teach. \r\nCandidates will be subject to appropriate pre-selection checks, which will include full Disclosure and Barring Service (DBS) checks\r\n","status":1,"createdAt":"2021-07-06T10:47:35.630Z","updatedAt":"2021-07-21T12:34:10.316Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
