{"id":"957b4357-4fbf-4cc4-97f2-a1bd0d0f2c88","name":"Computing","code":"33FL","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"e6be6a9c-8696-4b88-8fbd-1ba1bef1b6fc","code":"11","name":"Computing"}],"locations":[{"id":"ae476200-57cc-48d2-be2d-c053c42b89d3","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"4cc0d82a-c0fc-4661-b1e0-4080bc75b27b","code":"2EV","name":"Yorkshire Wolds Teacher Training"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Yorkshire Wolds Teacher Training provides a fantastic start to your career, giving you the opportunity to train in some of the best classrooms in Hull and the East Yorkshire and gain a PGCE awarded by the Sheffield Hallam. Our innovative programme blends evidence-based research and educational theory with immersive practice in the classroom, starting with a week of specialist training delivered by Specialist Leaders in Education, external experts and excellent teachers, in our bespoke base at South Hunsley School, an outstanding school in the East Riding of Yorkshire. From week two onwards, our trainees spend four days per week in school being supported and challenged by the best mentors and host teachers, and are involved in teaching a wide range of computing topics, including visual and text programming, web design and algorithms, as well as vocational IT qualifications and GCSE Computer Science. There is potential for some exposure to A Level and more advanced vocational courses. Professional studies sessions are designed to give trainees a deep understanding of the essential elements of classroom practice which underpin development, and Mentors and host teachers support trainees as they develop these skills in the classroom. Weekly mentor meetings guide trainees in setting their own enquiry questions, which will be addressed during weekly enquiry planning sessions, utilising the resources and staff expertise available at the training base. The programme is designed to respond to the needs of each trainee with bespoke subject sessions focussing on specific aspects of the Computing curriculum, and Subject Immersion Days supporting the development of Computing pedagogy and examining aspects of teaching with reference to the skills needed to support students through Key Stage 4 qualifications. Trainees have the opportunity to see the techniques discussed in practice, with expert teachers demonstrating these within their lessons. Subject leads support trainees in developing their subject knowledge, underpinned by regular audits, and advise on the next steps, delivering bespoke sessions and reviewing progress. All trainees are assigned a tutor who undertakes small group sessions and one to one interviews throughout the programme. These sessions celebrate progress and support trainees overcome the challenges they may face. There are six review points during the year with final assessment in the summer term. 100% of headteachers who employed YWTT trainees said that they had made an excellent start in their new schools, with Ofsted stating that “NQTs have the knowledge and skills to become exceptional teachers.","interviewProcess":"The Director of Yorkshire Wolds Teacher Training and the appropriate Yorkshire Wolds Subject Lead conduct interviews often with a subject mentor from one of our partnership schools. The process will be approximately half a day, giving you the opportunity to meet some students and members of the YWTT team who will answer any questions you might have.","howSchoolPlacementsWork":"Yorkshire Wolds Teacher Training works in partnership with a range of schools across the East Riding of Yorkshire and Hull. Trainees are given the opportunity to place possible placement schools in order of preference, with all of the 2018-19 cohort of trainees being given their first preference school for one of their placements. Trainees have ten secondary and ten primary schools from which to make their preferences. The programme is designed to help trainees develop a deep understanding of the similarities and differences between schools having placements in three different schools; the initial orientation placement which occurs in the second week of the course, followed by a diversity and main placement which are longer in length. The course also includes diversity days at other educational institutions, allowing trainees to broaden their knowledge of the whole education system.  All secondary trainees on programme have the opportunity to experience the 16-18 phase on one of their placements.","personalQualities":"In your application and throughout the selection process, we are looking for people with a genuine passion and enthusiasm for teaching and their subject.  Individuals who wish to inspire the next generation, engender a love for learning and support the children in their care to make excellent progress academically and in other areas. ","otherRequirements":"If your degree is not directly related to the subject you wish to teach, SKE courses are an excellent way to develop your subject knowledge prior to the start of the initial teacher training course. We actively encourage career changers to consider a career in teaching, so any other experience especially related to your subject or through working with young people is beneficial. \r\nAdmission is dependent upon satisfactory medical assessment, assessing your capacity to train to teach. \r\nCandidates will be subject to appropriate pre-selection checks, which will include full Disclosure and Barring Service (DBS) checks\r\n","status":1,"createdAt":"2021-07-06T10:47:35.322Z","updatedAt":"2021-07-21T12:07:23.781Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
