{"id":"b9dd9966-e40a-4dc9-b10a-bd61e1135abc","name":"Design and Technology (Food)","code":"37GY","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"118fabd7-86d0-4a40-9e9a-e5c302abe59b","code":"DT","name":"Design and technology"}],"locations":[{"id":"ae476200-57cc-48d2-be2d-c053c42b89d3","name":"Main Site","isPublished":"Y","status":"S"}],"trainingProvider":{"id":"4cc0d82a-c0fc-4661-b1e0-4080bc75b27b","code":"2EV","name":"Yorkshire Wolds Teacher Training"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Yorkshire Wolds Teacher Training gives you a fantastic start to your Food Preparation and Nutrition teaching career, giving you the opportunity to train in some of the best classrooms in Hull and the East Riding of Yorkshire and gain a PGCE. \r\nOur innovative programme blends evidence based research and educational theory with immersive practice in the classroom. The course starts with a week of specialist training delivered by Specialist Leaders in Education, external experts and excellent teachers, in our bespoke training base on the campus at South Hunsley School, an outstanding school in the East Riding of Yorkshire. From the second week, you will spend four days per week in school being supported and challenged in the classroom by the best mentors and Food teachers. \r\nProfessional studies sessions are designed to give you a deep understanding of the essential elements of classroom practice which will underpin your development. Mentors and Food teachers support you as you develop these skills, conducting weekly mentor meetings where you are guided to set your own enquiry questions. Weekly enquiry planning sessions give you time to work on your enquiry questions, utilising the resources and staff expertise available at the host school. The programme is designed to respond to the needs of each individual trainee with bespoke Food teaching sessions led by excellent classroom teachers who are also accredited Specialist Leaders in Education. \r\nSubject immersion days support the development of Food and Nutrition pedagogy, with taught sessions focusing on specific aspects of planning and teaching both Food theory and practical lessons. Trainees then have the opportunity to see expert Food teachers demonstrating these aspects within their lessons. Yorkshire Wolds subject leads support trainees with the development of Food and Nutrition knowledge, a subject knowledge audit underpins this, with subject leads advising on the next steps in subject knowledge enhancement, delivering bespoke sessions and reviewing progress at regular intervals. \r\nAll trainees are assigned a Yorkshire Wolds tutor who will undertake small group and one to one sessions throughout the training programme. These sessions celebrate progress and support you in overcoming challenges you may face. There are six review points during the training year with the final assessment taking place in the summer term. 100% of headteachers who employed YWTT trainees said that they had made an excellent start in their new schools, with Ofsted stating that “NQTs have the knowledge and skills to become exceptional teachers.\r\n","interviewProcess":"The Director of Yorkshire Wolds Teacher Training and the appropriate Yorkshire Wolds Subject Lead conduct interviews often with a subject mentor from one of our partnership schools. The process will be approximately half a day, giving you the opportunity to meet some students and members of the YWTT team who will answer any questions you might have.","howSchoolPlacementsWork":"Yorkshire Wolds Teacher Training works in partnership with a range of schools across the East Riding of Yorkshire and Hull. Trainees are given the opportunity to place possible placement schools in order of preference, with all of the 2018-19 cohort of trainees being given their first preference school for one of their placements. Trainees have ten secondary and ten primary schools from which to make their preferences. The programme is designed to help trainees develop a deep understanding of the similarities and differences between schools having placements in three different schools; the initial orientation placement which occurs in the second week of the course, followed by a diversity and main placement which are longer in length. The course also includes diversity days at other educational institutions, allowing trainees to broaden their knowledge of the whole education system.  All secondary trainees on the programme have the opportunity to experience the 16-18 phase on one of their placements.","personalQualities":"In your application and throughout the selection process, we are looking for people with a genuine passion and enthusiasm for teaching and their subject.  Individuals who wish to inspire the next generation, engender a love for learning and support the children in their care to make excellent progress academically and in other areas. ","otherRequirements":"If your degree is not directly related to the subject you wish to teach, SKE courses are an excellent way to develop your subject knowledge prior to the start of the initial teacher training course. We actively encourage career changers to consider a career in teaching, so any other experience especially related to your subject or through working with young people is beneficial. \r\nAdmission is dependent upon satisfactory medical assessment, assessing your capacity to train to teach. \r\nCandidates will be subject to appropriate pre-selection checks, which will include full Disclosure and Barring Service (DBS) checks\r\n","status":3,"createdAt":"2021-07-06T10:47:35.705Z","updatedAt":"2021-07-21T12:22:36.461Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
