{"id":"e8a491f0-bf6f-434f-9945-70723ae943e7","name":"Design and Technology (Textiles)","code":"37GZ","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"118fabd7-86d0-4a40-9e9a-e5c302abe59b","code":"DT","name":"Design and technology"}],"locations":[{"id":"ae476200-57cc-48d2-be2d-c053c42b89d3","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"4cc0d82a-c0fc-4661-b1e0-4080bc75b27b","code":"2EV","name":"Yorkshire Wolds Teacher Training"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Our innovative programme covers all areas of Design & Technology, from resistant materials to electronics, graphics and textiles. The course may start with a week of specialist subject training before the main course commences, if we feel it may be beneficial for your subject knowledge enhancement. There are ten subject immersion days during the year, delivered by Specialist Leaders in Education, external experts and excellent teachers. Subject immersion days support the development of subject specific pedagogy, with taught sessions focusing on specific aspects of teaching Design & Technology. Trainees then have the opportunity to see the techniques discussed in practice, with expert teachers demonstrating these aspects within their lessons. These subject sessions cover a wide range of subjects within the Design & Technology framework, such as:\r\n•\tReceiving certified Health & Safety training on the use of workshop materials and hand tools.\r\n•\tTraining on how to ensure a safe working environment within a Design & Technology classroom.\r\n•\tDeveloping projects and resources for teaching Design & Technology across all Key Stages.\r\n•\tUpgrading and developing knowledge in the areas of woods, metals & plastics/electronics/graphics/food/textiles/mechanical structures and many other areas.\r\nWe actively encourage collaborative learning within the subject, with trainees sharing resources and knowledge within their specialist areas to support each other. Trainees are regularly required to complete a Subject Knowledge Audit, in which they highlight gaps in their subject knowledge. This helps the Subject Lead to coordinate a highly bespoke package of training and support for each candidate. Trainees are also expected to undertake individual evidence based research to enhance their own subject knowledge.\r\nTrainees are assessed within the subject area through regular lesson observations from their subject mentors in school and combined observations with the Subject Lead or Professional mentors within the placement school. \r\nThere are six review points during the training year with the final assessment taking place in the summer term. In 2019-20 all of our Design & Technology trainees were graded as good or outstanding at the end of the course.\r\nWe have a consistently strong record of employment with our Newly Qualified Design & Technology Teachers within our own Trust and partnership schools within the East Riding and beyond.\r\n100% of headteachers who employed YWTT trainees said that they had made an excellent start in their new schools, with Ofsted stating that “NQTs have the knowledge and skills to become exceptional teachers.\r\n","interviewProcess":"The Director of Yorkshire Wolds Teacher Training and the appropriate Yorkshire Wolds Subject Lead conduct interviews often with a subject mentor from one of our partnership schools. The process will be approximately half a day, giving you the opportunity to meet some students and members of the YWTT team who will answer any questions you might have.","howSchoolPlacementsWork":"Yorkshire Wolds Teacher Training works in partnership with a range of schools across the East Riding of Yorkshire and Hull. Trainees are given the opportunity to place possible placement schools in order of preference, with all of the 2018-19 cohort of trainees being given their first preference school for one of their placements. Trainees have ten secondary and ten primary schools from which to make their preferences. The programme is designed to help trainees develop a deep understanding of the similarities and differences between schools having placements in three different schools; the initial orientation placement which occurs in the second week of the course, followed by a diversity and main placement which are longer in length. The course also includes diversity days at other educational institutions, allowing trainees to broaden their knowledge of the whole education system.  All secondary trainees on the programme have the opportunity to experience the 16-18 phase on one of their placements.","personalQualities":"In your application and throughout the selection process, we are looking for people with a genuine passion and enthusiasm for teaching and their subject.  Individuals who wish to inspire the next generation, engender a love for learning and support the children in their care to make excellent progress academically and in other areas.","otherRequirements":"If your degree is not directly related to the subject you wish to teach, SKE courses are an excellent way to develop your subject knowledge prior to the start of the initial teacher training course.\r\nWe actively encourage career changers to consider a career in teaching, so any other experience especially related to your subject or through working with young people is beneficial. \r\nAdmission is dependent upon satisfactory medical assessment, assessing your capacity to train to teach. \r\nCandidates will be subject to appropriate pre-selection checks, which will include full Disclosure and Barring Service (DBS) checks\r\n","status":1,"createdAt":"2021-07-06T10:47:35.742Z","updatedAt":"2021-07-21T12:23:09.431Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
