{"id":"078fc3c4-8ec7-4941-a466-67c86d36ed0d","name":"Physics","code":"27NX","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"bf97cd0a-224c-43d3-a021-84143df13e8d","code":"F3","name":"Physics"}],"locations":[{"id":"33a7feb8-0908-41d0-85ec-b5674ec39161","name":"Hall Mead School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"f83184c0-eda1-4c5b-a6b4-5954bf7c6e66","code":"H17","name":"The Havering Teacher Training Partnership"},"profPost":"PG","degreeGrade":"1","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Approved equivalency tests;\nhttps://www.equivalencytesting.com/\nhttps://astarequivalency.co.uk/","courseLength":"OneYear","feesUK":9100,"feesInternational":9100,"feeDetails":"Your £9100 fees pay for:\r\n- weekly cohort training\r\n- small group subject specific training\r\n- individual mentoring\r\n- personalised manager support\r\n- training from keynote speakers\r\n- core course texts\r\n- personalised support\r\n- course Tutor\r\n- DBS\r\n- health check\r\n- PGCE and M level credits\r\n- access to online university library \r\n\r\n\r\nIf you are offered a place on our SCITT route and withdraw before September 2021, you will be expected to pay £100 to cover the cost of the DBS, health check and administration. This is a condition of our offer letter.\r\n\r\nHTTP can also help potential trainees to apply for scholarships, where eligible.\r\n","financialSupport":"HTTP will help you to apply for bursaries and student loans prior to starting the course. Please be aware that the first payment is at the start of October, after the course has commenced so you will need to plan how your finances accordingly.\r\n\r\n","aboutCourse":"HTTP SCITT training allows teachers to have a gradual start to teaching. You will begin the course with intensive observation in your subject area and a focus on your subject curriculum, developing the necessary awareness, skills and understanding of what it means to be a great teacher of Physics.\r\n\r\nAt HTTP, we pride ourselves on the personalised support available in our programme. You will complete a Subject Knowledge Audit in our summer induction, prior to starting the course. This allows our subject leaders time to personalise the fortnightly subject development sessions based on your needs and the gaps in your foundation knowledge.\r\n\r\nIt is our aim to develop three branches in your training year: your understanding of how students' learn; your subject knowledge development and your classroom practice. You will be expected to read current generic and subject specific pedagogy so you are able to plan and sequence lessons with competence and predict sound lesson outcomes. \r\n\r\nWe will develop your skills to be a reflective practitioner and how to view your lessons through different lenses. You will be visited in your schools by your Subject Leader and your link Manager, as well as receiving weekly observations from your subject  mentor; our feedback is regular, concise and specialised to ensure you become an excellent teacher of Physics.\r\n\r\nFortnightly subject leader sessions take place in our Partner schools; they provide opportunities for you to look at expert books, teaching strategies, plans and for our subject leaders to model teaching, ready for you to emulate. We believe that teaching is a passion and a craft; we will help you find your teacher identity to become the best practitioner you can be.\r\n\r\nAt key stage 3, local schools will have different resources and schemes of work. We aim to expose you to develop as many skills as possible and to support you teaching elements of Chemistry and Biology if your placement school teaches a combined programme. We will support you to close your gaps and develop your skills in all areas of Science teaching to ensure you are highly effective and highly employable. Our SKE provider will also allow you to develop your knowledge beyond the Physics curriculum. \r\n\r\nWe provide a PGCE for all trainees based upon 2 written modules, a viva and an eportfolio of evidence. Trainees also gain 60 level 7 credits (at M level).","interviewProcess":"The Havering Teacher Training Partnership will coordinate the recruitment process and support you to make the right decision for your training. If shortlisted, you will be invited to be interviewed by our Management team to determine whether you will make a suitable teacher. At the initial interview you will be asked to complete a short presentation. If successful, you will continue to a second interview where we ascertain your understanding of schools, the course and your suitability to teach. Following this you will be invited to meet with a subject specialist to assess your subject knowledge and whether you might benefit from a Subject Knowledge Enhancement Course should one be available in your subject.\r\n\r\nOur interview process is rigorous, fair and thorough. As the school direct route is challenging, we work hard to achieve the best match of applicants to the available places in schools, which is why our close relationships with our partnership schools enables us to personalise your support. Final offers will only be made once both skills tests have been passed.\r\n\r\nWhilst we ask a lot from potential trainees; we ask more from our partner schools to support your training. Each school will provide a subject mentor and a Professional tutor, as well as a link course tutor. We also boast past trainees in all of our partner schools who can offer informal support and understanding along your journey.","howSchoolPlacementsWork":"On this route, you will be placed in one of our partner schools but will also benefit from half a term's experience in a contrasting school. From the beginning, you will be treated like a member of staff and will attend staff meetings and training days. You will be in school from the first day of the school year to the last so you will feel part of the team from the outset and we will equip you with skills in lesson planning and behaviour management, before your teaching commences.\r\n\r\nYou will be teaching pupils in both KS3 and KS4 during the year in one of our 15 partner schools. The Partnership is an accredited ITT provider currently working with the following schools: Abbs Cross Academy, Bower Park Academy, The Brittons Academy, Harris Rainham, The Coopers Company and Coborn School, Campion School, The Drapers' Academy, Emerson Park Academy, The Frances Bardsley Academy, Hall Mead School, Hornchurch High School, Marshalls Park Academy, Redden Court School, Royal Liberty School, The Sacred Heart of Mary Girls' School and Sanders School. \r\n\r\nThe long established nature of the Partnership ensures you will be placed in a school and a department where HTTP can be confident you will thrive.","personalQualities":"We are looking for the right blend of subject expertise and people skills to be able to impact upon the development of our young people. \r\nWe will expect you to speak clearly and coherently, and be comfortable talking to adults and students in a range of situations. You must be ready to accept constructive criticism to get the most from the experienced practitioners we will place you with. \r\nPassion for your subject is not optional! We will embrace your passion, drive and energy to support you to grow your teacher identity and become an effective practitioner.\r\n","otherRequirements":"You will have spent some time in an all-ability state school secondary school observing or possibly in paid employment. Alternatively you may have worked with teenagers in a voluntary capacity. We understand that early applicants may still be in the process of finding a school to visit or looking to gain experience if at all possible - we may be able to help with this if short-listed for interview.","status":1,"createdAt":"2021-07-06T10:54:35.110Z","updatedAt":"2021-09-22T13:40:50.587Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
