{"id":"3b5d7a44-f75e-41b8-b2a8-bfb2c30f3ba3","name":"Modern Languages (French, German, Spanish)","code":"2QT7","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"fbb00c08-2dbc-4f26-adb3-3b23afba18c1","code":"17","name":"German"},{"id":"e34fd2a3-a32e-44e9-aea1-666badf3ac03","code":"22","name":"Spanish"},{"id":"9727f674-61ba-4efa-b1f2-21ec7e354442","code":"15","name":"French"},{"id":"ce8523ef-9236-4cd9-b260-d826c7a521b3","code":"ML","name":"Modern Languages"}],"locations":[{"id":"854881d1-46fe-4412-9581-4987b11adfd4","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"24dcb79a-404f-4232-b129-386c24cf8dac","code":"1RM","name":"The Trinity Partnership"},"accreditedBody":{"id":"6439adcc-af64-4d3d-a1da-de045755db06","code":"R12","name":"The University of Reading"},"profPost":"BO","degreeGrade":"1","english":"1","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"10 months","feesUK":9250,"feeDetails":"If a trainee decides to take the QTS only route, the fees for the year are £7,710.","aboutCourse":"Develop your teaching skills, and qualify as a secondary modern foreign language teacher, with our highly regarded PGCE Secondary MFL with French and German or French and Spanish course at the University of Reading and Trinity School.\r\n\r\nThis Postgraduate Certificate Education (PGCE) Secondary MFL course is consistently graded as good in Ofsted inspections, and will lead to the award of Qualified Teacher Status (QTS), qualifying you to teach the 11-18 age group in secondary schools in England and Wales.\r\n\r\nThe course is a 10 month, full time course, consisting of time at University and in two different school placements.\r\n\r\nThose taking the PGCE will spend more time in the University than those taking the QTS-only course. The PGCE will involve writing assignments that are designed to help trainees to plan their teaching effectively and imaginatively, and to evaluate their developing knowledge and skills, particularly in terms of the quality of learning achieved by pupils. Successful completion will result in 60 master's-level credits.","interviewProcess":"Shortlisted applicants will be invited for a face to face interview, with one of our main partnership schools, usually within two to three weeks of application.\r\n\r\nThe interview process will include a tour of the school, a written task, a pupil panel and an interview with a senior member of staff and the ITTCo. \r\n\r\nIf successful, you will be contacted by the University of Reading, who will invite you to an initial needs meeting and a formal offer will then be made through UCAS from the University. ","howSchoolPlacementsWork":"On a Secondary PGCE course through the University of Reading you are required to carry out two placements - ensuring you receive a broad range of experiences.\r\n\r\nTrinity is the main school placement for all of our courses and a second placement of 6 weeks after Christmas will take place in a school in West Berkshire or the surrounding area. \r\n\r\nMost second school placements will be found locally and the placements are found with the individual needs of the trainee in mind. ","personalQualities":"","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:47:36.873Z","updatedAt":"2021-10-05T07:35:03.940Z","canSponsorStudentVisa":"yes","cycle":"2024"}
