{"id":"e348ed45-4677-4c1f-901f-c29f92f5b7be","name":"Primary","code":"25YH","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"7dbec1c1-5683-4433-a799-7d26a63e3a8a","name":"Speenhamland Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"12123919-3dee-4fc8-872b-882c15a82644","name":"Fir Tree Primary School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"24dcb79a-404f-4232-b129-386c24cf8dac","code":"1RM","name":"The Trinity Partnership"},"accreditedBody":{"id":"6439adcc-af64-4d3d-a1da-de045755db06","code":"R12","name":"The University of Reading"},"profPost":"BO","degreeGrade":"1","english":"1","maths":"1","science":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"10 months","feesUK":9250,"feeDetails":"If a trainee decides to take the PGCE route, the fees for the year are £7,710.","aboutCourse":"The Primary School Direct route prepares you to teach in all primary and early years schools and settings. Most of your time will be spent in your training school with a placement of six weeks in a contrasting second school.  \r\n\r\nYou will be trained to teach the full curriculum within the primary age-range, and your training will cover a minimum of four year groups.\r\n\r\nDuring the year you will attend 30 central training sessions, based at the University. These sessions are where you will receive input and support and have the opportunity to meet with other trainees. You will  be assigned a school mentor, whom you will meet with once a week. A tutor from the University will also visit you regularly.","interviewProcess":"Shortlisted applicants will be invited for a face to face interview, with one of our main partnership schools, usually within two to three weeks of application.\r\n\r\nThe interview process will include a tour of the school, a written task, a pupil panel and an interview with a senior member of staff and the ITTCo. \r\n\r\nIf successful, you will be contacted by the University of Reading, who will invite you to an initial needs meeting and a formal offer will then be made through UCAS from the University. ","howSchoolPlacementsWork":"On a Primary PGCE course through the University of Reading you are required to carry out two placements - ensuring you receive a broad range of experiences.\r\n\r\nMost second school placements will be in our Trust and the placements are found with the individual needs of the trainee in mind. ","personalQualities":"","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:47:36.756Z","updatedAt":"2021-10-05T07:43:24.640Z","canSponsorStudentVisa":"yes","cycle":"2024"}
