{"id":"b3fad73a-96ee-4486-89a4-454ea78ca843","name":"Primary (3-7)","code":"2JWV","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"3_to_7","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"8ee5a1a8-71f6-46d9-8d27-0b327a62b306","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"53552100-2ca2-47b5-93b8-b5db8b0f5537","code":"21C","name":"Vita London"},"accreditedBody":{"id":"049fe65f-08dc-4686-9ac8-606dce490128","code":"G56","name":"Goldsmiths, University of London"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","aboutCourse":"The Primary PGCE Programme offers you the opportunity to specialise in one of two age phases. These are: \r\n3-7 ( with placement in Early Years Foundation Stage and Key Stages 1)\r\n5-11 (with placement in Key Stages 1 and 2) \r\n\r\n3-7 ( with placement in Early Years Foundation Stage and Key Stages 1)\r\nThe PGCE fees for School Direct Training Route 2018-19 entry are: \r\n£9,250 for Home and EU students\r\n£14600 for International Students\r\n\r\nCandidates will need to meet the entry requirements of both the School Direct partnership and Goldsmith's. Candidates must hold a GCSE A*-C or equivalent in mathematics, English Language and science. Requirements must be met by the commencement of the course.\r\n\r\nThe Primary PGCE (QTS) Programme is taught and assessed at Masters Level. In addition to a recommendation for QTS, if you pass all academic elements of the programme, you will also leave with level 7 credits equivalent to one third of a master’s degree. Full academic support is provided to ensure you are fully prepared for assessment regardless of your prior experiences. \r\n\r\nStudies and Professional Issues in Education (SPIRE)  \r\nThe SPIRE module focuses upon issues that most impact upon the young person’s experience of education in the 21st Century.  In sessions you will be asked to: consider a range of issues relating to diversity and inclusion; engage with research and policy and link all of this to your own experience in the classroom.  In your written assignment you will choose one area from this module to reflect upon more deeply. \r\n","interviewProcess":"The interview process will be in three parts:\r\n1. 30 minute observation\r\n2. Maths and Literacy test\r\n3. Interview\r\n4. Numeracy and Literacy Assurance","howSchoolPlacementsWork":"The student will train in two schools following an ABA structure with the chance to teach in EYFS and KS1. They will have a designated mentor who will support them along their journey. The middle (B) placement will be 6 weeks at a nearby partnering school.","personalQualities":"We are looking for applicants that have an understanding of the nature of working in an urban settings and a have a clear commitment and enthusiasm for working with children. You must be able to show resilience and be willing to work with others. ","otherRequirements":"You do not need to have extensive school experience before applying but we do ask that you spend a minimum of 5 days in a primary school in the last 5 years to ensure that you are fully aware that the profession is right for you. ","status":1,"createdAt":"2021-07-06T10:56:28.785Z","updatedAt":"2021-11-10T10:39:06.365Z","canSponsorSkilledWorkerVisa":"yes","cycle":"2024","salaryDetails":"The PGCE fees for School Direct Training Route 2018-19 entry are: \r\n£9,250 for Home and EU students\r\n£14600 for International Students\r\n\r\nSalaried positions will be calculated using unqualified teaching pay scales."}
