{"id":"bdd6e7ad-b144-42f2-b0f6-b2592d16d6d0","name":"Business studies","code":"L928","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"P","ageRange":"14_to_19","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"de6477b2-6027-48e6-b9f7-3206774705c2","code":"08","name":"Business studies"}],"locations":[{"id":"86adce64-29d0-4203-bd21-8e657c3a72b8","name":"Astra Aylesbury Hub","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"73992eb0-6bc3-4724-ad76-41668c61a222","code":"2KM","name":"Astra Aylesbury Hub"},"accreditedBody":{"id":"bc8e285b-005d-4ab8-b447-784ddf2f2657","code":"28E","name":"Astra SCITT"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Candidates should use a third party provider for equivalency tests.","courseLength":"TwoYears","feesUK":12000,"feeDetails":"The course fee is £6,000 for the first year and £6,000 for the second year. ","aboutCourse":"Astra trainees in Business Studies are prepared to teach across the full 14-19 curriculum. Trainees learn to develop their students’ abilities to create works in different media. The course includes the use of technology in education, along with Sixth Form experience.\r\n\r\nThe Astra approach has at its core the principle of developing trainees as reflective professionals who have strong practical classroom skills and excellent subject knowledge. Trainees learn how to use current theory to inform their classroom practice and attention is paid to ensuring that trainees have a detailed understanding of Business Studies as a school subject, as well as outstanding skills in learning to plan and teach lessons which are creative and engaging.\r\n\r\nSubject studies are taught by a team of highly experienced practising classroom teachers who have worked with trainees over many years.\r\n\r\n Astra trainees on the part-time route spend 120 days in school, spread across two academic years.  In year one, candidates are in school two full days per week and spend one additional day with the Astra SCITT.  In year two, they are in school for two full days per week, and PGCE trainees will spend an additional 5-6 days on PGCE studies.\r\n\r\nAll training and assessment leads to the award of Qualified Teacher Status (QTS) by the DfE.  \r\n\r\nYour curriculum will follow the core content framework, with final assessment against the Teachers' Standard,  based on evidence of your teaching, wider contribution to school life and the ability to reflect on and evaluate these experiences.  Progress is monitored through weekly reflections on progress, objective setting, regular lesson observations and two QTS assignments. \r\n\r\nWeekly QTS Professional Studies will develop understanding of education essential for entrants to the teaching profession, providing consideration to whole-school issues, such as behaviour management, special educational needs and educational theories that contextualise the teaching of your subject. Secondary subject studies also focus on the teaching of each subject, including its place in the National Curriculum; what is taught; how it is taught; how it is assessed; providing for young people with different backgrounds and abilities; teaching in accordance with examination specification requirements; and using ICT effectively to facilitate learning.\r\n\r\nFee-funded or bursary-led trainees are always supernumerary and the work in school will take a variety of forms including observing experienced teachers and team teaching, gradually taking responsibility for the learning of whole classes and getting involved in all aspects of school life. ","interviewProcess":"There are three Teaching School Hubs operating on behalf of the Astra SCITT for both primary and secondary recruitment across our network of over 50 schools:\r\nAstra SCITT/Astra Amersham Hub - Amersham and surrounding area\r\nAstra Aylesbury Hub - Aylesbury / surrounding area\r\nAstra Marlow Hub - Marlow / Maidenhead\r\n \r\nCandidates should apply via DfE Apply to their preferred Astra Hub, which will then coordinate the recruitment process.  If your application is shortlisted, candidates will be invited for a first stage interview at one of our Hub locations.   \r\n\r\nThe application and interview process for each hub is identical and is quality assured by the leadership team at the Astra SCITT. It will take one of the following formats: \r\n1. Stage 1 will be conducted remotely and consist of a panel interview, delivery of a short presentation, and some written tasks.  If successful at this stage, you will be invited to attend a Stage 2 interview, which will, where possible involve a visit to your potential main placement school to be observed leading a teaching activity with a small group of students; you will be told in advance about the content of the lesson you will need to plan, and the age group you will be teaching.  \r\n2. Stages 1 and 2 will both be conducted remotely, with you being asked to ‘teach’ part of a lesson to the interview panel following the main panel interview\r\n","howSchoolPlacementsWork":"We endeavour to match the right trainee to the right partner school for their main placement based on their initial preference, geography / distance from home, and areas of specific interest. This course is offered at the locations shown on our website https://www.astra-alliance.com/402/scitt-and-school-direct-itt-places-2021-22\r\nYou will be given the opportunity to express your placement school preference if your application is shortlisted. \r\n\r\nWe aim for all trainees whether on a full or part time route, to have two placements.  On the part time route, Year 1 will be spent with one school and Year 2 in a contrasting school.  Trainees also attend an induction day with their first placement school ahead of the September course start.  \r\n\r\nSecondary trainees will teach across the 11-16 age range (14-19 yrs for Business Studies ).  \r\n\r\nQTS studies take place with the SCITT every Wednesday. Part time trainees will attend the Wednesday sessions in the first year only (although can also self elect to attend sessions in the second year).      Bursary-led / unsalaried trainee timetable allocations is approximately 30% in the first term, rising to a maximum allocation of 75% in the final placement., with the other four days per week being spent in school (approximately 120 days across the year).  If doing the PGCE, these sessions (approx 6 taught sessions) will be spread across the year.   \r\n\r\nAstra has over 50 partners signed up to the SCITT Partnership Agreement which demands that each school supplies dedicated and high quality one-to-one Mentor support and in-school Professional Studies to complement the core QTS programme offered by the SCITT each week.  Trainees will also be expected to attend events such as parents’ evening and contribute to report writing during the year.  While there is no guarantee of permanent employment with placement schools, a considerable number of our trainees do go on to secure employment within our partnership.","personalQualities":"Candidates should have the potential to become outstanding teachers, demonstrated by strong subject knowledge; ability to communicate with enthusiasm about learning; ability to reflect on experiences of working with young people, and knowledge of the curriculum and educational issues. \r\n\r\nOther requirements include being ambitious to teach at a good or outstanding level; highly motivated (with the ability to also motivate students); high professional standards; a willingness to play a part in the wider school life; commitment to professional development, and strong communication skills.\r\n\r\nFurther experience of working with children, for example helping with a youth/sports club is desirable.  \r\n","otherRequirements":"Candidates will be required to have an Enhanced DBS check, and health clearance.  Requirement to complete a funded Subject Knowledge Enhancement course will be determined at the point of offer.\r\n\r\nHard copy evidence of all required academic qualifications will need to be provided before an unconditional offer can be made. \r\n","status":1,"createdAt":"2021-07-06T10:49:23.314Z","updatedAt":"2021-09-27T19:29:48.902Z","canSponsorStudentVisa":"no","cycle":"2024"}
