{"id":"352bb42d-5ec4-40d8-9fdc-979e35927497","name":"Chemistry","code":"22D2","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"912d4fb4-761b-42e9-8dc6-e968b791ea4e","code":"F1","name":"Chemistry"}],"locations":[{"id":"32d3c46c-2013-46b3-8e31-f5bd91773e41","name":"Chestnut Grove Academy","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"a17da5c9-8a1c-4e20-a511-9854b0b1e6bb","code":"13V","name":"Wandle Teaching School Hub"},"accreditedBody":{"id":"7f11aaed-7c3e-42c5-af7a-023d33b45fa3","code":"U80","name":"UCL, University College London"},"profPost":"PG","degreeGrade":"1","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"GCSE requirements\nFor all programmes, a GCSE, or comparable qualification, at grade C or 5 is required in English Language and Mathematics. For Primary education, (pupils aged 3–11) a GCSE grade C or 5 is also required in a science subject (we do not accept Additional Science or Applied Science). We do not accept BTEC, functional skills or Access qualifications in place of GCSEs. Applicants who do not offer a GCSE in English or Mathematics may demonstrate an equivalent standard by completing either the Mathematics Foundation, Mathematics Higher or English from Equivalency Testing or A Star Equivalency and achieving at least a grade C or 5. For GCSE Science we will accept either Combined Science or Biology taken with one of these providers.","courseLength":"OneYear","feesUK":9250,"feeDetails":"Some UK/EU students may be eligible for a training bursary or scholarship depending on subject and previous qualifications. See Get into Teaching for up-to-date details.","financialSupport":"Some UK/EU students may be eligible for a training bursary or scholarship depending on subject and previous qualifications. See Get into Teaching for up-to-date details.","aboutCourse":"This IOE/UCL PGCE course will help you to develop the professional skills and knowledge you need to teach all aspects of Science to pupils at least up to age 16, as well as Chemistry to pupils aged up to 18. We are committed to creative approaches to teaching Science, and you will be encouraged to develop resources during the programme. The experienced IOE/UCL tutors have previously been classroom teachers/ heads of school Science departments/have worked in industry. They are actively involved in Science education research, work on national curriculum development and lead sessions for Science Learning Centre London. \r\nYou will acquire a critical understanding of current debates and issues relating to Science education, particularly Chesmistry, and we will guide and support you in developing your subject knowledge. You are expected to engage with reading and research in Science education and to regularly reflect upon your own progress. \r\nThis PGCE course covers health and safety, management of teaching and learning in laboratories and outdoors, the use of ICT, facilitating small group discussions, meeting pupils' special needs and assessment. The facilities include a suite of laboratories and a micro-computing laboratory.\r\n\r\nhttps://www.ucl.ac.uk/ioe/courses/teacher-training/chemistry-pgce","interviewProcess":"Applicants who are shortlisted are invited to a  Wandle TSA selection day. Candidates should allow a full day for this and dress appropriately. Candidates will be asked to complete a set of tasks; this will include a written task, an oral presentation , student based task and an  interview with school subject specialists. \r\nIf successful, candidates will be recommended to the IOE/UCL for an interview by the IOE/UCL subject specialist team. Candidates should allow a full day for this and dress appropriately. If successful at this stage, the IOE/UCL will make a conditional offer. Applicants will have 10 days to accept or reject the offer. \r\n. Candidates will  have to be certified as meeting the national requirements for physical and mental fitness to teach. The IOE/UCL will ask candidates to complete a health questionnaire for scrutiny by their occupational health provider. Candidates are responsible for the cost of obtaining occupational health clearance, which is approximately £45. Candidates will also be required to apply for an Enhanced Disclosure certificate from the DBS as a condition of entry. \r\n","howSchoolPlacementsWork":"Wandle TSA PGCE School Direct students will have two school placements. These will be in two of our partner schools and will offer you a contrasting school experience, for example, one placement in a mixed school and a second in a single sex school.  We will discuss with you the best school to have your placements taking into account your travel requirements. All our School Direct students are invited to spend the first week of term with their first placement school as an early induction and to gain invaluable experience in participating in the beginning of term. This also allows many of the induction processes to be carried out and for you to get to know staff, systems and students. The age range will be from 11 to 18 and you will be required to teach across two stages in your placement, Key Stage 3 and 4 or 5 when you join us for your formal placements and training.\r\nWe have seven  secondary partner schools in our alliance. These schools are situated in SW London, primarily in Wandsworth and Lambeth and all schools have excellent transport links.\r\nThe length of school placement is 120 days over the two placements In addition to the class teachers you will have a subject mentor, a  school mentor as well as your IOE/UCL mentor to support you through these placements. You will always be supported in your classroom teaching and all our schools have extensive in house  training programmes. The Alliance runs several extra workshops throughout the training .\r\nWe have  special schools , primary schools  and Children centres in our Alliance and we encourage our students to take advantage by visiting to gain a wide understanding of the educational landscape.\r\nAt all times we keep you at the centre of the learning process and we work hard to ensure you have a challenging but supportive experience. ","personalQualities":"The Wandle Teaching School Alliance wishes to recruit high quality graduates committed to developing themselves as outstanding teachers. We are looking for candidates who have high expectations for their students. You should be a good communicator, enjoy challenge and have a love of learning. You will need to be resilient, flexible and hard working. We expect you to have excellent subject knowledge and the ability to build a strong rapport with students of all abilities. It also helps to have a sense of humour and, most importantly of all, to like and respect children. ","otherRequirements":"We strongly recommend that you spend some time observing teaching and learning in an inner London school before applying or whilst waiting for interview. \r\nThis is important as teaching and learning is a dynamic process and changes in pedagogy and curriculum content may mean classrooms are   very different places from when you last were in school. It is therefore important  to spend some time in a school so as you can reflect on what you have learned in your PGCE interviews.","status":1,"createdAt":"2021-07-06T10:53:53.717Z","updatedAt":"2021-07-23T10:37:22.561Z","canSponsorStudentVisa":"yes","cycle":"2024"}
