{"id":"7b3fbc36-654c-48d7-b1f0-8f7cf83dedfb","name":"Primary","code":"22D5","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"8eec6044-7f64-446a-9868-14d6f1e2fa92","name":"Chesterton Teaching School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"a17da5c9-8a1c-4e20-a511-9854b0b1e6bb","code":"13V","name":"Wandle Teaching School Hub"},"accreditedBody":{"id":"33037eab-f75d-4350-b1e2-967c41e9d4c6","code":"R48","name":"Roehampton University"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"\r\nThe Primary General is a PGCE course offered in conjunction with Roehampton University. \r\nThis course leads to QTS and PGCE. \r\n\r\n PGCE Primary at Roehampton will provide you with 60 credits towards a Masters qualification.\r\nIf you study PGCE Primary  with Wandle TSA and  Roehampton you will be taught by a supportive, passionate and driven team of academic staff who are all specialists in their subject areas. Our experienced team strive to ensure you receive the best education and will encourage you to become a confident and successful teacher. In addition to our academic staff, we also have a range of support departments to help you with everything from dealing with money matters, to support with your studies. \r\n\r\nThis postgraduate course gives you the tools to build a successful career in teaching while providing a holistic view of the profession; you will look at the role of the child, curriculum and teacher. We will also give you the opportunity to focus on a particular age group, either 3-7 or 5-11 year olds. \r\n\r\nYou will cover all of the National Curriculum Core and Foundation Subjects, examine learning across the curriculum and the relationship between the subjects in these two groups.\r\n\r\nYou will study a range of modules which will hone your expertise and effectiveness as a teacher. You will learn how to manage a classroom, how planning and preparation contribute to the effectiveness of your teaching, how best to work with parents and other adults, and gain an understanding of children’s behaviour.\r\n\r\nOur subject rooms are set up to include resources you will find in a primary classroom environment. This is important for your full immersion into the school environment and familiarity with the way classrooms are structured, and the type of resources teachers need on a daily basis.\r\n\r\n There are two assessed teaching placements in the Wandle TSA family of primary schools which will provide you with invaluable hands-on work experience giving you the confidence for your future career and a better understanding of how teaching works in practice. \r\nAll our academic staff at Roehampton have extensive teaching experience in schools, and many have served in local authorities or subject associations as advisory teachers, as Ofsted inspectors or as consultants. This expertise is complimented by the experience in school Wandle TSA mentors who will be your guide and support you throughout your training. \r\n\r\n","interviewProcess":"Applicants who are shortlisted are invited to a  Wandle TSA selection day. Candidates should allow a full day for this and dress appropriately. Candidates will be asked to complete a set of tasks; this will include a written task, an oral presentation , student based task and an  interview with school subject specialists. \r\nIf successful, candidates will be recommended to  Roehampton University for interview . Candidates should allow a full day for this and dress appropriately. If successful at this stage, the Roehampton University will make a conditional offer. Applicants will have 10 days to accept or reject the offer. \r\n Candidates will  have to be certified as meeting the national requirements for physical and mental fitness to teach. Roehampton University will ask candidates to complete a health questionnaire for scrutiny by their occupational health provider. Candidates are responsible for the cost of obtaining occupational health clearance, which is approximately £45. Candidates will also be required to apply for an Enhanced Disclosure certificate from the DBS as a condition of entry. \r\n","howSchoolPlacementsWork":"Wandle TSA PGCE School Direct students will have two school placements. These will be in two of our partner schools \r\n  We will discuss with you the best school to have your placements taking into account your travel requirements. All our School Direct students are invited to spend the first week of term with their first placement school as an early induction and to gain invaluable experience in participating in the beginning of term. This also allows many of the induction processes to be carried out and for you to get to know staff, systems and students. Your placements  will be EYFS and Key Stage 1 or Key Stage 1 and 2 for the first placement and then  swap for the second placement.We have thirty  primary partner schools in our alliance. These schools are situated in SW London, primarily in Wandsworth , Croydon, Lambeth and Southwark. All  schools have excellent transport links.\r\nThe length of school placement is  in two blocks, 31 days Block 1 and 72 days Block 2.  In addition to the class teachers you will have a subject mentor, a  school mentor as well as your university mentor to support you through these placements. You will always be supported in your classroom teaching and all our schools have extensive in house  training programmes. The Alliance runs several extra workshops throughout the training .\r\nWe have  special schools , primary schools  and Children centres in our Alliance and we encourage our students to take advantage by visiting to gain a wide understanding of the educational landscape.\r\nAt all times we keep you at the centre of the learning process and we work hard to ensure you have a challenging but supportive experience. ","personalQualities":"The Wandle Teaching School Alliance wishes to recruit high quality graduates committed to developing themselves as outstanding teachers. We are looking for candidates who have high expectations for their students. You should be a good communicator, enjoy challenge and have a love of learning. You will need to be resilient, flexible and hard working. We expect you to have excellent subject knowledge and the ability to build a strong rapport with students of all abilities. It also helps to have a sense of humour and, most importantly of all, to like and respect children. ","otherRequirements":"We strongly recommend that you spend some time observing teaching and learning in an inner London school before applying or whilst waiting for interview. \r\nThis is important as teaching and learning is a dynamic process and changes in pedagogy and curriculum content may mean classrooms are   very different places from when you last were in school. It is therefore important  to spend some time in a school so as you can reflect on what you have learned in your PGCE interviews.","status":1,"createdAt":"2021-07-06T10:53:53.784Z","updatedAt":"2021-07-23T10:32:43.231Z","canSponsorStudentVisa":"yes","cycle":"2024"}
