{"id":"2bc152c9-dc42-46ce-8deb-dcc23a47a5a2","name":"Primary (5-11)","code":"32SF","qualification":"qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"35f3780f-27d3-44e9-bbb3-81a040fd9081","name":"Chepping View Primary Academy","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"764347be-336c-427a-b049-34c7ade3d8db","code":"138","name":"Chepping View Primary Academy"},"accreditedBody":{"id":"466ca7e6-5808-4abb-ab4c-1e9e377c3164","code":"24S","name":"Chepping View Primary Academy SCITT"},"degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":null,"aboutCourse":"We offer a primary teacher training course aimed at the 3-7 age range / 5-11 age range, leading to the award of QTS. There is also an optional PGCE qualification with Oxford Brookes University which includes 60 credits at Masters level. All PGCE seminars take place at CVPA SCITT.\r\nOur course consists of two core elements:\r\nSchool-based training\r\nThe vast majority of training takes place in schools.  Our trainees spend four days a week in two different placement schools, teaching subjects across the primary phases. \r\nAn experienced teacher will be allocated to a trainee as their Teacher Tutor mentor and they will work closely alongside them during each placement, ensuring the trainee receives high quality training, support and advice, and models exemplary practice. In addition, a School-based Mentor, typically a Senior Leader in the school, will be allocated to each trainee, offering professional support, guidance and pastoral care.\r\nTrainees are supported and assessed throughout the course, through weekly review meetings with their Teacher Tutor mentor, lesson observations, professional discussions and formative assessment points towards the end of each placement. Trainees’ reflections and self-evaluations are important to help strengthen and deepen their knowledge and understanding of their teaching practice and progress. There are two summative assessment points, half way through and towards the end of the course, when trainees are assessed against the Teachers’ Standards.\r\nCentre-based training\r\nTo support the school-based training, trainees attend weekly training sessions at the CVPA SCITT centre in High Wycombe, delivered by current and outstanding practitioners from the Partnership schools.   Practical and evidence-based training is delivered, in line with our Curriculum, covering all primary subjects and integrating other educational areas such as cognitive science, behaviour management, safeguarding and wellbeing.\r\nThese weekly sessions, along with our provision of online educational resources, enable trainees to develop and consolidate a deeper understanding of key issues and pedagogical thinking as well as their subject knowledge, practical techniques and strategies that can be applied to their own classroom practice.  It also offers the opportunity for critical thinking and reflection, and for trainees to share experiences in a supportive environment. \r\n\r\n\r\n\r\n","interviewProcess":"The interview process takes place at Chepping View Primary Academy SCITT and consists of a short presentation, a teaching activity with a small group of children, a written and maths task, and a panel interview.  You will be told in advance about the content of the activity and the age of the children.\r\nThe selection process takes up a minimum of half a day. Please note that applicants for salaried positions may be asked to complete additional tasks as specified by the employing school.         \r\nFor successful applicants, conditional places may be offered; typically conditions include evidence of qualifications, a criminal record check (DBS) and an occupational health assessment. To reflect individual circumstances, further conditions may be discussed at interview.\r\n","howSchoolPlacementsWork":"We work with a large partnership of schools in High Wycombe and the surrounding area, offering a wide range of learning experiences across the primary years.  \r\nOur trainees have two placement schools: a main and second placement. We aim to match trainees with the right schools and try to accommodate personal wishes, including location and transport considerations. \r\n\r\nMain Placement (MP1) – Autumn Term\r\nTrainees will spend the majority of their time in this school. During MP1, trainees begin by observing other teachers in the school, working with groups of children and gradually increasing their responsibility until they are teaching approximately 50% of the time in school, delivering lessons with support from their Teacher Tutor against specific targets. \r\nSecond Placement (SP2) – Spring Term\r\nThis placement typically takes place in a contrasting school and a different key stage. Following initial teacher observations and small group work, trainees continue to develop their teaching experience and practice, culminating in teaching up to 60% of the week. \r\nAdditional Placements – Spring Term\r\nTrainees will also have the opportunity to undertake a short placement in an Early Years setting (either a nursery or Reception class), a Special Needs school and an upper and grammar school.  This invaluable experience enables trainees to appreciate a range of education settings and the different strategies, skills and knowledge needed to deliver a broad and balanced curriculum.   \r\nMain Placement (MP3) – Summer Term\r\nTrainees return to their main placement school for their final term of training.  At this stage, trainees are expected to fulfil the main requirements of a classroom teacher with a teaching commitment of up to 80% of the week by the end of the placement.  Regular lesson observations and feedback continue throughout the training programme. Our Teacher Tutors and Quality Assurance Mentors monitor the progress of all trainee teachers. At the end of the course, a final assessment board considers the progress made by each trainee, their level of attainment and ultimately the award of QTS. \r\n","personalQualities":"We aim to recruit individuals who: \r\n•\tdemonstrate a commitment to teaching and genuine concern for children's well-being\r\n•\tare flexible, creative and enthusiastic \r\n•\tare self-motivated, resilient and adapt well to change\r\n•\twork well under pressure\r\n•\tcommunicate clearly and accurately in standard English\r\n•\tare proactive in enhancing their learning and subject knowledge\r\n•\twork effectively in a team and foster positive relationships with the \r\nschool community\r\n•\tsupport the values, attitudes and ethos of our partnership schools\r\n•\tmaintain a high standard of professionalism and conduct\r\n•\treflect on their own practice and act upon advice\r\n","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:47:52.664Z","updatedAt":"2021-07-12T12:54:52.666Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"The salary for a salaried trainee is usually the minimum point of the Unqualified Teacher pay scale. \r\nTuition fees for the course will be £7,750. \r\nThe fee for the optional PGCE with Oxford Brookes University is £1,500.\r\n\r\n"}
