{"id":"69c7ca59-c0c0-468f-9f55-f499e9ecbbaa","name":"Primary with Mathematics (5-11)","code":"38ZD","qualification":"qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"286cf12f-b3e3-41c5-9f33-2ff7807d2df0","code":"03","name":"Primary with mathematics"}],"trainingProvider":{"id":"764347be-336c-427a-b049-34c7ade3d8db","code":"138","name":"Chepping View Primary Academy"},"accreditedBody":{"id":"466ca7e6-5808-4abb-ab4c-1e9e377c3164","code":"24S","name":"Chepping View Primary Academy SCITT"},"english":"1","maths":"1","science":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":null,"aboutCourse":"We offer a primary teacher training course aimed at the 5-11 age range, leading to the award of QTS. There is also an optional PGCE qualification with Oxford Brookes University which includes 60 credits at Masters level. All PGCE seminars take place at CVPA SCITT.\r\n\r\nOur course consists of two core elements:\r\n\r\nSchool-based training\r\n\r\nThe vast majority of training takes place in schools.  Our trainees spend four days a week in two different placement schools, teaching subjects across the primary phases. An experienced teacher will be allocated to a trainee as their Teacher Tutor and they will work closely alongside them during the course of each placement, showing exemplary practice and providing daily support and advice.  In addition, a School-based Mentor, typically a Senior Leader, will be allocated to each trainee, offering pastoral care and support. \r\n\r\nTrainees are assessed against the Teachers’ Standards and their progress towards these standards is reviewed at regular intervals throughout the course. A wide range of evidence is used when making judgements such as observations, half termly reports, evidence bundles and the trainees’ reflections and self-evaluations.  All evidence is uploaded to an electronic portfolio system which tracks trainees’ progress, identifying strengths and areas of development.\r\n\r\nCore training\r\n\r\nTo support the school-based training, trainees attend weekly core training sessions at the SCITT centre in High Wycombe, delivered by current and outstanding practitioners from the Partnership schools.   Practical and research-based training is closely linked to the Teachers’ Standards and National Curriculum, as well as covering areas such as safeguarding, behaviour management, e-safety and well-being. \r\nThese weekly sessions, along with pre-task activities and three assignments, enable trainees to develop and consolidate a deeper understanding of key issues and pedagogical thinking as well as practical techniques and strategies that can be applied to their own classroom practice.  It also offers the opportunity for critical thinking and reflection, and for trainees to share experiences in a supportive environment.  \r\n\r\nMaths Specialism\r\n\r\nTrainees on the Primary 5-11 with maths specialism will be provided with opportunities to develop their expertise, knowledge and skills in this subject area. There will also be additional training days at CVPA SCITT for maths specialists.\r\n\r\n","interviewProcess":"The interview process takes place either Chepping View Primary Academy SCITT or a school within our partnership. It consists of a short presentation, written task, a teaching activity with a small group of children and a panel interview.  You will be told in advance about the content of the activity and the age of the children.\r\n\r\nThe selection process takes up a minimum of half a day. Please note that applicants for salaried positions may be asked to complete additional tasks as specified by the employing school.         \r\n\r\nFor successful applicants, conditional places may be offered; typically conditions include evidence of qualifications, passing the Professional Skills Tests, a criminal record check (DBS) and an occupational health assessment. To reflect individual circumstances, further conditions may be discussed at interview.\r\n","howSchoolPlacementsWork":"We work with a large partnership of schools in High Wycombe and the surrounding area offering a wide range of learning experiences across the primary years. \r\nOur trainees have two placement schools: a main and second placement.  We aim to match trainees with the right schools and try to accommodate personal wishes, including location and transport considerations. \r\n\r\nMain Placement (MP1) – Autumn Term\r\n\r\nTrainees will spend the majority of their time in this school (both the Autumn and Summer terms).  During MP1, trainees will begin by observing other teachers in the school, working with groups of children and gradually increasing their responsibility until they are teaching approximately 50% of the time in school, delivering lessons with support from their Teacher Tutor against specific targets. \r\n\r\nSecond Placement (SP2) – Spring Term\r\n\r\nThis placement typically takes place in a contrasting school and a different key stage. Following initial teacher observations and small group work, trainees will plan full lessons with class teaching, culminating in a teaching commitment of up to 60% of the week. \r\n\r\nAdditional Placements – Spring Term\r\n\r\nTrainees will also have the opportunity to undertake a short placement in an Early Years setting (either a nursery or Reception class), a Special Needs school and an upper and grammar school.  This is valuable experience for trainees to appreciate a range of education settings and the different strategies, skills and knowledge needed to deliver a broad and balanced curriculum.   \r\n\r\nMain Placement (MP3) – Summer Term\r\n\r\nTrainees will return to their main placement school for their final term of training.  At this stage, trainees are expected to be able to fulfil the main requirements of a classroom teacher with a teaching commitment of up to 80% of the week by the end of the placement.  Regular lesson observations and feedback are an ongoing process throughout the training programme. Our Teacher Tutors and Quality Assurance Mentors monitor the progress of all teacher trainees. At the end of the course, a final assessment board considers the progress made by each trainee, their level of attainment and ultimately the award of QTS. \r\n","personalQualities":"Individuals should be able to:\r\n•\tdemonstrate a commitment to teaching\r\n•\tdemonstrate good subject knowledge \r\n•\tbe flexible, creative and enthusiastic \r\n•\tbe self-motivated, resilient and adapt well to change\r\n•\twork under pressure\r\n•\tcommunicate clearly and accurately in standard English\r\n•\tproactively seek opportunities to enhance their learning\r\n•\twork effectively in a team and foster positive relationships with members of a school community\r\n•\tsupport the values, attitudes and ethos of our partnership schools\r\n•\tmaintain a high standard of professionalism and conduct\r\n•\treflect on their own practice and act upon advice\r\n","otherRequirements":"","status":2,"createdAt":"2021-07-06T10:47:52.696Z","canSponsorSkilledWorkerVisa":"no","cycle":"2023","salaryDetails":"The salary for a salaried trainee is usually the minimum point of the Unqualified Teacher pay scale. \r\n\r\nFinancial support is not available for this course as it comes with a salary.\r\n"}
