{"id":"081c65f2-bffa-47f6-bd68-9514d67d20f8","name":"Physics","code":"2BRL","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"bf97cd0a-224c-43d3-a021-84143df13e8d","code":"F3","name":"Physics"}],"locations":[{"id":"a3b81c1c-4ff0-4ddf-b807-33566c9e8024","name":"Main Site","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"77791bf9-2640-454c-8c62-fad18e44e703","code":"1RH","name":"Waverley School Direct"},"accreditedBody":{"id":"4aa8177a-27b8-4566-b77a-c45515e46739","code":"N36","name":"Newman University"},"profPost":"PG","english":"2","maths":"2","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"The Physics PGCE is an 11-16 programme designed by the Waverley School Direct and Newman University teams to develop your skills and confidence as a teacher in our schools.  You will develop an  understanding of effective techniques used by experienced teachers, including the use of ICT, and how they can be used to help children of all abilities grasp the more complex ideas in the secondary national curriculum. The course details below are subject to adjustment due to the ongoing impact of the COVID-19 pandemic, to include elements of online training provision and online teaching experience.\r\n\r\nWe have designed our PGCE course to maximise your experience of classrooms, but also to have access to the depth and breadth of experience of university tutors. The school-led programme starts with summer induction , including liaison with your host school, which you then join for the full academic year in September. We organise a placement in a second school, usually for the six weeks before Easter.\r\n\r\nYou will benefit from both university-led and school-led sessions: approx. 14 days' training at Newman University, focused on subject pedagogy and academic writing support, plus 14 twilight professional studies sessions with Waverley School. There is also the daily support and guidance from your mentor and subject colleagues in school. The university input is front-loaded in September with one day p/w until early October, from when you are in school full-time with an occasional day on academic writing support from Newman. This pattern is repeated in January followed by your second school placement until Easter. You then return to your main host school attachment until end summer term.\r\n\r\nYou are assessed against the Teacher Standards through regular lesson observation with supportive feedback and ongoing self-reflection on your progress. You will also complete two Master’s Level assignments of 4000 words each and will be expected to work independently to develop further your understanding of theoretical principles. After your assessment for QTS and PGCE is completed around the end of June, you will be supported until the end of the summer term to extend your experience through your choice of focus, aimed at enhancing your early career prospects and enabling you to be the best teacher you can be. \r\n\r\nWe have more than one Physics programme. This option will best suit candidates who are confident in working independently and/or find Newman University to be suitably located.\r\n","interviewProcess":"We review all applications to assess eligibility and potential suitability for the programme to which a candidate is applying. We recruit and fill places from when UCAS opens in October, so do not delay in submitting your application. We close courses as they are filled; and at the latest by 2 July 2021.\r\n\r\nWe work with our university partners to co-ordinate the recruitment process and hold interviews on a regular basis. You will be asked to attend one interview session, usually at Waverley School. A senior Waverley School Direct colleague and a university representative join the interview panel alongside a subject and/or phase expert(s). Sometimes partner schools are also represented. \r\n\r\nThe interview consists of a teaching activity presentation, where we gauge your ability to present information effectively, have an impact on an audience and the level of your subject knowledge. You will be given guidance about this in advance. There is also a set of formal interview questions where we evaluate your experience of working with young people to date, your subject knowledge, and your commitment to, and understanding of, the role of a trainee and teacher. ","howSchoolPlacementsWork":"We actively recruit for the trainees we want and need for our core partnership of secondary schools, many of which are within a five mile radius of Waverley School in the east and centre of Birmingham. We all share the common goal of making a real difference through the power of education to the areas of socio-economic disadvantage within which we are located. \r\n\r\nWe also work with a wider network of schools to offer both main and second placements, numbering another 20 schools we have worked with over the last three years. Sometimes a new school approaches us as they already know a potential applicant; and sometimes an applicant introduces a potential new host school to us. We are always happy to consider new partners. Some trainees travel long distances from outside the area to come and work with us so we really value this wider network of partners.\r\n\r\nWe take many factors into account when selecting main and second placements for our trainees, with home location being a key consideration. We also invite successful applicants to express a preference should they wish following interview and we will take reasons given into account when making decisions.\r\n\r\nOur secondary programmes are focused on the 11-16 age range, but we will ensure that you have access to post-16 teaching at your main or second school or as an additional short placement. You will also spend two days visiting other secondary schools in our partnership. Finally you will undertake a placement of up to five days attached to a primary school, including a focus on transition from KS2 to KS3. \r\n\r\nOur course is designed so that you benefit from the best that Newman University and 'on-the-job' learning can offer. You can expect to spend over 165 days in classrooms working with children, about 30 days of which will be in your second school.\r\n\r\n","personalQualities":"You need a passion for teaching and developing young people. You will want to make a difference in some of the most socio-economically deprived areas of Birmingham. You will have excellent communication skills and be reflective, able to respond positively to feedback and learn from your mistakes. We are looking for resilience, trainees who can both work hard and keep trying when things do not go to plan. We need team players, willing to support others – and to be supported. You need to be organised and highly professional at all times. You need to enjoy learning yourself!","otherRequirements":"The requirements below need to be met by successful applicants following acceptance of our offer:\r\n\r\n* Disclosure and Barring Service (DBS) clearance.\r\n* Fitness to Teach process. \r\n","status":2,"createdAt":"2021-07-06T10:56:21.214Z","canSponsorStudentVisa":"no","cycle":"2024"}
