{"id":"2c7110f0-d03b-462d-8239-69932cbed3c2","name":"Primary","code":"37B8","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"other","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_7","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"a3b81c1c-4ff0-4ddf-b807-33566c9e8024","name":"Main Site","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"77791bf9-2640-454c-8c62-fad18e44e703","code":"1RH","name":"Waverley School Direct"},"accreditedBody":{"id":"4aa8177a-27b8-4566-b77a-c45515e46739","code":"N36","name":"Newman University"},"profPost":"PG","english":"2","maths":"2","science":"2","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"The Primary PGCE (3-7) is designed to develop your skills and confidence as a Foundation Stage/KS1 teacher.  The course focuses on all National Curriculum subjects, with emphasis on English, Maths, Science and ICT, and includes specialist study of the early years’ foundation stage curriculum and the distinctive pedagogies encountered in reception/nursery classrooms. You will learn the principles of curriculum design and delivery as well as theories of learning and teaching. We want our trainees to emerge as reflective teachers who can respond effectively to the learning needs of young children of all abilities and needs, with a particular focus on challenges and opportunities experienced in our area of Birmingham.  \r\n\r\nOur PGCE course maximises your practical experience in classrooms, but also takes advantage of the depth and breadth of experience of university tutors, underpinned by educational theory. We start with July induction, with sessions at Waverley School and liaison with your host school.\r\n\r\nYour training consists of university core PGCE provision (approx. 30 days and including academic writing support), plus a complementary school-led programme delivered by practising teachers. This school-led element (approx. 17 sessions) comprises primary pedagogy, group tutorial and cross-phase sessions, with two of our partner schools as training sites. This is in addition to the daily support, experience and guidance from your host and second schools.\r\n\r\nYou are attached to your host school from start September before an intensive five week training block at university, during which you return to school one day per week to give you a practical context for your learning. You then join school full-time, with the exception of occasional Fridays at university. You will have substantial experience of two schools and key stages during the year, as well as further opportunities to develop your breadth of knowledge and understanding. You start by teaching short activities and small groups, gradually building up your skills and confidence for teaching whole-class lessons.\r\n\r\nYou are assessed against the Teacher Standards, through regular lesson observation with supportive feedback and your self-reflection. You also complete two Master’s Level assignments of 4000 words each. After final assessment in early July, you are offered a bespoke opportunity to extend your experience, aimed at enhancing your early career prospects and enabling you to be the best teacher you can be. \r\n\r\nCourse details above are subject to adjustment due to any ongoing impact of the COVID-19 pandemic and/or revalidation of Newman University PGCE programmes.","interviewProcess":"We review all applications to assess eligibility and potential suitability for the programme to which a candidate is applying. We recruit and fill places from when UCAS opens in October, so do not delay in submitting your application. We close courses as they are filled.\r\n\r\nWe work with our university partners to co-ordinate the recruitment process and hold interviews on a regular basis. You will be asked to attend one interview session, led by Waverley School and conducted online. A senior Waverley School Direct colleague and a university specialist tutor will usually form the interview panel, though sometimes partner schools are also represented. \r\n\r\nThe interview consists of a short teaching presentation, where we gauge your ability to present information effectively to the appropriate age range, have an impact on an audience and the level of your subject knowledge. You will be given information about this in advance. There is also a set of formal interview questions where we evaluate your experience of working with young people to date, your subject knowledge, and your commitment to, and understanding of, the role of a trainee and teacher. ","howSchoolPlacementsWork":"We actively recruit for the trainees we want and need for our core partnership of primary schools in the centre and east of Birmingham, within a five mile radius of Waverley School. We are a small group of schools sharing the common goal of making a real difference through the power of education to the areas of socio-economic disadvantage within which we are located. \r\n\r\nWe also work with a wider network of schools to offer second placements in particular. Sometimes a new school approaches us as they already know a potential applicant; and sometimes an applicant introduces a potential new host school to us. We are always happy to consider new partners. Some trainees travel long distances from outside the area to come and work with us so we really value this wider network of partners.\r\n\r\nWe take many factors into account when selecting main and second placements for our trainees, with home location being a key consideration. We also invite successful applicants to express a preference should they wish following interview and we will take reasons given into account when making decisions.\r\n\r\nOur course is designed so that you benefit from the best that Newman University and 'on-the-job' learning can offer. You can expect to spend over 155 days attached to classrooms and working with children, about 30 days of which will be with your second school.\r\n\r\nPlacement details above are subject to adjustment due to any ongoing impact of the COVID-19 pandemic and/or following the revalidation of Newman University PGCE programmes.\r\n\r\n","personalQualities":"You need a passion for teaching and developing young children. You will want to make a difference in some of the most socio-economically deprived areas of Birmingham. You will have excellent communication skills and be reflective, able to respond positively to feedback and learn from your mistakes. We are looking for resilience, trainees who can both work hard and keep trying when things do not go to plan. We need team players, willing to support others – and to be supported. You need to be organised and highly professional at all times. And you need to enjoy learning yourself!","otherRequirements":"The requirements below need to be met by successful applicants following acceptance of our offer:\r\n\r\n* Disclosure and Barring Service (DBS) clearance.\r\n* Fitness to Teach process. \r\n","status":2,"createdAt":"2021-07-06T10:56:21.677Z","canSponsorStudentVisa":"no","cycle":"2024","applicationsOpenDateOther":"2021-10-24T00:00:00.000Z"}
