{"id":"f43cae03-8c2b-4b0d-bcf0-f6adce0b6a5d","name":"English","code":"M534","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3aed1aa8-ae46-4b68-92bb-a6cc20655c59","code":"Q3","name":"English"}],"locations":[{"id":"a3b81c1c-4ff0-4ddf-b807-33566c9e8024","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"77791bf9-2640-454c-8c62-fad18e44e703","code":"1RH","name":"Waverley School Direct"},"accreditedBody":{"id":"62d5803b-89ca-4e21-bb6f-5c74944c56ad","code":"B25","name":"Birmingham City University"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"The PGCE English is an 11-16 programme designed by the Waverley School Direct and Birmingham City University teams to develop your skills and confidence as a teacher in our schools. You will learn to teach topics across both Language and Literature and elements of Drama and Media education, helping your learners to develop skills as effective communicators. \r\n\r\nWe have designed our PGCE course to maximise your classroom experience, but also to take advantage of the depth and breadth of experience of university tutors, underpinned by educational theory. We start with summer induction, with sessions from Waverley School and liaison with your host school where you will train. You will benefit from university PGCE provision, plus an additional school-led programme delivered by practising teachers. This equates to 40+ days' training from BCU, focused on subject pedagogy, professional studies and academic writing support, plus 14 twilight sessions from Waverley School, addressing practical skills in the context of our schools. In addition there is the daily support and guidance provided by your mentor and subject colleagues at school.  \r\n\r\nFollowing initial attachment to your school in September, you will undertake intensive university-led training. You then rejoin your school on a four day per week basis; the fifth day is spent on BCU training. After February half-term, we place you in a second school for about six weeks until Easter. You then return to your main host school until the end of the summer term.\r\n\r\nYour progress is assessed through regular lesson observation with supportive feedback and ongoing self-reflection. You will also complete three Master’s Level assignments, including a ‘Professional Enquiry’ based on your own teaching. After your assessment for QTS and PGCE is completed at the end of June, you will be supported until the end of term to extend your experience through your choice of focus, aimed at enhancing your early career prospects and enabling you to be the best teacher you can be. \r\n\r\nCourse details above are subject to adjustment due to any ongoing impact of COVID-19 and in response to the ITT Market Review.","interviewProcess":"We review all applications to assess eligibility and potential suitability for the programme to which a candidate is applying. We recruit and fill places from when UCAS opens in October, so do not delay in submitting your application. We close courses as they are filled.\r\n\r\nWe work with our university partners to co-ordinate the recruitment process and hold interviews on a regular basis. You will be asked to attend one interview session, led by Waverley School and conducted online. A senior Waverley School Direct colleague and a subject expert will sit on every panel and sometimes partner schools/BCU are also represented. \r\n\r\nThe interview consists of a short presentation to the panel, where we gauge your ability to present information effectively, have an impact on an audience and the level of your subject knowledge. You will be given information about this in advance. There is also a set of formal interview questions where we evaluate your experience of working with young people to date, your subject knowledge, and your commitment to, and understanding of, the role of a trainee and teacher. \r\n\r\nYou will also complete diagnostic exercises prior to interview so we can gauge what additional support you might need, if any, to undertake professional tasks and to work at PGCE Master's level.\r\n\r\nCandidates who are successful at interview are welcome to visit the main training site at Waverley School before deciding to accept a PGCE offer.","howSchoolPlacementsWork":"We actively recruit for the trainees we want and need for our core partnership of secondary schools, many of which are within a five mile radius of Waverley School in the east and centre of Birmingham. We all share the common goal of making a real difference through the power of education to the areas of socio-economic disadvantage within which we are located. \r\n\r\nWe also work with a wider network of schools to offer both main and second placements, numbering over 20 schools we have worked with in recent years. Sometimes a new school approaches us as they already know a potential applicant; and sometimes an applicant introduces a potential new host school to us. We are always happy to consider new partners. Some trainees travel long distances from outside the area to come and work with us so we really value this wider network of partners.\r\n\r\nWe take many factors into account when selecting main and second placements for our trainees, with home location being a key consideration. We also invite successful applicants to express a preference should they wish following interview and we will take reasons given into account when making decisions.\r\n\r\nOur secondary programmes are focused on the 11-16 age range, but we will ensure that you have access to post-16 teaching at your main or second school or as an additional short placement. You will also spend two days visiting other secondary schools in our partnership to broaden your experience. You will also undertake a four day placement focusing on SEND. Finally you will undertake a two day placement at a primary school, including a focus on transition from KS2 to KS3.\r\n\r\nOur course is designed so that you benefit from the best that Birmingham City University and 'on-the-job' learning can offer. You can expect to spend over 150 days attached to classrooms and working with children, about 30 days of which will be with your second school.\r\n\r\nPlacement details above are subject to adjustment due to any ongoing impact of the COVID-19 pandemic and response to the ITT Market Review.\r\n\r\n","personalQualities":"You need a passion for teaching and developing young people. You will want to make a difference in some of the most socio-economically deprived areas of Birmingham. You will have excellent communication skills and be reflective, able to respond positively to feedback and learn from your mistakes. We are looking for resilience, trainees who can both work hard and keep trying when things do not go to plan. We need team players, willing to support others – and to be supported. You need to be organised and highly professional at all times. And you need to enjoy learning yourself!","otherRequirements":"The requirements below need to be met by successful applicants following acceptance of our offer:\r\n\r\n* Disclosure and Barring Service (DBS) clearance.\r\n* Fitness to Teach process. \r\n","status":1,"createdAt":"2021-07-06T10:56:22.074Z","updatedAt":"2021-10-03T19:35:30.359Z","canSponsorStudentVisa":"yes","cycle":"2024"}
