{"id":"e5415856-ba7f-42cd-ad23-67d23f1fa853","name":"Art and design","code":"X171","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"d461a678-3335-4ca2-9616-1dc479d31a49","code":"W1","name":"Art and design"}],"locations":[{"id":"4b5a3844-d4ab-4ecf-a923-0e03dd518fd3","name":"Churchill Community College","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"260a3be1-6941-4299-89b0-1061d339c7a9","code":"2X6","name":"Northumbria Art and Design Partnership"},"accreditedBody":{"id":"b384b008-59e2-461e-a15f-3551d1165c1e","code":"N77","name":"University of Northumbria at Newcastle"},"profPost":"PG","degreeGrade":"1","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"The Northumbria Art, Craft and Design Partnership is THE ONLY single subject focussed School Direct ITT course in the North of England and is based at Churchill Community College in North Tyneside. We specialise in training Art, Craft and Design teachers, which means the training you receive on this course is bespoke to the subject. The course was previously known as the Secondary Education: Art, Craft and Design PGCE at Northumbria University and it offers you the opportunity to gain a PGCE qualification in Secondary Art, Craft and Design Education with Qualified Teacher Status. \r\n\r\nWe have a wide range of partnership schools across Primary, Middle and Secondary School phases throughout the whole of the North East, ensuring our trainees have high quality school placements with compassionate and expert mentoring. You will also have an  opportunity to teach in a second subject, which will give you that career edge. \r\n\r\nThis course will prepare you to become a highly effective practitioner, able to make a significant contribution to education and equipped to teach secondary pupils across the range of Art, Crafts and Design specialisms. \r\n\r\nWe work closely with a wide range of museums, galleries, artists groups and Teacher networks and, thanks to our exclusive partnership with the BALTIC Centre for Contemporary Art, you’ll also take part in artist workshops and have access to BALTIC’s extensive library and archive as well as the Library, Student Resources and Support Services through Northumbria University.\r\n\r\nYou will learn through a combination of University-based and school-based opportunities that aim to underpin professional learning with academic knowledge and critical understanding. Lectures, seminars, tutorials and workshops will provide you with opportunities to reflect on your school-based experience and develop an appreciation of the importance of integrating practical applications and formal theory.\r\n\r\nYour learning will be situated in a distinct ‘community of practice’ which will enable you to develop the personal, professional and transferable skills associated with outstanding newly qualified teachers. The expertise and experience of University and school based tutors and highly experienced school-based mentors will ensure your learning is grounded in current best practice. In addition to tutor-led sessions you will be directed and supported in your individual study as you seek to develop a critical and well-informed understanding of the nature of Arts education in contemporary society.  This combination of theory and school-based observation and practice will have a significant impact on your effectiveness in the classroom.\r\n","interviewProcess":"If your application is successful we will call you for an interview. \r\n\r\nAll candidates will deliver a portfolio presentation on their work, explaining their development as an artist and how their knowledge, skills and understanding can be used to inspire young people in the classroom. You will also plan a lesson and explain how it would be delivered to a group of students. We will also look at your personal characteristics including flexibility, organisation, independence, resilience and your interpersonal skills.\r\n\r\nCandidates will also be formally interviewed. Information collated from the portfolio presentation, planning session and the application form, including references will be utilised to support the interview. The interview panel will consist of a number of staff from Northumbria University and the Art, Craft and Design Partnership. This will allow us to talk further and discuss your subject knowledge, reflection of any prior experience in a secondary school, your knowledge of issues linked to secondary education and your commitment to a career in teaching.\r\n","howSchoolPlacementsWork":"You will spend a minimum of 120 days, which will be the majority of your time, in two contrasting secondary school placements. They will be carefully matched to your individual academic and professional requirements, making sure you get great opportunities based on your needs. \r\n\r\nPlacements will run from Monday to Thursday from September through to May. Friday sessions will take place at either the Northumbria University campus, Churchill Community College or at other educational establishments, museums, galleries, studios and workshops. All locations are central to the Newcastle area and provide trainees with a wide and varied experience of Arts education throughout the North East.\r\n\r\nOn top of that, you’ll be able to tap into our well-established network of subject-specialist, dedicated link tutors - all experienced leaders and practitioners in arts education in secondary schools. They will ensure you make the best possible progress and are well prepared for your transition into teaching.\r\n\r\nYour school experience will be made up of a combination of assessed and non-assessed experience. The non-assessed opportunities will broaden your understanding of effective teaching and learning through observation of outstanding practice, visits to other schools and settings. During the assessed periods, which will take place in both your school placements, you will apply what you have learnt to your teaching. You will learn through a combination of informal and formal feedback from your school-based mentor, which will indicate your strengths and set targets for your professional development. You will be expected to contribute to professional dialogue with your mentor and be proactive in seeking opportunities to deepen your understanding.\r\n","personalQualities":"We are looking for dynamic, committed and ambitious trainees with a passion for Art and teaching and learning. You must have a desire to inspire young people and an ability to share and communicate your enthusiasm for the subject. We would expect you to be well-organised, hard-working, empathetic, approachable and resilient. You need to be willing to evaluate your practice and be able to respond to feedback given. ","otherRequirements":"It is desirable that you will have experience of working with children in either a paid or voluntary capacity. It would be advantageous if you have had some school experience.","status":1,"createdAt":"2021-07-06T10:51:39.995Z","updatedAt":"2021-09-14T10:08:59.991Z","canSponsorStudentVisa":"yes","cycle":"2024"}
