{"id":"631f9d64-1534-46c5-aac3-ba1b612cbb9d","name":"Primary","code":"X100","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"e9a0017c-30b5-4fdb-94bd-13671aa035cc","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"e843cb68-d310-478c-8dba-cf9633fea086","code":"C55","name":"University of Chester"},"profPost":"PG","degreeGrade":"0","english":"3","maths":"3","science":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"Please note, pending equivalency tests will not be accepted.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Teaching is an extremely rewarding and challenging career. Our course is designed to provide you with the knowledge, understanding and skills that you need to be an outstanding teacher.\r\n\r\nWhile we may be one of the oldest higher education institutions in the UK, we’re also a modern and innovative institution, with a well-deserved reputation for the quality of our education. The Faculty of Education and Children’s Services has been awarded 'Outstanding' status by Ofsted, credited with delivering \"high levels of academic and pastoral care\" - Ofsted Report 2016.\r\n\r\nThe University of Chester Partnership has a rich history of developing highly skilled, knowledgeable teachers, and has a high employability rate. Our Partnership has learning at its heart, combined with passion and enthusiasm for teaching and learning.\r\n\r\nWe offer two routes: the Core (University-led) Route, and the School Direct Route.\r\n\r\nWe will provide you with the support you need to become a critically reflective evidence-based practitioner through a combination of academic challenge and school learning. Strong pastoral care is a key aspect of ensuring your success on this demanding but fulfilling course.\r\n\r\nIn essence, the course will start you on your professional journey as a teacher. We aim to provide high-quality education and training, and modules will provide you with:\r\n\r\n* critical understanding of pedagogy, assessment and curriculum\r\n* critical knowledge, understanding and skills in specialist age phases and subjects\r\n* critical knowledge and understanding of wider professional issues, e.g. behaviour management and inclusive practice\r\n* enrichment opportunities\r\n* at least 120 days of school-based learning.\r\n\r\nProfessional and academic learning takes place within University and partnership settings in lectures, seminars, practical workshops and tutorials, and is assessed through assignments and directed activities.\r\n\r\nSchool-based learning will move you from observation through group work to whole class teaching, and is assessed holistically against the Teachers’ Standards at the end of the period of training.  \r\n\r\nYou will be expected to undertake 10 independent preparation and consolidation study hours (minimum) per week for the University course, in addition to full teaching days when on placement.","interviewProcess":"\r\n","howSchoolPlacementsWork":"We have approximately 500 schools that we partner with. The schools you will be teaching in are selected on the basis of their ability to offer:\r\n\r\n* good support to trainee teachers; and\r\n* an Ofsted report that shows 'Good' teaching is in place.\r\n\r\nThe age range you will be teaching will be 3 to 11 years old.\r\n\r\nYou will have a minimum of two mainstream placements, as well as additional enrichment placements.\r\n\r\nYour travel from home to your school will take no more (and usually less) than 1 hour 15 minutes.","personalQualities":"","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:51:07.143Z","updatedAt":"2021-09-15T09:38:07.577Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
