{"id":"687f7f31-1cae-44b5-ab18-e0840e47ece9","name":"History","code":"A709","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"5a3609a0-5bbb-4377-b919-5d89932ab622","code":"V1","name":"History"}],"locations":[{"id":"5bde5e35-e2e7-4e46-a244-11230aaeaf3e","name":"Enfield County School for Girls","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"a9c0a160-53e7-4405-aa7e-db0acdadfd49","code":"2CX","name":"Southgate Learning Alliance"},"accreditedBody":{"id":"9188f17a-79c4-43a9-b459-4952815b739a","code":"M80","name":"Middlesex University"},"degreeGrade":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We accept equivalency tests from www.equivalencytesting.com and www.astarequivalency.co.uk.","courseLength":"OneYear","feesUK":9250,"financialSupport":"At Middlesex, we understand that many of our students may experience financial difficulties. We offer our students a wide variety of additional financial support options to help them fund or part-fund their education.\r\n\r\nFor further information, see;\r\n\r\n(www.mdx.ac.uk)\r\n","aboutCourse":"This History course gives you a strong understanding of how and why to teach history in secondary schools whilst also enabling you to appreciate the unique aspects of other subject specialisms in order to develop your confidence in teaching across the suite of humanities subjects. Middlesex University also has dedicated subject tutors who have established strong relations with external specialists and partnership schools who will deliver contemporary and subject specific training sessions.\r\n\r\nAs a school-led route the great majority of your time will be spent in your training school, and the content and focus of many aspects of the training programme will be targeted to meet your individual needs, by utilising the resources of the school and their alliance partners. In addition, at Middlesex you will also benefit from access to the University's extensive resources, including those provided by the library and student support services.\r\n\r\nThe Middlesex School Direct programme provides you with a series of subject enhancement sessions, and a programme of professional studies which will be run at the University. These may include sessions which:\r\n\r\n*Allow you to visit a variety of partnership schools and non-formal educational sites to enhance learning in specialist areas.\r\n\r\n*Provide you with opportunities to enhance your knowledge and pedagogy of your subject, or specialist areas of the curriculum.\r\n\r\n*Develop your understanding of key contemporary issues within education, such as those around inclusion or EAL and SEND provision in schools.","interviewProcess":"You will need to attend an interview, which should take place within the school you will be training to teach.\r\n\r\nAt the interview stage, your suitability for teaching will be assessed including your subject knowledge for teaching and competency in the fundamental skills of English and Maths. If any shortfall is identified, you may be required to complete some additional work to secure the appropriate level of competency before being accepted on the programme.\r\n\r\nDuring the programme, your competency in these areas will be assessed and developed to ensure you reach the required level.\r\n","howSchoolPlacementsWork":"School Direct Tuition trainees will have timetabled lessons where they will be supporting the classroom teacher from the start of term.\r\n\r\nThe course is full time over 38 weeks (term time only). Trainees will receive an immersive training programme where they are working alongside outstanding teachers with current and relevant experience.\r\n\r\nTrainees will be placed in one school for the entire academic year with a 6 week second placement at a contrasting partner school arranged by the SLA.\r\n\r\nAll partner schools have experienced subject mentors and professional tutors who are committed to high expectations .\r\n\r\nTrainees will be awarded Secondary QTS (11-16) however, all partner schools ensure trainees have the opportunity to teach A-Level classes in preparation for their ECT year.\r\n\r\nProfessional studies training sessions will be held at Middlesex University (Scheduled dates will be provided prior to the commencement of the programme). During all other times trainees will be at their base school .\r\n","status":1,"createdAt":"2021-09-23T12:52:09.262Z","updatedAt":"2021-09-23T13:27:13.957Z","canSponsorStudentVisa":"no","cycle":"2024"}
