{"id":"f2591b52-818c-4ffd-b6a9-7aaa5eac8957","name":"Chemistry","code":"3CRV","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"912d4fb4-761b-42e9-8dc6-e968b791ea4e","code":"F1","name":"Chemistry"}],"locations":[{"id":"77417998-7ab3-44d0-b8f7-9950ccbfdfa8","name":"JCoSS","isPublished":"Y","status":"R","vacancies":"F"},{"id":"f7f6a6da-e113-4a17-9687-adb7b2a1dbc2","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"a9c0a160-53e7-4405-aa7e-db0acdadfd49","code":"2CX","name":"Southgate Learning Alliance"},"accreditedBody":{"id":"657a85c5-8835-405a-99f7-6c45e87f77bc","code":"1X7","name":"Compton SCITT"},"profPost":"BO","degreeGrade":"1","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"The Compton SCITT will accept equivalency tests from accredited providers. Please contact The Compton SCITT for further guidance if you are required to take an equivalency test.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Our Chemistry course is entirely school centred providing classroom based, practical training, underpinned by a weekly educational studies programme leading to Qualified Teacher Status (QTS). Trainees may opt in to gaining a Postgraduate Certificate in Education (PGCE). The course is full time over 38 weeks (term time only). Trainees will receive an immersive training programme where they are working alongside outstanding teachers with current and relevant experience.\r\n\r\nTrainees receive structured classroom observations, weekly professional studies sessions and a phased introduction to small group teaching, team teaching and then whole class teaching.\r\n\r\nThe Compton SCITT was graded by Ofsted as an Outstanding Teaching School (2018).\r\n\r\nTrainees will be assessed across the academic year against the Teachers' Standards within a supportive and developmental model. Experienced subject mentors facilitate bespoke weekly targets to ensure all Teachers' Standards are met by the end of the course. Each year, 100% of our trainees have achieved a Good or Outstanding Ofsted grading by the end of the course.\r\n\r\nThere are 4 assignments set over the training year. These are research based learning tasks embedded in the realities of the modern classroom. Current academic research and reading underpin all professional studies sessions and assignments.\r\n\r\nThe Compton SCITT Partnership is committed to the wellbeing of trainee teachers. We are aware that an ITT year will be demanding and therefore have a variety of mechanisms in place including a designated pastoral lead. \"Somehow you’ve struck a happy medium between the checkbox requirements of government legislation and the true humanity that underpins teaching.\" (Outstanding English trainee, 2017).","interviewProcess":"Applicants will be invited for interview on the basis of information provided on their application form. Candidates will be interviewed at the school selected on their UCAS application.\r\n\r\nThe interview will typically involve a half-day at the school. This will include a 20 minute lesson observation and a 15 minute written task. Candidates will be told in advance about the content of the lesson and the age range you will be teaching.\r\n\r\nCandidates will be observed teaching by a member of senior staff and a subject specialist. If successful in the first part of the interview candidates will then be invited to the final panel interview.\r\n\r\nNumeracy and literacy skills will be assessed at interview. The interview process is rigorous and thorough, designed to get the best match of applicant to the places available.\r\n","howSchoolPlacementsWork":"School Direct Tuition trainees will have timetabled lessons where they will be supporting classroom teaching from the start of term.\r\n\r\nThe course is full time over 38 weeks (term time only). Trainees will receive an immersive training programme where they are working alongside outstanding teachers with current and relevant experience.\r\n\r\nTrainees will be placed in one school for the entire academic year with a 6 week second placement at a contrasting partner school arranged by the SCITT Leadership Team.\r\n\r\nAll partner schools are graded either Good or Outstanding by Ofsted. Partner schools are based locally to The Compton School in North London and are easily accessible by public transport. All partner schools have experienced subject mentors and professional tutors who are committed to high expectations of the SCITT Partnership. Compton SCITT trainees enjoy being part of a vibrant professional community across all partnership schools.\r\n\r\nTrainees will be awarded Secondary QTS (11-16) however, all partner schools ensure trainees have the opportunity to teach A-Level classes in preparation for their ECT year.\r\n\r\nWeekly professional studies training sessions will be held at The Compton School on a Monday with trainees at their base school from Tuesday-Friday.","personalQualities":"Applicants must provide evidence of an interest in working with young people, possess high quality communication skills. Speak fluently, clearly and grammatically. Be able to think analytically and possess personal qualities such as warmth, enthusiasm, self-motivation and resilience.","otherRequirements":"As School Direct Tuition trainees will be supporting the classroom teaching from the start the of the course.\r\n\r\nApplicants given a conditional offer will be subject to completing a DBS prior to the commencement of the programme.\r\n","status":1,"createdAt":"2021-07-06T10:46:56.737Z","updatedAt":"2021-09-23T13:22:18.830Z","canSponsorStudentVisa":"no","cycle":"2024"}
