{"id":"f4276b51-0c3b-472d-bb70-3da7b726a3d7","name":"Primary","code":"AW50","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"e6291ea4-1ac3-42f0-9e40-fab37edebefb","name":"Henhurst Ridge Primary Academy","isPublished":"N","status":"N","vacancies":"F"},{"id":"880f660f-f18d-432b-b1d8-9b194c132469","name":"Silkmore Primary Academy","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"0ba05412-60ea-4e5e-976e-5f03443cb233","code":"1QU","name":"REAch Teach Primary Partnership"},"accreditedBody":{"id":"aa023df3-b71e-4249-b9c4-41fca8bd135e","code":"D39","name":"University of Derby"},"english":"3","maths":"3","science":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","aboutCourse":"School Direct is a school-led initial teacher training pathway that offers practical, ‘on-the-job’ training and teacher education. The programme aims to create highly qualified, highly skilled teachers, who are an integral part of a school community, with the expectation that successful trainees are employed within the alliance of schools they have trained in on completion of the programme. \r\n\r\nYou don't need to worry about being thrown in at the deep-end on our programme. Within your placement schools, you will be supported by an outstanding and well-trained classroom mentor and a member of the school’s Senior Leadership Team, in partnership with an experienced professional tutor from our University partner, The University of Derby. Alongside our committed ETSA training team, you will be supported every step of your journey to reach the professional standards of teaching and gain Qualified Teacher Status alongside your PGCE qualification. Your timetable and teaching responsibility will increase as you gain in confidence and skill. \r\n\r\nYour training will be delivered by experienced teachers within the school and complemented by training by expert educators at the University of Derby, ranked 'outstanding' by Ofsted. By being part of our cohort of ETSA trainees, you will also develop a strong professional support network with other School Direct trainees, who understand and share the School Direct teacher training experience alongside you.\r\n\r\nCore modules focus on pedagogy and its practical implications and include \r\n•Professional Practice and Pedagogy \r\n•Theories of Learning and Teaching: The Pupil as Learner\r\n•Developing Teacher Enquiry: Research Informed Practice \r\n\r\nAll assessments relate to your school placements; you will complete three assessed teaching placements, two in your main school and one in a second school, and additional enhanced school opportunities, which will provide you with the challenging and exciting experience you need. There will be in-depth teacher enquiry on school-based issues. Over the year, you will need to gather evidence that you successfully meet all of the Teachers' Standards (https://www.gov.uk/government/publications/teachers-standards)\r\n\r\nSuccessful completion of the course leads to the award of Postgraduate Certificate of Education (PGCE) which includes recommendation for Qualified Teacher Status (QTS).  You will also have the opportunity to gain 60 Masters level credits, University of Derby, or elsewhere.\r\n\r\nYou can tailor your studies to match your own interests and career plans. Depending on your preference and any prior experience, you can choose to specialise in teaching Early Years (3–7 year olds), Primary (5–11 year olds), or SEND.","interviewProcess":"Interviews will take place in one of our partnership schools. You are usually interviewed by headteachers from our school partnership and link tutors from the University. During the interview process we would observe you interacting with a group of children, conduct numeracy and literacy tasks and conduct a formal interview where we would ask you to complete a presentation . We aim for our interview process to be as relaxing as possible so that you can feel comfortable and show us your true potential. \r\n\r\n\r\n\r\n","howSchoolPlacementsWork":"As part of the course, you will undertake three assessed teaching placements in good schools to broaden your experience. You will be supported throughout by our ‘outstanding’ trained school mentors and link University tutors.\r\n\r\nWe strongly encourage you to visit our schools. It is only through visiting that you can really get an idea about whether the school is the right place for you to train.Our schools are each unique yet they share our values of integrity, inclusion and success for all children, regardless of their background. Our  schools include rural, multi-cultural and inner city schools who are part of the REAch2 Academy Trust, the largest primary only academy trust in the country. Starting your teaching career with REAch2 brings with it unrivalled training and development and excellent career progression. To find out more visit www.reach2.org\r\n\r\nThe majority of candidates apply to us with a partnership school in mind, and name this school on their application. Where an applicant has not named a specific school, we take into account the distance a candidate will have to travel from home to school when placing candidates, as well as any preferences discussed during the interview process. Because we see School Direct training as a long-term investment in teachers, we feel it is important that candidates are training in an alliance of schools which is right for them. Our motto is train with us, stay with us!\r\n\r\n\r\n","personalQualities":"We are looking for applicants who understand the difference high quality education makes to children. We want to see passion and creativity, reflection and emotional intelligence, resilience and integrity. Candidates need to have an appreciation of how children learn and an awareness of how to engage them in the learning process. You should be confident, articulate and have a strong work ethic and sense of humour!","otherRequirements":"It is recommended that candidates gain at least 2 weeks' experience in a school prior to commencing the training programme. \r\n\r\nA Disclosure and Barring Service (DBS) check is required at the point of accepting a place at the University. The Disclosure and Barring Service was established when the Criminal Records Bureau (CRB) and Independent Safeguarding Authority (ISA) merged in 2012 and will now provide the criminal records checking service for this course.","status":2,"createdAt":"2021-07-06T10:48:16.562Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"ETSA School Direct Salaried trainees will be paid on the Unqualified Teacher pay scale. Pay varies depending on your placement school’s location but the following can be used as a guide to the starting salary you could earn whilst you train:\r\n\r\nScale:\r\n\r\nEngland and Wales (excluding London and fringe)\t\r\nMin\t£ 17,208\r\n\r\nInner London\t\r\nMin       £22,273\r\n\r\nOuter London\t\r\nMin      £  21,004\r\n\r\nFringe London\r\nMin\t£   18,844\r\n\r\nOnce qualified, your starting salary will be between £24,373 - £30,480 depending on the location of your school. This is based on 2019-20 pay scales. Please note that pay scales are revised annually. \r\n\r\nAdditional rewards\r\n\r\nIn addition to the basic salary you’ll earn, there are other great benefits available including:\r\n\r\n•\tholidays – you’ll get more days than many people in other professions, though teachers work for 195 days per year in school, and tend to do some work during their holidays\r\n\r\n•\ta generous pension – when you’re employed as a teacher you’ll automatically be a member of the Teachers’ Pension Scheme\r\n\r\n•\tspecial educational needs (SEN) allowance – if you work as a qualified teacher with pupils with SEN, you could be eligible for an SEN allowance of no less than £2,106 and no more than £4,158 per annum\r\n\r\n•\tteaching and learning responsibility (TLR) payments – additional money if you take on more responsibilities ranging from £2,667 to £13,027 depending on the type of duties.\r\n\r\n\r\n"}
