{"id":"e169b318-14b8-47cc-9035-264f6cec49e6","name":"Primary","code":"2CXG","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"e965b069-86a5-4e6b-bf91-ae9c19c640d9","name":"Teach North West @ Teach East Manchester Hub","isPublished":"Y","status":"R","vacancies":"F"},{"id":"2bbcc61a-c4a3-4933-94f1-a5d2fb2d94ca","name":"Teach North West @ Teach Bolton Hub","isPublished":"Y","status":"R","vacancies":"F"},{"id":"3d1be7a9-327d-41c2-b3cc-ed9babc6d256","name":"Teach North West @ Teach Merseyside Hub","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"2644c20c-18f3-4199-924a-4ebbfc98bb6a","code":"14T","name":"Teach North West, SS Simon and Jude Alliance"},"accreditedBody":{"id":"9be9f611-2d36-431a-9109-7fcbbfc88fc8","code":"C99","name":"University of Cumbria"},"profPost":"BO","degreeGrade":"9","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"The University of Cumbria does not offer equivalency tests; however, we accept the following:\n\nEdge Hill - https://www.edgehill.ac.uk/study/equivalency/\n\nEquivalency Testing - https://www.equivalencytesting.com/\n\nA Star equivalency  - https://astarequivalency.co.uk/","courseLength":"OneYear","feesUK":9250,"feesInternational":12800,"financialSupport":"Most students choose to take out a student loan. If you are taking a student loan the Student Loan Company will pay your fees directly to the university. For more information, please see the Student Loans section.\r\n\r\nIf you decide not to take a student loan, you can pay your tuition fees online, directly to the University of Cumbria. You can pay in full or spread out the cost through a maximum of three instalments. \r\n\r\nTo discuss instalments, email us at accountsreceivableteam@cumbria.ac.uk.\r\n\r\nTuition fee invoices are sent electronically to student's university and personal email accounts.","aboutCourse":"At Teach North West, we create a programme tailored to suit your learning journey. We carefully build a picture of your strengths and passions from our first meeting and work with you to increase your confidence, hone your skills and, ultimately, achieve your full potential.\r\n\r\nOur programme is well established across the North West, across three location hubs - Merseyside, East Manchester and Bolton. Some of our partner schools are part of wider multi-academy trusts and teaching schools – giving you a variety of professional networks to tap into from your first day with us.\r\n\r\nDuring an average week, you’ll spend half the days gaining experience in the classroom, getting involved with and observing group work and lessons. University lecturers and specialist subject teachers share their expertise during training days in the other half of the week, where you are taught alongside your cohort in the lead school at each hub or online. \r\n\r\nYou will complete two summative assessments (3,500 word essays) over the year and you will have the option to take these credits forward into a full Masters degree after the programme is complete.\r\n\r\nWe pride ourselves on offering our trainees nurture and support right from their interview and each year provide additional experiences, which focus on developing skills that will further build your confidence in the classroom. All our trainees take part in termly well-being sessions delivered by experts, get to know each other on our activity induction day, have the chance to meet our graduating cohort to ask questions and listen to their experiences at our welcome afternoon, and so much more...\r\n\r\n\r\nOur past students say:\r\n'The support was second to none. Teach Bolton fully equipped me with the knowledge and skills I needed in order to progress with my career. \r\nI felt confident walking into my first classroom, ready to teach my own class.'\r\nTrainee 2020 - now employed in one of our alliance schools.\r\n\r\n'I benefited from training in outstanding schools; the support from the staff  and the close knit relationships with peers from the course means you never feel alone.' \r\nTrainee 2016 - now employed in our partner trust, Vantage Academies.\r\n\r\n'The tutors were all extremely helpful and provided fantastic out-of-classroom training too... I felt so prepared and excited to teach, a feeling I hadn’t had from my previous course.'\r\nTrainee 2019 - now employed in our partner trust, Forward as One.","interviewProcess":"We want to provide an interview environment in which you can shine, to help you to decide that we are the right fit and provide a welcoming experience for you to feel confident in expressing yourself and take the most away from the day. \r\n\r\nFirst and foremost, we are looking for teaching potential in our applicants. \r\n\r\nWe assess applications based on qualifications and child-centred work experience but, most importantly, we are looking for evidence of a candidate's work ethic, interest in education and passion for working with children. \r\n\r\nWe conduct interviews online and at assessment mornings.\r\n\r\nA typical interview will include a mini-teach to a group of children, a group speaking and listening assessment or lesson observation, an individual ‘getting to know you’ interview with course leaders and a basic maths and English assessment. \r\n\r\nWe always give feedback on our decision and request feedback from candidate's to continually improve the experience that we offer. ","howSchoolPlacementsWork":"You will be a valued member of the staff team in all of your school placements, and be encouraged to integrate fully into school life. \r\n\r\nWhen not on assessed placement, your time will be spent in a mixture of school experience days  at your local 'home school' and training days. \r\n\r\nEach term, you will have an assessed placement period, where you remain in your home school, but work all 5 days a week class, for a period of 6-9 weeks, depending on the term. \r\n\r\nOver the year, you will take on an increasing  percentage of teaching time. Beginning from teaching small groups and then your first lesson, this will build up to teaching the majority of the whole class timetable by the end of the academic year. \r\n\r\nYour school Mentor will be there to support you every step of the way, through weekly meetings about your progress and informal check-ins, they will work with your hub's Lead Mentor to ensure that you are learning at your own pace and gradually building your confidence. \r\n\r\nYou will be placed in your first school from September to December, where you will initially work for around half the week (the other half will be spent in training, which will always take place locally/online) and then move into the full placement period, where you spend every day in school, for six weeks from the end of October.\r\n\r\nOver the year, you’ll spend time in a minimum of two different schools, gaining experience in KS1 and KS2 (across ages 5-11), building positive relationships with staff and pupils. \r\n\r\nYou will be in the same school for both your classroom experience days and your placement periods and will move to a different school after Christmas, in a new Key Stage. \r\n\r\nThis new school and year group will be chosen for you based on what will best suit your development journey and will reflect what we have learned about you - your passions, skills and development needs, from the autumn placement. We will always match your placements to you so that you can maximise your learning experience.","personalQualities":"We have the highest standards for our initial teacher training course and expect our trainees to demonstrate their commitment to the course from their interview, through to graduation.\r\n\r\nWe seek applications from candidates who:\r\n. Are passionate about educating children to increase their life chances and opportunities\r\n. Are good listeners who enjoy working collaboratively\r\n. Understand how to learn from their mistakes\r\n. Are ambitious and resilient in their drive to succeed\r\n. Take pride in their unique vocation\r\n. Demonstrate a strong work ethic and professionalism ","otherRequirements":"An Enhanced DBS (Disclosure and Barring Service) check will be carried out on all successful applicants before starting the course.\r\n\r\nSchool experience is not essential to apply for one of our courses; however, at interview we are looking for evidence of your potential to teach, through your knowledge, skills and passion, as well as the delivery of your mini-teach.\r\n\r\nIf you would like to prepare thoroughly, we would encourage you to call our course contacts to arrange getting classroom experience in one of our alliance schools, or take a look at the Get into Teaching website for more information.","status":1,"createdAt":"2021-07-06T10:53:07.489Z","updatedAt":"2021-07-29T11:58:48.922Z","canSponsorStudentVisa":"yes","cycle":"2024"}
