{"id":"56a37cd8-8b34-4951-bdff-104b0abdc142","name":"Further education","code":"Z493","qualification":"pgce","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"B","subjectLevel":"further_education","isSend":"no","subjects":[{"id":"9de4b2d2-5739-4c34-92d2-9b4384760298","code":"41","name":"Further education"}],"locations":[{"id":"78ec6c54-ee36-4626-85f8-7656fb733260","name":"Main Site","isPublished":"Y","status":"R","vacancies":"B"}],"trainingProvider":{"id":"f03c9777-978d-4904-9fac-5870cc456cac","code":"L43","name":"City of Liverpool College"},"profPost":"PG","degreeGrade":"9","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"You will usually require a minimum level 3 qualification (e.g. A-level, Access to HE Diploma, Advanced GNVQ, etc.) in the subject you are intending to teach.","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We will consider candidates with level 2 or equivalent qualifications in English and maths.","courseLength":"TwoYears","feesUK":8410,"feeDetails":"You may be able to apply for a tuition fee loan or maintenance loan as part of your application to Student Finance. \r\n\r\nYou don’t have to pay the loan back while you study. It will only be repayable when you have left the course and earn over a specified amount. \r\n\r\nThe course involves spending two separate days at a conference at the University of Huddersfield. You will need to fund your own transport there. \r\n\r\n","financialSupport":"The College offers a small number of Higher Education bursaries for eligible students. \r\n\r\nStudent eligibility criteria:  \r\n•\thas a household income up to £25,000\r\n•\t(full-time students) Special Support Element of the Maintenance Loan; Parents’ Learning Allowance; Childcare Grant; Disabled Students’ Allowance;\r\n•\t (part-time students) is in receipt of the following grants/ welfare benefits: Disabled Students’ Allowance; Jobseeker’s Allowance; Income Support; Employment and Support Allowance; Carer’s Allowance;\r\n\r\nStudents who are care leavers will be eligible for a College Bursary regardless of household income if they meet the eligibility criteria:\r\n•\tUK Home student\r\n•\tCare Leaver –defined as in care for at least 13 weeks, spanning their 16th birthday.\r\n•\tUnder 25 on the first day of the academic year they started the current course of study\r\n\r\nA small income-assessed HE hardship fund is also available to offer support to students who are experiencing severe financial hardship.  \r\n\r\nFor further information, you can contact: askann@liv-coll.ac.uk\r\n\r\n\r\n","aboutCourse":"If you want to teach young people or adults in setting such as sixth forms, further education colleges or community education then this course is ideal for you. The course helps you to develop your teaching skills, reflect on current ideas about education and training, and to creatively explore the professional opportunities open to you. You will gain competence in planning, teaching and learning, and in working with students.\r\n\r\nThe course can be taken as a one-year full-time or two-years part-time modular programme. It is assessed through written assignments, presentations, portfolios and practical assessment of teaching. The course is structured around modules which are based on different aspects of teachers’ work, such as designing learning materials, assessing students, and evaluating learning and teaching.\r\n\r\nThe four core modules that you will study are:\r\n- Research Informed Teaching, Learning and Assessment\r\n- Becoming a Subject Specialist Teacher\r\n- Being a Subject Specialist Teacher\r\n- Policy and Professional Issues\r\n\r\nThe course is validated by the University of Huddersfield and leads to a University of Huddersfield award. \r\n\r\nUpon successful completion of this course, you’ll be eligible to proceed, following a process of professional formation, through the Society for Education and Training to gain Qualified Teacher Learning and Skills (QTLS) status. This is the full professional status for teachers in the Lifelong Learning Sector.\r\n","interviewProcess":"You will be shortlisted for interview based on your application. You’ll normally be interviewed by a specialist tutor from the programme. This is usually a one-to-one interview lasting up to one hour. \r\n\r\nYou may be required to complete a written task.\r\n\r\nAdjustments can be made to the interview process to ensure equality of opportunity. ","howSchoolPlacementsWork":"As well as studying at the College, you’ll learn the practical skills of teaching through a placement. \r\n\r\nUsually, placements are undertaken at the the College and trainees have the opportunity to work across a range of levels and groups.\r\n\r\nYou’ll complete at least 100 hours of teaching practice on placement. Alongside this you will take part in wider activities to support your development as a teacher, for example open events, parents' evenings, staff development.\r\n\r\nYour placement will be undertaken in your subject specialism. In addition to your subject specialism, you may be required to embed core subjects including English, maths, Digital Literacies and SEND into your teaching and learning.\r\n\r\nIf you are currently working as a teacher or tutor in the sector and are interested in taking the course alongside your current role, we may be able to assess you in your workplace. ","personalQualities":"You’ll be required to demonstrate your commitment to teaching in the Further Education sector both in your application and during your interview.\r\n\r\nWe’re committed to promoting equality of opportunity for all regardless of age, gender, ethnicity, disability and sexual orientation. We aim to ensure that course participants are representative of the diverse society in which we live.","otherRequirements":"In addition you must also:\r\n\r\n- undertake a satisfactory Disclosure and Barring Service (DBS) check and health clearances\r\n- provide two satisfactory references\r\n- complete a satisfactory interview\r\n- have some relevant experience of teaching or training in the Further Education/Lifelong Learning sector ","status":1,"createdAt":"2021-07-06T10:53:51.308Z","updatedAt":"2021-08-02T15:11:45.769Z","canSponsorStudentVisa":"no"}
