{"id":"a124c824-6089-4ca8-b266-ed49f5057b48","name":"Primary","code":"36G8","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"9d85cca2-11be-4a33-bec4-01a66641dbf4","name":"Main Site","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"93a46200-d7b3-4314-9097-00e4955fd0d4","code":"2FC","name":"St Bede’s Deanery Teaching Alliance"},"accreditedBody":{"id":"19a3446e-382d-4c14-83bb-a76563cef3c1","code":"L24","name":"Leeds Trinity University"},"profPost":"PG","english":"1","maths":"1","science":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Our Primary PGCE is a one-year, full-time course which runs from September - July. The course is Sunderland based and although we are affiliated to Leeds Trinity University students ARE NOT expected to travel to Leeds. Whilst we are a Catholic partnership there is no requirement for students to be Catholic. The course is structured into three stages which will gradually build the confidence and knowledge you'll need to become an outstanding teacher. Each stage consists of a university-based training block and school-based training block. Students will spend 4 days a week in school and 1 day per week training with St. Cuthbert's\r\n\r\nSTAGE 1: Introduction to Teaching (September to November)\r\nFive weeks' university-based training.\r\nMinimum of three weekly Serial Visit Days at your first placement school.\r\nSix weeks' school-based training\r\n\r\nSTAGE 2: Developing your Knowledge (November to March)\r\nTwo weeks' university-based training.\r\nOne week preparation time in your second placement school.\r\nNine weeks' school-based training.\r\n\r\nSTAGE 3: Preparing for your Teaching Career (March to June)\r\nOne week of university-based training.\r\nNine weeks' school-based training.\r\nTwo weeks' enhanced placement.\r\n\r\nEvery school-based training block (also known as your placement) will be full-time, during which you'll gradually build up the amount of time you spend teaching. By the end of stage three, you'll be teaching for 70% of your placement.\r\n\r\nYou will be guaranteed  school placements at each stage- organised for you, on your behalf.  You'll have a one-to-one meeting with a member of the team to make sure you're prepared and ready.\r\n\r\nThroughout your placements, you'll have the support of a mentor based at each of your schools. This mentor is trained by Leeds Trinity to support you as you complete your school-based training, as well as to assess your progress against the Teachers' standards.\r\n\r\nYou'll also have a Development and Link Tutor at Leeds Trinity, who will visit you at school. Their role is to provide quality assurance for your training, as well as to offer any support and advice you may need. \r\n","interviewProcess":"Once you have applied for our training course there will be a shortlisting process of which you will be notified if you are successful. \r\n\r\nYou will be invited for an individual interview in school with the leaders of our course. We will provide you with a detailed plan of the day so you are prepared for the tasks and interview which will take place on the day. \r\n\r\nOne of the tasks you will undertake is a lesson observation with a group of children using a book of your own choosing as the theme of the session. \r\n\r\nYou will also undertake a written task based on your tour of the school.","howSchoolPlacementsWork":"St Cuthbert's RC Primary School is the lead school for St Bede's Deanery Alliance.\r\n\r\nThe schools within our alliance are, St. Cuthbert's, St John Bosco, St Joseph's, St Leonard's, St Patrick's, English Martyrs', St Benet's, St Mary's and St Anne's which are all in the area of the city of Sunderland.\r\n\r\nOn our 5-11 age range course you will train in at least two good & outstanding schools within our alliance over the course of the academic year. We will arrange these placements on your behalf to ensure you gain the valuable experience you will need to succeed in the classroom. The placements are organised for you and you do not have to worry about sourcing these yourself. We will ensure that your placements are in different key stages and that you gain experience in contrasting school settings- ensuring that your skill set is as wide as possible to give you the competitive edge in the job market.\r\n\r\nOn gaining a place on our course we will carefully match you with your placement schools taking into account your experience and personal preferences. \r\n","personalQualities":"","otherRequirements":"","status":2,"createdAt":"2021-07-06T10:52:31.937Z","canSponsorStudentVisa":"yes","cycle":"2024"}
