{"id":"0a06052d-0c49-401e-b148-1fc977424351","name":"Primary With Mathematics","code":"3BQK","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"286cf12f-b3e3-41c5-9f33-2ff7807d2df0","code":"03","name":"Primary with mathematics"}],"locations":[{"id":"12a5c21b-865c-4a2c-9370-f736819baf12","name":"The Maltings","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"fbb4540f-1243-4300-9df9-6f0e716b7b21","code":"1YF","name":"Trinity Institute of Education"},"accreditedBody":{"id":"791f82c8-19fd-4339-9c7b-301dee8067ce","code":"H60","name":"University of Huddersfield"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We accept equivalency tests from equivalencytesting.com\nYou can also contact them on 01277 203336.\nYou have the option of a course or test only.","courseLength":"OneYear","feesUK":9250,"feeDetails":"A School Direct place costs £9,250 and is payable in 3 instalments across the academic year. Payments are made directly to Huddersfield University. Non-salaried applicants can make an application for a Student Loan to cover the cost of tuition fees and living expenses where necessary.","aboutCourse":"Our School Direct programme allows you to qualify as a primary teacher within one year, with a specialism in Primary Maths. You will gain a PGCE, QTS and 60 Masters credits. It is school-led, which means that the majority of your training is based in school. You will experience a full school year, and be immersed in daily life from September. In doing so, you will have the opportunity to experience teaching as it really is, whilst working alongside, and being mentored by, outstanding practitioners including specialist Maths practitioners from White Rose Maths and West Yorkshire Maths Hub. You'll develop your knowledge of National Curriculum subjects in the primary curriculum with a focus on teaching and learning in the Early Years, Key Stage 1 and Key Stage 2. \r\n\r\n\r\n\r\nCourse Structure\r\n\r\nThe course is a one year postgraduate certificate in primary education (3-11). You'll gain a comprehensive knowledge of the core subjects and the full breadth of the National Curriculum. You'll gain a deep understanding of key aspects of teaching including how children learn, behaviour management, assessment, and creative, innovative methods of teaching and learning. Working alongside expert practitioners from White Rose Maths, you'll develop a deep understanding of Primary Maths pedagogy and assessment, as well as develop a critical overview of current best practice of teaching and learning in Maths. \r\n\r\n\r\nTeaching and Assessment\r\n\r\nYour training will incorporate school based practice with weekly professional learning delivered by Huddersfield University and excellent practitioners from within the institute. Professional learning will take place in our well equipped primary training classroom at The Maltings in Halifax. At the training centre, you will work with a group of trainees, which will allow you time to collaborate, share good practice and engage in peer support. You will spend the majority of your training year in one school, but will also complete an alternative placement in a contrasting school, where you will have the opportunity to experience a different setting. \r\n\r\nOur School Direct programme offers the highest quality training in a supportive, rich learning environment. You'll learn in small, friendly and collaborative groups, designed to give you the confidence to succeed. \r\n\r\nAssessment is typically through the completion of a range of classroom activities, written assignments, reports, personal subject audits and the development of portfolios of evidence. ","interviewProcess":"The Trinity Institute of Education and Huddersfield University partnership have a rigorous recruitment and selection procedure. We select our trainee teachers not only against academic criteria, but also on their passion for teaching all learners, excellent subject knowledge and whether they have the aspiration and drive to be an outstanding and inspirational teacher in and out of the classroom. \r\nYou will be shortlisted for interview based on your application. The interview process typically lasts for a day. The following selection procedures are designed to assess your suitability for training to teach: \r\n- panel interview with members of the institute.\r\n- teach a 10 minute numeracy session to a class of children in one of our partnership schools. \r\n- complete a short Maths and English test to enable us to evaluate your skills. \r\nFrom this process we will see whether you have the passion, drive and skills to train to teach in one year. ","howSchoolPlacementsWork":"Our provision is growing, and we are now partnered with a wide range of schools across the region. You will spend the majority of your training year in one school, but will also complete a short alternative placement in a contrasting school where you will have the opportunity to further develop your teaching skills. In addition, you will gain experience working within schools with specialist provision, such as a special school or PRU, as well as within a secondary school. You will undertake your placements in two consecutive key stages; Early Years and Key Stage 1, or Key Stage 1 and Key Stage 2. During your first placement, you will work under the guidance of the class teacher to build your confidence and develop essential planning, teaching and behaviour management skills. As your placement progresses, you will begin to take more ownership of learning. Your second placement provides an alternate experience where you will further develop your classroom skills. It is an opportunity to challenge yourself within a contrasting setting and it allows you to build new networks. After Easter, you will return to Placement A, where you will consolidate your practice and build your teaching commitment, preparing yourself for progressing into your ECT year. \r\n \r\n\r\n","personalQualities":"- Enthusiasm and a genuine desire to inspire young people \r\n- A commitment to helping every child succeed \r\n- Excellent communication and inter-personal skills \r\n- Resilience and the willingness to receive and act on advice \r\n- A realistic understanding of the role of, and demands on, the primary school teacher \r\n- The ability to manage time effectively \r\n- Evidence of self-motivation in personal learning \r\n- A passion for Maths\r\n\r\nIf you have the drive and passion and want to make a difference to learners and their communities, we want to hear from you.","otherRequirements":"Disclosure and Barring Service and Medical\r\nOffers will be subject to satisfactory Disclosure and Barring Service enhanced disclosure check and trainees must not previously have been barred from teaching or working with children. We also ask you to complete a conduct a health declaration to ensure that you have the health and physical capacity to teach. \r\n\r\nExperience\r\nWe encourage you to spend some time gaining experience in a primary school to give you a greater insight into your career choice and help you decide whether teaching is right for you. Other areas of relevant experience may also support your application. \r\n","status":1,"createdAt":"2021-07-06T10:54:16.196Z","updatedAt":"2021-07-08T08:30:02.878Z","canSponsorStudentVisa":"no","cycle":"2024"}
