{"id":"f88f2587-c444-4aa0-bcf9-39acb4d81349","name":"Art and Design","code":"2QLB","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"d461a678-3335-4ca2-9616-1dc479d31a49","code":"W1","name":"Art and design"}],"locations":[{"id":"12a5c21b-865c-4a2c-9370-f736819baf12","name":"The Maltings","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"fbb4540f-1243-4300-9df9-6f0e716b7b21","code":"1YF","name":"Trinity Institute of Education"},"accreditedBody":{"id":"791f82c8-19fd-4339-9c7b-301dee8067ce","code":"H60","name":"University of Huddersfield"},"profPost":"BO","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"If your degree is not in your specialist subject, you must have an A-level/level 3 course in the subject to at least a grade C or equivalent.","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feeDetails":"A School Direct place costs £9,250 and is payable in 3 instalments across the academic year. Payments are made directly to Huddersfield University. Non-salaried applicants can make an application for a Student Loan to cover the cost of tuition fees and living expenses where necessary.","aboutCourse":"Our School Direct programme allows you to qualify as a teacher within one year. We have created a school led teacher training programme, with a commitment to ensure all trainees have the potential to be outstanding. You'll develop your subject specialist knowledge alongside hands-on classroom experience. In doing so, you will have the opportunity to experience teaching as it really is, whilst working alongside and being mentored by outstanding practitioners. \r\n\r\nThe course is a one year postgraduate certificate in secondary education with QTS and 60 Masters credits. The programme is divided into two main themes: \r\n\r\nDeveloping Art & Design Specialist Subject Knowledge:\r\nYou will have the opportunity to develop your subject teaching in a stimulating way, using different methodologies and new technologies to inspire and engage young people. We will help you develop your understanding of the Art and Design curriculum; how learners make progress in Art and Design; planning and curriculum development in Art and Design, examination requirements and inclusion issues in Art and Design.\r\n\r\nSupporting Learning and Progress in the Secondary School:\r\nWe will prepare you for the classroom allowing you to develop your own thinking, teaching skills and understanding of how to meet the needs of all learners. Themes include how young people learn, teaching and learning techniques to support pupils' progress; behaviour management, assessment, inclusive, creative and innovative teaching methods and how to plan lessons and sequences of lessons. You will research evidence based learning theories, gain a greater understanding of current professional issues in secondary schools and begin to develop your own educational philosophy.\r\n\r\nYour training will incorporate school based practice with weekly professional learning delivered by leading practitioners and Huddersfield University. Professional learning will take place in our training centre at The Maltings in Halifax. At the training centre you will work with a group of trainees from other subjects, which will allow you time to collaborate, share good practice and engage in peer support. \r\n\r\nCourse tutors are very experienced and supportive and you'll have a personal tutor to support you through your studies. Teaching is through small workshops, tutorials and lectures, some with guest speakers, and through group work with other teacher trainees from a variety of subject specialisms as well as specialist subject groups. \r\n\r\nAssessment is typically through the completion of a range of classroom activities, written assignments, reports, personal subject audits and the development of portfolios of evidence. ","interviewProcess":"The Trinity Institute of Education and Huddersfield University partnership have a rigorous recruitment and selection procedure. We select our trainee teachers not only by seeing whether they meet the academic criteria, but also on their passion for teaching all learners, whether they have excellent subject knowledge and whether they have the aspirations to be an outstanding and inspirational teacher in and out of the classroom. \r\n\r\nYou will be shortlisted for interview based on your application. The interview process typically lasts for a full day. We advise that you spend some time prior to the interview in a secondary school to give you a greater insight into your career choice. The following selection procedures are designed to assess your suitability for training to teach: \r\n\r\n* panel interview with a member of the lead school \r\n* pre-prepared presentation about why you want to be a teacher\r\n* subject knowledge test based on aspects of the subject curriculum in school \r\n* 2 short tasks to test your numeracy and literacy skills\r\n* lead a 15/20 minute discussion topic lesson with a mixed aged group of students from 11-16 \r\n*Provide an art portfolio that displays your skills.\r\nFrom this process we will see whether you have the passion and drive to potentially be an outstanding teacher. ","howSchoolPlacementsWork":"We have a school based approach where you will spend the majority of your training year in one school, but will also complete a short alternative placement in a contrasting school. You will be fully immersed in the culture of your school, and will be able to take ownership of your classes. A second placement allows you to build new networks and challenge yourself.\r\n \r\nYou will be teaching age 11-16 but will also be offered experience within post 16.\r\n \r\nYou will also carry out three placements within alternate provision and primary which will enhance your wider knowledge around areas such as social and emotional behaviour and transition.\r\n\r\nWe work with a wide range of partner schools to deliver our training. Each school has its own unique features, but all are involved with the alliance because they want to play their part in training, and then hopefully recruiting, the outstanding teachers of the future.\r\n\r\nPlacements are assigned on the basis of a range of factors. Our partner schools are based across West Yorkshire and are constantly expanding due to our growing popularity.","personalQualities":"What We Are Looking For:\r\n- Enthusiasm and a genuine desire to inspire young people \r\n- A commitment to helping every child to make the most of their talents \r\n- Excellent communication and inter-personal skills \r\n- Resilience and the willingness to receive and act on advice \r\n- A realistic understanding of the role of the secondary school teacher \r\n- The ability to manage time effectively \r\n- Evidence of self-motivation in personal learning \r\nIf you have the drive and passion and want to make a difference to learners and their communities, we want to hear from you!","otherRequirements":"Disclosure and Barring Service and Medical\r\nOffers will be subject to satisfactory Disclosure and Barring Service enhanced disclosure check and trainees must not previously have been barred from teaching or working with children. We also ask you to complete a conduct a health declaration to ensure that you have the health and physical capacity to teach. \r\n\r\nExperience\r\nWe advise that you spend some time gaining experience in a secondary school to give you a greater insight into your career choice and help you decide whether teaching is right for you. Other areas of relevant experience may also support your application. \r\n\r\n","status":1,"createdAt":"2021-07-06T10:54:15.625Z","updatedAt":"2021-07-07T17:41:20.945Z","canSponsorStudentVisa":"no","cycle":"2024"}
