{"id":"0f3aaff3-79ec-4ef2-85ad-73845f69245e","name":"Primary (5-11)","code":"X100","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"56c51a5c-2e4e-417c-9f96-264b313c70d5","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"64a4ec61-9a69-4391-accb-ce8e2095005f","code":"C05","name":"University of Cambridge"},"profPost":"PG","degreeGrade":"0","english":"1","maths":"1","science":"2","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feeDetails":"http://www.educ.cam.ac.uk/courses/pgce/applying/costs/\r\n","aboutCourse":"Our Primary 5-11 PGCE programme recruits high quality applicants from a variety of backgrounds and cultures and is recognised nationally and internationally as providing an outstanding preparation and development in the Primary age range. In line with the Faculty of Education’s social mission, we believe that all children in schools throughout the UK deserve the very best educational experience and our aim is to empower our trainees to provide it for them. This strong moral purpose sits at the heart of all we do and we are proud that a significant proportion of our trainees go on to teach in schools in challenging circumstances. \r\n\r\nWe aim to provide a high quality, Masters level course which enables our trainees to achieve Qualified Teacher Status (QTS) and become reflective practitioners who are committed to life-long learning. With a strong emphasis on the classroom as a site for enquiry, our course supports trainees to develop a clear understanding of the links between educational theory and classroom practice. We advocate the importance of educational research and our course is designed to allow trainees to learn first-hand about the transformational power of classroom research from leading experts who teach on the course and from researching their own practice. This inspires them to become not only leaders in their classroom but also future leaders of schools and wider educational communities. Many of our trainees are promoted to middle and senior leadership positions in the first few years of their career. \r\n\r\nTrainees studying on the course follow either:\r\n\r\n* a 5-9 specialist option with substantial placements in Key Stages 1 and 2\r\n* a 7-11 specialist option with substantial placements in Key Stage 2 and a short placement in Key Stage 1.\r\n\r\nIn order to develop teaching skills gradually, our trainees take on increasing responsibility for teaching as the course progresses, with personalised training activities supported by skilled classroom-based practitioners and experienced teacher educators. The trainees spend two thirds of the course in Partnership schools, undertaking four block placements (in a minimum of three different schools). Additionally, trainees benefit from visits to a variety of specialist settings across our extensive Partnership and there is also an opportunity for some trainees to undertake a museum education or SEND embedded placement. Gaining experience within at least ten diverse settings, our trainees feel confident to begin their career in teaching, as demonstrated through our consistently high employment  and retention rates.\r\n","interviewProcess":"Interviews usually take place at the Faculty of Education and last approximately half a day. However, interviews may need to take place online when the public health situation demands it; this will most probably be the case throughout the autumn (Michaelmas) term of 2020, and possibly beyond.\r\n\r\nIf selected for interview, candidates will be required to engage in a number of group and individual tasks. These may include:\r\n\r\n-group discussions\r\n-an individual presentation \r\n-a written task\r\n-a maths comprehension task\r\n-an individual interview\r\n\r\nApplicants will be interviewed by representatives from the Partnership, including staff from both Partnership schools and the Faculty. The small numbers involved in each panel allow interviewers to get to know candidates really well and applicants often form friendships with each other that continue into the course.\r\n\r\nWe view our interview process as a two-way dialogue in which potential trainees can find out if the Cambridge PGCE is the right course for them. Candidates will have the opportunity to learn more about the course and to ask any questions which are pertinent to them. Feedback from our recruitment days are that candidates find the atmosphere established positive, friendly and informative so they are able to perform at their best and, in turn, this influences their decision to apply to Cambridge. \r\n","howSchoolPlacementsWork":"Trainees spend a total of 120 days in school (two thirds of the course), comprised of four main placements. The first is a home-based school placement (1 week), which takes place in the first week of the course and is designed to support trainees to reflect upon key themes surrounding classroom management and behaviour for learning. Following this, trainees undertake three more placements: one of four weeks and two of eight weeks.\r\n\r\nIn addition to their main placements, trainees also spend a week in a special school reviewing SEND provision and an enrichment placement exploring specific aspects of enhanced provision during the Spring Term (1 week). Trainees also benefit from a number of visits to a range of settings which draw upon best practice across our diverse Partnership. Trainees gain experience across both Key Stages 1 and 2 and also visit a Key Stage 3 setting to ensure they have a good understanding of curriculum progression and transition. \r\n\r\nTo ensure that trainees build up their teaching skills gradually, teaching responsibility increases as the course progresses and they complete their course having gained substantial experience of teaching up to 80% of the timetable. Throughout their time on placement, trainees are based in one class alongside a mentor. In addition to regular feedback from their mentor, trainees are visited a minimum of six times during the year by Faculty staff whilst on placement. Working alongside school colleagues, Faculty staff will observe lessons and provide trainees with suggestions about how they can move their future practice forward. Trainees also benefit from support from a number of specialist Faculty staff (i.e. behaviour management expert, voice coach, subject specialists etc.). \r\n\r\nThroughout the course, great emphasis is placed on trainee and pupil wellbeing. In line with this, extensive structures and pastoral support from a range of tutors and specialists is made available on an individual basis.  This enables trainees to feel supported and helps them to be successful in their quest to make a difference to children’s lives.\r\n","personalQualities":"We actively seek applications from people who have an authentic interest in children’s learning and working with young people. Candidates should demonstrate positive personal qualities that are relevant to teaching e.g. good interpersonal and communication skills, self-awareness, open-mindedness, the ability to critically reflect and analyse and resilience.  In addition, candidates should have an interest in educational issues, child development and a passion for learning which they will be able to share with children. \r\n\r\n","otherRequirements":"Applicants are not required to have prior school experience as long as they have relevant experience with children in other capacities.\r\n\r\nHowever, we do recommend that you spend some time in school to help you decide if teaching is right for you.  We look for evidence of commitment to, and enthusiasm for, working with children and young people. You should consider how you might demonstrate this in your personal statement and be prepared to discuss during an interview.  \r\n\r\nIf you are unable to arrange school observation in the current circumstances, please reflect very carefully on your own schooling instead.\r\n","status":1,"createdAt":"2021-07-06T10:55:36.093Z","updatedAt":"2021-09-17T09:26:29.702Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
