{"id":"5befe4e0-8c63-4a5a-af16-e58ed1c240b1","name":"Religious Education","code":"V6X1","qualification":"pgce_with_qts","startDate":"2022-09-01T09:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"724b5d16-28dd-4431-bc17-ea4be4daedc4","code":"V6","name":"Religious education"}],"locations":[{"id":"fdb96c06-e024-4fdb-a456-c8349fd78e67","name":"Department of Education (University of Oxford)","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"526a977b-9e35-4c12-8c6e-1c91376ec6e9","name":"Main Site","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"192808f2-8aee-42e6-b897-bd0405e8c0f7","name":"Main Site","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"b8ec997d-3684-4225-b903-98220f59402a","name":"City Campus","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"6724aa44-b4d2-4dfc-9ac3-fe9621227ff7","name":"St Mary's University, Twickenham, London","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"ca360304-76de-49f9-9557-18144a47a136","name":"University of Exeter (Exeter Campuses)","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"c6a12566-3e58-44c0-bbbb-c4c169770ec5","name":"University of Brighton Falmer campus","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"924e4217-0773-4953-9e25-4370393f8116","name":"University of East London - Stratford Campus","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"659d6384-2780-4a78-93c6-5d150a796437","name":"Bath Spa University","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"ad3694a6-6bf8-4cd0-a8bf-e6a3564dc4b2","name":"Main Site","isPublished":"false","status":"new","vacancies":"full_time"},{"id":"56c51a5c-2e4e-417c-9f96-264b313c70d5","name":"Main Site","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"1526eb33-cd39-4f65-9984-eec624b3555c","name":"University of Birmingham","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"52d63954-6cf1-435e-8a5d-b6b0e68414a8","name":"Main Site","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"b61ff977-01a5-447f-9044-a74cc9271195","name":"Main Site","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"b0b25848-7c8d-44f1-a783-ba58393d13cc","name":"Lancaster","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"e9a0017c-30b5-4fdb-94bd-13671aa035cc","name":"Main Site","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"2823c965-5be7-4236-af19-6b47cb01f97b","name":"Newman University","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"b1e78309-45ff-4257-b300-c803621510d7","name":"Main Site","isPublished":"true","status":"running","vacancies":"full_time"},{"id":"b84b0abe-d54f-45a3-a82e-1b28f02e869d","name":"Faculty of Health and Education (Manchester)","isPublished":"true","status":"running","vacancies":"full_time"}],"trainingProvider":{"id":"64a4ec61-9a69-4391-accb-ce8e2095005f","code":"C05","name":"University of Cambridge"},"profPost":"PG","degreeGrade":"0","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"PGCE RE is designed to be an innovative and dynamic introduction to the rich variety of possibilities for teaching in schools today. The programme has an active approach to learning. You are encouraged to develop your knowledge and understanding of the major religious traditions, other religious traditions and contemporary secular philosophies. Teaching is by specialists from the traditions but a central feature of the programme is the use of visits to faith communities. We have good relations with communities representing the Buddhist, Christian, Hindu, Jewish, Muslim and Sikh faiths. London is, of course, particularly rich in its religious and cultural diversity. You will also be expected to look critically at the difficult philosophical issues raised by religion and to develop your thinking about the place and significance of religion today. Thus there is a strong emphasis not only on what we can learn about religions, but what we can learn from religion, even if we do not share a particular religious world view. In schools, this will mean examining practical strategies for enabling religion to contribute to pupils' spiritual, moral, social and cultural development. \r\n\r\n\r\nTeaching is possible within an excellent range of schools with which we work in partnership to ensure successful teaching practice. All mentors in schools are experienced and there are opportunities to work within a variety of cultural and geographical environments. We have strong links with faith community schools including those within the Anglican and Roman Catholic traditions, as well as a range of other state schools and some independent schools. \r\n\r\nThe PGCE Secondary course is also assessed by means of three assignments. These are closely linked to your work in schools and are designed to encourage reflection on practical and theoretical perspectives underpinning effective and reflective teaching and learning. \r\n\r\nFor more information please visit our website here. \r\n(https://www.roehampton.ac.uk/postgraduate-courses/pgce-secondary/pgce-art-and-design-specialism/)\r\n","interviewProcess":"We are continuing to interview applicants online this year. There will then be a recording for you to watch introducing the course and the subject tutor team. There will be a group interview, based on what you have learned from your observations in school and understanding of teaching in general. Each applicant will also have an individual interview with the subject tutor lasting about 30 minutes. You will have an opportunity to ask questions about the course during this interview. You may be asked to discuss a portfolio where relevant, to give a presentation, or to show the relevance of your subject knowledge, following specific guidance. \r\n\r\nThere will also be a written task, where you will be asked to write a short piece on the role of your subject within the national curriculum. This is to check your Spelling, Punctuation and Grammar, and to see what your response would be to writing at Master’s level. These interview elements are carefully planned to give you the best possible opportunity to show your potential for teaching and working with young people in school. A teacher from one of our partner schools may take part in the interview. \r\n","howSchoolPlacementsWork":"During school placements, students benefit from working alongside experienced Science teachers. Students have opportunities to observe excellent teaching before experimenting with approaches to teaching and learning across the secondary age range, during which time they are supervised and supported by teachers and tutors. We have an extensive mentor training programme to ensure that you have access to fully-trained mentors. \r\n\r\nEach student spends a minimum of 120 days on placement. In a normal week you will be in school on a Monday, Tuesday, Thursday and a Friday with Wednesdays being spent at University. \r\n\r\nWe will arrange your placements and we take into account where you live and your available methods of transport. We also make placement decisions based on trying to ensure you have contrasting placements to give you a breadth of expereince across the course.\r\n","personalQualities":"We look for candidates who have good interpersonal skills and a strong desire to teach. Teachers need to be flexible and prepared to take on a wide range of responsibilities. It is not a requirement to have spent time in school before the course starts but many candidates find this very useful in preparing them for the realities of classroom life.","otherRequirements":"UK enhanced DBS check is required prior to enrolment and a suitability declaration will be requested when accepting a place. If you have lived outside of the UK for a period of a year over the age of 18 then you will also be required to provide an overseas criminal records check clearance prior to starting the course.\r\n\r\nA declaration of health questionnaire is required to assess if you are fit to teach. ","status":1,"createdAt":"2021-07-06T10:50:17.104Z","updatedAt":"2021-09-28T12:25:06.986Z"}