{"id":"5befe4e0-8c63-4a5a-af16-e58ed1c240b1","name":"Religious Education","code":"V6X1","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"724b5d16-28dd-4431-bc17-ea4be4daedc4","code":"V6","name":"Religious education"}],"locations":[{"id":"56c51a5c-2e4e-417c-9f96-264b313c70d5","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"64a4ec61-9a69-4391-accb-ce8e2095005f","code":"C05","name":"University of Cambridge"},"profPost":"PG","degreeGrade":"0","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feeDetails":"For fee information:\r\nhttp://www.educ.cam.ac.uk/courses/pgce/applying/costs/\r\n","aboutCourse":"The highly regarded Cambridge Religious Studies PGCE integrates cutting-edge research in the study of religions, philosophy and ethics with the very best of contemporary classroom practice. The aim of the course is to facilitate and foster trainees’ practical excellence across the professional requirements of the UK Teacher Standards Guidelines, through gaining expertise of a range of pedagogical strategies and preparing the foundations for them to be future leaders of RE.\r\n\r\nThe course engages with the full panorama of scholarship and educational practice relevant to RE as defined by legislation and government guidelines. The course therefore includes non-religious worldviews, such as secular humanism, as well as the principal religious traditions represented in Great Britain: Christianity, Islam, Judaism, Sikhism, Hinduism and Buddhism. Trainees further benefit from tour strong links with the wider University and its world-leading research centres in theology and interreligious dialogue. Successful completion of the course awards Qualified Teacher Status, and also serves as a pathway to the Cambridge Master’s in Education in Transformative Practice.\r\n\r\nOther topics covered include:\r\n\r\n* History of RE\r\n* Contested histories\r\n* Are we a secular society?\r\n* Teaching RPE through worldviews\r\n* Values Education\r\n* Dialogic learning\r\n\r\nThe course is taught through visits to faith communities, through debate and discussion and through micro-teaching activities where trainees can pass on to each other their own areas of expertise.\r\n\r\nPractical activities range from learning to use worksheets, computers, displays and video in the classroom to imaginative activities like creating role plays, simulations and drama.\r\n\r\n\r\n","interviewProcess":"Interviews usually take place at the Faculty of Education and last approximately half a day. However, interviews may need to take place online when the public health situation demands it; this will most probably be the case throughout the autumn (Michaelmas) term of 2020, and possibly beyond.\r\n\r\n There are generally 4-6 candidates on each panel, with two interviewers, and the interview is a mixture of group activities/discussion and individual tasks.  There are no tests but candidates will be expected to demonstrate their subject knowledge and language capabilities both verbally and in writing.\r\n","howSchoolPlacementsWork":"Trainees spend at least 120 days of the course in Partnership schools, undertaking four block placements (in a minimum of three different schools), across the entire 11-18 age range.\r\n\r\nTrainees have the opportunity to work together with experienced mentors to develop their own practical teaching skills and competence. Trainees initially work together in the classroom with other trainees and their subject mentor, before gradually taking on more responsibility for planning and teaching as the year progresses, and to gain experience of many of the important tasks and responsibilities teachers take on outside the classroom, such as pastoral care and parents' evenings.\r\n\r\nIn the final placement there is also the opportunity for trainee involvement in a wider range of school activities: for instance, curriculum development and evaluation within their specialist subject(s); work experience and other activities related to careers education and economic and industrial understanding; fieldwork related to environmental education; and other similar activities which seek to extend the experience and education of pupils beyond the conventional classroom context.","personalQualities":"* A desire to teach and enthuse young people\r\n* Commitment to state education\r\n* Strong subject-based academic background\r\n* Good communication skills\r\n* Experience working with young people\r\n* Flexibility and humour\r\n* Energy, perseverance and stamina\r\n* Ability to work collaboratively\r\n* Ability to learn and act on advice\r\n","otherRequirements":"Applicants are not required to have prior school experience as long as they have relevant experience with children in other capacities.\r\n\r\nHowever, we do recommend that you spend some time in school to help you decide if teaching is right for you.  We look for evidence of commitment to, and enthusiasm for, working with children and young people. You should consider how you might demonstrate this in your personal statement and be prepared to discuss during an interview.  \r\n\r\nIf you are unable to arrange school observation in the current circumstances, please reflect very carefully on your own schooling instead.\r\n\r\n","status":1,"createdAt":"2021-07-06T10:55:35.886Z","updatedAt":"2021-09-17T08:32:38.989Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
