{"id":"84b10f49-1268-4d43-8f3a-d9aaec9b94cd","name":"Geography","code":"F8X1","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3f47e67b-7fa5-4947-a5a0-74d528cd2a87","code":"F8","name":"Geography"}],"locations":[{"id":"56c51a5c-2e4e-417c-9f96-264b313c70d5","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"64a4ec61-9a69-4391-accb-ce8e2095005f","code":"C05","name":"University of Cambridge"},"profPost":"PG","degreeGrade":"0","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feeDetails":"http://www.educ.cam.ac.uk/courses/pgce/applying/costs/\r\n","aboutCourse":"The Geography PGCE course is 'high challenge: high support' and aims not only to help trainees to develop teaching strategies and skills so that they can use their enthusiasm about Geography to interest and motivate pupils, but also develop them as geographers. We run a series of subject knowledge workshops, including meteorology training run by the Royal Meteorological Society and a workshop on geology run by colleagues in the Department of Earth Sciences at the University.   In addition, a selection of experienced mentors and guest speakers contribute to the course throughout the year; for example, David Lambert, Professor at the London Institute of Education and former Chief Executive of the Geographical Association has visited for several years to work with our trainees.\r\n\r\nThe first term concentrates primarily on preparation for the basic elements of classroom teaching, and introduces trainees to the wide range of resources and teaching strategies available to geography teachers.\r\n\r\nLater we explore a range of subjects including:\r\n\r\n* Urbanisation and the moving image\r\n* The changing geography curriculum: concepts, processes and knowledge\r\n* Landforms & processes: focus on explanations and modelling\r\n* Globalisation & interdependence: fashion, sport and sustainability\r\n* Citizenship, global citizenship and controversial issues – what is the role of geography?\r\n* Place and identity: What shape is the world anyway?\r\n\r\nAcross the course, there is also a focus on new technologies, fieldwork and wider curriculum issues. We look at how GIS can be used to improve geographical learning, and consider the role of emerging technologies, such as blogging and podcasts, in teaching geography.\r\n\r\nThe Geography course consists of sessions organised in a practical, workshop atmosphere; some sessions are taught by serving teachers from partnership schools.\r\n\r\nThe training programme has been developed so each week conceptual thinking in Subject Studies sessions in the Faculty is moved forward with discussion and practical activities in school. Trainees are provided with a range of opportunities to engage with geographical field work, both with the Geography subject studies group and with partnership schools.\r\n","interviewProcess":"Interviews usually take place at the Faculty of Education and last approximately half a day. However, interviews may need to take place online when the public health situation demands it; this will most probably be the case throughout the autumn (Michaelmas) term of 2020, and possibly beyond.\r\n\r\n There are generally 4-6 candidates on each panel, with two interviewers, and the interview is a mixture of group activities/discussion and individual tasks.  There are no tests but candidates will be expected to demonstrate their subject knowledge and language capabilities both verbally and in writing.\r\n","howSchoolPlacementsWork":"Trainees spend at least 120 days of the course in Partnership schools, undertaking four block placements (in a minimum of three different schools), across the entire 11-18 age range.\r\n\r\nTrainees have the opportunity to work together with experienced mentors to develop their own practical teaching skills and competence. Trainees initially work together in the classroom with other trainees and their subject mentor, before gradually taking on more responsibility for planning and teaching as the year progresses, and to gain experience of many of the important tasks and responsibilities teachers take on outside the classroom, such as pastoral care and parents' evenings.\r\n\r\nIn the final placement there is also the opportunity for trainee involvement in a wider range of school activities: for instance, curriculum development and evaluation within their specialist subject(s); work experience and other activities related to careers education and economic and industrial understanding; fieldwork related to environmental education; and other similar activities which seek to extend the experience and education of pupils beyond the conventional classroom context.","personalQualities":"* A desire to teach and enthuse young people\r\n* Commitment to state education\r\n* Strong subject-based academic background\r\n* Good communication skills\r\n* Experience working with young people\r\n* Flexibility and humour\r\n* Energy, perseverance and stamina\r\n* Ability to work collaboratively\r\n* Ability to learn and act on advice\r\n","otherRequirements":"Applicants are not required to have prior school experience as long as they have relevant experience with children in other capacities.\r\n\r\nHowever, we do recommend that you spend some time in school to help you decide if teaching is right for you.  We look for evidence of commitment to, and enthusiasm for, working with children and young people. You should consider how you might demonstrate this in your personal statement and be prepared to discuss during an interview.  \r\n\r\nIf you are unable to arrange school observation in the current circumstances, please reflect very carefully on your own schooling instead.\r\n","status":1,"createdAt":"2021-07-06T10:55:35.695Z","updatedAt":"2021-09-17T09:17:11.520Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
