{"id":"ce9889ed-4247-491c-a8af-fc312871df88","name":"Art and Design","code":"W1X1","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"d461a678-3335-4ca2-9616-1dc479d31a49","code":"W1","name":"Art and design"}],"locations":[{"id":"56c51a5c-2e4e-417c-9f96-264b313c70d5","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"64a4ec61-9a69-4391-accb-ce8e2095005f","code":"C05","name":"University of Cambridge"},"profPost":"PG","degreeGrade":"0","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feeDetails":"http://www.educ.cam.ac.uk/courses/pgce/applying/costs/","aboutCourse":"Our PGCE Art & Design course is rigorous and stimulating with specialist tutors working in partnership with experienced mentors in schools. We have connections with local museums, such as the Fitzwilliam and Kettle's Yard with their internationally acclaimed collections, and a purpose-built specialist studio in the Faculty.\r\n\r\nWe aim to draw upon and develop our trainees' range of skills and understanding in art, craft and design within the contexts of education and schooling. Emphasis is placed upon trainees themselves being their most important resource, working together and sharing skills. We seek to promote a questioning and critical approach to art teaching, addressing fundamental issues relating to art, craft and design in education.\r\n\r\nThe course examines areas such as the development of children's imagery, intercultural approaches, critical and contextual studies and the role of language. Practising teachers and other professionals are actively involved throughout the course, including assessment of trainee teachers' progress. Through a range of media and resources, we aim to examine concepts in education in relation to contemporary art and design practice, as well as examining concepts in relation to current educational practice. We study art education as an epistemologically discrete area of study, in addition to concepts related to art and education.\r\n\r\nThe subject will be taught via seminars and one to one tutorials.  ","interviewProcess":"Interviews usually take place at the Faculty of Education and last approximately half a day. However, interviews may need to take place online when the public health situation demands it; this will most probably be the case throughout the autumn (Michaelmas) term of 2020, and possibly beyond.\r\n\r\nThere are generally 4-6 candidates on each panel, with two interviewers, and the interview is a mixture of group activities/discussion and individual tasks.  There are no tests but candidates will be expected to demonstrate their subject knowledge and language capabilities both verbally and in writing.  Candidates are required to bring a portfolio to show evidence of a range of practical art and design skills.","howSchoolPlacementsWork":"Trainees spend at least 120 days of the course in Partnership schools, undertaking four block placements (in a minimum of three different schools), across the entire 11-18 age range.\r\n\r\nTrainees have the opportunity to work together with experienced mentors to develop their own practical teaching skills and competence. Trainees initially work together in the classroom with other trainees and their subject mentor, before gradually taking on more responsibility for planning and teaching as the year progresses, and to gain experience of many of the important tasks and responsibilities teachers take on outside the classroom, such as pastoral care and parents' evenings.\r\n\r\nIn the final placement there is also the opportunity for trainee involvement in a wider range of school activities: for instance, curriculum development and evaluation within their specialist subject(s); work experience and other activities related to careers education and economic and industrial understanding; fieldwork related to environmental education; and other similar activities which seek to extend the experience and education of pupils beyond the conventional classroom context.","personalQualities":"* A desire to teach and enthuse young people\r\n* Commitment to state education\r\n* Strong subject-based academic background\r\n* Good communication skills\r\n* Experience working with young people\r\n* Flexibility and humour\r\n* Energy, perseverance and stamina\r\n* Ability to work collaboratively\r\n* Ability to learn and act on advice\r\n","otherRequirements":"Applicants are not required to have prior school experience as long as they have relevant experience with children in other capacities.\r\n\r\nHowever, we do  recommend that you spend some time in school to help you decide if teaching is right for you.  We look for evidence of commitment to, and enthusiasm for, working with children and young people. You should consider how you might demonstrate this in your personal statement and be prepared to discuss during an interview.  \r\n\r\nIf you are unable to arrange school observation in the current circumstances, please reflect very carefully on your own schooling instead.\r\n\r\n","status":1,"createdAt":"2021-07-12T13:49:25.465Z","updatedAt":"2021-09-17T08:37:06.279Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
