{"id":"ea355ffc-dee2-42d3-915f-862666c61f15","name":"Physics","code":"F3X1","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"bf97cd0a-224c-43d3-a021-84143df13e8d","code":"F3","name":"Physics"}],"locations":[{"id":"56c51a5c-2e4e-417c-9f96-264b313c70d5","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"64a4ec61-9a69-4391-accb-ce8e2095005f","code":"C05","name":"University of Cambridge"},"profPost":"PG","degreeGrade":"0","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feeDetails":"http://www.educ.cam.ac.uk/courses/pgce/applying/costs/\r\n","aboutCourse":"The course seeks to promote physics specialism at 16+ but recognises the need for all science teachers to be able to teach outside their specialism to at least Key Stage 3.\r\n\r\nAll science trainees study a jointly taught course of which covers areas of concern common to the teaching of all the sciences such as laboratory safety, new developments in science courses and the implementation of science education research in the classroom, to enable them to teach National Curriculum science to Key Stage 4 (11-16). They also follow a chosen specialism of either Biology, Chemistry or Physics to enable them to teach this to Key Stage 5 (16-18).\r\n\r\nThe physics course aims to show current developments in school physics teaching both as it is today and how it might be in the early years of a teacher's career. The teaching is based in the laboratory and built on a combination of practical work, seminars and workshops that explore both what students need to learn as well as the strategies and approaches teachers can take to support this. How students learn physics and develop an understanding of physics in its wider context both within and outside school are high priorities of the course. We have strong links with the Institute of Physics as well as the wider science education community including organisations such as the Association for Science Education and network of Science Learning Centres.\r\n\r\nTrainees will also learn about risk assessment, and will work in many laboratory-based practical sessions, and reflect upon and evaluate the effectiveness of widely used school science courses. As the course continues, trainees will have the opportunity to learn about the use of new technologies in education, such as blogs and wikis, and consider how to approach controversial and ethical issues with school students. \r\n\r\n","interviewProcess":"Interviews usually take place at the Faculty of Education and last approximately half a day. However, interviews may need to take place online when the public health situation demands it; this will most probably be the case throughout the autumn (Michaelmas) term of 2020, and possibly beyond.\r\n\r\nThere are generally 4-6 candidates on each panel, with two interviewers, and the interview is a mixture of group activities/discussion and individual tasks.  There are no tests but candidates will be expected to demonstrate their subject knowledge and language capabilities both verbally and in writing.\r\n","howSchoolPlacementsWork":"Trainees spend at least 120 days of the course in Partnership schools, undertaking four block placements (in a minimum of three different schools), across the entire 11-18 age range.\r\n\r\nTrainees have the opportunity to work together with experienced mentors to develop their own practical teaching skills and competence. Trainees initially work together in the classroom with other trainees and their subject mentor, before gradually taking on more responsibility for planning and teaching as the year progresses, and to gain experience of many of the important tasks and responsibilities teachers take on outside the classroom, such as pastoral care and parents' evenings.\r\n\r\nIn the final placement there is also the opportunity for trainee involvement in a wider range of school activities: for instance, curriculum development and evaluation within their specialist subject(s); work experience and other activities related to careers education and economic and industrial understanding; fieldwork related to environmental education; and other similar activities which seek to extend the experience and education of pupils beyond the conventional classroom context.","personalQualities":"* A desire to teach and enthuse young people\r\n* Commitment to state education\r\n* Strong subject-based academic background\r\n* Good communication skills\r\n* Experience working with young people\r\n* Flexibility and humour\r\n* Energy, perseverance and stamina\r\n* Ability to work collaboratively\r\n* Ability to learn and act on advice\r\n","otherRequirements":"Applicants are not required to have prior school experience as long as they have relevant experience with children in other capacities.\r\n\r\nHowever, we do recommend that you spend some time in school to help you decide if teaching is right for you.  We look for evidence of commitment to, and enthusiasm for, working with children and young people. You should consider how you might demonstrate this in your personal statement and be prepared to discuss during an interview.  \r\n\r\nIf you are unable to arrange school observation in the current circumstances, please reflect very carefully on your own schooling instead.\r\n","status":1,"createdAt":"2021-07-06T10:55:35.663Z","updatedAt":"2021-09-17T09:24:05.511Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
