{"id":"69630942-d6b0-4841-8ce8-a14a9b0f5b22","name":"Primary","code":"2RS6","qualification":"qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"e8877664-feea-4179-9ecd-8fd6d877dad1","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"6ac4825e-67af-4fe2-9d0f-0f4e472a0965","code":"29W","name":"Congleton education Community Partnership"},"accreditedBody":{"id":"0a682589-92ed-447b-b564-6958b3b02b41","code":"S72","name":"Staffordshire University"},"degreeGrade":"1","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feesInternational":9250,"aboutCourse":"The final qualification awarded is a PGCE in Primary (General) with QTS and Associate teachers can earn up to 90M level credits (equivalent to half a Masters degree). All Associate Teachers are fully supported with the academic writing process via group based tutorial sessions which are embedded in the core programme.\r\n\r\nThis programme has been designed to ensure that our trainees have the skill set that schools are looking for in the future generation of teachers. A measure of the success of the programme can be seen by the employability of our trainees and the final grading of their learning and teaching. Last year all trainees completed the award had secured teaching positions before their graduation and all of our trainees were judged to be good or outstanding by their school based mentors.","interviewProcess":"","howSchoolPlacementsWork":"The programme is strongly rooted in a School and University partnership so Associate Teachers spend 3 days in their placement school and two days at University for their first placement. This enables a constant reflection on practice and the opportunity to move their thinking across all areas.\r\n\r\nThe core programme begins with a two week subject knowledge enhancement in Literacy and Mathematics. This is to promote the Associate Teacher's understanding of progression across the key concepts in these two core curriculum areas. From there the Associate Teacher moves into a carefully balanced theoretical and practical application of their understanding.\r\n\r\nThere is a statutory regulation of 120 days in school, on this course Associate Teachers have the opportunity to work within two partner primary schools, approximately 60 days in each.","personalQualities":"","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:56:20.250Z","updatedAt":"2021-11-08T15:30:35.160Z","canSponsorStudentVisa":"yes","cycle":"2024"}
