{"id":"04c4a29c-2a99-4b3a-a248-16b2b50b80d1","name":"Primary","code":"V080","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"B","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"af1c73fd-ffda-4222-91c6-5435a2cbb916","name":"The National School of Education and Teaching, Coventry University - Main Campus","isPublished":"Y","status":"R","vacancies":"B"},{"id":"7a01cd60-1caf-4084-a7a5-636546d054ec","name":"The National School of Education and Teaching - Scarborough Area","isPublished":"Y","status":"R","vacancies":"B"},{"id":"93cede1c-d87b-4546-b2a8-b9bcc3a20244","name":"The National School of Education and Teaching - Luton Area","isPublished":"Y","status":"R","vacancies":"B"},{"id":"8b7b30b0-5ff5-4460-a43a-5f8969a35436","name":"The National School of Education and Teaching - Birmingham Area","isPublished":"Y","status":"R","vacancies":"B"},{"id":"6e5a976e-1361-4ea5-9e12-c9037de0671d","name":"The National School of Education and Teaching - Surrey Area","isPublished":"Y","status":"R","vacancies":"B"},{"id":"4eced51b-98b0-41aa-9c75-0ca65a5b248e","name":"The National School of Education and Teaching - Hull Area","isPublished":"Y","status":"R","vacancies":"B"},{"id":"a8427a31-1f81-4724-aa19-2d389b5a36ae","name":"The National School of Education and Teaching - South Yorkshire Area","isPublished":"Y","status":"R","vacancies":"B"},{"id":"f860185f-db8b-4ce7-8527-78b6026aeae2","name":"The National School of Education and Teaching - Derby Area","isPublished":"Y","status":"R","vacancies":"B"},{"id":"1c666f7d-bc21-4117-92aa-2cf8d46ba545","name":"The National School of Education and Teaching - Nottingham Area","isPublished":"Y","status":"R","vacancies":"B"},{"id":"edc943db-870b-445d-98b3-346c6988834c","name":"The National School of Education and Teaching - Coventry Area","isPublished":"Y","status":"R","vacancies":"B"},{"id":"870616a6-2d34-4763-b6dc-1361d4976434","name":"The National School of Education and Teaching - East Northamptonshire Area","isPublished":"Y","status":"R","vacancies":"B"},{"id":"df2f3ad1-992f-487c-8679-9d38e68e3f7a","name":"The National School of Education and Teaching - Bedford Area","isPublished":"Y","status":"R","vacancies":"B"},{"id":"81f3b81a-eb6c-4f64-b0b8-311a5b1167e4","name":"The National School of Education and Teaching - London Area","isPublished":"Y","status":"R","vacancies":"B"},{"id":"26c78c6d-f652-4095-961d-d865c52a940f","name":"The National School of Education and Teaching - Dagenham Area","isPublished":"Y","status":"R","vacancies":"B"},{"id":"b1513772-277a-488d-9a51-91639d35e069","name":"The National School of Education and Teaching - Leicester Area","isPublished":"Y","status":"R","vacancies":"B"},{"id":"5c8eff3c-1552-476e-b211-702e262c2368","name":"The National School of Education and Teaching - Milton Keynes Area","isPublished":"Y","status":"R","vacancies":"B"}],"trainingProvider":{"id":"26797ebf-f835-47c8-9369-7d6d67fb2343","code":"C85","name":"Coventry University"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We accept equivalency tests from the following providers:\n\nhttps://www.equivalencytesting.com/\n\nhttps://astarequivalency.co.uk/\n\nCosts for equivalency tests are the responsibility of the applicant and results must be received prior to the start of the course.","courseLength":"1 year full -time, 2 years part-time","feesUK":7500,"feeDetails":" This includes accommodation at any residential conferences","aboutCourse":"We are different from other University teacher training courses in that all of your time is spent in school. Our Primary PGCE with QTS is available nationwide, and you will undertake your teacher training in an approved school.\r\n\r\nWe partner with a number of schools in different parts of the country.  Alternatively, you may be able to source your own main school placement, and we will work with the school to enable your application and training.\r\n \r\nYou will be in school for the full 5 days a week or 2½ days a week if you are part-time. In your school you will develop your craft of the classroom, guided by an in-school Mentor who will support you on a day-to-day basis.  This is underpinned by our interactive, online learning platform, which hosts our regular engagement with you in webinars, tutorials and podcasts, and allows opportunities for collaboration with fellow trainees. You will also receive 1-1 support from your own University Tutor, who is part of a dynamic and highly-skilled University team.\r\n\r\nYou will attend up to four days in person with us at our educational conferences where you will share ideas with fellow trainees, and engage with leading educators and teachers.  Where Covid-19 prevents attendance in-person, the conferences are delivered online. \r\n\r\nAdditional advantages of training to teach with us are:\r\n\r\n•\tA competitively-priced course fee of £7500.\r\n\r\n•\tA flexible approach to training: You can start in September or January and choose to train on a full-time or part-time basis.\r\n\r\n•\tThe practical relevance of in-school training combined with the quality and rigour expected of a University PGCE with 60 Masters-level credits.\r\n\r\nFor more course details, visit www.coventry.ac.uk/education\r\n\r\n\r\n","interviewProcess":"Whilst an interview can cause apprehension, ours is designed to be fair and relaxed, and we will look at your suitability to train to teach more than anything else. It is a chance for you to share with us your knowledge about your chosen phase or subject as well as your enthusiasm for a career in teaching. The interview is a two-way process, and we encourage you to ask questions about our course and the teaching profession. \r\n\r\nAt interview, you will: \r\n\r\n•\tPrepare a 5 minute presentation to a given brief, which will be sent to you prior to your interview.\r\n\r\n•\tComplete a task (this is not an exam) about understanding the fundamental English and Maths skills required of a teacher. This task will be sent out before the interview and is designed to inform us of any wider development or training requirements you would need to complete as part of the course.\r\n\r\n•\tReflect on your subject knowledge to answer some given questions so you can prepare your answers. This task will be sent out before the interview and is designed to inform us of any training requirements you would need to complete as part of the course.\r\n\r\n•\tBe given an opportunity to answer questions to enable the interviewer to assess your communication skills, pedagogical understanding, subject knowledge, and enthusiasm for teaching. \r\n\r\n•\tBe given an opportunity to discuss any flexibility in the provision that might be beneficial (i.e. part time or individual needs).\r\n\r\n","howSchoolPlacementsWork":"Our course is available nationwide. Your training is based in two schools – a main school placement for two terms and a contrasting second school for one term.  For part-time students, you will spend your first year in one school and your second year in a contrasting school. \r\n\r\nWe partner with a number of schools in different parts of the country. In some parts of the country it can be beneficial for you to source your own host school in a location to suit you. We can assist you in this, and we will support the school in meeting our criteria to partner with us.\r\n\r\nNew schools to our partnership respond well to prospective trainees who show the initiative of contacting them directly to arrange a placement. This provides the school with the opportunity of meeting you and developing a relationship with you from the outset.  \r\n\r\nWe believe that outstanding, daily mentoring is one of the most important elements of teacher training.  On placement, your in-school Mentor will be an experienced, highly effective teacher who receives regular training from us. In addition, your University Tutor will oversee and help guide your progress throughout the course, including support with your assignments as well as providing practical tips for your teaching.\r\n","personalQualities":"","otherRequirements":"Applicants, whose first language is not English, should have an IELTS of 6.5 overall.\r\n\r\nHealth and Physical Capacity to Teach:\r\n\r\nThe DfE requires providers to ensure that all trainees have the health and physical capacity to teach and will not put children and young people at risk of harm.\r\n\r\nDBS:\r\n\r\nAll entrants to ITT programmes are subject to appropriate pre-selection checks, including an enhanced DBS (Disclosure and Barring Service), criminal records checks and children's barred list information.\r\n\r\nFurther details on these checks will be provided during the selection process.","status":1,"createdAt":"2021-07-06T10:48:35.563Z","updatedAt":"2021-10-04T11:35:06.285Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
