{"id":"3725b1b7-a365-49e8-bd9b-bb110c3f517c","name":"Primary","code":"2C9N","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"38c4b93e-b4fc-4763-badf-bf1375f69455","name":"Franche Community Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"83bbcc8d-735f-4a56-bd82-595591eae25b","name":"Wilden All Saints Primary","isPublished":"Y","status":"R","vacancies":"F"},{"id":"88ed9f8e-7b27-4372-b991-b612fa7df128","name":"Stourport Primary Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"69d572bd-962b-4bd4-8875-021e41702ac8","name":"Stourport SCITT","isPublished":"Y","status":"R","vacancies":"F"},{"id":"33ebb148-bb16-4c73-a604-65f9a3f5579d","name":"Far Forest Lea Memorial CE Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"93e938c7-1ede-4013-8728-d4b0a7ea9a20","name":"Sytchampton Endowed First School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"a5eb1966-63ba-46ba-b541-b335485ca5a4","name":"Lickhill Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"da763479-c174-4578-b07c-928cb1280857","name":"Oasis Academy (Warndon)","isPublished":"Y","status":"R","vacancies":"F"},{"id":"79631dee-ecf1-4927-a84b-98c2a229cd07","name":"St Bartholomew's CE Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"c92e02a4-481c-43e3-9c8c-2e0e2819bcba","name":"Hartlebury C E Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"a886c5e2-0622-420b-b4cc-051fa5833f31","name":"Holy Trinity School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"9ba5c3cb-fe1f-4fff-94a6-cad7a40fdb4b","code":"S95","name":"Stourport SCITT"},"profPost":"BO","degreeGrade":"1","english":"2","maths":"2","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"The Stourport SCITT (School Centred Initial Teacher Training) is committed to providing the best school-based training experience in the area. The final qualification is for Qualified Teacher Status (QTS), with a PGCE accredited through Birmingham City University. There is extensive subject knowledge support and a strong connection with placement schools, in order to ensure a 'joined up' approach to the course, trainee wellbeing and support.\r\n\r\nThe primary programme is based in a school from the very beginning and closely follows the national curriculum. Each successful applicant should be able to teach across two primary phases, either ages 3 to 7 or 5 to 11. Applicants will be given a full opportunity to demonstrate their knowledge and understanding at the interview and selection stage. Excellent support for trainees is offered by outstanding teachers and primary schools committed to providing the best school placement experiences.  Subject knowledge support is offered across all core areas, as well as specialist subjects, such as art, history, geography, physical education and religious studies. \r\n\r\nTrainees will be based at the SCITT Training Rooms for training blocks and will be offered places at two different primary schools within the local area during the course. Please contact us direct on 01562 542574 option 3, email jhomer@saet.co.uk or check out our website on www.stourportscitt.com. We will be pleased to answer any questions you may have regarding the course, the support or the final qualification.","interviewProcess":"If your application is successful you will be called to interview very quickly and the interview will take place in a primary school. You will attend only one interview session, and this will take either a full morning or afternoon. The interview panel will consist of a member of the SCITT team and an experienced Headteacher.\r\n\r\nDuring the formal interview we will discuss your application in more detail and your motivation for teaching.  We are looking for applicants with a clear passion for teaching the primary age ranges.\r\n\r\nThe session will also consist of a short teaching episode (30 to 40 minutes) to a class.  We are not looking for the ‘finished article’ article at this stage but you should aim to show your enthusiasm for teaching; strong candidates will also show that they interact well with children. Following on from the lesson you will be asked to write a short reflection.\r\n\r\nAs part of the interview process we will also ask you to complete a phonics and literacy assessment, covering Early Years to lower key stage three.\r\n\r\nOnce the interview session is over we then meet as a panel and make a decision, informing candidates within three working days.\r\n","howSchoolPlacementsWork":"As we are very much ‘school centred’ you will spend a large proportion of the year in schools, so you will be immersed in school life from day one. We work with many different schools across Worcestershire, Herefordshire and Shropshire.  They cover a range of settings; from urban schools to more rural locations.  We place trainees sensitively and would not normally expect you to have to travel for more than 30 minutes from home to get to your placement school.  \r\n\r\nYour placements will be across two different primary key stages.  You will be placed in two contrasting schools to maximise your teaching experience and will join your first placement school at the very beginning of the Autumn term, giving you valuable insight in to the start of the school year and the expectations surrounding this important time for children. \r\n\r\nYour development will be supported by five intensive training blocks delivered by experts and practicing teachers to ensure that you have excellent, current pedagogy.  You will be given a mentor in each of your placements whom you will meet each week to discuss your progress.  You will also be thoroughly immersed in the pastoral role of a teacher and gain an excellent understanding of the critical work a teacher does to monitor academic progress as well as caring for students’ welfare.\r\n\r\nYour placement school will also offer you experience in the extra-curricular provision offered to children. Past trainees have supported school trips, sporting events, drama productions and many other enrichment activities.\r\n","personalQualities":"We are looking for professional individuals with a genuine passion for teaching children and becoming part of the next generation of teachers. Ideally you will have school experience,  if you need assistance with organising this, we are more than happy to help. ","otherRequirements":"We will conduct a Data Barring Service (DBS) check for each applicant, at no cost.","status":1,"createdAt":"2021-07-06T10:57:08.461Z","updatedAt":"2021-09-10T15:22:46.557Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
