{"id":"6159d112-ff81-417e-acf1-3b96de7abf68","name":"Biology","code":"2NWN","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"322cfc19-d51d-45db-91e3-bd7b4738470f","code":"C1","name":"Biology"}],"locations":[{"id":"6c796543-14fe-42d9-94a4-939ae922349e","name":"Baxter College","isPublished":"Y","status":"R","vacancies":"F"},{"id":"32c0e18b-a4c0-440a-a659-f97b861d38f7","name":"Stourport High School & Sixth Form College","isPublished":"Y","status":"R","vacancies":"F"},{"id":"69d572bd-962b-4bd4-8875-021e41702ac8","name":"Stourport SCITT","isPublished":"Y","status":"R","vacancies":"F"},{"id":"a886c5e2-0622-420b-b4cc-051fa5833f31","name":"Holy Trinity School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"b76c2037-18e0-434c-90dc-ca2a9496ba21","name":"Lacon Childe School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"79e67fc1-323f-4097-b5ae-8f605593f0be","name":"Wolverley CE Secondary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"ec69b9bf-cb72-441a-987f-37d8f6d4637e","name":"Whitecross High School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"9ba5c3cb-fe1f-4fff-94a6-cad7a40fdb4b","code":"S95","name":"Stourport SCITT"},"profPost":"BO","degreeGrade":"1","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"The Stourport SCITT (School Centred Initial Teacher Training) is committed to providing the best school based training experience in the area. The final qualification is for QTS, with a PGCE accredited through Birmingham City University, they come to us, you do not have to go to them!\r\n\r\nScience departments across a number of secondary schools have been carefully chosen to support and guide new trainees to the profession. The secondary biology programme is based in a school from the very beginning and closely follows the national curriculum. Each successful applicant should be able to teach across all science areas up to Key Stage 4 and be willing to teach the full age range, from 11 to 16, with 16 to 19 enhancement for biology. Applicants will be given a full opportunity to demonstrate their knowledge and understanding at the interview and selection stage. Excellent support for trainees is offered by outstanding teachers and science departments, committed to providing the best school placement experiences. Trainees will be based at our Stourport Training Rooms for training and will be offered places at two different secondary schools within the local area during the course.\r\n\r\nPlease contact us direct on 07582 742961, email jhomer@saet.co.uk or check out our website on www.stourportscitt.com We will be pleased to answer any questions you may have regarding the course, support and guidance for completing your application or the final qualification.","interviewProcess":"If your application is successful you will be called to interview very quickly.  Your interview will normally take place in a school setting appropriate to the age range you wish to teach. You will attend only one interview session, and this will take either a full morning or afternoon. You will be formally interviewed by one of the SCITT team and a subject specialist. In your formal interview we will discuss your application in further detail and your motivation for teaching.  \r\n\r\nWe are looking for applicants with a clear passion for both teaching and their subject; strong candidates will also show that they are at ease with pupils.  As part of this process you will also teach a short episode (30 to 40 minutes) in your subject area to a class.  We are not looking for the 'finished article' at this stage but you should aim to show your enthusiasm for your subject and positive relationships with students. Once the lesson has finished you will have the opportunity to write a reflection on your lesson. We will also ask you to sit a recent external examination paper in your subject.\r\n\r\nOnce the interview process is complete we meet as a panel to discuss all elements of the process. We would then make a decision and inform candidates within three working days of interview.\r\n","howSchoolPlacementsWork":"As we are very much ‘school centred’ you will spend a large proportion of the year in schools, so you will be immersed in school life from day one. We work with many schools across Worcestershire, Herefordshire and Shropshire.  These are from a range of settings; from urban schools to more rural locations.  We place trainees sensitively and would not normally expect you to have to travel for more than 30 minutes from home to get to your placement school.  \r\n\r\nYou will teach students within secondary age ranges, pertinent to your subject area. The school placements are with two contrasting schools to maximise your teaching experience. Placement one is at the very beginning of the Autumn term, giving you an invaluable insight in to the start of the school year and the expectations surrounding this important time for children.  \r\n\r\nYour development will be supported by five intensive training blocks, delivered by experts and practicing teachers to ensure that you have excellent, current pedagogy.  You will be given a mentor in each of your placements whom you will meet each week to discuss your progress.  You will also be thoroughly immersed in the pastoral role of a teacher; you will be assigned to support a tutor group to gain an excellent understanding of the critical work a tutor does to monitor academic progress as well as caring for students’ welfare.\r\n\r\nYou will also gain first-hand experience of how your placement school delivers spiritual, moral, social and cultural education, as well as sex and relationships education. Your placement school will also offer you experience in the extra-curricular provision offered to students. Past trainees have supported school trips, sporting events, drama productions and many other enrichment activities.\r\n","personalQualities":"We are looking for professional individuals with a genuine passion for teaching children and becoming part of the next generation of teachers. Ideally you will have school experience,  if you need assistance with organising this, we are more than happy to help. ","otherRequirements":"We will conduct a Data Barring Service (DBS) check for each applicant, at no cost.","status":1,"createdAt":"2021-07-06T10:57:09.197Z","updatedAt":"2021-09-10T15:10:37.950Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
