{"id":"703ba7c6-31d5-47f3-bd91-4736be55c32c","name":"Primary","code":"3B8X","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"3_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"8755d236-61e5-4117-a66b-4a3967b73b10","name":"The Blue Kite Academy Trust (c/o Ferndale Primary School and Nursery)","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"980b01c8-0cf3-4f9c-8896-54a2b0ae7a05","code":"2HL","name":"Blue Kite Academy Trust"},"accreditedBody":{"id":"5d691db0-3d77-4a57-a4a2-5392b1ed8fc1","code":"24U","name":"North Wiltshire SCITT"},"english":"3","maths":"3","science":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","aboutCourse":"Inspire Professional Development offers a primary route into teaching. Our programme covers the 3-11 age phase, covering Early Years, Key Stage One and Key Stage Two. As the School Direct Salaried Route is an employment-based path to QTS, our trainees are regarded as an unqualified teacher during their training. Our School Direct Salaried programme runs from September to the end of June.\r\n\r\nDuring your training year, you will spend the majority of your time based in a school, working alongside experienced teachers and leaders. You will also attend a weekly training session with Inspire Professional Development, which has been designed to support your development in specific areas of teaching, such as:\r\n\r\n - Safeguarding\r\n - Behaviour management\r\n - Assessment\r\n - Teaching pupils with special educational needs (SEN)\r\n - Teaching pupils with English as an additional language (EAL)\r\n - Phonics\r\n - Learning environment\r\n - Planning\r\n - Subject and curriculum knowledge\r\n\r\nThe majority of your training will be 'on-the-job' training, with your teaching responsibility increasing over time. You will become part of the school's teaching team and this will prepare you with the skills and knowledge you need for your future teaching career.\r\n\r\nDuring the course you will be assessed through formal observations of your teaching, your contribution towards school life, your ability to reflect on and evaluate your practice, and the compilation of a portfolio of evidence against the Teachers' Standards.","interviewProcess":"Inspire Professional Development shortlists candidates from the applications received, and invites those candidates to an initial interview, to gain a place on the salaried route. \r\n\r\nThe interview process at Inspire Professional Development consists of:\r\n\r\n - A 10-15 minute teaching activity with a small group of pupils\r\n - A handwritten task\r\n - Maths and English competency tests\r\n - A presentation to a panel\r\n\r\nSuccessful candidates will then be invited to attend school-based interviews, to secure their host placement. \r\n\r\nIf you are successful at interview, a conditional offer of a place will be made. The conditions will include providing proof that you have met the eligibility conditions for Initial Teacher Training, including qualifications, reference checks, a criminal record check (DBS) and an occupational health assessment.","howSchoolPlacementsWork":"All of our schools are based in and around Swindon. We offer salaried route places in Early Years, Key Stage 1 and Key Stage 2. At the time of your initial interview, you can specify your Key Stage preference, and this will be taken into consideration, when we arrange your school-based interviews. We cannot guarantee you will be placed in your preferred Key Stage, as this is dependent on where the host school allocates you within their teaching team.\r\n\r\nYou are required to make your own travel arrangements to and from school.\r\n\r\nDuring the programme, you will spend 4 days a week in your school, with the final day kept for centre-based training with Inspire Professional Development. Your school will assign you with a Mentor, who will support you throughout the duration of the programme. You will meet with your Mentor once a week, where you will discuss your progress and set targets.\r\n\r\nYou are required to teach in two different schools during your training year, and in two different key stages. During term 3, you will embark on your 'swap' placement, where you will train in another school setting.","personalQualities":"Use the personal statement in your application to demonstrate your understanding of the challenges and opportunities associated with the realities of teaching, as well as your enthusiasm for using your creative and intellectual skills in the classroom.\r\n\r\nYou can do this by including examples of any experience you have of working with children – perhaps as a classroom teaching assistant, youth worker, or as a volunteer in a school. If you do not have such experience, we strongly recommend that you acquire some before making the decision to become a teacher.","otherRequirements":"You will be required to have a DBS and medical clearance before starting the course. Your host school will complete these checks, once you have been successful at the school-based interview.","status":2,"createdAt":"2021-07-06T10:56:58.692Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"You will be employed by your host school as a member of their teaching staff, for a minimum of 10 months (September to June). Your host school will determine your pay scale, however, you will at least be placed at the minimum of Point 1 on the unqualified teachers' pay scale, in accordance with the Teachers' Pay and Conditions document.\r\n\r\nThere are no fees for this course."}
