{"id":"c44688fb-62dd-4729-aa18-2e169be0c178","name":"Primary","code":"G600","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_7","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"8755d236-61e5-4117-a66b-4a3967b73b10","name":"The Blue Kite Academy Trust (c/o Ferndale Primary School and Nursery)","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"980b01c8-0cf3-4f9c-8896-54a2b0ae7a05","code":"2HL","name":"Blue Kite Academy Trust"},"accreditedBody":{"id":"5d691db0-3d77-4a57-a4a2-5392b1ed8fc1","code":"24U","name":"North Wiltshire SCITT"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We accept equivalencies from 'Equivalency Testing' and 'A Star Equivalency'. We also accept a retake of a full GCSE and this can be from any provider.","courseLength":"OneYear","feesUK":9250,"feeDetails":"Student loans can include a Tuition Fee Loan and a Maintenance Loan/Grant to help with your living costs.\r\n\r\nTuition Fee Loans (Student Loans Company) lend you up to £9,250, paid directly to the course provider, and you do not have to pay it back until after your course, when you are earning above a certain level.\r\n\r\nMaintenance Loans can be applied for at the same time, lending you money at the start of each term. How much you get depends on your household income, where you study, where you live and how long for. If you are from a low income household, you may receive a Maintenance Grant too.","aboutCourse":"Inspire Professional Development offers a PGCE and QTS primary route into teaching. This route covers the 3-7 age phase, covering Early Years and Key Stage One. Our School Direct PGCE programme runs for twelve months from September.\r\n\r\nDuring your training year, you will spend the majority of your time based in a school, working alongside experienced teachers and leaders. You will also attend a weekly training session with Inspire Professional Development, which has been designed to support your development in specific areas of teaching, such as:\r\n\r\n - Safeguarding\r\n - Behaviour management\r\n - Assessment\r\n - Teaching pupils with special educational needs (SEN)\r\n - Teaching pupils with English as an additional language (EAL)\r\n - Phonics\r\n - Learning environment\r\n - Planning\r\n - Subject and curriculum knowledge\r\n\r\nThe majority of your training will be 'on-the-job' training, with your teaching responsibility increasing over time. You will become part of the school's teaching team and this will prepare you with the skills and knowledge you need for your future teaching career.\r\n\r\nDuring the course you will be assessed through formal observations of your teaching, your contribution towards school life, your ability to reflect on and evaluate your practice, and the compilation of an electronic portfolio of evidence against the Teachers' Standards.\r\n\r\nThe recommendation for QTS certification is made by North Wiltshire SCITT (NWSCITT) and the PGCE (with 60 Masters credits) is awarded by Bath Spa University.","interviewProcess":"Inspire Professional Development shortlists candidates from the applications received, and invites those candidates to an initial interview, to gain a place on the PGCE route. \r\n\r\nThe interview process at Inspire Professional Development currently consists of:\r\n\r\n - A practical activity with a small group of children\r\n - A formal interview\r\n - A presentation to a panel\r\n - A handwritten task\r\n - Maths and English competency tests (if offered a place)\r\n\r\nSuccessful candidates will then be allocated to a host school for their training, where they will be invited to attend a meeting with their host school's Headteacher. \r\n\r\nIf you are successful at interview, a conditional offer of a place will be made. The conditions will include providing proof that you have met the eligibility conditions for Initial Teacher Training, including qualifications, reference checks, a criminal record check (DBS) and an occupational health assessment.","howSchoolPlacementsWork":"All of our schools are based in and around Swindon. We offer PGCE route places and by applying to this course you will be training in the age phase 3-7 years (Early Years and Key Stage 1). At the time of your initial interview, you can specify your Key Stage preference for where you would like to be placed for the majority of your school practice. This will be taken into consideration, when we arrange your host school placement. \r\n\r\nDuring the programme, you will spend 4 days a week in your school, with the final day kept for centre-based training with Inspire Professional Development. Your school will assign you with a Mentor, who will support you throughout the duration of the programme. You will meet with your Mentor once a week, where you will discuss your progress and set targets.\r\n\r\nYou are required to teach in two different schools during your training year, and in two different key stages. During term 4, you will embark on your 'swap' placement, where you will train in another school setting.\r\n\r\nYou are required to make your own travel arrangements to and from school.\r\n","personalQualities":"Use the personal statement in your application to demonstrate your understanding of the challenges and opportunities associated with the realities of teaching, as well as your enthusiasm for using your creative and intellectual skills in the classroom.\r\n\r\nYou can do this by including examples of any experience you have of working with children – perhaps as a classroom teaching assistant, youth worker, or as a volunteer in a school. If you do not have such experience, we strongly recommend that you acquire some before making the decision to become a teacher.\r\n","otherRequirements":"References: Two positive references supporting your entry on to our PGCE route into teaching.\r\n\r\nExperience: Some recent primary school experience with an understanding of how UK primary schools operate, is desired.\r\n\r\nYou will be required to have a DBS and medical clearance before starting the course. ","status":1,"createdAt":"2021-07-06T10:56:58.761Z","updatedAt":"2021-09-21T13:57:58.248Z","canSponsorStudentVisa":"no","cycle":"2024"}
