{"id":"72a77d6f-cc9c-4cb9-b234-7f8aa657b02b","name":"Primary","code":"24J4","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"5cb75c8b-293f-47aa-a901-2c4e252959c8","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"9ffe6faa-48ed-47f1-a444-78af1e44b16f","code":"1EV","name":"Shiremoor Primary School Partnership School Direct"},"accreditedBody":{"id":"b384b008-59e2-461e-a15f-3551d1165c1e","code":"N77","name":"University of Northumbria at Newcastle"},"profPost":"PG","degreeGrade":"0","english":"1","maths":"1","science":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"During this year long programme candidates gain a full insight into school life after spending the majority of time in school. \r\nIn term one candidates attend university sessions at Coach Lane Campus approximately once a fortnight in preparation for the three academic assignments which are completed over the course of the programme. In terms two and three these sessions reduce and are less frequent as the trainees' teaching commitment increases. \r\nThe trainee year is organised into three assessed placements. Trainees begin in a home school with a designated class and mentor. Trainees are based there for the term teaching up to a 60% timetable. In term two trainees under take a second assessed placement for 6 weeks in an alternate key stage and setting. This fulfils the requirement for QTS and allows trainees to broaden their developing skill set further teaching up to a 70% timetable. \r\nIn the final third of the year trainees return to their home school and class to complete their final assessed placement. \r\n","interviewProcess":"Interviews usually take place at the Lead School in the partnership, Shiremoor Primary School. \r\nCandidates are asked to prepare a short task which they deliver to children whilst being observe by school personnel. \r\nFollowing this candidates are interviewed by a small panel of Headteacher representatives who determine whether candidates would be a suitable match for one of the placements on offer. ","howSchoolPlacementsWork":"Candidates are matched to placement schools following interview by the Headteacher panel. Travel circumstances of candidates and previous experience are factors taken into consideration. \r\n\r\nAll placements are in primary schools within the partnership. Trainees will have three assessed placements in at least two different schools. The placements will be in alternative key stages and where possible, in varied and contrasting settings. \r\n\r\nWhen not attending university sessions, trainees will be in school or attending partnership training sessions. During these sessions trainees visit different school settings and are given focussed curriculum based training.\r\n\r\n ","personalQualities":"","otherRequirements":"A DBS Enhanced Certificate and satisfactory health check are required.","status":1,"createdAt":"2021-07-06T10:47:34.130Z","updatedAt":"2021-10-07T08:23:15.740Z","canSponsorStudentVisa":"yes","cycle":"2024"}
