{"id":"46a57087-c8df-479f-93e6-832ac42b96a1","name":"Primary (5-11)","code":"3B28","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"cd35bf2c-632a-4ef5-b36e-6ea00ccd00cd","name":"Shire Oak CE Primary School (lead school)","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"cd7c6bd8-2750-4475-86c6-0e06a476b95d","code":"2HX","name":"Springboard"},"accreditedBody":{"id":"154509e2-743e-4f0b-9d99-396393aa57ff","code":"L27","name":"Leeds Beckett University"},"profPost":"BO","degreeGrade":"1","english":"1","maths":"1","science":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"Candidates need to have passed an equivalency test before applying.","courseLength":"OneYear","feesUK":9250,"feeDetails":"The rate for 2022/2023 has not yet been set so this is an indicative amount only at this stage. ","financialSupport":"Financial advice and support may be available through Leeds Beckett University. ","aboutCourse":"If you are planning to train as a primary school teacher and want to combine the academic rigour and grounding of a university course with the real-life hands on practice of working in schools, then the School Direct route might well be for you. It is particularly suited for candidates with relevant experience of working with children who are wishing to find teaching jobs for autumn in the local area. Our graduates are very successful at finding jobs in Leeds due to the quality of the course, school links in the area and the track record of Leeds Beckett University, our higher education partner. \r\n\r\nThe Springboard Cluster is situated in north Leeds primary schools including Little London, Brudenell, Kirkstall Valley, Kirkstall St Stephens, Burley St Matthias, Brodetsky, Spring Bank and Weetwood. It is led by Shire Oak Primary School in Headingley. One advantage of the Springboard Cluster is the diversity of its members and therefore the contrasting teaching experiences that student teachers benefit from on their two placements and on our enhancement days. We have small schools, three form entry schools, schools with high numbers of EAL speakers, schools with a very varied socio-economic profile and different cultural backgrounds. All are schools that are committed to meeting the needs of their young learners and supporting the next generation of teachers to do the same. Each school has an experienced tutor/mentor as well as supportive classroom teachers. \r\n\r\nDuring the year School Direct trainees learn about all aspects of primary education whilst based in at least two of our cluster schools. Learning at university is supplemented by enhancement days that are led by expert practitioners from our cluster of schools. These include (but are not limited to) topics such as phonics, EAL, Forest School, computing, planning, assessment and behaviour. Link tutors from the university effectively support student teachers throughout the year and work closely in partnership with our cluster. \r\n\r\nTrainee teachers build up their teaching time throughout the year, spending a minimum of 120 days in school during the year. This depth of practice helps graduates to become credible, effective and employable class teachers. Students are given time to work with their class-based tutor (the class teacher) as well as with their school-based mentor who guides the student’s professional development and liaises closely with the university. \r\n","interviewProcess":"Candidates will be invited to interview at the lead school where they will be asked to lead a learning activity with some children, check their maths and English and have a formal interview. The interviews are conducted by mentors from the cluster schools and often a representative from the university. ","howSchoolPlacementsWork":"School placements are in local primary schools all under 3 miles away. You will spend time in two primary schools, one of which will be your home or lead school. \r\n\r\nTypically you will have one KS1 and one KS2 practice. \r\n\r\nYou will spend a minimum of 120 days in school. ","personalQualities":"We are looking for candidates who are sure they want to teach because of the volunteering, paid and voluntary work they have already undertaken. ","otherRequirements":"All student teachers will be required to have an Enhanced Disclosures and Barring check before starting their placements in school.","status":1,"createdAt":"2021-07-06T10:52:18.525Z","updatedAt":"2021-10-04T11:12:44.556Z","canSponsorStudentVisa":"yes","cycle":"2023"}
