{"id":"73965aec-b7fa-4938-8f68-547b06bf22a3","name":"English","code":"33ZJ","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3aed1aa8-ae46-4b68-92bb-a6cc20655c59","code":"Q3","name":"English"}],"locations":[{"id":"7460bbd0-6fa8-4894-bdae-9a18b033efe2","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"154509e2-743e-4f0b-9d99-396393aa57ff","code":"L27","name":"Leeds Beckett University"},"profPost":"PG","degreeGrade":"1","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feeDetails":"In many cases, costs associated with your course will be included in your course fee. However, in some cases there are ‘essential’ additional costs (those that you will be required to meet in addition to your course fee), and/or ‘optional’ additional costs (costs that are not required, but that you might choose to pay). We have included those essential or optional additional costs that relate to your course, below.\r\n\r\nCourse-specific essentials:  Placement travel costs\r\n(Amount dependent on location)","aboutCourse":"You will become a storyteller in your lessons, developing pupils' understanding of fiction and its importance to western culture. Learning how to expertly read and express texts using intonation will be a key part of your developing skill set and will play an important role in sparking your pupils' interest. You will also learn how to select different texts to match the different abilities and level of understanding of your class. \r\n\r\nWe will help you understand the different styles modern writers use and how to apply them in a classroom situation so pupils are able to understand how to write for a specific audience to have the maximum impact on the reader.","interviewProcess":"Suitable applicants will be invited to a video interview as part of the admissions process. You will also have the opportunity to learn more about the course.","howSchoolPlacementsWork":"You will gain substantial training in a school environment. Many of the partnership schools involved in the delivery of your course are located in and around Leeds to ensure your travelling is limited and you will have the maximum time to prepare your lessons.","personalQualities":"","otherRequirements":"Evidence of recent experience in a UK Secondary school must have been completed prior to you making your application. Other experiences of working with children may be taken into consideration.\r\n\r\nSatisfactory health and enhanced criminal history checks will be required by all applicants prior to acceptance on the course. International applicants, those without British Citizenship and British Citizens with a significant period of overseas residency therefore, require a criminal records check or certificate of good conduct from their home/overseas country prior to entry on to the course. A UK DBS check will also be required before enrolment.","status":1,"createdAt":"2021-07-06T10:49:59.108Z","updatedAt":"2021-10-05T10:22:24.227Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
