{"id":"83e4f9e1-60f6-47de-89df-96f7472acbc8","name":"Geography","code":"2RWP","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3f47e67b-7fa5-4947-a5a0-74d528cd2a87","code":"F8","name":"Geography"}],"locations":[{"id":"7460bbd0-6fa8-4894-bdae-9a18b033efe2","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"154509e2-743e-4f0b-9d99-396393aa57ff","code":"L27","name":"Leeds Beckett University"},"profPost":"PG","degreeGrade":"1","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feeDetails":"In many cases, costs associated with your course will be included in your course fee. However, in some cases there are ‘essential’ additional costs (those that you will be required to meet in addition to your course fee), and/or ‘optional’ additional costs (costs that are not required, but that you might choose to pay). We have included those essential or optional additional costs that relate to your course, below.\r\n\r\nCourse-specific essentials:  Placement travel costs\r\n(Amount dependent on location)","aboutCourse":"Your learning will cover two main strands involving an enquiry-based approach to geography and real-world practical activities, which you will then translate into your classroom lessons.\r\n\r\nYour initial training will be based around developing your own personal vision of geography, which will be shaped by your knowledge of the subject and will feed into your teaching style. \r\n\r\nYou will have the opportunity to participate in and lead outdoor field experiences which will investigate physical and human geography. These experiences will develop your understanding of how to infuse classroom-based learning with practical outdoor sessions.\r\n\r\nWe provide ongoing training for all newly qualified teachers. On successful completion of your course, you will be able to enrol on our Newly Qualified Teacher module, giving you another valuable means of support as you start your teaching career.","interviewProcess":"Suitable applicants will be invited to a video interview as part of the admissions process. The interview will involve an individual interview and a written task which is designed to demonstrate your ability for critical thought. ","howSchoolPlacementsWork":"You will gain substantial training in a school environment. Many of the partnership schools involved in the delivery of your course are located in and around Leeds to ensure your travelling is limited and you will have the maximum time to prepare your lessons.\r\n\r\nYou will complete three teaching placements in at least two contrasting schools, receiving support from your school mentor and University tutors.","personalQualities":"","otherRequirements":"Evidence of recent experience in a UK Secondary school must have been completed prior to you making your application. Other experiences of working with children may be taken into consideration.\r\n\r\nSatisfactory health and enhanced criminal history checks will be required by all applicants prior to acceptance on the course. International applicants, those without British Citizenship and British Citizens with a significant period of overseas residency therefore, require a criminal records check or certificate of good conduct from their home/overseas country prior to entry on to the course. A UK DBS check will also be required before enrolment.","status":1,"createdAt":"2021-07-06T10:49:58.881Z","updatedAt":"2021-10-05T10:29:31.879Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
