{"id":"9aee8b24-e668-4d77-a1ca-9a00c4cd6545","name":"Primary 5-11 (Physical Education)","code":"2RXM","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"5ae4c96e-1da2-4831-91a3-64439b606fed","code":"06","name":"Primary with physical education"}],"locations":[{"id":"7460bbd0-6fa8-4894-bdae-9a18b033efe2","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"154509e2-743e-4f0b-9d99-396393aa57ff","code":"L27","name":"Leeds Beckett University"},"profPost":"PG","degreeGrade":"0","english":"1","maths":"1","science":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feeDetails":"In many cases, costs associated with your course will be included in your course fee. However, in some cases there are ‘essential’ additional costs (those that you will be required to meet in addition to your course fee), and/or ‘optional’ additional costs (costs that are not required, but that you might choose to pay). We have included those essential or optional additional costs that relate to your course, below.\r\n\r\nCourse-specific essentials:  Placement travel costs\r\n(Amount dependent on location)","aboutCourse":"This course will provide training in all primary stage national curriculum subjects, with a particular focus on the subjects of English, mathematics, science and PE.\r\n\r\nYou will explore established educational theories alongside new ideas, concepts and developments in the field of education. In addition, we will develop you as a future leader in the teaching of PE, giving you the knowledge and skills to promote, shape and develop the subject within a primary school setting.\r\n\r\nWe provide ongoing training for all newly qualified teachers. On successful completion of your course, you will be able to enrol on our Newly Qualified Teacher module, giving you another valuable means of support as you start your teaching career.","interviewProcess":"Suitable applicants will be invited to a video interview as part of the admissions process.  The interview process has two main purposes:\r\n\r\n* To establish whether you have the attributes that will enable you to cope with both the professional demands of the course and the related academic work;\r\n* To give you the opportunity to explain what attracts you to teaching as a career and why you think you are a suitable candidate.\r\n\r\nThe interview will involve a group activity and an individual interview. You will also have the opportunity to learn more about the course.","howSchoolPlacementsWork":"You will gain substantial training in a school environment. Many of the partnership schools involved in the delivery of your course are located in and around Leeds to ensure your travelling is limited and you will have the maximum time to prepare your lessons.\r\n\r\nYou will complete three teaching placements in at least two contrasting schools, receiving support from your school mentor and University tutors.","personalQualities":null,"otherRequirements":"Evidence of experience working with children of different ages within the 5-11 age-range. Preferably this would be across KS1 and KS2 in a UK Primary School/setting  equating to about 10-15 days in total. \r\n\r\nSatisfactory health and enhanced criminal history checks will be required by all applicants prior to acceptance on the course. International applicants, those without British Citizenship and British Citizens with a significant period of overseas residency therefore, require a criminal records check or certificate of good conduct from their home/overseas country prior to entry on to the course. A UK DBS check will also be required before enrolment.","status":1,"createdAt":"2021-07-06T10:49:58.919Z","updatedAt":"2021-10-05T10:42:34.454Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
