{"id":"bf9c5b6e-44db-49b8-b342-9186279c4b57","name":"Physical education with Geography","code":"38TS","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3f47e67b-7fa5-4947-a5a0-74d528cd2a87","code":"F8","name":"Geography"},{"id":"74d64a54-5e34-4590-b6c7-528dd0cf26fe","code":"C6","name":"Physical education"}],"locations":[{"id":"7460bbd0-6fa8-4894-bdae-9a18b033efe2","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"154509e2-743e-4f0b-9d99-396393aa57ff","code":"L27","name":"Leeds Beckett University"},"profPost":"PG","degreeGrade":"1","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feeDetails":"In many cases, costs associated with your course will be included in your course fee. However, in some cases there are ‘essential’ additional costs (those that you will be required to meet in addition to your course fee), and/or ‘optional’ additional costs (costs that are not required, but that you might choose to pay). We have included those essential or optional additional costs that relate to your course, below.\r\n\r\nCourse-specific essentials:  Placement travel costs\r\n(Amount dependent on location)","aboutCourse":"Your course will involve you learning to teach and teaching your chosen EBacc second subject of Maths for a minimum of 10% of the time. The remaining hours will be spent involved with the main subject Physical Education.\r\n\r\nYour skills and knowledge will be nurtured in a supportive learning community with vast experience of training the next generation of PE teachers.\r\n\r\nYou will have access to our wide range of first-class sporting facilities - used by international athletes and Olympic medal winners - to help you in the practical application of your theoretical learning. These include 3G pitches, indoor and floodlit outdoor tennis courts, an athletics track, a swimming pool and gyms packed with the latest fitness equipment.\r\n\r\nWe will develop your communication skills so that you can confidently manage a large group of pupils. For example, you will understand the importance of varying your tone of voice during group activities, learn how to use equipment such as whistles appropriately and how to address and maintain the attention of your pupils when teaching PE.\r\n\r\nWe will also give you the skills to confidently manage classes with wide differences in ability. You will be able to devise lessons that develop from personalised activities to games that involve and stimulate your entire class.\r\n\r\n\r\n","interviewProcess":"Suitable applicants will be invited to a video interview as part of the admissions process. The interview will involve an individual interview, and a written task which is designed to demonstrate your ability for critical thought. ","howSchoolPlacementsWork":"You will gain substantial training in a school environment. Many of the partnership schools involved in the delivery of your course are located in and around Leeds to ensure your travelling is limited and you will have the maximum time to prepare your lessons.","otherRequirements":"Evidence of recent experience in a UK Secondary school must have been completed prior to you making your application. Other experiences of working with children may be taken into consideration.\r\n\r\nSatisfactory health and enhanced criminal history checks will be required by all applicants prior to acceptance on the course. International applicants, those without British Citizenship and British Citizens with a significant period of overseas residency therefore, require a criminal records check or certificate of good conduct from their home/overseas country prior to entry on to the course. A UK DBS check will also be required before enrolment.","status":1,"createdAt":"2021-07-06T10:49:59.195Z","updatedAt":"2021-10-05T10:38:08.603Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"yes"}
