{"id":"97d8e550-cea0-4a62-9fe6-c52325f45a98","name":"English","code":"2HWW","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3aed1aa8-ae46-4b68-92bb-a6cc20655c59","code":"Q3","name":"English"}],"locations":[{"id":"1cd667e7-31e0-4ffd-a037-68199931df88","name":"Main Site","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"e806d5d7-c3fc-45cd-b5b3-f3b9b9ffaa91","code":"23R","name":"Windsor Teaching Alliance"},"accreditedBody":{"id":"77a78d6a-170e-46b0-a6de-c3983d9caa52","code":"1WM","name":"The Royal Borough of Windsor and Maidenhead SCITT"},"profPost":"PG","english":"3","maths":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","aboutCourse":"Course Content\r\nThe Training Programme consists of three modules; Planning for Progression, Comparative Study and Understanding the Professional Role. Trainees divide their time between school placements and central training. \r\nTrainees are employed by the schools and can teach up to a 90% timetable. However, schools will ensure support and mentorship is clearly in place to help build up to this. \r\nCentral training takes place once a week in school training rooms throughout the Alliance. This training is carried out by Local Authority and SCITT Advisers, Headteachers/Leading Practitioners and Bucks New University lecturers. Training covers subject knowledge and generic elements of teaching such as Behaviour Management, Inclusion and Assessment. \r\n\r\nAssessment\r\nTrainees will be assessed for QTS passing with Outstanding, Good etc. This will be assessed through teaching observations and a portfolio of evidence related to the Teaching Standards. \r\nThe PG Cert is assessed pass/fail through the three modules: \r\nModule 1 - Planning for Progression (Terms 1 & 2) \r\nIndividual presentation 30% \r\nAssignment - pupil development study 3000 words 70% \r\nModule 2 - Comparative Study (Terms 3 & 4) \r\nAssignment - comparative study 4000 words 100% \r\nModule 3 - Understanding the Professional Role (Terms 5 & 6) \r\nGroup Presentation 30% \r\nAssignment - Reflective account and portfolio of evidence 70%","interviewProcess":"Application Forms\r\nApplicants will need to demonstrate any relevant experience of working with children or within education. \r\nApplicants will need to show their passion and dedication to entering the teaching profession. \r\nApplicants will need to explain any other relevant or transferable skills and experiences. \r\nApplicants need to show an awareness of current educational practice. \r\n\r\nSelection\r\nAll schools within the consortium are involved in shortlisting, interviewing and selecting the trainees. \r\nHeadteachers are looking for the main key areas highlighted in the application section. \r\n\r\nInterviews\r\nInterviews will take place within an Alliance school by a panel of Headteachers and will involve a whole class teaching activity, a presentation and a written task. \r\nApplicants selected for interview will be required to complete the Borough Equal Opportunities and Disclosure proforma. \r\nApplicants successful following interview will be required to undergo an on line Disclosure and Barring Service (DBS) check before going into school. ","howSchoolPlacementsWork":"Trainees are based in a Lead School for four days a week for five terms. There is also a six week second school placement in a contrasting environment.","personalQualities":"Attributes\r\nWe are looking for someone who is passionate about working with children, has a thirst for learning and is showing an insight into current educational practices. We also seek individuals with a strong subject knowledge in their chosen field.\r\nWe would like to see evidence of any organisational and communication skills from previous employment as well as a commitment to the programme. ","otherRequirements":"It is desirable to have spent some time in schools to learn more about education in practice.  We are also interested in individuals' other attributes, knowledge or transferable skills related to working with young people or within education eg. youth centre, scout/guide group, church or voluntary organisation.","status":2,"createdAt":"2021-07-06T10:54:41.531Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"Trainees are appointed on a fixed term one year contract on a minimum of Unqualified 1."}
