{"id":"caccab74-078b-4794-aa77-2843b508ee17","name":"Primary","code":"2LHG","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"1cd667e7-31e0-4ffd-a037-68199931df88","name":"Main Site","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"e806d5d7-c3fc-45cd-b5b3-f3b9b9ffaa91","code":"23R","name":"Windsor Teaching Alliance"},"accreditedBody":{"id":"77a78d6a-170e-46b0-a6de-c3983d9caa52","code":"1WM","name":"The Royal Borough of Windsor and Maidenhead SCITT"},"profPost":"BO","english":"3","maths":"3","science":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":null,"aboutCourse":"Course Content\r\nThe Training Programme consists of two modules: Teachers as Researchers and Reflective Practitioners and the Principles and Practice of Effective Assessment. Trainees divide their time between school placements, central training and academic research through Buckinghamshire New University, leading to a PGCE and 60 masters credits. \r\n\r\n\r\nIn term 1 trainees will commence on a 20% teaching timetable starting with starters, plenaries and small groups. Trainees will steadily increase their teaching time on a bespoke basis.  Trainees will be mentored by a class teacher throughout with feedback given on every lesson in the early stages. In terms 5 and 6 trainees will be teaching a minimum of a 70% timetable, with a maximum teaching allocation of 80%. Throughout the year time is given for planning, preparation, assessment and observing other colleagues throughout the school. \r\n\r\nCentral training takes place once a week in school training rooms within the Consortium. This training is carried out by Local Authority and SCITT Advisers, Headteachers/Leading Practitioners and Buckinghamshire New University lecturers. Training covers subject knowledge and generic elements of teaching such as Behaviour Management, Inclusion and Assessment. \r\n\r\nAssessment\r\nTrainees will be assessed for QTS passing with Outstanding, Good etc. This will be assessed through teaching observations and a portfolio of evidence related to the Teaching Standards. \r\n\r\nThe PG Cert is assessed pass/fail through the three modules: \r\n\r\nModule 1 - Planning for Progression (Terms 1 & 2) \r\nIndividual presentation 30% \r\nAssignment - pupil development study 3000 words 70% \r\n\r\nModule 2 - Comparative Study (Terms 3 & 4) \r\nAssignment - comparative study 4000 words 100% \r\n\r\nModule 3 - Understanding the Professional Role (Terms 5 & 6) \r\nGroup Presentation 30% \r\nAssignment - Reflective account and portfolio of evidence 70% ","interviewProcess":"Interview\r\nInterviews will take place within a consortium school by a panel of Headteachers and will involve a small child initiated activity, a presentation and a written task. \r\n\r\nApplicants selected for interview will be required to complete the Borough Equal Opportunities and Disclosure proforma. \r\n\r\nApplicants successful following interview will be required to undergo an on line Disclosure and Barring Service (DBS) check before going into school.","howSchoolPlacementsWork":"Trainees are based in a Lead School for four days a week for Autumn and Summer terms. There is also a six week second school placement in a contrasting environment and further placements in a special school, early years setting, phonics and early maths placement and observing leading practice throughout the Spring term. ","personalQualities":"We are looking for at least two weeks work experience/observations in an early years setting, primary school or other organisation working with young people eg. youth centre, scout/guide group, church or voluntary organisation. \r\nPlease tell us about any other attributes, knowledge or transferable skills you possess related to working with young people or within education. \r\n\r\nWe are looking for someone who is passionate about working with children, has a thirst for learning and is showing an insight into current educational practices. \r\nAny evidence of any organisational and communication skills as well as a commitment to the programme. ","otherRequirements":"","status":2,"createdAt":"2021-07-06T10:54:41.625Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"Trainees on a salaried programme are on a minimum of Unqualified 1."}
