{"id":"5e915624-2517-4f43-9d75-9fb016300941","name":"Primary","code":"2LFJ","qualification":"qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"30ac59e8-b70f-42b6-b252-c3f1c83a6e3e","name":"Main Site","isPublished":"Y","status":"S"}],"trainingProvider":{"id":"7e6ad9ea-0373-4c35-a258-a117f6f54748","code":"16F","name":"Bourton Meadow Academy"},"accreditedBody":{"id":"255c8ae2-bc9f-4e33-8b70-7492c9bf9615","code":"1WR","name":"Bourton Meadow Initial Teacher Training Centre"},"degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We accept equivalency tests from a range of organisations and trainees are responsible for the cost of these.","courseLength":"OneYear","feesUK":null,"aboutCourse":"This is a salaried primary general course (5 - 11 years), leading to QTS.  It prepares applicants to teach across KS1 and KS2. \r\n\r\nTrainees commence their training within their employing school, enabling them to become an integral part of the teaching team and quickly form strong relationships with colleagues, pupils and parents/carers. They will spend 4 days in school each week, working alongside an experienced teacher tutor who will provide daily coaching and support.  This school experience is complemented further in the spring term by a placement in a contrasting setting and key stage. \r\n\r\nAs a salaried trainee and employee of the school, trainees may be given some class responsibility as the course progresses. This is great experience and is always carefully managed to ensure that a good balance between training and teaching is maintained. \r\n\r\nIn addition to the school-based training, all trainees will attend weekly core training sessions which take place in a range of venues across the partnership on Fridays. Core training is delivered by subject specialists and other qualified professionals. These sessions provide a coherent, well-sequenced programme, which meets the statutory requirements of the Core Content Framework.  \r\n\r\nOur curriculum enables trainees to develop a deeper understanding of key issues and pedagogical thinking by encouraging them to critically reflect on research and draw upon the best available evidence to inform their own classroom practice.  \r\n\r\nThe weekly core training sessions also provide an opportunity for trainees to compare notes with peers working in other schools and share experiences within a supportive environment.\r\n\r\nTrainees are also required to complete two QTS assignments, which help to embed key aspects of the core curriculum and support their development towards the Teachers’ Standards.\r\n\r\nThe assessment of trainees forms an important part of the programme, as it enables trainees to reflect on how well they are mastering the core curriculum and gaining proficiency in fundamental skills in English and maths. Ongoing formative assessments are embedded within the programme, helping trainees to identify their strengths and areas for development at all stages of their training.  \r\n \r\nTowards the end of the year, trainees are assessed against the Teachers’ Standards and after demonstrating that they are meeting these requirements, a recommendation is made for Qualified Teacher Status (QTS).  \r\n\r\nOur assessment procedure is transparent, understood by all partners and consistently implemented. Great care has been taken to ensure that evidence collection is both purposeful and manageable.\r\n","interviewProcess":"It is our aim to recruit the highest quality applicants into the profession who have the capacity to become strong teachers.\r\n\r\nFor this reason, we carry out a rigorous three or four-stage selection process.\r\n\r\nStage 1: An application sift is carried out by course leaders to check for minimum academic requirements as well as strong references. To enable your application to be processed more quickly, please ensure you include a full work history, with no gaps.\r\n\r\nStage 2: Applicants are invited to attend a  selection day, where they will take part in a range of activities including maths and English tasks as well as a short presentation.\r\n\r\nStage 3: Formal interview\r\n\r\nThis interview lasts approximately 20 minutes and consists of a series of questions which enable the applicant to share more information about their previous experience and to elaborate on the skills they can bring to the profession.\r\n\r\nIf an applicant on the School Direct (salaried) programme is being considered for a partnership school with which they have no prior links, a further visit / interview is likely to be arranged.  This is usually conducted by the headteacher who will make the final decision.\r\n\r\nFollowing a successful interview, a conditional offer is made. This offer is conditional on the applicant obtaining any pending qualifications, an Enhanced DBS check and a 'Fit to Teach' health assessment.\r\n","howSchoolPlacementsWork":"Generally, trainees will have two school placements during the course: a main placement and a second placement.  They will work in these placement schools four days a week (Monday - Thursday), giving them approximately 140 days in school.\r\n\r\nMain Placement: This is the employing school in which the trainee will spend most of their time.  By remaining with the same class for the majority of the year, trainees develop a secure understanding of pupils' progress over time, how this is tracked and used to inform future teaching. \r\n \r\nSecond Placement: This usually takes place in the first half of the spring term and gives trainees an opportunity to experience a contrasting setting and different key stage. \r\n\r\nA second placement familiarisation week in November, also provides trainees with an opportunity to spend time in their new school, prior to the placement commencing in January. This enables trainees to familiarise themselves with the school's ethos, routines and planning and form strong relationships with colleagues, helping them to maximise their learning and progress during this short but vital phase of the training programme.\r\n\r\nEnhancement Visits: These visits are built into our core training programme so that trainees are given regular opportunity to spend time in different schools and settings, preparing them teach in a wide range of contexts. Enhancement visits focus on specific areas such as behaviour management, Pupil Premium, Special Educational Needs (SEND) and transition from KS2 to KS3.  However, in support of our personalised training programme, training managers can arrange additional visits, if a trainee has a specific interest they would like to pursue.  \r\n\r\nBourton Meadow arranges placements on behalf of trainees. When selecting schools, we consider a wide range of factors including geographical location, preferred key stage, type of school, previous experience, chosen course etc.  However, we are also able to accommodate requests for a specific school (with the Headteacher's agreement) if an applicant already has a link with the school. \r\n\r\n","personalQualities":"We aim to recruit individuals who can:\r\n\r\n- demonstrate a passion for teaching and a genuine concern for children's welfare\r\n- demonstrate good subject knowledge, particularly in maths and English\r\n- communicate clearly and accurately in standard English\r\n- show resilience and perseverance\r\n- manage time effectively and work well under pressure\r\n- proactively seek opportunities to enhance their training\r\n- form positive relationships with individuals from all walks of life \r\n- support the values, attitudes and ethos of our partnership schools\r\n- maintain high standard of professionalism \r\n- reflect on their own practice and act upon advice received\r\n\r\n\r\n\r\n\r\n\r\n","otherRequirements":"Salaried trainees are required to undergo a:\r\n\r\n- Fit to Teach health assessment\r\n\r\n- Enhanced DBS check\r\n\r\n- Prohibition Check\r\n\r\nIt is the responsibility of the employing school to meet these requirements.\r\n\r\nWork experience is not a requirement and applications will still be considered from candidates without this experience. However, the salaried route is a very competitive route into teacher training. Relevant work experience will often strengthen the applicant's performance at a selection day, thus demonstrating their capacity to take on the additional rigour and responsibility of a salaried placement . ","status":3,"createdAt":"2021-07-06T10:48:43.530Z","updatedAt":"2021-09-27T22:00:03.968Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024"}
