{"id":"0825b3c6-40cc-45e3-a68b-884970d420ba","name":"Chemistry","code":"S345","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"912d4fb4-761b-42e9-8dc6-e968b791ea4e","code":"F1","name":"Chemistry"}],"locations":[{"id":"d2542ee0-fc7e-4453-aa89-403dc991ad7f","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"ac275662-0220-4b3f-83ec-8db2eb5da7a6","code":"1MT","name":"Burnham Teaching Partnership"},"accreditedBody":{"id":"6439adcc-af64-4d3d-a1da-de045755db06","code":"R12","name":"The University of Reading"},"profPost":"PG","degreeGrade":"1","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Applicants will need to organise the equivalency tests directly.","courseLength":"OneYear","feesUK":9250,"feesInternational":17100,"feeDetails":"Fee for UK and EU students up to £9,250 per year\r\nFee for International Students up to £17,100 per year","financialSupport":"[http://www.reading.ac.uk/education/become-a-teacher/ioe-becoming-a-teacher.aspx]","aboutCourse":"Your training will lead to a recommendation for the award of Qualified Teacher Status (QTS) by the Department for Education (DFE).The PGCE includes 60 credits at Master level, the equivalent of one third of an MA that you can add to subsequently.\r\nThe course content has been developed in collaboration between the University and Partnership Schools so that you can explore issues raised in the University through your work with pupils in school. \r\nThe University based programme comprises two main aspects: Professional Studies and Subject Studies.\r\nProfessional Studies develops insights into general aspects of education essential for entrants to the teaching profession. \r\nSubject Studies enables you to study the teaching of your chosen subject. It includes: the nature of the subject in secondary school; it's place in the National Curriculum; what and how it's taught; how it is assessed; providing for young people with different backgrounds and abilities; teaching to the examination specification; and using ICT effectively.\r\nSchool experience is integrated into all aspects of the course, and you will work in schools throughout the year. Your work in school takes a variety of forms including observing experienced teachers, team teaching, working with small groups, taking responsibility for the learning of whole classes and getting involved in all aspects of school life. You will be well supported in school by a range of experienced and well-trained people including a subject and a professional mentor and University based tutors. \r\nYou will be assigned a mentor in your training school who will support you on a daily basis.\r\nYou will also be assigned a tutor from the university who will visit you once every half term. Your tutor will monitor your achievements, evaluate your progress and work with your mentor to ensure that the training programme is appropriate for your own individual needs. \r\nYou will be assessed against the eight Teacher's Standards, based on the evidence of your teaching, your wider contribution to school life and your ability to reflect on and evaluate these experiences. Assessment will be carried out in school and moderated by your University tutor.\r\nPGCE students will write three assignments. These are designed to deepen your reflection on your school experience in the light of educational research, and to develop your ability to research your own practice. As well as being assessed in their own right, the assignments will contribute evidence towards your assessments against the Teacher's Standards.\r\n \r\n","interviewProcess":"The interview process will involve a number of activities including:\r\nIndividual work\r\nGroup discussions\r\nIndividual presentations\r\nWritten assessment\r\nThese activities will enable you to talk about your experiences, show what you know about teaching in Secondary schools and will demonstrate your potential to be an excellent secondary school teacher. We are not looking for the finished product, but for people who are enthusiastic and eager to learn and who have the potential to become outstanding teachers. Tutors from the University of Reading may also be present at the interviews\r\n","howSchoolPlacementsWork":"During the training year you will have two placements. You will have a main placement school where you will be for the majority of the school year, and in addition there will be a second smaller placement of approximately 6 weeks.\r\nYour placement schools are selected through discussion with yourself and the partner schools to ensure that you are placed in the right training environment.\r\nThese schools will be a short distance from one another as all of our partner schools are within a 25 minute drive of each other. \r\nOur Secondary schools will enable you to teach KS3, KS4 and KS5  students and comprise of comprehensive and grammar as well as single sex and mixed school settings.\r\nWe have a total of 14 partner schools and this includes 5 Secondary schools. \r\n","personalQualities":"We are looking to recruit candidates who have the potential to become outstanding teachers. Some of the personal qualities we are looking for are: \r\nA friendly and approachable nature \r\nGood interpersonal skills \r\nOrganisation and time management skills\r\nA passion for your subject to deliver a first class education\r\nAn ability to communicate with enthusiasm and relate to young people in the classroom \r\nA positive outlook and resilient nature \r\nA creative and innovative approach \r\nAn ability to reflect on experiences of working with children and young people in schools or other settings\r\nKnowledge of the school curriculum\r\n","otherRequirements":"Enhanced DBS Check\r\nMedical Check\r\nRight to Work/Study in the UK\r\nPhoto ID\r\nSatisfactory References","status":1,"createdAt":"2021-07-06T10:57:06.500Z","updatedAt":"2021-09-14T10:19:53.686Z","canSponsorStudentVisa":"yes","cycle":"2024"}
