{"id":"2bf74d2a-7361-4d61-a251-3f8b0399e858","name":"Primary","code":"24ZM","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"6a16b8ba-ba62-42a5-abf5-e4082b35578b","name":"Fairfields School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"ecd0e02f-2c36-42c3-b595-7722a03dffd4","code":"1L3","name":"Fairfields School"},"accreditedBody":{"id":"aa023df3-b71e-4249-b9c4-41fca8bd135e","code":"D39","name":"University of Derby"},"profPost":"PG","degreeGrade":"1","english":"1","maths":"1","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feeDetails":"Fees are made payable to the University of Derby.","aboutCourse":"The programme is a school-based localised training.\r\n\r\nTrainees will spend approximately 4 days at the University of Derby with a focus on 2 level 7 modules.\r\n\r\nThe course is school based with a main placement and a second placement over the Spring term.  The second placement is in an alternative key stage to the main placement.\r\n\r\nLocalised training takes place in Northampton each Friday and the training covers all aspects of the Teacher Standards and the primary and EYFS curriculum, allowing trainees to put their training into practice at their placement schools.\r\n\r\nWe offer a 2 week enhancement period, offering experiences in secondary schools, EAL, EYFS and special schools, as well as offering bespoke opportunities to meet the needs of our trainees.\r\n\r\nTrainees can select from a 3-7 route specialising in EYFS and KS1 or a 5-11 route focused on KS1 and KS2.\r\n\r\nFor further information, please visit our website: https://fairfieldstsa.org.uk/itt/school-direct where you can find our FAQs and access our Applicant Pack.","interviewProcess":"Our interview process covers 2 experiences - school based engagement and a formal interview.\r\n\r\nStage 1 - school based engagement\r\nCandidates will spend time in a local school interacting with a class through the delivery of a story of their choice.  Candidates will be observed on how they engage with learners throughout the delivery.\r\n\r\nStage 2 - formal interview\r\nCandidates will be asked to complete a  priorities task, present their choice of story and complete a formal panel interview with the School Direct lead, and local senior leaders.","howSchoolPlacementsWork":"Placement schools for trainees are selected based on experience with ITT, locality and established relationships.  We work with a range of different schools to provide placements to meet the needs of our trainees.\r\n\r\nCandidates will have 2 placements, their main placement in the Autumn and Summer term and a second placement over the Spring term.","personalQualities":"We are looking for candidates who have a passion for teaching and encouraging growth and development in learners.\r\n\r\nWe are looking for potential trainees with an interest in education and an awareness of what life in a school is like for a teacher, showing understanding of the career pathway.\r\n\r\nPersonal attributes include; good organisational skills, excellent communication skills and confidence.","otherRequirements":"DBS check\r\n\r\nHealth questionnaires will be carried out for those successful at interview.\r\n\r\nCandidates must provide 2 good references - one academic and one professional.","status":1,"createdAt":"2021-07-06T10:49:33.691Z","updatedAt":"2021-10-04T08:22:09.067Z","canSponsorStudentVisa":"yes","cycle":"2024"}
