{"id":"539853cc-ea75-4074-b396-66c6ac1f7943","name":"Primary","code":"25Q2","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"8b89138a-311a-4cdf-9c27-ef456d41bae3","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"72b36754-3b31-4424-923d-398249ec84d2","code":"1PU","name":"Riding Forward Education Alliance"},"accreditedBody":{"id":"4cc0d82a-c0fc-4661-b1e0-4080bc75b27b","code":"2EV","name":"Yorkshire Wolds Teacher Training"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"Equivalency testing is available if you do not hold these qualifications, but please contact us before applying if this applies to you. \n\nYou should be a graduate (or about to graduate this year), preferably with a 1st, upper 2nd or lower 2nd class degree.\n\nAll teachers are expected to be competent in Fundamental English and mathematics by the end of ITT.","courseLength":"Full Academic year (September to July)","feesUK":9250,"aboutCourse":"Our School Direct programme lasts for the full academic year (September - July), during which time successful applicants will be based in a host school from our partnership of schools, with excellent experience in ITT, alongside attending a full range of professional studies sessions and PGCE sessions at the Yorkshire Wolds Teacher Training base.\r\n\r\nIn the Autumn term trainees begin the course in early September for an induction week at the Yorkshire Wolds Teacher Training base.  \r\nTrainees are matched with a host school and will spend the majority of their learning journey in this setting. A typical week is four days in school with one day at the training base.\r\n\r\nTrainees will have a main teaching placement and a diversity placement over the course of the academic year. During these placements, in two contrasting schools, trainees are expected to gradually build up a portfolio of teaching and related evidence which enables them to demonstrate meeting the Teachers' Standards. \r\n\r\nThe days at the training base are designed to include: Enquiry Planning Sessions, to support work completed in the school setting, Professional Studies Sessions, led by expert practitioners  from across the partnership, Tutorial Sessions, with an allocated tutor for each trainee, Mentoring and Evidencing Sessions, designed to support trainees in their collection of evidence.\r\n\r\nIn addition to the award of QTS, trainees are able to gain a Post Graduate Certificate in Education through Sheffield Hallam University which is delivered as part of the training programme at the Yorkshire Wolds Training base. The award of PGCE is separate to the award of QTS and, in order to achieve this, trainees must study for, complete and pass two assignments set and assessed by Sheffield Hallam University.\r\n\r\n\r\n\r\n\r\n \r\n\r\n ","interviewProcess":"Successful applicants will be invited to interview via email by Andrea Tonks, Teaching School Manager.  All of our interviews take place at Molescroft Primary School, Beverley (lead school for Riding Forward TSA).\r\n\r\nInterviews will consist of an activity involving children and a formal interview. There will also be a fundamental English and Maths test.\r\n\r\nWe are looking for candidates with as much relevant experience of being in a school as possible, and evidence of why teaching is for them.\r\n\r\nApplicants who demonstrate a passion for working with young people and a strong desire to teach.\r\n\r\nApplicants who display a good level of spoken and written standard English.","howSchoolPlacementsWork":"Successful applicants will be based in two schools throughout the academic year.\r\n\r\nThe main school that the trainee will spend their time in is referred to as the 'host school'.  Once the applicant has been offered a place on either our Early Years or Primary course, and has accepted, then discussions will take place as to where their host school will be.\r\n\r\nWe try to find a host school that is as near to the trainee's home as possible, however, the most important factor is that it is a 'good fit' between the trainee and the school.\r\n\r\nThe contrasting placement school/diversity placement will not be organised until the Autumn Term, but again, we try to keep any travelling to a minimum.  Please note, however, that the East Riding is a large rural county and some element of travel will be required.  It is ideal if you have your own transport available.","personalQualities":"We are looking for candidates who have as much relevant experience of being in school as possible and who have researched the modern classroom and the National Curriculum. Showing evidence of why a career in teaching is for them.\r\n\r\nCandidates who demonstrate a passion for working with children and a strong desire to teach.\r\n\r\nWe are looking for applicants with a good level of spoken and written standard English.","otherRequirements":"All applicants are required to complete a declaration regarding any criminal convictions, clearance from the Disclosure and Barring Service (DBS), regarding suitability to work with young people and a fitness to teach declaration.","status":1,"createdAt":"2021-07-06T10:54:20.881Z","updatedAt":"2021-07-06T12:44:27.083Z","canSponsorStudentVisa":"no","cycle":"2024"}
