{"id":"bd5d09d8-9eba-4823-a8e8-9d46dc7b954a","name":"Physics with Mathematics","code":"2YRQ","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"bf97cd0a-224c-43d3-a021-84143df13e8d","code":"F3","name":"Physics"},{"id":"72345aa7-096c-488f-8649-085b8178cadb","code":"G1","name":"Mathematics"}],"locations":[{"id":"ffd61b49-4c05-42ca-a38b-5dd384d0ac2d","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"f194958a-a361-4e4e-8c58-389856ca0148","code":"25D","name":"Sutton Park SCITT"},"degreeGrade":"9","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Please contact Stephen Cormell for further details regarding equivalency tests 07309 708236.","courseLength":"OneYear","feesUK":9000,"feesInternational":9000,"feeDetails":"The fact that we do not spend your fees on university costs means that we pay the schools more significant amounts than do many providers, guaranteeing the individual training time from teachers which will lead to your professional progress.","financialSupport":"Trainees have the opportunity to apply for a £2,000 bursary provided by Wesleyan to some trainees who are training in SCITTs in the Black Country boroughs.  (All Sutton Park SCITT trainees are eligible to apply, even if they live or are in a main school outside these boroughs.)\r\n\r\nWe provide £100 to each trainee to spend on training or on resources relevant to their teaching.  ","aboutCourse":"In this course, you are trained by subject specialists in a secondary school to  support you in your development as a teacher.  You will be supported and guided in their subject knowledge development, as it is rare that a trainee teacher knows everything that a teacher of their subject needs to be able to teach.  You will learn about pedagogy, about assessing student progress, about behaviour management and about  the myriad things which teachers need to be able to do and to balance in their professional lives.  You will manage your own ability to do all of these things increasingly well as the course progresses\r\n\r\nYou will be in school every school day from early September until the end of June.  Monday to Thursday you will be in your main school, except for six weeks when you go to your second school.  On Fridays you join all of your fellow trainees for 'hub training' online.\r\n\r\nYou are continuously assessed throughout the year using  the online portal and the subject assessment document.  You upload evidence to this document and write a commentary about it.  You add to the evidence and the commentary throughout the year and your mentor assesses each section for you.  On these document, you are demonstrating your increasing capability as a teacher.\r\n\r\nTh online portal also records your weekly meetings at which your weekly targets are set, moving you forward in your professional development across the year in ways appropriate to the stage you are at in your training.\r\n\r\nThere are no assignments that you need to write.  The assessment process is based entirely on the online documents and a moderation VIVA at the end of the course.\r\n\r\nThere is no guarantee of employment in your main school, but many trainees have gained employment in the schools in which they have trained or other schools involved in the SCITT.\r\n\r\nThings our trainees have said:\r\n\r\n* Great course which I am extremely happy to be on!\r\n\r\n* Excellent support and guidance. Meetings and observation feedbacks have enabled me to reflect and learn from my teaching and has allowed me to make huge improvements in my delivery of lessons so far.\r\n\r\n* Very positive support, which will improve me as a  teacher, very high standards\r\n\r\n* Great support and treated as a valued member of staff.\r\n\r\n\r\n","interviewProcess":"The interview takes place in the school which is likely to be your main school, if you are offered a place and accept it.  This gives you the opportunity to ask yourself if this could be a place where you can see yourself developing as a teacher and if the people that you meet are the kind of people that you think will be supportive in your development.  There will be representatives of the department who will introduce you to the school and who will be able to answer the sort of questions that you might like to ask about the setting.  There will also be the director or deputy director of the SCITT who will be able to answer your questions about the how the course works.  The representative of the subject will be looking at your readiness to train as a teacher of the subject whilst the director or deputy director will be looking at whether you meet the statutory requirements to train to teach. \r\nThere are three elements to the process:\r\n* an activity with children, to see if you are likely to be a person who can communicate with children around your subject area;\r\n* a written task;\r\n* an interview.\r\n","howSchoolPlacementsWork":"When a suitable application form is received, we look at where the person lives and which schools are able to support a trainee in their subject.  We then make a preliminary decision on which would be the best school for them.  The person is then invited to interview at this school.  \r\nThere are sometimes circumstances when a person has a pre-existing connection with a school and has a preference to train there. This can happen in schools in addition to the ones listed, provided that the school is willing and able to provide the training.\r\n\r\nBusiness Studies and Psychology trainees train by working with students aged 14 to 19; trainees in all other subjects train by working with students aged 11-16.  In addition to this, all trainees will have experience of post 16 education and in primary schools.\r\n\r\nThe normal procedure is that a trainee will be at their main school between Monday and Thursday between the start of the course in early September until Christmas.  During the first six weeks of the spring term each trainee goes to a second school to gain a contrasting experience.  \r\n\r\nAfter this, the trainee returns to their main school for the remainder of the course which finishes at the end of June.  This ongoing link with the main school provides continuity, both with the children whom you experience progressing across the school year and with the teachers who support and guide you across the year.\r\n\r\nEach Friday, we have 'hub training' when all the trainees from all schools and subjects meet together online for training which covers all aspects of teaching.  Some subject specific training will take place after school.\r\n                             ","personalQualities":"","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:48:46.481Z","updatedAt":"2021-07-19T09:38:10.504Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
