{"id":"752492d6-0d64-4281-b1d5-2928d771cafe","name":"Primary","code":"38TD","qualification":"qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"TA","fundingType":"apprenticeship","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"5383b57f-9b8b-44a2-8e98-f4af85442cda","name":"Main Site","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"71c8bb7d-fdb6-4856-bf37-5d9ff775b692","code":"189","name":"Bowes Primary School"},"accreditedBody":{"id":"9188f17a-79c4-43a9-b459-4952815b739a","code":"M80","name":"Middlesex University"},"degreeGrade":"1","english":"1","maths":"1","science":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"no","courseLength":"Other,  4 terms. ","feesUK":0,"feeDetails":"There are no fees for an apprenticeship trainee teacher. Postgraduate teacher apprentices working in maintained schools will be paid in accordance with at least point one on the unqualified teachers' pay scale (Outer London) whilst on the programme. Apprentices will be paid as full-time employees. \r\n\r\nThere are no fees to be paid by the candidate. \r\n\r\nThe PGCert element of the programme does not involve a cost to the candidate. ","financialSupport":"As salaried employees, you will not be eligible for any training bursaries or student maintenance loans. ","aboutCourse":"The Apprenticeship programme is an employment-based route offering you a way to qualify as a teacher (QTS) while based mainly in a school.  The content and the focus of the training programme will be targeted to meet your individual needs. You will also have the benefit of receiving training from Middlesex University and making use of their extensive resources, including the library and student support services. \r\n\r\nOur Apprenticeship programme also provides you with the opportunity to gain a postgraduate qualification (PGCert Teaching), which can be used towards a Masters award in the future. This will enable you to develop your skills for teaching and for understanding the interrelationship between learning and teaching, as you develop into a critically reflective practitioner.\r\n\r\nAll apprenticeship programmes have to be at least 12 months and this programme lasts for four terms.  ","interviewProcess":"Bowes Primary School, as the Lead school in the partnership, will coordinate the selection and recruitment process. If shortlisted for interview, candidates will spend a full day in school participating in the following: \r\n\r\n* A 20 minute observed session with a small group of children \r\n* A written and maths task\r\n* Presentation\r\n* Group discussion\r\n* A formal individual interview\r\n\r\nMembers of the partnership and Middlesex University will be involved throughout the day and will have an equal say in the selection. It is a rigorous and thorough process to ensure applicants are matched to the employing school.  ","howSchoolPlacementsWork":"The schools within our partnership are all located within the London Borough of Enfield. When identifying schools for each candidate we consider home locations and travel options. All of our schools have good public transport links. \r\nThe teaching age ranges that we can offer are within the primary phase (3 -11). \r\nOur current partnership includes approx. 10 Enfield primary schools. \r\nThe majority of your training will be spent in your employing school, however there is a second setting placement in one of our partnership schools for half a term (6 weeks). ","personalQualities":"We are looking for creative, enthusiastic and hard working trainee teachers who can bring learning to life for our children. Every day in school is different so you will need to be flexible and adaptable. We would like you to have had some experience of working with young people of primary age, but this does not need to be paid work. It could be helping with a sports team, drama group, youth group or voluntary work in schools. We welcome career changers and the skills that can be transferred between professions. ","status":1,"createdAt":"2021-07-06T10:53:49.177Z","updatedAt":"2021-11-04T17:38:07.966Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024"}
