{"id":"4e1d4956-a9bb-42d2-98c7-fcdb6cb00d1e","name":"Primary","code":"28CN","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"trainingProvider":{"id":"3b39f229-cdd2-4d41-b4e0-9e9ae5ab006d","code":"1DS","name":"John Donne Primary School"},"accreditedBody":{"id":"049fe65f-08dc-4686-9ac8-606dce490128","code":"G56","name":"Goldsmiths, University of London"},"profPost":"PG","english":"3","maths":"3","science":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":null,"aboutCourse":"The John Donne School Direct programme is a school-based model of teacher training where trainees are employed by a school within the partnership for an academic year.  Trainees are released for approximately 40 days to complete academic study at Goldsmiths College.  There is also the opportunity to work at another contrasting school within the partnership for a 6 week placement.\r\n\r\nThe programme covers all the National Curriculum subjects, and in each curriculum area, you will have the opportunity to develop understanding of the teaching and learning process, and to learn about effective classroom practice. \r\n\r\nIn addition to the work in classrooms and the academic studies, trainees will benefit from a professional studies programme.  It is designed to provide school-focused learning with a particular spotlight on practical issues for trainees in their everyday practice.  Trainees will have the opportunity to visit a variety of other schools in the partnership, to learn about different approaches to teaching and learning, and some chances to reflect on their learning and progress on the School Direct programme.\r\n\r\nTrainees will be provided with a variety of support across their training year including both a school and university based mentor who will work with the trainee to develop a bespoke developmental plan to improve teaching practice.\r\n\r\nThis programme offers a PGCE with QTS and is assessed through observations of classroom competency, evidence to show the ability to meet the Department for Education Professional Standards as well as a series of academic assignments.\r\n\r\nThe school-based mode of teacher training offered through the John Donne Partnership is a dynamic programme of practical learning and academic study which allows trainees to develop their skills and prepares them for their teaching career. \r\n\r\n\r\n\r\n\r\n","interviewProcess":"Successfully shortlisted candidates will be invited to virtual interview which will comprise the following activities:\r\n\r\n* An interview with a selection of senior staff from the partnership schools\r\n* A group discussion around an educational quote\r\n\r\nIf successful through this process candidates will be invited to one of the schools in the partnership to complete the following:\r\n\r\n* A 20 minute teaching task with a small group of children\r\n* A written task, reflecting on the teaching task\r\n* A maths check","howSchoolPlacementsWork":"Trainees will be employed at one school within the partnership for the duration of their training.  They will work in a classroom alongside an experienced teacher and will gradually build up their teaching responsibility across the year.\r\n\r\nAll trainees will undertake a 6 week alternate placement at another school within the partnership. ","personalQualities":"We are looking for candidates who are motivated and enthusiastic about working with children.  They should have at least some experience of working with children but this does not necessarily need to be in the education sector.","otherRequirements":"It is desirable for all candidates to have at least 2 years work experience post degree.  This work experience can be in any field but some work with children would be preferred.","status":2,"createdAt":"2021-07-06T10:47:24.814Z","canSponsorSkilledWorkerVisa":"yes","cycle":"2024","salaryDetails":"Trainees are paid on the Unqualified teacher scale and will start at point 1."}
