{"id":"b000df18-04f3-4816-80d2-5c8e910df8cf","name":"Computing","code":"2SVR","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"e6be6a9c-8696-4b88-8fbd-1ba1bef1b6fc","code":"11","name":"Computing"}],"locations":[{"id":"6b6ed61e-e889-4efc-b3d5-6fa8d05b0831","name":"Holly Lodge High School","isPublished":"Y","status":"R"},{"id":"26463a46-3da7-4b0c-b208-75662055554c","name":"Oldbury Academy","isPublished":"N","status":"S","vacancies":"F"},{"id":"8ae03e5c-02f8-475b-9a83-5bdc4371350e","name":"Ormiston Sandwell Academy","isPublished":"N","status":"S","vacancies":"F"}],"trainingProvider":{"id":"1e04c08d-b7a5-4073-975e-1af8bfd24c94","code":"1S9","name":"St John Bosco ITT"},"accreditedBody":{"id":"4aa8177a-27b8-4566-b77a-c45515e46739","code":"N36","name":"Newman University"},"profPost":"PG","degreeGrade":"1","english":"1","maths":"2","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"The St John Bosco School Direct training programme allows trainees to spend the majority of their training from the very first week in one of our partner schools. This enables trainees to learn from practicing professionals at the outset.\r\n\r\n[Holly Lodge High School](https://www.holly-lodge.org/sites/default/files/LearnToTeach/index.html) in Smethwick is the lead school for Secondary training. You will be able to select your preferred training location from our choice of partner schools when you apply. If you are offered a place you will know which training location you will be placed at before you accept the offer.\r\n\r\nWe have designed our School Direct PGCE course to maximise your experience in classrooms. You will be supported by an experienced subject mentor who will oversee your development as a teacher. Your mentor will help you gain the skills and confidence needed to be an effective teacher. A key part of this development is to help you become a reflective practitioner, this is a quality you will need for the rest of your teaching career. \r\n\r\nWhether you apply to Holly Lodge or to one of our partner schools you will have the opportunity to benefit from and gain experience at Holly Lodge’s successful sixth form.\r\nAll trainees have a second placement of six week in another of our partner schools. The purpose of this is to give you an experience of a contrasting school, and so that you can put the teaching skills you have developed so far to the test.\r\n\r\nThe course is also well supported by tutors from Newman University. Lectures and tutorials at Newman will develop your subject and teaching knowledge, underpinned by educational theory.\r\n","interviewProcess":"The interview comprises two main elements. Firstly there is a mini lesson of about 20 minutes to a group of approximately 12 students. Candidates are given a topic to teach when they are invited to interview so they can prepare. Following that there is a formal interview. \r\n\r\nThe interviews are held at Holly Lodge High School, as the lead secondary school in the partnership. The interview panel will be made up of the coordinator for Initial Teacher Training at Holly Lodge, a professional mentor from the chosen training location, if it is not Holly Lodge, and a tutor from Newman University.\r\n","howSchoolPlacementsWork":"When you apply and select a preferred training school, we will do our best to ensure that is where you are placed. You will be told if an offer is made which school you will train at.\r\n\r\nSecond school placements are six week blocks, during the second term, and aim to give the trainee a contrasting experience. The trainee then returns to the main school until the end of the placement. \r\n\r\nOur secondary programmes are focused on the 11-16 age range, although all our trainees will have opportunity in their first or second placement to train at Holly Lodge's successful sixth form.\r\n\r\nFinally you will undertake a five day placement at a primary school with a focus on transition from KS2 to KS3.","personalQualities":"In the first instance a passion to teach children and make a difference to their lives. Also good knowledge and enthusiasm for the subject you wish to teach.\r\nTo start a teacher training course we are not looking for a ready made teacher, but for someone who has the willingness to learn from professionals as well as being reflective and seeking continuous improvement.","otherRequirements":"Whilst recent school experience is not required to make an application it certainly enables you to make a more thoughtful and considered application by drawing on your time in a school, where you will have had opportunities to work with small groups of children and observe lessons.","status":1,"createdAt":"2021-07-06T10:54:38.465Z","updatedAt":"2021-09-30T20:10:12.125Z","canSponsorStudentVisa":"no","cycle":"2024"}
