{"id":"a6277a03-d5cd-43a9-abc8-8510ff80c5bb","name":"Primary","code":"T850","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"TA","fundingType":"apprenticeship","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"01e90e40-f2dd-479d-b36c-fb1e1f4c4d09","name":"Main Site","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"3472d0f7-5914-495d-b643-bdfa1b298dac","code":"163","name":"Merton Special Training Association"},"accreditedBody":{"id":"252d7e03-741e-4453-b6a8-3d361e6c9d1b","code":"E69","name":"e-Qualitas"},"degreeGrade":"9","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"Please see https://www.e-qualitas.co.uk/ for further information","courseLength":"OneYear","feesUK":null,"aboutCourse":"A unique opportunity to join Cricket Green School offering successful applicants a rare chance to gain QTS whilst completing extensive coverage of blended SEN and Primary training.\r\n\r\nThis ITT course is a school-based, school-led, blended learning programme, comprising a sequenced balance of training and independent study provided by e-Qualitas. The eQ training approach includes core face to face days, subject specific and pedagogy blended learning resources, learning tasks and theory papers. Start dates are flexible as we have rolling recruitment and a cycle of training days starts each term for the group of full-time trainees starting then.\r\nOur curriculum has a shared vision, is well sequenced and cohesively integrated in schools that prepares trainees for the reality of the classroom through sustainable workload and support. Mastery of the eQ ITT curriculum is at the heart, sequentially supporting trainee development through ‘learning that’ and’ learning how to’ across the core areas of behaviour management, classroom practice and adaptive teaching, subject knowledge and pedagogy, curriculum, assessment and professional behaviours.  e-Qualitas has a comprehensive range of best practice research-based learning resources that come together as a coherent high-quality training offer for our trainees. \r\n\r\neQ recognises that all training situations are different, and we tailor aspects of the learning journey towards mastery of the eQ curriculum and the Teachers’ Standards training accordingly. Each trainee, in his or her school, is in a unique position, learning how to plan so that all pupils and students in their context, make good progress in lessons and over time. \r\n\r\nOur trainees spend most of their time in school. They move from co-teaching with experienced staff to independent teaching (with support and advice from other teachers). Most trainees are teaching about a 50% timetable by a third of the way through their course, rising to 60% in the middle term, and rising again in the final term. A 6-week placement in a contrasting school usually takes place in the middle of the training period. Trainees typically attend about 10 training days plus phase/ subject specialist days in the centre (currently central London, near Fenchurch Street). Some of these days are likely to be offered as blended virtual learning days going forward.  There is a comprehensive VLE to support independent study, and pro-forma that can be used for lesson planning, observations, and to structure evaluative writing etc. A tutor from e-Qualitas visits for a whole day each half term. \r\n\r\n\r\n","interviewProcess":"We will invite selected candidates to an interview. The invitation letter will give full details of the interview. This is likely to be a classroom exercise, literacy test, and panel interview. Interview Applicants must take the following to interview: their qualifications certificates; identity documents (photo id e.g. a passport, and evidence of residence e.g. a mobile phone bill or bank/savings statement); evidence of having taken the practice skills tests, or passed the actual skills tests. Overseas applicants must provide evidence of their eligibility to live and study in the UK Offers If we make you an offer, it could be conditional upon various things such as DBS clearance, passing the professional skills tests by a set date. You are entitled to wait for the outcome to all your applications before accepting an offer on UCAS and we fully endorse this.\r\n\r\nInterested candidates can email: louis.jhugroo@cricketgreen.merton.sch.uk\r\nDeputy Head teacher and ITT lead for the school\r\n","howSchoolPlacementsWork":"Successful candidates will cover the 4-9 age range in primary placements gaining valuable knowledge, skills and experience of teaching in a mainstream environment. You will also teach for at least 1 ½ terms in our special school across KS1, KS2,KS3 and KS4 gaining vital SEN experience and valuable pedagogical insights.\r\n\r\nAt least 1.5 terms in the host school, Cricket Green School across KS1, KS2 and KS3 - special school placement.\r\nAt least 1 term in a mainstream primary school  covering the current delivery of the National Curriculum; 50%  in year 1 and 50%  in year 4.\r\n\r\nCandidates will be employed by Cricket Green School for the duration of the course an annual salary. You will be expected to work 5 days per week excluding attendance on e-Qualitas courses.\r\n","personalQualities":"We are looking for applicants who have the potential to become outstanding teachers, and who are able to work independently on their studies while training in a school context. These personal attributes include: • Subject knowledge • Motivation to become the best teacher possible • Ability to analyse and learn from experience • Creativity and imagination • Capacity for hard work • Perseverance • Good organisational skills • Empathy and a liking for young people. • Ambition to make a difference by becoming an inspirational teacher. • Must pass Secretary of State’s requirement for physical and mental fitness to teach. ","otherRequirements":"We are looking for applicants who have the potential to become outstanding teachers, and who are able to work independently on their studies while training in a school context. These personal attributes include: • Subject knowledge • Motivation to become the best teacher possible • Ability to analyse and learn from experience • Creativity and imagination • Capacity for hard work • Perseverance • Good organisational skills • Empathy and a liking for young people. • Ambition to make a difference by becoming an inspirational teacher. • Must pass Secretary of State’s requirement for physical and mental fitness to teach. ","status":1,"createdAt":"2021-07-12T13:49:18.607Z","updatedAt":"2021-10-22T13:58:19.327Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024"}
