{"id":"e8298407-e5bf-44ac-8b51-01d822a6910b","name":"Primary (Special Educational Needs)","code":"332W","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"yes","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"01e90e40-f2dd-479d-b36c-fb1e1f4c4d09","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"3472d0f7-5914-495d-b643-bdfa1b298dac","code":"163","name":"Merton Special Training Association"},"accreditedBody":{"id":"3c17f1f1-e695-473f-8836-57997d910e5b","code":"L75","name":"London South Bank University"},"profPost":"BO","degreeGrade":"0","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"financialSupport":"For information about bursaries that you may be eligible for please visit LSBU website.\r\nhttp://www.lsbu.ac.uk/courses/course-finder/primary-pgce#course_tab_fees_and_funding","aboutCourse":"Candidates join the lead school at the beginning of the academic year and  will join all school training and have other CPD opportunities that the school offers throughout the year. The School Direct (training route) trainee teacher will spend much of the year at the lead school with 1 - 2 days at University per week for much of the first two terms. The student will have a placement in a local mainstream school. The final teaching practice will take place in the lead school. \r\nTrainees are assigned a university -based tutor and school-based mentor at the start of the course who will schedule regular observations and professional  feedback during the training period. \r\nTrainees are provided with a training plan at the start of the year outlining their school experience and mentors. In addition, students are given opportunities to observe examples of outstanding practice. \r\nMSTA has an excellent record of employment post qualification with 100% of trainees finding employment.\r\nAll trainees entering the course have the possibility of gaining up to 60 credits at Masters level, which can be used by trainees to count towards the award of full Masters qualifications (such as the LSBU MA in education) gained via further study after graduation.\r\n\r\nThe University based sessions are taught through lectures, workshops, seminars and tutorials. The aim throughout is to encourage creativity, reflective pedagogy and sensitivity  to educational issues, aims and objectives. LSBU aims to provide a learning community that actively challenges inequality and injustice. In particular the module on Equality, Inclusion and Citizenship allows you to reflect on key issues such as equality, diversity and sustainability in the Educational context.\r\nYou are encouraged to make links between the  theoretical and practical elements of the course. \r\n\r\nWe will look for applicants who can demonstrate a real passion and commitment not only to teaching, but also to working within a special educational needs setting. Please consider how you can provide relevant examples of this in your personal profile. \r\nIn addition, we value applicants who can demonstrate, with clear examples, the following personal qualities: Flexibility, creativity, resilience, excellent communication and interpersonal skills, excellent organisational skills and ability to manage one's workload and time effectively, ability to work as part of a multi-disciplinary team and a positive outlook.","interviewProcess":"Perseid school is the lead school in the partnership. LSBU and Perseid School will coordinate the recruitment process for the School Direct training programme.\r\nThe interview may include the following: classroom observation, presentation, interviews and tests. \r\nIf shortlisted you may have an interview at LSBU and a second interview at the lead school or the host school (dependent on schedules.)\r\n","howSchoolPlacementsWork":"Placements are arranged by the host school.\r\nSchool Direct (training route) trainee teachers will have one mainstream primary school placement (likely to be 6 weeks) at a local school that we have strong links with. This is usually in  term autumn 2 or spring 1.\r\nThe final teaching practice takes place at the host school.","personalQualities":"The skills and aptitudes that we expect from candidates are:\r\n* Very high standards of written and spoken English\r\n* Strong standards in numeracy\r\n* Strong standards in ICT\r\n* Excellent communication and interpersonal skills\r\n* Excellent organisational skills and ability to manage one's own workload and time effectively\r\n* Knowledge and experience of working with learners with special educational needs and disabilities","otherRequirements":"When applying for School Direct places with MSTA, ensure that you take every opportunity to demonstrate your understanding of the challenges and opportunities associated with the realities of teaching, as well as your enthusiasm for using your creative and intellectual skills in the classroom. You can do this by including examples of any experience you have working with young people with special educational needs - perhaps as a teaching assistant, youth worker or as a volunteer in a school. \r\nMSTA wishes you every success with your application!","status":1,"createdAt":"2021-07-06T10:54:44.882Z","updatedAt":"2021-10-22T13:56:44.054Z","canSponsorStudentVisa":"yes","cycle":"2024"}
