{"id":"1adb423e-b83c-4e97-8186-2493a5ce9c96","name":"Primary (SEND)","code":"T132","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"yes","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"ba3daec0-409e-43c5-9afb-33dc5195b408","name":"First Federation Schools","isPublished":"Y","status":"R","vacancies":"F"},{"id":"5254957a-954d-4d63-9954-4c753ab04f30","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"1ac14a11-5310-453f-aea7-06c069dbac01","code":"1QR","name":"First Federation Train to Teach"},"accreditedBody":{"id":"a4e84530-e1f1-47c6-b57e-ec693d629637","code":"P63","name":"Plymouth Marjon University"},"profPost":"PG","degreeGrade":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":12000,"aboutCourse":"School Direct trains you, in one year, to become an Early Career Teacher in a primary school. Our specialist Primary with SEND programme is for trainee teachers with an interest in special education. Working in inclusive classrooms alongside expert teachers, you will develop depth of knowledge to support all learners and enhanced knowledge to promote learning for SEND pupils. You will be based in two different primary schools across the year, with your second placement being situated in a special school.\r\n\r\nAs a Primary SEND trainee\r\nYou will:\r\n\r\n•\tHave a mentor and/or class teacher who is an SEND Specialist.\r\n•\tBe part of the First Federation  SEND Network group\r\n•\tWork with a SEND leader through the year\r\n•\tBe able to access all additional SEND training\r\n•\tHave your ‘enrichment week' shadowing a SEND specialist. \r\n•\tCarry out at your spring term placement in a Special school. \r\n \r\nDuring your training amount of direct contact with your class is:\r\nTerm 1: 50% contact/50% non-contact\r\nTerm 2: 60% contact/40% non-contact\r\nTerm 3: 70% contact/30% non-contact\r\nAs your teaching commitment increases, so your university set assignments decrease.\r\n\r\nOur partnership schools are a diverse and broad selection; small rural schools of less than 100 pupils, larger urban schools of more than 350 pupils. You will have opportunities to visit schools in the academy other than your home or second school.\r\nSome of your training will be school-based, led by teachers and working with other trainees from other schools; you will also attend University and be part of a broader cohort of University students.\r\n\r\nAs a Primary SEND trainee, you will be required to train in the whole primary curriculum during your school placements; we provide 12 Subject Knowledge Days delivered by talented  teachers who have expertise in a range of curriculum areas. We also offer 5  workshops in the final term delivering information on curriculum areas and educational issues of your choice so that you can ‘lead your training’.\r\nWe organise 6 ‘Teach Meets’ during the year when you are able to meet your fellow trainees to discuss and share teaching strategies and methodology  observed in the classroom.\r\nOur expertise covers many specialisms of education: childhood development, early years, maths, literacy and wellbeing.\r\nAs well as working with outstanding teachers you will also be able to participate in ‘CPD’ offered to permanent teaching staff.","interviewProcess":"Following your application, a decision is made to invite you to interview; this will usually take place at one of our Teacher Training Partnership Schools. The interview process lasts around 4 hours during which time you will be asked to:\r\n\r\n- take part in a discussion task with other candidates around a pertinent educational issue;\r\n- lead a Maths or English focused teaching activity for 6 children – you choose the age group of children;\r\n- following a tour of the school, produce a piece of writing linked to the learning environment and school ethos;\r\n- complete a short Maths test;\r\n- take part in a formal interview.\r\n\r\nYou will be interviewed by First Federation Director of Performance and Development, the School Direct ITT Lead, a Head of School and a representative from our partner university, Plymouth Marjon. You will be notified of the interview decision within 24 hours.\r\n","howSchoolPlacementsWork":"From day one, trainees will be school based and a part of a school team, and will be working with outstanding teachers and mentors across First Federation Trust and our partnership schools. School Direct brings together all the necessary elements required for excellence in Initial Teacher Education and Training; this is built upon a partnership of expert school-based practitioners and our experienced accrediting provider, Plymouth Marjon University. The programme brings teacher education pedagogy and up to date research within a school-based setting, providing enriched, school-based essential classroom experiences that allows you to put theory into practice as you develop into an outstanding teacher. \r\nThe School Direct programme duration is one academic year (September - July), during which time you will be based in a home school; and to ensure a breadth of experience, you will undertake a 6 week second placement in a Special School. Alongside this you will have a bespoke programme of training developed and delivered by University lecturers and outstanding teachers. \r\nOur programme has been designed to build your confidence and subject knowledge and give you the necessary skills to become an outstanding classroom teacher.\r\n\r\nYou will:\r\n•\tenjoy a collaborative Programme Design\r\n•\tbe set in School from Day 1\r\n•\texperience a broad and rich variety of high quality diverse school-based settings\r\n•\thave a strong ethos of support working with outstanding teachers and mentors in each school\r\n•\thave a mentor who will be based at your home school and will continue to visit you in your contrasting placement\r\n\r\nDuring the enhancement weeks towards the end of the course you will have opportunities to shadow and work with SEND specialists.\r\n","personalQualities":"Are you a 'hands on' learner? I\r\nWe need candidates with values, qualities and attributes to become outstanding teachers, the drive and motivation to succeed.\r\nCandidates with:\r\n• passion to make differences to the lives of young people\r\n• a 'can do' attitude\r\n• good interpersonal skills\r\n• imagination\r\n• excellent organisational and time management skills\r\n\r\nWanting experience of:\r\n•\tbeing part of a school team\r\n•\thow schools address behaviour management\r\n•\tdifferent school settings\r\n•\thow parents support children’s learning\r\n•\tthe challenges of different learning environments\r\n•\thow you create deep rather than surface learning\r\n","otherRequirements":"Applicants need to have:\r\n•\tA UK undergraduate honours degree or a recognised equivalent qualification at 2.1 or above. Consideration will be given to applicants with a 2:2. \r\n•\tGCSE in English, Mathematics and Science at Grade C / 4 or above\r\n•\tGood understanding or interest in SEND\r\n•\tComplete a declaration regarding any criminal convictions, clearance from the Criminal Records Bureau regarding suitability to work with young people and a fitness to teach declaration.\r\n•\tGained some school-based experience in an educational setting prior to starting the course.\r\n","status":1,"createdAt":"2021-09-09T12:30:01.365Z","updatedAt":"2021-10-01T13:55:28.743Z","canSponsorStudentVisa":"yes","cycle":"2024"}
