{"id":"5d544d3c-4485-4479-b546-c982ac5fbfea","name":"Primary","code":"2HX9","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"5254957a-954d-4d63-9954-4c753ab04f30","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"},{"id":"ba3daec0-409e-43c5-9afb-33dc5195b408","name":"First Federation Schools","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"1ac14a11-5310-453f-aea7-06c069dbac01","code":"1QR","name":"First Federation Train to Teach"},"accreditedBody":{"id":"a4e84530-e1f1-47c6-b57e-ec693d629637","code":"P63","name":"Plymouth Marjon University"},"profPost":"BO","degreeGrade":"1","english":"1","maths":"1","science":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":12000,"aboutCourse":"School Direct  trains you in one year to become a Early Career Teacher in a primary school. You will be based in two different primary schools across the year, immersed in school life and take an active role in the school team. You will work mainly in a lead school, with an additional placement for 6 weeks to give you  breadth of experience. You will be assigned a home school and have experience of 2 different classes/age groups. In the second term you have 6 weeks experience in a contrasting school.  You will be given a mentor who will work with you throughout the year. The mentor is a teacher from your home school. Weekly they will travel to meet  you at your second school. Your class teachers and mentor will be a very good/outstanding practitioner.\r\nDuring your training amount of direct contact with your class is:\r\nTerm 1: 50% contact/50% non-contact\t\r\nTerm 2: 60% contact/40% non-contact\r\nTerm 3: 70% contact/30% non-contact\r\n\r\nAs your teaching commitment increases, so your university set assignments decrease.\r\n\r\nOur partnership schools are a diverse and broad selection;  small rural schools of less than 100 pupils,  larger urban schools of more than 350 pupils. This means that you will be able to experience a range of teaching scenarios and class sizes. You will have opportunities to visit schools in the academy other than your home or second school.\r\nSome of your training will be school-based, led by teachers and working with other trainees from other schools; you will also attend University and be part of a broader cohort of University students.\r\nWe provide 12 Subject Knowledge Days delivered by talented ‘SLEs’ and teachers who have expertise in a range of curriculum areas. We also offer 5 afternoon workshops in the final term delivering information on curriculum areas and educational issues of your choice so that you can ‘lead your training’. \r\nWe organise 6 ‘Teach Meets’ during the year when you are able to meet  your fellow trainees to discuss and share teaching strategies and methodology that has been observed in the classroom.\r\nOur expertise covers many specialisms of education: childhood development, early years, literacy and wellbeing.\r\nAs well as working with outstanding teachers you will also be able to participate in ‘cpd’ offered to permanent teaching staff. CPD is delivered by the First Federation ‘SLEs’ as well as CPD that is bought in by the academy.\r\n","interviewProcess":"Following your application, a decision is made to invite you to interview at a First Federation School. The interview process lasts around 4 hours during which time you will be asked to:\r\n•\ttake part in a discussion task with other candidates around a pertinent educational issue\r\n•\tlead a teaching activity for 6 children – you choose the teaching topic and age group of children\r\n•\tfollowing a tour of the school, produce a piece of writing linked to the learning environment and school ethos\r\n•\tcomplete a short Maths test\r\n•\ttake part in a formal interview\r\n\r\nYou will be interviewed by the Director of Performance and Development, the ITT Lead, a Head of School and a representative from our partner university, Plymouth Marjon. You will be notified of the interview decision within 24 hours.\r\n","howSchoolPlacementsWork":"From day one, trainees will be school based and a part of a school team, will be working with outstanding teachers and mentors in our partnership schools. School Direct brings together all the necessary elements required for excellence in Initial Teacher Education and Training; this is built upon a partnership of expert school-based practitioners and our experienced accrediting provider, Plymouth Marjon University. The programme brings teacher education pedagogy and up to date research within a school-based setting, providing enriched, school-based essential classroom experiences that allows you to put theory into practice as you develop into an outstanding teacher. The School Direct programme duration is one academic year (September - July), during which time you will be based in a home school and to ensure a breadth of experience you will undertake a number of high quality school placements across our Partner schools, as well as a bespoke programme of training developed and delivered by University lecturers and outstanding teachers. Our programme has been designed to build your confidence and subject knowledge and give you the necessary skills to become an outstanding classroom teacher. \r\nCollaborative Programme Design\r\nSet in School from Day 1\r\nBroad and rich variety of high quality diverse school-based settings \r\nStrong ethos of support working with outstanding teachers and mentors in each school\r\nBespoke programme with further opportunity to develop a specialist area\r\n","personalQualities":"Are you a 'hands on' learner? If so School Direct is for you.\r\n We need candidates with values, qualities and attributes to become outstanding teachers,  the drive and motivation to succeed. \r\nCandidates with:\r\n•\tpassion to make differences to the lives of young people\r\n•\t a 'can do' attitude \r\n•\tgood interpersonal skills\r\n•\timagination\r\n•\texcellent organisational and time management skills\r\nWanting experience of:\r\n         being part of a school team\r\n         how  schools address behaviour management\r\n         different school settings\r\n         how  parents support children’s learning\r\n         the challenges of different learning environments\r\n        how you create deep rather than surface learning\r\n","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:57:15.897Z","updatedAt":"2021-10-01T13:50:19.890Z","canSponsorStudentVisa":"yes","cycle":"2024"}
