{"id":"b89b839a-9d5b-44c9-8975-43bfc7f262a0","name":"Primary (Special Educational Needs)","code":"2K82","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_7","subjectLevel":"primary","isSend":"yes","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"552381e9-e757-4c43-8a95-f293fbef090a","name":"Chellow Heights Special School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"7b138fe3-4d57-4878-9f94-3ee1952b6ecb","code":"197","name":"Yorkshire Special Education Partnership (YSEP)"},"accreditedBody":{"id":"19a3446e-382d-4c14-83bb-a76563cef3c1","code":"L24","name":"Leeds Trinity University"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Our School Direct PGCE Primary courses lead to QTS.  Delivered in conjunction with Leeds Trinity University and the Yorkshire Special Education Partnership, these professionally-oriented programmes will enable you to engage with a wide range of educational issues. Our School Direct Primary PGCE is designed to develop teaching and learning through a comprehensive professional development programme, subject knowledge enhancement, and a university-led professional studies course. \r\n\r\nChellow Heights is the Lead school, working in partnership with Delius, High Park, Beckfoot Phoenix, Southfield, Beechcliffe and Hazelbeck.  We are also working with an increasing numbers of mainstream schools.\r\n\r\nThe Leeds Trinity PGCE Primary (Early Years 3-7) QTS course is a professionally-oriented programme that enables you to engage with a wide range of educational issues. It is designed to develop the teaching and learning role through reflective practice.\r\n\r\nThe course leads to a Professional Graduate Certificate in Education (PGCE with QTS, Level 6) and provides the option to achieve Masters Credits and a Post Graduate Certificate in Education (PGCE with QTS, Level 7). At the end of the programme there is a further opportunity to gain additional Masters credits as part of continued professional development.\r\n\r\nThe course is organised into three stages which will gradually take you from the beginnings of planning and teaching to being a competent and confident, professional, reflective practitioner.\r\n\r\nStage 1: Planning, teaching and assessment in a mainstream Key stage 1 and EYFS  school setting from September to January.\r\nStage 2: Individual learning needs and broadening teaching strategies in a special school setting from January to June.\r\nStage 3: Professionalism and Induction continued in the same  special school setting.\r\n","interviewProcess":"Prospective students will be interview by the Lead Mentor and a mentor from one of the partnership special schools.\r\n\r\nIf you are invited to interview you will be asked to attend interview and present a lesson to the panel and answer some questions connected to this.","howSchoolPlacementsWork":"The programme covers EYFS primary working with children 3-7 years.  Students will have two placements during the year beginning from week 1 of the programme.   one in a mainstream primary school and the second in a primary special school.  \r\nWe are currently working with 5 mainstream schools across Bradford and Calderdale and all the primary special schools in Bradford.","personalQualities":"The School Direct training programme focuses on developing teaching skills. We recommend you have a good understanding of SEND before you start training on this route into teaching. \r\n","otherRequirements":"\r\nAll successful candidates are subject to a satisfactory enhanced Disclosure and Barring Service (DBS) \r\n","status":1,"createdAt":"2021-07-06T10:47:13.216Z","updatedAt":"2021-10-08T06:51:19.376Z","canSponsorStudentVisa":"yes","cycle":"2024"}
