{"id":"819e9202-e5ef-48ab-8fd7-1efc95c1a0a5","name":"Primary","code":"2ZXW","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"3e809ac7-da64-4a2c-9de5-249dd69d34cc","name":"Longmeadow Primary School","isPublished":"Y","status":"R"},{"id":"0da88c6b-ea6c-4b16-bd0f-0cbcf229df63","name":"Giles Junior School","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"7418d067-7a21-4e3c-a61b-58cc91596a1e","code":"2C8","name":"Stevenage Schools’ Partnership"},"accreditedBody":{"id":"feecdec5-259c-45e3-b1cf-4e391936ee90","code":"H36","name":"University of Hertfordshire"},"degreeGrade":"1","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"no","courseLength":"OneYear","aboutCourse":"The School Direct salaried course is a full time, one year Initial Teacher Education qualification introducing you to the requirements for teaching in the primary age range. It has been designed to enable you to demonstrate evidence of having met the Teachers’ Standards that lead to Qualified Teacher Status. We strongly believe that innovative and effective teaching and learning is made possible through a teacher’s full engagement with research informed practice and underpinning theories of learning. This is fostered and developed through School Based Training. You will be well supported in becoming a critically reflective teacher capable of inspiring pupils to learn, achieve and flourish.\r\nYou will be supported and taught by specialist tutors with excellent experience, knowledge and research informed expertise. Partnership schools provide opportunities for you to learn about pedagogical approaches relevant to your subject specialism and the professional responsibilities of all teachers.\r\nYou will have two School Based Training placements, where, with the support of a teacher mentor and a university subject tutor, you will develop your skills to become an excellent classroom teacher. Training to teach is exciting, rewarding and demanding. By the end of the course you will be well prepared for employment as a Newly Qualified Teacher (NQT).\r\n","interviewProcess":"The ability to train to teach is assessed first on application and then at interview. The interview day is a two-way process in which we encourage all applicants to ask questions to ensure that our course is suitable for them.\r\n\r\nWe are looking to select student teachers who:\r\n•have the passion, commitment and enthusiasm to teach their specialist subject in secondary schools\r\n•have a strong knowledge, understanding and interest of the specialist subject that they wish to train to teach in\r\n•are committed to working with children and adolescents and improving their educational outcomes\r\n•have an understanding of the role of the teacher and the demands of the teaching profession\r\n•have excellent communication and interpersonal skills\r\n•have the ability to reflect upon what they are doing and can respond well to feedback\r\n•are resilient and able to work under pressure\r\n\r\nApplicants will be invited to visit one of the schools in the partnership to discuss their application. They will spend some time observing experienced teachers and teach a 30 minute lesson.\r\n\r\nThere will be a panel interview in the placement school with a specialist, a senior teacher and the Lead School Co-ordinator, this will include a written test and an examination of qualifications.\r\n","howSchoolPlacementsWork":"Schools in the University of Hertfordshire schools' partnership have a proven track record of strong engagement with Initial Teacher Education. Schools are evaluated and monitored in relation to the quality and effectiveness of school based training provision. School’s commit to enact the terms of the University of Hertfordshire Partnership for Initial Teacher Education.\r\n\r\nAll of the schools in our partnership offer training in the primary age range, although some are infant or junior schools. Schools are selected according to their capacity to train in a particular subject.\r\n\r\nWe have eight primary mainstream schools in the partnership and two special schools. Trainees will experience 2 placements, with the majority of time in their main training school and 6 weeks in the second school placement.\r\n","personalQualities":"In your application and during the interview process, you will need to demonstrate an ability to train to teach through the following:\r\n* Genuine care for children’s learning, progress and achievement\r\n* A commitment and passion for your subject specialism\r\n* Your motivation and interest in training to teach\r\n* Excellent interpersonal and communication skills\r\n* A commitment to working with children and adolescents and improving their educational outcomes\r\n* The ability to be organised, adaptable and resilient\r\n* A willingness to work and learn from others and to be responsive to feedback\r\n","otherRequirements":"You will be required to complete a Disclosure and Barring Service (DBS) check and a Declaration of Disqualification by Association form. You will also need to respond to targeted and relevant health questions. Guidance will be provided after you have been offered a place.\r\nWe recommend that you undertake observation time in a state secondary school prior to interview but this is not essential. [Activities to support observation in school - either before or after interview - that you may find useful](https://www.herts.ac.uk/__data/assets/pdf_file/0006/164436/Secondary-School-experience-tasks.pdf)\r\n","status":1,"createdAt":"2021-07-06T10:52:09.183Z","updatedAt":"2021-12-15T09:20:15.931Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"You will be paid on the Unqualified Teachers' Pay Scale. Your university fees are paid by your training school."}
