{"id":"f4d0ae43-a8e4-4f88-9d62-1ec4dcd5a8ff","name":"English (SEND)","code":"N531","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"B","ageRange":"7_to_14","subjectLevel":"secondary","isSend":"yes","subjects":[{"id":"3aed1aa8-ae46-4b68-92bb-a6cc20655c59","code":"Q3","name":"English"}],"locations":[{"id":"ac75a415-7832-4c92-8445-48813a56216e","name":"Keele and North Staffordshire Teacher Education","isPublished":"Y","status":"R","vacancies":"B"},{"id":"36d21f81-b0fe-4083-a510-b88449aab429","name":"Main Site","isPublished":"N","status":"S","vacancies":"B"}],"trainingProvider":{"id":"34f0b949-839c-4292-88c3-5289076bd205","code":"24J","name":"Keele and North Staffordshire Teacher Education"},"profPost":"PG","degreeGrade":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Candidates will also need a GCSE or Equivalency in Science.\nPlease contact KNSTE for information about equivalency tests, which are currently available through Birmingham City University(BCU).\nThe cost of taking an equivalency test is set by BCU and will be borne by the applicant.","courseLength":"TwoYears","feesUK":9250,"feeDetails":"You may be eligible for a tuition fee loan to cover the cost of tuition fees charged. This is available through Student Finance England.\r\n\r\nThe fee for the full time course is £9250.\r\n* A flexible route is also available for this course.\r\n* The course length for the flexible route is 2 years.\r\n* The fee for the flexible route is £5750 for each year of study.\r\n\r\n","aboutCourse":"Keele and North Staffordshire Teacher Education foregrounds evidence informed practice. Centre-based sessions are, whenever possible led by school based colleagues in one of our teaching classrooms,  either at Keele University (ST5 5BG) or Blackfriars Special School (ST5 2TF).\r\nWhether you want to work in special and inclusive education contexts, or progress your career in a mainstream school, this course could be for you.\r\n\r\nThis course enables you to develop the professional and intellectual capabilities to prepare you for working with children with a diverse range of abilities and needs. You will benefit from placements in both Key Stages 2 and 3, one practice will be in a SEND school and the other will be in a mainstream setting. This will allow you to explore and critically reflect on the opportunities of multi-disciplinary learning. Our focus on KS2/3 is innovative and will facilitate your development as a subject specialist in English and Communication. You will be introduced to the expectations of the Primary Curriculum at KS2 in addition to English at Key Stage 3. \r\n\r\nThis pathway is open to applicants with English, English related or other appropriate degree subjects with a strong communication focus e.g. Law, the Humanities, Social Sciences or vocational degrees such as journalism.  The course will develop your appreciation of the significance of speech, language and communication in education. Verbal and non-verbal communication will be explored alongside alternative augmentative and technological strategies. The route will prepare you to evaluate what you as an individual can bring to the profession. \r\n\r\n More information can be found on our [website](https://knste-shaw.org.uk/programme-information/#pedagogy-and-send-pathway); \r\n\r\nIf you are interested in applying for our part-time option, you will need to select this at the point of application. This route is known as our Flexible Route and takes place over two years.  If in doubt, just contact us on either 01782 432537 or via [email](mailto:enquiries@knste-shaw.org.uk).\r\n","interviewProcess":"Keele and North Staffordshire Teacher Education co-ordinates recruitment across the partnership. Initially we review your Teacher Training application to ensure that you meet our entry requirements and that your personal statement reflects the capabilities and experiences that we are looking for. If your application meets these stringent criteria then you will be invited to an interview day which will take place online and then in one of our partnership schools. You will be hosted by both a member of the SCITT team and a senior school-based colleague. \r\n\r\nWe recognise that this is a demanding process. It is one that involves considerable commitment from you. Our experience suggests that this rigorous process enables us to best match applicants to the places available. \r\n\r\nOurs is an intense, high quality programme and we need to both assure ourselves, and give you the confidence, that you are best placed to make the most of the opportunities that we have on offer. As a former trainee said 'The course gives you amazing learning opportunities. The staff really help you to gain an understanding of all aspects of teaching, and with the wider elements of school life.' This is something that we pride ourselves in.\r\n","howSchoolPlacementsWork":"We work closely with several clusters of schools. You will be able to benefit from placements in two of these settings; each providing a contrasting experience. Whilst on placement we will support you in offering your pupils an appropriately high quality curriculum, one that both engages and excites them.\r\n\r\nPlacement schools are carefully selected for you, and may involve some travel. Across the course we endeavour to minimise travel, though you may have to travel for up to an hour from your home address– note that we do not pay travel expenses.\r\n\r\nDuring the ‘Initial Phase’ you attend the SCITT for two days and your school for three days. The Initial Phase is a gradual introduction into teaching and learning. You will then build up to a teaching commitment of 50% of a class timetable. \r\n\r\nYour second placement is undertaken in a different school, following successful completion of your first placement.  In your very final weeks your percentage teaching time will increase to be equivalent to the expectations of an Early Career Teacher so that you are truly job ready!  In these final few weeks there may be the opportunity for you to undertake an enrichment placement that enables you to develop a particular aspect of your teaching.\r\n\r\n","personalQualities":"Keele and North Staffordshire Teacher Education seeks candidates who are passionate about the transformative power of education and who are reflective and resilient people. We value candidates who are well-organised and who relate well to others. A strong feature of the course is the collaborative community that forms between the trainees and between our schools.  Your peers will form a bedrock of support as you realise your ambition to become an excellent and informed Early Career Teacher. We are able to offer support, in addition to that provided by your Appropriate Body in your first year of teaching.","otherRequirements":"Other requirements\r\n* A medical report which is deemed satisfactory. \r\n* A completed DBS enhanced disclosure which is deemed satisfactory by the SCITT partnership. \r\n* Prior experience is not required but can be beneficial to you in helping you to decide whether teaching is for you. If you would welcome such an opportunity do get in touch with us or look out for our Back to School days.\r\n","status":1,"createdAt":"2021-07-20T10:41:40.453Z","updatedAt":"2021-07-29T15:00:47.595Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
