{"id":"6f539930-ef1c-43a2-a509-35316a0396c5","name":"Physical Education","code":"3BLM","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"74d64a54-5e34-4590-b6c7-528dd0cf26fe","code":"C6","name":"Physical education"}],"locations":[{"id":"1f5f6c5a-1510-4082-a08b-1aedf0fa62bc","name":"Uppingham Community College","isPublished":"N","status":"S","vacancies":"F"},{"id":"23a02a69-673f-4d5d-91c7-68b248e4994c","name":"Catmose College","isPublished":"Y","status":"R","vacancies":"F"},{"id":"249d26f0-a57d-4793-a11d-d53dca73bf14","name":"Casterton Community College","isPublished":"N","status":"S","vacancies":"F"},{"id":"bf883161-f580-4654-9ff9-d94b831f6150","name":"John Ferneley College","isPublished":"N","status":"S","vacancies":"F"}],"trainingProvider":{"id":"be910803-8849-4a51-8edb-9437052c53c9","code":"1F1","name":"The Rutland and District School Federation"},"accreditedBody":{"id":"d2b7d074-fac9-42c5-a0d3-d5471b35f7d9","code":"N91","name":"Nottingham Trent University"},"profPost":"BO","degreeGrade":"1","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"financialSupport":"As a School Direct trainee, you will be entitled to the same financial support as trainees on other postgraduate teacher training courses.\r\n\r\nIf you are a UK or EU trainee, you should be eligible for a student loan, maintenance loan and maintenance grant to cover the cost of your study and will only start paying the loans back when you start earning over £21,000 per annum.\r\n\r\nYou may be eligible to receive a training bursary, dependent on the subject you train for and a degree classification.","aboutCourse":"This teaching degree provides graduates with the knowledge, skills and experience necessary to teach Physical Education at secondary school level. Time is spent in the University in lectures and seminars and in the classroom on placements, ensuring that by the end of the course, trainees are confident professionals ready to begin teaching in secondary schools.\r\n\r\nThe course incorporates periods of university-based and school-based work. The balance between school and university enables you to develop your subject knowledge whilst developing the skills required to play an effective role in the work of a school or college department. \r\n\r\nThis is achieved by a range of approaches that include practical workshops, seminars, lectures and demonstrations, fieldwork and micro-teaching activities, independent and group research and through reading and writing activities. Recent trends in teaching and learning approaches are emphasised including the application of information technology, and you will participate in the design of fieldwork, project work and assessment. We believe that this is best done by working from your own subject knowledge and skills while also having the ability to teach material from the sciences which lie beyond your specialism.","interviewProcess":"You will be invited to an interview with one of the Rutland Teaching Alliance partner schools as part of the selection process. At this interview, you will have an opportunity to take part in a number of school-based activities during a normal school day.\r\nThey will include:\r\n*An opportunity to meet with the subject Team Leader and other colleagues\r\n*Teach part of a lesson to a small group\r\n*Individual Interview\r\n\r\nYou will also be invited to a second interview at Nottingham Trent University.","howSchoolPlacementsWork":"The lead school organises your placements within the teaching alliance.\r\n\r\nThe School Direct course is a flexible approach to teacher training. The majority of your time will be spent in the school, training in the classroom and being supported by experienced teachers and mentors. On Monday's you will also spend time studying at the University.","personalQualities":"","otherRequirements":"Following the interview, strong candidates who are not able to demonstrate graduate level knowledge in the subject they wish to teach may be offered a place on the course subject to successfully completing a Subject Knowledge Enhancement (SKE) course in the subject prior to commencing your teacher-training year.","status":1,"createdAt":"2021-07-06T10:55:15.212Z","updatedAt":"2021-09-29T14:13:53.480Z","canSponsorStudentVisa":"yes","cycle":"2024"}
