{"id":"db2a3b90-077b-401e-b169-d6bf4642e094","name":"Music","code":"27BD","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"24311bef-8673-41fb-933c-53f887fb6976","code":"W3","name":"Music"}],"locations":[{"id":"23a02a69-673f-4d5d-91c7-68b248e4994c","name":"Catmose College","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"be910803-8849-4a51-8edb-9437052c53c9","code":"1F1","name":"The Rutland and District School Federation"},"accreditedBody":{"id":"d2b7d074-fac9-42c5-a0d3-d5471b35f7d9","code":"N91","name":"Nottingham Trent University"},"profPost":"BO","degreeGrade":"1","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"financialSupport":"As a School Direct trainee, you will be entitled to the same financial support as trainees on other postgraduate teacher training courses.\r\n\r\nIf you are a UK or EU trainee, you should be eligible for a student loan, maintenance loan and maintenance grant to cover the cost of your study and will only start paying the loans back when you start earning over £21,000 per annum.\r\n\r\nYou may be eligible to receive a training bursary, dependent on the subject you train for and a degree classification.","aboutCourse":"This teaching degree provides graduates with the knowledge, skills and experience necessary to teach Music at secondary level. Time is spent in the University and in classroom placements, ensuring that by the end of the course, trainees are confident professionals ready to begin teaching in secondary schools.\r\n\r\nThe School Direct secondary course in Music provides the chance to train with enthusiastic education professionals committed to music as an entitlement for all pupils. It offers a broad holistic training for the 11-18 age phase across a wide range of perspectives, including those of pupils, schools, higher education, the LEA, peripatetic, vocational and extra-curricular viewpoints. The course consists of a mix of practical, hands-on experience needed to equip trainees for the diverse range of challenges faced by music teachers in the 21st Century.\r\n\r\nThe subject teaching part of the course will focus on creative music-making in the classroom, the National Curriculum, examination and vocational courses in music – methodologies, assessment and progression. Developing effective teaching and learning strategies to ensure music is a vibrant experience for all pupils, techniques for enabling effective performance experience for all pupils and composing with and for young people is also explored. Other themes include using music technology in the classroom, world music and issues of classroom management.","interviewProcess":"You will be invited to an interview with one of the Rutland Teaching Alliance partner schools as part of the selection process. At this interview, you will have an opportunity to take part in a number of school-based activities during a normal school day.\r\nThey will include:\r\n*An opportunity to meet with the subject Team Leader and other colleagues\r\n*Teach part of a lesson to a small group\r\n*Individual Interview\r\n\r\nYou will also be invited to a second interview at Nottingham Trent University.","howSchoolPlacementsWork":"The lead school organises your placements within the teaching alliance.\r\n\r\nThe School Direct course is a flexible approach to teacher training. The majority of your time will be spent in the school, training in the classroom and being supported by experienced teachers and mentors. On Monday's you will also spend time studying at the University.","personalQualities":"","otherRequirements":"Following the interview, strong candidates who are not able to demonstrate graduate level knowledge in the subject they wish to teach may be offered a place on the course subject to successfully completing a Subject Knowledge Enhancement (SKE) course in the subject prior to commencing your teacher-training year.","status":1,"createdAt":"2021-07-06T10:55:14.652Z","updatedAt":"2021-09-29T14:12:45.673Z","canSponsorStudentVisa":"yes","cycle":"2024"}
