{"id":"7f0c59b7-3793-4157-9dbd-9db779fd7f73","name":"Primary","code":"2P52","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"9e73cfc2-a5e6-486a-b0d4-7891072a782f","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"74257f90-0cf3-49f1-a882-3e50d9631d54","code":"262","name":"Our Lady and St Hubert’s Catholic Primary School"},"accreditedBody":{"id":"0ab5238e-606a-4f42-9aea-90d321ad7dc8","code":"2B3","name":"Haybridge Alliance SCITT"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feesInternational":9250,"financialSupport":"Once individuals have accepted a place, they can then make applications for tuition fee loans through Student Finance England, to cover the cost of their training.","aboutCourse":"The courses will begin in September 2021 and last for one academic year with a trainees time being divided between school based placements (approximately 80%) and structured training days (approximately 20%) which will take place at either Our Lady & St. Hubert's or at one of our partner organisations (University of Birmingham) and focus upon key educational theory and practice.\r\nOn the 46 week programme a trainee’s time is divided between Teaching Experiences and structured training sessions looking at subject delivery and wider professional issues. The teaching commitment will build up over the year: 50% in the Autumn term, 60% in the Spring term and 80% in the Summer term. During the course trainees will be supported by their school-based practitioner who will be a good or outstanding teacher and leader within the school.\r\nTrainees will be assessed on a combination of evidence gathered during the teaching experiences, a range of tasks linked to Our Lady & St. Hubert's/partnership workshops as well as three formal assignments that focus on key areas of teaching and learning.","interviewProcess":"","howSchoolPlacementsWork":"School direct is a school-led training course which gives you the chance to learn ‘on the job’ in a school. You work as part of the teaching team from day one, learning from experienced, highly-skilled colleagues and you immediately put your new skills into practice.\r\nYou spend on average 80% of the week in one of our 5 primary partnership schools teaching in EYFS and Key Stage 1 and Key Stage 2.\r\nWe have worked very closely with our partnership schools over many years and have excellent relationships with them. They share our ethos, understanding the importance and value of school led teacher training.\r\nYou will have three school experiences throughout the year ensuring you gain experience in EYFS, key stage 1 and 2 enabling you to teach 5-11 year olds. You spend your first and last school experience in the same class, in the same school. Your second school placement is in different school ensuring you gain a wider experience in your training.\r\nYou also spend time in key stage 2 and spend a day at a local secondary school in order to gain experience of the key stage above where you will be qualified to teach.","personalQualities":"","otherRequirements":"Successful candidates will be required to carry out an enhanced DBS check before commencing the programme.","status":1,"createdAt":"2021-07-06T10:47:24.523Z","updatedAt":"2021-09-09T11:52:57.997Z","canSponsorStudentVisa":"no","cycle":"2024"}
