{"id":"3233364b-b5f2-4ee5-9440-ec6fc081f5a3","name":"Primary","code":"T780","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"B","ageRange":"3_to_7","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"d98eb16b-e547-43f7-be0d-b23511a49b76","name":"Main Site","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"5858c462-7871-46f6-ab20-c35503f4763c","code":"29R","name":"Castle Newnham Partnership"},"accreditedBody":{"id":"af388cc3-644a-4fd3-bd71-55503b74fc21","code":"B22","name":"University of Bedfordshire"},"profPost":"PG","degreeGrade":"1","english":"1","maths":"1","science":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feeDetails":"For fee details contact admissions at The University of Bedfordshire \r\n\r\nPgce.Admissions@beds.ac.uk","aboutCourse":"This route is Primary Early Years (age 3-7)\r\n\r\nCastle Newnham works in partnership with the University of Bedfordshire to provide you with a course that has a predominantly professional focus. \r\n\r\nAll PGCE courses offer 60 Master’s Level Credits with placements across two different settings/schools over the year. Each week of this popular course sees Monday-Thursday being school centred with Fridays in University using the prestigious facilities of the Bedford campus. \r\n\r\nIn studying a primary (early years) route, you will be on a course designed to enable you to join a challenging and rewarding profession – becoming an effective and inspiring teacher who draws on broad subject knowledge and secure understanding of teaching and learning theories - with the knowledge and skills to lead learning and initiate change in educational settings\r\n\r\nYou will explore your understanding of primary and early years teaching and learning, as you apply your subject knowledge and expertise to planning teaching and managing the classroom; honing your skills of critical self-evaluation and improvement\r\n\r\nYou will be supported throughout by a skilled, energetic and dedicated Primary teaching team and an experienced mentor. \r\n\r\n\r\n","interviewProcess":"The school part of the interview will take place  at Castle Newnham with social distancing in place. You will be able to meet teachers, discuss why you wish to teach in a primary setting and ask us questions about the course.\r\n\r\nThe university interview\r\n\r\nThe university will be using webinars and video interviews to replace face to face methods during COVID19 - please apply as normal.  The interview will consist of an introductory talk, followed by a group activity and finally a personal interview. University lecturers and representatives from partnership schools will conduct the interviews. You should be aware that subject knowledge across Early Years and Key Stage 1 will be explored at interview to help set you subject knowledge development targets ahead of the start of the course and you should prepare for such questions.\r\n","howSchoolPlacementsWork":"Over the year you will have two placements. You will spend four days per week in your school placement and Fridays are spent at The University of Bedfordshire with other PGCE trainee teachers. \r\n\r\nDuring your course you will spend a minimum of 120 days across two different schools so that you can develop your teaching skills for Early Years and KS1 across the 3-7 age range. \r\n\r\nWe are firmly committed to developing the skills of all our staff and we are the lead school in the training partnership (Schools Direct) with the University of Bedfordshire. \r\n\r\nWe hold weekly teaching and learning briefings to which all staff make a contribution to ensure we include evidence, research and debate in our practice.\r\n","personalQualities":"","otherRequirements":"All suitable applicants will be interviewed and any offer of a place will be subject to receiving DBS (Disclosure and Barring Service) and medical clearance.","status":1,"createdAt":"2021-07-06T10:54:36.519Z","updatedAt":"2021-07-08T11:51:47.411Z","canSponsorStudentVisa":"yes","cycle":"2024"}
