{"id":"c5f061c7-20ed-4e4a-b4ee-208e2fd51fa0","name":"History","code":"2SKM","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"5a3609a0-5bbb-4377-b919-5d89932ab622","code":"V1","name":"History"}],"locations":[{"id":"d98eb16b-e547-43f7-be0d-b23511a49b76","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"5858c462-7871-46f6-ab20-c35503f4763c","code":"29R","name":"Castle Newnham Partnership"},"accreditedBody":{"id":"af388cc3-644a-4fd3-bd71-55503b74fc21","code":"B22","name":"University of Bedfordshire"},"profPost":"BO","degreeGrade":"1","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Castle Newnham works in partnership with the University of Bedfordshire to provide you with a course that has a predominantly professional focus. You will undertake placements in two different schools and spend one week in a primary setting during your training. You will be supported throughout by a skilled, energetic and dedicated History department team and an experienced mentor. \r\n\r\nEach Friday is spent at the University of Bedfordshire alongside other PGCE students.\r\n","interviewProcess":"School interviews take place at Castle Newnham School with social distancing in place. You will be able to meet members of staff, see our facilities and ask any questions you might have about the course.\r\n\r\nThe university part of the interview will consist of webinars and video interviews to replace face to face methods during COVID19 - please apply as normal. It will consist of an introductory talk, followed by a group activity and finally a personal interview. \r\n\r\nUniversity lecturers and representatives from partnership schools  will conduct the interviews. Subject knowledge across Key Stage 3 and Key Stage 4 will be explored at your interview to help set you subject knowledge development targets ahead of the start of the course.\r\n","howSchoolPlacementsWork":"Over the year you will have two placements. You will spend four days per week in your school placement and Fridays are spent at The University of Bedfordshire with other PGCE trainee teachers.\r\n\r\nOne of your placements will be at Castle Newnham School.\r\n\r\nAt Castle Newnham School, teaching staff work in primary or secondary teams. We are firmly committed to developing the skills of all our staff and we are the lead school in the training partnership (Schools Direct) with the University of Bedfordshire. \r\n\r\nWe hold weekly teaching and learning briefings to which all staff make a contribution to ensure we include evidence, research and debate in our practice.\r\n\r\n","personalQualities":"You need to be enthusiastic and dedicated with great subject knowledge and the ability to enthuse pupils. \r\n\r\n ","otherRequirements":" It is important that your application is presented in an accurate and professional manner. Your personal statement is your opportunity to provide your reasons for wishing to pursue a career in teaching, to mention any additional skills you may have and to reflect on your experiences. ","status":1,"createdAt":"2021-07-06T10:54:36.289Z","updatedAt":"2021-07-07T14:25:14.573Z","canSponsorStudentVisa":"yes","cycle":"2024"}
