{"id":"f9b8b618-b178-4364-8fd2-29b695cc1f22","name":"Primary","code":"2SJS","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"B","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"d98eb16b-e547-43f7-be0d-b23511a49b76","name":"Main Site","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"5858c462-7871-46f6-ab20-c35503f4763c","code":"29R","name":"Castle Newnham Partnership"},"accreditedBody":{"id":"af388cc3-644a-4fd3-bd71-55503b74fc21","code":"B22","name":"University of Bedfordshire"},"profPost":"BO","degreeGrade":"1","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feeDetails":"For fee details contact admissions at The University of Bedfordshire \r\n\r\nPgce.Admissions@beds.ac.uk","aboutCourse":"Castle Newnham works in partnership with the University of Bedfordshire to provide you with a course that has a predominantly professional focus. \r\n\r\nYou will undertake placements in two different schools covering KS1 and KS2.  You will also spend one week in a secondary setting during your training. You will also spend a week in a foundation stage setting.\r\n\r\nYou will be supported throughout by a skilled, energetic and dedicated Primary teaching team and an experienced mentor. \r\n\r\nEach Friday is spent at the University of Bedfordshire alongside other PGCE students.\r\n","interviewProcess":"The school part of the interview will take place  at Castle Newnham with social distancing in place. You will be able to meet teachers, discuss why you wish to teach in a primary setting and ask us questions about the course.\r\n\r\nThe university interview\r\n\r\nThe university will be using webinars and video interviews to replace face to face methods during COVID19 - please apply as normal.  The interview will consist of an introductory talk, followed by a group activity and finally a personal interview. University lecturers and representatives from partnership schools will conduct the interviews. You should be aware that subject knowledge across Key Stage 1 and Key Stage 2 will be explored at interview to help set you subject knowledge development targets ahead of the start of the course and you should prepare for such questions.\r\n","howSchoolPlacementsWork":"Over the year you will have two placements. You will spend four days per week in your school placement and Fridays are spent at The University of Bedfordshire with other PGCE trainee teachers.\r\n\r\nWe are firmly committed to developing the skills of all our staff and we are the lead school in the training partnership (Schools Direct) with the University of Bedfordshire. \r\n\r\nWe hold weekly teaching and learning briefings to which all staff make a contribution to ensure we include evidence, research and debate in our practice.\r\n","personalQualities":"","otherRequirements":"It is important that your application is presented in an accurate and professional manner. Your personal statement is your opportunity to provide your reasons for wishing to pursue a career in teaching, to mention any additional skills you may have and to reflect on your experiences. ","status":1,"createdAt":"2021-07-06T10:54:36.054Z","updatedAt":"2021-07-08T11:46:34.430Z","canSponsorStudentVisa":"yes","cycle":"2024"}
