{"id":"2c9c52b5-e1d1-4fb4-83f4-2b6c10916464","name":"Chemistry","code":"3DWW","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"912d4fb4-761b-42e9-8dc6-e968b791ea4e","code":"F1","name":"Chemistry"}],"locations":[{"id":"fca521b5-6c7b-42ef-969b-ee852e5dfb51","name":"Main Site","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"467ebfc9-625d-4e7b-a1b3-0c08029163b4","code":"2AJ","name":"New Collaborative"},"accreditedBody":{"id":"791f82c8-19fd-4339-9c7b-301dee8067ce","code":"H60","name":"University of Huddersfield"},"profPost":"BO","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feeDetails":"You can apply for a tuition fee loan as part of your application to Student Finance England for loans and grants. Student Finance England will pay your fees direct to the University.\r\n\r\nYou don’t have to pay the loan back while you study. It will only be repayable when you have left the course and earn over £25,000 a year.\r\nWhen you enrol we will ask you who will be paying for your fees and whether you have requested a loan. If you have not taken the loan, we will send you an invoice for the fees, which will require payment in full during the relevant academic year.\r\n\r\nIf you are an international student coming to study at the University of Huddersfield, please visit the [International Fees and Finance pages](https://www.hud.ac.uk/international/tuition-fees/) for full details of tuition fees and support available.\r\n","financialSupport":"You could be eligible for either:\r\n*\ta scholarship of £28,000\r\n*\ta bursary of £26,000\r\n\r\nTo qualify for a scholarship you’ll need a degree of 2:1 or above in Chemistry or a related subject. For a bursary you’ll need a 2:2 or above in any subject.\r\nYou can’t claim both a bursary and a scholarship - you can only claim one.\r\n\r\nFind out how to apply for a scholarship [ https://getintoteaching.education.gov.uk/funding-and-salary/overview/scholarships ]. \r\nYou don’t need to apply for a bursary - if you’re eligible, you’ll automatically start receiving it once you begin your course. \r\n","aboutCourse":"If you’ve got an undergraduate degree and are striving to become a secondary school Chemistry teacher, then studying our one-year Secondary Chemistry PGCE with QTS will help you on your way. You’ll develop your subject specialist knowledge alongside hands-on classroom experience. Successful completion of your PGCE course prepares you to start your first teaching post within a secondary school setting. Our course is designed to prepare you to teach pupils in the 11-18 age range.\r\nThe course programme is divided into two main themes:\r\n\r\n* Developing Specialist Subject Knowledge\r\nYou’ll have the opportunity to develop your subject teaching in a stimulating way, using different methodologies and new technologies to inspire and engage young people. We’ll help develop your understanding of the Chemistry curriculum; how learners make progress in Chemistry; planning and curriculum development in Chemistry, examination requirements and inclusion issues in Chemistry.\r\n\r\n* Supporting Learning and Progress in the Secondary School\r\nWe’ll prepare you for the classroom, allowing you to develop your teaching skills and understanding of how to meet the needs of all learners. Themes include how young people learn, teaching and learning techniques to support pupils’ progress; behaviour management, assessment, inclusive, creative and innovative teaching methods and how to plan lessons and sequences of lessons. You will research evidence based learning theories, gain a greater understanding of current professional issues in secondary schools and begin to develop your own educational philosophy.\r\n\r\nYou’ll learn in small, friendly and supportive groups, designed to give you the confidence to succeed. Course tutors are experienced teachers and you’ll have a personal academic tutor to support you through your studies. Teaching is through workshops, tutorials and lectures, some with guest speakers, and through group work with other trainee teachers.\r\nAssessment is typically through the completion of a range of classroom activities, written assignments, reports, personal subject audits and the development of portfolios of evidence. There are no formal examinations and the assignments are carefully designed to help you to develop your teaching practice further. Upon successful completion of the programme we recommend Qualified Teaching Status be awarded by the Department for Education.\r\n\r\nTwo of the PGCE modules are at Master’s level and you’ll have the opportunity to continue your studies further to complete a Master’s degree, supporting your NQT year and early professional development.\r\n","interviewProcess":"You will be shortlisted for interview based on your application. The interview process typically lasts for half a day. The following selection procedures are designed to assess your suitability to train to teach:\r\n\r\n* You will be asked to teach a concept from your subject area\r\n* You will participate in a group task which is designed to investigate your understanding of teaching and learning and the role of a secondary school teacher\r\n* Complete tasks designed to evaluate your fundamental English and mathematics skills\r\n*You will also have an individual interview with a member of the course team which will include a discussion about your subject knowledge.\r\n","howSchoolPlacementsWork":"For all trainees, their school based training is the central element of their initial teacher education. You will undertake at least two compulsory placements as part of your course and will spend 120 days in at least two schools. You’ll benefit from being able to observe experienced teachers, from practical hands-on experience and from supportive mentoring to help you to develop into a confident and successful teacher.\r\n\r\nYou’ll experience the wider role of a teacher in secondary education. You’ll have the support of both subject and professional mentors in schools who will help you to develop your practice through observations, planning meetings, weekly tutorials, reports and in-depth lesson evaluations.\r\nYour university tutor will visit you in school to guide, support and evaluate your progress. There is an emphasis on practical engagement with the curriculum whilst developing your understanding of the theoretical perspectives which underpin the best models of classroom practice.\r\n","personalQualities":"You must demonstrate the ability to communicate effectively, and that you have the intellectual and academic capabilities to meet the required Teachers' Standards by the end of the programme.","otherRequirements":"* Offers will be subject to satisfactory Disclosure and Barring Service enhanced disclosure check and trainees must not previously have been barred from teaching or working with children. We also ask you to complete a health declaration to ensure that you have the health and physical capacity to teach.\r\n\r\n* You should provide two references. Where applicants have current or recent experience working with children or young people, one of the referees should be a member of staff who can comment on your potential to train to teach.\r\n","status":2,"createdAt":"2021-07-06T10:49:36.435Z","canSponsorStudentVisa":"no","cycle":"2024"}
