{"id":"832f79d8-6006-4c9a-9639-cf439e8b30b6","name":"Primary 5-11","code":"B516","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"e92900ee-e8b7-4cc2-bf37-cab3a9583cce","name":"Redhill Teaching Hub","isPublished":"Y","status":"R","vacancies":"F"},{"id":"7050d0e9-954b-4016-9759-0944af8c9106","name":"Tupton Primary and Nursery Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"3eaca810-aeed-4d65-aa41-b036bb4802e2","name":"Sir John Sherbrooke Junior School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"d9c76a07-1423-40ee-aaa3-2661f751798c","name":"Lowdham C of E Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"105ba823-f0df-49bc-84eb-435deae2875b","name":"Arnold View Primary School","isPublished":"Y","status":"R"},{"id":"cbe3c2f5-6fd1-4867-b2d5-6b9051422fec","name":"Carlton Junior Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"48fe2904-099c-4195-a499-aafc930799e8","name":"North Wingfield Primary and Nursery Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"69d27b6d-baf9-463d-a6fb-572bd43e1a6c","name":"Robert Mellors Primary Academy","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"8dd269b3-7447-4f81-b265-176ccb949209","code":"2A5","name":"Redhill SCITT – Inspiring Leaders Teacher Training"},"profPost":"PG","degreeGrade":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feeDetails":"Trainees are charged £9,250 in tuition fees by Inspiring Leaders, the standard rate for postgraduate courses. Trainees are entitled to the same financial support as trainees on other postgraduate teacher training courses. Those from the UK or EU are eligible for student loans to cover tuition fees and maintenance. \r\n\r\nFor more information, see the DfE website https://getintoteaching.education.gov.uk/funding-your-training\r\n","aboutCourse":"You will be trained in a highly supportive and aspirational environment and will develop the rigour, professional knowledge, understanding and skills necessary for the delivery of creative, purposeful and challenging teaching and learning.  Whilst training you will be working alongside caring and supportive professionals who will invest in your success and support you every step of the way.\r\n\r\nOur mentors are outstanding and experienced teachers and are required to undertake an intensive training programme to develop their skills in coaching, effective classroom observation techniques and feedback skills. You will be in the safest of hands as a trainee within the Redhill SCITT team. Our in-house training is delivered by leading professionals with many years of experience of both teaching and training teachers.\r\nA list of our partner schools is available on our website: www.redhillhub.org.uk and www.inspiringleadersscitt.com and we have the capacity to train over a number of subjects across these schools. Whilst we cannot guarantee a placement at a particular school, prior to interview, we will take into account individual requests and location and travel time for individual trainees will always play an important role in our choice of placements. \r\n\r\nThis course leads to the Postgraduate Certificate in Education or the Professional Graduate Certificate in Education. Successful completion of the PGCE at level 7 gives you up to 60 Masters level credits. \r\n","interviewProcess":"Our admissions team will conduct an initial check, to determine whether you meet the eligibility criteria. We will then consider your application, and agree whether to invite you to interview. If you are selected for interview, you will be sent information about the course and about the interview process, together with guidance on how to prepare. The interview process will take place online or at one of our partner schools.\r\n\r\nThe interview will enable you to meet key staff and would usually involve a morning or afternoon. The interview will typically include a tour of the school, delivery of a numeracy-based teaching activity (with a group of pupils) and a literacy-based audit task. In addition, there will be a 30-minute formal interview. Should you be successful in your application and invited to interview, you will be given full details of the teaching task you will be required to deliver and in plenty of time to allow you to prepare thoroughly.\r\n","howSchoolPlacementsWork":"Most of your training will take place within the environment of one of our partner schools. Training is delivered by expert and outstanding practitioners, enhanced by attendance at our training sessions and academic sessions at NTU. You will have a main placement school to which you will be assigned from August. You will then undertake a six week alternative placement in the first half of the spring term. Your main placement will be in your chosen key stage and your second placement will give you opportunity to experience not just a different school, but also a different key stage, giving you a beneficial breadth and depth of experience.\r\n\r\nPlease note, we always carefully consider the right school for your placement, taking into account your location, your qualifications and your previous experience as well as the mentoring capacity of the host school.  We will try wherever possible to involve prospective placement schools in our interview process.  Our priority will always be to place a trainee where we think they are going to be most successful.\r\n","personalQualities":"We are looking for ambitious trainees who are passionate and enthusiastic about their subject area and have a desire to share that with young people. We are looking for a broad level of subject knowledge and excellent literacy and numeracy skills.  Experience of working with children or young adults is ideal. Whilst there is no longer a requirement for trainees to have experience in schools prior to applying, it is useful to remember that experience observing in schools will help prospective trainees prepare for their interview and their ongoing training.","otherRequirements":"You will need to undergo a Disclosure and Barring Service check (formerly known as a Criminal Records Bureau or CRB check) and to provide information relating to Childcare Disqualification regulations.\r\n* We have a 'Readiness for Teaching' program designed to enhance previous school experience or provide you with valuable insights into teaching while school experience is unable to proceed. If you would like to join these free and informative sessions then please check the dates on the Inspiring Leaders website.\r\n","status":1,"createdAt":"2021-09-17T07:23:05.390Z","updatedAt":"2021-09-17T07:27:40.942Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
