{"id":"1337d386-ef2a-489b-b1df-d712751ee61d","name":"Primary","code":"2BKV","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"d2fd9305-ec60-4021-b668-27458502a04f","name":"West Exe School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"1c56963b-b234-4e95-af6f-c0065c05b290","name":"St Leonard's (CofE) Primary School (VC)","isPublished":"Y","status":"R","vacancies":"F"},{"id":"09b2898e-0793-40ab-8429-b77e85e9d743","name":"St Martin's C of E Primary and Nursery School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"b2c8e522-7a89-46ae-a05f-7efe3d87755c","name":"White Rock Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"1c57c88e-2b61-4d9a-b064-203f33150e14","name":"Alphington Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"e728ef75-b907-45e1-b39b-2487ca13706e","name":"Axminster Community Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"c0a5d4d9-eae8-4f3c-bce6-36632a6225f4","name":"Exwick Heights Primary School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"01d80a6c-df73-444e-93d8-661684d1eab8","code":"1QX","name":"Exeter Consortium"},"accreditedBody":{"id":"ff5e78c6-2928-44d6-b4e6-8fa2fed5feb7","code":"S66","name":"South West Teacher Training"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Our Primary 5-11 programme (2BKV)  provides an internationally respected school-based route into teaching. You will be well prepared to teach across the full primary range. We also offer Primary 3-7 (2TXN). The training is entirely practitioner-led, designed and run by excellent schools and teachers from within our wide partnership. By training with us, new teachers are learning about the profession entirely from current practitioners who are keen to share their expertise. Our partnership proudly sees this route as a recruitment pipeline of excellent new teachers for our schools and so takes care to ensure our training is as up-to-date and relevant as possible.  You will spend much more time in school compared to conventional PGCE programmes.  Your confidence is built gradually and in a personalised way; you are supported to develop your confidence over the year so that by the end of the Summer Term, you will be teaching 70% or more, in readiness for your teaching post in September! \r\n\r\nWe provide you with:\r\n\r\n* Excellent innovative, research-informed teaching \r\n* 60 Master's credits \r\n* A placement in Key Stage 1 and another in Key Stage 2 in a contrasting school\r\n* Enrichment experiences in other settings\r\n* Personalised levels of  support from University and School-based tutors \r\n* Shorter training days to allow for a work-life balance\r\n* Support for your Early Career Teacher (ECT) year\r\n\r\nOur programme has been written by Headteachers in response to their requirements for ECTs. We cover important areas early on in the year, such as Special Educational Needs and Behaviour Management. Training is interwoven with your school experience, allowing you to embed theory into your practice. We ensure trainees have the skillsets desirable to our  schools, as described by one of our Federation Heads: \"We recently interviewed several trainees from a range of providers for an Early Year's post. The quality of the trainees from Exeter Consortium, in terms of depth of knowledge, practical experiences and their ability to articulate their learning was outstanding.  All in all, it was clear that the course is significantly strong in preparing teachers for entry into the profession.\" \r\n\r\nYou will complete three assignments for the PGCE with Bath Spa University, rated Outstanding for ITT, who visit us in Exeter. Bath Spa provide regular tutorials. \r\n\r\nBuilt into our programme is a focus on well being; our cohort is purposefully small, so we can offer personalised support throughout the year.\r\n","interviewProcess":"We carry out our interviews virtually to allow for a flexible process for all. If you would like a face-to-face meeting prior to your interview, we are able to meet in a safe way in our offices on request. \r\n\r\nOnce shortlisted, you will be invited to an online interview that will involve:\r\n\r\n* a short presentation of a planned lesson   \r\n* a written task \r\n* a panel interview \r\n* a reflection task \r\n* opportunities to talk with a current trainee via telephone \r\n\r\nSuccessful candidates are  greeted with a Welcome Pack which helps them through the preparations required to start the course along with useful support materials to help them make the most of their training year.  We pride ourselves on communicating regularly with successful candidates so they quickly become part of the Exeter Consortium community. \r\n\r\nApplicants are encouraged to make contact with the office by 'phone or email and are welcome to chat informally with an adviser before submitting an application. We are committed to making interviews as stress-free as possible - recognising how challenging they can be!  We find that candidates do really enjoy our interviews together with the opportunity to obtain further information about Exeter Consortium and our programmes. All candidates are offered feedback as soon as possible following interview. ","howSchoolPlacementsWork":"You will be placed in a 'home' school for the whole of the Autumn and Summer Terms, and a contrasting school for the Spring Term where you will teach within the opposite key stage. We also provide you with three days of adjacent key stage experience. You have a school mentor as well as a visiting tutor to quality assure your placement. \r\n\r\nWe make every effort to place trainees within schools that are accessible for them and which meet their needs. We can offer experience and placements in schools which have specialist SEN provision as well as experience within the hospital setting. We cannot guarantee that your placement will be within a particular school, but our partnership allows for a wide range of suitable placements in order to offer you the best training experience possible.  \r\n\r\nTrainees come together as a cohort for the taught elements of the course each week. The practical, school based learning dovetails into the academic course.  The Consortium and its schools have an enviable track record in CPD and staff development and value the opportunity to prepare the next generation of outstanding teachers for their schools. Some of the training is delivered at West Exe School  and some training is delivered by Specialist Leaders in Education (SLEs) in their own schools, allowing you to visit many schools  over the year and see a diverse range of settings. Each term you will have a block practice where you are in school for whole weeks, allowing you to fully focus on your teaching. \r\n\r\nWe aim to provide the best possible educational outcomes for all our children.  Our trainers and mentors are excellent practitioners, many of whom are Senior Leaders in Education (SLEs) in our Consortium schools, keen to share their expertise with future colleagues.  Being trained by these key staff from schools across the city, gives you links and allows you to network with your future colleagues.  The outstanding success of our teacher training in Exeter is clear affirmation of the vision and hard work of our partner schools!\r\n","personalQualities":"We welcome candidates who have what  it takes to become  outstanding teachers.  There are particular qualities that such teachers possess:\r\n\r\n- a passion for teaching\r\n- a desire to positively impact on children's lives\r\n- an ability to form positive relationships with children and adults\r\n- an engaging and approachable nature\r\n- strong organisational skills\r\n- good interpersonal skills\r\n- creativity and innovation\r\n- an exciting approach to learning\r\n- the ability to reflect on practice\r\n- a positive and professional outlook\r\n\r\nWe are keen to recruit applicants who can demonstrate such qualities - together with the determination to succeed.\r\n\r\n\r\n","otherRequirements":"* A satisfactory DBS enhanced check\r\n* Safeguarding is paramount  and candidates must satisfy relevant pre-employment checks. A place to train with us will involve contact with vulnerable groups (children and young people) and is  exempt from the Rehabilitation of Offenders Act 1974 and subject to an Enhanced Disclosure Barring Service (DBS) check. \r\n* Trainees will complete a diagnostic maths skills test and then will undergo maths tuition at their own pace over the year in order to gain the expected standard of maths skills. \r\nSupport is available in all curriculum areas as needed.\r\n","status":1,"createdAt":"2021-07-06T10:54:04.214Z","updatedAt":"2021-09-14T11:03:10.248Z","canSponsorStudentVisa":"no","cycle":"2024"}
