{"id":"1375ae69-2c41-4f56-b252-28949ebba784","name":"Physical Education","code":"332Q","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"74d64a54-5e34-4590-b6c7-528dd0cf26fe","code":"C6","name":"Physical education"}],"locations":[{"id":"c0a5d4d9-eae8-4f3c-bce6-36632a6225f4","name":"Exwick Heights Primary School","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"01d80a6c-df73-444e-93d8-661684d1eab8","code":"1QX","name":"Exeter Consortium"},"accreditedBody":{"id":"ff5e78c6-2928-44d6-b4e6-8fa2fed5feb7","code":"S66","name":"South West Teacher Training"},"profPost":"BO","degreeGrade":"1","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"The School Centred Initial Teacher Training PGCE programme in PE sets out to introduce trainees to a range of strategies for teaching the subject at Key Stage 3 and Key Stage 4 (including examination courses).\r\nThe aim of this innovative course is to develop effective teachers who will inspire the next generation of 11 to 16 year olds to be physically active. Post 16+ enhancements will also be available. Trainees will have a solid grounding in the concepts of healthy lifestyles, anatomy, performance, creativity interwoven with the relevant physical educational skills.\r\nIt is envisaged that trainees will join the Course from a diverse range of sporting backgrounds, whether a talented sports person or those with a wider set of sport and fitness skills. Applicants are expected to hold an honours degree of 2:2 or above in Sport or a coaching/sport related subject. It is important that trainees share their passion for their subject with the students they teach. Applicants will need to demonstrate an ability to communicate effectively with students. The Course will audit and build upon skills and theory of PE to produce teachers capable of delivering the full range of PE courses from 11 to 16 years.\r\nTrainees will develop and record their personal skills, knowledge and capability in physical education through a structured PE Subject Knowledge Audit. This will be used to help establish areas of expertise and areas for personal development. As with other aspects of the PGCE programme, the materials used will be progressive and build upon the skills of each student and their experiences in two school placements.\r\nThe PGCE programme aims to produce reflective teachers who are able to evaluate and further develop their own subject and teaching skills.\r\n","interviewProcess":"Under guidance from the Department for Education, SWTT continues to recruit throughout this period in response to the Covid 19 pandemic. Applicants will still be shortlisted in the usual manner. Once shortlisted, applicants will be invited to an online interview that will involve:\r\n\r\n* a short presentation – how would you teach an aspect of your subject to a group of children?\r\n* a subject knowledge assessment – how familiar are you with the content of the current school curriculum in your subject?\r\n* a PGCE readiness task assessing your ability to read and write at Masters Level\r\n* a panel interview with the SCITT Lead and the Course Tutor for your subject, as well as young people from West Exe School.\r\n* opportunities to meet the core SWTT team and ask questions about the programme.\r\n\r\nInterviews take around 2 hours and candidates are given 5-7 days notice to allow them time to prepare.\r\n\r\nSuccessful candidates are then greeted with a Welcome Pack which helps them through the preparations required to start the course. We pride ourselves on communicating regularly with successful candidates so they feel like a part of the South West Teacher Training community.\r\n","howSchoolPlacementsWork":"South West Teacher Training has a wide partnership of fifteen placement schools in Exeter, Plymouth and in rural and coastal communities across Somerset, Devon and Cornwall. This enables us to place trainees within easy travelling distance of home - we feel this is important to ensure trainee well-being and resilience. It's unusual for our trainees to spend more than thirty minutes travelling to placement. \r\n\r\nWhen placing our trainees, we consider their location but we also make an effort to ensure a good match in ethos between the trainee and their host school. It's important too that trainees experience two contrasting placements to enable them to really discover the kind of school culture that suits them best.\r\n\r\nAs a school-centred route, we pride ourselves on ensuring our trainees spend as much time in school as possible. After a week's Induction, trainees complete three days of experience in a Primary school and then begin the first of two placements in an 11-16 or 11-18 setting. This quick immersion into school life, integrated with training sessions at our training base, ensures trainees are able to swiftly start teaching under expert guidance, with time to reflect built into the programme.\r\n","personalQualities":"We will be looking for candidates who demonstrate:\r\n* a passion for sharing their subject with young people\r\n* an ability to form positive working relationships with children and adults\r\n* strong subject knowledge that they can communicate with others\r\n* a range of experience of school settings or working with young people\r\n* a professional demeanour\r\n* resilience and creativity\r\n* positivity and a strong sense of moral purpose for improving the lives of young people.\r\n","otherRequirements":"Safeguarding is important at South West Teacher Training  and all candidates must satisfy relevant pre-employment checks.\r\nA place to train with us will involve contact with vulnerable groups (children\r\n and young people) and is therefore exempt from the\r\nRehabilitation of Offenders Act 1974 and subject to an\r\nEnhanced Disclosure Barring Service (DBS) check. This\r\nexemption means that applicants for this post are required to\r\ndeclare all criminal convictions, cautions, reprimands and bindovers\r\nboth spent and unspent in their application regardless of\r\nthe passage of time.\r\n","status":1,"createdAt":"2021-07-06T10:54:04.607Z","updatedAt":"2021-10-06T13:46:13.655Z","canSponsorStudentVisa":"no","cycle":"2024"}
