{"id":"a466a480-25c1-4c2d-a4ae-be62cfabda55","name":"Chemistry","code":"2BL5","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"912d4fb4-761b-42e9-8dc6-e968b791ea4e","code":"F1","name":"Chemistry"}],"locations":[{"id":"c0a5d4d9-eae8-4f3c-bce6-36632a6225f4","name":"Exwick Heights Primary School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"01d80a6c-df73-444e-93d8-661684d1eab8","code":"1QX","name":"Exeter Consortium"},"accreditedBody":{"id":"ff5e78c6-2928-44d6-b4e6-8fa2fed5feb7","code":"S66","name":"South West Teacher Training"},"profPost":"PG","degreeGrade":"1","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"The Science National Curriculum states that “Science has changed our lives and is vital to the world’s future prosperity, and all students should be taught essential aspects of the knowledge, methods, processes and uses of Science. Through building up a body of key foundational knowledge and concepts, students should be encouraged to recognise the power of rational explanation and develop a sense of excitement and curiosity about natural phenomena. They should be encouraged to understand how Science can be used to explain what is occurring, predict how things will behave, and analyse causes.”\r\n\r\nThe Science programme is designed to enable you to teach, as a minimum, all the Science specified in the National Curriculum for Science at Key Stage 3, and your chosen Science specialism (Biology, Chemistry or Physics) at Key Stage 4 and at post-16. Trainees join the course with a variety of Science degrees and backgrounds. Few, if any, are confident from the start in all aspects of Science demanded by the National Curriculum or even by their own subject specialism. Early in the course you will complete a personal audit and begin an action plan to build on your subject knowledge, initially for KS3, then for GCSE and beyond.\r\n\r\nYou will spend a minimum of fifteen days at our training centre in Exeter under the guidance of our Science Course Tutor, ensuring you will be able to:\r\n\r\nDevelop and plan innovative and exciting lessons using a variety of techniques, strategies and approaches, including Laboratory Practicals and e-learning, in order to extend your students’ scientific knowledge, understanding and skills.\r\nAssess work for a range of ages and abilities, and ensure effective learning for all students.\r\nDevelop into a strong, critically reflective, classroom practitioner, who will go on to participate in, and influence the future development of Science Education.\r\n\r\nOur trainees specialise in one Science but are prepared to teach Biology, Chemistry and Physics, ensuring their employability.\r\n","interviewProcess":"Under guidance from the Department for Education, SWTT continues to recruit throughout this period in response to the Covid 19 pandemic. Applicants will still be shortlisted in the usual manner. Once shortlisted, applicants will be invited to an online interview that will involve:\r\n\r\n* a short presentation – how would you teach an aspect of your subject to a group of children?\r\n* a subject knowledge assessment – how familiar are you with the content of the current school curriculum in your subject?\r\n* a PGCE readiness task assessing your ability to read and write at Masters Level\r\n* a panel interview with the SCITT Lead and the Course Tutor for your subject, as well as young people from West Exe School.\r\n* opportunities to meet the core SWTT team and ask questions about the programme.\r\n\r\nInterviews take around 2 hours and candidates are given 5-7 days notice to allow them time to prepare.\r\n\r\nSuccessful candidates are then greeted with a Welcome Pack which helps them through the preparations required to start the course. We pride ourselves on communicating regularly with successful candidates so they feel like a part of the South West Teacher Training community.\r\n","howSchoolPlacementsWork":"South West Teacher Training has a wide partnership of fifteen placement schools in Exeter, Plymouth and in rural and coastal communities across Somerset, Devon and Cornwall. This enables us to place trainees within easy travelling distance of home - we feel this is important to ensure trainee well-being and resilience. It's unusual for our trainees to spend more than thirty minutes travelling to placement. \r\n\r\nWhen placing our trainees, we consider their location but we also make an effort to ensure a good match in ethos between the trainee and their host school. It's important too that trainees experience two contrasting placements to enable them to really discover the kind of school culture that suits them best.\r\n\r\nAs a school-centred route, we pride ourselves on ensuring our trainees spend as much time in school as possible. After a week's Induction, trainees complete three days of experience in a Primary school and then begin the first of two placements in an 11-16 or 11-18 setting. This quick immersion into school life, integrated with training sessions at our training base, ensures trainees are able to swiftly start teaching under expert guidance, with time to reflect built into the programme.\r\n","personalQualities":"We will be looking for candidates who demonstrate:\r\n* a passion for sharing their subject with young people\r\n* an ability to form positive working relationships with children and adults\r\n* strong subject knowledge that they can communicate with others\r\n* a range of experience of school settings or working with young people\r\n* a professional demeanour\r\n* resilience and creativity\r\n* positivity and a strong sense of moral purpose for improving the lives of young people.\r\n","otherRequirements":"Safeguarding is important at South West Teacher Training  and all candidates must satisfy relevant pre-employment checks.\r\nA place to train with us will involve contact with vulnerable groups (children\r\n and young people) and is therefore exempt from the\r\nRehabilitation of Offenders Act 1974 and subject to an\r\nEnhanced Disclosure Barring Service (DBS) check. This\r\nexemption means that applicants for this post are required to\r\ndeclare all criminal convictions, cautions, reprimands and bindovers\r\nboth spent and unspent in their application regardless of\r\nthe passage of time.\r\n","status":1,"createdAt":"2021-07-06T10:54:04.283Z","updatedAt":"2021-10-06T13:42:11.977Z","canSponsorStudentVisa":"no","cycle":"2024"}
