{"id":"405ecd03-bbe6-4568-b7ad-201eaa3c6e0c","name":"Primary","code":"H466","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"P","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"735786ba-3133-4ff1-bd9f-332e7af5feb4","name":"Main Site","isPublished":"Y","status":"R","vacancies":"P"}],"trainingProvider":{"id":"bc8e285b-005d-4ab8-b447-784ddf2f2657","code":"28E","name":"Astra SCITT"},"profPost":"PG","degreeGrade":"9","english":"1","maths":"1","science":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"Candidates should use a third party provider for equivalency tests.","courseLength":"TwoYears","feesUK":12000,"feeDetails":"The course fee is £,6000 for the first year and £6,000 for the second year. ","aboutCourse":"Astra primary trainees are prepared to teach across Key Stages 1 and 2, with a main placement in one Key Stage, and a second placement in the other Key Stage in Yr 2. Our professional studies programme focuses on ensuring that trainees are equipped to teach the full primary curriculum, along with the understanding essential principles in child learning.  \r\n\r\nAstra’s principle is to develop trainees as reflective professionals who have strong practical classroom skills and excellent subject knowledge. Trainees learn how to use current theory to inform their classroom practice and trainees gain detailed understanding of primary education, as well as outstanding skills in learning to plan and teach lessons which are creative and engaging.\r\n\r\nAstra trainees on the part-time route spend 120 days in schools, spread across two academic years.  In year one, candidates are in school two full days per week and spend one additional day with the Astra SCITT.  In year two, they are in school for two full days per week, and PGCE trainees will spend an additional 5-6 days on PGCE studies.\r\n\r\nYour curriculum will follow the core content framework, with final assessment against the Teachers' Standard,  based on evidence of your teaching, wider contribution to school life and the ability to reflect on and evaluate these experiences.  Progress is monitored through weekly reflections on progress, objective setting, regular lesson observations and two QTS assignments. Trainees pursuing the PGCE will also write two assignments designed to deepen reflections on school experience in the light of educational research\r\n\r\nWeekly QTS Professional Studies develop an understanding of education essential for new teachers, providing consideration to whole-school issues, such as behaviour management and educational theories that contextualises teaching and learning.\r\n\r\nFor primary trainees, subject and / or phase-specific studies will enable you to develop your understanding of the teaching of the chosen age range. This includes consideration of aspects such as the nature of the subject / phase in the context of the whole primary school experience, the use and application of the National Curriculum, what is taught, how it is taught, how it is assessed, providing for young people with different backgrounds and abilities. \r\n\r\nFee-funded or bursary-led trainees are always supernumerary and the work in school will include observing experienced teachers and team teaching, gradually taking responsibility for the learning of whole classes.  \r\n","interviewProcess":"There are three Teaching School Hubs operating on behalf of the Astra SCITT for both primary and secondary recruitment across our network of over 50 schools:\r\nAstra SCITT/Astra Amersham Hub - Amersham and surrounding area\r\nAstra Aylesbury Hub - Aylesbury / surrounding area\r\nAstra Marlow Hub - Marlow / Maidenhead \r\nCandidates should apply via Apply to their preferred Astra SCITT Hub, which will then coordinate the recruitment process. If your application is shortlisted, candidates will be invited for a first stage interview at one of our Hub locations.   \r\n\r\nThe application and interview process for each hub is identical and is quality assured by the leadership team at the Astra SCITT. It will take one of the following formats: \r\n1. Stage 1 will be conducted remotely and consist of a panel interview, delivery of a short presentation, and some written tasks.  If successful at this stage, you will be invited to attend a Stage 2 interview, which will, where possible involve a visit to your potential main placement school to be observed leading a teaching activity with a small group of students; you will be told in advance about the content of the lesson you will need to plan, and the age group you will be teaching.  \r\n2. Stages 1 and 2 will both be conducted remotely, with you being asked to ‘teach’ part of a lesson to the interview panel following the main panel interview\r\n","howSchoolPlacementsWork":"We endeavour to match the right trainee to the right partner school for their main placement based on their initial preference, geography / distance from home, and areas of specific interest. This course is offered at the locations shown on our website https://www.astra-alliance.com/402/scitt-and-school-direct-itt-places-2021-22\r\nYou will be given the opportunity to express your placement school preference if your application is shortlisted. \r\n\r\nWe aim for all primary trainees, whether on a full or part time route, to have two placements, so will teach across the 5-11 age range.  On the part time route, Year 1 will be spent with one Key Stage, and Year 2 with the contrasting Key Stage (2 days per week in school, each year).  Trainees also attend an induction day with their first placement school ahead of the September course start.  \r\n\r\nQTS studies take place with the SCITT every Wednesday.  Part time primary trainees will attend the Wednesday sessions in the first year only (although can also self elect to attend sessions in the second year).   In year two, PGCE trainees will spend 5-6 days across the year on PGCE studies.   Bursary-led / unsalaried trainee timetable allocations is approximately 30% in the first term, rising to a maximum allocation of 75% in the final placement out of the four days in school.   \r\n\r\nAstra has over 50 partners signed up to the SCITT Partnership Agreement which demands that each school supplies dedicated and high quality one-to-one Mentor support and in-school Professional Studies to complement the core QTS programme offered by the SCITT each week.  Trainees will also be expected to attend events such as parents’ evening and contribute to report writing during the year.  While there is no guarantee of permanent employment with placement schools, a considerable number of our trainees do secure employment within our partnership.\r\n","personalQualities":"Candidates should have the potential to become outstanding teachers, demonstrated by strong subject knowledge; ability to communicate with enthusiasm about learning; ability to reflect on experiences of working with young people, and knowledge of the curriculum and educational issues. \r\n\r\nOther requirements include being ambitious to teach at a good or outstanding level; highly motivated (with the ability to also motivate students); high professional standards; a willingness to play a part in the wider school life; commitment to professional development, and strong communication skills.\r\n\r\nFurther experience of working with children, for example helping with a youth/sports club is desirable.  \r\n","otherRequirements":"The potential to write at Masters level is a requirement for PGCE candidates. \r\n\r\nCandidates will be required to have an Enhanced DBS check, and health clearance.   \r\n\r\nHard copy evidence of all required academic qualifications will need to be provided before an unconditional offer can be made. \r\n\r\n","status":1,"createdAt":"2021-07-06T10:55:06.767Z","updatedAt":"2021-09-15T12:29:23.708Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
