{"id":"dd2180e1-f63e-45ee-a516-1f010f8d7f41","name":"Chemistry","code":"2PT2","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"912d4fb4-761b-42e9-8dc6-e968b791ea4e","code":"F1","name":"Chemistry"}],"locations":[{"id":"26e3ff50-9921-4dda-bb76-5d8ccc92dbe3","name":"Sir Harry Smith Community College","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"4cd36146-0588-4d28-9d21-c03fe3e704b7","code":"1XY","name":"Fenland Alliance"},"accreditedBody":{"id":"af388cc3-644a-4fd3-bd71-55503b74fc21","code":"B22","name":"University of Bedfordshire"},"profPost":"PG","degreeGrade":"1","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Study on a course designed to enable you to join a challenging and rewarding profession – becoming an effective and inspiring teacher who draws on broad subject specific knowledge and secure understanding of teaching and learning theories - with the knowledge and skills to lead learning and initiate change in educational settings\r\nExplore your understanding of teaching and learning secondary science, as you apply your subject knowledge and expertise to planning teaching and managing the science classroom; honing your skills of critical self-evaluation and improvement\r\nDevelop your creativity and team-working skills, preparing you to influence and lead in educational settings and enhancing your own sense of independence\r\nGain confidence in analysing the evidence of your own practical experience during placements in schools, informing your future actions as you evaluate the impact of applying theory to your teaching practice\r\nBenefit from a qualification that gives you recommendation for Qualified Teacher Status (QTS), enabling you to gain employment in a school, with opportunities for continuous development through further study at MA/MSc, MPhil, PhD and EdD levels.\r\nScience is an exciting and rapidly progressing subject that is challenging to teach. During the course you will spend around 70% of your time in placement schools developing the skills and experience necessary to teach scientific concepts in a variety of ways.\r\nYou will attend subject specific sessions, lectures and seminars designed to develop awareness and understanding of the content of the science curriculum, general professional issues, and practical issues such as lesson planning and assessment. You will also engage with relevant research literature and develop the skills of a reflective and research informed practitioner. You will train to teach science to at least GCSE level with a specialism in biology.\r\nThe Teachers’ Standards 2012 provide the framework by which your progress in your teaching is judged. These are supplemented with descriptors which support you in understanding the qualities, which define the level at which you meet the standards.\r\nYour assignments and documentary evidence are managed through a webfolio, bringing together your experiences and activities into a coherent structure. It will help you engage in critical self-evaluation of your practice, enabling you to identify areas of strength and areas for future development.","interviewProcess":"Following a successful application you will be invited to visit Sir Harry Smith Community College whereby you will have a tour of the college, meet key staff, complete a classroom based activity and have an interview by the Professional Tutor.  Shortly after you will attend a formal interview at Bedford University where you will also be able to meet other potential trainees and become familiar with the University setting. \r\nA decision will be made shortly after the interview process.\r\n","howSchoolPlacementsWork":"We are proud to be able to offer a quality experience at Sir Harry Smith Community College.  Therefore, we are very careful when allocating trainees to placement schools and usually locate our trainees at schools within the Fenland so that travelling is not too onerous.\r\nUsually, you will have two placements, starting at Sir Harry in the Autumn term and then having placement two from January - June  the following year.\r\nSir Harry are able to offer experience of teaching from 11-18 dependent on subject specialism\r\n","personalQualities":"","otherRequirements":"Enhanced Disclosure and Barring Service (DBS) check\r\nRelevant work experience is desirable.","status":1,"createdAt":"2021-07-06T10:51:18.502Z","updatedAt":"2021-07-23T21:38:05.332Z","canSponsorStudentVisa":"yes","cycle":"2024"}
