{"id":"b114f9df-5780-44d0-83e3-82dad3110bdf","name":"Primary Teaching Apprentice","code":"3D3W","qualification":"pgce_with_qts","startDate":"2024-06-30T23:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"TA","fundingType":"apprenticeship","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"6478b28d-6aad-4a7d-85d7-3057f1675fbd","name":"Somerset SCITT","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"7e1a6557-d36c-4f27-9fdc-d7d80ae06f33","code":"232","name":"Taunton Teaching Alliance (Heathfield School)"},"accreditedBody":{"id":"be897ea1-5b41-4b40-8eaf-877a15ad688b","code":"S31","name":"Somerset SCITT Consortium"},"profPost":"PG","english":"3","maths":"3","science":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","aboutCourse":"Trainees will study the following topic areas:\r\n\r\n* Pedagogy and Professional Practice.\r\n* Maths\r\n* English\r\n* Science\r\n* Subject Specialist Research\r\n* Global Dimensions\r\n* Foundation Studies\r\nAs well as the above we offer the following conference themes:\r\n* Learning without Limits\r\n* Psychologies/EAL\r\n* Behaviour\r\n* Teaching cross curricular English with a global dimension.\r\n\r\nSomerset SCITT is a forward thinking provider. Our present focus is on student and trainee well being, as part of this we have an emphasis on outdoor learning and music. All of our trainees have the opportunity to become singing Teachers with the necessary skills and repertoire to apply this across the curriculum. We believe that children that sing regularly are happier children. You do not need to be a music specialist to access this training.\r\n","interviewProcess":"The interview process is currently virtual and is made up of an interview with 2 or 3 members of the SCITT senior leadership team; a presentation; and a Book activity.  \r\n\r\nApplicants are asked to write a reflective account of the different aspects of the interview process.  \r\n\r\nApplicants will also need to undertake an English and maths audit.  \r\n\r\nMore information is given about these activities when successful applicants are invited to interview.  \r\n\r\nApplicants are asked to provide proof of qualifications and proof of ID documentation.  The duration of the interview is approximately 3 hours.\r\n","howSchoolPlacementsWork":"Trainees will go into their host school from the beginning of the September term and have approximately 40 days face to face training days out of school. \r\n\r\nTrainees will spend most of their time in one host school and a placement of at least 6 weeks in another school.\r\n\r\n","personalQualities":"We are looking for enthusiastic applicants with a genuine interest in working with children. \r\n\r\nYou need to be adaptable and responsive, be able to multi task and be committed to the principles of life-long learning; at Somerset SCITT, we believe that the most effective teacher is someone who sees themselves as a learner too.  \r\n\r\nExperience of working in a school is essential for a school direct trainee with Somerset SCITT.  Reading about child development, reflecting on the role of a teacher and finding out about current education developments both nationally and locally would be advisable preparation for the interview process.\r\n","otherRequirements":"Additional mandatory requirements are:\r\n\r\n* DBS Check\r\n* Health check\r\n* Proof of Identification\r\n\r\nThe Applicant is expected to have a school that they know will support them in this route.","status":2,"createdAt":"2021-07-06T10:49:19.417Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024"}
