{"id":"c52fd012-4923-4278-bcd5-9043b79b2a5e","name":"Primary","code":"39SF","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"cacb4e50-4bd0-44e6-ae5e-fac9bd5d6ff9","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"4f82138b-dca2-4a46-9686-e8391944b18f","code":"2HP","name":"Orwell Education Alliance"},"accreditedBody":{"id":"beed0fbc-2ee8-42e8-a507-f1956664a9f0","code":"C76","name":"Colchester Teacher Training Consortium"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9000,"feesInternational":9000,"aboutCourse":"Our Primary School Direct Programme (Tuition) offers high quality training, leading to the award of Qualified Teacher Status (QTS) and a Post Graduate Certificate in Education (PGCE), including credits at Masters level, validated by the University of Greenwich.\r\n\r\nThe course is 37 weeks long and combines practical teaching with professional training. It has been designed to give Trainee Teachers the necessary learning opportunities and support to enable them to demonstrate they have developed the knowledge, skills and behaviours to meet the Teachers’ Standards for QTS. There are built-in assessment structures which help Trainees track their progression throughout the CTTC curriculum. This curriculum is centred around 4 key values: CREATIVITY, TARGETED INTERVENTION, THINKING CRITICALLY ANDCOLLABORATION and ensures trainees have full access to their entitlement under the Initial Teacher Training Core Content Framework.\r\nThe training consists of placements within two schools across opposite key stages, along with centre-based training sessions. There is also the opportunity to gain experience within SEND, secondary and nursery settings.\r\n\r\nDuring the first half of the Autumn term the Trainee gains experience of their Host Placement Class whilst also spending time in other classes and age groups within this setting. In the second half of the Autumn Term, the Trainee will be in school for ten consecutive days when they will be expected to teach whole class lessons. After some preparation and planning time at the end of the Autumn Term, the Trainee Teacher will undertake a five week block practice in their Twin Placement School in the Spring Term, teaching 50% of the timetable. In the Summer Term the Trainee will teach 80% of the timetable during their eight-week block practice.\r\n\r\nThe Trainee Teacher will receive support and guidance from their personal Mentor, Training Manager, Lead Practitioners and the Course Director drawn from the Orwell Education Alliance and Colchester Consortium as appropriate. The Training Manager is the Trainee’s line manager and oversees them throughout the year. The personal Mentor is an experienced member of the school.","interviewProcess":"We invite short-listed applicants to participate in a selection process involving the following:\r\n\r\n- Teaching a lesson\r\n- Written task\r\n- Maths task\r\n- Interview\r\n\r\nWe ask all interviewees to teach a lesson to a small group of children, the topic of which will be chosen by the candidate.\r\n\r\nApplicants will then be asked to complete a written task (handwritten), which offers the opportunity to reflect accurately on the teaching activity’s strengths along with areas for development. This also gives the opportunity for applicants to demonstrate they can communicate in writing, accurately and effectively.\r\n\r\nThe interview will last for approximately 40 minutes and will include a 10 minute presentation on a hobby or skill the applicant is passionate about and how this relates to teaching and learning. Questions will be framed around the applicant’s previous relevant experience, skills, knowledge of the curriculum and aptitude for becoming a teacher of the future.","howSchoolPlacementsWork":"Orwell Education Alliance has strong connections with a variety of schools in communities with differing needs and we ensure that all our placements are high standard and trainees are supported as well as challenged. Trainees are supported by school mentors who are enthusiastic, committed and well-trained individuals to ensure that they are well equipped for the role. We will determine placements in discussion with the trainee to accommodate the specific aspirations and development needs and during placements there is added support from the Training co-ordinator to ensure the goals of the placement are being met.\r\n\r\nTrainees spend approximately 26 weeks on school placement. Most of this is in the main placement school in the autumn and summer terms, with at least 6 weeks in the spring term in a contrasting school.\r\n\r\nThe distance to school placements will vary. These take into account the trainee’s home address, whether they have their own transport and the placement that the school is able to offer. Our policy is to endeavour to keep journey times to school to a maximum of 50 minutes each way.","personalQualities":"Teaching is a demanding but very satisfying career and we are interested in people who are passionate about children’s learning with a desire to open up minds to new possibilities. You will need to be willing to listen, respond to challenge, be organised and self-motivated - there is lots of support but you will need to be committed to the task throughout the training year. We have worked successfully with many trainees and, with the right mind set, we believe committed trainees can develop in to great teachers.","otherRequirements":"Safeguarding\r\nOrwell Education Alliance is committed to safeguarding and promoting the welfare of children and young people and expects all staff, trainees and volunteers to share this commitment. All successful applicants for teacher training will be required to undertake an enhanced check by the Disclosure and Barring Service (DBS).\r\n\r\nSchool Experience is no longer a statutory requirement to apply for ITT, as we are looking for the potential to train to teach. However, if you apply to us and are interviewed, we would be happy to arrange an in school experience for you.","status":1,"createdAt":"2021-07-06T10:52:23.293Z","updatedAt":"2021-10-04T20:23:41.555Z","canSponsorStudentVisa":"no","cycle":"2024"}
