{"id":"29fdb5b9-a6ed-487b-aa96-2361ba3cd017","name":"Religious Education","code":"388G","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"724b5d16-28dd-4431-bc17-ea4be4daedc4","code":"V6","name":"Religious education"}],"locations":[{"id":"15f6d676-eb1b-43c9-aade-bf948d72603d","name":"Tarleton Academy","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"0e64ff81-c28a-46fa-96fd-0fa735e9c357","code":"M70","name":"Endeavour Learning SCITT"},"profPost":"PG","degreeGrade":"9","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Should a trainee need to complete equivalency tests in either subject we would expect this route to have been investigated and where possible completed by the start of the course.","courseLength":"OneYear","feesUK":9000,"feesInternational":9000,"financialSupport":"You may be eligible for financial support while you study, including bursaries, scholarships and loans (https://www.gov.uk/teacher-training-funding)\r\n\r\nFinancial support if you are from outside of the UK\r\n(https://getintoteaching.education.gov.uk/explore-my-options/overseas-graduates)","aboutCourse":"The programme consists of school centred training from the beginning of September through to the end of June. \r\nFour days per week are spent in school observing, team planning and teaching, leading to solo teaching and one day per week is spent in a teaching and learning conference day which will usually be held at Tarleton Academy.\r\nThe majority of the conferences will focus on planning for learning and teaching and provide you with the knowledge, skills and understanding so that you are able to be a highly effective teacher. \r\nOther conferences will have an academic focus where you will work with staff from Liverpool John Moores University to develop Masters Level 7 work. \r\nPlacements \r\nYou will have 2 equal placements in two contrasting schools.  In addition, there will be other opportunities which will include:\r\n\r\n•\tA primary school\r\n•\tA SEND school \r\n•\tA challenging school and Sixth Form experience\r\n\r\nAs you progress through the programme, your timetable and teaching load will be bespoke to your needs and determined by your confidence and competence on the programme. \r\nWe recruit candidates who have the potential to be highly effective teachers by the end of their year training with us. \r\nTeacher training designed by our schools’ outstanding teachers and leaders will ensure a firm grounding in practical skills. Spending more of your training in the school environment, for some trainees, is proving to be the best grounding for a career in teaching. Our programme is designed to create the next generation of highly effective teachers who will help lead our schools to success.\r\nTo find out more about the course structure or if you are simply interested in applying please contact scitt@endeavourlearning.org","interviewProcess":"If your application is successful we will call you for interview. \r\nAll candidates will complete a written task.  The ability to communicate clearly and grammatically in spoken and written Standard English will be explored throughout the written task and the whole interview process completed on the day.\r\n\r\nAll candidates will plan and deliver a 20-minute session in which a skill and subject concept should be taught to a small group of pupils, observed by some members of the interview panel.  We will look at your  personal characteristics including flexibility, independence and resilience and your interpersonal skills.\r\n\r\nAll candidates will be formally interviewed. Information collated from the written task, the taught session and the application form, including references will be utilised to support the interview. The interview panel will consist of a number of staff from across the SCITT Partnership along with a Subject Lead. \r\n\r\nThis will allow us to talk further and discuss your subject knowledge,  reflection of any prior experience in a secondary school, your knowledge of issues linked to secondary education and your commitment to a career in teaching\r\n\r\nYou will be expected to provide an example of when you have demonstrated leadership and what you learned from this experience about yourself and your leadership style.\r\n\r\n\r\n\r\n","howSchoolPlacementsWork":"You will have 2 equal placements in two contrasting schools.  In addition, there will be other opportunities which will include:\r\n\r\n•\tA primary school\r\n•\tA SEND school \r\n•\tA challenging school and Sixth Form experience\r\n\r\nAs you progress through the programme, your timetable and teaching load will be bespoke to your needs and determined by your confidence and competence on the programme. \r\nWe recruit candidates who have the potential to be highly effective teachers by the end of their year training with us. \r\nTeacher training designed by our schools’ outstanding teachers and leaders will ensure a firm grounding in practical skills. Spending more of your training in the school environment, for some trainees, is proving to be the best grounding for a career in teaching. Our programme is designed to create the next generation of highly effective teachers who will help lead our schools to success.\r\nTo find out more about the course structure or if you are simply interested in applying please contact scitt@endeavourlearning.org\r\n","personalQualities":"You will be expected to have well thought out ideas on why you wish to enter teaching and, in addition, to show an awareness of the work of the contemporary Secondary school. In addition, you will have a genuine passion for the subject that you want to teach and have thought about how you can best convey this passion to young people.","otherRequirements":"Before starting the training programme, all trainees will be required to undergo an enhanced criminal record check (DBS) check.  All candidates will have to produce GCSE, A Level and Degree certificates in support of their application.","status":1,"createdAt":"2021-07-06T10:48:32.301Z","updatedAt":"2021-08-17T14:52:22.323Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
