{"id":"eb66fb7f-949d-4faf-a289-d50bafa48911","name":"Chemistry","code":"X902","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"TA","fundingType":"apprenticeship","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"912d4fb4-761b-42e9-8dc6-e968b791ea4e","code":"F1","name":"Chemistry"}],"locations":[{"id":"b1420ded-072e-4e5e-82c8-561b502094ab","name":"Nicholas Chamberlaine School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"46d23a8c-aa4b-412e-aa22-ad806fd95b97","code":"2LF","name":"Riverley Primary School"},"accreditedBody":{"id":"26797ebf-f835-47c8-9369-7d6d67fb2343","code":"C85","name":"Coventry University"},"degreeGrade":"0","additionalDegreeSubjectRequirements":"false","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"4 terms","aboutCourse":"The Griffin Schools Trust share a conviction that great schools are built on rich extra-curricular programmes and high quality pastoral care as well as an inspiring curriculum, expertly taught. We know there are no limits for students and staff where commitment and enjoyment go together.\r\n\r\nSchools have histories and are rooted in local communities. The Trust seeks to use those histories to:\r\n\r\nrenew their visions\r\npreserve their uniqueness and\r\ngive excellent service to their communities.\r\n\r\nGST schools share the expression of those visions and strategies through a common frame of reference, which makes mutual challenge and inspiration both natural and easy.\r\n\r\nWhether you are retained by your training placement at the end of the apprenticeship or find employment in another school, being part of something bigger provides a wider stage for gifted and experienced teachers and leaders, offering them scope to have an impact beyond one school.\r\n\r\nAs a Griffin Schools Trust teaching apprentice you will inspire and motivate young people to learn and develop their curiosity and talents.\r\n\r\nAs a maths  teacher you will inspire and motivate young people to learn about the study of mathematics and its applications to every day life.\r\n\r\nYou’ll teach students of different ages and abilities and prepare young people to take national qualifications in your subject.\r\n\r\nYou will:\r\n\r\nPrepare lessons and teaching materials\r\nAssess students’ progress and mark their work\r\nSet homework\r\nManage classroom behaviour\r\nDiscuss students' progress with parents and carers\r\nOrganise study trips, social activities and sports events.\r\nYou’d encourage the students to take pride in their achievements inside and outside school. You’d support them to build good relationships with other students and teachers and play a positive part in the life of the school and the local community.\r\n\r\nYou’ll help them get the knowledge, skills and attributes they’ll need for a successful and positive life when they leave school.\r\n","interviewProcess":"To be confirmed.","howSchoolPlacementsWork":"You will experience two school placements - the second will be for 6 weeks with the majority of the time spent in your first school.\r\nThe teaching apprenticeship runs across 4 terms.\r\n","personalQualities":"Enthusiasm, energy and passion for your subject which you can effectively communicate to pupils.","otherRequirements":"DBS approval\r\nCriminal record checks\r\nEligible to work in the UK\r\n","status":1,"createdAt":"2021-11-03T09:54:32.202Z","updatedAt":"2021-11-03T09:55:45.398Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024"}
