{"id":"4b594312-2aa5-4548-b534-047189e086a8","name":"Primary","code":"2M6N","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"4012f546-c4d9-44ce-bc7d-1bee6ed9a08b","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"1c98d571-b990-4c5e-a612-70333c30b248","code":"1XQ","name":"Aspirer School Direct"},"accreditedBody":{"id":"899178cc-20a7-4df5-951a-ee83c1b3d4d1","code":"S21","name":"Sheffield Hallam University"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"You may use a variety of equivalency test providers.  Please contact us for details of those accepted","courseLength":"OneYear","feesUK":9250,"feesInternational":13250,"aboutCourse":"This course prepares you to be an effective and reflective Primary Teacher, teaching ages 5 - 11. \r\nYou will spend the vast majority of the year learning how to teach in a real classroom and be mentored by your Learning Coach, who will be an experienced, expert and outstanding teacher.\r\nYou will learn how to teach all of the primary school subjects as well as about aspects of teaching such as behaviour management, safeguarding, special needs and disability, teaching children with English as an additional language, assessment, lesson planning, observing learning and using ICT.  \r\nWe are one of the first five National Research Schools so you will have access to the latest high quality research and to national experts in a number of fields such as teaching Reading and Mathematics.\r\nOur Higher Education partner, Sheffield Hallam University, recognised by OFSTED as an outstanding provider, leads the teaching for the 60 Masters credits that you will gain.  These are gained through assignments on: Talk and learning, Lesson study (in which you will have the opportunity to do some small scale research of your own) and following the progress of a group of children in your class over a year.  You spend around 15 days at Sheffield Hallam in the year (travel from your \"home\" school is paid).\r\nYou will be assessed on your growing ability to teach over the year by your Learning Coach/ Mentor and on these assignments. \r\n","interviewProcess":"Once you have applied, you may be offered an interview. At the interview, you will be asked to:\r\n\r\n* Facilitate a classroom activity for between 20 - 30 minutes.  You can choose the activity and the year group.\r\n* Interview with the panel (Usually the Programme Leader and a Headteacher or Principal from one of the Alliance Schools)","howSchoolPlacementsWork":"We work with over fifteen schools in the Cheshire East, Cheshire West and Chester, Buxton and Manchester areas. \r\nYou will learn to teach children from ages 5 to 11. \r\nYou will be placed in a \"home\" school for the majority of the year (around 32 weeks in total) and do a shorter placement (around 10 weeks) in an \"away\" school so that you complete placements in Key Stages One and Two.\r\nWe strive to place you in a home school which is easily accessible for you  and which suits your needs after discussion with you.  \r\n","personalQualities":"You must have:\r\n\r\n* Commitment to a career in teaching\r\n* Effective communication skills including use of written and spoken English\r\n* Excellent interpersonal skills and the ability to work well in a team\r\n* Leadership potential\r\n* Ability to relate to and engage with children\r\n* A range of positive personal characteristics including flexibility, communication, independence, initiative and resilience\r\n* Ability to explain concepts clearly\r\n* The ability to develop strong subject knowledge\r\n* A sense of humour\r\n","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:53:13.470Z","updatedAt":"2021-07-29T17:56:58.379Z","canSponsorStudentVisa":"no","cycle":"2024"}
