{"id":"5bec59b6-6588-47c3-8fa7-24f236dd2134","name":"Modern Languages (Spanish)","code":"KL27","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"other","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"e34fd2a3-a32e-44e9-aea1-666badf3ac03","code":"22","name":"Spanish"},{"id":"ce8523ef-9236-4cd9-b260-d826c7a521b3","code":"ML","name":"Modern Languages"}],"locations":[{"id":"19ade2cb-14a9-433d-babc-b1f7ec26f48a","name":"Secondary Site: The Kingsway School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"0eeabf5e-4b3a-4dd1-9afc-be1b4a8818fa","code":"1OJ","name":"The Education Learning Trust"},"accreditedBody":{"id":"812b70c4-7fc4-46fc-975b-3e4d00f77dc4","code":"M40","name":"The Manchester Metropolitan University"},"profPost":"PG","degreeGrade":"9","english":"1","maths":"1","science":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feeDetails":"The school direct tuition fees are £9,250 but will lead to a PGCE award with QTS status from a leading provider.\r\n\r\nYou can apply for additional bursaries, more information is available through the DFE website.\r\n","financialSupport":"Financial support\r\n\r\nYou’ll get a bursary of £26,000 if you have a degree of 2:2 or above in any subject. \r\n\r\nYou don’t have to apply for a bursary - if you’re eligible, you’ll automatically start receiving it once you begin your course. Find out about eligibility and how you’ll be paid. \r\n\r\nYou may also be eligible for a loan while you study. \r\n\r\nFind out about financial support if you’re from outside the UK. \r\n\r\nFinancial support from the training provider\r\n\r\nThere are numerous bursary and scholarship funds available for potential applicants to apply for to help with the School Direct fees. More information on these can be found on the DfE website.\r\n\r\n","aboutCourse":"The Education Learning Trust will place successful School Direct applicants into the schools that will be most able to meet their specific needs. Each trainee will be allocated a main school with a contrasting placement, supported by University sessions at the MMU Manchester campus.  We will endeavor to make placements bespoke to the individual career aspirations of successful applicants. \r\n\r\nYou will be trained in a highly supportive and aspirational environment and will develop the rigour, professional knowledge, understanding and skills necessary for the delivery of creative, purposeful and challenging teaching and learning.  \r\n\r\nThis is a yearlong school based training programme will lead to a Postgraduate Certification (PGCE) and Qualified Teacher Status (QTS). It will embody a collaborative approach enabling trainees to connect with experienced school-based professionals, whilst also receiving guidance from The Manchester Metropolitan University (MMU) education faculty and staff. The training will be delivered jointly by MMU and by expert teachers in the Trust schools.  \r\n","interviewProcess":"Applicants will be invited to interview at one of the Trust secondary schools.  The interview process will comprise of a subject specific task, a small short teaching task and a panel interview with key colleagues from within the Trust schools. During the whole process we will also be looking numeracy and literacy skills of applicants.\r\n","howSchoolPlacementsWork":"You will be placed in school within our locality, gaining a wide range of experience from Year 7 to 11. You will receive your own trained mentor to guide you through the year as you explore effective teaching and learning, making a difference to the outcomes of all the children you teach.\r\n\r\nThere will be a contrasting placement in a second school, including an opportunity to look at Special Educational Needs. We will discuss your second placement school with you to ensure that you are prepared and are able to experience different contexts.  \r\n","personalQualities":"\r\nOur successful candidates will be able to demonstrate the following skills: Teamwork, Problem solving, Effective communication skills, Effective time management, Organisational skills, Adaptability, Reflective, Effective relationships.\r\n","otherRequirements":"\r\nPersonal qualities\r\n\r\nOur successful candidates will be able to demonstrate the following core values: Commitment, Integrity, Nurturing, Resilience, Passion, Hard working, Motivation to learn, Open minded.\r\n\r\n","status":1,"createdAt":"2021-07-06T10:49:25.855Z","updatedAt":"2021-10-05T09:39:54.523Z","canSponsorStudentVisa":"yes","cycle":"2024","applicationsOpenDateOther":"2021-11-10T00:00:00.000Z"}
