{"id":"754a23be-e259-43fa-9a0f-beeccb63e628","name":"Primary","code":"27QJ","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"fa244753-9146-4de8-88a8-8a97bf56a47d","name":"Primary Main Site","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"0eeabf5e-4b3a-4dd1-9afc-be1b4a8818fa","code":"1OJ","name":"The Education Learning Trust"},"accreditedBody":{"id":"812b70c4-7fc4-46fc-975b-3e4d00f77dc4","code":"M40","name":"The Manchester Metropolitan University"},"profPost":"PG","degreeGrade":"0","english":"1","maths":"1","science":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"This is a year-long school-based training programme that will lead to both a Postgraduate Certificate in Education (PGCE) and Qualified Teacher Status (QTS).  It embodies a collaborative approach, enabling you to connect with experienced school-based professionals, whilst also receiving guidance from The Manchester Metropolitan University (MMU) education faculty and staff.  The training will be delivered jointly by MMU and by expert teachers from alliance schools.\r\n\r\nThis School Direct programme is a full-time, primary, unsalaried programme running from September to June.\r\nYou will be trained in a highly supportive and aspirational environment and will develop the rigour, professional knowledge, understanding and skills necessary for the delivery of creative, purposeful and challenging teaching and learning.  In order to achieve this, you will experience:\r\n•\tA main placement in a designated school\r\n•\tA contrasting placement, from within the wider alliance\r\n•\tA special education needs (SEN) placement, from within the wider alliance\r\n•\tClassroom observations\r\n•\tWorking with individuals/small groups/and whole classes to teach lessons\r\n•\tAssessment of pupil attainment and progress \r\n•\tLectures and online learning with an iPad on loan for 12 months\r\n•\tPlanning and delivery of blocked training sessions\r\n•\tProfessional development training sessions   \r\n•\tMentor sessions/support\r\n•\tThe wider school community\r\n•\tExtra-curricular activities\r\n\r\nThe Education Learning Trust (ELT) and its alliance partners have a wealth of strengths to offer you.  As well as each school having its own distinctive strengths, the alliance draws upon Specialist Leaders in Education to enhance your training experiences.  These unique school-based learning opportunities build upon the relationships between the alliance partners, the University and you.  \r\n\r\nThe Alliance’s commitment to you:\r\n•\tA nominated, experienced, school-based mentor\r\n•\tRegular school-based mentor meetings that support, feedback and challenge your professional development\r\n•\tExperience across the primary age range (5-11 years old)\r\n•\tExperience in delivering school-based training sessions covering core and foundation subjects.  These include English, maths, science, IT, history, geography, music, art, PE, foreign languages and design technology.\r\n•\tEnhanced educational theory sessions and practical advice on succeeding in the classroom.   These include behaviour management, mental health and wellbeing, assessment for learning and metacognition.\r\n•\tOpportunities for you to tailor and influence your own professional development\r\n","interviewProcess":"As an interested applicant you should apply via the UCAS website http://www.ucas.com/apply/teacher-training \r\n\r\nThe ELT recruits and selects its own trainees, using the alliance’s skills and core values:\r\n\r\nSkills                                                        \tCore Values\r\nTeamwork                                          \tCommitment \r\nProblem solving \t                                Integrity \r\nEffective communication skills\tNurturing \r\nEffective time management        \tResilience \r\nOrganisational skills \t                        Passion \r\nAdaptability \t                                        Hard working\r\nReflective\t                                                Motivation to learn \r\nEffective relationships \t                Open minded\r\n\r\nSuccessful applicants are invited to attend our interview process where candidates will continue to be assessed against the alliance’s skills and core values criteria.\r\n\r\nThe interview process includes a face-to-face interview and the opportunity to lead an activity with a group of children:\r\n•\tThe face-to-face interview is led by 2 members of the ELT and lasts approximately 30 minutes.  The members of the teaching school alliance are usually senior leaders eg Headteacher, Deputy/Assistant Headteacher.\r\n•\tThe activity is observed by 2 members of the teaching school alliance and lasts approximately 20 minutes.  The members of the teaching school alliance are usually senior leaders eg Headteacher, Deputy/Assistant Headteacher.\r\n\r\n Prospective teachers are assessed on the core skills teachers need to fulfil their professional role in school, They also need to demonstrate the subject knowledge needed for teaching.  This is to ensure all teachers are competent in numeracy and literacy, regardless of their specialism.  Further details are available here http://sta.education.gov.uk/ .","howSchoolPlacementsWork":"The Education Learning Trust will place you into schools that will be most able to meet your specific needs.  You will be designated:\r\n•\tA 'main' school placement, lasting 21 weeks\r\n•\tA ‘contrasting’ placement, lasting 10 weeks\r\n•\tAn SEN/inclusion placement, lasting 2 weeks\r\n\r\nA statutory requirement of this School Direct programme is the need to have experienced teaching in both Key Stage 1 (Years 1 and 2) and Key Stage 2 (Years 3, 4, 5 and 6), therefore your main school placement and contrasting school placement will be based in different Key Stages.  \r\n\r\nPlacements will take place in one of the following schools:\r\nGatley Primary School, Gatley\r\nEtchells Primary School, Heald Green\r\nDial Park Primary School, Offerton\r\nBredbury Green Primary School, Bredbury\r\nMeadowbank Primary School, Cheadle\r\nQueensgate Primary School, Bramhall\r\n\r\nOn both of your main school and contrasting school placements you will be allocated:\r\n•\tA specific class within which you will teach\r\n•\tOpportunities to observe across school\r\n•\tA school-based mentor who will support you on placement\r\n•\tA university tutor who will visit and support you on placement\r\n•\tA representative from ELT to visit and support you on placement\r\n","personalQualities":"The ELT is looking for the following skills and core values in its future teachers:\r\n\r\nSkills\t                                                        Core Values\r\nTeamwork \t                                                Commitment \r\nProblem solving \t                                Integrity \r\nEffective communication skills\tNurturing \r\nEffective time management \t        Resilience \r\nOrganisational skills \t                        Passion \r\nAdaptability \t                                        Hard working\r\nReflective\t                                                Motivation to learn \r\nEffective relationships \t                Open minded\r\n\r\nWe encourage you to provide evidence of these skills and core values in your personal statement and during the interview process.\r\n\r\nInterested applicants are invited to contact us on ccoleman@gatleyprimary.com for Primary and b.murray@kingsway.stockport.sch.uk for Secondary\r\n","otherRequirements":"The ELT and MMU are committed to safeguarding and promoting the welfare of children, young people and vulnerable adults and expects all staff, trainees and volunteers to share this commitment.  Trainee appointments will be subject to satisfactory clearances and checks including a Disclosure and Barring Service check, carried out by MMU acting as the admissions authority.\r\n\r\n","status":1,"createdAt":"2021-07-06T10:49:25.590Z","updatedAt":"2021-10-05T09:06:30.631Z","canSponsorStudentVisa":"yes","cycle":"2024"}
