{"id":"1a42da1c-2065-4b6a-bfbc-0c32eae1d41d","name":"Physics","code":"2GVB","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"bf97cd0a-224c-43d3-a021-84143df13e8d","code":"F3","name":"Physics"}],"locations":[{"id":"7c3ad8a5-5285-46a3-bf0d-b87ab68c5ee4","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"02476fa8-d23f-4d70-8b5c-11dfc04b0c00","code":"1ZM","name":"The Arnewood School Academy"},"accreditedBody":{"id":"964657c0-043a-4280-8e2a-df4210748a8a","code":"B52","name":"Bournemouth Poole & Dorset Teacher Training Partnership"},"profPost":"BO","degreeGrade":"1","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9000,"aboutCourse":"This course is run in partnership with the Bournemouth, Poole and Dorset Teaching Training Partnership. \r\n\r\nThe course runs for 37 weeks from September to July. During this time trainees will spend the majority of their time in school. This will give you the opportunity to develop and put into practice much of the pedagogy of teaching in your chosen subject. You will also receive central training throughout the year at the BPD base at Twynham School in Christchurch. There will also be academic input from The University of Winchester for the PGCE element of the course. \r\n\r\nTrainees will receive support from a subject mentor, who will hold weekly meetings with trainees to discuss progress and set targets. There will also be the support of a Professional Tutor who oversees all trainees in the school and a Lead Subject Tutor who is responsible for developing subject specific knowledge and support. \r\n","interviewProcess":"If you already meet or are expected to meet our entry requirements, and have demonstrated your passion and commitment to teaching in your application, you will be invited to attend an interview. The interview is your chance to demonstrate your potential to become a successful teacher. The interview day usually consists of a written task, pupil task, subject specific and more general interviews, as well as an opportunity to tour the school and find out more about us. Further information about the format of the day will be sent to you via email in advance of the interview date. ","howSchoolPlacementsWork":"The course is made up of two placements. The first from September to December will take place in one of our partner schools. The main placement - January to June - will be at The Arnewood School. During both placements you will have a dedicated mentor and will have regular meetings with you lead subject tutor as well as visits to you on your placement. ","personalQualities":"We will look for evidence of a commitment to the teaching profession, an understanding of professional requirements, and an awareness of current educational issues in an application. Prior experience in a school is not required, however prospective students may find experience in a school useful for obtaining insights into the classroom. Experience in a school or similar setting may also provide reassurance to prospective students that teaching is the right choice for their career.","otherRequirements":"If you accept an offer of a place you will be required to complete a Disclosure and Barring Service (DBS) criminal records check and Prohibition Order check. If you have spent time overseas in the last 5 years you may also be required to obtain criminal records checks from each of the countries you visited. You will also be required to complete an occupational health check to confirm that you are fit to teach. The University of Winchester will send you more information about when and how you need to complete each of these checks if you accept our offer.","status":1,"createdAt":"2021-07-06T10:56:48.636Z","updatedAt":"2021-09-09T15:09:56.031Z","canSponsorStudentVisa":"no","cycle":"2024"}
