{"id":"1b74b067-8800-4f9d-b335-5c1186d505b4","name":"Drama","code":"3373","qualification":"pgce_with_qts","startDate":"2024-07-31T23:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"69052223-ca45-4781-a8d3-cb92447a6d78","code":"13","name":"Drama"}],"locations":[{"id":"224d2fec-7e37-4fd5-8782-ea1299383b74","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"e1473ef6-b29f-4e0b-adff-558ab367008a","code":"2AV","name":"Cabot Learning Federation SCITT"},"profPost":"PG","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"If your degree is not at least 50% related to Drama we would require you to have at least an AS and/or A Level (or equivalent) in the subject.","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We accept equivalency tests from [Equivalency Testing](https://www.equivalencytesting.com/)","courseLength":"OneYear","feesUK":9250,"aboutCourse":"The CLF SCITT Drama programme combines school-centred training, experience and practice with subject specific and professional development.  This ensures trainees develop the knowledge, skills and understanding required to be effective teachers. Successful completion of the programme leads to the award of Qualified Teacher Status (QTS) and the opportunity to gain Post Graduate Certificate in Education (PGCE) with 60 Master’s level credits which is delivered in partnership with the University West of England (UWE).  A QTS only route can be requested and will be considered on an individual basis. \r\n\r\nThe CLF SCITT curriculum provides a balance between educational theory and cognitive research with classroom based practice and application. We have developed a well sequenced, interleaved and progressive approach where trainees knowledge and skills build throughout the year.\r\n\r\nCentre based training equips trainees with evidence-based knowledge and understanding that is developed and implemented in school based training. Trainees develop skills and techniques that can be applied in their placement school with the support of expert mentors and other colleagues.  \r\n\r\nThere is a strong focus on professionalism and personal refection where trainees are encouraged to be proactive and take responsibility for their own learning and progress. Professional learning conversations with mentors and experts provides regular opportunity to guide and support this as well as support the links between centre and school based provision and learning.  \r\n\r\nSubject specific Drama training is delivered by expert teachers and subject specialists. Core pedagogy is further explored through the lens of the subject with a focus on subject knowledge, subject pedagogy, pupil progression and attitudes.  \r\n\r\nAdditional features of the programme are:\r\n \r\n* September Induction fortnight \r\n* Academy carousel - visiting contrasting schools \r\n* School Experience all year round including two core placements\r\n* Weekly centre-based training delivered by teaching experts and specialists\r\n* Cross phase and complimentary experience\r\n* CLF wide CPD opportunities and Conferences in addition to centre-based training\r\n* Employment support\r\n\r\nWe strive to provide a personalised and differentiated programme. Weekly centre-based training alongside regular school visits enables the SCITT team to identify needs and adapt the programme as necessary, using experts from across the partnership. \r\n\r\n*adaptations may be in place due to Covid-19.","interviewProcess":"The assessment day usually takes place at one of our partnership academies or at the CLF Institute. It is a process to access eligibility, subject knowledege and potential to train to teach.\r\n\r\nAssessment day tasks will usually include: \r\n\r\n* A pre-prepared teaching task with a group of pupils \r\n* A short pre-prepared presentation \r\n* A discussion based activity\r\n* A  written task \r\n* An individual interview \r\n\r\nDetails of the tasks will be sent to you prior to the interview date. \r\nThe assessment tasks are designed to help us select prospective trainees based on our 5 core values and attributes: \r\n\r\n* Aptitude and readiness for teacher training \r\n* Strong subject knowledge and passion for teaching and learning specific to age range \r\n* Strong sense of moral purpose (linked to the CLF HEART values) \r\n* Effective communication and interpersonal skills \r\n* Ability to reflect, be responsive and pro-active \r\n\r\nThis rigorous selection process ensures that we recruit the very best trainee teachers for our children and young people. During the process you will also be able to establish whether we are the right training provider for you. \r\n\r\nSuccessful applicants may be given conditions or recommended actions to complete prior to the course starting in order to accelerate their readiness for the teacher training year. \r\n","howSchoolPlacementsWork":"The CLF SCITT programme has blocks of teaching experience spent in Academies throughout the year. The majority of placements take place in CLF and partnership schools in Bristol, South Gloucestershire and North Somerset. \r\n\r\nThroughout all teaching experience placements, trainees are allocated a Mentor who provides regular guidance, support and challenge. In addition there is a Lead Mentor in school who oversees the school-based training alongside the Programme Leaders.\r\n\r\nSchool Carousel: \r\nDuring the first term of the programme, trainees embark on a carousel of school experience, visiting a different academy each week. Trainees are set key tasks and observations, linked to their weekly training, to carry out in school in order to explicitly make links between theory and practice improving their understanding of how children and young people develop and learn. This provides a smooth induction to the programme and is particularly beneficial to trainees who have limited experience in school. \r\n\r\nAll trainees will have a ‘home’ placement where they spend the majority of their training year. \r\n\r\nPlacement expectations are designed to gradually develop trainees' teaching during the year.  This starts by getting established with students  in the classroom and school community as well as gaining initial teaching experience.  Trainees will start their teaching and planning with small groups, moving on to teaching parts of lessons, to whole lessons to entire sequences of learning and finally taking on full responsibility for the class and the progress of learners during the summer term. Trainees are expected to demonstrate increasing independence and autonomy in their planning and teaching throughout the year. \r\n\r\nSecondary trainees' timetables across their placement experiences will include classes in Years 7-13. All Secondary (11-18) trainees are required to plan and teach A level; assessment of teaching is typically across Key Stages 3&4 (11-16). \r\n\r\nWe are committed to inclusion and take into consideration many factors when organising your school placements including; distance from home to school, access to transport, preferred key stage where possible, ethos of individual schools, individual family circumstances, disability and additional learning needs.\r\n","personalQualities":"We are looking for trainee teachers who share our ambition for improving outcomes for children and young people through working collaboratively and empowering learning. \r\n\r\nYou will need to demonstrate the commitment and resilience needed to become a highly effective teacher and lifelong learner. \r\n\r\nAdditional qualities we look for throughout the application process are: \r\n\r\n* Aptitude and readiness for teacher training \r\n* Strong passion for teaching and learning specific to age range or subject \r\n* Strong sense of moral purpose (linked to CLF HEART values) \r\n* Effective communication and interpersonal skills \r\n* Ability to reflect, be responsive and pro-active \r\n","otherRequirements":"You will need to complete successful enhanced Declaration and Barring Service (DBS) and prohibition checks and will require appropriate ID and documents for this.\r\n\r\nYou will be required to provide a full employment history and satisfactory references supporting your suitability to work with children/young people, in line with Keeping Children Safe in Education requirements.\r\n\r\nYou will need to complete an Occupational Health form/self-declaration about your fitness and wellness to teach.\r\n\r\nSchool experience is highly recommended to both support your application and improve your readiness for teacher training. \r\n\r\nPlease provide a Statement of Comparibility if you hold international qualifications  (https://www.enic.org.uk/Qualifications/SOC/Default.aspx)","status":1,"createdAt":"2021-07-06T10:47:52.403Z","updatedAt":"2021-09-10T14:09:38.581Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
