{"id":"afb042a0-1ce6-4c64-87de-926a1b08f366","name":"Primary","code":"2ZNW","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"3_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"445df564-3efd-4cd7-b236-7d7677de5c02","name":"North East Lincolnshire ITT Partnership","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"587b4f9d-7f5f-4484-b08f-247a37157742","code":"2CS","name":"North East Lincolnshire ITT Partnership"},"accreditedBody":{"id":"ce25b950-14e6-4c21-a215-d140b58e2d5c","code":"2B6","name":"East of England Teacher Training"},"profPost":"BO","degreeGrade":"9","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"Please contact us to check before booking: traintoteach@eoettc.com","courseLength":"OneYear","feesUK":null,"aboutCourse":"All the courses that we offer are very practical routes into teaching, offering hands on teaching experience that is supported by experienced, practising teachers. Through all of our routes you will be supervised and trained by an experienced class based mentor to ensure you develop and grow into an outstanding teacher. Your mentor will be in class with you all year, guiding and helping you as you train. In addition to this, EoETT will also provide you with a Quality Assurance Tutor who will regularly visit you, providing constructive feedback and support to ensure your development. You will be based in school four days a week (on average), learning from the experts and seeing first hand how to be an outstanding teacher. Approximately once a week you will attend training in Lincoln, which is led by current teachers from the school partnership and local experts and educational consultants. \r\n\r\nYou will start with your ‘host school’ in September, and remain with them until the end of the course in July, except for when you undertake a contrasting 6 week second school placement within our partnership. We can GUARANTEE that all your school placements will take place within your local area - wherever this is. Because you spend so much time in school, you will build fantastic relationships with the children in your class and embed your understanding of the primary curriculum, fully preparing you for your NQT year. Many of our trainees secure employment in their host or second school and we continue to have high employment rates.\r\n\r\nAs with any ITT course, you will be assessed against the Teachers’ Standards as well as our own bespoke curriculum and will build a portfolio of evidence across the course that is added to our online portal. Evidence will entail activities you do weekly in school (lesson plans, observations, reflections) and expectations for this evidence will be explained to you at the start of the course.\r\n\r\nIf you choose to complete the QTS only course, you will complete 1 assignment at level 6 - this is marked by EOE Teacher Training.\r\nIf you choose to complete the QTS and PGCE course, you will complete 2 assignments and submit these to our University partner (University of Hull), who will mark these at level 7. The University of Hull will travel to Lincoln to deliver training sessions, you will not need to travel to Hull.","interviewProcess":"You must already have a supporting school who are willing to pay your salary in order to apply. There are no general vacancies for the salaried route at this time.\r\n\r\nWe offer a free ‘checking’ service, where we will give you feedback on your personal statement before you apply. Applications will be screened and suitable candidates will be shortlisted to attend an interview, usually in their local area (or possibly online, due to COVID 19 restrictions). If selected for an interview, we will provide you with full information regarding the interview process, so you feel confident and well informed to attend. The interview process will involve you planning a maths or English lesson, for any age range that you choose, which will be discussed with the panel as part of the interview.\r\nYou will be interviewed by the Head of SCITT, and we will invite the Headteacher of the employing school to the interview too (or a senior leader).\r\nAt the end of the interview we will phone you to discuss the interview and the outcome, as a supportive measure. If you are successful, you will be offered a conditional place which will be confirmed in writing. All trainees are set targets from the interview, to ensure they are fully ready to start the course.","howSchoolPlacementsWork":"You must already have a supporting school who are willing to pay your salary in order to apply. There are no general vacancies for the salaried route at this time.\r\n\r\nWe guarantee that all trainee’s placements will be within their locality - we work hard to ensure that the trainee does not have to travel too far. \r\n\r\nIf successful, we would encourage all trainees to develop their relationship with their school and visit them as much as they feel able to (guidance allowing), so you get to know one another, before the course starts. The more you get to know the systems and routines of the school, the smoother the transition can be at the start of the training year and you will feel more settled.\r\nPlacement schools are guaranteed to be within your locality (e.g if you live in Grimsby, your placements will be in Grimsby); full schools lists can be found here and are updated regularly: https://www.eoettc.com/school-partnerships. If you are from an area where we don’t have an existing partnership, please contact us as we may have relationships with schools in your area and we are always looking to expand the schools in our partnership. Also, if you have a school that is willing to support you, we will happily welcome new schools into the partnership - contact us to discuss further.\r\n\r\nAs the course is school based you will have 2 placements; your host school, and a 6 week second school placement. We follow the ‘ABA’ model, meaning you start in your host school, complete your second school visit and then return to your host school.\r\nYou will also undertake a 1 week special school/inclusion experience (COVID allowing).\r\n\r\nWhilst the course is a Primary (3-11) course, you will have the choice of choosing to specialise in 3-7 years (EYFS & KS1) or 5-11 years (KS1&2). Your school teaching experiences will take place within this chosen age range. ","personalQualities":"We are looking for passionate, exceptional individuals who want to truly inspire future generations. If you are a practical learner who likes to roll their sleeves up and get stuck in, then this is the course for you! Our trainees spend on average 40 more days in the classroom than other University based routes, meaning you are better prepared for your NQT year. If you are an ambitious, creative learner and want to discover your true potential to be an inspirational primary teacher then you are the person for us!","otherRequirements":"Successful applicants will be subject to an enhanced DBS and other safeguarding checks.\r\nPlease be aware that central training is in Lincoln, so if you live outside of this region you will need to travel to training. However, we do encourage trainees to car share where possible to save costs.\r\n","status":1,"createdAt":"2021-07-06T10:49:24.404Z","updatedAt":"2021-09-14T13:16:57.303Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"Salaried trainees will be paid at Unqualified Pay Scale 1 in a maintained school. Academies will pay at the advertised rate which you will be made aware of at interview.\r\n\r\nCourse fees may be covered by your school however you may have to pay towards these.\r\n\r\nIf you opt to complete the PGCE element of the course, please be advised that your school are not likely to cover the additional cost of this (£950) and it would therefore be for you to fund this. As a salaried trainee you are not eligible for student finance funding."}
