{"id":"4f3d9e8d-5c84-4309-baad-45d34b0b3ec6","name":"Primary","code":"22FN","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"f993ef94-11cf-4a43-88ef-259ae9710990","name":"St John's C of E Primary","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"5eac7273-272e-45b6-b996-dc101534dd58","code":"1OR","name":"St John’s Training School"},"accreditedBody":{"id":"4da5abb2-b287-451e-8d75-c5b79e11c2bb","code":"W75","name":"University of Wolverhampton"},"profPost":"BO","degreeGrade":"9","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"The course is for -a Primary teaching qualification. Trainees will link with St John's Teaching School and the University of Wolverhampton. The first month will be spent in the university acquiring knowledge and skills to equip for Primary Teaching. This will then lead to two school based attachments - one will be at St John's and the other in a local partner school. There will be an opportunity mid- year to accompany the university on an international visit either to India or China; researching international education.\r\nThere is also the possibility of a bursary for some candidates which will be provided by Walsall Local Authority. \r\nEmployment rates are very high from this route. St John's has also been at the forefront of the formation of the innovative Walsall NQT teaching pool which , last year, placed up to 40 trainees in Walsall schools for their NQT year.\r\n","interviewProcess":"The interview will be held at St John's school with the Headteacher and the senior course leader at the University. There may be a short task to accompany the subject knowledge audits.\r\nSuccessful candidates will be informed via UCAS","howSchoolPlacementsWork":"Trainees will be placed in two Primary schools in Key Stage 1 and 2. One of the Primaries will be St John's and the other will be a local partner school. All schools will have accredited mentors.","personalQualities":"We are looking for suitable candidates who see teaching as a vocation. ","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:54:15.379Z","updatedAt":"2021-07-09T09:48:53.637Z","canSponsorStudentVisa":"yes","cycle":"2024"}
