{"id":"a09ef55f-c147-42c1-94dd-7e581c0b62d0","name":"Primary (SEND)","code":"3X83","qualification":"qts","startDate":"2024-01-01T00:00:00.000Z","applicationsOpenDate":"other","programType":"TA","fundingType":"apprenticeship","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"yes","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"75dca80a-ae38-4538-a454-4d4a70ee9111","name":"Main Site","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"b1bf806c-26df-45e7-8ae0-ba8f521429e1","code":"1DW","name":"Wilson Stuart School"},"accreditedBody":{"id":"6e7f844d-71e5-49be-a4d6-0211287d7480","code":"B35","name":"University College Birmingham"},"english":"3","maths":"3","science":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"13 months","aboutCourse":"The Teacher Apprenticeship course is a government-funded route to Qualified Teacher Status (QTS). It is a Level 6 postgraduate qualification, and the training takes place in one school.\r\n\r\nTeacher Apprentices are paid and are responsible for their own class of children. They spend four days each week in school and one day at university.\r\n\r\nCandidates for the Teacher Apprenticeship must demonstrate that they are able to achieve QTS by the end of their training programme.\r\n\r\nThis route is particularly well-suited to Teaching Assistants, Higher Level Teaching Assistants, current unqualified teachers and capable graduates.\r\n\r\nThe qualification entitles you to teach in schools in England only.","interviewProcess":"","howSchoolPlacementsWork":"This Teacher Apprenticeship is mainly school-based, and much of what you will learn takes place on-the-job under the guidance of school mentors and university tutors.\r\n\r\nHands-on experience planning lessons with colleagues, delivering lessons to your pupils and assessing children’s progress in learning will give you confidence, knowledge and classroom-ready practical skills.  \r\n\r\nAdditionally, learning in a school setting provides the context for off-the-job training - you will have the opportunity to observe other teachers, participate in training and meet with key members of staff.\r\n\r\nAt university, you will learn about the decision making processes behind each lesson you deliver, the topics and strategies for engaging children with the curriculum, and the essential knowledge and qualities of an excellent teacher.\r\n\r\nThe Teachers’ Standards provide the framework for assessment for the Teacher Apprenticeship. These professional standards set out eight key areas in teaching, and three further areas with regard to your personal and professional conduct that you must demonstrate competency in to achieve Qualified Teacher Status.\r\n\r\nAssessment activities include gathering a portfolio of evidence for the Teachers’ Standards and lesson observations.","personalQualities":"","otherRequirements":"","status":2,"createdAt":"2021-07-06T10:53:02.167Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","applicationsOpenDateOther":"2021-12-15T00:00:00.000Z"}
