{"id":"05f83949-023f-46a9-b3d7-f12b1b7b1958","name":"Chemistry","code":"S643","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"912d4fb4-761b-42e9-8dc6-e968b791ea4e","code":"F1","name":"Chemistry"}],"locations":[{"id":"ebeba462-fab7-4ea5-822c-70283dea655a","name":"Ormiston Cliff Park Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"d71057d1-8ee5-4b45-8893-023589ce4b22","name":"Ormiston City of Norwich School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"2702a686-686b-4c52-aa74-41515afc3eae","name":"Broadland High Ormiston Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"ff15d1ab-5301-4205-a009-c890a3dfe26b","name":"Ormiston Denes Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"7dadffa5-4d37-4fa1-8cd5-c59327319db0","name":"Flegg High Ormiston Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"e0de0bc4-ae0c-4f64-9848-1ace9407a401","name":"Ormiston Victory Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"43b0084c-6441-4f5f-921d-0935a933dad4","name":"Ormiston Venture Academy","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"3b1817ea-d0f3-4385-a555-6361fa0e2e9c","code":"4T7","name":"The OAKS Norfolk"},"accreditedBody":{"id":"7f349baa-f4ef-4fd5-b228-fcc56247e9b9","code":"24P","name":"The OAKS (Ormiston and Keele SCITT)"},"profPost":"PG","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"The OAKS offers candidates the opportunity to train and develop as a subject specialist. A minimum of 40% of the credits obtained from your degree must be directly related to the subject you wish to train to teach.","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"The OAKS offers candidates the opportunity to complete our GCSE equivalence tests in English Language and Mathematics prior to entry.","courseLength":"OneYear","feesUK":9250,"feeDetails":"With The OAKS there is a pre-course fee which covers\r\n- Enhanced DBS check\r\n- Fitness to teach\r\n- Purchasing of Bristol Guide (reduced cost from The OAKS)\r\n- Residential trip.  \r\n\r\nThe cost of this is approximately £125","aboutCourse":"Chemistry Teacher Training invites people from a variety of scientific backgrounds. Whether you have worked in the chemical industry, or are a recent graduate in Chemistry (or in a degree with a substantial element of which is Chemistry, such as Biochemistry or Pharmacy) the course will allow you to develop your subject knowledge and pedagogy, ready to inspire young people.\r\n\r\nChemistry is a core subject, forming one third of science taught to 11-16 year olds. Moreover, it is an exciting yet unique subject, as chemical ideas underpin everything that we know about the world, yet are not tangible and often cannot be seen. The use of practicals and demonstrations in a Chemistry lesson makes the subject stand out in young people’s minds, and the OAKS course will allow you to discover the best way to use such practicals to flourish your individual classroom style. \r\n\r\nYou will explore the use of modelling, games and dance to teach the fundamental Chemical Concepts and how to make chemistry seem relevant to young people, all of which come together to create a simulating and safe learning environment. Sessions will be able to prepare you for handling different situations, since strategies for maintaining discipline and managing the learning in a Chemistry laboratory are considered and discussed. Other topics include:\r\n\r\n•\tRisk assessment, health and safety and lab management\r\n•\tSpectroscopic Techniques\r\n•\tOrganic Synthesis\r\n•\tChemical Reachtions\r\n•\tBonding and Structure\r\n•\tRate of Reaction\r\n•\tChemical Reactions\r\n•\tBonding and Structure\r\n•\tRate of Reaction\r\n•\tChemical Calculations\r\n•\tElectrolysis\r\n•\tRedox and Tirations\r\nSessions are delivered by a Chemistry Subject Expert in one of the Ormiston East Academies, therefore you are required to travel to this school for the delivery of these sessions (5 across the year) \r\n\r\nWhile the course aims to help you meet the Standards which qualify you to teach, it also has wider horizons which encompass the Induction (Newly Qualified Teacher) Year and the early years of teaching. Many of our ex-Trainee Teachers progress rapidly through the profession so we provide you with an appropriate foundation in knowledge, skills and understanding for meeting the teaching, administrative and management demands which lie ahead.\r\n\r\nTo summarise, the course aims for you become a competent, professional and, above all, creative teacher, capable of inspiring and developing the scientific enquiry within the young people with whom you have the privilege of working. \r\n","interviewProcess":"Our selection process is a two way process where you can find out if the OAKS Norfolk is the training programme for you and we can decide if you can potentially become a highly effective secondary teacher.  We always carry out our interviews in one of our partnership schools, where you will be expected to teach either a class or a small group of their students for 15 minutes.  The students give us feedback on your lesson, which we share with you during a formal interview.  This interview then focuses on your lesson, your subject knowledge and your commitment to teach.  There are also written tasks for you to complete; these include a written subject specific activity and a generic writing task.  The whole process should take no more than half a day at the school.  You are interviewed by partnership school staff and OAKS tutors, who will talk through the programme and school placements. There will always be plenty of time for you to ask questions and the decision as to whether you are accepted on to the course is usually made on the same day (this may vary depending on the subject/time of year).\r\n\r\nWe want the interview to be a very positive experience for you. Please arrive promptly and formal dress is expected.  We look forward to meeting you!\r\n\r\n","howSchoolPlacementsWork":"We will send you to two secondary schools where you will receive an 11-16 experience; the time spent in both of these placements is the same.  Hopefully they will give you two contrasting experiences whilst providing a level of stability and progression through the close working relationships between your two schools.  We make sure that you also receive a pre and post phase enhancement. For this you will be placed in a primary school for one week and gain experience in a post-16 environment (possibly in one of your secondary placements).  We are very proud of our alternative education placements that we arrange for you on our programme.  Hopefully you will gain experience in an EAL school, pupil referral unit (PRU), special school and an independent school.  \r\n\r\nTravel to and from your placements is always a key concern and we make every effort to make sure that you can easily commute to your schools.  Our partnership schools are all based in or around Norwich, Greater Yarmouth and Lowestoft. We will endeavour to keep your travel time to a minimum and never more than 75 minutes with the overwhelming majority being significantly lower than this.  When we visit our EAL schools we will travel together on a mini bus to allow collaboration but also to venture further to maximise the experience without expecting you to arrange travel.\r\n\r\nThrough undertaking regular evaluations, all of our partnership schools are deemed to be at least \"very good training experiences\" for our trainee teachers. We know high quality mentoring is key to a successful training year and take this very seriously. We train and then monitor all of our school based mentors and the quality of our school’s provision annually; so rest assured that you will have a good teaching experience with us at the OAKS Norfolk.\r\n","personalQualities":"* Highly motivated individuals wanting to make a positive contribution to the education of young people.       \r\n*Passionate about their own specialism, with excellent subject knowledge.  \r\n*Able to inspire learners and create an environment where everyone wants to succeed.       \r\n* Enthusiasm and a willingness to participate in all aspects of the course.       \r\n* Robust and resilient applicants with a desire to make a difference.       \r\n* Reflective on their own practice and take constructive feedback on board to help their rapid development as teachers.\r\n* People who want to become highly effective practitioners, with a desire to improve themselves and their students.\r\n","otherRequirements":"* a medical report which is deemed satisfactory;\r\n* a completed DBS enhanced disclosure which is deemed satisfactory by the The OAKS;\r\n* a successful completion of a minimum of 10 days teaching experience in a secondary school/college during the last two years. This could be either before or after selection (undertaking this before the selection process commences will strengthen your application).\r\n","status":1,"createdAt":"2021-07-06T10:51:57.232Z","updatedAt":"2021-09-28T11:33:42.567Z","canSponsorStudentVisa":"no","cycle":"2024"}
