{"id":"79b81b1b-dc00-4365-a619-069c11d94db2","name":"Primary","code":"W536","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_7","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"3e8b52d4-f579-40e2-8101-6a7215633347","name":"Grange Valley Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"9f8902a6-90ca-4f6e-ac67-5d8dcd3f5928","name":"Eaves Primary","isPublished":"Y","status":"R","vacancies":"F"},{"id":"562917df-368b-4736-87d5-ff0e9ba7e5fa","name":"Parish C of E Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"0359a68a-a1f7-4aba-9bae-6d7c98b734a7","name":"Bleak Hill Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"e7847c7e-5217-4e61-9bfe-aa06d8aeda95","name":"Oakdene Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"c8d089a4-60f7-4f32-ae1c-70bd78304cab","name":"Eccleston Lane Ends","isPublished":"Y","status":"R","vacancies":"F"},{"id":"e93d9efb-6d50-4600-ba93-acf70f7cc2aa","name":"St Austin's Catholic Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"90f13678-b6c1-4e7c-a8c7-91730ae05a83","name":"Rivington Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"36a94ee6-9c58-4ed5-a77f-f5d75e9a0127","name":"Rainford Brook Lodge Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"5f4a10ec-0ad3-414a-997a-2d97f14bff95","name":"Mill Green School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"21f23b84-d1c9-4879-b771-5818f649ff9f","name":"Sutton Oak C of E Primary","isPublished":"Y","status":"R","vacancies":"F"},{"id":"d98521b0-b13f-480c-aaa9-d1f5c5bb9656","name":"Wargrave C of E Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"c468aa79-50b1-4045-b0c6-0c0c9961d01b","name":"Thatto Heath Primary School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"505edc7f-1856-4330-b1eb-a50d784b6c25","code":"2KF","name":"St Helens ONE - Grange Valley Primary"},"accreditedBody":{"id":"e328aab3-a535-4921-8ded-5e37133c76dd","code":"L46","name":"Liverpool Hope University"},"profPost":"PG","degreeGrade":"9","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"financialSupport":"Trainee Support Available:\r\n\r\nEach trainee successfully entering a St Helens ONE PGCE (QTS) programme 2020/21 will recieve a laptop to use while undertaking the programme.","aboutCourse":"Grange Valley Primary School is an Outstanding National Support School with responsibility for the St. Helens ONE Schools Direct training. We are pleased to offer a Primary (3-7) PGCE (QTS) route into Early Years teaching via our School Direct Programme. Successful completing of the course will qualify you to enter the teaching profession as a Early Career Teacher (ECT) with a PGCE qualification which provided 20 masters credits.\r\n\r\nSchool Direct is an innovative way of delivering Initial Teacher Training via school placements and training led by successful schools themselves. Our School Direct programme is highly successful and is led by an National Support School with  bespoke training is delivered within our partnership of highly performing schools.\r\n\r\nTrainees undertake three school placements at different settings, maximising the range of experience received. Experience will be gained in both Early Years and  KS1 over a minimum of 120 placement days. In each placement trainees are treated as part of the school team and take part in all elements of the school day, attending staff meetings, supporting parents evening and extra-curricular activities for example. This means our trainees graduate 100% ready to take on their ECT year and leave us confident and classroom ready!\r\n\r\nTraining modules are delivered over the course of a school academic year. All training is delivered by the highest quality current practitioners and expert consultants meaning your training is current and relevant to schools today.\r\n\r\n* 120 days for Whole Class Teaching in Nursery, KS1 & Reception\r\n* 50 days for Professional Practice & Training\r\n*  9 days at Alternative Settings\r\n* 12 days of Academic Masters Study at Liverpool Hope University.\r\n\r\nTrainees are assessed throughout the programme via placement observations, evidence files and two academic assignments.\r\n\r\nTraining days are usually delivered in St Helens at Grange Valley Primary School training suite with Masters Days delivered at Liverpool Hope University. \r\n\r\nWe are proud of our outstanding team of mentors who support each of our trainees every step of the way through the programme and beyond. With regular contact and personalised support available we have a high percentage of trainees graduating as ‘Outstanding’ and maintain our 100% pass and excellent employment rates.\r\n","interviewProcess":"Interviews are aimed to enable us to assess your key skills and attributes. It will include:\r\n\r\nObserved Classroom Activity - You will be asked to deliver a short session to a group of children. Further details will be confirmed in the invite to interview letter.\r\n\r\nInterview - Conducted by a panel of ITT leads a set of questions designed to ascertain your ideas and knowledge on a range of educational issues will be asked.\r\n\r\nNumeracy & Literacy task - You will undertake a short numeracy and literacy task to assess your standard of Mathematics and written English.","howSchoolPlacementsWork":"The St. Helens ONE partnership has a wide network of Early Years settings and schools who host our trainees for placements. Most of these schools are within the St Helens area, no more than 9 miles apart. \r\n\r\nTrainees undertake three placements in at least 2 different schools over the course totalling a minimum of 120 placement days.\r\n\r\nEach placement is chosen based on trainees development needs and prior experience with an aim to offer the broadest experience possible and to develop them as teaching professionals.\r\n\r\nPotential candidates are encouraged to contact St Helens ONE directly with any questions they may have regarding the course or placements.","personalQualities":"We are looking for hardworking, ambitious and caring individuals who want the chance to teach in the Early Years or Key Stage 1.\r\n\r\nYour capacity to learn and dedication to teaching as a profession is what we are looking for in a candidate. Resilience, high levels of organisation and professionalism along with great communication skills and excellent written and spoken Standard English are essential for success.\r\n\r\nIt is desirable to have some classroom experience and of having worked with children or young people.","otherRequirements":"Liverpool Hope University will undertake the following prior to the start of the course:\r\n\r\nHealth Check Statement\r\nEnhanced Disclosure from the Disclosure and Barring Service.\r\nOverseas Declaration\r\n\r\nThe DFE have published that Skills Testing previously required are not a requirement for 2020/2021 applicants.","status":1,"createdAt":"2021-08-05T13:44:44.985Z","updatedAt":"2021-08-05T14:01:25.122Z","canSponsorStudentVisa":"no","cycle":"2024"}
