{"id":"2542ad9d-467d-4d1b-9e57-704587c72894","name":"Geography","code":"2DH8","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"HE","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3f47e67b-7fa5-4947-a5a0-74d528cd2a87","code":"F8","name":"Geography"}],"locations":[{"id":"72a035c9-60d8-4aa3-a1f9-a6df78f2ae0c","name":"Ark Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"49d0251a-c189-41b9-ae40-75c012267486","name":"Kensington Aldridge Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"ebb2605c-7836-4cc5-aa85-b9a9faa8705a","name":"Ark Greenwich Free School","isPublished":"N","status":"S","vacancies":"F"},{"id":"fd3f8a32-5a4b-43db-ab4e-8aaa6261fa39","name":"Partner school - Isle of Sheppey","isPublished":"N","status":"S","vacancies":"F"},{"id":"3de3ca2e-e3f5-4194-95ac-1501ba60da68","name":"Ark Walworth Academy","isPublished":"N","status":"S","vacancies":"F"},{"id":"fb5fa9e3-83ad-46a8-8ad8-67bbcc677813","name":"Ark Elvin Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"44d9d367-10d4-4de2-b316-07efc9fa2e82","name":"Ark partner schools","isPublished":"N","status":"S","vacancies":"F"},{"id":"83f51a8f-7265-48c8-a9b2-0889fd31afa1","name":"Ark King Solomon Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"61dbbd61-b15c-429e-b12c-f8795ce3a316","name":"Ark St Albans Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"19361d16-fbba-40be-9457-aa38f2a9c3f6","name":"Ark Burlington Danes Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"fed55acf-5c32-49d0-8600-121ec88d1e8b","name":"Ark All Saints Academy","isPublished":"N","status":"S","vacancies":"F"},{"id":"11b1b43d-3e12-488f-9be0-f9d4074fe665","name":"Ark Kings Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"e6d885a1-8dd5-4662-8a72-94d34309f3da","name":"Ark Victoria Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"d6b80aa9-daec-4bba-834f-c78ee2d2a765","name":"Ark John Keats Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"1b14df65-ade2-4e5a-a303-855a1e200b66","name":"Ark Charter Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"3aee775d-0233-4e77-b41d-b181102c3d59","name":"Ark Acton Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"0e974dd8-f237-4529-8fd7-ae1b33c070f8","name":"Ark Putney Academy","isPublished":"N","status":"S","vacancies":"F"},{"id":"d6e96829-e4fc-460b-96e4-da3cabfceb6f","name":"Partner school - Southampton","isPublished":"N","status":"S","vacancies":"F"},{"id":"af7e023a-cb31-48f1-aefc-426a03f7d04c","name":"Ark Boulton Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"472de284-8e1d-4cbc-bfd6-cacd5df9da00","name":"Ark Bolingbroke Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"c96416e8-23d2-4b8b-9e62-ee2aca2c8359","name":"Ark Alexandra Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"e8ab59ab-d087-4d26-ac8c-1382219bd95c","name":"Ark Evelyn Grace Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"9c121795-e3c3-4738-bbef-fec4b9da4277","name":"Ark Isaac Newton Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"64bb1281-f021-4216-8801-f69742c82b8a","name":"Ark Globe Academy","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"d0986f27-a799-48e6-a367-9e3aac8924ab","code":"1CS","name":"ARK Teacher Training"},"profPost":"PG","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"If you do not have a degree in or related to your teaching subject of interest, we will need you to have a good (B+) A-level or high school equivalent in that subject.","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We accept most equivalency test providers. You will need to have passed your GCSE equivalency test before applying to our programme; we will not be able to process your application until you have passed.","courseLength":"OneYear","feesUK":9250,"feeDetails":"- On the tuition fee route you will be responsible for paying your own tuition fee of £9,250 to Ark Teacher Training, whether or not you are eligible for a Department for Education bursary. \r\n\r\n- To see if you're eligible for a tax-free government bursary, click [HERE](https://getintoteaching.education.gov.uk/funding-and-salary/overview).\r\n\r\n- As long as you're eligible, you can register with Student Finance to give you a a student loan to help you with payment of the tuition fee while you train, so that you don't have to worry about it during the training year. Click [HERE](https://www.gov.uk/student-finance) to check if you are eligible.\r\n\r\n- Any questions relating to your tuition fee payment through the Student Finance should be directed to them, as Ark Teacher Training does not control this.","aboutCourse":"Ark Teacher Training’s purpose is to transform children’s lives through education, regardless of their circumstances or background. We are committed to providing the highest quality professional learning for trainee teachers, supporting them to have the biggest impact in the classroom and providing an excellent foundation for a successful career in education. \r\n\r\nArk Teacher Training gives you a firm foundation in how to teach Geography for secondary school students. Over the year you will have regular sessions focused not just on how to be a great teacher but how to be a great Geography teacher.\r\n\r\nOver the training course we will cover how to plan Geography lessons for a range of year groups, how to assess geographical work, how to inspire pupils through the world around them, and help them to understand their local geography. We will also cover how to teach pupils skills unique to Geography such as map skills, geographical questioning, and fieldwork techniques.","interviewProcess":"Once you've checked that you're [eligible](https://www.arkteachertraining.org/apply-now/eligibility-criteria/), you can either submit your application directly through the UCAS or Apply portals, or use our own ‘Apply Now’ form, which is available on our website. \r\n\r\n* We will assess your application and let you know whether or not you meet our [selection criteria](https://www.arkteachertraining.org/characteristics-and-qualities/). \r\n* Applicants who meet our criteria will be sent two online tests to complete: a situational judgement assessment and a subject knowledge test. You can have a look at the format of the situational judgement test on our website, [here](https://www.arkteachertraining.org/apply-now/how-to-apply/)\r\n\r\n* If your application is shortlisted, you'll be invited to our first stage of assessment with a recruiter: a video interview and pre-prepared presentation. \r\n\r\n* Successful applicants will then proceed to the final, school-led assessment. Due to Covid-19, this will be a video call with an interview panel consisting of a senior leadership team member or Principal of one of our partner schools, as well as members of our programme delivery and recruitment teams. You'll 'teach' a short lesson and be asked to respond to feedback, as well as answer some questions to help us further determine your readiness to train to teach. \r\n\r\nIf you're successful, we'll match you with the school in our network that best fits your profile, and you'll be offered a place there.\r\n\r\nIf you applied through our website originally, we'll ask you to complete your UCAS form at this stage so we can finalise our decision through the formal portal.\r\n","howSchoolPlacementsWork":"Your training school - in London, Birmingham, Hastings or Portsmouth - will be matched to your particular profile as a candidate, while taking into account your commuting distance and funding/subject preferences (and availability on our programme, which changes as we move through the recruitment cycle). \r\n\r\nBecause of Covid-19 restrictions and pressures on schools regarding external visitors, you may not be able to visit your school before accepting an offer there. However, please be assured that schools are equally as keen to invite you to visit in person and will work with you to arrange this as soon as they can (most likely after your DBS check has been completed). \r\n\r\nThe training programme itself is 100% school-based, but you will come out of school to spend a half day every week in a session with your Ark tutor and other trainees from the network. \r\n\r\nYou’ll also obtain experience in different schools throughout the year; you will have a three week placement in a different school to your own, and will also have the opportunity to visit other educational settings.\r\n","personalQualities":"Our applicants have a huge variety of experience between them, all of which can be used in the classroom.\r\n\r\nHowever, there are some qualities we know all successful trainees have, regardless of their background or experience; we look for these at assessment: \r\n\r\n- Alignment with Ark’s values and ethos\r\n- Some experience with young people (doesn't have to be in a school)\r\n- Great communication skills\r\n- Resilience (teaching is hard!)\r\n- Curiosity and eagerness to learn\r\n- Self-awareness and keenness to hear/act on feedback (you'll receive a lot on our programme, every week!)","otherRequirements":"There's a great deal to think about when you make the decision to train as a teacher: it's an intensive year, but on Ark Teacher Training you'll be well-supported and have plenty of time with your fellow trainees for moral support every week. \r\n\r\nIf you have questions about areas not covered in this search tool so far, our website covers a lot of specific information on our programme. Check out our ['Frequently Asked Questions'](https://www.arkteachertraining.org/apply-now/application-faqs/) if you can't find what you're looking for!","status":1,"createdAt":"2021-07-06T10:51:33.597Z","updatedAt":"2021-07-23T15:15:00.311Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
