{"id":"2b14c473-ea0d-438e-90ab-ff3b7edab7b3","name":"Design and Technology","code":"3C5D","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"118fabd7-86d0-4a40-9e9a-e5c302abe59b","code":"DT","name":"Design and technology"}],"locations":[{"id":"76e9f859-92f1-4e7e-9112-7f1bc0211538","name":"The Pingle School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"924fc12f-1f2f-4b53-a3b8-de9180f4730c","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"174b60fe-3dac-47c0-a65a-5691b6dda11c","code":"24V","name":"The John Taylor SCITT"},"profPost":"PG","degreeGrade":"1","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"The Programme is essentially divided into 6 phases:\r\n\r\n- Phase 1: 8-day induction in the SCITT\r\n- Phase 2: 4-day Primary Placement\r\n- Phase 3: Classroom Practice 1 at a de Ferrers Trust Academy.\r\n- Phase 4: Classroom Practice 2 in a contrasting setting. This well be a 9-week placement\r\n- Phase 5: Week in a special School.\r\n- Phase 6 Classroom Practice 3 in your home school.\r\n\r\n\r\nIn each Phase of Classroom Practice, you will spend 4 days in your placement school. The fifth day is a training day at John Taylor High School. In the morning all trainees undertake general professional studies training or work with a colleague from the University of Derby on PGCE assignments and in the afternoon split into subject groups. \r\n\r\nThere will be 3 main assessment points throughout the year and by the end of the year trainees will need to demonstrate and evidence that they can fully meet each of the eight Standards for Qualified Teacher Status as well as Part 2 of The Standards. A Subject Knowledge viva at the end of the programme will provide you with the opportunity to demonstrate how you have developed skills and subject knowledge over the course of the year.","interviewProcess":"If your application meets the requirements of the programme you will be invited to attend an interview at a de Ferrers Trust Academy, where two members of the Academy leadership team , and a subject specialist will interview you.\r\n\r\nYou will also complete a lesson observation and provide feedback on your observations to a member of the interview team.\r\n\r\nThere will also be a subject knowledge discussion with a subject specialist.\r\n\r\nIn order to assess your interaction with our pupils you will answer a series of questions posed by a student panel.","howSchoolPlacementsWork":"Your main placement will be in your selected school. This placement will commence following the induction at the John Taylor SCITT and the 4-day primary placement.  Trainees will be in their placement school four days a week, and at the SCITT one day a week.\r\n\r\nDuring the spring term you complete a nine week placement in a second school in order to promote collaborative learning and broaden your experience. The second placement will take place in one of the 14 secondary schools in the National Forest Teaching School Alliance, all based in the local area.\r\n\r\nYou will experience teaching students from age 11 to 18 during your placements ","personalQualities":"A desire to teach and work with young people\r\n\r\nEffective communication skills\r\n\r\nDetermination to succeed\r\n\r\nA readiness to listen and share\r\n\r\nA flexible approach to learning and teaching","status":1,"createdAt":"2021-07-06T10:49:11.433Z","updatedAt":"2021-10-04T17:08:25.341Z","canSponsorStudentVisa":"no","cycle":"2024"}
