{"id":"a70833d9-aa83-42e4-a69b-413f0e9cce67","name":"Primary","code":"3CX7","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"B","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"d54ef501-50b2-49f6-8fa6-b7a3adc311dc","name":"Richard Wakefield CE Primary Academy","isPublished":"Y","status":"R","vacancies":"B"},{"id":"ebc5a37a-652d-494b-a261-6525c4a2c375","name":"St Peter's CE Primary School, Hixon","isPublished":"Y","status":"R","vacancies":"B"},{"id":"787d403b-79b4-488a-9041-78f151068ebf","name":"Walton on Trent CofE Primary and Nursery School","isPublished":"Y","status":"R","vacancies":"B"},{"id":"84c84884-f7ad-4951-a285-9593abb2bddc","name":"The Mosley Academy","isPublished":"Y","status":"R","vacancies":"B"},{"id":"304412be-2ec5-4434-8295-1d03bdde9a82","name":"Shobnall Primary & Nursery Academy","isPublished":"Y","status":"R","vacancies":"B"},{"id":"6ee83796-2c91-4edd-a2a4-9c4aec6da6d7","name":"Redbrook Hayes Primary School","isPublished":"Y","status":"R","vacancies":"B"},{"id":"b0d4df5e-d0d9-4ce0-aa15-76753e832108","name":"Glascote Academy","isPublished":"Y","status":"R","vacancies":"B"},{"id":"03b9a06d-f6ee-4ca2-a80b-9bf57c6031d5","name":"Main Site","isPublished":"Y","status":"R","vacancies":"B"},{"id":"1765835c-f513-4b56-9ccc-f015f3dbebb3","name":"The Violet Way Academy","isPublished":"Y","status":"R","vacancies":"B"},{"id":"c7d29785-1ea7-4192-8ca9-e6f0ae565843","name":"The Howard Primary School","isPublished":"Y","status":"R","vacancies":"B"}],"trainingProvider":{"id":"174b60fe-3dac-47c0-a65a-5691b6dda11c","code":"24V","name":"The John Taylor SCITT"},"profPost":"PG","degreeGrade":"1","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Our goal is to ensure that all our teacher trainees graduate prepared and inspired to create an exceptional learning adventure for every child in any school. We achieve this through strong partnerships with our alliance schools, personalised mentoring for each trainee and a bespoke, supportive training programme.\r\n\r\nOur cohorts graduate with exceptional outcomes with the high majority  of our trainees from our past two cohorts securing employment before the end of the programme.\r\n\r\nQTS Training Programme\r\nThe programme has 5 components; these components are carefully linked together so that theory and learning at the training centre will feed directly into your classroom practice.\r\n1.\tInduction\r\n2.\tClassroom Practice \r\n3.\tProfessional Studies Training Modules\r\n4.\tSubject Knowledge Development Modules\r\n5.\tSchool Based Tasks  \r\n\r\nAs a guide, each week you would spend 4 days in your placement school and 1 day in training.\r\n\r\nWe work collaboratively with outstanding practitioners from across our family of schools to design and deliver our exceptional and exciting school-based training offer. \r\n\r\nThe Training Centre at the John Taylor High School is the main venue for the majority of our training. To compliment this learning, some of our sessions are delivered in local primary schools which will enable you to directly see the theory you have learnt in action. \r\n\r\nDuring training sessions, you will develop your curriculum and subject knowledge for teaching and engage in professional practices such as inclusion, safeguarding, behaviour management and pastoral care. We use a spiral approach to continually deepen your pedagogical understanding in areas such as assessment for learning, differentiation and growth mindset. Our subject knowledge modules have an in-depth focus on the core subjects of English and Maths, but we feel that it is equally important to develop your confidence in delivering the whole curriculum.\r\n\r\nPGCE (Teaching and Learning Masters level study)\r\nAlongside QTS, trainees will be accredited with a PGCE and 60 Masters Level credits by the University of Derby. The credits are fully portable and can be used on other Masters level programme. There are three assignments, which are closely linked with the QTS training programme and are designed to support you in becoming an effective classroom practitioners. You will have full access to the University of Derby Library and VLE for support. All university input takes place at the Training Centre.\r\n","interviewProcess":"Interviews will normally be held at one of our partner primary schools to help you get a flavour of what school life is like. \r\n\r\nOur interview process is rigorous and evaluates all aspects of your potential to teach. It has several parts which are designed to assess:\r\n\r\n* Literacy and numeracy skills\r\n* Interactions with children\r\n* Awareness of qualities required needed to be a good teacher\r\n* Awareness of what constitutes high quality teaching and learning in Primary Schools\r\n* Interpersonal and communication skills\r\n* Awareness of educational issues\r\n* Rationale for wanting to become teacher\r\n* Suitability for the profession\r\n* Resilience\r\n\r\n","howSchoolPlacementsWork":"You will be assigned a Home School from our alliance; this is where you will begin and end your training year. Following a period of induction in the Training Centre you will spend the majority of your time in the classroom developing effective classroom pedagogy. Through a structured programme of observation, joint planning and joint delivery of lessons you will gradually build up to whole class teaching. You will work alongside outstanding practitioners and will be supported by highly trained mentors, all of whom are committed to ensuring the very best experience and outcomes for their trainees.\r\n\r\nAfter Christmas you will undertake a shorter second placement in a different school. This is an opportunity to learn within a new school context and gain exposure to a new range of teaching and learning strategies develop your practice further. Second placement schools will also offer a contrast in key stage and school context. \r\nUnlike other providers, we also offer 2 small enhanced placement opportunities before returning to your home school, these include a Special School placement and an Early Years placement. We feel both of these are essential in supporting you to develop a wide range of skills and strategies to support your teaching. \r\n\r\nAllocation to your home school within the alliance will been based on a number of criteria, including:\r\n\r\n* The school’s willingness, capacity and competency to host a trainee\r\n* Trainees’ personal circumstances, e.g. distance to travel, age range preferences etc.  \r\n(Trainees should note that all our schools are deemed to be within an acceptable travelling distance from John Taylor Hight School.)\r\n\r\nAllocation to the second placement is based on the above and this will include a contrasting key stage so that all stages of the Primary curriculum are covered throughout the training year. It is important that trainees have experience of 2 contrasting school contexts.\r\n","personalQualities":"We are looking for highly motivated trainees with a real passion and commitment to ensuring the very best outcomes for every child, regardless of their starting points. Enthusiasm and a desire to inspire and motivate young people are essential qualities in all applicants. Successful trainees will be expected to reflect on and evaluate their progress and practice in the classroom, identifying ways to improve and be willing to take advantage of professional development opportunities. We require our trainees to be good team players, who listen as well as contribute, who have an appreciation of the strength of collaboration.","otherRequirements":"* Internal Literacy and Numeracy Tests if candidate has a Level 4 or Grade C at GCSE in English or Maths.\r\n* Applicants must have successfully gained a Disclosure and Barring Service (DBS) check, which is required at the point of accepting a place.\r\n* Fitness to Teach\r\n* Meeting the Secretary of State's requirements for physical and mental fitness to teach.\r\n","status":1,"createdAt":"2021-07-06T10:48:07.104Z","updatedAt":"2021-09-17T10:50:27.861Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
