{"id":"cce21484-4dcd-4a6f-976c-a1dcfe7973f6","name":"Primary","code":"L206","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"eb60261d-2a2f-444f-8acc-f5ad61556a7c","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"e8ea0f17-91d8-4cf9-a962-b2740a44d05a","code":"166","name":"Teach Thurrock Primary Partnership"},"accreditedBody":{"id":"b3681bbc-2e2a-49c3-aa4e-e453a8d0e4a5","code":"G70","name":"University of Greenwich"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","science":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We advise that you use www.equivalencytesting.com","courseLength":"OneYear","feesUK":9250,"feesInternational":9250,"feeDetails":"Applicants are strongly advised to seek a student loan to pay for their course.  Teach Thurrock offers a £1000 travel bursary for all of our student teachers.  This is paid in two installments throughout the training year. ","financialSupport":"Teach Thurrock offers a £2000 travel bursary for all of our student teachers.  This is paid in two installments throughout the training year. ","aboutCourse":"This modular programme runs for one year and is available to high quality graduates.  Successful completion will lead to the award of a Postgraduate Certificate in Education (PGCE) and the award of Qualified Teacher Status (QTS).  Candidates are entitled to a tuition fee loan and may be eligible for a bursary.\r\n\r\nThe tuition fee programme offers:\r\n\r\n* full-time school-based training with University of Greenwich\r\n\r\n* placement in two Good or Outstanding local schools from the Teach Thurrock Primary Partnership \r\n\r\n* approximately 24 weeks in school with remaining time at university\r\n\r\n-* interactive sessions at the university focused across a range of modules\r\n\r\n* visits by your own personal tutor\r\n\r\n* choice to specialise in EYFS, KS1 or KS2\r\n\r\n- support by mentors and experienced teachers\r\n\r\nStudents are required to study the following compulsory modules.\r\n\r\n* Final School Experience and Professional Development (30 credits)\r\n\r\n* Inspiring Primary Learners (30 credits)\r\n\r\n* Initial School Experience and Professional Development (30 credits)\r\n\r\n* Children's Learning and Development (30 credits)\r\n\r\nWhat you should know about this course\r\n\r\n* Ofsted rated the quality of teacher training as 'Outstanding' in its report for Initial Teacher Education 2016.\r\n\r\n* You engage in core practice and learn the professional values of teaching.\r\n\r\n* You will undertake a minimum of 24 weeks’ comprehensive training in two adjoining age ranges.\r\n\r\n* Voted in the top two universities in London with 96% student satisfaction in 2018 (NSS 2018) and 98% student satisfaction (NSS 2017).\r\n","interviewProcess":"Application\r\n\r\nAll application forms will be vetted for the following: \r\n1) Applicant meets the academic entry criteria \r\n2) Applicant has written a strong personal statement \r\n3) Applicant has been given a strong reference. This should be an academic reference if the applicant has been in education within the last five years. \r\n\r\nTeach Thurrock and the University of Greenwich work together to interview applicants.  In order for your application to be considered you should complete a full application and consider your personal statement as being an important part of this process.  If you are shortlisted you will be asked to complete written tasks and attend a formal interview as well as teaching a small group of children at the lead school, Dilkes Academy. \r\n\r\nThe interview process is in two stages:\r\n\r\nThe first stage will comprise of a maths and English task.\r\nThe second stage will involve an interview with a panel and a teaching task.  \r\n\r\n","howSchoolPlacementsWork":"There will be two teaching practices during your training year- an initial placement from November to February and a final placement from April to June.  These will be in consecutive phases i.e. EYFS and KS1.  \r\n\r\nTrainees will normally be placed in two of the 15 schools in our partnership. We offer our prospective trainees the opportunity to visit and give preferences over which schools they wish to train in.  This unique opportunity to be part of the placement process ensures you are placed in the best school for you. \r\n\r\nThe majority of your training will take place at within Teach Thurrock schools with a range of colleagues. The training programme will be personalised to the individual's professional needs but will include training on the following areas: teaching and learning, curriculum, assessment, working with parents and the community. All training is closely aligned to support the trainee achieve the Teachers’ Standards and the new ITT Core Content Framework. \r\n\r\nCandidates will have the opportunity to work alongside experienced and outstanding teachers. Support and mentorship will be given by senior leaders. \r\n\r\nThe Teach Thurrock Primary Partnership offers an enhanced Professional Studies programme with trainees from all our schools coming together each week to study through a research based curriculum. With the unique guidance of the Thurrock Primary Teaching School Alliance trainees will use action based research to develop into outstanding teachers of the future. In turn, you will be part of a wider support network where you will have opportunities to share ideas and strategies with fellow trainees. \r\n","personalQualities":"We are looking for someone who: \r\n* has good organisational skills \r\n\r\n-*has excellent time keeping \r\n\r\n*  is approachable, empathetic and enthusiastic \r\n\r\n-*has the ability to be decisive, consistent and to set priorities \r\n\r\n* is an effective communicator (both orally and in writing) to a variety of audiences \r\n\r\n* has the ability to develop good relationships within a team and ability to be a supportive team player \r\n\r\n* has a commitment to personal professional development \r\n\r\n* has the ability to relate well to all involved in school life, showing sensitivity, consideration but also a sense of humour when needed. \r\n","otherRequirements":"All PGCE students will be required to carry out DBS and other employment checks before they commence any teaching practices. ","status":1,"createdAt":"2021-07-06T10:50:11.644Z","updatedAt":"2021-10-12T13:04:14.496Z","canSponsorStudentVisa":"no","cycle":"2024"}
