{"id":"a7cc0428-a0e3-43f0-87bf-740682d75d73","name":"Geography","code":"2957","qualification":"pgce_with_qts","startDate":"2024-07-31T23:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3f47e67b-7fa5-4947-a5a0-74d528cd2a87","code":"F8","name":"Geography"}],"locations":[{"id":"95f62a2c-20cc-4d91-ae14-051b5ac719d8","name":"Lead School: Knutsford Academy","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"14b9044a-557e-4408-8a3f-df8ce6079d93","code":"1M1","name":"Teacher Training @ Knutsford"},"accreditedBody":{"id":"ec34b77c-cba3-4598-93be-23f0471adff1","code":"L51","name":"Liverpool John Moores University"},"profPost":"BO","degreeGrade":"1","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feesInternational":14000,"aboutCourse":"Our PGCE programme commences at the beginning of September 2021. It begins with a week-long introduction at school, followed by an induction with LJMU, which prepares trainee teachers to start their training with us. The programme comprises of four days class contact, along with one professional training day each week. Trainees are based in school Monday to Thursday and also follow a Professional Studies Programme on Friday. The Professional Studies programme is delivered predominantly at the Knutsford Academy site, supported by online learning and University based sessions. The programme follows a sequenced curriculum, closely linked to the new Core Content Framework, published in September 2020. LJMU tutors deliver the PGCE element of the programme through a mix of lecture and workshop activities. In addition to this, practising School Leaders, from across our Trust of schools, deliver a programme of evidence-based sessions, which explore the best strategies that can be used in the classroom, to ensure that trainee teachers have the best possible foundation for their future career.  \r\n\r\nITT students are assigned a 'home' placement and they then attend an 'alternative placement' between Christmas and February half term. The placement model is broken down into three phases, as outlined below. Teaching expectations and timetable commitments increase as the year progresses: Phase 1 - Observation and beginning teaching and learning. Phase 2 - Consolidating and developing teaching and learning. Phase 3 - Extending teaching and learning leading to Qualifying to Teach\r\n\r\n\r\nThe Postgraduate Certificate is assessed through two modules. The course team and partnership schools have worked together to ensure that the PGCE award is both relevant and manageable. The award of QTS is integral to one of the academic modules. Trainees also submit one academic essay, in two parts, which focuses on reflecting on aspects of their practice.\r\n\r\n\r\n","interviewProcess":"Candidates who are short-listed will be invited for interview at Knutsford Academy, or online via Zoom. Applicants will meet with representatives from The Learning Alliance (of which Knutsford Academy is the lead school for ITT). The interview process has been designed to last half a day and will comprise of the following activities:\r\n\r\n* An introduction to our ITT programme\r\n* Group task with Year 7 pupils\r\n* A five minute presentation on a pre-prepared topic\r\n* An individual interview exploring subject specific issues as well as your reasons for wanting a career in teaching. It will also explore your attitudes to young people and your understanding of what teaching entails.\r\n\r\nYou will be considered on your ability to communicate clearly and on your engagement with all parties throughout the process. \r\n\r\n\r\n\r\n","howSchoolPlacementsWork":"We will arrange and provide a quality placement experience for all candidates in two schools over the academic year. Trainees will spend the majority of time in a home school placement and this is complemented by a second, short- term alternative placement.\r\n\r\nWe partner a range of schools across Cheshire East, Cheshire West and Manchester and are continually increasing these. They currently include:\r\n\r\n\r\nKnutsford Academy, Knutsford.\r\nWeaverham High School, Weaverham.\r\nWinsford Academy, Winsford.\r\nMiddlewich High School, Middlewich.\r\nMarple Hall School, Stockport.\r\nBramhall High School, Stockport.\r\nRuskin Community School, Crewe.\r\nSir William Stanier, Crewe.\r\nThe Oaks Academy, Crewe. \r\nUTC, Crewe.\r\nTytherington High School, Macclesfield.\r\nThe Macclesfield Academy, Macclesfield.\r\nSt Pauls Catholic High School, Wythenshawe.\r\nCongleton High School, Congleton\r\n\r\nWhen assigning placements to trainees, we work in partnership to ensure that travel distance is not too onerous and that the school context matches expectation. We are able to arrange a change of placement, if we feel that this will benefit the individual during their trainee year - for example to gain more 16 - 18 experience. \r\n\r\n\r\n","personalQualities":"","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:49:51.686Z","updatedAt":"2021-07-16T11:18:27.221Z","canSponsorStudentVisa":"yes","cycle":"2024"}
