{"id":"ea528bf8-bc1c-4e2e-bb4b-4ea492c690b9","name":"Music","code":"2K25","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"24311bef-8673-41fb-933c-53f887fb6976","code":"W3","name":"Music"}],"locations":[{"id":"47112d4d-1084-4d5d-a292-56080badf614","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"c6016000-be48-4c31-bbd1-285e09e318fa","code":"1L2","name":"Omega Teaching Partnership"},"accreditedBody":{"id":"9be9f611-2d36-431a-9109-7fcbbfc88fc8","code":"C99","name":"University of Cumbria"},"profPost":"BO","degreeGrade":"1","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"University of Cumbria will offer equivalency tests in English and Maths.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"On successful completion of this programme you will be awarded a PGCE in Secondary Education with Qualified Teacher Status (QTS) and 60 Masters Level credits by University of Cumbria. \r\n\r\nOur School Direct PGCE programme enables you to spend the vast majority of your year in a highly supportive school environment. Working with a school mentor who is a Music specialist you will be supported to gradually develop professional knowledge, understanding and skills necessary to become a teacher.  \r\n\r\nYou will start your first school placement at the beginning of September with a two week induction and will feel part of the staff team.  Working alongside department colleagues on Inset day and seeing the new Year 7 intake arrive on their first day are valuable experiences which shape relationships for the coming year. \r\n\r\nWeekly partnership conferences will take place in our training centre in Great Sankey, Warrington.  These are led by expert teachers and Specialist Leaders of Education. These days are enhanced by 12 days at University of Cumbria (Lancaster Campus) for subject specific tutorials led by University experts. \r\n\r\nThis course blends theories about learning with the wide range of skills that a teacher needs. We give you opportunities to carry out research into the aspects of teaching that capture your imagination. This helps you develop a reflective and analytical view of your work in the classroom, which sustains the high levels of progress we expect.\r\n \r\nYou learn about the curriculum, from the framework provided by the National Curriculum through to the individual lesson plans that teachers use to support learning in their classrooms. \r\n\r\nYou will learn about the teacher's role in establishing an effective climate for learning and practical strategies for managing the behaviour of students. \r\n\r\nSessions in University support you in finding out how to use ICT effectively in your lessons, how to mark books and assess work, and how the new Key Stage 4 curriculum is structured. \r\n\r\nWe use a variety of methods and group sizes in our teaching, including subject methodology sessions where practical work is completed, small tutorial groups for discussing issues, mixed-subject research training activities, and other opportunities to share ideas and work with your peers in small and large teams. \r\n\r\nAssessment takes the form of three pieces of written coursework and a portfolio of evidence to demonstrate that you have met the standards for Qualified Teacher Status .","interviewProcess":"Great Sankey High School is the lead school in the partnership and will be co-ordinating the recruitment process. We work in partnership with University of Cumbria to ensure that the selection and recruitment process is transparent and rigorous. \r\n\r\nSenior colleagues from schools in the partnership will be involved in the selection process. \r\n \r\nYou will need to attend 1 interview. The process is will involve the following activities:\r\n* planning and preparing a 10-15 minute activity for a group of 7or 8 pupils\r\n* a written task\r\n* a short presentation based on a title which we will give you\r\n* a formal interview\r\n","howSchoolPlacementsWork":"You will have two main school placements during the year with opportunities for enhanced placements in a primary school and Green Lane Special School.  Placement 1 will take place from September to December and Placement 2 will take place from January to June.\r\n\r\nOne of your placements will be at Great Sankey High School and the other at one of the secondary schools we work with.\r\n\r\nYou can express a preference about which school you will be placed in but we cannot promise to meet your request. \r\n\r\nThe idea of gradualism will inform the amount of teaching you undertake at different stages of your training. For example, in the first few weeks of your placement it is likely that you will be observing and supporting small groups of students under the guidance of the class teacher. This will develop into teaching parts of the lesson, team teaching and eventually planning and teaching whole lessons under the supervision of your mentor. \r\n\r\nYour mentor will carefully monitor your progress and will meet with you regularly to help you to plan, evaluate and set appropriate targets for your development. \r\n\r\nThis highly supportive and personalised process will enable you to develop the professional knowledge, understanding and skills necessary for the delivery of creative, purposeful and challenging teaching and learning. \r\n\r\nYour teaching will focus mainly on KS3 & KS4, however, you will have the opportunity to enhance your practice by observing and team teaching post-16 students in KS5. \r\n","personalQualities":"We are looking to recruit talented individuals who have the qualities and attributes suited to a career in teaching and the drive and ambition to make it happen. \r\n\r\nThe sorts of personal qualities we are looking for are; \r\n* Excellent interpersonal skills - friendly and approachable \r\n* Organisation and time management skills \r\n* Passion for your subject \r\n* Resilience and a positive outlook \r\n* A creative and innovative approach \r\n* The ability to reflect on and improve practice \r\n* Leadership capabilities and an understanding of the importance of teamwork \r\n","otherRequirements":"You will be required to have a DBS (criminal record check) and Occupational Health Assessment prior to the start of the programme which will be organised by the University.\r\n\r\nIt will be beneficial if you can gain recent school experience prior to starting your course and, ideally, prior to application.   Great Sankey High School participates in the School Experience Programme which gives graduates relevant school experience. More details of this can be found on the school website.\r\n","status":1,"createdAt":"2021-07-06T10:50:14.560Z","updatedAt":"2021-10-05T09:59:36.465Z","canSponsorStudentVisa":"yes","cycle":"2024"}
