{"id":"fc2457e7-ec3f-4e0a-bbdb-bf272919df3d","name":"Primary","code":"25Z2","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"84ecffca-121b-4e7f-929f-95c512e7c2e2","name":"Park Road Community Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"8eaacdcb-a4ee-4845-9b3c-f8c4bd095821","name":"Burtonwood Community Primary School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"c6016000-be48-4c31-bbd1-285e09e318fa","code":"1L2","name":"Omega Teaching Partnership"},"accreditedBody":{"id":"9be9f611-2d36-431a-9109-7fcbbfc88fc8","code":"C99","name":"University of Cumbria"},"profPost":"BO","degreeGrade":"1","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"University of Cumbria will offer equivalency tests in English and Maths.","courseLength":"OneYear","feesUK":9250,"aboutCourse":"On successful completion of this programme you will be awarded a PGCE in General Primary Education with Qualified Teacher Status (QTS) and 60 Masters Level credits by University of Cumbria. \r\n\r\nOur School Direct PGCE programme enables you to spend the vast majority of your year in highly supportive school environments, gaining a broad experience in EYFS, KS1 and KS2. Our alliance consists of primary schools in Warrington as well as a special school and this allows you to have three contrasting placements during the programme. \r\n\r\nIn each placement you will be supported by a trained school mentor to develop your professional knowledge, understanding and the skills necessary to become a teacher.  The opportunity to work alongside colleagues from the start of the programme and immediately form relationships with the children are invaluable experiences which will enable you to become fully immersed in the life of the schools. \r\n\r\nThe placements in school are supported by a rigorous and comprehensive training programme, which are led by expert teachers and Specialist Leaders of Education. The vast majority of these training courses take place in schools in Warrington. The programme also provides an SEN enrichment week based at the Special school. A further 12 days are led by a tutor from University of Cumbria  and focus on pedagogy and curriculum. These days will take place at a local training centre.\r\n\r\nThis course blends theories about learning with the wide range of skills that a teacher needs. We give you opportunities to carry out research into the aspects of teaching that capture your imagination. This helps you develop a reflective and analytical view of your work in the classroom, which sustains the high levels of progress we expect.\r\n\r\nYou learn about the curriculum, from the framework provided by the National Curriculum through to the individual lesson plans that teachers use to support learning in their classrooms. \r\n\r\nWe use a variety of methods and group sizes in our teaching, including subject methodology sessions where practical work is completed, small tutorial groups for discussing issues, mixed-subject research training activities, and other opportunities to share ideas and work with your peers.\r\n\r\nAssessment takes the form of three pieces of written coursework and a portfolio of evidence to demonstrate that you have met the standards for Qualified Teacher Status .","interviewProcess":"Park Road Primary School is the lead school in the primary partnership and will be co-ordinating the recruitment process. We work with University of Cumbria to ensure that the selection and recruitment process is transparent and rigorous. \r\n\r\nSenior colleagues from schools in the partnership will be involved in the selection process. \r\n \r\nYou will need to attend 1 interview. The process is will involve the following activities:\r\n* planning and preparing a 10-15 minute activity for a group of pupils\r\n* a written task\r\n* a short presentation based on a title which we will give you\r\n* a formal interview","howSchoolPlacementsWork":"Omega Teaching Partnership consists of primary schools and a special school who all hold a good or outstanding grading from Ofsted. \r\n\r\nYou will be placed in three contrasting schools over the year, spending a term in each school. All these schools are in Warrington. This will give you the opportunity to build strong relationships with staff and pupils and become fully involved in school life. \r\n\r\nDuring each term, you will spend time both in your host school and in other schools completing the training led by expert teachers and Specialist Leaders of Education.   \r\n\r\nDuring each term, you will have a specific teaching placement. You will complete three placements, each in a different school and these will be completed in two different Key Stages, including Early Years where appropriate. Each teaching placement will allow you to gradually build up your professional knowledge, understanding and skills to become a successful teacher. \r\n\r\nDuring the placement you will be supported by a trained mentor. Your mentor will ensure that you have achievable and relevant targets to progress your skills, knowledge and understanding. Throughout your placement your teaching will be observed by your mentor and you will have weekly review meetings to ensure that you are receiving the right level of support and challenge. \r\n\r\nAt the end of each placement you will receive a summative report, which will provide the basis for your targets in your next placement. Quality assurance systems between the alliance and university will ensure that the quality of mentoring and the judgements made on teaching are consistent for you throughout the programme.","personalQualities":"We are looking to recruit talented individuals who have the qualities and attributes suited to a career in teaching and the drive and ambition to make it happen. \r\n\r\nThe sorts of personal qualities we are looking for are; \r\n\r\n* Excellent interpersonal skills - friendly and approachable \r\n* Organisation and time management skills \r\n* Dedicated to getting the most out of children \r\n* Resilience and a positive outlook \r\n* A creative and innovative approach \r\n* The ability to reflect on and improve practice \r\n* Leadership capabilities and an understanding of the importance of teamwork \r\n","otherRequirements":"We offer school experience through the School Experience Programme and would encourage applicants to spend some time in a mainstream UK Primary school covering Key Stage 1 and Key Stage 2 prior to starting the programme.\r\n\r\nAll candidates must demonstrate professional suitability through interview and must obtain medical and enhanced DBS clearance according to established University of Cumbria procedures.\r\n","status":1,"createdAt":"2021-07-12T13:48:36.468Z","updatedAt":"2021-10-05T07:44:23.864Z","canSponsorStudentVisa":"yes","cycle":"2024"}
