{"id":"da1f8652-e508-4889-8f6c-4a3abb47c0ca","name":"Primary","code":"3CHN","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"96c7f9d0-9208-4994-9e76-f34e1572d615","name":"St Joseph's Specialist Trust","isPublished":"Y","status":"R","vacancies":"F"},{"id":"c5aba382-a5be-4e90-8373-5120b71fac98","name":"Waverley Abbey C of E Junior School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"bfcf890f-c819-411d-88e8-fd38e08ccd84","name":"Badshot Lea Infant School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"19433c9c-031b-4f86-9f5f-23b216581aa1","name":"St Paul's Catholic Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"f4414568-9509-46f7-bf09-ac2e1a86d0a0","name":"St Polycarp's Catholic Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"7cdb804e-8a7e-454c-8a3a-6e7939c6bade","name":"St Peter's C of E Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"d860335b-badf-48df-a850-2d5db5172f9e","name":"Bisley C of E Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"ad2f9daf-cc2e-4c39-8216-4fb461aebfc1","name":"Potters Gate C of E Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"a595267d-2b19-4011-8cb3-7317715a3d91","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"c0cf97e1-5edc-4fba-8e9f-a97f674d5899","code":"2EG","name":"St Polycarp’s Educational Partnership"},"accreditedBody":{"id":"6439adcc-af64-4d3d-a1da-de045755db06","code":"R12","name":"The University of Reading"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"Please contact Reading University for information on equivalency tests available through them.","courseLength":"OneYear","feesUK":9250,"feeDetails":"These are based on the 2021/22 rate.  Fees for 2022 entry will be confirmed as soon as an announcement has been made by the DfE concerning financial support for 2022/23.","financialSupport":"You may be eligible for a student loan.","aboutCourse":"The University of Reading’s Institute of Education is an established provider of high-quality training and research and are ranked 10th in the UK for Education (The Guardian University League Table). \r\n\r\nThe School Direct route at the University of Reading prepares you to teach in Primary or Primary and Early Years. It is embedded within a strong partnership with local schools and provides a personalised approach to trainees from diverse backgrounds and experiences.\r\n\r\nSchool Direct is a one-year full-time route into teaching leading to the award of Qualified Teacher Status (QTS).\r\n\r\nWhat will my training year look like?\r\n\r\n* You will spend most of your time in school, with approximately 30 days based at the University of Reading on our London Road campus.\r\n\r\n* You will be based in one school for most of the year, with a minimum of six weeks in a contrasting school to broaden your training experience.\r\n\r\n* The programme begins in early September, and finishes at the beginning of July the following summer.\r\n\r\n* Over the course of the year the amount of time you spend teaching will increase, from working with small groups then the whole class teaching up to a 40% timetable by the end of the autumn term, moving up to around 60% by Easter and 80% by the end of your training. This ensures that you are completely confident in your teaching skills before entering the teaching profession.\r\n\r\n* Your training will span four year groups. These can include any years from Nursery up to Year 6. You can also be based or undertake a placement within an SEND school.\r\n\r\n* Although there are high expectations of you in terms of planning, assessment, evaluation and written reflection as well as engaging with school-based tasks. As this is a PGCE qualification you will be required to submit written academic work.","interviewProcess":"St Polycarp's Educational Partnership will take the lead in interviewing once we have received your application through Apply. Successful applicants will be invited to interviews held in collaboration between the school and university.\r\n\r\nOn occasion we will interview applicants at the selected location school or over Zoom.\r\n\r\nMore details of the interview will be confirmed in writing at the point of inviting to interview.\r\n\r\nInterviews will be held at St Polycarp's School where there will be an interview and teaching task. ","howSchoolPlacementsWork":"School placements are organised by St Polycarp's Educational Partnership drawing on the talented and nurturing staff within the schools in our alliance. We are proud of our child centered approach to learning and our supportive ethos. From the moment you join this course you become part of our team.\r\n\r\nYou will be placed in a minimum of two schools listed below with the flexibility to ensure your placements reflect your needs and interests e.g. SEND placement. Your supporting mentors will be trained to guide you through this learning journey and work alongside you to enhance your educational understanding and classroom practice.\r\n\r\nThe St Polycarp's Educational Partnership is a group of approx 15  good or outstanding schools based across Surrey and Hampshire, within the Diocese of Brighton and Arundel, who work together collaboratively to push the highest educational standards across the local area.\r\n\r\nOur key partnership schools are:\r\n\r\nSt Joseph's Specialist School and College, Cranleigh, Surrey\r\nRydes Hill Preparatory School, Guildford, Surrey\r\nAll Saints C of E Aided Infant School, Tilford, Surrey\r\nBisley C of E Primary School, Bisley, Surrey \r\nHeatherside Juniors, Fleet, Surrey\r\nPotters Gate C of E Primary School, Farnham, Surrey \r\nPuttenham C of E School, Puttenham, Surrey \r\nRidgeway Primary School, Farnham, Surrey \r\nSt Andrew’s C of E School, Farnham, Surrey\r\nSt Cuthbert Mayne Catholic Primary School, Cranleigh, Surrey \r\nSt James Primary School, Elstead, Surrey  \r\nSt Paul’s Catholic Primary School, Thames Ditton, Surrey \r\nSt Peter’s School, Farnham, Surrey\r\nSt Thomas of Canterbury Catholic Primary School, Guildford, Surrey Waverley Abbey C of E Junior School, Farnham, Surrey\r\nWilliam Cobbett Primary School, Farnham, Surrey","personalQualities":"If you have a genuine desire to enable children to learn and grow in your care then this is the course for you..... If you are committed to developing your professional values and learning from others with humility, compassion and a desire to improve then this is the course for you....... If you value the opportunity to share ideas and challenge assumptions then this is the course for you....... If you will work alongside us with a resolute desire to achieve your best for the children engaging them in their learning then this is the course for you!","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:52:24.975Z","updatedAt":"2021-10-01T17:03:28.281Z","canSponsorStudentVisa":"yes","cycle":"2024"}
