{"id":"fb969767-4427-40b0-9523-a8b4367a58c2","name":"Primary with mathematics","code":"W514","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"286cf12f-b3e3-41c5-9f33-2ff7807d2df0","code":"03","name":"Primary with mathematics"}],"locations":[{"id":"a595267d-2b19-4011-8cb3-7317715a3d91","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"c0cf97e1-5edc-4fba-8e9f-a97f674d5899","code":"2EG","name":"St Polycarp’s Educational Partnership"},"accreditedBody":{"id":"6439adcc-af64-4d3d-a1da-de045755db06","code":"R12","name":"The University of Reading"},"profPost":"PG","degreeGrade":"1","english":"3","maths":"1","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"Please contact Reading University for information on equivalency tests available through them.","courseLength":"OneYear","feesUK":9250,"feesInternational":9250,"feeDetails":"These are based on the 2021/22 rate.  Fees for 2022 entry will be confirmed as soon as an announcement has been made by the DfE concerning financial support for 2022/23.","financialSupport":"You may be eligible for a student loan.","aboutCourse":"Applicants choose this specialist pathway if they are keen to champion mathematics in their future school. It will enable them to follow a particular interest in mathematics, possibly leading to subject leadership and/or specialist teaching of mathematics in their future career.\r\n\r\nFor this School Direct course, St Polycarp's Educational Partnership works in close partnership with the University of Reading. The course offers a high-quality, school-focused and personalised approach to trainees from diverse backgrounds and experiences.\r\n\r\nThis course, W514, is a one-year full-time route into teaching, leading to the award of Qualified Teacher Status (QTS) on successful completion.\r\n\r\nTrainees spend most of their time in school, with approximately 30 days based at the University of Reading on its London Road campus. They are based in one school for most of the year, with a minimum of six weeks in a contrasting school to broaden their training experience.\r\n\r\nThe course begins in early September, and finishes at the beginning of July the following summer.\r\n\r\nInitially, trainees will be observing and working alongside class teachers as they get to know the children and their routines. At a pace tailored to each individual, they will then begin to take on small groups, building up to being responsible for planning, teaching and assessing the children for 80% of their timetable by the end of the year. This ensures that trainees are completely confident in their teaching skills before entering the teaching profession.","interviewProcess":"St Polycarp's Educational Partnership will take the lead in interviewing once we have received your application through Apply. Successful applicants will be invited to interviews held in collaboration between the school and university.\r\n\r\nOn occasion we will interview applicants at the selected location school or over Zoom.\r\nMore details of the interview will be confirmed in writing at the point of inviting to interview.\r\n\r\nInterviews will be held at St Polycarp's School where there will be an interview and teaching task. ","howSchoolPlacementsWork":"School placements are organised by St Polycarp's Educational Partnership drawing on the talented and nurturing staff within the schools in our alliance. We are proud of our child centered approach to learning and our supportive ethos. From the moment you join this course you become part of our team.\r\n\r\nYou will be placed in a minimum of two schools listed below with the flexibility to ensure your placements reflect your needs and interests e.g. SEND placement. Your supporting mentors will be trained to guide you through this learning journey and work alongside you to enhance your educational understanding and classroom practice.\r\n\r\nThe St Polycarp's Educational Partnership is a group of approx 15  good or outstanding schools based across Surrey and Hampshire, within the Diocese of Brighton and Arundel, who work together collaboratively to push the highest educational standards across the local area.\r\n\r\nOur key partnership schools are:\r\n\r\nSt Joseph's Specialist School and College, Cranleigh, Surrey\r\nRydes Hill Preparatory School, Guildford, Surrey\r\nAll Saints C of E Aided Infant School, Tilford, Surrey\r\nBisley C of E Primary School, Bisley, Surrey \r\nHeatherside Juniors, Fleet, Surrey\r\nPotters Gate C of E Primary School, Farnham, Surrey \r\nPuttenham C of E School, Puttenham, Surrey \r\nRidgeway Primary School, Farnham, Surrey \r\nSt Andrew’s C of E School, Farnham, Surrey\r\nSt Cuthbert Mayne Catholic Primary School, Cranleigh, Surrey \r\nSt James Primary School, Elstead, Surrey  \r\nSt Paul’s Catholic Primary School, Thames Ditton, Surrey \r\nSt Peter’s School, Farnham, Surrey\r\nSt Thomas of Canterbury Catholic Primary School, Guildford, Surrey Waverley Abbey C of E Junior School, Farnham, Surrey\r\nWilliam Cobbett Primary School, Farnham, Surrey","personalQualities":"If you have a genuine desire to enable children to learn and grow in your care then this is the course for you..... If you are committed to developing your professional values and learning from others with humility, compassion and a desire to improve then this is the course for you....... If you value the opportunity to share ideas and challenge assumptions then this is the course for you....... If you will work alongside us with a resolute desire to achieve your best for the children engaging them in their learning then this is the course for you!","otherRequirements":"If you accept an offer with us you will also be required to successfully complete Occupational Health and Disclosure Barring Service (DBS) Enhanced Disclosure checks.\r\n\r\nThese checks are required to ensure you meet the Department for Education’s requirements for physical and mental fitness to teach, as well as assessing your suitability for working with children.","status":1,"createdAt":"2021-07-06T10:52:25.278Z","updatedAt":"2021-10-01T17:06:57.931Z","canSponsorStudentVisa":"yes","cycle":"2024"}
