{"id":"3fdd5a40-0031-4ab8-9bd1-9509546a4eba","name":"Primary (Special Educational Needs)","code":"37P2","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"yes","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"9e328646-64cc-4410-8c3f-e023840f0762","name":"The Bridge London - Teaching & Development Centre","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"2235dbff-d1e3-48ea-8843-eda1eb61638d","code":"1W6","name":"The Bridge London TSA"},"accreditedBody":{"id":"049fe65f-08dc-4686-9ac8-606dce490128","code":"G56","name":"Goldsmiths, University of London"},"profPost":"BO","degreeGrade":"1","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feeDetails":"In addition to your tuition fees, you'll be responsible for any additional costs associated with your course, such as buying stationery and paying for photocopying. You can find out more about what you need to budget for the Goldsmith 'study costs' page.\r\n\r\n","financialSupport":"Goldsmiths offer a range of scholarships and bursaries for prospective students. Find out more about funding your studies at:\r\ngold.ac.uk/pgce/primary/","aboutCourse":"Ours is a truly unique offer within the teacher training! We have spent over 12 years finding and selecting the very best partners to assist us in bringing together a programme which blends rigour, creativity and genuine depth of learning.\r\n\r\nWe believe in a model of training that focuses upon developing critical, creative and inclusive teachers. During your time with us we will support you in developing an understanding of what education is today and provide opportunities for you to articulate your own views of what you believe education should be. \r\n\r\nOur teacher education programme aims;\r\n\r\n* To develop in students the knowledge, skills and understanding \r\nnecessary to become a responsible professional who can make \r\npositive and informed contributions to education\r\n\r\n* To engage students in practical and theoretical enquiry as a key \r\nelement in their development as teachers\r\n\r\n* To enable students to reflect on their personal and professional \r\ndevelopment and respond positively to change\r\n\r\n* To provide the experiences necessary to meet the standards for \r\nqualified teacher status. \r\n\r\nThe PGCE (QTS) is both rewarding and demanding. Over the course of the year you will be required to think differently about your own experiences of education and draw upon your own: intelligence; strength; creativity; resilience; dedication and sense of humour. \r\n\r\nYou will be fully supported by our team of tutors and teachers along this journey. We recognise that every student has individual strengths and that you bring with you a wide range of skills and talents. During your time on our programme, we will work with you to enhance these and provide support with the areas in which you feel less secure.\r\n\r\nYou need to be prepared for a heavy workload throughout the programme, not just in term-time but also during school holiday periods and weekends. ","interviewProcess":"","howSchoolPlacementsWork":"At Goldsmiths or at The Bridge London, teaching days start at 9:00 am and finish at 4:00 pm. However, you will also be expected to undertake your own, personal study in addition to this. You will receive a detailed timetable and programme information during induction. \r\n\r\nWhen you are in school, your days will be much longer and will require significant investment of time outside the school day to ensure you are fully prepared. \r\n\r\nOur PGCE programme has been designed to include a minimum of 120 days of School Experience. This is a regulation governing all teacher education programmes and will allow sufficient time for you to demonstrate your growing skills and confidence in at least two age phases and in a minimum of two of our Islington based Primary Partner schools.\r\n\r\nExpectations for school experience are developmental and will take into account prior experience. However, by the end of your training you will expected to take on the responsibility for managing learning in your\r\nclassroom for 80% of the school week to ensure that you are fully prepared for your Induction Year.","personalQualities":"We make our decisions based on your enthusiasm, aptitude and commitment to teaching as demonstrated by your application, qualifications, experience, reference and performance at the interview. This can be demonstrated in a number of different ways:\r\n\r\n* experience of activities with young people outside school.\r\n\r\n* evidence of continued interest in your subject.\r\n\r\n* evidence of the ability to interact and communicate successfully \r\nwith a range of people.\r\n\r\n* evidence of the ability to organise and manage your time effectively.","otherRequirements":"Applications are mainly handled by The Bridge London who are much more involved in your selection and recruitment than the usual university route. Goldsmiths will review academic criteria and monitor the full recruitment process.\r\n\r\nThe interview process is also different - you will be interviewed by The Bridge London, broadly following the Goldsmiths experience and the final decision following your interview will be made jointly between the University and the Teaching School.  ","status":1,"createdAt":"2021-07-06T10:51:17.028Z","updatedAt":"2021-10-04T13:15:52.569Z","canSponsorStudentVisa":"yes","cycle":"2024"}
