{"id":"5f1297c9-e4eb-4f6c-9c4a-172b0102ccf5","name":"Primary (SEND)","code":"2MXM","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"yes","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"fcdaba69-28b5-4cf7-a6f0-675cf2218308","name":"Leycroft Academy","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"185b0977-4aa4-4082-b385-27b30af11dbb","code":"1MR","name":"Brays ITT"},"accreditedBody":{"id":"4da5abb2-b287-451e-8d75-c5b79e11c2bb","code":"W75","name":"University of Wolverhampton"},"profPost":"BO","degreeGrade":"1","english":"2","maths":"2","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"Please note University of Wolverhampton only accept our their equivalency test and they offer this for English/Maths/Science.\n\nContact: equivalency@wlv.ac.uk","courseLength":"OneYear","feesUK":9250,"aboutCourse":"The programme qualifies you to teach in all SEND settings and phases as well as mainstream primary schools.\r\n\r\nIt will comprise 120 days in schools made up of a special school placement and a mainstream primary placement. It also includes a non-assessed additional voluntary placement at home or abroad and further immersion days in settings to broaden your SEND experience.\r\n\r\nThere are also 65 days of training that are typically based at the Walsall Campus of Wolverhampton University where you will join other student teachers with 5 days of specialised training in SEND pedagogy.\r\n                              \r\n","interviewProcess":"The Application  and Interview Process  \r\n    \r\nApply for a place on the Schools Direct Course for September 2021 via the Teacher Training tab on ucas.com We will contact you and you may be called to meet us for a half day that will include an interview, a short observation and an audit of your English and mathematics skills.\r\n\r\nOnly the interview and observation are used to assess your readiness to join the programme. \r\n\r\n\r\n","howSchoolPlacementsWork":"\r\nThere will be one 10 week mainstream placement from October to December which is split into a Key Stage 1 and then a Key Stage 2 placement, each for 5 weeks and ideally within the same school. During this, teaching time is built up to teaching 50% of the time. \r\nThe second placement will be 12 weeks in a special school and will be in either Key Stage 1 or 2. Teaching time should be up to 80% by the end of that placement which runs from April to June. \r\nThere are additional non-assessed placements of one week in each in Nursery and Secondary schools and two weeks ‘enhancement’ placement which can be abroad with the University or in another different setting in the UK. \r\n","personalQualities":"","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:55:21.369Z","updatedAt":"2021-09-16T12:41:07.161Z","canSponsorStudentVisa":"yes","cycle":"2024"}
