{"id":"74da9142-b95e-4453-8029-94b7e6f4c9d5","name":"Computing","code":"E933","qualification":"qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"B","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"e6be6a9c-8696-4b88-8fbd-1ba1bef1b6fc","code":"11","name":"Computing"}],"trainingProvider":{"id":"185b0977-4aa4-4082-b385-27b30af11dbb","code":"1MR","name":"Brays ITT"},"accreditedBody":{"id":"4da5abb2-b287-451e-8d75-c5b79e11c2bb","code":"W75","name":"University of Wolverhampton"},"english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","aboutCourse":"The programme qualifies you to teach in all SEND settings and phases as well as mainstream secondary schools.\r\nIt will comprise of a minimum 120 days in schools made up of a special school placement and a mainstream secondary placement. \r\nThere are 20 days of training that are typically based at the Walsall Campus of Wolverhampton University where you will join other student teachers in the specialist subject and across the phase.\r\nThe course outcomes include the award of Qualified Teacher Status and 20 Masters level credits, which may be used to continue with Masters level study.\r\n","interviewProcess":"The Application and Interview Process\r\nApply for a place on the course for September 2021 via the Teacher Training tab on ucas.com. We will contact you and you may be called to meet us for a half day that will include an interview, a short observation and an audit of your professional knowledge and skills.\r\nOnly the interview and observation are used to assess your readiness to join the programme.\r\n","howSchoolPlacementsWork":"Placements will take place within Secondary schools, based predominantly in a SEND school and a minimum 12 week training experience in a mainstream school. Additional Primary experience and enhancement opportunities are included in the course.","personalQualities":"","otherRequirements":"","status":2,"createdAt":"2021-07-06T10:55:21.424Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"Salary for the post is on the unqualified pay scale or above"}
