{"id":"f3db5cc2-b7f0-4c6e-a415-b7f7f5e335aa","name":"Chemistry","code":"2M9R","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"912d4fb4-761b-42e9-8dc6-e968b791ea4e","code":"F1","name":"Chemistry"}],"locations":[{"id":"0630deeb-551c-4986-b34c-3719b6453816","name":"Mid Essex","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"5906a7eb-a322-46d3-aba3-70d8615dad9b","code":"1JW","name":"Professional Learning Network (Lyons Hall)"},"accreditedBody":{"id":"136170e8-4cb3-45f3-bc2d-3f028bccb3c8","code":"M82","name":"Mid Essex Initial Teacher Training"},"profPost":"BO","degreeGrade":"1","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"If you do not hold a GCSE in English, maths or science at grade 4 (C) or above or equivalent you can apply to take an equivalency test. We accept equivalency tests from:\n\nA* Star Teachers www.astarteachers.co.uk\n\nEquivalency Testing www.equivalencytesting.co.uk","courseLength":"OneYear","feesUK":9250,"feesInternational":9250,"aboutCourse":"Our training model allows four days per week in schools and a weekly training day each Thursday. This training day is split between General Professional Studies (GPS) in the morning at the Braintree Arts Theatre and Subject Professional Studies (SPS) in the afternoon at one of our partnership schools. This ongoing training model allows you to explore something in theory and then try it out in practice the very next day.\r\n\r\nYou will have a main placement school which allows you to settle in fully into your department and become part of the teaching team. Pupils see you as their teacher and you gain a real insight into life in a school. A shorter, second placement in a different school (in February/March) then allows you to try ideas out and see another way of working. You will also have the opportunity to visit a primary school, a school for children with special educational needs and a school in challenging circumstances.\r\n\r\nTrainees undertaking the ProfGCE will attend further training in the form of six Academic Days which will give you guidance on academic research and writing. You will also be able to access the online library of the University of Greenwich.","interviewProcess":"Mid Essex ITT will co-ordinate the recruitment process and it will involve a full day spent at their central offices at Notley High School and Braintree Sixth Form. It will include a critique of a lesson, a short written test for literacy and participation in a group discussion. You will be expected to do a short presentation in front of a small group of Year 8 students and will be interviewed by staff from Mid Essex ITT and our partner schools. Not only is the day an excellent opportunity for you to show us your passion and relevant skills, it is a chance for you to meet the Mid Essex team and find out more about our course.","howSchoolPlacementsWork":"Mid Essex ITT works with over 20 schools across Essex, many of which have been working with them for almost 25 years. You will have the opportunity to work at two of these schools.\r\n\r\nWe aim to place you in a school which best suits your requirements. At your interview and assessment day, you will be asked to complete a form detailing which of our schools you would like to be placed at and we will try our best to place you at one of your choices. Early applicants will find it easier to be placed at one of their top choices so we do recommend applying as early as possible if you are interested in training in certain schools.\r\n\r\nOur schools offer a range of experiences covering 11-16 or 11-18 with mixed and single gender teaching across the partnership.","personalQualities":"\r\n* Commitment, enthusiasm, passion, resilience – this is a tough course\r\n\r\n* Suitable and relevant qualifications to meet the eligibility criteria\r\n\r\n* Good subject knowledge (probably with a few gaps)\r\n\r\n* Relevant experience: how do you know this is for you?\r\n\r\n* Good standards of written and oral English\r\n","otherRequirements":"Mid Essex ITT is committed to safer recruitment. All applicants will be subject to to a Disclosure and Barring Service (DBS) criminal records check, including a check of the children's barred list and Employer Access Online.","status":1,"createdAt":"2021-07-12T13:48:23.059Z","updatedAt":"2021-09-30T13:36:54.270Z","canSponsorStudentVisa":"no","cycle":"2024"}
