{"id":"bb3818aa-15f3-4084-9b33-f0e611cb32d4","name":"Primary","code":"2HBH","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"c5734655-f9c9-464e-a980-22f2cdbf7bda","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"06a23706-f5f5-4a05-96cf-569c27f24613","code":"1XT","name":"Esk Valley Alliance"},"accreditedBody":{"id":"b011427a-6dff-4a77-9df3-c85a54be605a","code":"Y75","name":"York St John University"},"degreeGrade":"1","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"financialSupport":"The tuition fees for the Esk Valley Alliance School Direct programme are £9,250.\r\n\r\nYou may be eligible for a tax free bursary or scholarship to support your training.  For further details regarding bursaries and scholarships please see the following NCTL link:\r\nhttp://www.education.gov.uk/get-into-teaching/funding/postgraduate-funding.aspx\r\nFurther advice can also be provided by York St John University Funding Advice Team, please use the following e-mail: fundingadvice@yorksj.ac.uk.\r\n\r\nHome and EU students may be eligible for a tuition fee loan to cover the cost of tuition fees charged.  Please contact Student Finance to apply: https://www.gov.uk/student-finance/overview.\r\n\r\n","aboutCourse":"Our course is school based, with academic training days provided by York St John University. Your training is split into 3 sections; days provided by the university, time within school and training provided by the Alliance.\r\n\r\nThe academic training days with the university total approximately 20 across the year.  You will be attending the University Campus in the centre of York with full access to the university facilities and support.The university is responsible for all academic papers, assignments, essays and research projects including marking and feedback.  York St John is also the accrediting body.\r\n\r\nTime within school is split between two placements ensuring that you have a range of experiences across age ranges and school types.  This helps equip you with the essential skills necessary for starting life as a teacher.\r\n\r\nThe Esk Valley Alliance provides approximately 40 face to face sessions during the year with our experienced teacher trainers, serving headteachers and Specialists Leaders of Education.  These sessions are solely for our ITT students. You will cover all Primary National Curriculum Subject Areas as well as Special Educational Needs and Disabilities, Early Years Foundation Stage, Safeguarding and Child Protection, Assessment and Data Tracking and English as an Additional Language. All of our training takes place in primary schools that are part of the Esk Valley Alliance giving you the additional opportunity to see a variety of educational practice in our vibrant schools.\r\n\r\nBeing part of the Esk Valley Alliance also entitles you to access any and all training courses and opportunities that are available to our serving teachers as part of their Continuing Professional Development; once again allowing you to visit functioning schools and meet other professionals.\r\n","interviewProcess":"The Esk Valley Alliance runs a robust interview process aligned with York St John University.\r\n\r\nYou will be invited to a one day interview on the recommendation of the Admissions Team from York St John University.  The Admissions team will have checked that you have met the statutory requirements for entering Initial Teacher Training including your qualifications.\r\n\r\nThese interviews will take place in one of the Esk Valley Schools and will be conducted by members of the ITT team and a colleague from the university.\r\n\r\nThe format  of the day includes: a small group teaching task of your choice with 6 children, followed by a short written reflection task; a piece of academic research on which you will be asked to give a five minute presentation; a chance to work alongside a classteacher and a formal interview.\r\n\r\nFollowing the interview the Alliance will make a recommendation to the Admissions team at York St John University and you will be able to track our decision on the UCAS website.","howSchoolPlacementsWork":"Your teaching experience with the Esk Valley Alliance will take place in two main schools. The first school will be known as your 'Home School'.  This is the school that you will spend the majority of your training with in the first and final term.  The second school placement is in the Spring term and will offer a different experience to your home school within your chosen route.  \r\n\r\nYour home school will be allocated to you based on your chosen route and proximity to your home address.  We endeavour to keep your travelling within a reasonable distance and time to support your work-life balance.  Whilst at this school you will have a six week assessed placement in term 1 and an 8 week assessed placement in term 3.  All remaining time, when not attending a university day or an Esk Valley training session, will be spent within this school learning from your classteacher, mentor and other professional colleagues.\r\n\r\nIn term 2 you will be placed in a contrasting primary school within your chosen route for an eight week placement, six of which will be assessed. The first two weeks are to allow you to understand the context and plan your assessed placement.  Following that all remaining time, when not attending a university day or an Esk Valley training session, will be spent within this school learning from your classteacher, mentor and other professional colleagues.\r\n\r\nPlacements schools will be chosen from anyone of our 40 plus partnership schools within the Alliance.  Our alliance covers a large geographical range from Whitby to Scarborough and Ryedale to the Moors offering you a varied experience.","personalQualities":"We are looking for enthusiastic and dedicated learners who will inspire our children for the future.\r\n\r\nYou will need to be motivated, committed, organised, creative and above all have a good sense of fun and humour!\r\n\r\nExperience with children is essential and this can be arranged through the Alliance once you have shown commitment to our training programme.","otherRequirements":"Your role will be subject to:\r\n\r\nMedical Fitness\r\n\r\nDeclaration of Criminal Convictions\r\n\r\nDisclosure and Barring Service check\r\n","status":1,"createdAt":"2021-07-06T10:54:07.814Z","updatedAt":"2021-10-08T13:38:52.520Z","canSponsorStudentVisa":"yes","cycle":"2024"}
