{"id":"6d59a0a9-85d9-4006-bbb2-77324540a001","name":"Primary","code":"3FP5","qualification":"qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"TA","fundingType":"apprenticeship","studyMode":"F","ageRange":"4_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"bc0bd7c2-0541-44f9-899e-15456020ef10","name":"Alexandra Infants' School","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"fe872367-c0b4-4746-94a8-8000edf1c198","code":"155","name":"The Golden Thread Teaching School Hub"},"accreditedBody":{"id":"aa023df3-b71e-4249-b9c4-41fca8bd135e","code":"D39","name":"University of Derby"},"english":"1","maths":"1","science":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"4 terms","feesUK":null,"aboutCourse":"This programme aims to 'develop exceptional teachers who are effective, caring, critical and creative'. \r\nThe Level 6 Teacher Apprenticeship Scheme at the university has been designed to be both academic and vocational. It provides challenging expectations of you as a teacher apprentice to create a high quality teaching and learning environment which will engage your interest and motivation. The broad aims of the main curriculum component of the programme are to: \r\n\r\n- develop your subject knowledge with a subject specialist mentor and teach you how to put that knowledge into practice (pedagogy) in order to thrive in the culture of our schools; \r\n- enable you to become a highly motivated, outstanding effective, creative and reflective practitioner; \r\n- prepare you for a career in teaching that will prove to be successful and rewarding; \r\n- develop in you a commitment to and enthusiasm for continuing professional and personal development; \r\n- provide you with sufficient information, experience and opportunity in order that you might achieve the National Teacher Standards to enable you to be recommended for QTS. \r\n","interviewProcess":"As a Lead School we will work together with the University of Derby in order to shortlist suitable candidates. If your application is shortlisted, you will be invited to attend an interview. In addition to a formal interview, you will be asked to undertake an observed short teaching task working with pupils and you will sit mock literacy and numeracy tests. The interview will take place at the school advertising the Level 6 Teacher Apprenticeship and will be conducted by the Teaching School. \r\n\r\nPersonal Statement \r\nUse your personal statement to tell us why you are committed to become a teacher. You should also tell us about your experience within schools and what insights you have gained into high quality teaching and learning. You should refer to any reading you have undertaken to prepare for a career in teaching indicating what you have learnt from this. If you already have links with a supporting school, please include this within your statement. \r\n","howSchoolPlacementsWork":"The Level 6 Teacher Apprenticeship Scheme will consist of a combination of classroom practice and relevant in-school training. You will be teaching over four days in a high quality school from across our consortium. You will also be offered a programme of training developed and delivered by consortium schools and our HEI partners.  In school, you will be supported by a dedicated and trained subject mentor, as well as a professional tutor, who are school-based experienced staff.   In addition, you will also have University based professional and subject tutors.  \r\nThe apprenticeship starts in September 2021 and will last for 4 terms. Training through our consortium will also provide you with opportunities to develop your educational and professional studies through school-based sessions that include:\r\n\r\n - Use of data and reporting; Liaison with parents\r\n - Behaviour – sanction and reward\r\n - G&T (more able)  and PP students\r\n - SEN / EAL, including the new SEN Code of Practice\r\n - Pastoral care \r\n - Differentiation\r\n - Assessment for Learning and Success Criteria\r\n - Pedagogy – planning and assessment\r\n - Access to our interactive NQT programme\r\n- Metacognition and EEF research on achievement including disadvantaged students\r\n\r\n\r\nYou will be in one school for the majority of the apprenticeship scheme with a second secondary 6 week placement during the programme. In addition, as part of your continual professional development, you will spend days in primary and SEND schools. \r\n\r\nWe currently work with over 16 partner secondary and primary schools.\r\n","personalQualities":"We are looking to recruit talented, hardworking candidates who have the qualities and personal skills suited to a career in teaching alongside the drive and ambition to make it happen. \r\nQualities we are looking for include: \r\n\r\n* A friendly and approachable manner \r\n* Excellent oral and written communication \r\n* Excellent interpersonal skills \r\n* Excellent organization and time management \r\n* Excellent subject knowledge \r\n* A passion for your subject, drive and enthusiasm \r\n* Creativity \r\n* Imagination and the ability to be innovative \r\n* Evaluative nature being able to reflect on your performance \r\n* Leadership \r\n* A commitment to learning","otherRequirements":"Trainees completing an Apprenticeship or Initial Teacher Training Programme must demonstrate the required competencies in the Fundamentals and English and Maths outlined by the Department for Education before Qualified Teacher Status is awarded. \r\nTo ensure trainees meet the required competencies you will be required to show evidence throughout the course. Please note, it is the trainee’s responsibility to secure these fundamental skills.\r\n","status":2,"createdAt":"2021-07-06T10:52:41.787Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024"}
