{"id":"e854469b-aca4-4c3d-b0bd-4ab65531bf72","name":"Modern Foreign Languages","code":"3FMW","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"ce8523ef-9236-4cd9-b260-d826c7a521b3","code":"ML","name":"Modern Languages"},{"id":"4608e5e3-2a1a-48a1-8236-56c7af5a139d","code":"24","name":"Modern languages (other)"}],"locations":[{"id":"e7672592-da07-49e7-aaca-c19c15029104","name":"The Discovery Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"af531074-cad7-4639-b466-84fb34809bc3","name":"St John Fisher Catholic College","isPublished":"N","status":"S","vacancies":"F"},{"id":"940844e3-2b46-40d6-9a04-31340b3d1d52","name":"St Margaret Ward Catholic Academy","isPublished":"Y","status":"R","vacancies":"F"},{"id":"d16de022-649b-45d9-a315-2be5301064c5","name":"Trentham High School","isPublished":"N","status":"S","vacancies":"F"},{"id":"6def9ca2-7035-4386-a75a-fcaf7b2feec9","name":"St Thomas More Catholic College","isPublished":"N","status":"S","vacancies":"F"},{"id":"fc5e90d3-3ed9-45c7-9930-3ed5cdbd1321","name":"Chesterton Community Sports College","isPublished":"Y","status":"R","vacancies":"F"},{"id":"307fee3f-87bd-4d61-baa1-e0965c8fd637","name":"Moorside High School","isPublished":"N","status":"S","vacancies":"F"},{"id":"64d427bc-fdd4-4487-9e09-7bf4588425b4","name":"Denstone College","isPublished":"N","status":"S","vacancies":"F"},{"id":"28dfaf9f-361a-4e9e-8161-1e16a15f2d1b","name":"Painsley Catholic College","isPublished":"N","status":"S","vacancies":"F"},{"id":"97d284de-a92a-49bc-817e-8a9b15b6a67f","name":"Biddulph High School","isPublished":"N","status":"S","vacancies":"F"}],"trainingProvider":{"id":"fe872367-c0b4-4746-94a8-8000edf1c198","code":"155","name":"The Golden Thread Teaching School Hub"},"accreditedBody":{"id":"aa023df3-b71e-4249-b9c4-41fca8bd135e","code":"D39","name":"University of Derby"},"profPost":"PG","degreeGrade":"2","english":"3","maths":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"aboutCourse":"This programme aims to 'develop exceptional teachers who are effective, caring, critical and creative'. \r\nThe Secondary Initial Teacher Education Programme (School Direct) at the university has been designed to be both academic and vocational and provides challenging expectations of you as a student teacher to create a teaching and learning environment which will engage your interest and motivation. The broad aims of the main curriculum component of the programme are to: \r\n\r\n- develop your subject knowledge and teach you how to put that knowledge into practice (pedagogy) in order to thrive in the culture of our schools; \r\n- enable you to become a highly motivated, outstanding effective, creative and reflective practitioner; \r\n- prepare you for a career in teaching that will prove to be successful and rewarding; \r\n- develop in you a commitment to and enthusiasm for continuing professional and personal development; \r\n- provide you with sufficient information, experience and opportunity in order that you might achieve the National Teacher Standards to enable you to be recommended for QTS and gain your PGCE with 60 masters credits.\r\n","interviewProcess":"As a Lead School we will work together with our universities in order to shortlist suitable candidates. If your application is shortlisted, you will be invited to attend an interview. In addition to a formal interview, you will be asked to undertake an observed task working with pupils. If Covid restrictions are in place, you will have a virtual interview with classroom-based scenarios to discuss relating to teaching and learning, behaviour and other elements of education.  Literacy and numeracy skills will be assessed through the university and TSH in line with the DfE’s requirements. \r\n\r\nPersonal Statement \r\nUse your personal statement to tell us why you wish to become a teacher. You should also tell us about your experience within schools and what insights you have gained into high quality teaching and learning. You should refer to any reading you have undertaken to prepare for a career in teaching indicating what you have learnt from this. If you already have links with a supporting school, please include this within your statement. \r\n","howSchoolPlacementsWork":"Your School Direct Programme will consist of a combination of classroom practice and relevant in-school training. You will be given the opportunity to spend the majority of your time on ‘teaching practice’ at high quality school placements from across our consortium. You will also be offered a programme of training developed and delivered by consortium schools and our HEI partners. In school, you will be supported by a dedicated and trained mentor, as well as a professional tutor, who are school-based experienced staff.  You will also have University based tutors.  \r\nYour training lasts for one academic year (September-July).\r\nTraining through our consortium will also provide you with opportunities to develop your educational and professional studies through school-based sessions that include:\r\n\r\n - Use of data and reporting; Liaison with parents\r\n - Behaviour – sanction and reward\r\n - G&T (more able)  and PP students\r\n - SEN / EAL, including the new SEN Code of Practice\r\n - Pastoral care \r\n - Differentiation\r\n - Assessment for Learning and Success Criteria\r\n - Pedagogy – planning and assessment\r\n\r\nYour main placement will run from September to December.  You will attend your second placement school from January until February half term and will then return to your main placement for the remainder of the programme.  \r\n\r\nWe currently work with over 16 partner secondary and primary schools.\r\n","personalQualities":"We are looking to recruit talented, hardworking candidates who have the qualities and personal skills suited to a career in teaching alongside the drive and ambition to make it happen. \r\nQualities we are looking for include: \r\n\r\n* A friendly and approachable manner \r\n* Excellent oral and written communication \r\n* Excellent interpersonal skills \r\n* Excellent organization and time management \r\n* Excellent subject knowledge \r\n* A passion for your subject, drive and enthusiasm \r\n* Creativity \r\n* Imagination and the ability to be innovative \r\n* Evaluative nature being able to reflect on your performance \r\n* Leadership \r\n* A commitment to learning\r\n","otherRequirements":"Trainees completing an Initial Teacher Training Programme must demonstrate the required competencies in the Fundamentals and English and Maths outlined by the Department for Education before Qualified Teacher Status is awarded. \r\nTo ensure trainees meet the required competencies you will be required to undertake and pass the University’s agreed assessment which will take place when you commence your course. Full details of the required competencies and assessment will be provided in due course.   Please note, it is the trainee’s responsibility to secure these fundamental skills.\r\n","status":1,"createdAt":"2021-07-06T10:52:41.748Z","updatedAt":"2021-10-04T10:13:22.211Z","canSponsorStudentVisa":"yes","cycle":"2024"}
