{"id":"51b10011-561d-4a38-ae49-9a50418f0623","name":"Physical Education","code":"26FZ","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"74d64a54-5e34-4590-b6c7-528dd0cf26fe","code":"C6","name":"Physical education"}],"locations":[{"id":"2269868c-0429-4c28-a2be-96071e6e2093","name":"Main Site","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"294d0e65-0b96-46d1-a8eb-f27c9a96d9d2","code":"1JS","name":"Teach Cheshire"},"accreditedBody":{"id":"e843cb68-d310-478c-8dba-cf9633fea086","code":"C55","name":"University of Chester"},"profPost":"PG","degreeGrade":"0","english":"2","maths":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"The [Teach Cheshire](http://www.teachcheshire.org.uk/) partnership led by The Fallibroome Academy, All Hallows Catholic College and Poynton High School. It has a hub centred around Macclesfield and Poynton, mainly in 11-18 schools, and a second hub in Winsford. We have high academic standards and are passionate about enabling our students to be creative, resilient and independent learners. \r\n\r\nOur team of experienced and enthusiastic mentors will help you become a confident teacher so that you can make a difference to the lives of young people. Through our partnership with our university colleagues, we aim to create a varied development programme that helps you learn about effective teaching and learning, behaviour and assessment strategies.  \r\n\r\nDuring the course, you can expect:\r\n\r\n* Weekly meetings with a well-qualified specialist subject mentor to help with lesson planning and delivery\r\n* Fortnightly meetings with a professional mentor to ensure you develop a wider awareness of the role of the teacher, for example by supporting a form or engaging in extra-curricular activities\r\n* A study of current, challenging educational issues\r\n* A thorough programme of ongoing professional development and careers advice\r\n* Opportunities for reflective practice and research.\r\n\r\nMost of the year is spent on placement in your home school with a 6-7 week placement in a different school in the Spring. \r\n  \r\nWhilst on placement your school will offer a full programme of CPD tailored to your needs. In addition, there are a number of joint development days, each held in a different Teach Cheshire school giving you the chance to meet all the trainees on the programme and experience a number of different contexts. \r\n\r\nYou have about 35 university study days which tend to blocked in September and January, along with most Fridays through the year.  University tutorials are held at the Riverside Campus in Chester or at Wade Deacon High School in Widnes.\r\n \r\nYou are assessed against the Teacher Standards through regular lesson observations and the development of a portfolio of evidence. You submit a written assignment to the university each term, reflecting on teaching and learning pedagogy and its application in the classroom. \r\n","interviewProcess":"Interviews are held at regular intervals throughout the year. Whenever possible, they will take place face to face in a Teach Cheshire school.\r\nThey last half a day and include:\r\n\r\n* The opportunity to talk to staff and students\r\n* A tour of the school\r\n* A short teaching task (you will be told in advance about the content of the lesson, the age group and size of class you will be teaching)\r\n* Short written tasks for literacy, numeracy and subject knowledge\r\n* A formal interview with senior staff and subject specialists\r\n* Identity and qualification checks (please bring photographic ID, proof of address and copies of your academic qualifications)\r\n\r\nPlease note that you do not need to have completed school experience before the interview.\r\n\r\nIf restrictions are in place for health reasons, interviews will be held online and will include:\r\n* preparation of a lesson in advance with an explanation of how you would deliver it and why you have approached the topic in this manner.\r\n* a subject knowledge self-assessment\r\n* A formal interview with senior staff and subject specialists  \r\n\r\n\r\nPlease note that you do not need to have completed school experience before the interview\r\n\r\n","howSchoolPlacementsWork":"You will spend 120 days doing teaching practice in two different schools. The majority of the time is in your home school. We follow the pattern of home school in the Autumn Term, a 6 to 7 week placement in a different school in the Spring Term and back to your home school for the Summer Term. \r\n\r\nHome schools are close to our hubs in the Macclesfield and Poynton  or Winsford area and the schools we normally use for second placements are in Stockport, South Manchester or the Winsford area. We work hard to ensure travelling times are reasonable. \r\n\r\nYou will start by observing how experienced staff manage lesson delivery and then you will start to teach parts of the lesson, supported by the normal class teacher.  \r\n\r\nYour teaching load increases gradually over the year. In the first term, you will build up to teaching a 40% timetable. This increases to around 60% in your second placement and to around 70% by the summer term.  \r\n\r\nAs well as teaching subject lessons, you will work with a form group and have the opportunity to engage in extra-curricular activities. This ensures you are fully integrated into school life. You will be supported throughout by your subject mentor and professional mentor.\r\n","personalQualities":"We are looking for:\r\n\r\n* enthusiasm for working with children and a determination to make a difference to the lives of young people of all abilities\r\n* some experience working or volunteering with young people\r\n* passion for your subject \r\n* awareness of current educational issues\r\n* personal awareness of your role as teacher in relation to teaching and learning\r\n* your capacity to engage in an intensive period of training\r\n* good communication skills\r\n* the capacity to reflect on your experience\r\n\r\nWe encourage prospective applicants to attend one of our regular visitor days.\r\n","otherRequirements":"When we make an offer, it is typical for there to be a number of conditions.  For example:\r\n\r\n* An enhanced check through the Disclosure and Barring Service as advised by the Department for Education. \r\n* A health screening questionnaire\r\n\r\n\r\nIn some circumstances:\r\n\r\n* Successful completion of a Subject Knowledge Enhancement course. \r\n\r\nThese courses are available for certain subjects and give a good grounding in the curriculum knowledge required to teach. Suitable candidates may be eligible for a bursary.\r\n","status":1,"createdAt":"2021-07-06T10:52:58.913Z","updatedAt":"2021-07-22T09:07:10.101Z","canSponsorStudentVisa":"yes","cycle":"2024"}
