{"id":"cf11617c-584c-4c51-be96-6db683dba7fc","name":"Primary","code":"26G5","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"d961e849-59f2-4555-af8b-4345e4f718ca","name":"Broken Cross Primary Academy","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"294d0e65-0b96-46d1-a8eb-f27c9a96d9d2","code":"1JS","name":"Teach Cheshire"},"accreditedBody":{"id":"9d03acb4-95ce-41e1-8458-0b4bec147b6b","code":"M20","name":"The University of Manchester"},"profPost":"BO","degreeGrade":"0","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Within the primary section of the [Teach Cheshire](http://www.teachcheshire.org.uk/) programme we have a contrasting family of schools in our learning community, each unique and wonderful in its own way, ranging from half form entry rural schools to two form entry urban schools.  As a result of this we are able to offer\r\nvaried, contrasting and bespoke teaching placements. Although each school is different, we share a common purpose, which is creating inclusive environments where all of our children can thrive\r\nacademically and socially. \r\n\r\n You will spend time in two different partnership schools, usually\r\nbeginning in one in the Autumn term, attending a contrasting placement in the Spring before returning to your ‘home’ school to complete your training with us. \r\n\r\nAt Teach Cheshire we are proud to be supporting the development of the next generation of teachers and aspiring, leaders.   You will be joining an established community of teaching professionals, who are committed to using research and evidence-based practice to support the\r\ninitial training of our student teachers. \r\n\r\nA group of skilled, passionate mentors will be with you every step of the way, ensuring that you become the very best teacher you can be, preparing you for taking on your first class as an NQT and instilling in you a desire to continually reflect and improve your practice throughout your career.   \r\n\r\nWorking in collaboration with the university, we share the delivery of the training programme. Curriculum sessions, offered by us will be led by experienced subject leads, who are all practising teachers, many of whom are Specialist Leaders in Education for their subject area or specialism. \r\nTheir guidance and expertise will support you to successfully apply new learning to a classroom context.\r\n\r\nThe school-based programme is led by a successful, serving Headteacher.\r\n","interviewProcess":"Interviews are held at regular intervals throughout the year. Whenever possible, they will take place face to face in a Teach Cheshire school.\r\nThey last half a day and include:\r\n\r\n* The opportunity to talk to staff and students\r\n* A tour of the school\r\n* A short teaching task (you will be told in advance about the content of the lesson, the age group and size of class you will be teaching)\r\n* Short written tasks for literacy, numeracy and subject knowledge\r\n* A formal interview with senior staff and subject specialists\r\n* Identity and qualification checks (please bring photographic ID, proof of address and copies of your academic qualifications)\r\n\r\nPlease note that you do not need to have completed school experience before the interview.\r\n\r\nIf restrictions are in place for health reasons, interviews will be held online and will include:\r\n* preparation of a lesson in advance with an explanation of how you would deliver it and why you have approached the topic in this manner.\r\n* a subject knowledge self-assessment\r\n* A formal interview with senior staff and subject specialists  \r\n\r\n\r\nPlease note that you do not need to have completed school experience before the interview\r\n\r\n","howSchoolPlacementsWork":"During your placement you will receive training in how to teach all National Curriculum subjects, with a focus on Mathematics, English and Science. You train in two different schools and will gain experience in both KS1 and KS2. You will have the opportunity throughout the course to develop your subject knowledge.\r\n\r\nYou spend time in university and time in schools: \r\n\r\n•\teight weeks in the autumn term in either Key Stage 1 or Key Stage 2;\r\n\r\n•\televen weeks in the summer term in either Key Stage 1 or Key Stage 2;\r\n\r\n•\ttwo-week enquiry placement in either key stage;\r\n\r\n•\ttwo-week placement in the Early Years Foundation Stage (EYFS);\r\n\r\n•\tone-week placement in Key Stage 3.\r\n\r\nWhen on placement, you will observe and teach classes under the guidance of an experienced primary teacher. You will also have a mentor to help you to plan lessons, deal with marking and assessment, and improve your teaching skills.\r\n\r\nThe Teach Cheshire primary hub is made up of a family of 6 primary schools:\r\n•\tAdlington Primary School \r\n\r\n•\tBroken Cross Primary Academy and Nursery\r\n\r\n•\tGawsworth Primary School \r\n\r\n•\tMarlborough Primary School\r\n\r\n•\tNether Alderley Primary School\r\n\r\n•\tUpton Priory School\r\n\r\nThese schools are further bolstered by an additional 3 schools from the Fallibroome Learning Community.   All pupils, across the range of schools, are supported and encouraged to be the very best they can be in both their learning and their wider life skills.  The collection of schools reflects the diverse communities they serve, from rural to urban, from below average free school meals to more than 6 times the national average for Special Educational Needs.   Each school provides a safe, inclusive, environment for its pupils where high expectations and collaboration are the norm.\r\n","personalQualities":"We are looking for:\r\n\r\n* enthusiasm for working with children and a determination to make a difference to the lives of young people of all abilities\r\n* passion for your subject \r\n* awareness of current educational issues\r\n* personal awareness of your role as teacher in relation to teaching and learning\r\n* your capacity to engage in an intensive period of training\r\n* good communication skills\r\n* the capacity to reflect on your experience\r\n\r\nWe encourage prospective applicants to attend one of our regular visitor days subject to Covid restrictions.\r\n","otherRequirements":"\r\nWhen we make an offer, it is typical for there to be a number of conditions.  For example:\r\n\r\n* An enhanced check through the Disclosure and Barring Service as advised by the Department for Education. \r\n* A health screening questionnaire\r\n","status":1,"createdAt":"2021-07-06T10:52:58.949Z","updatedAt":"2021-09-09T11:19:26.752Z","canSponsorStudentVisa":"yes","cycle":"2024"}
