{"id":"823522f6-48f0-4238-b06c-0941e297982c","name":"Design and technology","code":"X758","qualification":"qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"118fabd7-86d0-4a40-9e9a-e5c302abe59b","code":"DT","name":"Design and technology"}],"locations":[{"id":"b4529055-15dd-4c21-afda-bc466a578b4c","name":"Winchmore School","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"7f05f8ba-b5c9-4dae-9e0e-abb480bdf07e","code":"1KC","name":"Pan Enfield Alliance"},"accreditedBody":{"id":"feecdec5-259c-45e3-b1cf-4e391936ee90","code":"H36","name":"University of Hertfordshire"},"english":"3","maths":"3","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","aboutCourse":"The Pan Enfield Alliance has a history of training Design Technology colleagues very successfully - with all trainees having found employment immediately after training. Previous trainees have commented on the extent of support they received as well as the practical and pedagogical skills they learnt during their time with us.","interviewProcess":"You will be interviewed by a panel - including the Head of Department or Faculty and a member of the Senior Leadership Team. There will also be a test of literacy and a short lesson observation to see how you relate to young people. \r\n\r\n","howSchoolPlacementsWork":"Students apply to the Pan Enfield Alliance and the school of their choice for the main placement.  Most of our previous trainees have lived locally, but due to our reputation, we have trained colleagues from across London.  You will be teaching 11-18 year olds and will be within an Alliance of over a dozen schools, in 2 placements and with the opportunity to spend some time in additional schools.  Your placements run for the whole training year, with 1 day per week at university.","personalQualities":"We are looking for confident, knowledgeable and enthusiastic people who will be classroom practitioners currently or in the near future. Preferably, you will currently hold a role within a school which requires you to work directly with children. \r\nWe prefer candidates who can show evidence of their working with children and who possess the personal attributes which suggest real potential in the classroom: independence, flexibility and charisma. \r\n","otherRequirements":"The Department for Education requires the Disclosure and Barring Service (formerly the Criminal Records Bureau) to vet the background of persons working in their schools.  Candidates offered a place on a School Direct course will be asked to complete an enhanced check with the DBS to ensure they do not have a criminal background which might prevent them from working as a teacher.  This must be completed before you register on the programme.","status":2,"createdAt":"2021-07-06T10:56:44.433Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"UQ1"}
