{"id":"ba559048-836a-4e20-ae94-59fe0e3b08b1","name":"English","code":"34LH","qualification":"qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SS","fundingType":"salary","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3aed1aa8-ae46-4b68-92bb-a6cc20655c59","code":"Q3","name":"English"}],"locations":[{"id":"4794d1fe-c1c6-44f0-8053-86f1d545ba2e","name":"Highlands School","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"7f05f8ba-b5c9-4dae-9e0e-abb480bdf07e","code":"1KC","name":"Pan Enfield Alliance"},"accreditedBody":{"id":"feecdec5-259c-45e3-b1cf-4e391936ee90","code":"H36","name":"University of Hertfordshire"},"english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","aboutCourse":"Highlands School has a legacy of achieving excellent English results at both GCSE and A Level. The department is stable and supportive - having experience over many years of supporting beginning teachers into the profession. Commonly cited as'outstanding' by assessors and visitors, as well as parents and students, you will have the opportunity to work with professionals who are enthusiastic, extremely knowledgeable and always keen to share and discuss approaches to the teaching of English. ","interviewProcess":"You will be interviewed by a panel - including the Head of Department or Faculty and a member of the Senior Leadership Team.  There will also be a test of literacy and a short lesson observation to see how you relate to young people.","howSchoolPlacementsWork":"Students apply to the Pan Enfield Alliance and can request the school in which they wish to train.  Most of our previous trainees have lived locally, but due to our reputation, we have trained colleagues from across London.  You will be teaching 11-18 year olds and will be within an alliance of 13 schools.  Your placement runs for the whole of the training year, with 1 day per week at university.","personalQualities":"We are looking for confident, knowledgeable and enthusiastic people. Preferably, you will currently hold a role within a school which requires you to work directly with children. \r\nWe prefer candidates who can show evidence of their working with children and who possess the personal attributes which suggest real potential in the classroom: independence, flexibility and charisma\r\n","otherRequirements":"You will also be expected to complete Literacy and Numeracy skills tests prior to commencing training and a DBS check.","status":2,"createdAt":"2021-07-06T10:56:44.135Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024","salaryDetails":"UQ1"}
