{"id":"54799c25-a707-4483-b335-2c1f60eaf94b","name":"Primary (3-7)","code":"3DRY","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_7","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"93e6150c-5759-4378-94c4-bca22fa4a84b","name":"Queen Elizabeth's Grammar School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"573a7915-0299-4c86-a12f-d08384f25cac","code":"2KK","name":"Queen Elizabeth’s Grammar School, Horncastle"},"accreditedBody":{"id":"1d95b6cb-0e08-4485-848a-0e304d71102a","code":"B38","name":"Bishop Grosseteste University"},"profPost":"BO","degreeGrade":"9","english":"2","maths":"2","science":"2","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"An undergraduate degree at class 2:2 or above, or equivalent.\n\nApplicants should typically have 50% of their degree in the subject they intend to teach.\n\nGrade 4 (C) or above in English and maths, or equivalent qualification.\n\nWe’ll consider candidates with pending GCSEs.\n\nWe’ll consider candidates who need to take a GCSE equivalency test in English or maths.\n\nFor full details of the qualifications we accept as equivalent to GCSEs and details of the equivalency tests that we accept, please visit https://www.bishopg.ac.uk/apply-now/gcses-equivalency","courseLength":"OneYear","feesUK":9250,"feesInternational":14280,"feeDetails":"\r\n","aboutCourse":"This PGCE course prepares you to teach children in the 3 to 7 age range as a general primary teacher. It is a very practical course with a significant amount of time spent in schools, mostly working with teachers and pupils, the remaining time is spent on directed study, with partnership training in the University and school.\r\n\r\nThis course includes both school-based experiences and sessions at the university with a strong focus on integrating theory and practice. At least 120 days will be based in schools. School placements are carefully structured to ensure the gradual development of your confidence as an effective teacher through building up experiences working with university-based mentors and school-based mentors. It is an integrated academic and professional preparation for teaching, combining study at either postgraduate or professional level with practical training to meet the Teachers’ Standards. The goal is that you should become a reflective practitioner – a teacher who thinks about their experiences and learns from them in order to improve their practice.\r\n\r\nThe focus of this course is on teaching and learning to support children and on the importance of your professional role. To this end you will be prepared to teach the relevant curriculum for your chosen age range. You’ll carry out a series of school-based and directed study tasks which link the theory to practice and provide a focus for reflection. You will be supported in your learning by university tutors, school teachers, school-based mentors and your peers. Practical teaching is introduced gradually, allowing you to build confidence and skills in a structured way.\r\n\r\nThere is a strong emphasis on linking theory and practice and the academic modules support you in developing your practice. \r\n\r\nFor more information please visit: https://www.bishopg.ac.uk/courses/schooldirectprim\r\n","interviewProcess":"The majority of the School Direct Course is based in class, in school, learning alongside experienced mentors and outstanding teachers. Applicants for the School Direct Route apply directly to Queen Elizabeth's Grammar School. Whilst the process is overseen by the Admissions department at BGU, applicants are interviewed by Queen Elizabeth's Grammar School. You will then be allocated placements in schools which are part of, or that work with, Queen Elizabeth's Grammar School. This means that schools within the cluster can be directly involved in selecting trainees who will become part of their staff team. \r\n\r\nOnce shortlisted applicants will be invited to attend an interview with Queen Elizabeth's Grammar School. The interview tasks include; an assessment of classroom proficiency through a short lesson observation, followed by a formal panel interview.\r\n\r\nThe purpose of the interview is for us to get to know you and for you to get to know us. Once the interview has taken place the panel will discuss how they can best support you in becoming an outstanding teacher and which one of our schools are best placed to help you achieve.\r\n\r\n\r\n","howSchoolPlacementsWork":"You will spend a significant part of the year in partner schools and other educational settings gaining rich and varied experiences. The School Direct Route generally involves working in a base school with an additional placement in an alternative school or setting, normally for at least six weeks. \r\n\r\nThese placements take place alongside training which is based within the Cluster, together with regular University-based training across the year, including completion of two academic modules.\r\n\r\nYou will be supported through your journey by School Based Mentors and also by University Based Mentors, regularly discussing your practice and monitoring progress through lesson observations and the collecting of evidence to demonstrate meeting the Teachers’ Standards. Tutors also offer pastoral support to help you manage your workload and wellbeing. \r\n\r\nYou will work alongside mentors in school to develop confidence, knowledge and skills, gradually taking more responsibility for managing behaviour, planning and teaching lessons across the curriculum and assessing pupil progress.\r\n\r\n\r\n","personalQualities":"Applicants must show enthusiasm and confidence for the subject, a commitment to teaching and possess a genuine desire to enhance the learning experiences of all young people. Applicants must have the ability to work effectively as a member of a team, show good interpersonal skills and have a sense of humour. Good communication and organisational skills are essential.","otherRequirements":"Please note that prior School-based experience is not a statutory requirement for applicants but such school-based experience is of course welcomed and encouraged.\r\n\r\n","status":1,"createdAt":"2021-07-12T13:48:10.328Z","updatedAt":"2021-10-15T09:19:32.397Z","canSponsorStudentVisa":"yes","cycle":"2024"}
