{"id":"e8d7e0af-5cae-4294-9991-e221f6bd2b24","name":"Business studies","code":"G610","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"de6477b2-6027-48e6-b9f7-3206774705c2","code":"08","name":"Business studies"}],"locations":[{"id":"93e6150c-5759-4378-94c4-bca22fa4a84b","name":"Queen Elizabeth's Grammar School","isPublished":"N","status":"N","vacancies":"F"}],"trainingProvider":{"id":"573a7915-0299-4c86-a12f-d08384f25cac","code":"2KK","name":"Queen Elizabeth’s Grammar School, Horncastle"},"accreditedBody":{"id":"1d95b6cb-0e08-4485-848a-0e304d71102a","code":"B38","name":"Bishop Grosseteste University"},"profPost":"PG","english":"2","maths":"2","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feesInternational":12500,"feeDetails":"You could be eligible for either:\r\n•\ta scholarship \r\n•\ta bursary \r\n\r\nYou can’t claim both a bursary and a scholarship - you can only claim one.\r\n\r\nFind out how to apply for a scholarship here: https://getintoteaching.education.gov.uk/funding-and-salary/overview/scholarships\r\n\r\nYou don’t need to apply for a bursary - if you’re eligible, you’ll automatically start receiving it once you begin your course. Find out how you’ll be paid here: https://getintoteaching.education.gov.uk/funding-and-salary/overview/how-you-will-be-paid\r\n\r\nYou may also be eligible for a loan while you study – note that you’ll have to apply for undergraduate student finance.\r\n\r\nFind out about financial support if you’re from outside the UK here: https://getintoteaching.education.gov.uk/explore-my-options/overseas-graduates\r\n","aboutCourse":"The PGCE Secondary Business Studies course at BGU is for people wishing to train as secondary teachers of Business Studies & Economics, 14-19. You may be a new graduate, or you may be looking for a career change after a previous career in the business world. \r\n\r\nThe aim of the course is to encourage you to become a reflective practitioner – a teacher who thinks about their experiences and learns from them in order to improve their practice. Trainees following this course are encouraged to explore a wide range of creative approaches to planning, teaching and evaluating lessons. The course is built upon principles of inclusion and diversity in teaching and learning for all pupils, whatever their potential and achievements. Throughout the course, trainees study different methods of assessment and how they support classroom learning and teaching.\r\n\r\nYou will consider the broader aspects of teaching, contexts for learning, the latest government initiatives and contemporary issues in teaching, learning and assessment. \r\n\r\nThroughout your year of study, you will explore all aspects of your subject. This includes those areas that are your strengths, as well as areas you may need to improve upon. You will study how pupils learn in your subject area, how you need to assess them and how to keep abreast of new developments within your subject. You will learn how to plan and deliver topics in ways that include all types of learners in meaningful ways.\r\n\r\nYou will spend two-thirds of the year in partner schools and other educational settings gaining rich and varied experiences designed to support meeting the standards for Qualified Teacher Status (QTS). Working with peers, tutors and school-based colleagues, you will develop your abilities to promote effective learning among 14-19 year-olds. You will also have opportunities to gain experience of the key stages before and after the ones in which you will qualify.\r\n\r\nThis course is demanding and stimulating. We aim for you to be prepared to take responsibility for your own learning, be open to creative and innovative ideas, and be competent, reflective practitioners both in your training year and beyond. Success on the course means you will have completed a postgraduate (with 60 credits at Masters level) or professional graduate qualification, have met all the Qualified Teacher Status Standards and be ready to start the next year as a Newly Qualified Teacher.\r\n\r\nTo find out more visit: https://www.bishopg.ac.uk/courses/pgcesecbus\r\n","interviewProcess":"The majority of the School Direct Course is based in class, in school, learning alongside experienced mentors and outstanding teachers. Applicants for the School Direct Route apply directly to Queen Elizabeth's Grammar School. Whilst the process is overseen by the Admissions department at BGU, applicants are interviewed by Queen Elizabeth's Grammar School. You will then be allocated placements in schools which are part of, or that work with, Queen Elizabeth's Grammar School. This means that schools within the cluster can be directly involved in selecting trainees who will become part of their staff team.\r\n \r\nOnce shortlisted applicants will be invited to attend an interview with Queen Elizabeth's Grammar School. Interviews for the School Direct programme are currently being conducted digitally via Microsoft Teams or Zoom. The interview tasks include; an assessment of classroom proficiency through a lesson planning and reflection task, followed by a formal panel interview.\r\n\r\nThe purpose of the interview is for us to get to know you and for you to get to know us. Once the interview has taken place the panel will discuss how they can best support you in becoming an outstanding teacher and which one of our schools are best placed to help you achieve.\r\n","howSchoolPlacementsWork":"You will spend a significant part of the year in partner schools and other educational settings gaining rich and varied experiences. The School Direct Route generally involves working in a base school with an additional placement in an alternative school or setting, normally for at least six weeks. These placements take place alongside training which is based within the Cluster, together with regular University-based training across the year, including completion of two academic modules.\r\n\r\nYou will be supported through your journey by School Based Mentors and also by University Based Mentors, regularly discussing your practice and monitoring progress through lesson observations and the collecting of evidence to demonstrate meeting the Teachers’ Standards. Tutors also offer pastoral support to help you manage your workload and wellbeing. \r\n\r\nYou will work alongside mentors in school to develop confidence, knowledge and skills, gradually taking more responsibility for managing behaviour, planning and teaching lessons across the curriculum and assessing pupil progress.\r\n\r\n","personalQualities":"Applicants must show enthusiasm and confidence for the subject, a commitment to teaching and possess a genuine desire to enhance the learning experiences of all young people. Applicants must have the ability to work effectively as a member of a team, show good interpersonal skills and have a sense of humour. Good communication and organisational skills are essential.","otherRequirements":"Please note that prior School-based experience is not a statutory requirement for applicants but such school-based experience is of course welcomed and encouraged.\r\n\r\n","status":2,"createdAt":"2021-07-06T10:47:34.916Z","canSponsorStudentVisa":"yes","cycle":"2024"}
