{"id":"008e7012-c2ba-4ae3-a286-09a82f7fbdb5","name":"Postgraduate Teaching Apprenticeship MFL","code":"3DXG","qualification":"qts","startDate":"2024-06-30T23:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"TA","fundingType":"apprenticeship","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"4608e5e3-2a1a-48a1-8236-56c7af5a139d","code":"24","name":"Modern languages (other)"},{"id":"ce8523ef-9236-4cd9-b260-d826c7a521b3","code":"ML","name":"Modern Languages"}],"locations":[{"id":"7011c70e-6115-413d-b5ed-2d94799548a7","name":"Birmingham","isPublished":"Y","status":"R","vacancies":"F"},{"id":"b91f5f68-8af9-45ba-b93f-ab18627e1acb","name":"West Yorkshire","isPublished":"Y","status":"R","vacancies":"F"},{"id":"3bd13e34-2ab2-4785-a024-729ab327f320","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"b9b841c1-3215-4eee-8904-feb11400b7af","code":"2A6","name":"Star Teachers SCITT"},"degreeGrade":"9","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9000,"feeDetails":"The fees for the Postgraduate Teaching Apprenticeship leading to Qualified Teacher Status (QTS) are £9,000. The Apprenticeship Levy at the employing school is to be used for this fee to upskill unqualified staff. For QTS with PGCE the tuition fee will be £10,600. The PGCE will need to be self-funded.","aboutCourse":"The school-based programme is underpinned by a structured taught course which provides deep insight into the required subject knowledge and the appropriate pedagogy to inspire effective learning in children and young people and secure progress in MFL, which includes French, Spanish or Arabic. The Star Teachers programme begins with an intensive, centrally delivered 2 day induction to core aspects of the school curriculum which includes features of effective learning and teaching; how children learn and how teachers facilitate learning; behaviour management; pupil assessment; planning effective learning for all children, including those with special needs (SEND); English as an additional language (EAL); and planning differentiated learning that meets all young learners’ needs.\r\n\r\nDuring the weekly centre-based time, there will be a focus on developing the trainee group, sharing and disseminating practice together, collaboration and teamwork in learning, planning and teaching. You will undertake audits of your skills, experience and scientific knowledge in relation to the course requirements and the Teachers’ Standards. These will be used to build a personalised learning plan that you will update and maintain throughout your programme.\r\n\r\nThe weekly sessions focusses on:\r\n•\tPedagogy and progression\r\n•\tCurriculum, assessment and progression\r\n•\tSubject development\r\n•\tPersonal development, behaviour, and welfare, including anti-bullying and Social, Emotional and Mental Health (SEMH)\r\n•\tBehaviour for learning\r\n•\tLiteracy and numeracy across the curriculum \r\n•\tSafeguarding, including the Prevent, Female Genital Mutilation (FGM) duty\r\n•\tSpecial educational needs and disabilities\r\n•\tCharacter development, including Spiritual, Moral, Social and Cultural (SMSC), PSHE and British Values\r\n•\tReflection and self-development\r\n\r\nThroughout the first and second term, the apprenticeship will provide the underpinning for training foci and activities in the timetabled opportunities provided in school. The programme will also include additional inputs from Manchester Metropolitan University to support apprentices who have elected to work towards a Postgraduate Certificate award in Education.\r\n\r\n","interviewProcess":"Star Teachers are looking for people who have the determination to succeed, a commitment to working hard and the ability to work with others. You will be able to show enthusiasm for your subject and demonstrate a strong desire to work with children and make a difference in their lives. You will be willing to listen to advice and act on feedback in order to continually improve and develop as a teacher. \r\n\r\nThe assessment day is a half-day and will be based in your employing school. You will complete a number of tasks during the day which may include:\r\n•\tA formal interview\r\n•\tA group presentation task and discussion\r\n•\tA written task\r\n•\tA short teaching activity\r\n•\tAn unseen task \r\n\r\nThe interview panel will consider your:\r\n•\tQuality of subject knowledge in either French, Spanish or Arabic\r\n•\tAbility to communicate effectively and explain difficult concepts\r\n•\tCapacity to establish effective relationships inside and outside the classroom\r\n•\tPassion and drive to deliver the highest quality of educational standards\r\n•\tCommitment to develop as an educator of character\r\n•\tSuitability to train to teach and to meet the Teachers’ Standards by the end of training\r\n•\tFlexibility to adapt to change and ability to think instantaneously\r\n•\tResilience and your ability to commit to tasks\r\n•\tTime management and organisation.\r\n\r\nThe interview panel will usually consist of a representative from one of our Partnership schools and Star Institute.","howSchoolPlacementsWork":"Our secondary apprenticeship is structured to offer training across the 11-16 age range. In recognition of the fact that certain teaching approaches must be secured before a teacher can bring about good or better pupil progress as a result of the lessons they deliver, we adopt a graduated approach to ensure the systematic development of our apprentices.\r\n\r\nIn Term 1 you will begin to develop the foundations of teaching practice, relating educational theory to classroom practice within your employing school. As your skills develop, you will take on increasing responsibility for the classroom planning, teaching and assessment.\r\n\r\nIn Term 2 you  will build upon the basics from your first term and start to develop a deeper understanding of effective pedagogical practice as well as have a 6 week contrasting school experience within a different setting.\r\n\r\nDuring the final phase in Term 3 you will master an extended repertoire of teaching practices within your employing school to ensure outstanding learning and progress. \r\n\r\nYou will undertake a short placement in a Primary school setting (Ages 9-11, school years 5-6) and a second placement in a sixth form or college to gain Key Stage 5 experience (ages 16-19, school years 12-13). This experience will complement the sessions centred on transition and ensure you fully understand the expectations, curricula, strategies and teaching arrangements in the age group immediately before and after those you are trained to teach.\r\n\r\nYou will gain experience in a Special School to focus on Special Educational Needs and Disabilities (SEND). This will build on learning already undertaken during the centre-based course and develop a keen appreciation of the needs of diverse children and how to support their learning.\r\n\r\n\r\n","personalQualities":"Before being accepted onto the Postgraduate Teaching Apprenticeship, all apprentices must satisfy the DfE requirements with regards to fitness to teach. You will be required to complete a confidential medical questionnaire if you are offered a place on our apprenticeship.","otherRequirements":"The Disclosure and Barring Service (DBS) provides employers and other authorised organisations with details of an individual’s convictions, cautions, police reprimands and warnings held on the Police National Computer. You will not be permitted to begin your apprenticeship without being in possession of an enhanced DBS with barred list check. We will arrange for you to apply for this check when you have been offered a place on one of our programme.","status":1,"createdAt":"2021-07-06T10:51:27.037Z","updatedAt":"2021-08-02T10:20:40.864Z","canSponsorSkilledWorkerVisa":"no","cycle":"2024"}
