{"id":"597df378-ad42-4447-8c4c-66370a72d16b","name":"History","code":"2RFL","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"5a3609a0-5bbb-4377-b919-5d89932ab622","code":"V1","name":"History"}],"locations":[{"id":"b91f5f68-8af9-45ba-b93f-ab18627e1acb","name":"West Yorkshire","isPublished":"Y","status":"R","vacancies":"F"},{"id":"7011c70e-6115-413d-b5ed-2d94799548a7","name":"Birmingham","isPublished":"Y","status":"R","vacancies":"F"},{"id":"3bd13e34-2ab2-4785-a024-729ab327f320","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"b9b841c1-3215-4eee-8904-feb11400b7af","code":"2A6","name":"Star Teachers SCITT"},"profPost":"BO","degreeGrade":"9","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feeDetails":"The fee includes QTS and the PGCert","aboutCourse":"The school-based programme is underpinned by a structured taught course which provides deep insight into the required subject knowledge and the appropriate pedagogy to inspire effective learning in children and young people and secure progress in history. The Star Teachers programme begins with an intensive, centrally delivered two week induction to core aspects of the school curriculum which includes features of effective learning and teaching; how children learn and how teachers facilitate learning; behaviour management; pupil assessment; planning effective learning for all children, including those with special needs (SEND); English as an additional language (EAL); and planning differentiated learning that meets all young learners’ needs.\r\n\r\nDuring the weekly centre-based time, there will be a focus on developing the trainee group, sharing and disseminating practice together, collaboration and teamwork in learning, planning and teaching. You will undertake audits of your skills, experience and scientific knowledge in relation to the course requirements and the Teachers’ Standards. These will be used to build a personalised learning plan that you will update and maintain throughout your programme.\r\n\r\nThe weekly sessions focusses on:\r\n•\tPedagogy and progression\r\n•\tCurriculum, assessment and progression\r\n•\tSubject development\r\n•\tPersonal development, behaviour, and welfare, including anti-bullying and Social, Emotional and Mental Health (SEMH)\r\n•\tBehaviour for learning\r\n•\tLiteracy and numeracy across the curriculum \r\n•\tSafeguarding, including the Prevent, Female Genital Mutilation (FGM) duty\r\n•\tSpecial educational needs and disabilities\r\n•\tCharacter development, including Spiritual, Moral, Social and Cultural (SMSC), PSHE and British Values\r\n•\tReflection and self-development\r\n\r\nThroughout the first and second term, the programme will provide the underpinning for training foci and activities in the timetabled opportunities provided in school. The programme will also include additional inputs from Manchester Metropolitan University to support trainees who have elected to work towards a Postgraduate Certificate award in Education.\r\n\r\n","interviewProcess":"Star Teachers are looking for people who have the determination to succeed, a commitment to working hard and the ability to work with others. You will be able to show enthusiasm for your subject and demonstrate a strong desire to work with children and make a difference in their lives. You will be willing to listen to advice and act on feedback in order to continually improve and develop as a teacher. \r\n\r\nThe assessment day is a half-day and will be based in one of the lead schools. You will complete a number of tasks during the day which may include:\r\n•\tA formal interview\r\n•\tA group presentation task and discussion\r\n•\tWritten and mathematics tasks\r\n•\tA short teaching activity\r\n•\tAn unseen task \r\n\r\nThe interview panel will consider your:\r\n•\tQuality of subject knowledge in history\r\n•\tAbility to communicate effectively and explain difficult concepts\r\n•\tCapacity to establish effective relationships inside and outside the classroom\r\n•\tPassion and drive to deliver the highest quality of educational standards\r\n•\tCommitment to develop as an educator of character\r\nThe interview panel will usually consist of a representative from one of our Partnership schools and Star Institute.\r\n•\tSuitability to train to teach and to meet the Teachers’ Standards by the end of training\r\n•\tFlexibility to adapt to change and ability to think instantaneously\r\n•\tResilience and your ability to commit to tasks\r\n•\tTime management and organisation.\r\n","howSchoolPlacementsWork":"Our secondary programme is structured to offer training across the 11-16 age range. In recognition of the fact that certain teaching approaches must be secured before a teacher can bring about good or better pupil progress as a result of the lessons they deliver, we adopt a graduated approach to ensure the systematic development of our trainees.\r\n\r\nIn Term 1 you will begin to develop the foundations of teaching practice, relating educational theory to classroom practice. The placement will enable you to build your teaching from small group teaching and 1:1 pupil support, through to co-teaching with a teacher and solo teaching of groups.  As your skills develop, you will take on increasing responsibility for the classroom planning, teaching and assessment and progress to full class teaching.\r\n\r\nIn Term 2 you will be placed in a contrasting school and will build upon the basics from your first term and start to develop a deeper understanding of effective pedagogical practice.\r\n\r\nIn Term 3 you will return to your autumn term placement. During this final phase you will master an extended repertoire of teaching practices that ensure outstanding learning and progress. The summer term placement will enable you to see the progress pupils make and the impact you have had in securing positive outcomes for young people.\r\n\r\nYou will undertake a short placement in a primary school setting (Ages 9-11, school years 5-6) and a second placement in a sixth form or college to gain Key Stage 5 experience (ages 16-19, school years 12-13). This experience will complement the sessions centred on transition and ensure you fully understand the expectations, curricula, strategies and teaching arrangements in the age group immediately before and after those you are trained to teach.\r\n\r\nYou will gain experience in a Special School to focus on Special Educational Needs and Disabilities (SEND). This will build on learning already undertaken during the centre-based course and develop a keen appreciation of the needs of diverse children and how to support their learning.","personalQualities":null,"otherRequirements":null,"status":1,"createdAt":"2021-07-06T10:51:26.485Z","updatedAt":"2021-08-02T10:13:03.470Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
