{"id":"508cb4dc-feeb-4a83-bfbd-0d827f9ad3b9","name":"Music","code":"328B","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"24311bef-8673-41fb-933c-53f887fb6976","code":"W3","name":"Music"}],"locations":[{"id":"45b4f4cf-2083-4d53-8024-b06273eaddf5","name":"The Grove School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"559abce9-3077-437f-8cec-4ef1fc8f743a","name":"Sir Thomas Boughey High school","isPublished":"Y","status":"R","vacancies":"F"},{"id":"cd2b0bcb-1e7e-43c4-8f10-bc35667c845c","name":"The Orme Academy","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"5bbdc19b-1e1f-4df3-9987-65e2eace12d4","code":"1JA","name":"OAKS Norths Staffordshire and Shropshire Hub"},"accreditedBody":{"id":"7f349baa-f4ef-4fd5-b228-fcc56247e9b9","code":"24P","name":"The OAKS (Ormiston and Keele SCITT)"},"profPost":"BO","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"The OAKS offers candidates the opportunity to train and develop as a subject specialist. A minimum of 40% of the credits obtained from your degree must be directly related to the subject you wish to train to teach.","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","courseLength":"OneYear","feesUK":9250,"feeDetails":"Studying for a postgraduate degree is a good investment in your future, but you need to carefully consider how you’re going to pay for your course and your living costs.\r\nMost students will be able to apply for loans and depending on where you live and your circumstances, bursaries and scholarships might also be available.\r\n\r\nWith The OAKS there is a pre-course fee which covers\r\n- Enhanced DBS check\r\n- Fitness to teach\r\n- Purchasing of Bristol Guide (reduced cost from The OAKS)\r\n- Residential trip.  \r\n\r\nIn 2021/22 the total price for the above was £115, at this moment in time we are unable to confirm the price for 2022/23, but do not foresee this increasing dramatically.\r\n\r\nThere is also a possibility of undertaking a First Aid course and / or a P4C (Philosophy for Children) course, these are optional and may incur an additional fee.\r\n\r\n","aboutCourse":"The Secondary Initial Teacher Education Programme at The OAKS has been designed to be both academic and vocational. It is predicated on the requirements to provide challenging expectations of you as a Trainee Teacher to create a teaching and learning environment which will engage your interest and motivation. The broad aims of the main curriculum component of the programme are to:\r\n* develop your Subject Knowledge and teach you how to put that knowledge into practice (pedagogy);\r\n* enable you to become a highly motivated, outstanding, effective, creative and reflective practitioner;\r\n* prepare you for a career in teaching that will prove to be successful and rewarding;\r\n* develop in you a commitment to and enthusiasm for continuing professional and personal development;\r\n*provide you with sufficient information, experience and opportunity in order that you might achieve the National Teacher Standards to enable you to be recommended for QTS (Qualified Teacher Status).\r\n\r\nThe programme places you in to two secondary placements, preferably offering a different type of training environment but at The OAKS you will also gain other vital experiences such as:\r\n* A week's placement in a Primary school\r\n* Post-16 experience\r\n* Visiting a pupil referral unit (PRU)\r\n* Spend time in a Special school for SEND experience\r\n* Have a MAPP (multi agency placements) entitlement  e.g. welfare officers, etc.\r\n* EAL (English as an additional language) in multi-cultural partnership schools\r\n* A two day (one night) residential at the beginning of the course to learn about how trips out of school can be successful in enhancing pupil progress and confidence with peers and adults.\r\n\r\nTo supplement the University programme, each week you will also attend CPD sessions at Blackfriars Teaching School where you will be taught by highly experienced tutors on a wide range of topics. These weekly sessions are also an excellent opportunity to network and share experiences with other trainees .\r\n\r\nThe programme offers a very diverse and exciting spread of experiences which should enable you to gain very valuable experience to take to your first school as an NQT. We will keep in touch through this year and offer even more continuing support.  The OAKS team wants to support you and maintain a caring environment which we hope that you will eventually offer to your future pupils.\r\n\r\nFor further information regarding the specific programme content for individual subjects, please see The OAKS website (theoaks.org.uk)","interviewProcess":"Our selection process is a two way process where you can find out if the OAKS is the training programme for you and we can decide if you can potentially become a good/outstanding secondary teacher.  We always carry out our interviews in one of our partnership schools, where you will be expected to teach either a class or a small group of their students for 15 minutes.  The students give us feedback on your lesson, which we share with you during a formal interview.  This focuses on your lesson, your subject knowledge and your commitment to teach.  There are also written tasks for you to complete; these include a written subject specific activity and a generic writing task.  The whole process should take no more than half a day at the school.  You are interviewed by partnership school staff and OAKS tutors, who will talk through the programme and school placements. There will always be plenty of time for you to ask questions and the decision as to whether you are accepted on to the course is usually made on the same day (this may vary depending on the subject/time of year).\r\n\r\nWe want the interview to be a very positive experience for you. Please arrive promptly and formal dress is expected.  We look forward to meeting you!\r\n","howSchoolPlacementsWork":"You will undertake two secondary school placements during the programme. Whilst every effort will be made to ensure that you are placed in your chosen school, this cannot be guaranteed.\r\n\r\nAll of the schools in the Blackfriars Teaching School Alliance are incredibly experienced in welcoming and nurturing Trainee Teachers. From day one you will be made to feel part of the team and will be surrounded by passionate people who are dedicated to making a difference. As well as receiving excellent support from our mentors in school, all Trainee Teachers within the Blackfriars Teaching School partnership are offered a weekly CPDT Programme which supplements the University programme. These CPDT sessions offer Trainee Teachers the opportunity to learn from practitioners who are experts in their field and also allows time to share best practice and network.\r\n\r\n","personalQualities":"We are looking for energetic and skilled individuals who have a real passion and commitment to working with children and young people.\r\n We are looking for individuals who:       \r\n* Are good at explaining things to others;\r\n* Enjoy working with a wide range of people;\r\n* Are enthusiastic;\r\n* Have a strong knowledge in particular subject areas;\r\n* Are good time-managers;\r\n* Have the ability to work in a team as well as using your own initiative;\r\n* Keep cool under pressure;      \r\n* Have patience and a good sense of humour;       \r\n* Cope well with change;       \r\n* Enjoy a challenge.\r\n","otherRequirements":"*A medical report which is deemed satisfactory;       \r\n*A completed DBS enhanced disclosure which is deemed satisfactory;     \r\n*At least 10 days teaching experience in a secondary school/college during the last 2 years, either before or after selection;\r\n*Satisfactory references.\r\n\r\nFor Music – It is expected that you can read music and you must be able to play an instrument at level 7 or above or have equivalent experience","status":1,"createdAt":"2021-07-06T10:47:32.694Z","updatedAt":"2021-10-28T10:25:30.128Z","canSponsorStudentVisa":"no","cycle":"2024"}
