{"id":"37c8d0bc-56a2-4a24-950c-33ef07f08be7","name":"Primary","code":"N325","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"1be01d10-91c1-4fb3-9230-c19a3844d97e","name":"Poole SCITT","isPublished":"Y","status":"R","vacancies":"F"},{"id":"582562fc-26a4-4c1c-aa2f-c441d44561c7","name":"Christchurch Junior School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"23cfdec6-691c-4f89-b7e4-5c65d1b3343f","name":"Twynham Primary School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"c19e8d00-d051-4558-bf96-b0f6f0dbf2a8","name":"Stourfield Infant School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"5b85bcb0-b2b8-4627-84be-0a39934102ca","name":"Stourfield Junior School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"4f36b9a3-863f-4ece-8d72-584435125ac7","code":"13Q","name":"Twynham Learning (School Direct)"},"accreditedBody":{"id":"f92545e7-be5f-4a2b-a9af-21271b8d985e","code":"P75","name":"Poole SCITT"},"profPost":"PG","degreeGrade":"1","english":"1","maths":"1","science":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We accept GCSEs, iGCSEs or equivalency tests throug the company 'Equivalency Testing' only (www.equivalencytesting.com)","courseLength":"OneYear","feesUK":9250,"aboutCourse":"Poole SCITT, in partnership with Twynham Learning, offers you a one year course leading to a Post Graduate Certificate of Education (PGCE) with Qualified Teacher Status (QTS) validated by Kingston University in Surrey. The course carries 60 Credits towards a Masters Degree. \r\nThere will be 4 places available on this Twynham Learning Primary course.\r\n\r\nThe course is largely school based, with approximately 24 weeks on school placements and 14 weeks on the taught course mainly at the Poole SCITT base. Many of the taught course sessions involve working with children enabling you to successfully link theory and practice.  \r\n\r\nTutors, classroom teachers and other educational professionals, experienced in teacher training will run courses, seminars and workshops specially designed to introduce you to the needs of children and the primary curriculum. There will be ample opportunity for peer group discussion and evaluation of your school-based work. \r\n\r\nYou will undertake studies in all elements of primary education; extend your knowledge of learning and teaching, of the breadth and scope of the curriculum and the professional skills associated with high-quality teaching. You will then apply these areas of understanding and skill to classroom practice throughout the year during two extensive assessed placements in schools or educational settings. \r\n\r\nTrainees are guided through their learning by experienced staff and school based mentors, to enable them to gain the skills and confidence to become effective, successful teachers of primary aged children.  \r\n\r\nA Course Director, with expert knowledge and experience of teacher education will oversee and co-ordinate your training during the course under the direction of the SCITT Management Board. The Board is made up of representatives of the partnership, including head teachers, mentors and trainees.\r\n\r\nThe course is an 'all-through general primary course' and will train you to teach children from 5-11 years in Key Stage 1 and Key Stage 2 and substantial school experience will be provided in both.  \r\n\r\nYour progress will be monitored and assessed through regular formal and informal monitoring of teaching competence, leading to profile reviews and professional assignments, which will link education/subject theory with your work in the classroom. \r\n\r\nAfter graduating, you will obtain Qualified Teacher Status (QTS) and a\r\nPostgraduate Certificate of Education (PGCE) with 'M' Credits validated by Kingston University in Surrey.\r\n\r\nOver the last three academic years, 99% of Poole SCITT trainees have obtained jobs immediately after graduating, most of these in the local area.\r\n ","interviewProcess":"Applicants are selected from applications through the DfE application site (https://www.gov.uk/apply-for-teacher-training). You should write a full personal statement giving reasons for wanting to teach and cite any experience of working with children (although strongly recommended, this is not an essential requirement for application). \r\nCareful consideration should be made regarding referees. These might be from a University tutor, depending on time lapsed since the degree was taken, and from a school/employment contact. At least one should be from someone who can comment upon your working with children\r\nIf you meet/expected to meet entry requirements, and have demonstrated your passion and commitment to teaching in your application, you'll be invited to attend an interview. Please make it clear  if you're working towards GCSE qualifications and when results will be known. \r\nThe interview's your chance to demonstrate your potential to become a successful teacher. Successful candidates will be invited to attend an interview session with Literacy and Numeracy testing, group and individual interviews. The interview is also your chance to find out more about the course.\r\nMore specific details about the interview process will be provided to candidates by email if successful in application, so please provide a valid and regularly monitored email address on application forms.\r\n \r\n\r\n\r\n\r\n","howSchoolPlacementsWork":"Poole SCITT currently partners with around 30 Primary schools in the Poole, Bournemouth and Dorset area including the Twynham Learning Partnership.\r\n\r\nParticipating schools have been selected on their record for providing a quality teaching and learning environment, their strength of commitment to professional development and their previous experience of working with trainees in initial teacher training. \r\nThe schools have been strongly involved in the writing and development of the course and are also involved in the selection of the trainees, their mentoring and assessment.\r\n\r\nAll trainees are required to undertake assessed training in both Key Stages 1 and 2 and substantial school experience will be provided in both. \r\nStudents undertake at least one Block Practice in Key Stage 1 and one in Key Stage 2 during the course.  Each Block Practice consists of 11 weeks, both in mainstream schools in the Twynham Learning partnership (Christchurch Junior, Stourfield Infant, Stourfield Junior, Twynham Primary). You will work in 2 of these schools. Additionally there will be 2 placement weeks in two different schools which will be non-assessed which may be in other partnership schools. \r\nYou will be placed in schools that best help you to develop your professional practice. This could be across any of the schools in the Twynham Learning partnership. Please see the Twynham Learning website for a list of these schools. Travelling time for students will be taken into account but this is not always possible.\r\n\r\nYour main in-school experience will progress from observing and working alongside your class teacher to taking full responsibility, firstly for groups and later, for the whole class. \r\n\r\nTrainees will be assigned a trained mentor within the school who will be responsible for supporting and guiding professional development and ensuring that everyone has the opportunities they need within the school.\r\n\r\nTrainees are based at the Poole SCITT centre at Ad Astra Infant School and school experience is within Poole SCITT partner schools and within the Twynham Learning Partnership. \r\nTrainees are included in the PGCE cohort of Poole SCITT and Kingston University. \r\n\r\n","personalQualities":"We will look for evidence of a commitment to the teaching profession, an understanding of professional requirements, and an awareness of current educational issues in an application. Prior experience in a school is not required, however prospective students may find experience in a school useful for obtaining insights into the primary education classroom. Experience in a school or similar setting may also provide reassurance to prospective students that teaching is the right choice for their career.","otherRequirements":"All offers made will be subject to Criminal Records Checks, prohibition from teaching checks and medical clearance and where necessary, satisfactory completion of degrees and other minimum qualification requirements.  You will be sent more information about when and how you need to complete each of these checks if you accept an offer.","status":1,"createdAt":"2021-07-06T10:46:30.948Z","updatedAt":"2021-07-28T10:47:25.550Z","canSponsorStudentVisa":"no","cycle":"2024"}
