{"id":"9f7019dc-3c3e-4732-a772-100acaba4781","name":"Primary","code":"2788","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"65484844-300c-471b-a973-2fd35dd0b0c1","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"2c89b3e1-0ba2-4b4e-a0ca-0011112cf0b6","code":"1TR","name":"Mickle Trafford Alliance"},"accreditedBody":{"id":"e843cb68-d310-478c-8dba-cf9633fea086","code":"C55","name":"University of Chester"},"profPost":"BO","degreeGrade":"0","english":"1","maths":"1","science":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","acceptScienceGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feeDetails":"Please note the above Fees are a guide only. \r\nFees are set by University of Chester - please check on the university website.","financialSupport":"Please check DFE and University of Chester websites for details on loans and bursaries.\r\nMickle Trafford Village School Alliance have no financial incentives for this course.","aboutCourse":"Training to be a teacher with Mickle Trafford Village School Alliance of schools allows Associate Teachers to gain a realistic understanding of the challenges and rewards of teaching by becoming an integral part of the school staff. From the start, ATs will be expected to attend staff meetings, meet parents, become involved in PTA events and generally become immersed in school life. Combined with time away from the classroom spent developing professional skills and completing assessments for P.G.C.E. ( delivered and assessed by The University of Chester) this approach has proved successful and developed a new generation of teachers who feel optimistic and confident about starting their teaching career.\r\nAssociate teachers will spend a minimum of 120 days in Mickle Trafford Village School, or/and like minded partner schools close by, completing placements in Key Stage 1 and 2. Mentors are experienced, supportive and aim to ensure that ATs set high standards for themselves and the pupils they teach.  \r\nIn addition to time in the classroom, days are spent with ATs from local alliances developing and enhancing professional skills.  These sessions include improving Associate Teachers' subject knowledge , the use of different behaviour management strategies, understanding the needs of children with SEND and learning how to use technology to enhance learning. \r\nAssociate Teachers are encouraged, where possible,  to participate in residential trips along side the children. They will will help gain an understanding the planning process, including the need for risk assessments, offering information to parents and ensuring medical or SEND needs are catered for  - it is these sort of real life school experiences that enable ATs to feel confident as they enter their NQT year.\r\nIn collaboration with The Bishops' Blue Coat High School, enrichment days help develop an understanding of the challenges facing transition between  primary and high school. ATs from primary and secondary work together to  create adapted tasks to be delivered in Y5, Y6 and Y7. The aim of the 3 day programme is to inspire pupils of different ages and encourage them to develop empathy and think sensitively about the lives of others.\r\nWe recognise that this programme is intense and challenging and so  endeavour to provide support throughout the year, including with making applications for teaching posts and suggestions for making positive impressions at interview later in the year. \r\nAdaptations to the delivery of this course may be necessary due to COVID -19 restrictions.","interviewProcess":"Candidates will be interviewed at Mickle Trafford Village School. \r\n\r\nThe process, which lasts half a day,  will include, a formal interview, candidates delivering a task of their choosing to a group of children for approximately half an hour, questions from  the School Council ( children) and basic mathematics and writing assessments.\r\n\r\nThis format may be adapted depending on COVID -19 restrictions.\r\nAt this point, it is anticipated that outdoor learning would be the focus of the teaching element for example.","howSchoolPlacementsWork":" Associate Teachers will have placements in both KS1 and KS2 and will be working in a different year group each term. Where possible both lower and upper KS2 placements will be organised so that Associate Teachers get a breadth of experience across the primary age phase.\r\n\r\nThe usual programme outline (although changing circumstances in schools may mean this needs to be adapted) starts with ATs at their home school  in the autumn term. In the spring term ATs visit their contrasting placement ( and a different year group) before returning to their home school in the summer term for their final placement - again in a different year group. \r\n\r\nAll schools are within the locality of Chester.\r\n\r\nDue to COVID -19 restrictions, placements may be in one primary school only.  \r\n","personalQualities":"This is a challenging course - resilience, good time management and energy will be needed to complete the year. Candidates are reminded that school hours are not only the ones when the children are present and Associate Teachers will be expected to be in school before and after the children are present. ","otherRequirements":"Ideally, candidates are expected to be able to evidence at least two weeks spent working in schools in the primary age phase or definite placements organised and confirmed prior to starting the course. Support can be offered to accommodate two weeks experience as a condition for an accepted offer\r\n\r\n","status":1,"createdAt":"2021-07-12T13:47:58.142Z","updatedAt":"2021-09-30T14:29:05.207Z","canSponsorStudentVisa":"yes","cycle":"2024"}
