{"id":"ae84c057-743f-4e73-b41a-664bce92824e","name":"Religious Education","code":"278R","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"724b5d16-28dd-4431-bc17-ea4be4daedc4","code":"V6","name":"Religious education"}],"locations":[{"id":"65484844-300c-471b-a973-2fd35dd0b0c1","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"2c89b3e1-0ba2-4b4e-a0ca-0011112cf0b6","code":"1TR","name":"Mickle Trafford Alliance"},"accreditedBody":{"id":"e843cb68-d310-478c-8dba-cf9633fea086","code":"C55","name":"University of Chester"},"profPost":"BO","degreeGrade":"0","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"A level in Religious Education would be preferred if Religious Education is not your main degree subject","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feesInternational":9250,"feeDetails":"Please note the above Fees are a guide only. \r\nFees are set by University of Chester - please check on the university website.","financialSupport":"Please check DFE and University of Chester websites for details on loans and bursaries.\r\nMickle Trafford Village School Alliance have no financial incentives for this course.","aboutCourse":"Training to be a teacher with Mickle Trafford Village School Alliance of schools allows Associate Teachers (ATs) to gain a realistic understanding of the challenges and rewards of teaching by becoming an integral part of the school staff. From the start, when in school, ATs will be expected to work with students from all year groups, attend department and staff meetings, meet parents, and generally become immersed in school life. Time will also be spent away from the classroom developing professional skills and completing assessments for P.G.C.E. (delivered and assessed by The University of Chester). This approach has proved successful and developed a new generation of teachers who feel optimistic and confident about starting their teaching career.\r\nAssociate teachers will spend the majority of their training at The Bishops’ High School in Chester and a 30 day contrast placement at a partner schools close by.  All our ATs work with an experienced and supportive Subject Mentor to ensure that ATs set high standards for themselves and the pupils they teach.  \r\nIn addition to time in the classroom, days are spent with ATs from local alliances developing and enhancing professional skills.  These sessions include improving Associate Teacher's subject knowledge across the curriculum, the use of different behaviour management strategies, understanding the needs of children with SEND and learning how to use technology to enhance learning. \r\nAssociate Teachers are encouraged, where possible, to participate in residential trips alongside the children. They will gain an understanding the planning process, the need for risk assessment, prepare information for  parents and ensure medical or SEND needs are catered for  - the sort of real life school experiences that enable ATs to feel confident as they enter their NQT year.\r\nIn collaboration with Mickle Trafford Village Primary School, enrichment days help develop an understanding of the challenges facing transition between primary and high school. ATs from primary and secondary work together to create adapted tasks to be delivered in Y5, Y6 and Y7. The aim of the 3 day programme is to inspire pupils of different ages and encourage them to develop empathy and think sensitively about the lives of others.\r\nWe recognise  this training programme is intense and challenging and  endeavour to provide support throughout the year, including with making applications for teaching posts and suggestions for making positive impressions at interview later in the year.\r\nThis programme may need adaptation to meet COVID-19 restrictions.","interviewProcess":"Candidates will be interviewed at The Bishops’ High School in Chester. \r\n\r\nThe process, which lasts half a day, will include observation of a lesson followed by a formal interview which provides candidates to reflect on the lesson they have observed and make connections to their own experience of working with young people. \r\n\r\nThis process may be amended due to COVID-19 restrictions.\r\n","howSchoolPlacementsWork":"Associate Teachers will spend the majority of their training at The Bishops’ High School and a 30 day contrast placement at a nearby secondary school.  During the training year, ATs will have experience of working with students from Key Stage 3, 4 and 5 and will also shadow the work of our pastoral team to prepare them for the role of the Form tutor.\r\n \r\nThis may be amended due to COVID-19 restrictions.\r\n","personalQualities":"This is a challenging course - resilience, good time management and energy will be needed to complete the year. Candidates are reminded that school hours are no only the ones when the children are present and Associate Teachers will be expected to be in school before and after the children are present. ","otherRequirements":"Ideally, candidates are expected to be able to evidence at least two weeks spent working in schools in the secondary age phase or definite placements organised and confirmed prior to starting the course. However, due to COVID-19 restrictions this may not be possible and candidates without two weeks experience in school will be considered. \r\n\r\n","status":1,"createdAt":"2021-07-06T10:46:32.427Z","updatedAt":"2021-10-03T13:22:04.607Z","canSponsorStudentVisa":"yes","cycle":"2024"}
