{"id":"5c5a3641-98e4-4c05-b638-ac1a618c76e9","name":"Primary (Special Educational Needs and Disability)","code":"2RCL","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"yes","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"437c716f-8769-4c11-bbea-6297b2f16cbe","name":"Fiveways Special School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"433613c8-568b-4f15-9bb6-2adb76d62764","code":"28Y","name":"Yeovil Area Teacher Training Alliance"},"accreditedBody":{"id":"d41a1821-e35b-48eb-bf02-4842872b04a2","code":"E84","name":"University of Exeter"},"profPost":"PG","degreeGrade":"0","english":"3","maths":"3","science":"9","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"All equivalency enquiries must be directed to the University of Exeter.","courseLength":"OneYear","feesUK":9250,"feesInternational":19500,"financialSupport":"For further information, please contact [University of Exeter Fees and Finance](https://www.exeter.ac.uk/teachertraining/apply/feesandfinance/)\r\n\r\n","aboutCourse":"This innovative and highly regarded course follows our mainstream primary  course (see Course Code 22JX for details) but  with the additional benefit of specialising  in special educational needs and disabilities (SEND). \r\n\r\nThe SEND specialism is suitable for  all  applicants  interested in special education, whether seeking a  special school  teaching career or one in a mainstream primary school. Under the  expertise of  SEND professionals,  the programme has been carefully designed to support all trainees to become the best teacher they can possibly be when responding to the learning needs of every individual in their class, regardless of setting.\r\n\r\nTrainees on this route receive  additional training, led by experienced practitioners in SEND, as well as having the valuable experience of having the spring term in a special school or school with a specialist provision. This offers valuable, first hand teaching experience within a wide spectrum of special educational needs, which may include profound and multiple learning difficulties, autism or additional complex needs. \r\n\r\nSEND taught days cover a range of topics such as the following:\r\n\r\n- SEND Code of Practice\r\n- Working with SENCOs\r\n- Social, Emotional, Mental Health\r\n- ASD & structured teaching\r\n- SEND classroom behaviour management strategies\r\n- Multi-sensory teaching & learning\r\n- Working with others: a collaborative approach\r\n- SEND planning and assessment\r\n- Pupils with complex difficulties whose behaviour challenges\r\n- Medical and physical needs\r\n- Bereavement and grief\r\n- Communication and interaction\r\n- Introduction to signing\r\n- Leading a class team\r\n- Special school comparison visits\r\n\r\nTrainees on this specialism undertake the same course work as those on the Primary PGCE programme; however, where applicable,  work and assignments may have a  SEND focus.\r\n\r\n(Please note: in the unlikely event of a trainee not making the expected level of progress in mainstream practice, they may be required to transfer to the primary course (22JX), without SEND specialism, in order to meet statutory Initial Teacher Training Criteria.)","interviewProcess":"Interview days are typically held from October to early summer in Yeovil at Huish Primary School ,in the morning, and Fiveways Special School, in the afternoon. \r\n\r\n(Please note: candidates for the Primary with SEND course will be short-listed at lunchtime and only those who remain under consideration will be asked to attend the afternoon session).\r\n\r\nThe day includes a range of activities designed to assess your aptitude for teaching in both settings; however, we aim to make the experience as relaxed as possible so that you perform your best without nerves getting in the way.\r\n\r\nDuring the day, there will be plenty of time to find out more about us and ask questions. We not only recognise the importance of you being the right trainee for us, but also of us being the right course for you!\r\n\r\nNB: Candidates who show good potential for primary teaching, but have not sufficiently demonstrated suitability for the SEND specialism, could still be offered a place on the mainstream Primary 5-11 course (22JX).\r\n\r\nWe aim to let candidates know whether or not they have been successful as soon as possible following their recruitment day.\r\n\r\nPlease note:\r\n* Candidates invited for interview will be notified first via UCAS and then receive further details by email.\r\n\r\n* Data Sharing (GDPR) – Personal data provided will only be disclosed to relevant staff within Yeovil Area Teacher Alliance when necessary.","howSchoolPlacementsWork":"\r\nWith the exception of approximately 60 days set aside for university-led training, home study towards your PGCE and our weekly taught programme (including additional training sessions in SEND), the majority of your time with us will be spent learning in our partnership schools.\r\n\r\nIn the autumn and summer terms, you will have mainstream teaching experience, with placements in Key Stages 1 and 2, in a school located  in and around the Yeovil area. \r\n\r\nIn the spring term, it may be necessary to travel a little further afield for your special school placement. Special schools within our partnership are located in the following towns:  \r\n- Frome\r\n- Bridgwater\r\n- Taunton\r\n- Street\r\n- Yeovil\r\n\r\nWithin the constraints of the statutory ITT Criteria, we endeavour to take into account the distance between home and school when organising all placements. \r\n\r\nOur trainees tell us, by being in schools from the very beginning of the autumn term, they quickly settle and establish themselves  as part of the teaching team. Unlike many other ITT providers, our programme runs up to the end of the school year, with the aim of giving you extra value from the course fee.\r\n\r\nAs most of our trainees secure employment before the end of the taught programme, they are free to transfer to their employing school during the final part of the summer term, offering the opportunity to settle in and prepare for having a class of their very own!\r\n","personalQualities":"HAVE YOU  a real desire to improve positive outcomes for children with SEND through high quality teaching and learning?\r\n\r\nARE YOU….\r\n\r\n-\tEnthusiastic, driven and engaging?\r\n\r\n-\tA great team player?\r\n\r\n-\tHighly organised, reflective and committed to hard work?\r\n\r\n-\tEmpathetic and resilient?\r\n \r\nYES? .....THEN APPLY TODAY!\r\n \r\n\r\n\r\n\r\n","otherRequirements":"The entry requirements for this course:\r\n\r\n•\ta 2:1 or above in your first degree. (Candidates with a 2:2 classification may still be considered if their potential and aptitude for primary teaching is sufficiently demonstrated on application and at interview.); \r\n\r\n•\tpasses at GCSE in English, Mathematics and Science at grade C/4 or above or equivalent \r\n\r\n*  a satisfactory fitness to teach assessment and DBS enhanced disclosure.\r\n\r\nYou will need to be able to demonstrate your understanding of educating children and  young people with special educational needs and disabilities, and show some awareness of the current educational landscape.\r\n\r\n\r\n","status":1,"createdAt":"2021-07-06T10:51:13.322Z","updatedAt":"2021-09-30T12:44:46.836Z","canSponsorStudentVisa":"yes","cycle":"2024"}
