{"id":"63ea4c01-45aa-435d-b479-e6c0732b696c","name":"Primary (5-11)","code":"22JX","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"692a8f2d-c1cb-42f7-b58c-5fc9e6c5cc9d","name":"Huish Primary School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"433613c8-568b-4f15-9bb6-2adb76d62764","code":"28Y","name":"Yeovil Area Teacher Training Alliance"},"accreditedBody":{"id":"d41a1821-e35b-48eb-bf02-4842872b04a2","code":"E84","name":"University of Exeter"},"profPost":"PG","degreeGrade":"0","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"All equivalency enquiries must be directed to the University of Exeter.","courseLength":"OneYear","feesUK":9250,"feesInternational":19500,"financialSupport":"For further information. please contact [University of Exeter Fees and Finance](https://www.exeter.ac.uk/teachertraining/apply/feesandfinance/) ","aboutCourse":"Following a 'Welcome & Induction Day', main school placements start on the first day of the new school year.\r\n\r\nIn the first term, approximately three days every week are spent in school although when, and how, you start teaching is carefully planned with your class teacher.\r\n\r\nFurther time is set aside for university-led training and home study towards a PGCE.  You will complete two assignments (approximately 7500 words each) and produce evidence-based work for a training file. In addition to support from your placement school, you will have termly tutor visits to help ensure you are on track.\r\n\r\nTime is also dedicated to learning with your fellow trainees on our bespoke taught programme, covering a range of key curriculum areas and aspects of school life. This also provides a valuable opportunity to come together as a group and share learning experiences.\r\n\r\nFollowing Christmas, you will undertake a shorter teaching placement in a school that contrasts with your main one. After approximately ten weeks, trainees return to their main placement. By the summer, the PGCE study will have been completed, allowing more time to hone school practice and consolidate teaching skills.\r\n\r\nHere, at Yeovil Area Teacher Training Alliance, we are very proud of our  reputation as a quality provider of ITT; we really value the close working relationship we have with all our trainees and partnership schools. If you want a course with a proven track record of trainee satisfaction, excellent prospects for teaching within the area and one that doesn't involve long distance travel, then this is probably the one for you!\r\n\r\nWhat our trainees say about us:\r\n\r\n‘Choosing which ITT course to do is mind boggling…but I’m so glad I chose this one!’\r\n\r\n'The taught programme was invaluable and really helped me reflect on and develop my own practice.’\r\n\r\n‘I loved my placement school and felt like a member of staff from day one!’\r\n\r\n‘The support I received throughout my course was fantastic.’\r\n\r\nWe look forward to receiving your application and encourage you to find out more about us, either by viewing our website, emailing us, or paying us a visit.","interviewProcess":"Interview days are typically held from October to early summer at Huish Primary School in Yeovil. The day typically includes a range of activities designed to assess your aptitude for teaching; however, we aim to make the experience as relaxed as possible so that you perform your best without nerves getting in the way.\r\n\r\nDuring the day, there will be plenty of time to find out more about us and ask questions. We not only recognise the importance of you being the right trainee for us, but also of this being the right course for you!\r\n\r\nWe aim to let candidates know whether or not they have been successful as soon as possible following their recruitment day.\r\n\r\nPlease note:\r\n\r\n*Data Sharing (GDPR) – Personal data provided will only be disclosed to relevant staff within Yeovil Area Teacher Training Alliance as necessary.\r\n\r\n* Photographs featuring trainees may be used for marketing purposes. ","howSchoolPlacementsWork":"With the exception of approximately 60 days set aside for university-led training, home study towards your PGCE and our weekly taught programme, the majority of your time with us will be spent learning in our partnership schools. You will work in two different schools, providing contrasting contexts, and gain teaching experience in both Key Stage 1 and Key Stage 2. Within the constraints of the statutory ITT Criteria, we endeavour to take into account the distance between home and school when organising placements.\r\n\r\nOur trainees tell us, by being in schools from the very beginning of the autumn term, they quickly settle and establish themselves  as part of the teaching team. Unlike many other ITT providers, our programme runs up to the end of the school year, with the aim of giving you extra value from the course fee.\r\n\r\nAs most of our trainees secure employment before the end of the taught programme, they are free to transfer to their employing school during the final part of the summer term, offering the opportunity to settle in and prepare for having a class of their very own!","personalQualities":"ARE YOU….\r\n\r\n•\tEnthusiastic, driven and engaging? \r\n\r\n•\tA great team player? \r\n\r\n•\tHighly organised, reflective and committed to hard work? \r\n\r\n•\tEmpathetic and resilient?\r\n\r\nYES? .....THEN APPLY TODAY!\r\n\r\n\r\n","otherRequirements":"Selection is also based on the following:\r\n\r\n•\tinformation provided on your teacher training application; \r\n\r\n•\tperformance at interview; \r\n\r\n*  a satisfactory fitness to teach assessment and DBS enhanced disclosure.\r\n\r\nAt interview, you will need to demonstrate some awareness of the current educational landscape and it will be advantageous  to reflect on any experience you have of working with  children and young people.","status":1,"createdAt":"2021-07-06T10:51:13.289Z","updatedAt":"2021-09-30T12:44:36.814Z","canSponsorStudentVisa":"yes","cycle":"2024"}
