{"id":"015f1170-d581-4322-a3c4-c89e82f86753","name":"Primary 3-7","code":"U840","qualification":"pgce_with_qts","startDate":"2024-01-01T00:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"P","ageRange":"3_to_7","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"6a234665-e592-4457-a7aa-d4f19b1180a7","name":"WELFORD ON AVON PRIMARY SCHOOL","isPublished":"Y","status":"R","vacancies":"P"},{"id":"cbff8a49-1c4d-4461-8061-3cecf9448113","name":"Main Site","isPublished":"Y","status":"R","vacancies":"P"}],"trainingProvider":{"id":"30194b6f-5252-4ab3-a6d5-55e92730bc62","code":"2L6","name":"Welford-on-Avon Primary School"},"accreditedBody":{"id":"6019b3ce-f2f6-4b0e-b2a9-5813d74c4d54","code":"W80","name":"University of Worcester"},"profPost":"PG","degreeGrade":"9","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"Equivalency tests can be arranged through The University of Worcester","courseLength":"19 months","feesUK":9250,"feesInternational":14100,"feeDetails":"Every course has day-to-day costs for essential books, stationery, printing and photocopying.\r\nTravel costs for placements vary depending on the location of schools and your mode of transport\r\n \r\n","aboutCourse":"The Arden Forest Teaching Alliance, led by Welford on Avon Primary School is delivering a part time Early Years School Direct Initial Teacher Training course in association with the University of Worcester beginning January 2022.\r\n\r\nAlongside your time in school, learning from experienced and highly skilled teachers, you will attend a number of taught sessions led by both the University of Worcester and lead schools.\r\nYou will be supported, whilst on the programme, by an experienced  school mentor and a University link tutor who will help guide your development, assess your progress and support you to maximise your potential.\r\nThe course is carried out 19 months starting in January 2022 and completes in July 2023\r\nThe course offers:\r\n•\tSchool experience in different primary settings\r\n•\tExcellent preparation to teach all National Curriculum subjects\r\n•\tOpportunity to train as a teacher in the primary phase on a part time basis\r\n•\tA grounding in primary pedagogy across the whole curriculum\r\n•\tResearch-informed teaching\r\nDuring the course, you will:\r\n•\tApply theoretical and practical knowledge and understanding of how children learn and develop in classroom settings\r\n•\tManage different patterns of organisation and styles of teaching to best support effective learning and provide equality of opportunity for all children\r\n•\tDevelop an understanding of SEND through the application of inclusive teaching practices\r\n•\tDevelop and demonstrate the knowledge, skills and teaching competence which will enable you to observe, plan, teach, organise and assess children’s progress and learning across the full primary range\r\n•\tDevelop a clear framework for your own professional values and demonstrate a critical and reflective attitude towards your practice\r\n•\tEvaluate sequences of learning and their impact on pupil progress, linking it to current education research\r\nIndicative course structure (subject to adaptation):\r\n•\tThe Developing Teacher: Covers a wide range of knowledge, skills and understanding required to be an effective, self-evaluating practitioner\r\n•\tThe Learning Child: Covers learning theories, child development and subject pedagogies within the primary curriculum including English, mathematics, science and computing, art, design and technology, geography, history, languages, music, PE, RE and PSHE\r\n•\tLife In School: School Experience with 120-days minimum in school in line with current Department for Education guidance to achieve Qualified Teacher Status\r\n•\tMost weeks will be for three days with a mixture of school placement and university lectures.\r\n\r\n","interviewProcess":"Trainees are recruited through a selection process that includes an initial check to ensure that all entry requirements are met. At interview, you may be asked to:\r\n•\tComplete tasks to establish subject knowledge in English and Maths\r\n•\tEngage in observed professional discussions on a current educational topic\r\n•\tEngage in discussion with primary lecturers/school partners on a range of education-related questions\r\n•\tYou will be encouraged to discuss current issues in primary and/or early years education, policy and practice\r\nApplicants invited for interview will receive a comprehensive interview pack with detailed information about the day. We want all our applicants to feel prepared and ready for the interview process.\r\nApplicants will be informed of the interview panel’s decision once all the necessary paperwork has been processed. \r\nReferences: For your application, you will need two references.\r\n","howSchoolPlacementsWork":"You will have placements in two schools over the duration of the part time course. Your school placements will be within commuting distance.\r\nWhen choosing school placements we will try to take your journey time into consideration.\r\nWe work with a number of partner schools in the local area. Most will be within range of the Welford Primary School, but sometimes they can cover a wider area.\r\nWe work very closely with our extensive range of partnership schools, to provide you with high quality, carefully chosen placements that, alongside your taught programme, prepare you for your first teaching post and Early Career Teacher (ECT) induction period.\r\n","personalQualities":"We are looking to recruit trainee teachers who are excited by the thought of training to teach in a primary school.  Teaching is a challenging profession and trainees need to be enthusiastic about working in a school based setting as well as resilient to the challenges of a demanding course. \r\nYou will inspire, excite and nurture children through a crucial stage of their development and motivate children a providing a safe and secure environment.\r\nYou will motivate and stimulate a child's learning abilities, often encouraging learning through experience preparing them for the start of their primary school years. ","otherRequirements":"All successful applicants will be subject to a full DBS check. ","status":1,"createdAt":"2021-10-05T14:18:36.172Z","updatedAt":"2021-10-05T14:29:33.824Z","canSponsorStudentVisa":"yes","cycle":"2024"}
