{"id":"10c60456-2efe-4f5b-93a9-6c60996ae448","name":"Primary 3-7","code":"V611","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"3_to_7","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"6a234665-e592-4457-a7aa-d4f19b1180a7","name":"WELFORD ON AVON PRIMARY SCHOOL","isPublished":"Y","status":"R","vacancies":"F"},{"id":"cbff8a49-1c4d-4461-8061-3cecf9448113","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"30194b6f-5252-4ab3-a6d5-55e92730bc62","code":"2L6","name":"Welford-on-Avon Primary School"},"accreditedBody":{"id":"6019b3ce-f2f6-4b0e-b2a9-5813d74c4d54","code":"W80","name":"University of Worcester"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"Equivalency tests can be accessed through the University of Worcester","courseLength":"OneYear","feesUK":9250,"feesInternational":13700,"feeDetails":"UK/EU £9,250 ( subject to change during 21/22\r\n\r\nInternational Fees £13,700\r\n\r\n","aboutCourse":"The Arden Forest Teaching Alliance, led by Welford on Avon Primary School is delivering an Early Years School Direct Initial Teacher Training course in association with the University of Worcester beginning September 2021.\r\n\r\nFor the majority of the training year you will based at your ‘host school’.\r\nIn addition, you will spend one term on a complementary placement, in a contrasting school setting.\r\n\r\n\"As a partnership of schools, we are fully committed to offering the best possible support and training to grow the next generation of teachers. We have a wealth of experience and expertise in supporting those new to the profession and feel that our school Direct programme will give teachers the best possible start in their career”\r\n\r\nJulie Leeman – Headteacher, Welford on Avon Primary School\r\n\r\nAlongside your time in school, learning from experienced and highly skilled teachers, you will attend a number of taught sessions led by both the University of Worcester and lead schools from with the partnership, to support your academic practice. \r\nYou will complete a number of Masters level assignments which will further your understanding of effective teaching pedagogies and theories.\r\nYou will be supported, whilst on the programme, by an experienced  school mentor and a University link tutor who will help guide your development, assess your progress and support you to maximise your potential.\r\n\r\nThe course is carried out over a full academic year, starting in September 2021.","interviewProcess":"Further details of the interview progress will be shared with the successful applicants.","howSchoolPlacementsWork":"Successful trainees will be based at one of our partner schools, located in and around South Warwickshire.\r\n\r\nYou will have three school experience placements. SE1 and SE3 will take place in your host school and usually in the same year group ( Nursery or Reception). SE2 will be a contrasting setting and in a Key Stage One classroom.  \r\nThroughout their training we aim to give trainees a broad experience in our Early Years and Key Stage 1 settings. In addition, we will provide short experiences observing and working with our KS2 classrooms. ","personalQualities":"As an Early Years Teacher, you will inspire, excite and nurture children through a crucial stage of their development. Your aim is to motivate children a providing a safe and secure environment for them to develop their social and communication skills.\r\nAs an early years teacher you will motivate and stimulate a child's learning abilities, often encouraging learning through experience preparing them for the start of their primary school years. ","otherRequirements":"All successful applicants will be subject to a full DBS check.","status":1,"createdAt":"2021-07-06T10:56:16.742Z","updatedAt":"2021-10-05T13:10:30.149Z","canSponsorStudentVisa":"yes","cycle":"2024"}
