{"id":"e244a81b-0720-494f-8b46-c06825c85a23","name":"Primary","code":"3BCC","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"cbff8a49-1c4d-4461-8061-3cecf9448113","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"30194b6f-5252-4ab3-a6d5-55e92730bc62","code":"2L6","name":"Welford-on-Avon Primary School"},"accreditedBody":{"id":"6019b3ce-f2f6-4b0e-b2a9-5813d74c4d54","code":"W80","name":"University of Worcester"},"profPost":"PG","degreeGrade":"9","english":"3","maths":"3","science":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"Equivalency Tests can be arranged through the University of Worcester","courseLength":"OneYear","feesUK":9250,"feesInternational":13700,"feeDetails":" Current Fees:\r\n\r\nUK / EU £9,250 (subject to change for 21/22)\r\nInternational £13,700 \r\n\r\n","aboutCourse":"The Arden Forest Teaching Alliance, led by Welford-on-Avon Primary School, is running a School Direct Initial Teacher Training course beginning September 2020. \r\n\r\nThe programme is delivered in association with the University of Worcester, with trainees spending one day a week in University learning the theory and developing the subject knowledge that underpins successful teaching.  The remainder of the time will be spent in school. \r\n\r\nAssessment will come in the form of essays set and marked by the university as well as regular, ongoing assessment of teaching in school.  Lesson observations take place regularly to give trainees constructive feedback about strengths and areas for development.  Every half term there will be a visit from a university based link tutor who will observe with the school based mentor to agree grades and set appropriate future targets. \r\n\r\nSchool based training will take place largely at Welford on Avon Primary School, although other partner schools may be used for specific parts of the training programme. All our partner schools are local and within easy travelling distance of Welford on Avon.\r\n","interviewProcess":"Further details of the interview process will be given to successful applicants. ","howSchoolPlacementsWork":"Successful trainees will be based at either Welford-on-Avon Primary School or another of our partner schools, based in and around South Warwickshire. \r\n\r\nTrainees will be based at their main school throughout the Autumn and Summer term. In the Spring term they will spend a period of several weeks on a complementary placement at another of our partner schools to broaden their experience and work in a contrasting setting.  \r\n\r\nThroughout their training we aim to give trainees a broad experience of working in both of the primary school phases - Key Stage 1 (5-7) and Key Stage 2 (7-11). ","personalQualities":"We are looking to recruit trainee teachers who are excited by the thought of training to teach in a primary school.  \r\n\r\nTeaching is a challenging profession but one that can be very rewarding.  Trainees need to be enthusiastic about working in a school based setting as well as resilient to the challenges of a demanding course. ","otherRequirements":"All successful applicants will be subject to a full DBS check. ","status":1,"createdAt":"2021-07-06T10:56:16.706Z","updatedAt":"2021-10-05T13:12:44.564Z","canSponsorStudentVisa":"yes","cycle":"2024"}
