{"id":"aff763da-1a50-4a3c-803a-a24c9e29c28d","name":"Religious Education","code":"339J","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"724b5d16-28dd-4431-bc17-ea4be4daedc4","code":"V6","name":"Religious education"}],"locations":[{"id":"ba841e88-d26b-4b02-9686-524b45085208","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"},{"id":"b679e58c-6d24-4255-a229-5f6005e6fde6","name":"The King's School","isPublished":"Y","status":"R","vacancies":"F"},{"id":"4c490e96-dd63-483e-8eec-150650a22cd6","name":"Sir John Colfox","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"62d17cdf-cd81-4969-af49-abd98a8142ce","code":"172","name":"Jurassic Coast Teacher Network"},"accreditedBody":{"id":"d41a1821-e35b-48eb-bf02-4842872b04a2","code":"E84","name":"University of Exeter"},"profPost":"PG","degreeGrade":"1","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We accept equivalency tests from A Star Equivalency and equivalencytesting.com (please do contact us for further guidance before signing up for an equivalency test).","courseLength":"OneYear","feesUK":9250,"feesInternational":19500,"financialSupport":"For information on Government loans and training bursaries, please visit the Student Finance England (https://www.gov.uk/student-finance) and Get into Teaching (https://getintoteaching.education.gov.uk/) websites.\r\n\r\nFor more information, please see our Fees and finance webpages\r\n(https://www.exeter.ac.uk/teachertraining/apply/feesandfinance/)","aboutCourse":"This course is a School Direct @Exeter programme. This means that you will attend the taught PGCE programme at the university.  You are registered with the university and are eligible for training bursaries and student loans. You will be  based in school in September, before the taught course begins, and then will have interspersed days at the University during your placements.  The majority of the spring and summer terms is spent at your home home school, with a second placement of approximately six weeks at another local school.\r\n\r\nThe programme has three fully integrated components:\r\n\r\nSecondary Education and Professional Studies Module\r\nThe Professional Studies component introduces you to key educational ideas and principles within a range of educational contexts. The module is followed throughout the year with both University and school-based elements and is concerned with classroom issues, whole school issues and the role of education in the wider society.\r\n\r\nSecondary Professional Learning Module\r\nCentral to school-based work is the development of your ability to meet the standards of professional competence which trainees must demonstrate in order to meet national standards for the award of QTS.\r\n\r\nSecondary Religious Education Subject Knowledge and Pedagogy Module\r\nThe principal aims of the module are to equip students with a comprehensive understanding of the background issues and practice of the current teaching of RE in the secondary school.   In addition, the module seeks to nurture reflective and autonomous professional practitioners who are able to identify strengths and areas for development in their subject knowledge and pedagogy, through evaluating current professional practice in relationship to developments in research and curriculum theory.\r\n\r\nFor further information about this course please see https://www.exeter.ac.uk/teachertraining/\r\n\r\n\r\n","interviewProcess":"Interviews will take place in the home school. You will be interviewed by the head of department, a member of the leadership team and a teacher with responsibility for initial teacher training. Before the interview day, but as part of the interview process, you will be expected to arrange a visit to the school. On the interview day itself you will be asked to observe a lesson and discuss what you notice and you will be asked to work with a small group of students for part of a lesson, supporting them through an activity prepared by their teacher.","howSchoolPlacementsWork":"Schools within the JCTN identify the subjects in which they wish to train a teacher. This means that biology is only offered in those specific schools. If you are offered and accept a place in that school, it then is designated as your home school and the bulk of your teaching practice will take place there.   In addition to your home placement, you will have a second placement that will be in a different school within the network.  All of our schools are located in West Dorset, Chard and East Devon.  All of the placement schools are designated as good or outstanding by Ofsted and there is opportunity for 16-18 experience if desired.\r\n\r\n\r\n\r\n\r\n","personalQualities":null,"otherRequirements":null,"status":1,"createdAt":"2021-07-06T10:49:18.605Z","updatedAt":"2021-10-04T14:46:59.396Z","canSponsorStudentVisa":"yes","cycle":"2024"}
