{"id":"e5753c41-d898-4efd-a95b-848ba83bc80b","name":"Primary","code":"25TH","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"5_to_11","subjectLevel":"primary","isSend":"no","subjects":[{"id":"32a27d4b-8216-4498-9e7c-ddfba0a38a00","code":"00","name":"Primary"}],"locations":[{"id":"b7f520cf-9ede-445e-972b-e8b499d2e061","name":"Acorn Federation","isPublished":"Y","status":"R","vacancies":"F"},{"id":"d4b46659-b3a1-4b91-9f4d-73bab81742d7","name":"Redstart Teaching Alliance","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"62d17cdf-cd81-4969-af49-abd98a8142ce","code":"172","name":"Jurassic Coast Teacher Network"},"accreditedBody":{"id":"d41a1821-e35b-48eb-bf02-4842872b04a2","code":"E84","name":"University of Exeter"},"profPost":"PG","degreeGrade":"0","english":"1","maths":"1","science":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","acceptScienceGcseEquivalency":"yes","additionalGcseEquivalencies":"We accept equivalency tests from A Star Equivalency and equivalencytesting.com (please do contact us for further guidance before signing up for an equivalency test).","courseLength":"OneYear","feesUK":9250,"feesInternational":19500,"financialSupport":"For information on Government loans and training bursaries, please visit the Student Finance England (https://www.gov.uk/student-finance) and Get into Teaching (https://getintoteaching.education.gov.uk/) websites.\r\n\r\nFor more information, please see our Fees and finance webpages\r\n(https://www.exeter.ac.uk/teachertraining/apply/feesandfinance/)","aboutCourse":"This course is a School Direct @Exeter programme. \r\n\r\nThe programme has four main components\r\n\r\n1. Curriculum studies\r\nThere is substantial preparation for teaching the core subjects of English, Mathematics, and Science through taught sessions combined with self-directed activities based both in the University and carried out in school. There is a particular emphasis on the teaching of writing, reading and mathematics to reflect the government’s current educational priorities. This module also covers the subjects of Art, Computing, Design Technology, Geography, History, Modern Languages, Music, Physical Education, and Religious Education, which are all delivered in shorter practical courses. These courses cater for trainees whose previous experiences may vary widely and aim to give a substantial introduction to the teaching of these subjects.\r\n\r\n2. Educational and Professional Studies\r\n\r\nThe module content is designed to enable critical reflection on children’s learning and development, pedagogy, diversity, and teachers’ roles and responsibilities in multi-professional contexts. There is engagement with relevant government reports, policies and academic research in order to develop appraisal of contemporary social trends, and issues in theory and practice. The content of the module is inter-dependent with other modules in the programme, and will be developed in the professional studies element of school experience settings, where you will consider the practical implementation of educational principles and policies.\r\n\r\n3. School experience\r\n\r\nThe University has excellent working relationships with its partnership schools, where trainees will be based for their school experience. School-based tutors and mentors are responsible for trainees’ learning and development and receive well-designed training. Trainees will initially work with groups of children, before taking on more responsibility for planning and independently teaching the whole class. There will be two main placement schools assigned and these will offer contrasting environments.\r\n\r\n4. Pathway module (specialist or generalist)\r\n\r\nPrimary trainees will receive training in a chosen subject specialism from Art, English, Humanities, Mathematics, Modern Languages, and Science. The specialism builds on your subject knowledge strengths (from your degree or A levels) and aims to prepare you for an eventual role as subject leader or coordinator. Alternatively, we also have a generalist pathway, ‘Primary Teaching and Learning’, which will develop your knowledge, understanding and skills in research-inspired primary teaching and learning across the whole 5-11 curriculum.\r\n\r\nIt includes two assessments at Masters level, work a total of 60 credits.\r\n","interviewProcess":"Interviews will take place in the home school. You will be interviewed by the head of department, a member of the leadership team and a teacher with responsibility for initial teacher training. Before the interview day, but as part of the interview process, you will be expected to arrange a visit to the school. On the interview day itself you will be asked to observe a lesson and discuss what you notice and you will be asked to work with a small group of students for part of a lesson, supporting them through an activity prepared by their teacher.","howSchoolPlacementsWork":"Schools within the JCTN identify the subjects in which they wish to train a teacher. This means that biology is only offered in those specific schools. If you are offered and accept a place in that school, it then is designated as your home school and the bulk of your teaching practice will take place there.   In addition to your home placement, you will have a second placement that will be in a different school within the network.  All of our schools are located in West Dorset, Chard and East Devon.  All of the placement schools are designated as good or outstanding by Ofsted and there is opportunity for 16-18 experience if desired.\r\n\r\n\r\n\r\n\r\n\r\n","personalQualities":"","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:49:18.324Z","updatedAt":"2021-10-04T14:44:11.827Z","canSponsorStudentVisa":"yes","cycle":"2024"}
