{"id":"f5e6e73a-05da-41fe-9590-7d676f9a30ab","name":"Geography","code":"2NM4","qualification":"pgce_with_qts","startDate":"2023-09-01T09:00:00.000Z","applicationsOpenDate":"2022-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"3f47e67b-7fa5-4947-a5a0-74d528cd2a87","code":"F8","name":"Geography"}],"locations":[{"id":"ba841e88-d26b-4b02-9686-524b45085208","name":"Main Site","isPublished":"Y","status":"R","vacancies":"F"},{"id":"455727f3-3480-4a68-9bbe-284b0f025faf","name":"Beaminster School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"62d17cdf-cd81-4969-af49-abd98a8142ce","code":"172","name":"Jurassic Coast Teacher Network"},"accreditedBody":{"id":"d41a1821-e35b-48eb-bf02-4842872b04a2","code":"E84","name":"University of Exeter"},"profPost":"PG","degreeGrade":"0","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We accept equivalency tests from A Star Equivalency and equivalencytesting.com (please do contact us for further guidance before signing up for an equivalency test).","courseLength":"OneYear","feesUK":9250,"feesInternational":19500,"financialSupport":"For information on Government loans and training bursaries, please visit the Student Finance England (https://www.gov.uk/student-finance) and Get into Teaching (https://getintoteaching.education.gov.uk/) websites.\r\n\r\nFor more information, please see our Fees and finance webpages\r\n(https://www.exeter.ac.uk/teachertraining/apply/feesandfinance/)","aboutCourse":"This is a fee-paying distance learning course. This means that you will not attend seminar days or an induction period at The University of Exeter but will instead spend your whole time in school. You home school will plan your  subject learning programme and the professional studies element will be delivered through online learning. The geography departments who will train you are outstanding and you will have the opportunity to observe excellent practice in all aspects of the subject.\r\n\r\nIt includes two assessments at Masters level, worth a total of 60 credits.\r\n\r\nFor further information about this course please see https://www.exeter.ac.uk/teachertraining/\r\n","interviewProcess":"Interviews will take place in the home school. You will be interviewed by the head of department, a member of the leadership team and a teacher with responsibility for initial teacher training. Before the interview day, but as part of the interview process, you will be expected to arrange a visit to the school. On the interview day itself you will be asked to observe a lesson and discuss what you notice and you will be asked to work with a small group of students for part of a lesson, supporting them through an activity prepared by their teacher.","howSchoolPlacementsWork":"Schools within the JCTN identify the subjects in which they wish to train a teacher. This means that biology is only offered in those specific schools. If you are offered and accept a place in that school, it then is designated as your home school and the bulk of your teaching practice will take place there.   In addition to your home placement, you will have a second placement that will be in a different school within the network.  All of our schools are located in West Dorset, Chard and East Devon.  All of the placement schools are designated as good or outstanding by Ofsted and there is opportunity for 16-18 experience if desired.\r\n\r\n\r\n","personalQualities":"","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:49:18.497Z","updatedAt":"2021-10-04T14:48:30.514Z","canSponsorStudentVisa":"yes","cycle":"2024"}
