{"id":"4052c4eb-8e09-4955-93b9-0d0d0b869ba9","name":"Chemistry","code":"33JR","qualification":"pgce_with_qts","startDate":"2024-07-31T23:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"912d4fb4-761b-42e9-8dc6-e968b791ea4e","code":"F1","name":"Chemistry"}],"locations":[{"id":"5eefe8b8-5e38-44dc-a572-36dbb14760f1","name":"Alderbrook","isPublished":"Y","status":"R","vacancies":"F"},{"id":"a4edef3e-4a08-4f6b-bb68-401752744577","name":"St. Peter's Catholic School","isPublished":"Y","status":"R","vacancies":"F"}],"trainingProvider":{"id":"16d63b18-f640-4267-abfe-989ef4c2f7ef","code":"17Y","name":"St Peter’s Solihull Teaching School Alliance"},"accreditedBody":{"id":"ef09ce50-ccfc-4346-a0ce-43e840153dab","code":"W20","name":"The University of Warwick"},"profPost":"BO","degreeGrade":"1","english":"1","maths":"1","acceptPendingGcse":"no","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feeDetails":"\r\n\r\nFor non-salaried courses, the trainee is expected to fund the tuition fees. Please refer to the University for specific information regarding their fees.\r\n\r\nhttps://www.newman.ac.uk/knowledge-base/school-direct-qts/\r\n\r\nhttps://warwick.ac.uk/fac/soc/cte/start-teaching/secondary/\r\n\r\nBursaries are available in some subjects. Further information regarding bursaries can be found here:\r\n\r\nhttps://www.gov.uk/guidance/funding-initial-teacher-training-itt-academic-year-2019-to-2020  \r\n\r\n\r\n","financialSupport":"For salaried trainees, The Host School will pay the University fees.","aboutCourse":"On our School Direct programme, you gain \"hands on\" experience of teaching in a school with the added benefit of academic post-graduate study through the University. Rest assured that we don't throw you in at the deep end! You start by observing excellent practice in a range of subjects to help you develop an understanding of what outstanding teaching and learning looks like. Then gradually you start teaching - perhaps a starter or part of a lesson at first - until you feel confident and competent enough to take whole lessons by yourself. By the end of the training year, you'll be teaching just under what an NQT teaches. \r\n\r\nBeing on a school-led programme means you get the benefit of being a member of staff from the outset; you will support a form group, to help develop your pastoral experience, and will engage in all aspects of school life - curriculum, pastoral and social. You will receive excellent subject knowledge development from your mentor and other teachers in school. \r\n\r\nYou spend the equivalent of one day a week at University, developing pedagogical understanding, and the rest of the week in school. As part of the programme, you will complete a second placement in a different school. In school, you will receive a weekly mentor meeting as well as weekly training to enhance your professional development.\r\n\r\nWhilst in school, you are regularly observed by members of staff and University tutors to help you develop and progress. Assessment forms are completed half-termly and you will have academic assignment deadlines for the University.\r\n\r\nWe have trained teachers for many years and have an excellent track record. We are different to many other providers in that we are a relatively small Alliance; this means we know all of our trainees well and can offer bespoke and personalised programmes to meet their needs. We are passionate about what we do and love working with the next generation of teachers!\r\n","interviewProcess":"If you are invited to interview, this will take place in school. The interview will comprise of three main parts:\r\n* Teaching a micro lesson to a class of pupils\r\n* Completing diagnostic tests\r\n* A panel interview\r\n","howSchoolPlacementsWork":"We have a range of schools within our Alliance including primary schools, 11-16 secondary schools and 11-18 secondary schools. When you apply for a place within our Alliance, you specify which school (sometimes known as a \"campus\") you would like to work at. We try to place you in your chosen school wherever possible. If you are selected for interview, your interview will be at that school. In the event that a training place has already been filled at your chosen school, you may be offered the opportunity to train at a different school (if applicable).\r\n\r\nTrainees will be based in their main school for the vast majority of the year. Primary trainees complete one term in a second school; secondary trainees complete one half-term in second school. All trainees will also have the opportunity to attend short placements in different phase schools.\r\n","personalQualities":"The keys qualities we look for in a trainee are enthusiasm, passion and commitment. We want to work with people who love their subject, enjoy being part of a team and who want to make a real difference to the lives of young people. For us, potential is more important than experience. Oh, and a good sense of humour is also essential in the teaching profession!","otherRequirements":null,"status":1,"createdAt":"2021-07-06T10:47:43.129Z","updatedAt":"2021-07-25T15:49:41.038Z","canSponsorStudentVisa":"yes","cycle":"2024"}
