{"id":"5afcfa74-76d8-420a-807f-f2914af11712","name":"Physics","code":"38BC","qualification":"pgce_with_qts","startDate":"2024-07-31T23:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SC","studyMode":"B","ageRange":"11_to_16","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"bf97cd0a-224c-43d3-a021-84143df13e8d","code":"F3","name":"Physics"}],"locations":[{"id":"498c7cf1-8b16-4cc4-a339-9d33731cb020","name":"South Manchester Hub","isPublished":"Y","status":"R","vacancies":"B"},{"id":"cfe84ea9-77ff-4dd2-a7b4-d69c113db1ab","name":"Humberside & Lincolnshire Hub","isPublished":"Y","status":"R","vacancies":"B"},{"id":"3cabe92a-f753-4f72-aa97-b029f253fa3d","name":"North London Hub (Barnet)","isPublished":"Y","status":"R","vacancies":"B"},{"id":"96deb529-33b4-487b-918b-4c6a4f89819f","name":"North London Hub (Camden)","isPublished":"Y","status":"R","vacancies":"B"},{"id":"0a6d7b50-766d-4fb2-adfb-38e8ff584834","name":"Guildford Hub","isPublished":"Y","status":"R","vacancies":"B"},{"id":"a518d286-55df-4f92-8aed-389e1dd2f601","name":"Bolton Hub","isPublished":"Y","status":"R","vacancies":"B"},{"id":"e22ee7ed-e568-466f-a780-3e487a1186fc","name":"Dulwich Hub","isPublished":"Y","status":"R","vacancies":"B"},{"id":"29ddd31b-346a-4c27-956b-789624f5b454","name":"Warwick Hub","isPublished":"Y","status":"R","vacancies":"F"},{"id":"b5e2f30c-d1d2-4ebe-929d-cae882663ab2","name":"Chiltern Hub (High Wycombe)","isPublished":"Y","status":"R","vacancies":"B"},{"id":"c7c09b5b-baf4-4f73-a5ae-5049a9a40103","name":"East Midlands Hub","isPublished":"Y","status":"R","vacancies":"B"},{"id":"dbe7655a-d316-4648-aeeb-b2c6cbc3be01","name":"Oundle Hub","isPublished":"Y","status":"R","vacancies":"B"},{"id":"cda75b07-5a2e-4e80-9576-57b6e033170d","name":"Chiltern Hub (Oxford)","isPublished":"Y","status":"R","vacancies":"B"}],"trainingProvider":{"id":"8fc9b0c3-acaf-447c-adb7-dd93bf530a8e","code":"2H8","name":"The National Mathematics and Physics SCITT"},"profPost":"PG","degreeGrade":"1","additionalDegreeSubjectRequirements":"true","degreeSubjectRequirements":"If your degree is in another subject, you will need a solid A level (or overseas equivalency verified by ENIC) in Physics and may be required to undertake some subject specific training where current subject knowledge is not well-developed. In exceptional circumstances we may consider applicants with third class degrees, if their degree is in Physics, but should they be successful, applicants will not be entitled to a bursary or scholarship.","english":"3","maths":"3","acceptPendingGcse":"yes","acceptGcseEquivalency":"yes","acceptEnglishGcseEquivalency":"yes","acceptMathsGcseEquivalency":"yes","additionalGcseEquivalencies":"We accept the following equivalency tests: \n\n*  https://www.equivalencytesting.com \n*  https://astarequivalency.co.uk/\n*  https://www.pearsonpte.com/pte-academic\n*  https://www.ielts.org/ (with a grade of 7 or above, which must have been awarded within the last two years).","courseLength":"1 year full time or 2 years part time","feesUK":9250,"aboutCourse":"[The National Mathematics and Physics SCITT (NMAPS)](http://www.nmapscitt.org.uk/), led by [Wycombe High School](https://www.whs.bucks.sch.uk/), offers high quality specialist teacher training. School placements are in an extensive network of state and independent schools, clustered around each of our [Regional Training Hubs](http://www.nmapscitt.org.uk/partnership-structure/). The course is offered Full or Part Time - please see our website for further details on [Part Time options](https://www.nmapscitt.org.uk/part-time-training/).\r\n\r\nBecause we only offer training in Maths and Physics, you will benefit from a bespoke programme focused on your subject, with enhanced specialist subject knowledge and pedagogical training to ensure your career gets off to a flying start.  Trainees will gain teaching experience with students aged 11-16 and sixth form.\r\n\r\nTo prepare for their ITT year, all trainees are required to attend our 3 day Induction Course (end of August 2022) at [Headington School](https://www.headington.org/) in Oxford.  \r\n\r\nSubject Knowledge and Professional Studies training is delivered by tutors who have been chosen because of the high quality of their own teaching practice and experience. These weekly sessions will be delivered in your local Hub School and will develop your subject specific pedagogical skills and theories of education. Trainees will be individually supported by a mentor from their placement school who they will meet weekly to discuss progress and offer support. \r\n\r\nThe NMAPS programme allows trainee teachers to develop an understanding of their pupils, the education system in England today and to experience first-hand collaboration between the state and independent sectors. \r\n\r\nDuring the spring term we would expect all our trainees to be making good progress and be on track to achieve QTS. Trainees will build an on-line portfolio of evidence to show the progress they have made, using our bespoke programme. \r\n\r\nOn successful completion of the training year, trainees are awarded QTS by NMAPS and a PGCE (Post Graduate Certificate in Education) by [The University of Buckingham](https://www.buckingham.ac.uk/), England's only independent university and highly acclaimed by its students. \r\n\r\nThe programme also provides regular professional networking and social opportunities, based in English cities including London, throughout the PGCE training year and beyond. Links with key professional associations, including [The Institute of Physics](https://www.iop.org/), [The Mathematical Association](https://www.m-a.org.uk/) and [The National Centre for Excellence in the Teaching of Mathematics (NCETM)](https://www.ncetm.org.uk/) will provide on-going high quality professional development.\r\n\r\nThe trainees' relationship with NMAPS does not end with gaining QTS and a PGCE; former trainees continue to benefit from a range of alumni events and career support.\r\n","interviewProcess":"The NMAPS recruitment process is a rigorous and thorough process, normally lasting half a day and designed to match the best candidates appropriately to the places available. \r\n\r\nThe selection process will be led by NMAPS staff and, where possible, a subject knowledge expert from the school offering the main training place; it will comprise: \r\n* A 30-minute teaching activity to establish the applicant's ability to engage and communicate with young people.\r\n* A 30-minute written subject knowledge task. \r\n* A  20-minute written communication task.\r\n* A 45-minute interview to determine the applicant's aptitude for teaching in terms of intellectual and academic capabilities and the personal qualities, values and ethics needed to work in a school setting. The interview will also explore the applicant's resilience, time-management and organisational skills; it will include a subject knowledge conversation, led by the relevant subject leader, to ascertain the applicant's potential to meet the Teachers' Standards by the end of their training. \r\n \r\nIf you are successful at interview, a conditional offer of a place will be made. Conditions will include: verification of your qualifications, a criminal record check (DBS) and an on-line occupational health assessment. Further conditions, such as Subject Knowledge Enhancement (SKE) training  may be discussed with you at interview as appropriate.\r\n\r\nInterviews take place in person but, due to on-going issues with Coronavirus, may take place on-line if circumstances dictate. \r\n","howSchoolPlacementsWork":"We carefully match trainees to placement schools, taking into consideration location and individual trainee needs. \r\n\r\nThe majority of time will be spent in the main placement school, with a second placement in a contrasting school. Full time trainees will spend four days a week in school, supported by a subject mentor, who they will meet with every week; this will vary for part time trainees. \r\n\r\nSubject Knowledge and Professional Studies training will take place on the fifth day in their local Hub Lead School.\r\n\r\nAdditional short placements will ensure that trainees gain exposure to the full range of English teaching organisations: state comprehensive and selective schools; independent, primary and special schools; and pupil referral units. Trainees will gain teaching experience across all key stages, including Sixth Form. \r\n\r\n","personalQualities":"We are looking for ambitious trainee teachers who are passionate and enthusiastic about their subject with a desire to share that with young people of all abilities. Applicants should be confident and articulate communicators, who are keen to contribute to their subject team and the wider school community. \r\n\r\nPrevious school experience is not required, but applicants are advised to give details of all meaningful experience of working with young people. This may be school experience, but could also include any unpaid volunteering with, for example, a sports team, drama or youth club. ","otherRequirements":"DBS Clearance and Occupational Health Check - all applicants will be required to undergo Disclosure Barring Service (DBS) and Enhanced Disclosure checks and an on-line Occupational Health Check. If you have lived overseas in the last 10 years additional checks are likely to be required. \r\n\r\nEnglish Language proficiency requirements - applicants must demonstrate an excellent command of both written and spoken English. \r\n\r\nPlease visit our website for further details.\r\n","status":1,"createdAt":"2021-07-06T10:48:42.606Z","updatedAt":"2021-09-21T09:30:19.770Z","cycle":"2024","fundingType":"fee","canSponsorStudentVisa":"no"}
