{"id":"0eea8273-a14b-4416-9a8b-9240c7bf341a","name":"Art and Design","code":"3DYT","qualification":"pgce_with_qts","startDate":"2024-09-01T09:00:00.000Z","applicationsOpenDate":"2023-10-12T00:00:00.000Z","programType":"SD","fundingType":"fee","studyMode":"F","ageRange":"11_to_18","subjectLevel":"secondary","isSend":"no","subjects":[{"id":"d461a678-3335-4ca2-9616-1dc479d31a49","code":"W1","name":"Art and design"}],"locations":[{"id":"4ac99124-7d80-4d62-aa54-51d43e03a2c6","name":"Main Site","isPublished":"Y","status":"R"}],"trainingProvider":{"id":"133b003d-f8ce-44db-be1d-16cb0e481800","code":"1LJ","name":"Collingwood College"},"accreditedBody":{"id":"6439adcc-af64-4d3d-a1da-de045755db06","code":"R12","name":"The University of Reading"},"profPost":"PG","degreeGrade":"0","additionalDegreeSubjectRequirements":"false","english":"1","maths":"1","acceptPendingGcse":"yes","acceptGcseEquivalency":"no","acceptEnglishGcseEquivalency":"no","acceptMathsGcseEquivalency":"no","courseLength":"OneYear","feesUK":9250,"feeDetails":"Please check the University's website for the latest information on fees.","aboutCourse":"This is an excellent course where the majority of your time is spent in the main school and department area that you have applied for.  Collingwood College is a very high performing school with excellent GCSE and A Level results and so you will be developed by experienced practitioners.  An additional 30 days are spent at the University of Reading and there will be a five week placement in one of our partner schools.\r\n\r\nYou will have a subject mentor who will meet with you weekly to review your progress.  You will also have an ITTCO who you will also meet with weekly where you will have a seminar style discussion on issues to do with pedagogy and applying the theory to the classroom.\r\n\r\nYou will be assessed against the teaching standards termly, by way of a formal lesson observation and a review of your best evidence.  This is a supportive process and prepares you effectively for your NQT year.\r\n\r\nWe also arrange for you to spend some time in a Primary school and support the University's Enrichment programme.\r\n\r\n","interviewProcess":"We like to keep the interview process as informal as possible and we recognise that you are applying to train to teach and so we therefore do not ask you to \"teach\" part of a lesson as part of the process.\r\n\r\nInstead, we ask you to come in for half a day where you will have a tour of the site, meet with the department and have an Interview with the Assistant Principal in charge of Learning and Teaching and the Head of Department.  In some instances we ask for the subject leader from the University to attend as well in order to quality assure our work.\r\n\r\nWe also ask you to prepare a short presentation on an issue that will be given to you on the day.  In addition you will be required to complete a written task.","howSchoolPlacementsWork":"In most cases you will select your main school from a choice of the five in our partnership - Collingwood College, Kings International, The Bishop David Brown School, The Magna Carta School and The Winston Churchill School.  Your second placement will also be from a choice of one of these and wherever possible we try to accommodate your preferences and take into account any geographical/travel issues.\r\n\r\nAt Collingwood College you will teach across KS3, KS4 and KS5. The other schools in our partnership are 11-16.","personalQualities":"Above all else, we are looking for someone who is passionate about teaching and working with young people.  Whilst subject knowledge is important, for us we are looking for someone who is confident, dynamic and someone who can inspire young people.  A sense of humour is also vital!","otherRequirements":"","status":1,"createdAt":"2021-07-06T10:49:35.248Z","updatedAt":"2021-10-21T16:00:26.127Z","canSponsorStudentVisa":"yes","cycle":"2024"}
